{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jackie Shroff",
            "url": "/name/nm0006763/"
        },
        {
            "@type": "Person",
            "name": "Madhuri Dixit",
            "url": "/name/nm0002043/"
        },
        {
            "@type": "Person",
            "name": "Jaaved Jaaferi",
            "url": "/name/nm0412917/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1103,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0085738/"
        },
        {
            "@type": "Person",
            "name": "Bhushan Banmali",
            "url": "/name/nm0052284/"
        },
        {
            "@type": "Person",
            "name": "Devjyoti Roy",
            "url": "/name/nm1551623/"
        }
    ],
    "datePublished": "1991-05-31",
    "description": "A young, clairvoyant woman has a vision of a murder and sets out to uncover the truth before the killer finds her.",
    "director": [
        {
            "@type": "Person",
            "name": "Partho Ghosh",
            "url": "/name/nm0315912/"
        }
    ],
    "duration": "PT2H41M",
    "genre": [
        "Horror",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjY3OTMzZDEtMjc2Zi00OWRhLTkzOTgtOGY4OTg0ZGYzM2UwXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "skeleton,love triangle,love,arrest,giallo",
    "name": "100 Days",
    "original_info": {
        "id": "100 Days_1991",
        "name": "100 Days",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-04-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101244/"
        },
        "name": "Great traditional Bollywood thriller",
        "reviewBody": "Devi (Madhuri Dixit) is a \"precog\", or precognizant--she gets visions of some events before they occur. Near the beginning of the film she receives a vision of her sister, Rama (Sabeeha), being killed, so she desperately tries to stop what she believes is inevitable. Before she can take action, her sister disappears. We move five years into the future. After accidentally ending up at the wrong wedding, Ram Kumar (Jackie Shroff) sees Devi and falls in love. He buys the bungalow next to Devi's and courts her. Soon after, Devi begins receiving another vision of a woman being murdered--only this time she doesn't know the identity of the victim. Can she find out who the woman is before it is too late? \n\nFor a film that is occasionally very schizophrenic, 100 Days holds together extremely well, even seeming tightly focused overall. The disparate elements come by way of the typical range of genres in a Bollywood film. For example, in the middle of the opening thriller material, all of a sudden director Parto Ghosh breaks out into goofy musical number, complete with faux-action/adventure/crime elements interspersed with pie throwing and a fashion display that's right out of a Kajagoogoo video--in other words, heavy 1980s style ala leg warmers, big hair, skinny ties and so on. Then for much of the first hour or so, 100 Days becomes more of a light romantic comedy. The thriller material returns stronger in the second half, although the musical numbers still tend to lighten the mood more than they ideally should.\n\nThe tone of the film, then, is a strong contrast to some of the work of other Indian horror/thriller directors such as Ram Gopal Varma, who has famously forgone musical numbers in films such as Raat (1992), as has Guddu Dhanoa in films such as Hawa (2003). But Ghosh manages to tie everything together so that the romantic elements, musical numbers and comic relief (especially in characters such as Balam, played by Laxmikrant Berde) not only provide a balance for the more intense material, but seem integral to the film--100 Days wouldn't be quite as good as it is in absence of any of its varied moods. Heck, Ghosh even makes repeated footage seem as if it's necessary rather than just being padding.\n\nAnd of course these different elements help set 100 Days apart from its precursor on the horror/thriller end, Lucio Fulci's Sette note in nero (1977), which also has elements of Edgar Allan Poe's short story \"The Black Cat\" (originally published in 1843). Ghosh also adds a number of interesting, recurring motifs, such as the pervasive conch shells, the statues/taxidermy specimens and the water symbolism, which helps bring to mind later films with a relation to \"The Black Cat\", such as Byeong-ki Ahn's Phone (2002).\n\nThe performances throughout are very good. Of course it's primarily up to Dixit to help tie all of the threads together, but she receives a lot of help from Shroff, Berde, Javed Jaffrey as Devi's friend Sunil, and Jay Kalgutar as Jagmohan. At first I was lamenting Berde's relative absence later in the film, but as he's strictly comic relief, this was necessary. By the end, Ghosh is only concerned with increasing a roller coaster-like intensity, which he does effectively. Rather than continuing comic relief, he adds other elements to the overarching thriller atmosphere, such as a big action scene set in a junkyard that showcases some impressive stunts.\n\nAnyone who is a fan of the average Bollywood film and who also likes western thrillers should enjoy 100 Days.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0101244/"
}