{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Teri Hatcher",
            "url": "/name/nm0000159/"
        },
        {
            "@type": "Person",
            "name": "Jeff Daniels",
            "url": "/name/nm0001099/"
        },
        {
            "@type": "Person",
            "name": "Danny Aiello",
            "url": "/name/nm0000732/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20899,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030480/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0146293/"
        },
        {
            "@type": "Person",
            "name": "John Herzfeld",
            "url": "/name/nm0381273/"
        }
    ],
    "datePublished": "1996-09-27",
    "description": "48 hours of intersecting lives and crimes in Los Angeles.",
    "director": [
        {
            "@type": "Person",
            "name": "John Herzfeld",
            "url": "/name/nm0381273/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDI0ZmFmYTgtMTQ5OS00MTVmLTgwNWYtNzIyY2Y5NjYxNzgyXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "art dealer,insurance fraud,mobster,marital separation,surveillance",
    "name": "2 Days in the Valley",
    "original_info": {
        "id": "2 Days in the Valley_1996",
        "name": "2 Days in the Valley",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mattymatt4ever"
        },
        "dateCreated": "2001-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115438/"
        },
        "name": "One of the best movies that nobody's seen!",
        "reviewBody": "Unfortunately, \"2 Days in the Valley\" didn't get a big audience. I saw it in theaters and enjoyed it very much, and now that I bought the DVD I still enjoy it very much! This is really a unique, original piece of work with echoes of Tarantino. Just like any Tarantino film, the characterizations are very well-developed and the dialogue is sharp, witty and full of observation. \n\nThe film is an ensemble piece that works on the same level as many others in the genre: We're approached with a series of characters and as the story develops, we watch how the situations all interweave. The result is a hilarious, drop-dead funny dark comedy that's entertaining from start to finish! The music by Anthony Marinelli perfectly accentuates the ironic, darkly comic setting. \n\nOne of the crucial elements to make a film like this work is, of course, the characters. Each character is quirky in their own respect, yet they're not caricatures. This is not a farce; this is a real comedy about real people who are really screwed up. We probably know some of these people in our personal lives. And the wonderful cast of multi-talented performers shine in each of their respective roles. Danny Aiello is definitely one of our best actors, with an intense screen presence. He blesses us with another memorable performance as a hitman-turned-pizzeria-owner, who takes a yuppie couple (Glenne Headley, Greg Crutwell) hostage. Headley is a mousey, ultimately naive woman who does everything for, yet ceases to please, her mate--Crutwell as an annoyingly snooty Englishman with kidney problems. You want to cheer in every scene Aiello yells in his face or punches him out. Former teen star Eric Stoltz is good in a quiet role as a rookie detective, who's a little held-back but knows what's right. Jeff Daniels is beautifully cast and outstanding as his partner, who's been in the business for a lot longer, but is a loose cannon and will do absolutely anything--including exposing the masseuses of a Japanese parlor for alleged prostitution--to protect the dear \"Valley.\" James Spader has mastered the role of the yuppie serial killer, and reprises the role he was born to play. He's smooth as ever and sadistic as ever. That's the Spader we know! Charlize Theron is the sexiest in her debut role as Spader's seductive partner. If you want to see the beautiful Charlize at her absolute hottest--look no further! Paul Mazursky--who I've seen in other movies, but doesn't quite stick in my mind--has a nice little supporting role as a washed-up screenwriter. I'll probably have him better stored in my memory after seeing him in this movie, he really is terrific. Finally, we have veteran actress Marsha Mason as a nurse, whose half brother is Crutwell. And there we go--the characters interweave. Each character has an odd sense of irony, which is what's wonderful about this movie.\n\nThe only minor flaws are the sometimes-contrived ways of merging the characters into different situations and the excess of characters. There are tons of characters, and though they are all greatly developed in their own particular scenes, the running time prohibits us from getting to know the whole story on some of them--and that's a little bit of crutch, since we grow to love (or love to hate) all these characters. For example, I wanted to see more of Daniels' character and his story comes to a halt midway. \n\n Nevertheless, I was laughing all the way through and never once felt that the film lagged. I was surprised to look at John Herzfeld's (the writer/director) filmography and see a group of TV movies, after-school specials and a few flops, including \"Two of a Kind\" with John Travolta and Olivia Newton-John. Herzfeld really has an ear for dialogue, and he can be the next Tarantino! I'm not kidding! And I love the way he captures the sunny California setting. So beautiful and picturesque. I know I'm using a lot of superlatives to describe this movie, but it's so darn good and so few people went to see it and I hope more people do. So I urge anyone who hasn't to check out this underrated gem! You won't be disappointed! \n\n My score: 8 (out of 10)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3695886617",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDIwNGU1MzUtYzg3Ni00ZjUxLWE2N2EtOTg5ZTYyMGI1ZDhkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDIwNGU1MzUtYzg3Ni00ZjUxLWE2N2EtOTg5ZTYyMGI1ZDhkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-19T20:54:24.794Z",
        "url": "https://www.imdb.com/video/vi3695886617/"
    },
    "url": "/title/tt0115438/"
}