{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Walker",
            "url": "/name/nm0908094/"
        },
        {
            "@type": "Person",
            "name": "Tyrese Gibson",
            "url": "/name/nm0879085/"
        },
        {
            "@type": "Person",
            "name": "Cole Hauser",
            "url": "/name/nm0369513/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 279791,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011134/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106989/"
        },
        {
            "@type": "Person",
            "name": "Gary Scott Thompson",
            "url": "/name/nm0860155/"
        },
        {
            "@type": "Person",
            "name": "Michael Brandt",
            "url": "/name/nm0104973/"
        },
        {
            "@type": "Person",
            "name": "Derek Haas",
            "url": "/name/nm0351929/"
        }
    ],
    "datePublished": "2003-06-06",
    "description": "Former cop Brian O'Conner is called upon to bust a dangerous criminal and he recruits the help of a former childhood friend and street racer who has a chance to redeem himself.",
    "director": [
        {
            "@type": "Person",
            "name": "John Singleton",
            "url": "/name/nm0005436/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzExYjcyYWMtY2JkOC00NDUwLTg2OTgtMDI3MGY2OWQzMDE2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "car,fast and furious franchise,undercover agent,racing,miami florida",
    "name": "2 Fast 2 Furious",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ivo-cobra8"
        },
        "dateCreated": "2015-10-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0322259/"
        },
        "name": "Defending a very underrated Entertained solid action flick sequel",
        "reviewBody": "2 Fast 2 Furious (2003) is highly underrated Entertained solid decent action flick for a sequel. I am a Paul Walker Fan and I just love him and his character Brian O'Conner former L.A. Police Officer. So I don't care what anyone says because absence without Vin Diesel was terrible. Well is not! Paul Walker plays all alone so he is awesome star. Leave this film alone it is pretty good and in my opinion is pretty much better than The Fast and the Furious: Tokyo Drift (2006) and Furious Seven (2015). You have Tyrese Gibson, Chris Bridges, James Remar, Cole Hauser, Eva Mendes and Thom Barry as Agent Bilkins who reprise his role from the first installment in here. I love this film not as much as I love Fast & Furious 6 (2013), Fast Five (2011), The Fast & The Furious (2001) and Fast & Furious (2009). John Singleton did an excellent job directing this action packed sequel flick.\n\n\"All right, let's see what this thing can do.\" \n\n'The adrenaline-fueled thrill ride that began with The Fast and the Furious takes an explosive new turn in 2 Fast 2 Furious! It's the nitro-fueled answer to the question: how fast do you like it? Now an ex-cop on the run, Brian O'Connor (Paul Walker) hooks into outlaw street-racing. When the Feds strong-arm him back, O'Connor's no rules, win-or-die skills are unleashed against an international drug lord. With his velocity-addicted buddy (Tyrese Gibson) riding shotgun, and a drop-dead-gorgeous undercover agent (Eva Mendes) dialing up the heat, 2 Fast 2 Furious accelerates the action into a desperate race for survival, justice... and mind-blowing, jaw-dropping speed!'\n\nI love this movie and the racing damn good and i like Chris Bridges because he isn't like Ice Cube or others rappers that are actors talking like yo whats up dogg. Ludicrous talks proper English. I thought that the movie was incredible! The street racing scenes were very realistic and Paul Walker and Tyrese Gibson are a perfect pair for the movie. 5 stars out of 5!! Tokyo Drift was not as good as 2 fast 2 furious, but still good. People: It's not that bad. In fact, it's really good. Is not a bad film it is actually a good film. I still can't believe why people criticized and bash this film so much. Gosh it is the last film in the series I like and I think is better than Tokyo Drift or Furious 7. \n\nFormer cop Brian O'Conner is called upon to bust a dangerous criminal and he recruits the help of a former Miami street racer who has a chance to redeem himself. \n\nThis film is set in Miami not in L.A. and Devon Aoki did a wonderful job as beautiful and sexy street racer Suki! Eva Mendes was gorgeous and sexy as Agent Monica Fuentes, she was so good at acting that even viewer is guessing if Monica is compromised and a dirty agent. Call it what you want I love this film and I think is the last good film of the franchise!\n\nFormer Cop Brian O'Conner who teams up with his ex-con pal Roman Pearce to transport a shipment of 'dirty' money for shady Miami-based import-export dealer Carter Verone while actually working with undercover agent Monica Fuentes to bring Verone down. Brian O'Conner has left L.A. due to illegal actions from the first movie and now soars the streets of Miami taking money here and there by street racing. Watched by Customs Agent Monica Fuentes , Brian is caught by the police and is given a deal by agent Markham and Bilkins to go undercover and try to bring down drug lord Carter Verone in exchange for his criminal record to be erased. Brian agrees if he is given permission to choose his partner. Brian heads home to Barstow, California where he recruits an old friend Roman Pearce to help him. Pearce agrees but only for the same deal Brian was offered. With help Monica, Brian and Rome work together to take down Verone. \n\nThis film was never about cars but it was about taking a crime lord down who is actually smuggling dirty laundry money with fast cars. Here we finally get to met Roman Pearce for the first time. We get to know more about Brian's background. We finally get to know why Brian let go Dom (Vin Diesel) in the first film. The Action sequences and fast cars are also great, so I don't know what is the problem at all?! \n\n2 Fast 2 Furious is a 2003 American action film directed by John Singleton. It is the second installment of The Fast and the Furious franchise. Brian O'Conner (Paul Walker) teams up with his ex-con friend Roman Pearce (Tyrese Gibson) and works with undercover U.S. Customs Service agent Monica Fuentes (Eva Mendes) to bring Miami-based drug lord Carter Verone (Cole Hauser) down.\n\nThe rating I am giving to this film is 7. Anything below 7 would be ridiculous, if anyone would not say that this wasn't At least A GOOD ACTION FILM! (it is sure as hell better than all the comic movies that are getting high scores.)\n\n7/10 Score: B Studio: Universal Pictures Starring: Paul Walker, Tyrese Gibson, Eva Mendes, Cole Hauser, Chris \"Ludacris\" Bridges, James Remar Director: John Singleton Producer: Neal H. Moritz Screenplay: Michael Brandt, Derek Haas Rated: PG-13 Running Time: 1 Hr. 47 Mins. Budget: $76.000.000Box Office: $127,154,901",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Former cop Brian O'Conner is called upon to bust a dangerous criminal and he recruits the help of a former childhood friend and street racer who has a chance to redeem himself.",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1366410521",
        "name": "Legacy Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmVlN2I0MmUtZmJmNS00MjhiLThjMmMtY2Q0MjI2YjdmYzM2XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmVlN2I0MmUtZmJmNS00MjhiLThjMmMtY2Q0MjI2YjdmYzM2XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2023-02-03T14:20:34.582Z",
        "url": "https://www.imdb.com/video/vi1366410521/"
    },
    "url": "/title/tt0322259/"
}