{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matt Walton",
            "url": "/name/nm1476990/"
        },
        {
            "@type": "Person",
            "name": "Sean Matic",
            "url": "/name/nm1603592/"
        },
        {
            "@type": "Person",
            "name": "Anthony Ames",
            "url": "/name/nm1604005/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 836,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0117504/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150932/"
        },
        {
            "@type": "Person",
            "name": "Richard LeMay",
            "url": "/name/nm0501165/"
        }
    ],
    "datePublished": "2003-08-10",
    "description": "Conrad is a gay man living in NYC. He's also CEO of an ad agency and by nature a control freak. Although Conrad is still in love with Martin (his ex), he hires a young Aussie hustler named Tyler, first for a night and then to work...",
    "director": [
        {
            "@type": "Person",
            "name": "Richard LeMay",
            "url": "/name/nm0501165/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODQxMzkyMDcwOV5BMl5BanBnXkFtZTcwMDIyMjcyMQ@@._V1_.jpg",
    "keywords": "gay character,fiance fiancee relationship,hustler,name calling,gay slur",
    "name": "200 American",
    "original_info": {
        "id": "200 American_2003",
        "name": "200 American",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "NJMoon"
        },
        "dateCreated": "2006-01-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0387805/"
        },
        "name": "Renter (Not Owner)",
        "reviewBody": "Director Richard LeMay admits on his DVD commentary that he changed his mind halfway through writing 200 American about what story he wanted to tell. But it doesn't take LeMay's commentary for us to realize that this film's major problem is lack of focus. The title alone should indicate that the central figure must be Ian, the Aussie rent boy searching for a way to stay in America without a legit green card. But LeMay instead opens his film from the POV of Conrad, an ad exec on the rebound from his ex, looking to get off with a renter instead of risking the emotional perils of dating. Never mind the fact that Conrad is a hunk that anyone would gladly bed gratis. Doesn't anonymous sex (for free) also imply 'no strings'? One would think so. The ad game must be going pretty well for Conrad, because he eagerly shells out a thousand clams for his hourly Boy from Oz to stay the night. But mid-vid LeMay ditches the inigmatic saga of Conrad and Ian for a more conventional romantic soap opera between Ian and Conrad's white bread co-worker Michael. To compensate, LeMay quickly resurrects Conrad's ex and proceeds with one of the most predictable pairings in queer cinema: Ian and Michael. Add to this lack of dramatic structure the fact that there's something a little lethargic about the whole affair and you've got a ho-hum gay indie.\n\nThe dialogue tends toward the trite and the editing and cinematography are very hit and miss. The script's single funniest moment (although it tries for many more) involves confusion between the Dalai Lama and Lorenzo Lamas. A fed-up fashion model also provides a much-needed cathartic blast. Oddly, there's an unfortunate subplot about white slavery that should have hit the cutting room floor.\n\nLeMay's greatest asset is his cast, all of whom reportedly worked for free. They manage to make even the most illogical of plot points bearable. If it weren't for the quality of the performances, 200 American might well be totally unwatchable. If LeMay had spent some of his 200 on a script doctor, this film might have been something worth owning. As it is, it's just a 'renter'.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0387805/"
}