{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Balden",
            "url": "/name/nm0049694/"
        },
        {
            "@type": "Person",
            "name": "Jacqueline Bassett",
            "url": "/name/nm0060212/"
        },
        {
            "@type": "Person",
            "name": "Symon Basterfield",
            "url": "/name/nm0060420/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2790,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103289/"
        }
    ],
    "datePublished": "1977-05-09",
    "description": "Director Michael Apted interviews the same group of British-born adults after a seven-year wait as to the changes that have occurred in their lives during the last seven years.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Apted",
            "url": "/name/nm0000776/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTcwYWQwMzQtZTFmOC00NTNkLWIwODktNzNkOTRiM2M0YTVhXkEyXkFqcGdeQXVyNjg1NzcwODE@._V1_.jpg",
    "keywords": "dog,dog racing,children's book,school library,mobile library",
    "name": "21 Up",
    "original_info": {
        "id": "21 Up_1977",
        "name": "21 Up",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2010-02-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075610/"
        },
        "name": "what was and what still lies ahead",
        "reviewBody": "In 21 Up the seven year olds and then the fourteen year olds we saw in previous 'Up' films are now adults, or at least on the cusp of it. Some are married, some are in college (even Oxford), while others are a little more disillusioned or perfectly happy working menial jobs like at a factory. One of the kids wanted to be a horse jockey and he's well on his way. Another, Bruce, who at one time thought he would be a missionary in Africa to help people, became disillusioned and went into another field altogether. And while some get married, they still have words to say about why they are married and how it doesn't change their lives at all.\n\nWhere we saw the kids in the first Up film become a little more shy and awkward in 7 Plus Seven, this time we see them a little more sure- or perhaps more sure about their uncertainty in life- and Apted focuses on subjects like marriage, careers, ethnic and racial tensions, politics, things covered in the previous segment but without so much emphasis on juxtaposition between clips (not that the flashbacks to previous films aren't useful). The insights are clear and always interesting, and we see how the same kids are still together in this film, or a little more varied (the three boys, for example, do not quite dress or look a like, one clean-cut and the other with long hair).\n\nAnd, ultimately, we get a sense of what the Up series will evolve into: finding about who these people are by tracking what's happened over time and what they think could happen (or might not) in the future. And in 21 Up it's about coming of age, going through those teenage years into something else, or the same thing as they thought they would be at 7. It's never boring, and we want to see what will happen next or how their view has changed with the passing of time and history around them.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0075610/"
}