{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve Coogan",
            "url": "/name/nm0176869/"
        },
        {
            "@type": "Person",
            "name": "Lennie James",
            "url": "/name/nm0416694/"
        },
        {
            "@type": "Person",
            "name": "John Thomson",
            "url": "/name/nm0861027/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 38246,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103733/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104255/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011024/"
        },
        {
            "@type": "Person",
            "name": "Frank Cottrell Boyce",
            "url": "/name/nm0101639/"
        }
    ],
    "datePublished": "2002-09-20",
    "description": "In 1976, Tony Wilson sets up Factory Records and brings Manchester's music to the world.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Winterbottom",
            "url": "/name/nm0935863/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTcyYzMyZGUtOGExYi00ZTljLWE3NDEtMGQyYTZiNmIzMzRiXkEyXkFqcGdeQXVyNzQ5MzY0NjM@._V1_.jpg",
    "keywords": "dancer,kidnapping,drugs,violence,suicide by hanging",
    "name": "24 Hour Party People",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Lexx-2"
        },
        "dateCreated": "2004-02-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0274309/"
        },
        "name": "Two words: Fookin' Brellyint!",
        "reviewBody": "This is, was and forever will be one of my favourite films of all time. A joyous love letter to the music, magic and madmen of Manchester, 24 Hour Party People is utterly, utterly exhilarating. Even if you don't know your New Order from your Durutti Column, you'll be hard-pressed not to get a kick out of Michael Winterbottom and Frank Cottrel Boyce's freewheeling depiction of a great time in pop culture.\n\nIn a nutshell, this is the story of a scene, a scene that grew out of the british punk explosion of the mid seventies. Inspired by the rising vibe in his home town, television presenter Tony Wilson, with the aid of colleagues Rob Gretton and Alan Erasmus created Factory Records. Factory is, as described in the film \"an experiment in human nature\", with no written contracts (barring one written on a napkin in Wilson's own blood) and total creative freedom for its acts. From the mid seventies to the early nineties, Factory launched a barrage of fresh and exciting talent on an unsuspecting world, ranging from punk (Joy Division, later to become New Order) to house (A Guy Called Gerald) and dance (Happy Mondays). At the centre of it all was Wilson, all the while balancing his empire building with a steady day job with Granada Television. \n\nWinterbottom's film crams sixteen years of music history into under two hours, using and appropriately chaotic mix of storytelling techniques to rocket the story along. It's by no means an accurate account, (just listen to the commentary by Wilson on the DVD) but encapsulates the spirit of the Manchester Movement beautifully. The plot itself is split into two halves. Firstly, the early punk days, spearheaded by a promising quartet called Joy Division. Joy Division were the first notable artistic success of the label, but were hindered by controversy (the name was derived from the Nazi division of women who were used in an attempt to create the master race), gigs that often degenerated into brawls and most crucially, a talented, but troubled, severely epileptic lead singer, one Ian Curtis. The rapid rise and even faster fall of Joy Division anchors the first half.\n\nThe second half sees us bear witness to the birth of rave culture, aided along by one of Wilson's acts, the Happy Mondays. Formed by brothers Shaun and Paul Ryder, they blazed through Manchester in a blizzard of coke and heroin and shaped dance music in no small way. Oh, and they pretty much helped to run Factory into the ground.\n\nBouncing from hilarious comedy (a great deal of it improvised)to genuine poignancy (the decline of Curtis is heartbreaking stuff) the film is an utter triumph of wit, wonderment and technique. As Wilson, comedian Steve Coogan is nothing short of dynamic. Teetering on the right side caricature (and injecting a great deal of his Alan Partridge persona in to the mix) Coogan is the lynchpin for an otherwise wildly chaotic narrative. The entire cast do sterling work impersonating the Manchester luminaries of old (and by old, I mean young, before the drugs and booze). From Danny Cunningham's uninhibited Shaun Ryder to John Simm's gentle Bernard Sumner and Andy Serkis's fearsome Martin Hannet, (an arguably more fearsome character than Gollum if you ask me....) they're all great. But best of all is Sean Harris, who is simply unforgettable as Ian Curtis. He's so dead-on accurate its almost scary, from the haunted eyes and cheeky humor (witness his first meeting with Wilson) to the eccentric dance moves, its a performance that deserves every award in the book.\n\nOh and the music. Well if you're already a fan, I sure as hell don't need to say it, do I? \n\nAs it was, so it goes and so do I. See this movie before you die. Go on, rent it tonight, rent it now, buy it if you have to or if you're really desperate, just steal a copy. But please, see this movie, you won't regret it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The official trailer for '24 Hour Party People'",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1518385689",
        "name": "Official Trailer, '24 Hour Party People'",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWZhZDliZTYtNDk5MS00MmRlLWEwZDYtZjM5YTA3ZmMyMTdhXkEyXkFqcGdeQWphbWVzbW9u._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWZhZDliZTYtNDk5MS00MmRlLWEwZDYtZjM5YTA3ZmMyMTdhXkEyXkFqcGdeQWphbWVzbW9u._V1_.jpg",
        "uploadDate": "2018-10-22T15:54:31.585Z",
        "url": "https://www.imdb.com/video/vi1518385689/"
    },
    "url": "/title/tt0274309/"
}