{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sandra Bullock",
            "url": "/name/nm0000113/"
        },
        {
            "@type": "Person",
            "name": "Viggo Mortensen",
            "url": "/name/nm0001557/"
        },
        {
            "@type": "Person",
            "name": "Dominic West",
            "url": "/name/nm0922035/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 51696,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0089889/"
        },
        {
            "@type": "Person",
            "name": "Susannah Grant",
            "url": "/name/nm0335666/"
        }
    ],
    "datePublished": "2000-04-14",
    "description": "A big-city newspaper columnist is forced to enter a drug and alcohol rehab center after ruining her sister's wedding and crashing a stolen limousine.",
    "director": [
        {
            "@type": "Person",
            "name": "Betty Thomas",
            "url": "/name/nm0858525/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDlkMmE5ZTEtNTA0YS00OTBjLTgyYmEtMGExMzJkOTRjNDg4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "wedding,sister sister relationship,alcoholism,rehabilitation,f rated",
    "name": "28 Days",
    "original_info": {
        "id": "28 Days_2000",
        "name": "28 Days",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "2000-05-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0191754/"
        },
        "name": "Accurate and smart; great performance by Sandra Bullock. *** out of ****.",
        "reviewBody": "28 DAYS / (2000) ***\n\n\t\"28 Days\" is one of the most accurate movies about alcoholism and drug addiction I can remember. The film does not glamorize or poke fun at its thematic content, but instead shimmers in truth depicting the problems in which a nowhere life can lead. Why would anyone want to see a movie about someone spending time in rehab, regardless of how well crafted it is? Because \"28 Days\" is an interesting, sometimes funny, and involving tale with empathetic, down to earth characters. Do not let this production pass by you without a watch. \n\n\tThe film's main character is named Gwen Cummings and is played by the talented Sandra Bullock. She lives a wild, crazy life with her boyfriend, Jasper (Dominic West). Gwen is an alcoholic and a drug addict, and does not get much support from her similar love interest. As the movie opens, the two get drunk at a club, come home, have sex, and put out a fire with wine. The next day, Gwen arrives late to her sister's wedding, only to destroy an expensive dessert and crash a limousine into a house. \n\n\tThe Gwen Cummings character is developed clearly and effectively. We learn about her lifestyle, recognize faults, and are shown a dark history through painfully real flashbacks. This is one of the things that make \"28 Days\" so involving. We discover elements about the character and notice inner changes as she learns of them herself. I really cared about this character.\n\n\tGwen is given a choice, she can serve jail time for her wrongdoing or can waive that and spend 28 days in a rehab clinic. She chooses rehab. The head counselor is Cornell (Steve Buscemi), who shows empathy but also coyness. Also present at his heath clinic is an assortment of characters who sing sappy melodies and share group love, including Daniel (Reni Santoni), with thick glasses and medical capabilities, Andrea (Azura Skye), Gwen's young roommate, and Eddie Boone (Viggo Mortensen), a famous baseball pitcher with a drinking problem. \n\nGwen's experiences in rehab seem truthful and accurate. Her withdrawals and agonies are realistic and knowledgeable. It is obvious the filmmakers and Sandra Bullock thoroughly researched the stresses and details of rehab.\n\n \tSandra Bullock performs with the right amount of immaturity and charisma. This wonderful actress is set free in this kind of heart filled role; she is best when the main character. Here, Gwen is free to tread the surface of the movie and still allows other characters to contribute to her defining.\n\n \tAbout half way through, the movie losses its much needed focus on Gwen and drifts into detailing relationships, friendships, and other characters. While most of the events that take place surround Gwen, the movie was on the right track with its first half. \"28 Days\" is smart enough to recognize its blunder, however, and by the final scenes it regains the emotionally correct material and concludes with high standards.\n\nThe filmmakers are advertising it as a comedy, but only an isolation of sequences offer hilarity or slapstick. This movie teaches us lessons through its characters. And the lessons are well taught.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Pictures",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2301297433",
        "name": "28 Days",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmUxMWI1ZTUtNTk1OC00YzZhLWFiMzctMTA2ZTgyYjJkNjhhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmUxMWI1ZTUtNTk1OC00YzZhLWFiMzctMTA2ZTgyYjJkNjhhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-02-20T06:03:07Z",
        "url": "https://www.imdb.com/video/vi2301297433/"
    },
    "url": "/title/tt0191754/"
}