{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Naseeruddin Shah",
            "url": "/name/nm0787462/"
        },
        {
            "@type": "Person",
            "name": "Jackie Shroff",
            "url": "/name/nm0006763/"
        },
        {
            "@type": "Person",
            "name": "Juhi Chawla",
            "url": "/name/nm0004487/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2520,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0084249/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0131145/"
        },
        {
            "@type": "Person",
            "name": "Nagesh Kukunoor",
            "url": "/name/nm0474398/"
        }
    ],
    "datePublished": "2003-08-01",
    "description": "The story of a documentary movie-maker who films the reformation story of three hardened criminals within the prison walls - and in the process, finds redemption in her own life.",
    "director": [
        {
            "@type": "Person",
            "name": "Nagesh Kukunoor",
            "url": "/name/nm0474398/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmNjNmY0YjctNGQ4YS00MjI0LTk3NmUtNTU0YzZmZDI1ZDNhXkEyXkFqcGdeQXVyMjUxMTY3ODM@._V1_.jpg",
    "keywords": "prisoner,poetry,multiple storylines,multiple perspectives,flashback",
    "name": "3 Deewarein",
    "original_info": {
        "id": "3 Walls_2003",
        "name": "3 Walls",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ilpintl"
        },
        "dateCreated": "2003-09-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338490/"
        },
        "name": "An exciting and innovative film after a long time!",
        "reviewBody": "Exciting things are afoot in Indian cinema: a new cadre of filmmakers has appeared over the past ten years and is using the cinematic medium in fresh, innovative ways for a specific urban audience. Even the language they use is new: big cities like Bombay, Calcutta, Bangalore, and Madras have always displayed a propensity for English, albeit an English infiltrated by peculiarly Indian locutions and idioms. Urban folk switch back and forth between Indian English and the vernacular depending on the situation and conversation partner. A curious linguistic hybrid has sprung up: Hinglish-a blend of English and Hindi-and the new breed of filmmakers allows their characters to speak in this energetic, all-embracing patois to grant them greater relevance and immediacy for the urban Indian viewer. Films like `English August', `Bombay Boys', `Split Wide Open' may not have been outstanding films, but they broke new ground in terms of subject, approach, and characterization; they unapologetically reflected the metropolitan mind-set and made no attempt to be all things to all people, for they probably would never play in small towns or villages. However, international audiences would relate to these films for they described life in the big city, and city dwellers, regardless of geography, share a complicity with other city dwellers. Thus these films have become staples of the international film festival circuit.\n\nNagesh Kukunoor belongs to this class of filmmaker and made his debut with `Hyderabad Blues', followed it up with `Bollywood Calling' and `Rockford', and now has presented us with `Teen Deewarein' (Three Walls). I have not seen the films that preceded `Teen Deewarein', but if this effort is anything to go by, Mr. Kukunoor is well on his way to becoming one of the new auteurs of Indian cinema. He has written, produced, directed, and if this were not enough, cast himself in one of the lead roles in `Teen Deewarein'! Naseeruddin Shah, Jackie Shroff, and Juhi Chawla--the headliners--are well-known names in Indian cinema; what's new, however, is that Jackie and Juhi have never before attempted cinema of this sort. For years, Jackie was a stalwart leading man of Hindi films, singing, fighting, and romancing his way through several identical, lucrative, yet undistinguished potboilers. Likewise, Juhi has been a capable, if standard, leading lady: glamorous, competent, but never truly challenged by her roles. Also, she was made to simper and giggle in far too many films for my liking. Naseeruddin Shah, however, has made a career of doing daring and different roles; he switches back and forth, seemingly without effort, between lead and character roles, and has frequently appeared in experimental films. He had great fun as the boorish, scary underworld don who turns filmmaker in `Bombay Boys', and just as easily, was the emotional core and the conscience of Mira Nair's `Monsoon Wedding'.\n\n Ishaan (Naseeruddin Shah), Jaggu (Jackie Shroff), and Nagya (Nagesh Kukunoor) are a prison's three inmates on death row. Gulshan Grover is the humane warden attempting reform of the archaic penitentiary system, while Juhi plays Chandrika, a filmmaker making a documentary on death-row prisoners. The three men are each accused of killing a woman: Jaggu is alleged to have stabbed to death his adulterous spouse, Nagya is accused of pushing his wife under an oncoming truck, while Ishaan has accidentally shot a pregnant teller in a botched bank robbery. The three men cannot be more different in character and in their responses to the death sentence. Jaggu, overcome by remorse, wishes to embrace death in atonement for a crime against society. Nagya stoutly denies having pushed his wife and steadfastly believes that truth will prevail, despite the fact that the execution date looms closer with every passing day. Ishaan, the only career criminal of the three, maintains a cheerful outlook and prepares to break out of prison because he doesn't believe he should be put to death for an accidental killing. Chandrika manages to get permission to interview and film the three men, and as time progresses, gains their trust. We see how each of these characters is a prisoner--the three men are literally behind bars, while the filmmaker is trapped in a horrible marriage. Once these four characters come together, we get uncontrived ruminations on life, death, love, and relationships. Juhi switches her camera on and unobtrusively elicits her subjects' life stories and philosophies. The men respond to her gentle approach and open up gradually and pour out their hearts to her non-judgmental camera.\n\nDespite the fact that the prison warden has put many reforms into place, it is still a prison, and we see the dehumanizing effects of incarceration. As always, the strong pick on the weak, and predators have their choice of prey, for there is nowhere to run. A homosexual rape takes place, but the HIV-positive rapist gets off with a beating; his brother is a member of the state legislative assembly and his clout extends to the prison system. As the days go by, the documentarian finds her objectivity getting compromised. Through her, we get to know the men, and find it impossible to impersonally look at them as prisoners who are about to get what they deserve.\n\nOutstandingly well-written in a seamless mix of English, Hindi, and Hyderabadi dialect, the film is equal parts polemic against the death penalty, human interest story, and quite unexpectedly, suspense thriller. It is photographed in a gritty unglamorous manner, probably on digital video, with much steadicam use, so that we walk beside the prisoners and feel their claustrophobia and despondency. The leads, blessed with a literate, intelligent script, offer up detailed character studies. Naseeruddin Shah, like the great Charlotte Rampling, merits the prefix `the always amazing'. His Ishaan is a complex, paradoxical creature-shot through with a rumpled charm, he is a self-serving grifter and an ace at camouflaging his true emotions, but there is unpredictable decency, as well. The surprises, for me, were Jackie Shroff and Juhi Chawla, who, happily, have strayed far from the safe and known domain of conventional commercial Hindi cinema. Jackie turns in a finely nuanced performance of a man who regrets having committed a crime of passion. As a successful lawyer, Jaggu is the most educated of the three and late at night, he ruefully composes melancholy poetry to soothe his troubled soul. Juhi Chawla is a revelation. Gone are the juvenile giggles and irritating mannerisms; with this role, Juhi has stepped into glorious maturity and tackles a role fraught with adult problems and issues. Perhaps realizing her lot is not much different from the prisoners, her face registers outrage at their plight and the corruption-filled higher echelons of the system. Chandrika convincingly makes the transition from impartial spectator and archivist to outspoken activist. Her new political awareness empowers her to stand up to her abusive husband; in fact, the confrontation scene is a highlight of the film.\n\nNagesh Kukunoor deserves a paragraph of his own. This over-achieving, hardworking young man has conceived of a most novel story, produced with great flair, and directed with enormous sensitivity and cunning a film that will be remembered for a long time. He had the good sense to populate his film with outstanding actors, and it is here, unfortunately, that his shortcomings as a performer surface. Had there been merely mediocre actors around him, Nagesh Kukunoor would probably have shone. However, in the august company of Naseeruddin Shah, Jackie Shroff, Juhi Chawla, and Gulshan Grover, he is shown to be the acting rookie that he is. This is a very minor quibble, for his acting is not bad at all. I just feel he had enough on his plate already, and should have cast another, more seasoned actor in the role of Nagya. It would have taken the film up another notch, but in the face of so much excellence, it is a very small cavil. `Teen Deewarein' is a most satisfying film experience.if only it had been accorded the good fortune of a big release that undeserving schlock like `Mein Prem Ki Deewani Hoon' received, it might have made the world's movie-going public sit up and take notice. If only, if only."
    },
    "url": "/title/tt0338490/"
}