{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Josh Hartnett",
            "url": "/name/nm0001326/"
        },
        {
            "@type": "Person",
            "name": "Shannyn Sossamon",
            "url": "/name/nm0815370/"
        },
        {
            "@type": "Person",
            "name": "Paulo Costanzo",
            "url": "/name/nm0182455/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 74412,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012865/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047476/"
        },
        {
            "@type": "Person",
            "name": "Rob Perez",
            "url": "/name/nm0673608/"
        }
    ],
    "datePublished": "2002-03-01",
    "description": "After a brutal break-up, a young man vows to stay celibate during the forty days of Lent, but finds the girl of his dreams and is unable to do anything about it.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Lehmann",
            "url": "/name/nm0499724/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjY1ZWYwM2MtNDk0YS00NjY5LWJiYzQtZjVmYmNlN2Y0MzVkXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "female rapist,male rape victim,female sex offender,rape victim,female on male rape",
    "name": "40 Days and 40 Nights",
    "original_info": {
        "id": "40 Days and 40 Nights_2002",
        "name": "40 Days and 40 Nights",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TOMASBBloodhound"
        },
        "dateCreated": "2006-07-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0243736/"
        },
        "name": "It was an interesting idea, but......",
        "reviewBody": "40 Days and 40 Nights could have been written into something interesting. In fact I'm sure it started out interesting, then a series of re-writes probably ruined it. The film cannot decide if it's a sex farce, a date movie, or some kind of statement about morality. The cast seems generally appealing, and the idea of such a promiscuous young man suddenly abstaining from sex sets up some interesting possibilities. Ultimitely, it just goes down as another failed date movie.\n\nJosh Hartnett plays a young man who has just broken up with the girl of his dreams. He then becomes wildly promiscuous; sleeping around with anyone who will talk to him. After some time, his conscience begins to get the better of him, and he swears off sex for Lent. Yep, that means he cannot even masturbate or so much as kiss a girl for the time frame mentioned in the title. That seems like an interesting starting point for a film, but scene after scene never generates the results we the audience are after.\n\nOf course, Hartnett meets another wonderful young lady at the laundry mat. They obviously fall for each other instantly, but their relationship is nothing more than a ploy to see how much the young man can be tempted to break his vow. Of course the script doesn't give him the courage to be honest about why he can't sleep with his new girlfriend. This is only meant to cause tension between the two of them, and frankly it does nothing more than delay what we know will eventually happen.\n\nScene after scene reminds you that this is only a movie, and in no way do people behave normally or do things happen rationally. First of all, would it make any sense for a guy looking to avoid sex to hang around with a babe like Shannyn Sossamon? I think not. How about their first date? The two of them just ride around San Francisco on a public bus and make warm faces at one another while \"Chemistry\" by Semisonic chimes away on the soundtrack. Can we say \"date movie\"? How about the office where Hartnett works? All the girls are hot of course, further tempting our young man. All the guys dress like GAP models, and none of them talk about sports at all! Sure we guys talk about sex at work, but we always at least talk a little about sports, too. In another scene, Hartnett actually gives Sossamon an orgasm using only the petals of a flower. (He can't touch her, if you recall!) To meet a woman like that.... if only! On a more serious note, practicing Catholics will definitely be offended by one scene in particular. In it, Hartnett walks in on his brother who is a priest in training and catches him making out with a nun. If this were an intelligent film, you might make the case that the film is only lobbying for priests to be able to have relations with women; perhaps to help alleviate some of the child abuse scandals. Trust me though, this film is not that intelligent. The scene was included only for schlock value.\n\nOverall, it was an interesting idea, but there were just too many ridiculous scenes to make it watchable. The film comes off as being more than a little wrong headed in a couple ways. First of all, nobody is really as sex-obsessed as the people in this film. And second of all, going without sex for 40 days and nights is disappointing, but not the end of the world. Having sex with a condom..... now there's torture!!!! 5 of 10 stars.\n\nThe Hound.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #2",
        "duration": "PT1M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1575919129",
        "name": "40 Days and 40 Nights",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjE1YWU3NjktNTFkZC00YjAwLTk0NWItNjczZTFjYjM3ZGMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjE1YWU3NjktNTFkZC00YjAwLTk0NWItNjczZTFjYjM3ZGMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:04:29Z",
        "url": "https://www.imdb.com/video/vi1575919129/"
    },
    "url": "/title/tt0243736/"
}