{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Balden",
            "url": "/name/nm0049694/"
        },
        {
            "@type": "Person",
            "name": "Jacqueline Bassett",
            "url": "/name/nm0060212/"
        },
        {
            "@type": "Person",
            "name": "Symon Basterfield",
            "url": "/name/nm0060420/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2699,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103289/"
        }
    ],
    "datePublished": "1998-07-21",
    "description": "Director Michael Apted revisits the same group of British-born adults after a seven-year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Apted",
            "url": "/name/nm0000776/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDc2Njc5Y2EtYTA3MS00ZDliLTk2NDMtOGYzMDk0OWExMzAyXkEyXkFqcGdeQXVyNjg1NzcwODE@._V1_.jpg",
    "keywords": "twin towers,london england,lifespan,lifespan development,politics",
    "name": "42 Up",
    "original_info": {
        "id": "42 Up_1998",
        "name": "42 Up",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ProfessorFate"
        },
        "dateCreated": "2004-11-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0164312/"
        },
        "name": "A Fascinating and Important Film",
        "reviewBody": "This film series takes the adage \"Give me a child until age 7, and I'll give you the man\" and blows it out of the water. I've been a fan of the \"Up Series\" since my first viewing of \"28 Up\". Watching these precocious 7-year-olds grow into adulthood right before my eyes has sparked some much needed self-examination of my own life. That may be the greatest value of the \"Up Series\", causing the viewer to project themselves into the film and see how their own lives have changed and developed. The movie ticket is certainly cheaper than a trip to the psychologist.\n\nSome highlights of this edition:\n\n-Tony, the would-be jockey and racetrack numbers runner who became a London cabbie. Despite his infidelities, Tony is still married to his forgiving wife and seems to take great pride in his children. Tony has now become more reflective about his life, taking a thoughtful stroll through the closed down racetrack where he once rode, and getting misty-eyed when discussing his late mother and father. Always frank and pragmatic, he says of his comfortable suburban home, \"I'm a cabbie. This is probably as far as I'm gonna get.\"\n\n-Bruce, the good-natured, relationship challenged school teacher who was teaching in Bangladesh, is back teaching in London and has finally found Mrs. Right. Among the interesting tidbits of information you learn from Apted's DVD commentary is that he broke his rule of only filming the subjects every 7 years so he could be present to film Bruce's wedding. \n\n-Nick, the physicist who moved to the US, returns home to his father's farm.\n\nWe meet his brothers and are treated to some beautiful shots of the English contryside. In his commentary Apted discusses his regrets regarding the way he edited Nick's wife in previous episodes. She now refuses to do interviews for the films and also refuses to let their son participate.\n\n-Andrew, the only one of what Apted refers to as the \"Three Wise Men\", the upper class boys, who participated in 42 Up. Successful well-adjusted, happily married, we see Andrew and his family on a vacation to New York City (with several pre-9/11 shots of the WTC). Thanks to the DVD commentary, we learn that John doesn't particularly like Apted and only agreed to be interviewed for \"35 Up\" if his interview was conducted by Apted's assistant director. The other upper class boy, Charles, is ironically a documentary director for the BBC and has consistently refused to participate since \"21 Up\".\n\n-Neil, the bright, animated 7-year-old who ended up dropping out of college and living in a trailer. Neil has always been the most compelling character in the \"Up Series\". His obvious intelligence exists in sharp contrast with mental problems and bouts with depression. Every fan of the films would probably admit to worrying whether or not Neil would survive to the next episode. Happily, Neil is now involved in local politics. Despite his eccentric appearance and lack of a paying job (he makes no money from his job with the Liberal Democrats), Neil is no longer the rambling hermit of \"28 Up\". His turn around can partly be attributed to some assistance from fellow \"Up\" subject Bruce. Neil even participated in Bruce's wedding.\n\nLet's hope Apted comes up with a DVD compilation that includes footage from all the films. Instead of the brief 15 minute updates we get for each subject in \"42 Up\", it would be nice to see a half-hour or so on each, as well as footage of those who no longer participate (like Peter). Apted's DVD commentary is boring at times, but includes some fascinating behind-the-scenes information which devoted fans will enjoy. In conclusion, the \"Up Series\" stands as one of the most important and engrossing documentaries ever committed to celluloid.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0164312/"
}