{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        },
        {
            "@type": "Person",
            "name": "Ava Gardner",
            "url": "/name/nm0001257/"
        },
        {
            "@type": "Person",
            "name": "David Niven",
            "url": "/name/nm0000057/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6930,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136673/"
        },
        {
            "@type": "Person",
            "name": "Robert Hamer",
            "url": "/name/nm0357607/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        },
        {
            "@type": "Person",
            "name": "Bernard Gordon",
            "url": "/name/nm0330024/"
        }
    ],
    "datePublished": "1963-05-06",
    "description": "During the 1900 Boxer Rebellion, U.S. marine, Maj. Matt Lewis, along with British consul, Sir Arthur Robertson, develop a plan to keep the rebels at bay until an international military relief force can arrive.",
    "director": [
        {
            "@type": "Person",
            "name": "Nicholas Ray",
            "url": "/name/nm0712947/"
        },
        {
            "@type": "Person",
            "name": "Guy Green",
            "url": "/name/nm0337885/"
        },
        {
            "@type": "Person",
            "name": "Andrew Marton",
            "url": "/name/nm0554249/"
        }
    ],
    "duration": "PT2H34M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWRjMDk1NTQtZTE0Zi00MjQ4LTk5ZjktNzNiZmVmMWEzYTJhXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "boxer rebellion,china,colonialism,peking china,imperialism",
    "name": "55 Days at Peking",
    "original_info": {
        "id": "55 Days at Peking_1963",
        "name": "55 Days at Peking",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Nazi_Fighter_David"
        },
        "dateCreated": "2007-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056800/"
        },
        "name": "Even in wartimes, a valuable gift placed high enough can work miracles",
        "reviewBody": "\"55 Days at Peking\" is the story of the Boxer Rebellion in China, in the summer of the year 1900, where the violent wind of discontent disturbs the land \n\nSeparated from the foreign compound by a mere wall and a gate is the Forbidden City, where, in untouchable isolation, Empress Dowager Tzuprotected by an army of eunuchsearnestly advises Sir Arthur (David Niven) that all foreign residents, including diplomatic personnel, to leave Peking within 24 hours\n\nFor the Empress of China (Flora Robson), the situation in Peking cannot be expected to become tranquil because of the projected draught, because of hunger and unrest among the people, because of the merciless demands of the foreign powers Prince Tuan (Robert Helpmann) counsels the empress a reckless adventure, while Gen. Jung-Lu (Leo Genn) counsels prudence and patience\n\nThat morning, Sir Arthur came to the Imperial Palace with the truth, the truth that is already known to the German government, and to all other powers, asking the empress to take action against Prince Tuan who commanded the Boxers to drag and kill the German minister \n\nObviously, the empress rejected Sir Arthur's truth and his protest, informing him that Prince Tuan is her closest and most trusted adviser and she appointed him to head the foreign office The ambassadors realizing now that Prince Tuan succeeded in getting the support of the empress, vote on whether to stay or leave Peking \n\nNiven demonstrated both his capacity and his potential as the English diplomat with no intention of displaying fear of the Boxers, nor of handling the victory to Prince Tuan \n\nAva Gardner looks beautiful as the Russian Baroness who knows that her sublime trinket sure glitters \n\nLynne Sue Moon steals the show in her moving portrayal of the abandoned Oriental 12-year-old child in need of love and care and who has been promised, by her father, to be taken home to America Her best scene comes at the climax of the movie when Heston riding out at the head of his Armystops, looks down at the girl, and says, \"Here, take my hand.\" He pulls her upon his horse and they ride together out of Peking\n\nNicholas Ray's direction and the actors' performance appear sincere enough Those merely looking for an epic spectacle are likely not to get satisfaction from it as a motion picture In spite of its aspirations, \"55 Days in Peking\" isn't enough to keep us engaged, while, there's no denying, succeeded in entertaining us for a while",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi984465689",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTc1ZTkyMzAtZDJmYS00OTQ1LTk1MDEtMjljYTJiNmZiMGRiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTc1ZTkyMzAtZDJmYS00OTQ1LTk1MDEtMjljYTJiNmZiMGRiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-09-23T21:09:43.124Z",
        "url": "https://www.imdb.com/video/vi984465689/"
    },
    "url": "/title/tt0056800/"
}