{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Timothy Hutton",
            "url": "/name/nm0000459/"
        },
        {
            "@type": "Person",
            "name": "Randy Quaid",
            "url": "/name/nm0001642/"
        },
        {
            "@type": "Person",
            "name": "Kari Matchett",
            "url": "/name/nm0558182/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2711,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0188462/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057460/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077703/"
        }
    ],
    "datePublished": "2004-06-07",
    "description": "When college professor J.T. Neumeyer discovers a police file that outlines the details of his murder - which is to take place five days in the future - he wastes no time trying to save his own life.",
    "genre": [
        "Action",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzMTM1OTM4N15BMl5BanBnXkFtZTYwMTUwODM3._V1_.jpg",
    "keywords": "the future,black and white scene,sepia tinted scene,female nudity,lionsgate",
    "name": "5ive Days to Midnight",
    "original_info": {
        "id": "5ive Days to Midnight_2004",
        "name": "5ive Days to Midnight",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Li-1"
        },
        "dateCreated": "2004-10-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0386907/"
        },
        "name": "A terrible climax places this miniseries squarely into mediocrity.",
        "reviewBody": "Rating: ** out of ****\n\nThe two-hour Sci-Fi Channel made-for-TV movies may almost always suck, but you can usually rely on their miniseries for quality acting, writing, and special effects (I loved Taken and Children of Dune, really liked Dune, and there is nothing currently on TV that can compete with the new Battlestar Galactica). Five Days to Midnight breaks the channel's success streak, proving to be easily its worst miniseries to date. \n\n5DTM stars Timothy Hutton as J.T. Neumeyer, a physics professor with a young daughter (I forget the actress's name, but she looks a lot like a young Drew Barrymore) and a life insurance agent named Claudia for a girlfriend (Kari Matchett). While visiting his late wife's grave on a Monday morning, his daughter discovers a briefcase nearby. Upon opening the case, J.T. is a little shocked to discover that the contents are files pertaining to his own murder, which will occur in five days, at 3:55 A.M. on Friday.\n\nHe initially laughs it off as a hoax, but when a few of the little \"prophecies\" come true, he becomes a fast believer and sets out to find out who would murder him and why. He has only a few clues, but there is a list of suspects: Carl Axelrod, an eccentric student of his; Brad, his financially desperate brother-in-law; Roy Bremmer, a man he's never even heard of; and even his own girlfriend Claudia, who is not all that she appears to be. With the clock ticking down and only the help of a homicide investigator (Randy Quaid), J.T.'s obsession with saving his own life may come at the cost of many others.\n\nUndeniably, 5DTM boasts one of the niftier premises in recent memory. Playing like a mix of Minority Report meets 24, the combination of sci-fi and mystery has always appealed to me, so there's no question that a good portion of the miniseries is genuinely engaging and entertaining (mostly in the beginning and middle segments). \n\nA lot of the series is intentionally predictable, and in a fun way, like you just know that gift from his girlfriend will be the same parka he wears in that photo from the briefcase where he's lying dead, or the car his girlfriend rented will be that green Cherokee in that other photo, and so on and so forth. 5DTM also has fun with the implications of possible time travel and the changes one could set forth in the fabric of time. I was also thankful for the fact that a lot of the characters actually caught on to the possibility of time travel quickly and even accepted it without much question.\n\nThere are a lot of decent to good performances, especially Timothy Hutton, who capably handles the functions of a likable everyman. The girl who plays his daughter is terrific as well, and Kari Matchett would be a dead-on match for Naomi Watts if she had a smaller nose and slightly larger cheeks. Angus Macfadyen makes for a menacing villain as Bremmer, who's so evil he clearly can't be Neumeyer's killer.\n\nUnfortunately, the miniseries begins to stumble by the second half of 'Day 4,' and is just a complete and utter mess by 'Day 5.' The writers can't seem to be able to keep much consistency in the film's concept of time travel. Without giving much away, when certain changes are made to the timeline in the film's climax, newspaper articles and photos from the future are also altered to fit the new timeline (kind of like in Back to the Future), and the changes occur immediately. However, in 'Day 2,' Neumeyer changes a woman's fate, preventing her from getting killed by a collapsing tree. After this change in time, his daughter then reads all the newspaper articles from the file the next day, which still state that the woman died because of the tree. Wouldn't that portion of the article have been altered?\n\nThe climax is just terrible (moderate spoilers in this paragraph), with every major suspect conveniently converging in the same location with murder on their minds. Just as bad, at least three of the potential killers wouldn't have even targeted Neumeyer if not for the intervention of the briefcase itself, and the one suspect that continuously threatens his life also seems most likely to the deed, but a tacked-on, idiotic surprise revelation completely disregards that possibility, placing the blame firmly on one of the characters that wouldn't have killed him if not for the briefcase's intervention. I can't think of any plausible reason this person would have killed Neumeyer prior to the appearance of the briefcase, but a bullet that conveniently fits into a gun is supposed to lead us to believe it was this one character all along.\n\nThe identity of the killer is perfectly predictable, since it's always the person we're least likely meant to suspect. Even though I came to the realization very early, I still doubted myself because, as stated earlier, there's just no reason this person would have any true motivation to kill Neumeyer without the briefcase.\n\nIt's unfortunate, but with such an awful ending, I just can't go out of my way to recommend 5DTM. It's not the movie's only major flaw, the miniseries is constantly padded to fill its allotted running time, and the director goes insanely overboard on the choppy slow motion, often ruining any developing suspense or momentum. Had the miniseries been about forty-five minutes to an hour shorter, I might have said yes as a video rental, but unless if you've got lots of time to kill, this isn't rewarding enough to spend the time and money."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Lionsgate Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1655111961",
        "name": "Five Days To Midnight",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDdlMzY2ZDItYzQzMC00ZWVmLWI0MmUtYzE5NTk1OTYzYWU4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDdlMzY2ZDItYzQzMC00ZWVmLWI0MmUtYzE5NTk1OTYzYWU4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:08:29Z",
        "url": "https://www.imdb.com/video/vi1655111961/"
    },
    "url": "/title/tt0386907/"
}