{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tasanawalai Ongartittichai",
            "url": "/name/nm0648678/"
        },
        {
            "@type": "Person",
            "name": "Black Phomtong",
            "url": "/name/nm0681104/"
        },
        {
            "@type": "Person",
            "name": "Lalita Panyopas",
            "url": "/name/nm0659927/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2233,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "6ixtynin9",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0157883/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003701/"
        },
        {
            "@type": "Person",
            "name": "Pen-Ek Ratanaruang",
            "url": "/name/nm0711579/"
        }
    ],
    "datePublished": "1999-11-19",
    "description": "A woman, fired from a financial coorporation during the Asia crisis, returns home with no money. However, she finds a box with a fortune in front of her door, and decides to keep it. However, the people that left it there soon wan...",
    "director": [
        {
            "@type": "Person",
            "name": "Pen-Ek Ratanaruang",
            "url": "/name/nm0711579/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTM4NGFlNzktNzljZi00NDJmLWIzYTItYTFmYjQ3MDIwNjc2XkEyXkFqcGdeQXVyNTE4NDk0NQ@@._V1_.jpg",
    "keywords": "police officer,deafness,imagining one's death,imagining one's suicide,letter writing",
    "name": "Ruang talok 69",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "emmaamore"
        },
        "dateCreated": "2008-11-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0235154/"
        },
        "name": "a real pleasure....!",
        "reviewBody": "This is one of those films where nothing is overly blatant, hardly anything is granted by ways of the lead character's internal character and history, and it isn't jam-packed with various sceneries, dialog, etc. Nothing is too 'in your face', hardly any emotion is shown or felt throughout the film, and even (despite the various killings), action seems to be lacking... It's decidedly quiet, introverted and monotone and YET, somehow completely quirky, insane and colorful at the same time. The film is intelligently crafted in such a way that, by the end of the film, you aren't sure WHAT to make of it, or how to classify it... Except you do know one thing; whatever you just watched, you know, in retrospect, you loved it. And even after identifying the fact that you enjoyed the ride, you still wouldn't rank this strange, ambiguous little film as your top film, but for that you just love it all the more. \n\nIt's bizarre, zany, quirky, inane, insane, full of black humor and wit, and full of hidden metaphors and analogies not immediately accessible. You can tell when its over that despite its absurdity, within all the intermediary spots where much is left unsaid, the director has packed a good deal for you to think about, and clearly had some lucid, thought-out objectives for the film. \n\nAn intelligent, unique little film that's a heck of a fun ride to watch. Highly recommended!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0235154/"
}