{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Batsheva Dance Company",
            "url": "/name/nm9962502/"
        },
        {
            "@type": "Person",
            "name": "Zina Zinchenko",
            "url": "/name/nm8277521/"
        },
        {
            "@type": "Person",
            "name": "Ben Schnetzer",
            "url": "/name/nm3115493/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16337,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "alternateName": "7 Days in Entebbe",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132772/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057311/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091846/"
        },
        {
            "@type": "Person",
            "name": "Gregory Burke",
            "url": "/name/nm2954373/"
        }
    ],
    "datePublished": "2018-03-16",
    "description": "Inspired by the true events of the 1976 hijacking of an Air France flight en route from Tel Aviv to Paris, and the most daring rescue mission ever attempted.",
    "director": [
        {
            "@type": "Person",
            "name": "José Padilha",
            "url": "/name/nm0655683/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAwNDMzNzg0Nl5BMl5BanBnXkFtZTgwOTkxNjY2NDM@._V1_.jpg",
    "keywords": "operation thunderbolt,entebbe uganda,hostage situation,female terrorist,hijack",
    "name": "Entebbe",
    "original_info": {
        "id": "7 Days in September_2004",
        "name": "7 Days in September",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bertaut"
        },
        "dateCreated": "2018-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt5466186/"
        },
        "name": "Lacks real insight, but is well made",
        "reviewBody": "Written by Gregory Burke, and directed by José Padilha, Entebbe has met with near universally bad reviews (22% approval on Rotten Tomatoes at the time of writing), and while it is without doubt flawed, it's not nearly as bad as has been made out. Telling the story of the 1976 AirFrance hijacking by Palestinian and German revolutionaries, and subsequent Israeli Defence Force rescue mission (Operation Thunderbolt), the film is presented from multiple points of view; Revolutionäre Zellen members Brigitte Kuhlmann (Rosamund Pike) and Wilfried Böse (Daniel Brühl), Israeli Minister for Defence Shimon Peres (Eddie Marsan), Israeli Prime Minister Yitzhak Rabin (Lior Ashkenazi), IDF Pvt. Zeev Hirsch (Ben Schnetzer), AirFrance 1st Engineer Jacques Le Moine (Denis Ménochet), IDF Lt. Col. Yoni Netanyahu (Angel Bonanni), and Ugandan President Idi Amin (Nonso Anozie).\n\nThe problem is obvious; the film covers every point of view except the most important one; the Palestinian. Indeed, the only Palestinian given any kind of development is a fictional character played by Omar Berdouni, who talks of Israeli tanks driving over a car in which his family were trapped. And there are other strange omissions; the death of Dora Bloch (Trudy Weiss), murdered on Amin's orders after she was released in Kampala, is never mentioned, and Wadie Haddad is nowhere to be found. Additionally, the film doesn't have much of contemporaneous relevance to say in relation to the Arab-Israeli Conflict, other than alluding melancholically to the self-propagating nature of the violence, and the unlikelihood of peace (the closing legend points out that after he pushed for negotiations in 1995, Rabin was assassinated by a Jewish extremist). However, it's aesthetically very well put together, and the juxtaposition of Thunderbolt with a Jewish dance number works much better than it has any right to. True, it doesn't get to the heart of the matter by any stretch of the imagination, and it could be accused of taking a pro-Israeli stance, but it's enjoyable enough, and worth a look.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A thriller inspired by the true events of the 1976 hijacking of an Air France flight en route from Tel Aviv to Paris, the film depicts the most daring rescue mission ever attempted",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4222597145",
        "name": "Trailer #1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWIzNTU2MjktMDE3NC00ZTNjLWExM2ItNDgzYzI2NDI3OWJmXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWIzNTU2MjktMDE3NC00ZTNjLWExM2ItNDgzYzI2NDI3OWJmXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
        "uploadDate": "2017-12-07T15:06:34Z",
        "url": "https://www.imdb.com/video/vi4222597145/"
    },
    "url": "/title/tt5466186/"
}