{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Standing",
            "url": "/name/nm0822062/"
        },
        {
            "@type": "Person",
            "name": "Matthew Delamere",
            "url": "/name/nm0216221/"
        },
        {
            "@type": "Person",
            "name": "Vivian Wu",
            "url": "/name/nm0943180/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4078,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104416/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075382/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022758/"
        },
        {
            "@type": "Person",
            "name": "Peter Greenaway",
            "url": "/name/nm0000425/"
        }
    ],
    "datePublished": "1999-12-10",
    "description": "Following the death of a mother, a father and son open up their very own harem in their Genevan estate after watching 8½ (1963).",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Greenaway",
            "url": "/name/nm0000425/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzZkYWE1OGUtMzViOS00YmVmLTllM2EtYTdhMWYyYWU0ZDdmXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "male full frontal nudity,brothel,lust,pubic hair,breasts",
    "name": "8 ½ Women",
    "original_info": {
        "id": "8 1|2 Women_1999",
        "name": "8 1/2 Women",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "srepka"
        },
        "dateCreated": "2002-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0154443/"
        },
        "name": "Greenaway Laughs!",
        "reviewBody": "Actually, Greenaway has nearly always been laughing. It's just that many people fail to notice that. \"8 1/2 Women\", however, is different in that even the people who hate it (of which there will be plenty; it's Greenaway) will have no doubts that it is a comedy, and Greenaway's lightest-toned film yet.\n\nIt is a playful tribute to Fellini and Godard, and it features - prominently - understanding, affection and warmth, none of which are emotions one would have easily associated with Greenaway's previous work. (In an after-screening interview, he commented that age makes one want to look more at the better side of things.) Because this is still very much a Peter Greenaway film, the ways in which emotions such as filial love are going to be explored are going to be very quirky indeed; but to interpret the film's \"taboo\" scene as intended to shock is a disservice to the film, the director's intentions (and his ability to *truly* shock when he wants to - check \"The Baby of Macon\") and your own enjoyment.\n\n\"8 1/2 Women\" is full of odd little moments (and one SPECTACULARLY odd image which I won't spoil much, except to mention that it involves a pig, a Japanese Noh performer and a stunning Swiss villa) and offbeat humour; and it is about male bonding and male delusions about women. I can see how many people have taken the facile route of viewing it as misogynistic; these people have obviously not seen the same film as I have, which is all about control from behind the scenes, strategy, and the presentation of male supremacy for what it is - a fallacy.\n\n\"8 1/2 Women\" was badly received at Cannes, got a tremendous backlash against it and died a death commercially. All of which is very unfair. If you like eccentric humour, give this film a chance. It's a little Wonderland of sorts and, in its own peculiar way, far more heartwarming than the average plastic Hollywood tear-jerker.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0154443/"
}