{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Luke Perry",
            "url": "/name/nm0000580/"
        },
        {
            "@type": "Person",
            "name": "Stephen Baldwin",
            "url": "/name/nm0000286/"
        },
        {
            "@type": "Person",
            "name": "James Rebhorn",
            "url": "/name/nm0714310/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5436,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010434/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Person",
            "name": "Monte Merrick",
            "url": "/name/nm0581224/"
        }
    ],
    "datePublished": "1994-02-25",
    "description": "This movie chronicles the life of Lane Frost, 1987 PRCA Bull Riding World Champion, his marriage and his friendships with Tuff Hedeman (three-time World Champion) and Cody Lambert.",
    "director": [
        {
            "@type": "Person",
            "name": "John G. Avildsen",
            "url": "/name/nm0000814/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Biography",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjY4Nzk5NzItYjAyNy00NzgwLTgwMTQtMTM4MDkyOTk0ODFjXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "beer,champagne,smile,bull rider,home",
    "name": "8 Seconds",
    "original_info": {
        "id": "8 Seconds_1994",
        "name": "8 Seconds",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "me43"
        },
        "dateCreated": "2003-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109021/"
        },
        "name": "Get it for the real Lane Frost end credits!",
        "reviewBody": "Anyone who spent time with Lane or guffawed at Tuff's assessment of lesser riders, (\"Ol' so-n-so wants to be a bull rider, problem is, he's skairt o' bulls!\") will have a hard time finding the real boys in this film. Instead they will cringe at badly done accents and wonder where the boy's likability went. No loved one is spared, and the writers seemed to go out of their way to transform Lane's Justins from leather to clay. Why does the media tear down our heroes?\n\nLuke Perry's affected accent borders on parody and Cynthia Geary, (formerly \"Shelly\" on \"Northern Exposure\"), is downright unappealing as Lane's wife, Kellie. All too often TV actors lack a certain texture to make it on the big screen, and the casting here proves it. I suspect the powers that be were trying to cash in on the popularity of Perry's and Geary's television shows. The late Red Mitchell, a genuine Texan, and film actor, was excellent as the poetry spouting \"Cody Lambert\". Cowboy poetry is a real art form, but the real Cody Lambert wasn't known for his poetical abilities.\n\nFurther evidence that Perry is no Lane Frost comes from the scene where he tosses his hat, brim down, on a chair. No self respecting cowboy would ever do that! (In fact, it was a rapid glance test for sniffing out coca-cola cowboys back in the days following \"Urban Cowboy\" when everyone and their brother was trying to pass as a \"real cowboy\". On that subject, a lot of rodeo cowboys are treated with disdain by those from working ranches. Rodeo is an extremely expensive \"hobby\" and most \"real cowboys\" can't afford to ride any circuit other than the pasture fence line.) The vast majority of rodeo cowboys, and wage riding cowboys, for that matter, end up so stoved up that they are old men by the age of 40, something the film gave a passing nod to. \n\nLane really did wear a wild turkey feather in his hatband, but he wasn't hurt by Red Rock, who was actually a popular bull to draw. The trailer in the picture was an insult to the man, and they did split up for awhile, but it wasn't over cheating. Tuff really did manage to hang on for 8 more seconds in honor of Lane during his ride at the 1989 National Rodeo Finals. You can say well, heck, it is only a movie, cut it some slack, but I say this is about a real man who really touched a lot of people's hearts, and those that don't know any better now only get this fractured view of him. He deserved a lot better.\n\nThen there is the way family members are portrayed. If one believes this movie, the whole Frost family had closeness issues... and that is just with the parents. Lane's siblings are ignored all together. In real life, Elsie is generous and the picture of Christian charity, and bless her for it, but this film showed her and Clyde in a pretty bad light, and doesn't say much for his real life wife either.\n\nStill, there are some interesting moments, and an absolutely priceless credit sequence where we get to see the real Lane Frost in action. Your heart can leap into your mouth watching him get busted up by those bulls and you may cheer when he gets up and walks away with that infectious grin of his. If you want to be a bullrider, you may even give it a rethink after seeing that even a champion gets stomped every once in awhile.\n\n I always bust out sobbing while those precious minutes roll by, but it is from seeing Lane ride again, and being mentally transported back in time. Those were exciting and very stressful years, and I frankly resent the director's attempt to force us into reaching for the tissues by the choice in music over the credits. (Typical country tearjerkers.) Instead of walking away in contemplation, or in marvel of Lane's life, we are left on a very big downer, a box office killer and further proof someone was asleep on the job. Lane would not have wanted that for us.\n\nOverall, I give it low marks for the mauling of a genuine American Hero, but qualified high marks for that credit sequence!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi666108185",
        "name": "8 Seconds",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTY4OTVjMzctNzJmOS00ZDMxLTkzZjQtYWQ1YzIyYmFkYTUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTY4OTVjMzctNzJmOS00ZDMxLTkzZjQtYWQ1YzIyYmFkYTUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T04:48:24Z",
        "url": "https://www.imdb.com/video/vi666108185/"
    },
    "url": "/title/tt0109021/"
}