{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fanny Ardant",
            "url": "/name/nm0000272/"
        },
        {
            "@type": "Person",
            "name": "Emmanuelle Béart",
            "url": "/name/nm0000322/"
        },
        {
            "@type": "Person",
            "name": "Danielle Darrieux",
            "url": "/name/nm0201638/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33186,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "8 Women",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008399/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090290/"
        },
        {
            "@type": "Person",
            "name": "François Ozon",
            "url": "/name/nm0654830/"
        },
        {
            "@type": "Person",
            "name": "Marina de Van",
            "url": "/name/nm0888418/"
        },
        {
            "@type": "Person",
            "name": "Robert Thomas",
            "url": "/name/nm0859436/"
        }
    ],
    "datePublished": "2002-10-04",
    "description": "One murdered man, eight women, each seeming to be eager than the others to know the truth. Gimme, gimme, gimme some clues to make up my mind. And eventually enter the truth. Oh, thou cruel woman!",
    "director": [
        {
            "@type": "Person",
            "name": "François Ozon",
            "url": "/name/nm0654830/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Comedy",
        "Crime",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTJkYTg4N2MtMzcwMy00ZjFiLWFlNzItMmJhMTllZjI2YjRlXkEyXkFqcGdeQXVyNzA5NjUyNjM@._V1_.jpg",
    "keywords": "1950s,maid,adultery,theft,pregnancy",
    "name": "8 femmes",
    "original_info": {
        "id": "8 Women_2002",
        "name": "8 Women",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bigspeegs"
        },
        "dateCreated": "2002-10-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283832/"
        },
        "name": "Fantastic campy fun",
        "reviewBody": "RATING: ***1/2 out of ****\n\nBeing what it is, it seems like Francois Ozon's \"8 Women\" would have everything going against it. After all, the premise is hardly original and every single plot twist is predictable and derivative. There are plenty of Agatha Christie movies (not to mention the wonderful play \"The Mousetrap\") to offer us what \"8 Women\" promises as a mystery. Although I can't say if a murder mystery musical of this type has been attempted on film before, the musical numbers in this film are a bit awkward and stick out like a sore thumb. With all of this, \"8 Women\" would seem almost repellent. Truth be told, I loved every minute of it. The setting is Christmas in the mid-1950s, and seven women are gathering in the country home of Marcel (Dominique Lamure). There is his wife Gaby (Catherine Deneuve), who has just brought one of her two daughters, Suzon (Virginie Ledoyen) back from college for the holiday. Anxiously awaiting her are her peppy sister Catherine (Ludivine Sagnier), her disabled grandmother Mamy (Danielle Darrieux), her neurotic aunt Augustine (Isabelle Huppert), cook Madame Chanel (Firmine Richard), and newly hired maid Louise (Emmanuelle Beart). All of them, although not always on the best terms with each other, seem intent on having a good time this Christmas.\n\nToo bad for them. As is customary to happen in movies with a large mansion housing many guests, Marcel (the only man in the house), is murdered. The phone line has been cut, the car has been sabotaged, and the weather is such that no one can scale the wall surrounding the grounds. One person, however, does get in: Marcel's sister Pierrette (Fanny Ardant), who arrives with a story (which may or may not be true) that she got a call the night before saying that Marcel had been murdered. It becomes apparent that the murderer is one of these 8 women, and it is up to them to tell the complete truth and find out everyone's secrets so that they can find out who the murderer is.\n\nIt's high time we have a film like \"8 Women\", a maliciously absurd exercise in high camp. It succeeds even... no, especially when it fails. The story itself is the kind of murder mystery that has been filmed over and over again in previous years, but it's impossible to get enough of. This film handles all of the conventions with the perfect Christie-esque tone. It's still as fun as ever to point fingers at various possible suspect, and \"8 Women\" is just predictable enough that even the least experienced viewer can partake in the fun.\n\nAnd with this cast, why shouldn't we have fun? One of the main purposes of this film is to let these eight actresses simply enjoy themselves, and their wicked glee comes through on screen. I wonder if Francois Ozon was at all able to keep his authority as director during shooting. For let such fantastic actresses loose on each other, allowing all of them to inhabit such bitchy individuals, one had better stay out of their way. It is said that the best comedy relies on surprise. Be assured, \"8 Women\" wreaks such delectable havoc on it's premise that there will be plenty of opportunities to ask: \"Did I really just see that?\"\n\nThis film knows a secret that we haven't seen many low-key projects like this successfully handle in recent memory: when in doubt, just sing. The musical numbers have varied success throughout the film. All pop up sporadically and never really find a way to come to a conclusion, but each one is a highly enjoyable bonus aside to everything else that's going on.\n\nIn \"8 Women\", the first rule is: there are no rules. It's infinitely meaner (and much more enjoyable) than its non-musical predecessor \"Gosford Park\". It's hilarious in its maniacal irreverence, and it is yet another example of a film that would fall flat on its face if it were not for the actors leading the way. If I am going to be seeing a murder-mystery-musical, I would want none other than the cast of \"8 Women\" at the helm."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1797111321",
        "name": "Bande-annonce [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWE0NDNkYWMtZWEyMi00NjVjLTg2N2ItNzg3ZDcwNzYzNmQ0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWE0NDNkYWMtZWEyMi00NjVjLTg2N2ItNzg3ZDcwNzYzNmQ0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-02T16:41:06.834Z",
        "url": "https://www.imdb.com/video/vi1797111321/"
    },
    "url": "/title/tt0283832/"
}