{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yoshio Harada",
            "url": "/name/nm0361757/"
        },
        {
            "@type": "Person",
            "name": "Ryûhei Matsuda",
            "url": "/name/nm0559430/"
        },
        {
            "@type": "Person",
            "name": "Genta Dairaku",
            "url": "/name/nm2102030/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1840,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "9 Souls",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054983/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0244671/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007473/"
        },
        {
            "@type": "Person",
            "name": "Toshiaki Toyoda",
            "url": "/name/nm0870313/"
        }
    ],
    "datePublished": "2003-07-31",
    "description": "Nine convicts escape from prison; most are convicted murderers. They commandeer a van from a strip club. Their plan is to find a stash of counterfeit money that a deranged cell mate told them about, divide it, then part ways. They...",
    "director": [
        {
            "@type": "Person",
            "name": "Toshiaki Toyoda",
            "url": "/name/nm0870313/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Adventure",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0NTQ4NTUxN15BMl5BanBnXkFtZTcwNzA5NTcyMQ@@._V1_.jpg",
    "keywords": "cell phone photograph,money,van,murder,escape from prison",
    "name": "Nain sôruzu",
    "original_info": {
        "id": "9 Souls_2003",
        "name": "9 Souls",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "juliankennedy23"
        },
        "dateCreated": "2005-03-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0370244/"
        },
        "name": "David Soul tragically not included.",
        "reviewBody": "Here is another great film critics will love. The problem is that it is not a very good movie.\n\nThe films premise is simple. Nine convicts escape a prison after the tenth one goes crazy and tells them where the treasure is.\n\nThe first half has a lot of slapstick some of it very broad while the second half is a character driven descent into fantasy and melancholy.\n\nThe two halves simply don't mix. Individual scenes do work very well (The guys crashing a friends house who has a new Filipino bride is hilarious While a later scene with the big guy working in the restaurant tugs at the heartstrings.) They simply don't mesh with each other.\n\nThe movie as well is missing entire set-ups. One scene shows the guys desperately looking for change under a deserted vending machine to buy a snack. The very next scene has the whole crew in drag sitting down in a restaurant. Where did they get the dresses and wigs? (The crew includes both the big guy and a midget) How did they get all the clothes and money to buy the meal? And most puzzling is why are they in drag? They are clearly guys in drag and lets face it is there anything more memorable to witnesses than a big guy and a dwarf eating a meal dressed as women? I mention the big guy and the dwarf because besides the old guy everyone else seems to blend into each other. (In fact they wear matching white jumpsuits throughout most of the movie) The movie has very little character development in the first half and as a result the second half really lacks an emotional punch. As we are often trying to figure out who is who in their individual payoff scenes.\n\nSpeaking of a drag the second half has all those wonderful sweeping camera shots and big emotional moments and great symbolism that makes a great film. It is also excruciatingly slow which makes for a boring movie.\n\n9 Souls is a big disappointment, the reviews gush about a great film and it's in there somewhere, good luck finding it yourself.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0370244/"
}