{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leslie Cheung",
            "url": "/name/nm0002000/"
        },
        {
            "@type": "Person",
            "name": "Chow Yun-Fat",
            "url": "/name/nm0000334/"
        },
        {
            "@type": "Person",
            "name": "Lung Ti",
            "url": "/name/nm0862479/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10733,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "A Better Tomorrow II",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000295/"
        },
        {
            "@type": "Person",
            "name": "Hing-Ka Chan",
            "url": "/name/nm0150916/"
        },
        {
            "@type": "Person",
            "name": "Suk-Wah Leung",
            "url": "/name/nm0505000/"
        },
        {
            "@type": "Person",
            "name": "Hark Tsui",
            "url": "/name/nm0007139/"
        }
    ],
    "datePublished": "1987-12-17",
    "description": "A restauranteur teams up with a police officer and his ex-con brother to avenge the death of a friend's daughter.",
    "director": [
        {
            "@type": "Person",
            "name": "John Woo",
            "url": "/name/nm0000247/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGFkZTA4MWYtNTM3Mi00Y2ZhLWEzYmMtNzIwMDFmMWU1MzdjXkEyXkFqcGdeQXVyMTc3MjY3NTY@._V1_.jpg",
    "keywords": "vigilantism,criminal underworld,ex gangster,brother brother relationship,father daughter relationship",
    "name": "Ying hung boon sik II",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieMaster95"
        },
        "dateCreated": "2010-10-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094357/"
        },
        "name": "A Far From Perfect But Satisfying Conclusion To The Original",
        "reviewBody": "After the movie 'A Better Tomorrow' became a big success around Hong Kong, a sequel was inevitable to happen. Most of the original cast return, including Chow Yun-Fat as Mark Lee's twin brother Ken.\n\nTaking place a few years after the events of the first film, we see how things are finally starting to look up. Ho is in prison but he's finally re concealed his relationship with his brother Kit, who has become a loving husband and soon to be father. But like the first film, things get bad real quick. Ho's former master Lung has been framed for murder and even loses his mind as his life gets worse. He's sent over to New York to keep a low profile and to be looked after by Ken who owns a restaurant and lives there. Meanwhile Ho and Kit are working together to end the triad gangs.\n\nThis is where the problem starts. The first film revolved around Ho and the people around him, but this film spends way too much time with Ken trying to get Lung back to normal. Ho and Kit's plot seems to delve deeper into the main story ark, yet they never seem to get enough scenes. Ken is pretty much similar to Mark although he may be a little darker and you can tell he's only in the film because of Chow Yun-Fat's character was so popular in the last film.\n\nThe film doesn't seem to make a huge continuation onto the first film either. Instead of being it's own story, it seems to just be an expansion of the first film, but not in a good way. We don't delve too much into the characters and they seem underused. The film is also known for having a sillier feel in a few scenes(Famous Rice Scene), but it didn't ruin the experience for me. These flaws are apparently due to disagreement between John Woo and producer/second writer Tsui Hark about the tone of the film, causing Woo to disown most of the film, except the end shootout. John Woo's original cut was around 3 hours and is rumoured to improve on some of the flawed moments. A version I hope will appear in some future release of the film.\n\nNow for the goods. The film seems to get noticeable better during the second half, beginning with the amazing hotel shootout. The film is well known for it's exaggerated violence and blood and the film doesn't disappoint. The action is a big step up from the first and some of the best ever filmed for its time. Chow Yun-Fat is once again cooler than ice, with his trademark sunglasses, trench coat, matchstick and dual pistols and may be one of the main appeals of the film. The Climatic assault on the triad mansion is one of the greatest shootouts and one of the greatest ending ever filmed. It's no wonder that it's the only thing Woo likes about the film. The amazing soundtrack returns and their are a few emotional scenes that actually work well.\n\nWith many iconic scenes (The stairs scene being one), the film is a lot better than it gets credit for. The film is no masterpiece and doesn't compare to the first but it has its moments. Silly and flawed moments aside the film is actually quite enjoyable and as long as you keep an open mind, I think you'll enjoy this conclusion to the Better Tomorrow saga. Part 3 doesn't count!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0094357/"
}