{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Don Johnson",
            "url": "/name/nm0000467/"
        },
        {
            "@type": "Person",
            "name": "Jason Robards",
            "url": "/name/nm0001673/"
        },
        {
            "@type": "Person",
            "name": "Susanne Benton",
            "url": "/name/nm0072971/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18335,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026096/"
        },
        {
            "@type": "Person",
            "name": "L.Q. Jones",
            "url": "/name/nm0428618/"
        },
        {
            "@type": "Person",
            "name": "Harlan Ellison",
            "url": "/name/nm0255196/"
        },
        {
            "@type": "Person",
            "name": "Wayne Cruseturner",
            "url": "/name/nm0190030/"
        }
    ],
    "datePublished": "1975-11-14",
    "description": "A young man and his telepathic dog wander a post-apocalyptic wasteland.",
    "director": [
        {
            "@type": "Person",
            "name": "L.Q. Jones",
            "url": "/name/nm0428618/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGJhNjZjMTUtZjgyMi00YWZlLTgwMjEtYWMyMDE0ZjQ3N2U4XkEyXkFqcGdeQXVyNDUwMTUxMDU@._V1_.jpg",
    "keywords": "post apocalypse,dog,nuclear holocaust,bare chested male,underground life",
    "name": "A Boy and His Dog",
    "original_info": {
        "id": "A Boy and His Dog_1975",
        "name": "A Boy and His Dog",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "funkyfry"
        },
        "dateCreated": "2008-02-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0072730/"
        },
        "name": "unique sci-fi",
        "reviewBody": "Surely those who were looking for nothing more than what Hollywood usually delivers when they invoke the words \"science fiction\" were disappointed, because this movie resembles the usual horror or action film masquerading as sci-fi very little. Its source material is a novella by Harlan Ellison, a writer who's recognized by many in the sci-fi community as a master on the same playing field of \"psychological sci-fi\" as Ray Bradbury and Philip K. Dick. From Ellison we get a very dark tale about a strangely human dog and his boy. They live in a post-apocalyptic wasteland where Phoenix Arizona used to be, and hunt women and food with the same predatory zeal. But when Vic (or as the dog calls him, Albert) is lured into a surreal society living in a large bomb shelter, their friendship is threatened and Vic is almost forced to become a sort of sexual machine for the good of the State.\n\nJust to run through some of the aspects of the film that I enjoyed, I really liked Tim McIntire's voice work as the dog, perfectly crisp like a cranky old man. How exactly the dog knows so much or is able to speak to Vic is never really explained, but I think there's a clue in that Lou (Jason Robards, Jr.) believes that Vic has spoken to a dog he encounters in the shelter. That, along with the \"Committee's\" seeming obsession with recounting facts and figures almanac-style, makes me believe that the dog actually came from the shelter. Perhaps he was sent there to \"observe\" Vic, as Lou tells him they have been doing for some time, and he rebelled against their control. Like all good sci-fi the idea is vaguely proposed but never explained.\n\nDon Johnson did pretty good work here, I mean it doesn't strike you as all that impressive at first but when you think about the fact that he had to do so many scenes with just this dog as his co-star it's a pretty tough act to pull off as well as he did. Susanne Benton was decent in her role as well. I loved when she tried to sweet-talk the dog, basically the same way that she treated Vic. Vic seems confused about her intentions all the way up to the end, which is excellent -- if he had figured her out completely then the ending would just feel mean-spirited instead of humorous. As it is, it's as if Vic believes he's making a sacrifice but the dog knows better and turns it into a joke. By the way my girlfriend thought the last line was too tacky but I thought it was perfect, it gave narrative closure to the film as well as filling in those who might not have understood the scene with the campfire.\n\nHonestly the only performance I wasn't crazy about was Jason Robards'. There's these great scenes he gets to play with Alvy Moore (\"Green Acres\") and Helene Winston (great laugh she's got... she didn't make a lot of movies but strangely enough just this week I saw her in Curtis Harrington's \"The Killing Kind\"). He just has no energy, I guess that's the way he wanted to do it but it's annoying how he kind of mumbles through the dialog and I just didn't feel that the dialog was supposed to be quite that casual. Basically I just did not like the way he decided to play the character, I didn't think it was scary at all. His android assistant, like a twisted American Gothic, is pretty strange though. Plus I never understood why everyone down there was wearing clown makeup. Was it the idea of the forced smile? Anyway, I salute the film because I think it was a brave decision to make it as it is and not to try to turn it into a more conventional thing with romance or too much action. I think I can see some influence from this movie on George Miller's \"Road Warrior\" (though I was told that he claims he hadn't seen it), and definitely on \"Slip Stream\" with Mark Hamill from the 80s. But this isn't really the kind of movie that was made to fall into place inside the pantheon of \"sci-fi\" anyway. It's a closer relative to \"Electra-Glide in Blue\" and other films of the early 70s that explored the bitter end of \"hippie\" idealism, the same trend that Hampton Fancher was trying to catch onto when he wrote his first drafts of the film that eventually became \"Blade Runner.\" Frankly I can't remember seeing another sci-fi film that is so close to the feel and ethos of the most transgressive and anti-establishment sci-fi of the 1960s.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for A Boy And His Dog",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1437860121",
        "name": "A Boy and His Dog",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTQxMTYyZjMtZjg4Mi00NmMwLTgwNDAtZGI4MDI0NTNmOWY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTQxMTYyZjMtZjg4Mi00NmMwLTgwNDAtZGI4MDI0NTNmOWY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T05:02:14Z",
        "url": "https://www.imdb.com/video/vi1437860121/"
    },
    "url": "/title/tt0072730/"
}