{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Ryan O'Neal",
            "url": "/name/nm0641939/"
        },
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 58329,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060073/"
        },
        {
            "@type": "Person",
            "name": "Cornelius Ryan",
            "url": "/name/nm0752485/"
        },
        {
            "@type": "Person",
            "name": "William Goldman",
            "url": "/name/nm0001279/"
        }
    ],
    "datePublished": "1977-06-15",
    "description": "Operation Market Garden, September 1944: The Allies attempt to capture several strategically important bridges in the Netherlands in the hope of breaking the German lines.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Attenborough",
            "url": "/name/nm0000277/"
        }
    ],
    "duration": "PT2H55M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWRjZmZmYmItYzczOS00NjY4LTk3ODItNGU3ZDQ2ZGJkYmZiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "military operation,bridge,operation market garden,nazi occupied netherlands,year 1944",
    "name": "A Bridge Too Far",
    "original_info": {
        "id": "A Bridge Too Far_1977",
        "name": "A Bridge Too Far",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stryker-5"
        },
        "dateCreated": "1999-02-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075784/"
        },
        "name": "\"It's All A Question Of Bridges\"",
        "reviewBody": "\"Quite frankly,\" observes 'Boy' Browning, \"this kind of thing's never been attempted before.\" But it has. In 1962, \"The Longest Day\" gave the epic star-studded treatment to the D-Day landings, and here we are, 15 years on, doing the same for the Arnhem debacle. It has to be said, the film looks great. From the gently-tinkling light fittings in the Dutch resistors' home to the beauty of the tank tracks in perspective, this is a gorgeously-photographed movie.\n\nIn 1944, the German armies were being pushed back across the Low Countries. The Allies' great strategic problem was the Rhine, the wide river which formed Germany's western border. A daring plan was conceived which would overcome the Rhine obstacle and open the road to Berlin. 'Market Garden', as the plan was codenamed, involved parachuting spearhead units onto the great bridges over the Rhine and securing them for the critical few hours it would take for an armoured column to drive up and relieve them.\n\nIt is easy now to point to the flaws in 'Market Garden', but at the time it looked like a daring and viable alternative to slogging it out against the Siegfried Line. No-one had anticipated that the Dutch people would pour out onto the streets in throngs, thinking that they had been liberated, and thus bog down the armour. The intelligence indications of heavily-equipped German units in the zone were ignored because they were inconvenient. Critically, the plan allowed for only one solitary road to be available to the Irish Guards for the all-important northward thrust. The film illustrates very effectively the way in which a plan can develop its own momentum, regardless of the shortcomings which riddle it.\n\nThe sequence of the boarding and dropping of the paratroops is a thrilling spectacle, shot on a colossal scale. The German ambush which delays the rolling of the armoured column is another terrific action sequence. Attenborough keeps tight control of a big, complex story, and interlards the large-scale stuff with 'human scale' passages, like James Caan's rescue of his buddy (incidentally, the tracking shot which follows his jeep through the forest is quite remarkable).\n\nThe fighting at Nijmegen is brilliantly-filmed. Note how the street on the British side grows increasingly littered with war debris as the battle rages. Robert Redford's assault across the river is a symphony in olive drab, leading to a wonderful moment of exhilaration.\n\nWhether the viewer finds the singing of \"Abide With Me\" moving or grossly sentimental will depend on personal taste, but the subdued ending is very satisfying. 'Market Garden' may have helped shorten the war and may have achieved most of its immediate objectives, but it has to be seen as a tragic mistake.\n\nThe film is slick, professional and very pleasing on the eye. One can't help wondering, however, if this kind of 'tank opera' was worth the effort, given that \"The Longest Day\" had done it all so splendidly a generation earlier."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Operation Market Garden, September 1944: The Allies attempt to capture several strategically important bridges in the Netherlands in the hope of breaking the German lines.",
        "duration": "PT3M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi534037017",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjg4ZjkyYzQtZTJkYS00OWRjLWI2NDctNGEwM2VjYjQwNjY3XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjg4ZjkyYzQtZTJkYS00OWRjLWI2NDctNGEwM2VjYjQwNjY3XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-06-15T01:00:06.875Z",
        "url": "https://www.imdb.com/video/vi534037017/"
    },
    "url": "/title/tt0075784/"
}