{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred Corral",
            "url": "/name/nm9154777/"
        },
        {
            "@type": "Person",
            "name": "Sherwood Dixon",
            "url": "/name/nm9154778/"
        },
        {
            "@type": "Person",
            "name": "Julie Wilson",
            "url": "/name/nm11198726/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 944,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "datePublished": "2003-01-20",
    "description": "Unblinking and unsettling, this documentary lays bare a mysterious process that goes on all around us - what happens to people who die with no next of kin.",
    "director": [
        {
            "@type": "Person",
            "name": "Grover Babcock",
            "url": "/name/nm0044835/"
        },
        {
            "@type": "Person",
            "name": "Blue Hadaegh",
            "url": "/name/nm1283186/"
        }
    ],
    "duration": "PT1H9M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkyODIxOTIyM15BMl5BanBnXkFtZTcwNTUxMDgyMQ@@._V1_.jpg",
    "keywords": "dental mask,medical,telephone,latex gloves,african american",
    "name": "A Certain Kind of Death",
    "original_info": {
        "id": "A Certain Kind of Death_2003",
        "name": "A Certain Kind of Death",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "xakarava"
        },
        "dateCreated": "2005-03-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0342180/"
        },
        "name": "The cold, hard truth",
        "reviewBody": "I recently saw \"A Certain Kind of Death\" on Sundance and it literally blew my mind away. It was captivating because this documentary actually makes one appreciate life a lot more.\n\n\"A Certain Kind of Death\" explores as to what happens to the unclaimed dead (the deceased with no RECORDED next of kin)when their corpses are now the care of the government (which in this case is LA county). Maybe many people have an idea what happens to the deceased John and Jane Does' of the world but this explores the nitty, gritty details as to what happens. I will not spoil it here or go into too much detail, but there are people whose job it is to take care of the unclaimed dead corpses and to them it's business as usual, but the images from their jobs will stick with you and I have, at least, learned to appreciate my family and most importantly my life after watching this story (in other words, don't take everyday life for granted for you never know....) This isn't a cheery documentary. It does make you think and feel. Some viewers have complained that the people in the film aren't passionate about their jobs. Well, since when processing corpses on a daily basis (mind you, some of these corpses are in pretty AWFUL shape) invokes passion??? This is what essentially happens when you die folks, there's no way around it. Some have pretty mahogany coffins with satin lining, others have 24k gold urns for their ashes, but their are many out there not so fortunate but in the end we all end up the same: ashes to ashes, dust to dust.\n\nI highly recommend this film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0342180/"
}