{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Douglas",
            "url": "/name/nm0000140/"
        },
        {
            "@type": "Person",
            "name": "Terrence Mann",
            "url": "/name/nm0542994/"
        },
        {
            "@type": "Person",
            "name": "Michael Blevins",
            "url": "/name/nm0088324/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10834,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066648/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103685/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0292818/"
        },
        {
            "@type": "Person",
            "name": "Arnold Schulman",
            "url": "/name/nm0776068/"
        },
        {
            "@type": "Person",
            "name": "Michael Bennett",
            "url": "/name/nm1378431/"
        },
        {
            "@type": "Person",
            "name": "James Kirkwood Jr.",
            "url": "/name/nm0456788/"
        }
    ],
    "datePublished": "1985-12-20",
    "description": "Hopefuls try out before a demanding director for a part in a new musical.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Attenborough",
            "url": "/name/nm0000277/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama",
        "Music",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGU4NzI1YzQtNTljMS00ZWNhLWEzNTAtNWNjOGIxNjM2NzczXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "audition,based on stage musical,exercise,command,order",
    "name": "A Chorus Line",
    "original_info": {
        "id": "A Chorus Line_1985",
        "name": "A Chorus Line",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jimu63"
        },
        "dateCreated": "2003-02-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0088915/"
        },
        "name": "A classic example of how to do everything wrong in a stage-to-film adaptation",
        "reviewBody": "Richard Attenborough's totally ordinary and exasperating screen version of Michael Bennett's brilliant stage musical \"A Chorus Line\" is a classic example of how to do everything wrong in a stage-to-film adaptation. \n\n First off, hire a director who has absolutely no idea how to stage a musical or judge musical talent. Allow him to hire a cast based on looks and youth as opposed to actual talent, update the setting from 1975 to 1985, then let him throw out the original production's ground-breaking choreography as being \"dated\" and hire the \"Flashdance\" choreographer to create '80's style dance routines that will look ridiculously dated 20 years later. And don't worry if the director doesn't even understand the meaning and purpose of the original show; after all, the show really isn't about aging dancers hoping for one more show so they can cling onto their dreams for a while longer. No, no, no. As he said at the time, the show is about \"kids trying to break into show business.\" As a result, he doesn't have to even think about hiring the original cast as they are \"now in their thirties and forties.\" (Note: all this is recounted in the book \"On the Line\" by Thommie Walsh and Baayork Lee.)\n\nThen, to top it off, allow him to change the focus from the dancers themselves to a corny backstage love story between Zach the choreographer and Cassie, the fallen \"star,\" who has come back to beg her old flame for a job. Finally, take the show's showstopper, the beautiful and unforgettable \"What I did for Love\" away from Diana, give it to Cassie, and turn it from an anthem about giving up your life for your dreams into a love song to a jerk. And make sure you cast a star like Michael Douglas as Zach and then cut to a reaction shot of him a dozen times during the dance numbers even if it is incredibly distracting. After all, people came to see him and not the dancing.\n\nI could go on and on, but why bother? The truth is, with a couple of exceptions, nobody in this cast sings or dances convincingly on a Broadway level, and my bet is most wouldn't make it on the dinner theater circuit either. The exceptions? Vicki Frederick is a hoot as Sheila, the senior (and most cynical) of the dancers. Gregg Burge has a fun dance solo in the original tune \"Surprise, Surprise,\" but then they ruin it by having him joined by the rest of the cast. And Alyson Reed is very good and convincing as Cassie, the star. But why, oh why did they replace Cassie's brilliant solo \"The Music and the Mirrors\" with the terrible original tune \"Let Me Dance With You?\" This and the bowdlerization of \"What I Did For Love\" alone sink the film. Not to mention that the show's other showstopper \"Dance Ten Looks Three\" is ruined by the terrible performance of Audrey Landers, who was obviously hired due to her gorgeous looks rather than her obvious lack of talent.\n\nAny way, \"A Chorus Line\" is an major disappointment, especially now that Rob Marshall and company have shown us how to adapt a musical with his marvelous film version of \"Chicago\" which seems headed for a Best Picture Oscar. Ironically, both musicals debuted on Broadway the same year (1975) and while \"A Chorus Line\" was the bigger hit, because they got the film version of \"Chicago\" right and this one so wrong, \"Chicago\" seems destined to go down in history as the better production. Maybe if they'd waited for a more appropriate director with a real vision for this film, things would be different. Oh, the possibilities--- ** (out of *****)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Hopefuls try out before a demanding director for a part in a new musical.",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2752168729",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzBmODUwMGEtYTIxYy00OGM3LWEyYzctN2VlOTdkOWE2YTY5XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzBmODUwMGEtYTIxYy00OGM3LWEyYzctN2VlOTdkOWE2YTY5XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-02-07T19:47:25.590Z",
        "url": "https://www.imdb.com/video/vi2752168729/"
    },
    "url": "/title/tt0088915/"
}