{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Katharine Hepburn",
            "url": "/name/nm0000031/"
        },
        {
            "@type": "Person",
            "name": "Paul Scofield",
            "url": "/name/nm0006890/"
        },
        {
            "@type": "Person",
            "name": "Lee Remick",
            "url": "/name/nm0001665/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 850,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0729427/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0123628/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130370/"
        },
        {
            "@type": "Person",
            "name": "Edward Albee",
            "url": "/name/nm0016361/"
        },
        {
            "@type": "Person",
            "name": "Edward Anhalt",
            "url": "/name/nm0030019/"
        }
    ],
    "description": "A well-to-do Connecticut family is upended when the grown daughter's godparents, seized by a nameless terror, decide to come live with them.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Richardson",
            "url": "/name/nm0724798/"
        }
    ],
    "duration": "PT2H13M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDg1YjFmMTYtNzEwYi00N2VjLTk1NmYtOWU3Y2RjNzRjYzY4XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "based on play,screenplay adapted by author,cigarette,terror,friend",
    "name": "A Delicate Balance",
    "original_info": {
        "id": "A Delicate Balance_1973",
        "name": "A Delicate Balance",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2008-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069958/"
        },
        "name": "Their Well Ordered Lives",
        "reviewBody": "Probably were it not for the American Film Theater, that noble project which ultimately did fail of bringing productions of classical American works to film, we might never have seen A Delicate Balance. It's like a lot of O'Neill's work, it's all in the creation of the characters.\n\nCertainly a play which consists of six characters sitting around and talking would not be considered anything film-able today. A Delicate Balance for me seems to take off in the same directions as Edward Albee's other classic, Who's Afraid of Virginia Woolf and also bears no small resemblance to O'Neill's Long Day's Journey Into Night.\n\nBoth of those films however had bigger budgets and were made more cinematic by having the players move into various locations. The one set technique just doesn't work here. This is not for instance a story as gripping as Alfred Hitchcock's Rope or Rear Window. My guess is that the budget was blown on getting the high priced stars.\n\nPaul Scofield and Katharine Hepburn play a pair of sixty somethings married and living in a posh Connecticut suburb, the kind of place Hepburn grew up in and knew well. Living with them is Hepburn's leach of a sister Kate Reid who they keep well supplied with alcohol and who lives there at Hepburn's insistence. Otherwise Scofield would have tossed this one out with the trash years ago. But he bows to Hepburn's wishes to keep peace and order, a delicate balance if you will.\n\nThey get two intruders in their well ordered lives one day. Their neighbors and long time friends, Joseph Cotten and Betsy Blair just ring the bell and announce that something unknown has frightened them in their home and they need to move out and move in with them. Scofield offers them his daughter's room.\n\nBut then daughter announces she's moving back after failed marriage number four. Needless to say that causes the balance to go out of whack. Lee Remick is the daughter and she's a selfish and spoiled suburban princess. After this everybody grates on each other's nerves.\n\nShort and on plot, but deep on characterization is A Delicate Balance. It explores the problems of old age and loneliness. Cotten and Blair have no children and Scofield and Hepburn take little comfort in Remick. Perhaps if there were grandchildren things might be different for both couples. There was a son who died for Hepburn and Scofield and that seems to have cast a permanent pall over both of them.\n\nThough Remick is blood kin, Hepburn and especially Scofield have more in common with their neighbors. How it all works out is for you to see A Delicate Balance for.\n\nThe film's saving grace is the wonderful performances by the cast. The original Broadway production ran for 132 performances in 1966-1967 and starred Hume Cronyn and Jessica Tandy in the Scofield-Hepburn roles. But certainly Kate and Paul were going to sell more tickets than either of the other two worthy players.\n\nNot that A Delicate Balance did much business back in the day. These films were for limited release in any event and if it's making money it's now in video sales and rentals. Still we can thank the American Film Theater for its preservation with some of the best preservers around.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3402154265",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2NmYmY5N2EtMzBjNS00N2E3LWExYTAtMTM5MjNhODhjZWZjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2NmYmY5N2EtMzBjNS00N2E3LWExYTAtMTM5MjNhODhjZWZjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-18T13:27:05.172Z",
        "url": "https://www.imdb.com/video/vi3402154265/"
    },
    "url": "/title/tt0069958/"
}