{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Francis Ford Coppola",
            "url": "/name/nm0000338/"
        },
        {
            "@type": "Person",
            "name": "William Friedkin",
            "url": "/name/nm0001243/"
        },
        {
            "@type": "Person",
            "name": "Robert Altman",
            "url": "/name/nm0000265/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2752,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058650/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100777/"
        }
    ],
    "datePublished": "2003-01-19",
    "description": "A documentary examining the decade of the 1970s as a turning point in American cinema. Some of today's best filmmakers interview the influential directors of that time.",
    "director": [
        {
            "@type": "Person",
            "name": "Ted Demme",
            "url": "/name/nm0001130/"
        },
        {
            "@type": "Person",
            "name": "Richard LaGravenese",
            "url": "/name/nm0481418/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ3OTEyMDExNV5BMl5BanBnXkFtZTcwMDA0MzAwMQ@@._V1_.jpg",
    "keywords": "filmmaker,1970s,director,cinema,interview",
    "name": "A Decade Under the Influence",
    "original_info": {
        "id": "A Decade Under the Influence_2003",
        "name": "A Decade Under the Influence",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ali_John_Catterall"
        },
        "dateCreated": "2009-09-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0342275/"
        },
        "name": "\"You got a gun? Suck on this!\"",
        "reviewBody": "This exploration of a unique decade in US cinema begins with the fall of one ailing, out-of-touch empire and culminates with the unstoppable rise of another, equally associated with escapism and box office receipts. Meet the new boss, same as the old boss. Or, as Peter Fonda observed in Easy Rider, \"We blew it.\" In between, from Bonnie And Clyde to Star Wars, the young Turks (some under the guerrilla tutelage of Roger Corman) were creeping under the wires to produce some of the greatest artworks of the 20th century. While the story is already familiar from Peter Biskind's Easy Riders, Raging Bulls directors Demme and LaGravenese are less concerned with muckraking than in providing a platform for the filmmakers and stars themselves.\n\nEveryone from Martin Scorsese to Francis Ford Coppola and Julie Christie is interviewed and a roster of well edited clips places the decade in a socio-cultural and economic context. If their responses are self-congratulatory (to say the least), they're also highly quotable, funny and revealing, making this something of a cinephile's wet dream. Director William Friedkin reveals how the original The Exorcist poster was to feature a little girl's hand holding a bloodied crucifix and the legend 'For God's sake, help her\", before he complained. Former Warner Bros.' head John Calley recalls that when he first saw Robert De Niro in Mean Streets he assumed Scorsese had secured a psychopath's day release for the shoot.\n\nHappily, a certain amount of hard perspective has crept into the mix, as might be hoped from a politically motivated, consciousness-expanded generation; Hopper stresses \"there's a lot of real crap in there too\". Julie Christie observes that 1970s US cinema was \"not a good time for women\". But if Demme responds with a spoonful of sops to women's movies - brief clips of Alice Doesn't Live Here Anymore, They Shoot Horses, Don't They and Klute - we're soon dragged back to the usual male wall-pissing contests.\n\nThe shift from tough, socially-conscious film-making to no-risk crowd-pleasers like Jaws for 'Nam-weary, fantasy-craving audiences is also documented, though a little rushed. But kudos too, for the inclusion of lesser-sung, but equally relevant films like Panic In Needle Park and Joe. \"We weren't handsome,\" muses Bruce Dern on his contemporaries. \"But we were f****** interesting.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0342275/"
}