{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Zero Mostel",
            "url": "/name/nm0609216/"
        },
        {
            "@type": "Person",
            "name": "Phil Silvers",
            "url": "/name/nm0799014/"
        },
        {
            "@type": "Person",
            "name": "Buster Keaton",
            "url": "/name/nm0000036/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9505,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0279806/"
        },
        {
            "@type": "Person",
            "name": "Melvin Frank",
            "url": "/name/nm0291035/"
        },
        {
            "@type": "Person",
            "name": "Michael Pertwee",
            "url": "/name/nm0675728/"
        },
        {
            "@type": "Person",
            "name": "Burt Shevelove",
            "url": "/name/nm0792938/"
        }
    ],
    "datePublished": "1966-10-16",
    "description": "A wily Roman slave schemes to earn his freedom by romantically uniting his master with a courtesan. But matters get complicated and he ends up dragging in his neighbors around him, leading to chaos.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Lester",
            "url": "/name/nm0504513/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Comedy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWMwNjY0NTgtODFhZC00MDcxLWI2NWUtNzgxZGI3NDY3N2RmXkEyXkFqcGdeQXVyMzU4Nzk4MDI@._V1_.jpg",
    "keywords": "based on stage musical,cross dressing,identity swap,child kidnapping,kidnapping",
    "name": "A Funny Thing Happened on the Way to the Forum",
    "original_info": {
        "id": "A Funny Thing Happened on the Way to the Forum_1966",
        "name": "A Funny Thing Happened on the Way to the Forum",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LilyDaleLady"
        },
        "dateCreated": "2005-11-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060438/"
        },
        "name": "Funny, abbreviated version of the stage play",
        "reviewBody": "I hadn't seen this in twenty years, and then on TV (with many cuts and commercials), so I jumped at the chance to view a video recently. \"Funny Thing\" is just as funny as I remembered it to be -- a marvelous opportunity to see the brilliant and hilarious Zero Mostel, plus a dream cast that includes Jack Guilford, Phil Silvers, Michael Crawford (very young), Roy Kinnear, etc.\n\nZero Mostel was an incredible Broadway comedic genius, but his most famous work was probably in \"Fiddler on the Roof\", where it only exits as the wonderful Broadway cast album. When they made the film, they inexplicably passed over Mostel to cast the much lower keyed Topol as Tevye. \"Funny Thing\" is more brilliant vintage Mostel from roughly the same period, but we get the real thing as he reprises his performance. No one can really approach Mostel for his comic timing, ability to not only sing but sing FUNNY and the expressiveness of his face.\n\nDirected by Richard Lester (Hard Days' Night, Three Musketeers), the film is particularly beautiful in its period setting -- Lester had a spectacular eye for detail - and I honestly believe that this is the most realistic film ever done VISUALLY about Ancient Rome. From the credits, I see it was filmed in Madrid, Spain, which must have an incredible treasure trove of Ancient Roman buildings. The sets, costumes, extras etc. are pitch perfect....with one glaring exception. Like a lot of movies, the filmmakers could not bear to show us an attractive young woman in authentic period costume or makeup, so all the courtesans are circa 1967, right down to their blue eye shadow, false eyelashes, push up bras and back-combed hair!! \n\nI understand from reading other comments that nearly 3/4 of the Stephen Sondheim score was cut for the film, which seems like a shame. However, what's left is very funny and well-integrated into the comedy. Many popular sixties film editing techniques are here -- quick cross cuts, Keystone Kops-like action sequences -- and while a bit dated, they fit the broad comedic tone of the story surprisingly well. The ending title sequence is spectacularly done, with wonderful Roman type and fresco's integrated into it.\n\nComedy styles go in and out of fashion, so this may not be everyone's taste these days. But having a visual record of a brilliant performer is a highlight and a cultural treasure, and that's what this performance by Zero Mostel truly is. I think most people won't be able to help laughing out loud, even at some of the dumbest and corniest of jokes here, and as usual, the Sondheim score (what remains of it) is delightful and witty.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for A Funny Thing Happened On The Way To The Forum",
        "duration": "PT1M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2501942553",
        "name": "A Funny Thing Happened on the Way to the Forum",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDk2ODZkMzItODEwNy00OTlmLTgzNzItOGRhZDQ0ZWU0MDk4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDk2ODZkMzItODEwNy00OTlmLTgzNzItOGRhZDQ0ZWU0MDk4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-04-22T03:05:10Z",
        "url": "https://www.imdb.com/video/vi2501942553/"
    },
    "url": "/title/tt0060438/"
}