{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Colin Farrell",
            "url": "/name/nm0268199/"
        },
        {
            "@type": "Person",
            "name": "Dallas Roberts",
            "url": "/name/nm1316767/"
        },
        {
            "@type": "Person",
            "name": "Robin Wright",
            "url": "/name/nm0000705/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13781,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071970/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037310/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030755/"
        },
        {
            "@type": "Person",
            "name": "Michael Cunningham",
            "url": "/name/nm1259728/"
        }
    ],
    "datePublished": "2004-10-14",
    "description": "A boy who has experienced many losses in his life grows to manhood and enters into a love triangle with a woman and his boyhood friend.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Mayer",
            "url": "/name/nm1555287/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODExMzEzODA0N15BMl5BanBnXkFtZTcwMjQ2ODUyMQ@@._V1_.jpg",
    "keywords": "friendship between men,new york city,hugging,hand job,long hair",
    "name": "A Home at the End of the World",
    "original_info": {
        "id": "A Home at the End of the World_2004",
        "name": "A Home at the End of the World",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "katydid4819"
        },
        "dateCreated": "2004-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0359423/"
        },
        "name": "'Home' Not The End of the World",
        "reviewBody": "This is a small film with a small audience. After the nonsense about cutting out Colin Farrell's 'extremely distracting member' from the sex scene didn't create any new buzz, the movie was left to play to its minute slice of the pie in half empty art houses around the country. Still, just because mainstream America is too squeamish to sit through an openly gay film does not mean that the level of film-making is reflected in its box office totals.\n\nBased on his novel of the same name, Michael Cunningham has written a screenplay that, although similar to The Hours in theme, is very unique. Its focus is on our search for acceptance, for the people who define us, for a home, even if it is at the end of the world. He creates three individuals to take the same quest in their own way. The first is Jonathan (Dallas Roberts), someone who needs to be loved but resents that quality about him. It makes him susceptible to pain because he takes everything as betrayal. Next to that, he feels that his life is always second to his best friend, Bobby's. Bobby is played by notorious bad-boy, Colin Farrell in his most toned down role yet. Bobby also needs people but not in a bad way. He just feeds off others and this feeding takes its toll on Jonathan. So much so that he heads off to New York and befriends a drifter, a personality of originality named Clare. The two of them play house despite the fact that Clare is older than Jonathan and he is gay.\n\nHomosexuality is a major player in this film. And yet at the same time, it's not because only Jonathan is actually gay. Bobby would be classified as bisexual but that term comes with the same connotation as homosexual and so it is more accurate to say that Bobby just loves everyone. There is no word to describe his sexual inclination because it is not really a big enough part of him to demand a label. It does not matter  perhaps one of the larger themes here that will sadly get overlooked, as many people are not ready to embrace this yet.\n\nA Home At the End of the World is not a groundbreaker but it is a pioneer. It is one of the few movies about homosexuality, and about it in a blunt, unmasked way, that could have a chance with the more mainstream audience. It is shot with the gritty quality of the independent film but it has mainstream Colin Farrell who may just have a shot of killing two bird with one stone here: proving that he can do more than just the tabloids and bringing homosexual films to a more 'out of the closet' place among other films. Later this year he will try this same task again on a grander scale with Oliver Stone's Alexander and if that proves successful, A Home At the End of the World can be credited as the beginning of that. ***/*****",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2595488025",
        "name": "A Home at the End of the World",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWMzMzIzNTktOWZkNy00ZjVjLTlhNTAtM2Q5Y2U3MGUyZGU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWMzMzIzNTktOWZkNy00ZjVjLTlhNTAtM2Q5Y2U3MGUyZGU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T06:05:45Z",
        "url": "https://www.imdb.com/video/vi2595488025/"
    },
    "url": "/title/tt0359423/"
}