{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean Arthur",
            "url": "/name/nm0000795/"
        },
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Charles Winninger",
            "url": "/name/nm0935415/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1367,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009940/"
        },
        {
            "@type": "Person",
            "name": "Robert Ardrey",
            "url": "/name/nm0034124/"
        },
        {
            "@type": "Person",
            "name": "Jo Swerling",
            "url": "/name/nm0842485/"
        },
        {
            "@type": "Person",
            "name": "Garson Kanin",
            "url": "/name/nm0437717/"
        }
    ],
    "datePublished": "1943-08-19",
    "description": "Facing forty, a NYC spinster on a bus tour of the West encounters a handsome rodeo cowboy who helps her forget her unsuitable city suitors.",
    "director": [
        {
            "@type": "Person",
            "name": "William A. Seiter",
            "url": "/name/nm0782682/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy",
        "Romance",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDFhMGQ2M2ItODQ5YS00NjBhLWEyZjItNTMyZDkxZTcwMTdmXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg",
    "keywords": "craps,irish whiskey,tequila,screwball comedy,deception",
    "name": "A Lady Takes a Chance",
    "original_info": {
        "id": "A Lady Takes a Chance_1943",
        "name": "A Lady Takes a Chance",
        "year": "1943"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2006-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0036092/"
        },
        "name": "On the other side of Brokeback Mountain",
        "reviewBody": "Jean Arthur meets cowboy John Wayne in the 1943 comedy, \"A Lady Takes a Chance.\" Arthur is Molly, a woman with plenty of suitors, though none is a prize, who takes a cross-country bus tour - conducted by Phil Silvers. While watching a rodeo, one of the riders falls on top of her. Turns out it's a fella named Duke (John Wayne). You can just see those pathetic guys at home flash before her eyes as she pulls Wayne toward her for a closer look. She misses her bus.\n\nGiven the current talk and late-night comic jokes about \"Brokeback Mountain,\" this movie is extra fun. Wayne has no intention of marrying, though he loves to play the field, and accuses his rodeo partner Waco (Charles Winninger) of acting like \"a wife.\" When Waco advises Molly to go back where she came from and forget about Duke, he sounds like a wife trying to get rid of a mistress, though he really wants to keep her from being hurt. But though Duke does a lot of flirting, Molly learns during a night in the desert that her big competition is Sammy, Duke's horse.\n\nJean Arthur is slightly miscast as Molly, though she was too wonderful an actress to ever come off as totally miscast. Someone like Betty Grable would have been more of a natural for the role than 40+ Arthur, but then, Arthur's talent helps her make the part her own and interesting besides. Her best scene is in the bar when she drinks cactus milk - hilarious. 27 years after his death, John Wayne is still considered one of the top 10 most popular stars, and with good reason. Tall, handsome, and rugged with a boyish smile, you can see why he'd make Arthur's heart go aflutter. He's usually not listed among favorite matinée idols because he made so many westerns, but make no mistake, Wayne was a hunk in his heyday.\n\nThis isn't your 21st century cowboy movie, but it makes for entertaining viewing just the same.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0036092/"
}