{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vanessa Redgrave",
            "url": "/name/nm0000603/"
        },
        {
            "@type": "Person",
            "name": "Edward Fox",
            "url": "/name/nm0002081/"
        },
        {
            "@type": "Person",
            "name": "Uma Thurman",
            "url": "/name/nm0000235/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2517,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044085/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Trevor Bentham",
            "url": "/name/nm0072746/"
        },
        {
            "@type": "Person",
            "name": "H.E. Bates",
            "url": "/name/nm0060914/"
        },
        {
            "@type": "Person",
            "name": "Josep Llurba",
            "url": "/name/nm5462342/"
        }
    ],
    "datePublished": "1995-09-22",
    "description": "At a Lake Como resort, Miss Bentley, an attractive older guest, meets a handsome, well-to-do bachelor. But when he's more interested in a beautiful young flirt, the mischievous Miss Bentley goes to outrageous lengths to reel in he...",
    "director": [
        {
            "@type": "Person",
            "name": "John Irvin",
            "url": "/name/nm0410139/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjk3YjVmZGYtMjk3OC00OTg2LWFkNzMtMDFkYjJkOWIzNzkyXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "period drama,timeframe 1930s,villa,switzerland,nanny",
    "name": "A Month by the Lake",
    "original_info": {
        "id": "A Month by the Lake_1995",
        "name": "A Month by the Lake",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wisewebwoman"
        },
        "dateCreated": "2006-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113849/"
        },
        "name": "Into another world",
        "reviewBody": "And for me, that's what movies are all about, whether it be the Disney Cinderella that was my first movie ever, or this last, A Month by the Lake, that is the place I want to be, in some other realm outside my own experience. And this movie fulfills that desire on many fronts and also kept me guessing from beginning to end.\n\nThe performances of the cast were extraordinary in the most difficult of materials, an understated script and the repressive natures of the leads. Vanessa Redgrave -playing Miss Bentley, a beyond middle-age spinster of uncertain age - does much with this. In her outwardly almost flirtatious behaviour you catch the loneliness within, but barely. You determine she does have an interest in pursuing the major, she hears his voice in a dining room and then goes in slow pursuit but practically stands him up on the first 'date' and for no earthly reason we can determine.\n\nEdward Fox - playing Major Wilsaw a retired colonel from WW1 - has the major down pat, the peacocky walk, the clipped sentences, the fear lurking behind the eyes, all embodying the pre-war world of 1937 in Italy on Lake Como. \n\nUma Thurman, in one of her first 'airings' plays Miss Beaumont, a young woman taking a position as a nanny to a wealthy Italian family staying at the same resort as Miss Bentley and Major Wilshaw who flirts one thinks rather cruelly with the Major leading him on in boredom but does she, we wonder, when the movie takes off in unexpected directions.\n\nVanessa is sexy and wonderful, you sense there is an unstated other life underlying her character as there is with Major Wilshaw. Uma is the ingénue of a kind, an unmanageable young woman, incorrigible as another era would have it, sent to straighten herself out in Europe far away from disgracing her family in America. She is the innocent abroad, or is she. She assumes an avid interest in the photographs Miss Bentley takes of the young man in love with Miss Bentley (a scene contrived by Miss Bentley) and is astounded at Miss Bentley's capacity to captivate. \n\nIt meanders along from there with beautiful cinematography and an unforgettable tennis game. Too slow moving for many tastes. Wonderful eccentric characters - too odd for some - played to the hilt by a stellar cast. 8 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Miramax",
        "duration": "PT1M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3694527257",
        "name": "A Month By The Lake",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzUxYzQwNDQtMzRlOC00NjY4LTk0MTMtMmNmZjcyODBmOWFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzUxYzQwNDQtMzRlOC00NjY4LTk0MTMtMmNmZjcyODBmOWFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-01-31T06:03:54Z",
        "url": "https://www.imdb.com/video/vi3694527257/"
    },
    "url": "/title/tt0113849/"
}