{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Lau",
            "url": "/name/nm0490489/"
        },
        {
            "@type": "Person",
            "name": "Chien-Lien Wu",
            "url": "/name/nm0943072/"
        },
        {
            "@type": "Person",
            "name": "Man-Tat Ng",
            "url": "/name/nm0628806/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1403,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "A Moment of Romance",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007501/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033573/"
        },
        {
            "@type": "Person",
            "name": "James Yuen",
            "url": "/name/nm0950728/"
        }
    ],
    "datePublished": "1990-06-14",
    "description": "During a bank heist, the getaway driver Wah took a young woman Jo Jo hostage. After preventing her from getting killed by his accomplices, they began a forbidden relationship causing mayhem and chaos for their friends and family.",
    "director": [
        {
            "@type": "Person",
            "name": "Benny Chan",
            "url": "/name/nm0150802/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2I4NWY3YjYtNGFiNS00YTFlLTkzOWMtZWJlODE3MGExOWY0XkEyXkFqcGdeQXVyMTA5NzUzODM4._V1_.jpg",
    "keywords": "gang,motorcycle,triad,forbidden love,anti hero",
    "name": "Tin joek yau ching",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ramuna"
        },
        "dateCreated": "2008-08-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100777/"
        },
        "name": "Unforgettable Drama of Romance",
        "reviewBody": "'A Moment of Romance' is undoubtedly one of those old HK cinematic gems, but to appreciate and applaud the movie utmost, one should really understand and familiar with the origin of the movie itself. By the time around late 80's to mid 90's, plenty of HK movie appeared in theme dominated not far from Triad Flick, a sad ending love story, hard boiled gun fight action or some silly comedy (mostly by Stephen Chow and gang). AMOR in this case still follows the mainstream, combining the tragic love story in the midst of underground Triad affair. The main lead Andy Lau around that time enjoyed the peak of his popularity that he did starred in not less than 10 movies a year while the main lead Jacklyn Wu rolled in her very first debut which propelled her to stardom. Andy played Wah Dee, a young and rebellious triad member with some remorse within, while Jacklyn played Jojo, an innocent young girl come from a rich family. \n\nThe plot actually flows so lightly and in some way over dramatically, yet it never get you boring and leave a mesmerizing impressions. A coincidence encounter between Wah Dee and Jojo in a robbery went wrong lead to an endearing feeling between them. And when a love story happens between a triad member and the only heir of a wealthy family, it doesn't take a genius to get the idea of how it wasn't a silky smooth romance, amidst the conflict occurred between Wah Dee and fellow brutish gang leader Trumpet(Tommy Wong) in account of Jojo. The friendship between Wah Dee and Rambo(Richard Ng), an all time loser who normally nobody would even took a glance at, added some depth to the story and put an implicit character depiction of Wah Dee himself.\n\nThe thing that differs AMOR from movie alike is the chemistry that was too well built between characters, and on top of all is the beautiful score and unforgettable soundtrack(by the remarkable HK band Beyond and Shirley Yuen), which were perfectly fit into each scene. Andy himself never look better and perfectly match the character of a prince charming figure on a 500cc racing motor-bike, with his heart-robbing eye glance, charismatic and intriguing good-looking, in my opinion is those of very rare to be leveled even after decades. Jacklyn herself who portrays an innocent young girl in love is truly convincing both by her looks and demeanor. In short way : Perfect casts! And despite the seeming a little aged action scenes and some lines, it still delivers a powerful gesture all the way.\n\nIn conclusion, for those who are already familiar with classic 90's Hong Kong cinema, AMOR has placed itself as unforgettable cinematic experience, type of cult which you grew up with, and for those who are still unfamiliar, AMOR would be a fine introductory.\n\n-Very Highly Recommended-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0100777/"
}