{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kenneth More",
            "url": "/name/nm0603336/"
        },
        {
            "@type": "Person",
            "name": "Ronald Allen",
            "url": "/name/nm0021004/"
        },
        {
            "@type": "Person",
            "name": "Robert Ayres",
            "url": "/name/nm0044010/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15961,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021421/"
        },
        {
            "@type": "Person",
            "name": "Walter Lord",
            "url": "/name/nm0520520/"
        },
        {
            "@type": "Person",
            "name": "Eric Ambler",
            "url": "/name/nm0001907/"
        }
    ],
    "datePublished": "1958-12-16",
    "description": "On her maiden voyage in April 1912, the supposedly unsinkable RMS Titanic strikes an iceberg in the Atlantic Ocean.",
    "director": [
        {
            "@type": "Person",
            "name": "Roy Ward Baker",
            "url": "/name/nm0001928/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWRiZDljY2YtOWJiNy00OTUyLTgzMmMtMzBlYTI0YTYwYTkzL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "year 1912,ship sinking,maiden voyage,period drama,iceberg",
    "name": "A Night to Remember",
    "original_info": {
        "id": "A Night to Remember_1958",
        "name": "A Night to Remember",
        "year": "1958"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cskocik"
        },
        "dateCreated": "2004-06-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051994/"
        },
        "name": "This movie is staggering",
        "reviewBody": "I am nothing short of amazed by what the filmmakers pulled off. Before I saw this movie, I tried to write a script that would encompass the whole story of the Titanic. I had stacks of Titanic books scattered around me, a huge map of the Titanic spread out in front of me, and I was overwhelmed by the sheer mountain of anecdotes and facts and technical details and contradictions in survivors' accounts. Reconstructing the event seemed impossible, and finally I abandoned the project by the time I got to about 1:30. Then I saw A Night to Remember, and wouldn't you know, it was exactly what I was trying to do! Kenneth More's portrayal of Lightoller is perfect. Laurence Naismith is heartbreaking as Captain Smith. The factual, historical, and technical detail is so thorough that this may be the most meticulous historical movie ever made -- certainly that I have ever seen. Somehow the stark black-and-white cinematrography is more realistically convincing than James Cameron's full-color treatment, in which things are inexplicably blue. The thing that disappointed me the most about Cameron's film was the lack of reverence for the historical characters. Lightoller, my personal hero, came off as an cowardly twit, Captain Smith as an incompetent fool, Ismay as the force of all evil in the universe, and Benjamin Guggenheim's change into evening ware as an excuse to get drunk! A Night to Remember had that reverence that was so sorely lacking in Cameron's film. Lightoller is portrayed as the hero that he was. Captain Smith is a fine captain who is understandably ovewhelmed by the magnitude of the tragedy facing him. Ismay is irritating, but tries to help out and be a responsible president -- and when he jumps into the lifeboat, well, would any of us do different? And Guggenheim's final stand brings tears to the eyes. The drama of the Carpathia is as exciting as any fictional Hollywood action film. This is the only Titanic movie that addresses the problem of the Californian, and though Lordites will object to the rather anti-Lord portrayal of the events, the facts speak for themselves. If you want to be picky, you can complain that the movie doesn't go into the politics behind building the Olympic and Titanic, or the near-collision with the New York, or lots of the little personal stories, but let's be fair: the movie has two hours to tell the story of, as Walter Lord put it, \"the death of a small town.\" It's simply not possible for a movie, or even a really thick book, to cover everything. I don't think it's possible for a better movie to be made about the Titanic than A Night to Remember."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three Reasons Criterion Trailer for A Night To Remember",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3234506009",
        "name": "A Night To Remember: The Criterion Collection",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGQxYmM1YTktMzY4Yy00ZjNjLTk3NTQtOTJhYzJjOTcxYzdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGQxYmM1YTktMzY4Yy00ZjNjLTk3NTQtOTJhYzJjOTcxYzdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-08-23T03:04:54Z",
        "url": "https://www.imdb.com/video/vi3234506009/"
    },
    "url": "/title/tt0051994/"
}