{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Heather Langenkamp",
            "url": "/name/nm0000486/"
        },
        {
            "@type": "Person",
            "name": "Johnny Depp",
            "url": "/name/nm0000136/"
        },
        {
            "@type": "Person",
            "name": "Robert Englund",
            "url": "/name/nm0000387/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 246207,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057219/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039541/"
        },
        {
            "@type": "Person",
            "name": "Wes Craven",
            "url": "/name/nm0000127/"
        }
    ],
    "datePublished": "1984-11-16",
    "description": "Teenager Nancy Thompson must uncover the dark truth concealed by her parents after she and her friends become targets of the spirit of a serial killer with a bladed glove in their dreams, in which if they die, it kills them in rea...",
    "director": [
        {
            "@type": "Person",
            "name": "Wes Craven",
            "url": "/name/nm0000127/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzFjZmM1ODgtMDBkMS00NWFlLTg2YmUtZjc3ZTgxMjE1OTI2L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "sleep deprivation,slasher,serial killer,american horror,murder",
    "name": "A Nightmare on Elm Street",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kylopod"
        },
        "dateCreated": "2005-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087800/"
        },
        "name": "You'll never want to fall asleep again",
        "reviewBody": "While I love horror films, I am not a big fan of the slasher genre, which has come to dominate and indeed practically to define horror since the late 1970s. While I do love the original \"Psycho,\" most slasher films follow a different, and far more predictable, formula. The idea of a faceless killer going around stabbing teenagers just doesn't frighten me a whole lot, though some of these films do fill me with disgust--a rather different sort of emotion.\n\nI am far more frightened by films that deal with distortions of reality, where it's hard for the characters to tell what's real and what's not. Admittedly, that genre isn't always so lofty either. Dreams are one of the most overused devices in the movies, having a whole set of clichés associated with them. We are all familiar with the common scene in which a character awakens from a nightmare by jerking awake in cold sweat. This convention is not only overused, it's blatantly unrealistic, for people waking up from dreams do not jerk awake in such a violent fashion. Moreover, these scenes are usually nothing more than little throwaway sequences designed to amuse or frighten the audience without advancing the plot.\n\nWhat makes \"Nightmare on Elm Street\" so clever is how it creates an entirely new convention for representing dreams on screen. The dreaming scenes are filmed with an airy, murky quality, but so are many of the waking scenes, making it very difficult to tell whether a character is awake or asleep. Indeed, the movie never shows any character actually fall asleep, and as a result we are constantly on guard whenever characters so much as close their eyes for a moment. In crucial scenes, it is impossible to tell whether what we are seeing is real or happening only in a character's mind. But the movie ultimately suggests that the difference doesn't matter. The premise of the movie, in which a child-killer haunts teenager's dreams and has the capability of killing them while they're asleep, turns the whole \"It was all just a dream\" convention on its head: in this movie, the real world is safe, and the dream world is monstrously dangerous.\n\nThe movie finds a number of ways to explore this ambiguity, including a bathtub scene that invites comparisons with the shower scene in \"Psycho\" without being a cheap ripoff. My personal favorite scene, and one of the scariest I've ever seen in a movie, is the one where Nancy dozes off in the classroom while a student is standing up in front of the class reading a passage from Shakespeare. The way the scene transitions from the real classroom to a nightmarish version of it is brilliantly subtle.\n\nThe director, Wes Craven, understood that the anticipation of danger is usually more frightening than the final attack. There are some great visual shots to that effect, including one where Freddy's arms becomes unnaturally long in an alleyway, and another where the stairs literally turn into a gooey substance, in imitation of the common nightmare where it is hard to get away from a pursuer. The movie continually finds creative ways to tease the audience, never resorting to red herring, that tired old convention used in almost all other slasher films.\n\nDespite the creativity in these scenes, \"A Nightmare on Elm Street\" is still a formula movie, with relatively one-dimensional characters and no great performances. This was Johnny Depp's first role, as Heather Langenkamp's boyfriend, and although he does get a few neat lines of exposition (his speech about \"dream skills\"), his personality is not fleshed out, and there is no sense of the great actor Depp would go on to become.\n\nWithin the genre, however, \"A Nightmare on Elm Street\" is a fine work. My main criticism isn't its failure to transcend the formula, but its confusing and obtuse ending, apparently put there in anticipation of sequels, but managing to create a mystery that the sequels were unable to clear up. The climactic confrontation between Freddy and Nancy is weakly handled. The crucial words she says to him are surprisingly clunky, and her father's muted behavior during that scene is almost inexplicable. It has led me to consider an alternative interpretation of the scene, but one that feels like a cop-out. The scene that follows, and where the movie ends, is anticlimactic and unnecessary. These clumsily-made final two scenes come close to ruining the movie, and it is a testament to the film's many good qualities that it still stands as an unusually effective horror film that invites repeat viewings.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Teenager Nancy Thompson must uncover the dark truth concealed by her parents after she and her friends become targets of the spirit of a serial killer with a bladed glove in their dreams, in which if they die, it kills them in real life.",
        "duration": "PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi922076441",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDJiMTA3NWYtMjI2Zi00ZDU1LWI2YWUtNGIwZGZhODIwYjllXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDJiMTA3NWYtMjI2Zi00ZDU1LWI2YWUtNGIwZGZhODIwYjllXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-12-01T15:40:28.432Z",
        "url": "https://www.imdb.com/video/vi922076441/"
    },
    "url": "/title/tt0087800/"
}