{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Englund",
            "url": "/name/nm0000387/"
        },
        {
            "@type": "Person",
            "name": "Mark Patton",
            "url": "/name/nm0666593/"
        },
        {
            "@type": "Person",
            "name": "Kim Myers",
            "url": "/name/nm0616766/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 72588,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "alternateName": "A Nightmare on Elm Street 2: Freddy's Revenge",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052823/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039541/"
        },
        {
            "@type": "Person",
            "name": "David Chaskin",
            "url": "/name/nm0153883/"
        },
        {
            "@type": "Person",
            "name": "Wes Craven",
            "url": "/name/nm0000127/"
        }
    ],
    "datePublished": "1985-11-01",
    "description": "A teenage boy is haunted in his dreams by deceased child murderer Freddy Krueger, who is out to possess him in order to continue his reign of terror in the real world.",
    "director": [
        {
            "@type": "Person",
            "name": "Jack Sholder",
            "url": "/name/nm0794791/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjBmNWNiN2ItYzM0ZC00MWQyLWFmZjctMmZkNTVhMjE1ZjFhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "gay,gay subtext,pool party,sadistic coach,hairy chested man",
    "name": "A Nightmare on Elm Street Part 2: Freddy's Revenge",
    "original_info": {
        "id": "A Nightmare on Elm Street 2: Freddy's Revenge_1985",
        "name": "A Nightmare on Elm Street 2: Freddy's Revenge",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2017-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089686/"
        },
        "name": "This revenge is more damp than it is terrifying",
        "reviewBody": "The original 'A Nightmare on Elm Street' is still to me one of the scariest and best horror films there is, as well as a truly great film in its own right and introduced us to one of the genre's most iconic villains in Freddy Krueger. It is always difficult to do a sequel that lives up to a film as good as 'A Nightmare on Elm Street' let alone one to be on the same level.\n\n'A Nightmare on Elm Street 2: Freddy's Revenge' is not to me the dreadful film as reputed, but, while its attempts to do something different is admirable, it should have been much better than it turned out to be. It is very difficult to not feel disappointed when you inevitably compare 'A Nightmare on Elm Street' to its first sequel and find that the drop in quality is so significant and hard to ignore. Whether 'Freddy's Revenge' is the worst of the series is debatable, to me and many others it is one of the weaker ones. \n\n'Freddy's Revenge' is not a complete waste of time. It starts off very promisingly, with the bus scene is thrillingly unsettling. Easily the film's scariest moment and the scene one remembers the most. Robert Englund is still very freaky and shows why Freddy is so iconic as a villain, he may not be quite as terrifying but the material isn't as strong here and he is still highly effective. \n\nIt's not a bad-looking film, there is a slickness to it and there are some nightmarish effects. There are some eerie moments, though none of the rest of the film lives up to the bus scene, and some amusing dark humour. The music is suitably haunting.\n\nHowever, there are also a fair share of problems. The scares don't come enough, and while there are effective ones there are also just as many that are perfunctory and pretty tame by 'A Nightmare on Elm Street' series standards. Credit is due for trying to do something different and there are parts that do intrigue. A tighter pace and less pedestrian direction would have made the execution better, as well as trying to do less and focus more on the quality of the scares and how the story is told.\n\nJesse is such a dull damp squib of a character who lacks a quick-thinking or logical brain let alone any kind of presence. The one-note expressionless acting of Mark Patton accentuates this. The rest of the cast are nowhere near as bad, but when it comes to the acting the only one to properly rise above the material is Englund. Lastly, the ending is a slap in the face and really undoes Freddy's character, he would never do what he does at the end and it doesn't make sense for him to do it.\n\nOverall, not that bad but could have been much better. 5/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Home Entertainment",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2947809561",
        "name": "A Nightmare on Elm Street 2: Freddys Revenge",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjc1ZDc0ODAtMGJmNi00NzQ5LWIxY2UtMTgwMjZhNDA4YmVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjc1ZDc0ODAtMGJmNi00NzQ5LWIxY2UtMTgwMjZhNDA4YmVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T07:14:34Z",
        "url": "https://www.imdb.com/video/vi2947809561/"
    },
    "url": "/title/tt0089686/"
}