{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sidney Poitier",
            "url": "/name/nm0001627/"
        },
        {
            "@type": "Person",
            "name": "Shelley Winters",
            "url": "/name/nm0001859/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Hartman",
            "url": "/name/nm0366946/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9029,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0756016/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Kata",
            "url": "/name/nm0441088/"
        },
        {
            "@type": "Person",
            "name": "Guy Green",
            "url": "/name/nm0337885/"
        }
    ],
    "datePublished": "1965-12-10",
    "description": "A blind, uneducated white girl is befriended by a black man who becomes determined to help her escape her impoverished and abusive home life by introducing her to the outside world.",
    "director": [
        {
            "@type": "Person",
            "name": "Guy Green",
            "url": "/name/nm0337885/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTY2Mjk5NDYtNWFiMi00ZGNmLThjODAtODJkNzRjOTc3YjM3XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "tolerance,racial prejudice,interracial romance,park,music box",
    "name": "A Patch of Blue",
    "original_info": {
        "id": "A Patch of Blue_1965",
        "name": "A Patch of Blue",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2006-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059573/"
        },
        "name": "Color blind",
        "reviewBody": "\"A Patch of Blue\" was perhaps the best film in which Elizabeth Hartman appeared. In fact, this was the movie in which the young actress made her movie debut. Guy Green, the director, took quite a chance when he entrusted Ms. Hartman to play such an important role. Unfortunately, her career didn't do much for her as it appears Hollywood forgot her and she was relegated to do television work. In fact, Ms. Hartman only made six full length movies, when she deserved to have been seen more.\n\nThe story of \"A Patch of Blue\" is about how blind we humans are. Yes, Selina is blind, but she sees people as they really are. This abused young woman is more intelligent than she is given credit for. She might not have the use of her eyesight, yet she recognizes kindness when it comes her way without making judgment on the only true friend she encounters in her life.\n\nGordon, the nice black man who stumbles upon Selina in the park, is amazed how no one has ever paid attention to her. Clearly, he sees the potential the young woman possesses and he is determined to help her in whatever way he can. Selina, on the other hand, couldn't care less what color Gordon is because she has seen beauty in the way he tries to give her the chance in life her own mother didn't bother to get.\n\nRose-Ann, the mother is only interested in her own needs. She is a sad woman who is saddled by a daughter that she sees as a burden, yet, she is the one that caused the blindness because of her careless actions. Rose-Ann is a prejudiced woman who judges Gordon too quickly without even investigating how he is trying to help Selina.\n\nThe film will not disappoint. Ms. Hartman did an excellent contribution to a film despite her inexperience. Sidney Poitier made a sympathetic Gordon real. Shelley Winters, who won the Oscar for this film doesn't have much to do, and even though she does good work, one has to be leery of those Academy members that voted her the best supporting actress of that year when she deserved accolades for many other excellent contributions to films she did before this one.\n\n\"A Patch of Blue\" owes a great deal to its director, Guy Green, who fought to make the film and for having Elizabeth Hartman in it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this drama starring Sidney Poitier",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi513017369",
        "name": "A Patch of Blue",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2VhOTI1M2QtMDA0ZS00OTRhLWFlYzItMWM0NDY2NmRkZGU4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2VhOTI1M2QtMDA0ZS00OTRhLWFlYzItMWM0NDY2NmRkZGU4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-07-05T03:03:36Z",
        "url": "https://www.imdb.com/video/vi513017369/"
    },
    "url": "/title/tt0059573/"
}