{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Montgomery Clift",
            "url": "/name/nm0001050/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Taylor",
            "url": "/name/nm0000072/"
        },
        {
            "@type": "Person",
            "name": "Shelley Winters",
            "url": "/name/nm0001859/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23431,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Theodore Dreiser",
            "url": "/name/nm0237439/"
        },
        {
            "@type": "Person",
            "name": "Patrick Kearney",
            "url": "/name/nm0443966/"
        },
        {
            "@type": "Person",
            "name": "Michael Wilson",
            "url": "/name/nm0933858/"
        }
    ],
    "datePublished": "1951-11-09",
    "description": "A poor boy gets a job working for his rich uncle and ends up falling in love with two women.",
    "director": [
        {
            "@type": "Person",
            "name": "George Stevens",
            "url": "/name/nm0828419/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmNjMjE2ZDMtODQzYS00ZDc2LTk0ODgtNjI1NTNhZWI5MmE0XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "high society,social climber,murder of a pregnant woman,pregnancy,murder trial",
    "name": "A Place in the Sun",
    "original_info": {
        "id": "A Place in the Sun_1951",
        "name": "A Place in the Sun",
        "year": "1951"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bmacv"
        },
        "dateCreated": "2003-09-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0043924/"
        },
        "name": "An American Tragedy, on film, becomes an American masterpiece",
        "reviewBody": "Bringing Theodore Dreiser's sprawling novel An American Tragedy to the screen must have been a daunting task, made harder by the constraints Paramount imposed on director George Stevens. The studio had lost big on a version made 20 years earlier, under Josef von Sternberg, and had little faith in a remake. So, hobbled by a tight budget, Stevens scaled back his ambitious plans but delivered, perhaps even to his own surprise, a superbly crafted and and powerfully sustained work of movie art.\n\nHe was lucky that Paramount, edgy about the story, gave him a cast that would guarantee not only good box office but solid performances as well. Montgomery Clift, Elizabeth Taylor and Shelly Winters take the principal roles, with, in the last third of the movie, extra oomph courtesy of Raymond Burr (in a role that may have nabbed him the Perry Mason franchise).\n\nThe jaws of the vise Clift finds himself squeezed into are class and sex. Barely educated, raised by stern members of a religious sect, he luckily (or not) happens to be the shirt-tail nephew of a prosperous entrepreneur who casually offers him work in his factory. Awkward and lonesome, Clift escapes the drudgery of his job by taking up with a mousy co-worker (Winters, toned way down from her platinum-bombshell image at the time). But his nose-to-the-grindstone ways attract the attention of his uncle, who rewards him with a promotion and an invitation up to the manor.\n\nThere he meets Taylor and launches an obsession about her, reinforced by a neon sign visible from his window that blazes her surname through his restless nights (she's another child of an industrial fortune, raised in wealth and privilege). Somehow, she falls for him  and, need it be added, he for her  despite his coming from the wrong side of the tracks (she hasn't the faintest notion that for people like him, life may not be the blithe affair it is for her). \n\nOnly one inconvenient fact keeps Clift from taking his rightful place in the sun: He's left Winters pregnant. The two worlds he occupies are destined to collide, and crash they do when Winters phones him, in the midst of a Hawaiian-themed luau at Taylor's summer place on the lake, to issue her ultimatum: Marry her or she'll spill their sordid secret. He leaves abruptly to meet Winters, desperately trying to assemble the plan which will seal three fates.\n\nStevens sustains an overwhelming, ominous momentum, unbroken by even a hint of levity (not even a single bit player is allowed to lapse into shtik). Languorous dissolves and superimposed images heighten the sense of inevitability as each scene, each event glides seamlessly into the next. \n\nMaybe he wasn't able to pile on the exhaustive social commentary that bulked up Dreiser's novel, but everywhere there's sharp detail that he adroitly leaves to be noticed. When Clift shows up hours late at his intimate birthday party in Winter's cramped room, with the tiny table pushed up against her marble washstand, the ice cream has warmed to lumpy syrup (a self-homage to a similar scene in Steven's Alice Adams?). With an island combo playing merrily on, Clift sports a lei and eats pineapple out of its shell when Winters calls to break the spell  and this South-Seas reverie is offered up not as Veblenesque excess, but merely as the way Taylor's crowd spend their days and evenings and nights in an endless round of heedless gaiety.\n\nThe apex of the film's crescendo is handled with tight, quiet assurance  the reckoning in a rowboat upon a deserted lake. Dusk gathers among the pines like fog, the loons call back and forth, and the rippling waves reflect a demented flash into Clift's eye as he wrestles with his conscience. Winters natters nervously about the dreary life they'll spend together while his head swims with luminous visions of Taylor. Then, destiny catches.... Romantic but unsentimental, serious but without pretension, gripping without stooping to the manipulative, A Place in the Sun ranks as a masterpiece of American cinema.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3777412633",
        "name": "A Place in the Sun",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGM1ODcxODctYzBjMS00MzAwLTgzMDctMmQ2YjRmODdiMzA5XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGM1ODcxODctYzBjMS00MzAwLTgzMDctMmQ2YjRmODdiMzA5XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-16T18:31:07.402Z",
        "url": "https://www.imdb.com/video/vi3777412633/"
    },
    "url": "/title/tt0043924/"
}