{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Starletta DuPois",
            "url": "/name/nm0210915/"
        },
        {
            "@type": "Person",
            "name": "Lou Ferguson",
            "url": "/name/nm0272518/"
        },
        {
            "@type": "Person",
            "name": "John Fiedler",
            "url": "/name/nm0275835/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 235,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057924/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0484663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070382/"
        },
        {
            "@type": "Person",
            "name": "Lorraine Hansberry",
            "url": "/name/nm0360605/"
        }
    ],
    "datePublished": "1989-02-01",
    "description": "A substantial insurance payment could mean either financial salvation or personal ruin for a poor black family.",
    "director": [
        {
            "@type": "Person",
            "name": "Bill Duke",
            "url": "/name/nm0004886/"
        }
    ],
    "duration": "PT2H51M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTE4OTgwODU1MV5BMl5BanBnXkFtZTcwMzY4OTQyMQ@@._V1_.jpg",
    "keywords": "drama episode,racism,racial tension,racial discrimination,racial prejudice",
    "name": "A Raisin in the Sun",
    "original_info": {
        "id": "A Raisin in the Sun_1989",
        "name": "A Raisin in the Sun",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "HotToastyRag"
        },
        "dateCreated": "2021-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098166/"
        },
        "name": "Just as good as the original",
        "reviewBody": "I've seen the original 1961 film A Raisin in the Sun a few times, because, even though it is hard to watch, I'm a sucker for excellent acting. When I found a copy of the 1989 American Playhouse live television performance, I was very excited to watch it. Starring Danny Glover, Esther Rollins, and Starletta DuPois, and Kim Yancey, this rendition is top-notch. The original paired the play down to two hours, but this version is a full, un-abridged three hours. You'll meet an entirely new character, Esther's neighbor and friend, who provides an interesting viewpoint on the family's desire to move to a white neighborhood. You'll also see more scenes with Kim and her suitor, Lou Ferguson. In the 1961 film, the sister's character was definitely reduced to a supporting role. In the full play, you can argue that each of the four leads have equal screen time.\n\nI really liked all the actors' interpretations of the characters. In only the second adaptation to be filmed, they were all very conscious of their predecessors. All but one of the 1961 cast members were still alive in 1989; and in fact, John Fiedler (you'll recognize his voice) reprised his role as the board representative twenty-eight years later! The bare bones of the original actors can still be seen, but the modern actors put their own muscles into the roles. Esther still comes across as a long-suffering mom, but her demeaner is softer and more innocent. Because of her vulnerability, you're able to see Danny's frustration as he acts as the man of two houses (for his wife and his mother). Starletta really plays up the female bonding, and we're able to see her lack of privacy while the other characters pulling her in different directions.\n\nIn essence, the play shows a family of four adults, each feeling they have no identity. Esther's children are grown, so she's no longer useful as a mother; and as a recent widow, she's no longer a wife. Danny feels the pressure of providing for his family, but he doesn't feel like a man. Kim has a thirst for knowledge; when she understands her past, will it influence her future? Starletta is simultaneously daughter-in-law, mother, wife, and domestic worker. On the inside, who is she really?\n\nBoth the 1961 and 1989 casts are made up of very talented men and women, so if you've never seen this play, I'd wholeheartedly recommend either one. Pick which cast you're drawn to and get ready for a very well-acted, heavy drama. It breaks your heart every time you watch it, even when you know what's going to happen.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "timeRequired": "PT2H51M",
    "url": "/title/tt0098166/"
}