{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Williams",
            "url": "/name/nm0931437/"
        },
        {
            "@type": "Person",
            "name": "Barely Legal",
            "url": "/name/nm0499163/"
        },
        {
            "@type": "Person",
            "name": "Midnight Insanity",
            "url": "/name/nm0409362/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 56,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0311593/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035748/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047750/"
        },
        {
            "@type": "Person",
            "name": "Scott Mabbutt",
            "url": "/name/nm0531056/"
        }
    ],
    "description": "The fans speak out about their favorite obsession.",
    "director": [
        {
            "@type": "Person",
            "name": "Scott Mabbutt",
            "url": "/name/nm0531056/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ0NjY2ODYwMF5BMl5BanBnXkFtZTcwNzM2MjAyMQ@@._V1_.jpg",
    "keywords": "fan",
    "name": "A Regular Frankie Fan",
    "original_info": {
        "id": "A Regular Frankie Fan: Rocky Horror Lives On_2000",
        "name": "A Regular Frankie Fan: Rocky Horror Lives On",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lanetsurfer"
        },
        "dateCreated": "2000-10-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0253555/"
        },
        "name": "`A Regular Fankie Fan' a wild and wonderful documentary.",
        "reviewBody": "I went to a preview of `A Regular Fankie Fan' and I had a wonderful time.\n\nThis is an audience participation documentary about the fans of `Rocky Horror Picture Show' that perform the movie live, in full make-up and costume, while the audience participates by quoting lines of the film as they happen during this 'acting out of' this unusual experience.\n\nIt was very intriguing to be able to know what goes on at a `Rocky Horror' show without actually going there. This documentary follows different casts that perform the film live for audiences while the film is being showed. There are interviews of the different casts and audience members.\n\nThrough this documentary I found out there are live pre-shows and many patrons dress up as members of the cast as well. The cast and guests during the evening get together to find out who has been to a showing before and who has not.\n\nDuring the preview I saw, as with going to a showing of `Rocky', the audience was very verbal. I found through watching this documentary, this is a common occurrence for `Rocky Horror' fans. The guests quote the film and new scripted responses the fans have made up to say during the show. Also, many of the guests have props to use.\n\nThis is more than just going out to see a movie. It's more like going to a wild party where you don't know what might happen. This documentary allows you to experience many of the elements that occur for a better understanding of a showing of the `Rocky Horror Picture Show'.\n\nAs a `virgin' to this experience, I found this documentary a delight and it made me feel as if I was right there where the action was taking place. I believe this documentary completed a goal because now I wish to go to a late night-live showing of `Rocky'.\n\nI give this documentary a perfect 10. It inspired me to go do something I would other wise not go and do.\n\nGo see this film for a truly inspiring view of the human experience and to be motivated to experience it first hand.\n\nThank you for shooting this documentary.\n\nMichael Walters",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0253555/"
}