{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Sellers",
            "url": "/name/nm0000634/"
        },
        {
            "@type": "Person",
            "name": "Elke Sommer",
            "url": "/name/nm0813961/"
        },
        {
            "@type": "Person",
            "name": "George Sanders",
            "url": "/name/nm0001695/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29109,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011112/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025100/"
        },
        {
            "@type": "Person",
            "name": "Blake Edwards",
            "url": "/name/nm0001175/"
        },
        {
            "@type": "Person",
            "name": "William Peter Blatty",
            "url": "/name/nm0087861/"
        },
        {
            "@type": "Person",
            "name": "Harry Kurnitz",
            "url": "/name/nm0475823/"
        }
    ],
    "datePublished": "1965-07-23",
    "description": "A clumsy, inept detective is hired to investigate the murder of a chauffeur at a country home.",
    "director": [
        {
            "@type": "Person",
            "name": "Blake Edwards",
            "url": "/name/nm0001175/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDE5Njk1NDQ5MF5BMl5BanBnXkFtZTcwNjAyMTMyNA@@._V1_.jpg",
    "keywords": "sequel,inspector,murder,detective,comic hero",
    "name": "A Shot in the Dark",
    "original_info": {
        "id": "A Shot in the Dark_1964",
        "name": "A Shot in the Dark",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Poseidon-3"
        },
        "dateCreated": "2005-01-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058586/"
        },
        "name": "Sequel? Prequel? Hard to tell, but it has some laughs",
        "reviewBody": "The germination of the \"Pink Panther\" series of comedic mystery films is a complicated one. The first film in the series, \"The Pink Panther\", was actually the second one to be filmed! This film, \"A Shot in the Dark\", was originally intended to be the adaptation of a stage play, but director Edwards and actor Sellers refit the main character to accommodate the persona of Inspector Clouseu, which they were developing for \"The Pink Panther\". However, when the film was completed, it wasn't released and was deemed unfunny. Then when \"The Pink Panther\" was a hit, the studio released \"A Shot in the Dark\" as a sequel and a series was born. This explains why elements from the first film are absent from the second (Mrs. Clouseu anyone?) and why the second (actually first!) set the tone for the following films more than the first (actually the second! Confused yet?) Here, Sellers is front and center as the hapless and ever-clumsy Inspector. Freed from sharing screen time with a higher billed co-star (David Niven in the previous film) and without a particularly coherent plot to follow, he is allowed to engage in pratfall after pratfall and scenario after goofy scenario. Today's audiences may not completely go for the subtle, meticulously timed method of comedy shown here with emphasis on set up and repetitiveness, but patient and observant audience members should still find the film funny. By now, so much of the material has been cribbed or expanded upon, some of the edge is lost, but enough of the humor and situational gags are amusing enough to make the film worthwhile. Sellers insists upon the innocence of curvy stunner Sommer, a maid who has been found in a locked room with a dead body and a smoking gun in her hand. Time after time, he lets her out of prison and the body count increases. His thorough incompetence drives his superior (Lom) to insanity. Sommer's employer Sanders, a man of great wealth and taste, is also appalled by the bumbling Sellers, never more so than when he manages to practically trash a billiard room during a friendly game. One famous sequence has Sellers tracking Sommer down in a nudist colony. The modest Inspector navigates the idyllic hideaway using any available object to cover himself as the campers frolic behind shrubs and other props. Reed glams it up, but gets little to do as Sanders' bitchy wife. Another memorable sequence has Sellers and Sommer on a date with victim after victim falling prey to an assassin that's after Sellers. It's all a farcical enterprise that one must be in the mood for to fully enjoy. Otherwise, it becomes a little tiresome, but fans of physical comedy ought to lap it up. The remaining sequels were all sort of hybrids of \"The Pink Panther\" mixed with \"A Shot in the Dark\" and had fair success until the death of Sellers made it difficult to continue (but continue they did, using outtakes and other footage of the man! Anything to make a buck!) Henry Mancini provided some nice music, notably over the animated title sequence."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Inspector Jacques Clouseau investigates the murder of Mr. Benjamin Ballon's driver at a country estate.",
        "duration": "PT3M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1049412377",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDc3YjAyMjgtMjExZS00ZWNkLTlhOTQtZGE3MmYyYjA5ZDEyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDc3YjAyMjgtMjExZS00ZWNkLTlhOTQtZGE3MmYyYjA5ZDEyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-25T23:19:52.566Z",
        "url": "https://www.imdb.com/video/vi1049412377/"
    },
    "url": "/title/tt0058586/"
}