{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Miguel Ángel Solá",
            "url": "/name/nm0813691/"
        },
        {
            "@type": "Person",
            "name": "Pepe Soriano",
            "url": "/name/nm0815008/"
        },
        {
            "@type": "Person",
            "name": "Martín Coria",
            "url": "/name/nm0179848/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 115,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "A Shadow You Soon Will Be",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072972/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064529/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137969/"
        },
        {
            "@type": "Person",
            "name": "Héctor Olivera",
            "url": "/name/nm0647055/"
        },
        {
            "@type": "Person",
            "name": "Osvaldo Soriano",
            "url": "/name/nm0815023/"
        }
    ],
    "datePublished": "1994-05-05",
    "description": "A computer programmer who, after his train breaks down, takes to wandering aimlessly through remote regions of La Pampa, Viedma and Carhue. he meets a succession of equally lost souls, including a globe-trotting gambler, a circus ...",
    "director": [
        {
            "@type": "Person",
            "name": "Héctor Olivera",
            "url": "/name/nm0647055/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxNzg1OTg0OV5BMl5BanBnXkFtZTcwMTk3NjAwMQ@@._V1_.jpg",
    "keywords": "watching tv,loss of child,circus,train,tarot card",
    "name": "Una sombra ya pronto serás",
    "original_info": {
        "id": "A Shadow You Soon Will Be_1994",
        "name": "A Shadow You Soon Will Be",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Oskado"
        },
        "dateCreated": "2002-06-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111236/"
        },
        "name": "One of the best - Una de las majores peliculas de todo tiempo",
        "reviewBody": "With the wanderer bleakness of a Sábato's \"Héroes y Tumbas\" - or better, with the \"end of the road\" tristesse, gallows-humor and absurdity of Onetti's \"Cuando ya no importe\" - piense en \"Que el ultimo en irse apague la luz\" (Montevideo's epitaph spray-painted on a marble wall of the airport) - but with a tanguero's nostaglia, a comradery and heartbreak of lost souls, a Cono Austral vision reminiscent of Hamsun's \"Mysterier\", of Kafka's \"Prozess\" (The Trial), but with the light, the perpetual wind, the sunsets, the rustic semi-ghost towns of Pampas, and an absurd, poetic love of life that despite all I suppose places it closer to Fellini - as though life were a concatenation of operatic scenes, mostly \"recitativo\", but interspersed with intimiate scenes, touching moments of failed dreams and haunting illusions, arias of exquisite beauty - evoked through the eye of an artist: quaint, charming, touching, sensual, eternal, all defining the question of life as a subtle joke. The final artistic trick is the knack of a graceful and timely exit, before the actor and his scene - his role on this stage called \"earth\" become grotesque. How did Shakespeare put it? And in how many words, how many scenes, how many emotions?\n\nI haven't time to compose a proper critique - whatever - so scribble the above shreds of thought hoping they produce some intuitive vision of the magnificent - but simple, low-budget, humanistic work of art that is this film. I see no way to improve it. I wish there were more like it.\n\nThough how many could I take? At least a year has past, yet I still haven't recovered from \"Butterfly\" - Jose Luis Cuerda's (Spain) equally simple but abrumadora pelicula. I feel like crying to think of it. \"Sombra\", on the other hand, I can see (and have seen)again and again and again - savoring many scenes, especially at the end. \"Butterfly\", I may never watch again - its scars go deep."
    },
    "url": "/title/tt0111236/"
}