{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amy Irving",
            "url": "/name/nm0001388/"
        },
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        },
        {
            "@type": "Person",
            "name": "Andy Garcia",
            "url": "/name/nm0000412/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 817,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038943/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Anne Nelson",
            "url": "/name/nm0625151/"
        },
        {
            "@type": "Person",
            "name": "Evan Jones",
            "url": "/name/nm0428056/"
        },
        {
            "@type": "Person",
            "name": "John Strong",
            "url": "/name/nm0834939/"
        }
    ],
    "datePublished": "1990-05-11",
    "description": "An American journalist in Puerto Rico in 1978 investigates the death of nationalists who may have been murdered by the police.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruno Barreto",
            "url": "/name/nm0000853/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzk3NDdhYjUtYjM4MS00MzM5LTg5YzAtN2Q4MDA1NzA1MDFjXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "murder,gun,television reporter,parade,crying woman",
    "name": "A Show of Force",
    "original_info": {
        "id": "A Show of Force_1990",
        "name": "A Show of Force",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2015-04-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100606/"
        },
        "name": "didn't hold my interest",
        "reviewBody": "Despite a cast of young hopefuls and established actors, \"A Show of Force\" from 1990 did not hold my interest. To me this looked like a TV movie, and the script was weak.\n\nA Show Of Force is a fictionalization of an actual incident that took place in 1978 in Puerto Rico. At that time on Puerto Rico's Constitution Day, the police allegedly shot and killed two Independista Terrorists who were planning a big attack, one that would arouse the Puerto Rican people to revolution.\n\nThe film purports to tell the true story of a planned coup in Puerto Rico by those who wanted independence. The so-called terrorists, on Constitution Day, were going to take over the main TV station and broadcast a message for independence. \n\nIt was actually organized by an undercover cop, Jesus Fuentes(Lou Diamond Phillips), who had infiltrated the group. Twp students are killed, and some influential people seem to be sanctioning his activities.\n\nA reporter, Kate Melendez (Amy Irving) is a fictional character created for the purposes of the film. She plays a widow from the states whose husband was a lawyer for the Independence movement. \n\nShe suspects some dirty work, and though Fuentes attempts to frighten her, his tactics don't work. To protect her, her boss (Robert Duvall) takes her off the story, but she goes to another network and convinces them to televise the trial.\n\nThis film is violent and cheap-looking. Kevin Spacey, around the time his work in \"Wiseguy\" brought him fame, has a supporting role. In smaller roles: Irving's mother, Prscilla Pointer, Erik Estrada, and Andy Garcia.\n\nThe acting is very good, and all the actors deserved better. Amy Irving is a wonderful actress and an underrated one. Phillips, Duvall, and Phillips each do a great job.\n\nVery gritty - not for everyone.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0100606/"
}