{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Asuka Kurosawa",
            "url": "/name/nm0475900/"
        },
        {
            "@type": "Person",
            "name": "Yûji Kôtari",
            "url": "/name/nm0463482/"
        },
        {
            "@type": "Person",
            "name": "Shin'ya Tsukamoto",
            "url": "/name/nm0875354/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4959,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "A Snake of June",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019982/"
        },
        {
            "@type": "Person",
            "name": "Shin'ya Tsukamoto",
            "url": "/name/nm0875354/"
        }
    ],
    "datePublished": "2003-06-13",
    "description": "A woman is being stalked by a stranger. His stalking turns to blackmail when he sends her copies of photos of her in an embarrassing position. Now he controls her and she has to do anything he says. Anything.",
    "director": [
        {
            "@type": "Person",
            "name": "Shin'ya Tsukamoto",
            "url": "/name/nm0875354/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjFkYjkwMWMtNzAxYi00YjMxLWFhODEtNThmOTdjN2JjMGIxXkEyXkFqcGdeQXVyMTIyNzY1NzM@._V1_.jpg",
    "keywords": "female frontal nudity,sexual blackmail,woman wears a micro miniskirt,humiliation,japanese erotica",
    "name": "Rokugatsu no hebi",
    "original_info": {
        "id": "A Snake of June_2002",
        "name": "A Snake of June",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2009-10-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0330904/"
        },
        "name": "Life Is to Be Lived in Its Plenitude",
        "reviewBody": "In Tokyo, Rinko Tatsumi (Asuka Kurosawa) is a married woman that works in the County Mental Help Center helping needy people. Her husband Shigehiko (Yuji Koutari) is an old man obsessed with cleaning and they have a quite inexistent sexual life, sleeping in separate bed. Out of the blue, Rinko receives an envelope with erotic pictures she took once in the past while modeling and a cellular. She receives a phone call and the man blackmails her, promising to give the negatives to her if she follows his instructions. She is forced to wear miniskirt without panties; to buy a vibrator and use it, walking and exposing to costumers of a department store. The man delivers her photos and tells that he is Iguchi (Shinya Tsukamoto), who is dying of stomach cancer that was saved by her advice; in return he asks her to go to her doctor. Rinko realizes that she has breast cancer and needs to remove one breast. When she tells Shigehiko, he gives a cold reception to the idea. Then the blackmailer contacts Shigehiko, forcing him to follow his instructions. \n\n\"Rokugatsu no Hebi\", a.k.a. \"A Snake of June\", is a surrealistic erotic movie that follows the style of David Lynch, with bizarre sequences and characters. This is the first work of the director Shinya Tsukamoto that I have watched and this is the type of \"love or hate\" cult-movie. The stylish cinematography uses blue filter in the rainy season of Tokyo, giving the mood of sadness and nightmarish atmosphere to the weird story. Asuka Kurosawa is absolutely sexy breathing eroticism in the sequences that she follows the instructions of the blackmailer. There are many metaphoric scenes without explanation, but I believe that the major idea of the story is that life is to be lived in its plenitude since we may die on the next minute of our existence. My vote is eight.\n\nTitle (Brazil): Not Available",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0330904/"
}