{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gong Li",
            "url": "/name/nm0000084/"
        },
        {
            "@type": "Person",
            "name": "Fang-Tsen",
            "url": "/name/nm0148219/"
        },
        {
            "@type": "Person",
            "name": "Shichang Da",
            "url": "/name/nm0196340/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 444,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "A Soul Haunted by Painting",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078389/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038809/"
        },
        {
            "@type": "Person",
            "name": "Min Anqi",
            "url": "/name/nm0030488/"
        },
        {
            "@type": "Person",
            "name": "Shuqin Huang",
            "url": "/name/nm0399044/"
        },
        {
            "@type": "Person",
            "name": "Ziyu Li",
            "url": "/name/nm0508578/"
        }
    ],
    "datePublished": "1995-08-30",
    "description": "At the beginning of the twentieth century, Yu-liang leaves a brothel in a small Chinese town, to become the second wife of Mr. Pan. While Pan is away at the revolution in Yunnan, Yu-liang learns to paint and takes art classes at t...",
    "director": [
        {
            "@type": "Person",
            "name": "Shuqin Huang",
            "url": "/name/nm0399044/"
        },
        {
            "@type": "Person",
            "name": "Yimou Zhang",
            "url": "/name/nm0955443/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWFmMzI5ZDQtMjFkZC00NjE1LWEwZTktN2QzMjE1NjBiMzEzXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg",
    "keywords": "brothel,shanghai arts institute,self portrait,chinese,painting",
    "name": "Hua hun",
    "original_info": {
        "id": "A Soul Haunted by Painting_1995",
        "name": "A Soul Haunted by Painting",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "samyanari"
        },
        "dateCreated": "2003-01-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107158/"
        },
        "name": "The first Chinese woman artist to be acclaimed in Europe",
        "reviewBody": "Gong Li, as Pan Yuliang, and Zhang Yimou, as \"Supervisor\", add their prestige to this film by woman director Huang Shuqin. It seems than many film productions have been planned in China, too many stressing the lurid brothel background of the artist.\n\nThis film dramatizes the turbulent life of Pan Yuliang (1899-1977), the first Chinese woman artist to be recognized in Europe.\n\n Faced with the dismal future as a prostitute, Yuliang (Gong Li), a maid in a brothel, suddenly finds refuge/ happiness with well-bred/ compassionate Pan Zanhua (Er Dongsheng), a customs official. In an attempt to quell gossip he makes her his second wife. Yet, they are forced to move to Shanghai where he teaches her to read and write and introduces her to Hong, a Western style painter. She shows talent in painting nudes at the Shanghai Art Institute, until it is closed by prudish authorities.\n\n Unable to bear a son for Zanhua, Yuliang encourages him to `return' to his first wife (Shen Hairong). She then goes to France on a government art scholarship. (She actually received top scores at the Nat'l Art School in Paris and then received a Rome scholarship.) After several years, she has gained peer recognition.\n\nIn Nanjing, Yuliang is welcomed back by Zanhua and idolized by art students as a professor of art in the National Central University. Her happiness is short-lived when her work is discredited because of her brothel background and by a China not ready for Western Art. She and Zanhua make the heart-breaking decision to separate.\n\nYuliang returns to Paris to remain for decades in poverty, totally devoted to art. Her culminating triumph, shared with her long-time friend Wang Shouxin (Shichang Da), was her exhibition at the prestigious Musée D'Orsay.\n\nIn a sub-plot, He Qiong (Zunxia Gao), is the artist friend in Shanghai who urges Yuliang to go with her to Paris. There, Yuliang is unable to help Qiong who is victimized by a Chinese wheeler-dealer in arts. **************************************\n\nHer wish to have her work given to the Peoples' Republic of China was fulfilled in 1985. There have been >20 exhibitions of her work, including controversial nudes, in various cities in China and Taiwan. `She has become a household name in China'.\n\nFor the sake of art, it is \"fortunate\" that Pan Yuliang remained a self-exile in France. It is not likely that she and her paintings would have survived the Cultural Revolution.\n\nArticles on Pan Yuliang and some of her distinctive paintings can be found on Internet: \"Pan Yuliang\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0107158/"
}