{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vivien Leigh",
            "url": "/name/nm0000046/"
        },
        {
            "@type": "Person",
            "name": "Marlon Brando",
            "url": "/name/nm0000008/"
        },
        {
            "@type": "Person",
            "name": "Kim Hunter",
            "url": "/name/nm0001375/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 110361,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "M/PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031761/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Tennessee Williams",
            "url": "/name/nm0931783/"
        },
        {
            "@type": "Person",
            "name": "Oscar Saul",
            "url": "/name/nm0766665/"
        }
    ],
    "datePublished": "1951-09-19",
    "description": "Disturbed Blanche DuBois moves in with her sister in New Orleans and is tormented by her brutish brother-in-law while her reality crumbles around her.",
    "director": [
        {
            "@type": "Person",
            "name": "Elia Kazan",
            "url": "/name/nm0001415/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzk2M2Y3MzYtNGMzMi00Y2FjLTkwODQtNmExYWU3ZWY3NzExXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "mental illness,sister sister relationship,histrionic personality disorder,brother in law sister in law relationship,middle aged woman",
    "name": "A Streetcar Named Desire",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "frankwiener"
        },
        "dateCreated": "2016-08-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0044081/"
        },
        "name": "\"Where I'm Not Wanted and Ashamed to Be\"",
        "reviewBody": "\"Streetcar Named Desire\" is an exceptional film, thanks to three essential components: (1) the superb acting ability of its two leads, Vivien Leigh and Marlon Brando, as well as that of the supporting cast, small in number but huge in its combined dramatic power, (2) an excellent screenplay by the original playwright, Tennessee Williams, that is packed from beginning to end with explosive, conflict driven dialogue, and (3) the brilliant direction of Elia Kazan who so skillfully brings the play to the screen.\n\nIn its legendary opening, Blanche DuBois (Vivien Leigh) emerges from a cloud of locomotive smoke and is helped onto a streetcar by a perfect stranger, a sailor. This simple act neatly ties the film's beginning to Blanche's final, heartbreaking line, \"I have always depended upon the kindness of strangers\". She, as the central character, is lost in the big city, and she becomes more and more hopelessly adrift in the world as the film approaches its very tragic end.\n\nBroke and friendless, Blanche lands in New Orleans where her sister, Stella (Kim Hunter) lives with her coarse, crude husband, Stanley Kowalski (Brando). Having lost her ancestral home on account of family-related debt and having been dismissed under vague circumstances from her position as a high school English teacher in the small Mississippi town from where she came, she has no other place to go at a time of dire need.\n\nAlthough Stella is genuinely concerned about Blanche's declining physical and mental state, the shabby apartment where she lives with Stanley consists of two small rooms, barely enough space for the Kowalskis even without Stanley's regular poker group, which seems to park itself there at every available opportunity. What makes matters worse is Stanley's loud and boisterous personality. From the start, Stanley resents the presence of Blanche, which he views as an unwanted, disruptive invasion of his marriage and his home. He regards her with total distrust and disdain. Another reviewer here interpreted this as a cultural clash between the old and the new South, and I think that is a very astute observation. In any case, Stanley is totally unsympathetic to Blanche's plight and looks upon her with nothing but suspicion and contempt.\n\nBlanche is trapped in the claustrophobic and confining prison of the dingy Kowalski apartment. For one, fleeting moment, she believes that Mitch (Karl Malden), Stanley's poker buddy and co-worker, stands as her one bright hope of liberation from the walls that continue to close around her, but he turns out to be anything but her desperately needed \"knight in shining armor\". Tragically, Mitch, a weak individual who is still dominated by a strong mother well into his adulthood, is the last person with the ability to give Blanche the love and strength that she so urgently needs and to whisk her away from the stifling, debilitating atmosphere of the Kowalski dungeon. Blanche's one, last hope for personal redemption soon fades away forever.\n\nI read that, under different circumstances, the lead roles could have been awarded to Olivia de Haviland and John Garfield. As much as I like them both, this would have been a much different movie with them as the leads. Ms. Leigh, a stunning Englishwoman who managed to score two Oscars for playing two iconic, southern American characters, portrays a mentally declining Blanche with great depth and compassion. As to Mr. Brando's brutish and obnoxious Stanley, you've got to see him in action to appreciate his magnificent performance. As in the case of his Terry Malloy in \"On the Waterfront\", I don't believe that Stanley's most famous lines from this film would be among the most imitated to this day if they weren't delivered so dynamically by Brando in the first place. \"Hey, Stel-la!\" Sorry. I just couldn't help myself.\n\nWhile Brando was beaten out of the Oscar by Humphrey Bogart in \"African Queen\" (not my favorite Bogey movie by a long shot), Leigh, Malden, and Hunter swept the awards for their performances here and deservedly so. The memorable role of feisty neighbor Eunice also launched Pat Hillias's successful career throughout the golden age of television during the 1950's until her tragic and untimely death in 1960.\n\nIf you want to watch an unforgettable rendering of a strong, intense script that is worthy of such a talented cast and director, don't miss this one.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3668492057",
        "name": "A Streetcar Named Desire",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDA3YmQ0ZDEtZWRmNC00ZjYwLTg3YjAtOTQyNWZmMzdkMjM1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDA3YmQ0ZDEtZWRmNC00ZjYwLTg3YjAtOTQyNWZmMzdkMjM1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-09-10T17:16:53.332Z",
        "url": "https://www.imdb.com/video/vi3668492057/"
    },
    "url": "/title/tt0044081/"
}