{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Supinder Bedi",
            "url": "/name/nm7322840/"
        },
        {
            "@type": "Person",
            "name": "Narinder Samra",
            "url": "/name/nm0760235/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "datePublished": "1999-10-28",
    "description": "The story interweaves excellent Nusrat performance footage and a rare behind the scene glimpse into Nusrat's life. Interviews conducted with the many friends, artists and producers with whom Nusrat has collaborated with.",
    "director": [
        {
            "@type": "Person",
            "name": "Giuseppe Asaro",
            "url": "/name/nm0038383/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA1Mjk4MDA2M15BMl5BanBnXkFtZTcwODczOTYxMQ@@._V1_.jpg",
    "name": "A Voice from Heaven",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "novusxriver"
        },
        "dateCreated": "2013-06-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0259727/"
        },
        "name": "beautiful music and a great story",
        "reviewBody": "The story interweaves excellent Nusrat performance footage and a rare behind the scene glimpse into Nusrat's life. Interviews conducted with the many friends, artists and producers with whom Nusrat has collaborated with, including Rick Rubin, Michael Brook, Bally Sagoo and the Asian Dub Foundation, tell the story of a man and his music of peace and spiritual love. \"It just seemed like, the music would start and something would open in him and this beautiful sound would come out  its just fantastic.\" – Rick Rubin, President of American Recordings. \"There is an element in Qawwali, I think part of the goal is to induce ecstasy in people, as it is in Gospel Music. I think they are very similar actually. And I think in order to do that there needs a high degree of passion.\" – Michael Brook I, Nusrat Fateh Ali Khan,I am a sinner, man of heart impure and dark, it is like a mantle that is dotted with spots of stain and dirt. The recital of Allah's Name purifies the heart, thats what I do all the time, recite the words. This is my job, my task, my favorite hobby. I am a fakir, a beggar for Allah and wander the streets shouting His Name. Remember God in pain, in pleasure; He will wash away the pain. People remember God only when they are in adversity, if they remember Him in good times, they will never have pain and will never experience adversity.\" – Nusrat Fateh Ali Khan, 'A Voice from Heaven'.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0259727/"
}