{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dana Andrews",
            "url": "/name/nm0000763/"
        },
        {
            "@type": "Person",
            "name": "Richard Conte",
            "url": "/name/nm0002017/"
        },
        {
            "@type": "Person",
            "name": "George Tyne",
            "url": "/name/nm0879000/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3832,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044182/"
        },
        {
            "@type": "Person",
            "name": "Harry Brown",
            "url": "/name/nm0113689/"
        },
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        }
    ],
    "datePublished": "1945-12-25",
    "description": "During WWII, a platoon of American soldiers trudge through the Italian countryside in search of a bridge they have been ordered to blow up, encountering danger and destruction along the way.",
    "director": [
        {
            "@type": "Person",
            "name": "Lewis Milestone",
            "url": "/name/nm0587277/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGQ1OGRhMTItYjUxOC00OGE0LTlmNDMtZmJhN2EwYTdhNmE4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "national film registry,soldier,world war two soldier,u.s. soldier,military",
    "name": "A Walk in the Sun",
    "original_info": {
        "id": "A Walk in the Sun_1945",
        "name": "A Walk in the Sun",
        "year": "1945"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gordsracing"
        },
        "dateCreated": "2003-12-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038235/"
        },
        "name": "Real war, real emotion, real people, really good movie",
        "reviewBody": "This movie is beyond criticism. Within its celluloid record there clambers cold history. The tanks are real. The planes are real. The people are real. This was a contemporary war movie to the actual war, without the layers of myth laquered by years of failing memory.\n\nUnlike recent high budget over-the-top productions and the copious blood spattering within, this little epic tends to mute the violence into the pathos of the moment of death. That being the death of heroes. And the emphasis appears to hinge on the suddenness, the randomness, and the tragedy of men dying hard. It is a stark memorial to the courage and sacrifice of the World War II soldier.\n\nAmazingly, and very much in contrast to most other war films of the period which demonized the enemy, this film provides a neutral texture to the foe. Here the German soldiers are but shadows on the cave wall. The stray Italian soldiers appear as comic sidekicks in the maelstrom of a nation at peril from two sides. The enemy appears to escape the moral condemnation that other films embraced. This is war and this is what it is by those who fought it.\n\nThe film describes the landings of an infantry platoon on the Salerno beaches in Italy. All of a sudden they are left leaderless as two of the senior officers meets a soldier's fate. The beach scene remains a descriptive detail of what a soldiers paradox in modern warfare was. They bring the war but they do not know where it is, where they are, whether the war will visit them, or what lies in front of them. Without the need for special effects the director garnishes the film with the fog of war skillfully.\n\nA startling moment is when the third ranking leader, a noncom sargeant succumbs to panic and shell shock. It is perhaps the kindest treatment of the condition ever presented cinematically during that period. The rest of the platoon appears to be supportive to the fallen insane sargeant. But the war goes on. They move on.\n\nRallied by a solid sargeant the platoon moves onto its objectives, a bridge and a farmhouse at a cost. The objectives are difficult and the angst of leadership and follower play the scene well. And unlike most war movies where heroism goes beyond definition, these heroes are all very much afraid.\n\nThe film has a solid core of young actors of the period. Dana Andrews, a very young Lloyd Bridges appear to anchor the cast. The black and white format suits this tiny epic. The cinematography, stunts are solid and consistently well done. It is a darkish film very much worth seeing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Walk In The Sun: Grave Marker",
        "duration": "PT1M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2946286617",
        "name": "A Walk In The Sun: Grave Marker",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTUwNjkxOGYtOGM2Yy00ZGZhLWE5OGItNmRmNTgwYzNmYWY4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTUwNjkxOGYtOGM2Yy00ZGZhLWE5OGItNmRmNTgwYzNmYWY4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-02-23T22:54:14.018Z",
        "url": "https://www.imdb.com/video/vi2946286617/"
    },
    "url": "/title/tt0038235/"
}