{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Haley Joel Osment",
            "url": "/name/nm0005286/"
        },
        {
            "@type": "Person",
            "name": "Jude Law",
            "url": "/name/nm0000179/"
        },
        {
            "@type": "Person",
            "name": "Frances O'Connor",
            "url": "/name/nm0640323/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 313078,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0819670/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009119/"
        },
        {
            "@type": "Person",
            "name": "Brian Aldiss",
            "url": "/name/nm0000735/"
        },
        {
            "@type": "Person",
            "name": "Ian Watson",
            "url": "/name/nm0914668/"
        },
        {
            "@type": "Person",
            "name": "Steven Spielberg",
            "url": "/name/nm0000229/"
        }
    ],
    "datePublished": "2001-06-29",
    "description": "A highly advanced robotic boy longs to become \"real\" so that he can regain the love of his human mother.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Spielberg",
            "url": "/name/nm0000229/"
        }
    ],
    "duration": "PT2H26M",
    "genre": [
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWU2NzEyMDYtM2MyOS00OGM3LWFkNzAtMzRiNzE2ZjU5ZTljXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "artificial intelligence,mother son relationship,synthetic human,artificially created boy,cyberpunk",
    "name": "A.I. Artificial Intelligence",
    "original_info": {
        "id": "A.I. Artificial Intelligence_2001",
        "name": "A.I. Artificial Intelligence",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Prismark10"
        },
        "dateCreated": "2016-07-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0212720/"
        },
        "name": "Mecha World",
        "reviewBody": "AI is inspired by British science fiction writer, Brian Aldiss short story 'Supertoys Last All Summer Long.' It was a project initiated by Stanley Kubrick and then taken over by Steven Spielberg who directs as well as write the screenplay. It is a mixture of Spielberg's wide eyed childlike wonder from his ET era with Kubrick's cold gaze of adulthood. It is a modern version of Pinocchio.\n\nThe film is set in a future where the ice caps have melted and eradicated the coastline. Robots of increasing sophistication have become part of the fabric of society. Professor Hobby (William Hurt) has created an android with programme to love and be more human like.\n\nMonica and Henry Swinton (Frances O'Connor and Sam Robards) have a terminally ill son and take in David (Haley Joel Osment) almost as a substitute son to love. David as he is programmed is fixated on his mother and projects his love.\n\nWhen their son Martin (Jake Thomas) miraculously recovers and returns home, the new family of four becomes fractious. Martin is mean to David who cannot interact with other kids. It is not in his programming. An incident means that like a dangerous pet, he could be dangerous in the house. However Monica is not willing to send him back to the corporation where he would be presumably terminated.\n\nMonica cares enough for David to abandon him in the woods with a Teddy Bear who is also an AI robot for companionship and wisdom (his Jiminy Cricket.) From there David befriends other robots such as Gigolo Joe (Jude Law), a sex-bot on the run after being framed for murder. They evade resentful humans and journey to find the Blue Fairy whom David believes can turn him into a real boy so his mother can love him.\n\nDavid is a boy who becomes accepted quickly by becoming part of a family only to find that he is not afforded their protection when he is gauded and provoked by Martin. Once in he wilds with Gigolo Joe he is living in fear in a society where robots have no rights.\n\nSpielberg creates two sound stages for the middle of his film. Flesh Fair a gaudy, sleazy place where robots are destroyed in front of cheering humans but David pleads for his life and swings the crowd his way. Then there is Rouge City, A Vegas type place where the holographic Dr Know points them to the top of Rockefeller Center in the flood hit of Manhattan where he meets his creator, Professor Hobby.\n\nThe final act set in the submerged Coney Island which is then frozen over in an oncoming ice age until David is rescued by advanced beings.\n\nI have to confess. I liked the ending. It bought an emotional crescendo to a flawed film. It moved me as it allows David to find he is the recipient of love and can finally grow and become human even if it is all a projection from the beings that rescued him. Without this ending, I would had found this to be a dull, uninvolving and grim experience. Humans treating robots like pets who are soon discarded once they are no longer fulfil a useful function.\n\nI understand that this ending was part of the Kubrick draft and not added by Spielberg. Kubrick finally showed his sentimental side.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Warner Bros. Pictures",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi212009753",
        "name": "A.I. Artificial Intelligence",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDk5Y2ZiZTYtMWVhMS00MzEyLTg5ZWItZjliZTRiNGM0MWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDk5Y2ZiZTYtMWVhMS00MzEyLTg5ZWItZjliZTRiNGM0MWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-11-27T06:05:26Z",
        "url": "https://www.imdb.com/video/vi212009753/"
    },
    "url": "/title/tt0212720/"
}