{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jackie Shroff",
            "url": "/name/nm0006763/"
        },
        {
            "@type": "Person",
            "name": "Juhi Chawla",
            "url": "/name/nm0004487/"
        },
        {
            "@type": "Person",
            "name": "Amrita Singh",
            "url": "/name/nm0802080/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 689,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0129109/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077190/"
        },
        {
            "@type": "Person",
            "name": "Honey Irani",
            "url": "/name/nm0409790/"
        },
        {
            "@type": "Person",
            "name": "Shanker Iyer",
            "url": "/name/nm1738187/"
        },
        {
            "@type": "Person",
            "name": "Rahi Masoom Reza",
            "url": "/name/nm0713592/"
        }
    ],
    "datePublished": "1993-06-18",
    "description": "Roma leaves Ravi at the altar to pursue her ambitions. Her sister Reema steps in to marry Ravi. All's well till Roma returns. Reema must face Roma now.",
    "director": [
        {
            "@type": "Person",
            "name": "Deepak Sareen",
            "url": "/name/nm0765039/"
        }
    ],
    "duration": "PT2H29M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGVhMDI1MTAtNGRlYi00YWU0LTllMGEtODJlODVkMWVlOWFlXkEyXkFqcGdeQXVyNTkzNDQ4ODc@._V1_.jpg",
    "keywords": "sister sister relationship,love triangle,love,marriage,wedding",
    "name": "Aaina",
    "original_info": {
        "id": "Aaina_1993",
        "name": "Aaina",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Peter_Young"
        },
        "dateCreated": "2011-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106203/"
        },
        "name": "Sister race",
        "reviewBody": "Deepak Sareen's Aaina is an effective film about sibling rivalry even if doesn't always ring true. The film's story is very interesting, and the film itself is also handled pretty well for the most part. It of course has more than one plot hole, but then that's something I expected. The style is very 1990s Hindi cinema, but I mean it mostly in a good way because there was something very naive about Hindi films at that time, although most of them (I'm referring to the commercial films) were either crude action films or over-the-top melodramas. I would say Aaina thankfully does not fit into either category; it's quite different and is rather light in mood despite the many attempts at intense storytelling and over-romanticism. This film is actually trying to convey something. Not always does it work, being often hard to believe and hopelessly predictable, but I still found it to be almost throughly enjoyable. The film has some unexpected twists, some of which are ridiculous (like the guy marrying the younger sister when the elder disappears), while the others are pleasant (like the last scenes). The film's songs, composed by Dilip and Samir Sen, are quite nice, my favourite being \"Meri Sanson Mein Tum\".\n\nThe casting is very good. Jackie Shroff is good in a role which actually is not much of a challenge. 1993 was Juhi Chawla's year with such films as Hum Hain Rahi Pyar Ke in which she delivered an excellent comic performance, and Darr, for which many still remember her as that highly-desired \"K-k-k-kiran\". I actually like her more either in comedy or in roles of smart and sophisticated women, but this one definitely works. Her fragility looks very natural and so does her character's gradual transformation. But without a doubt, this film belongs to Amrita Singh, who is wonderful and convincing in a negative role. I have seen several movies with Singh in it, and there hasn't been even one in which I did not like her. She just has this ability to command the audience's attention in every turn, and that's why this actually works well with the kind of character she plays. Roma is egoistic, domineering, self-indulgent, manipulative, competitive, and she cannot even think of admitting failure. That said, I'd disagree with anyone who'd call her role villainous, because these are negative shades which probably everyone has, and she is also ambitious and total. Singh is suitably confident, attractive and assertive in this role.\n\nIn conclusion, Aaina is worth watching even though it's very far from being flawless and is quite faulty at times. It is not really a triangular love story as it is a film about sibling rivalry, which may not be portrayed in the best way, but is still an interesting one to watch, particularly for those who enjoy watching Hindi films.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi834385433",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTg0MDg2OTc4MV5BMl5BanBnXkFtZTgwOTk2OTk4OTE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTg0MDg2OTc4MV5BMl5BanBnXkFtZTgwOTk2OTk4OTE@._V1_.jpg",
        "uploadDate": "2016-09-01T05:32:08Z",
        "url": "https://www.imdb.com/video/vi834385433/"
    },
    "url": "/title/tt0106203/"
}