{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hrithik Roshan",
            "url": "/name/nm0004335/"
        },
        {
            "@type": "Person",
            "name": "Ameesha Patel",
            "url": "/name/nm0665349/"
        },
        {
            "@type": "Person",
            "name": "Kiran Kumar",
            "url": "/name/nm0474820/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2636,
        "ratingValue": 3.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0294790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0646356/"
        },
        {
            "@type": "Person",
            "name": "Robin Bhatt",
            "url": "/name/nm0080327/"
        },
        {
            "@type": "Person",
            "name": "Girish Dhamija",
            "url": "/name/nm0223475/"
        },
        {
            "@type": "Person",
            "name": "Sanjeev Duggal",
            "url": "/name/nm0240882/"
        }
    ],
    "datePublished": "2002-04-19",
    "description": "The daughter of a rich criminal industrial tycoon falls in love with a college boy. The tycoon, what a surprise, objects...",
    "director": [
        {
            "@type": "Person",
            "name": "Vikram Bhatt",
            "url": "/name/nm0080333/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Action",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWIwNGI5OTQtMTQ4OC00MzcwLTg2NTktNDFiYzE1MmRmMGQxXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "criminal,tough guy,depression,asthma,murder",
    "name": "Aap Mujhe Achche Lagne Lage",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ladyindahouse_3"
        },
        "dateCreated": "2007-03-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0247911/"
        },
        "name": "Aap Mujhe Achche Lagne Lage",
        "reviewBody": "Honestley this movie really sucked , honestly! amishas acting was odd when she was crying in the movie i thought something was wrong with her. It looked like she gasping for air her acting sucked. Hrithik of course was great he really fit the part of Rohit. His character was a simple boy in college who is also a great soccer player. The beginning of the movie looked like it was going to be great but sadly i think the only thing great about this movie was when hrithik had that soccer match and he won. The songs were OK i didn't really like most of the songs. Main Prem Ki Diwani Hoon in my opinion was way better then this film. I liked Prem Ki Diwani Hoon. Amisha Patel is annoying as usual i like her but yet i can't stand her! But i did not judge the movie because i i'm not sure if i like her or not. The movie was just bad that's all!! the ending i felt was cut off they should have added more to the ending. I actually waited a bit to see if they really ended it like that! i rate this movie a 6/10!HORRIBLE! i would recommend watching Main Prem Ki Diwani Hoon. Because Kareena and Hrithik have a lot more chemistry and the story line is better!!oh and if you stll want to watch this movie even after al the boredom you are going to experience and the fact that this movie is really a smelly cut of cheese!! then go on right ahead because it's your opinion but still take my advice this movie is not worth watching , A huge waste of time, if you have time to waste.Please don't buy the movie it's a waste of money. i love hrithik but dang a bad movie is a bad movie and that is exactly what this movie is BAD.B-A-D BAAAD!!!Awful!!so watch this movie if you dare!! but you couldn't even dare me or pay me to watch this movie again.AWWWWW the HORROR!!! and i am NOT overeacting this movie is a huge BOMB and no one should try to make it explode again!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0247911/"
}