{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anni-Frid Lyngstad",
            "url": "/name/nm0528586/"
        },
        {
            "@type": "Person",
            "name": "Benny Andersson",
            "url": "/name/nm0027630/"
        },
        {
            "@type": "Person",
            "name": "Björn Ulvaeus",
            "url": "/name/nm0880744/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 417,
        "ratingValue": 9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0600572/"
        }
    ],
    "datePublished": "2002-07-30",
    "description": "The band members of ABBA must travel through space and time to bring back the funk. They go through several trials including the hydra, Minotaur, and the Loch Ness monster. But they realize the true enemy is the 1980's which kille...",
    "director": [
        {
            "@type": "Person",
            "name": "Lasse Hallström",
            "url": "/name/nm0002120/"
        },
        {
            "@type": "Person",
            "name": "Kjell Sundvall",
            "url": "/name/nm0839268/"
        }
    ],
    "duration": "PT2H48M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzQ1MTU4MTAzMl5BMl5BanBnXkFtZTcwMTYzMzYxMQ@@._V1_.jpg",
    "keywords": "music video collection",
    "name": "ABBA: The Definitive Collection",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dav4is"
        },
        "dateCreated": "2003-06-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0353142/"
        },
        "name": "Certainly one of the most successful pop groups of all time...",
        "reviewBody": "I have been an ABBA fan since I lived near them på Lidingö in the late 70's and early 80's. But I have always wondered why they were never the huge hit here in the USA as they were in the rest of the world. Perhaps it has been critical dismissal as mere \"Scandinavian pop rock\". Despite this, ABBA continues to sell well, even 20 years after they last performed together. Indeed, there is now a revival of their popularity: a Broadway play, movie soundtracks, more exposure on radio play-lists.\n\nThere is much more to this group than the critics' had seen, as this DVD shows.\n\nThe DVD is a simple compilation of their music videos in roughly chronological order with no added commentary. In those days, they were called \"promo clips\". The term \"music video\" had yet to be invented, and these clips show the early development of that genre by the additions of story line, more complicated camera work, special effects and other high-level production values.\n\nThe DVD also shows the progression of ABBA's music from the infectious dance rhythms of their early work to the more introspective and darker later songs. This, I believe, parallels their personal lives; i.e. the breakup of their marriages, and ultimately of the group itself.\n\nBut the music! The music is wonderful!\n\nWere two female voices ever more perfectly complementary? The one powerful and operatic, the other more subtle and melodic, yet with a certain power of its own. And the other instruments: masterful keyboard and guitar work -- but you have to listen carefully for the guitar.\n\nThe overall production of the songs, redolent of Phil Spector's \"Wall of Sound\", is perfect. As is the timing: never a note out of place, and voices in perfect synchrony. It's the timing that tells the tale of true professionalism, here as in good jazz or Bluegrass.\n\nDo you hear their accents? Probably not, because it's very subtle. English has been the mandatory second language in Sweden's schools for many years, so forget Sesame Street's Swedish Chef! Listen carefully to the ABBA recordings on this DVD, especially to the S-sounds. Like \"Thank You for the Music\". We say \"myoo'-zic\", with a voiced \"S\"; they say it unvoiced, \"myoo'-sic\". Very subtle, as I said. And charming.\n\nAnd, finally, the girls sure are mighty tasty! ;o)\n\n-R.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0353142/"
}