{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hugh Grant",
            "url": "/name/nm0000424/"
        },
        {
            "@type": "Person",
            "name": "Nicholas Hoult",
            "url": "/name/nm0396558/"
        },
        {
            "@type": "Person",
            "name": "Toni Collette",
            "url": "/name/nm0001057/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 186860,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047476/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063961/"
        },
        {
            "@type": "Person",
            "name": "Nick Hornby",
            "url": "/name/nm0394984/"
        },
        {
            "@type": "Person",
            "name": "Peter Hedges",
            "url": "/name/nm0373282/"
        },
        {
            "@type": "Person",
            "name": "Chris Weitz",
            "url": "/name/nm0919363/"
        }
    ],
    "datePublished": "2002-05-17",
    "description": "A cynical, immature young man is taught how to act like a grown-up by a little boy.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Weitz",
            "url": "/name/nm0919363/"
        },
        {
            "@type": "Person",
            "name": "Paul Weitz",
            "url": "/name/nm0919369/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ2Mzg4MDAzNV5BMl5BanBnXkFtZTgwMjcxNTYxMTE@._V1_.jpg",
    "keywords": "single mother,bullying,dating,selfishness,supermarket",
    "name": "About a Boy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-04-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0276751/"
        },
        "name": "Yet another spot-on Hornby adaptation",
        "reviewBody": "Selfish, self-centered rich `kid' Will Freeman lives alone as an island in London, living off royalties from his father's record. When a new dating trick sees him targeting single mothers because they are easier to dump he unwittingly gets mixed up with Marcus. Marcus is a 12 year old who is bullied at school because of his hippy life style (forced on him by his mother) and struggles at home with his depressed, suicidal mother. At first he sees himself helping his mum by getting Will to like her but gradually Marcus and Will get used to each other and have lessons that both can learn.\n\nFollowing the steaming success of High Fidelity, another Hornby book makes the transition. However credit should be given for setting the movie in England and not moving it somewhere else (cooler). This however is probably due to the lead being English and very bankable!\n\nThe story is of course about blokes.and blokes problems  this is Hornby after all. The plot is simple but the fact that it done with a great deal of wit makes it come across very easily. Occasionally the mix of heavy subjects (Marcus's home life) with the comedy of Will's life is a little uneasy, but after a while it mixes better. The story is pretty revealing  I can see a lot of myself in Will, as many men will, and it is involving then to see Marcus teach him things about life. However, saying that, the best thing about this is the comedy  when Will is involved it is nearly always laugh out loud funny  and that's most of the time.\n\nThe directors deal with this film really well  they focus on Grants strengths and also use several really cool visual things to add to the comedy  like quick cuts and freeze frame  but not to the point of annoyance. Surprising that these guys did American Pie! Not the most subtle or clever of comedies\n\nGrant is excellent here  he easily handles the emotional side of the film and the comedy, but it's in the comedy he excels. His face plays out as many jokes as his words and he is indeed a master at playing this character. However here he has to work harder than when he does his usual `English-fop' stuff, because Will is selfish and not immediately likeable..I must admit that at the start I struggled to get into the film because I hate these people who spend their time in Notting Hill cafes living off inheritances etc  so it's a credit to Grant that he carries it off. Hoult is not as good  he has too much weight to carry. Hoult has to manage the whole emotional side of the film and at times he can't convince. Collette is good as Fiona but again suffers from not having any of the comedy side of the film. Rachel Weisz was good in a small role but as far as I'm concerned  if she was making this, then she wasn't making another rubbish Mummy film!\n\nOverall this is a successful adaptation of the book. The emotional side and the comedy at times don't sit well together and at times it all feels very lightweight, but ultimately it all comes together. Grant is excellent and excels himself here  when he's on screen the film is hilarious and moves fluidly. Unfortunately it slightly highlights the weaknesses of those around him."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A down-and-out father faces off with a religious cult of human traffickers while searching for his missing daughter in the Nebraska wilderness.",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi868599065",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTViYzliZTctNDA0MC00MWUwLWJiZGEtZDcxYTMwODg4NTRkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTViYzliZTctNDA0MC00MWUwLWJiZGEtZDcxYTMwODg4NTRkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2023-01-13T20:19:24.887Z",
        "url": "https://www.imdb.com/video/vi868599065/"
    },
    "url": "/title/tt0276751/"
}