{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Reeve",
            "url": "/name/nm0001659/"
        },
        {
            "@type": "Person",
            "name": "Kim Cattrall",
            "url": "/name/nm0000326/"
        },
        {
            "@type": "Person",
            "name": "Edward Kerr",
            "url": "/name/nm0449687/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2014,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030480/"
        },
        {
            "@type": "Person",
            "name": "Jerry Lazarus",
            "url": "/name/nm0493816/"
        },
        {
            "@type": "Person",
            "name": "William H. Macy",
            "url": "/name/nm0000513/"
        },
        {
            "@type": "Person",
            "name": "Steven Schachter",
            "url": "/name/nm0769522/"
        }
    ],
    "datePublished": "1995-05-21",
    "description": "Paralyzed cop struggles with his life following failed special operation and gets depressed. His wife and brother are trying to get him out of that state which causes a series of unpredictable events.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Schachter",
            "url": "/name/nm0769522/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTVjYWEwZGEtZDkzMS00YjgyLTg4YjEtMzRjNzMwYWY5MmIxXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
    "keywords": "buttocks,female rear nudity,female frontal nudity,female topless nudity,sexually dissatisfied wife",
    "name": "Above Suspicion",
    "original_info": {
        "id": "Above Suspicion_1995",
        "name": "Above Suspicion",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oneflewovertheapocalypse"
        },
        "dateCreated": "2004-08-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109034/"
        },
        "name": "Very Very Good",
        "reviewBody": "A while ago I read in places that Above Suspicion was a sleeper hit in it's time and was a great film with twists and turns. It appeared on television the other night so I decided to give it a go and see what I made of it and after it finished I was in complete shock to actually have found a fantastic B movie thriller. I only know Christopher Reeve as Clark Kent so it was nice to see him in something else apart from that. At one point all the main characters in this I loved in one film or other. Of course reeve's in Superman, Kim Cattrall in Big Trouble in Little China and Joe Mantega in The Godfather Part 3 so to have them all together in one film was great and it worked on so many levels. It all begins with Reeve as a cop who goes out on a drug bust or something along those lines and he get's shot during it. He ends up paralysed from the waist down, becomes very depressed and decides that suicide is the only way out to cure his long and tiring depression, in steps his brother and wife played by Cattrall. He knows that killing himself will leave no insurance on his life to leave to his young son so he pleads with his wife and brother to shoot him in a staged robbery. I will not say no more as it will spoil the fun, but from there on in you are taken straight into a tale of deceit and murder. I still am very shocked to have seen how good it was considering it wasn't backed up by a big film studio so this is what we have to remember from now on. We may have to put up with some terrible B movies that are straight to video but there are some if not a lot of surprisingly good films out there with powerful stories. Keep an eye out and watch if you get the chance as you will not be disappointed, I promise you."
    },
    "url": "/title/tt0109034/"
}