{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "David Morse",
            "url": "/name/nm0001556/"
        },
        {
            "@type": "Person",
            "name": "Holly Hunter",
            "url": "/name/nm0000456/"
        },
        {
            "@type": "Person",
            "name": "David McCullough",
            "url": "/name/nm0567184/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 153,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002033/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Person",
            "name": "David Grubin",
            "url": "/name/nm0344319/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey C. Ward",
            "url": "/name/nm0911552/"
        }
    ],
    "datePublished": "2001-02-19",
    "description": "The story of the Abraham and Mary Todd Lincoln's childhoods - his in a remote backwoods log cabin, hers in a wealthy Kentucky home - and describes their courtship.",
    "duration": "PT6H",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ3OTUwNzAxNl5BMl5BanBnXkFtZTcwMDMwMDgyMQ@@._V1_.jpg",
    "keywords": "president,the white house washington d.c.,pre civil war,future president,president of the united states",
    "name": "Abraham and Mary Lincoln: A House Divided Part 1 - Ambition",
    "original_info": {
        "id": "Abraham and Mary Lincoln: A House Divided: American Experience_2001",
        "name": "Abraham and Mary Lincoln: A House Divided: American Experience",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2012-05-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0277457/"
        },
        "name": "Not bad but it repeats a common myth or misconception.",
        "reviewBody": "This is the first part of a six-part series on the marriage of Abraham Lincoln and Mary Todd. Two parts are shown on each DVD in the collection. \n\nMost today don't realize that the Lincoln marriage was very, very troubled. Part of it was due to the depression that both Abe and Mary experienced and part of it was due to increasingly irrational behaviors of Mary--which only got worse after her husband's assassination. However, this being the first episode, it focuses much less on their problems and much more on the early life of Abe--from his birth until he is, rather miraculously, elected president. Considering Lincoln's rather mediocre political career up until then, it's a wonder that he became president--having only served one term in Congress and a couple terms in the state legislature.\n\nFor the most part I really enjoyed the show--it was, as usual, very interesting--like you'd expect from an episode of \"The American Experience\". However, as a history teacher I took MAJOR exception with one portion about Abe's early life. The show repeated the often repeated story about Abe and his first love, Ann Rutledge. The problem is many historians today believe that this is either a complete fabrication or it was grossly exaggerated in order to make Lincoln's life more interesting. The most difficult problem about this story is that it didn't even come out until AFTER Lincon's death and his family denied there was any truth to it. I don't mind them mentioning the story (after all, there is SOME evidence to support it) but to simply repeat it as an established fact is irresponsible. They should have at least mentioned the controversy. A strange breech of consistency in the show, that's for sure. Hopefully it will get better in the next portions of the show.\n\nBy the way, although it might seem petty, I was also a tad annoyed that the exact same violin piece was played again and again and again throughout the show. It really got on my nerves after a while.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "timeRequired": "PT6H",
    "trailer": {
        "@type": "VideoObject",
        "description": "American Experience: Abraham And Mary Lincoln: A House Divided",
        "duration": "PT30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1775156249",
        "name": "American Experience: Abraham And Mary Lincoln: A House Divided",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjViZDhhN2MtODkzMy00MTE4LTk3ZDUtMDQ0ZDg2MzBhY2YwXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjViZDhhN2MtODkzMy00MTE4LTk3ZDUtMDQ0ZDg2MzBhY2YwXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-06-07T13:04:17.774Z",
        "url": "https://www.imdb.com/video/vi1775156249/"
    },
    "url": "/title/tt0277457/"
}