{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Lambert",
            "url": "/name/nm0000483/"
        },
        {
            "@type": "Person",
            "name": "Kelly Brook",
            "url": "/name/nm0111639/"
        },
        {
            "@type": "Person",
            "name": "Lou Diamond Phillips",
            "url": "/name/nm0001617/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3230,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0102280/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104580/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0117596/"
        },
        {
            "@type": "Person",
            "name": "Brad Mirman",
            "url": "/name/nm0592436/"
        }
    ],
    "datePublished": "2005-09-29",
    "description": "In a world ravaged by disease, he's the only cure... and the last hope for human-kind.",
    "director": [
        {
            "@type": "Person",
            "name": "David De Bartolome",
            "url": "/name/nm1037008/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Sci-Fi",
        "Action",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2QxMjFiYzUtODliMy00MmM4LWFmZmQtZTI2NWVmNWY4ZWIyXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "virus,post apocalypse,jumping onto a truck,jumping off a bridge,punched in the face",
    "name": "Absolon",
    "original_info": {
        "id": "Absolon_2003",
        "name": "Absolon",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ptay1685"
        },
        "dateCreated": "2007-09-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0300902/"
        },
        "name": "passable if you don't expect too much - could have been good",
        "reviewBody": "I watched this movie mainly because of the actors that were in it, namely Lambert, Perlman, Philips. The plot is not entirely original (which ones are?) but interesting in detail and certainly good enough to support a good movie. Had the budget been bigger, this move could have been so much more. Fight sequences are the worst part - silly and unbelievable. If you removed most of them the movie would be much better. The cast are mostly good actors but the script and other aspects of the movie let them down - they mostly do the best they can with what they have been given. Lou Diamond Philips would have had more impact if he had toned down his performance - its too over the top. I tend to blame the script/director for this rather than the actor. He certainly has the looks and talent to play a great bad guy - but hes not great here. Of the three name actors he comes out worse. (If you want to see what he can really do Courage Under Fire.) Perlman does well in his rather limited role. Lambert is OK some of the time, but rather wooden the rest. Brook is great too look at and sort of OK but the script gives her no opportunity to stretch herself. I liked the actress who plays the Scotts partner - an interesting performance. She looks great too. I hope to see her more often (I resisted the temptation to say \"see more of her\" - it could be misconstrued). In many ways a bad movie but it has some unexpected good points that kept me watching despite the lows. One commenter on this forum says watching this movie is a waste of time. Perhaps, but then really watching any movie is strictly speaking a waste of time. This is especially so today, when hardly any modern movies have anything but laughable plots. There are many worse ways to waste your time than this movie."
    },
    "url": "/title/tt0300902/"
}