{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ricky Schroder",
            "url": "/name/nm0005401/"
        },
        {
            "@type": "Person",
            "name": "Brad Pitt",
            "url": "/name/nm0000093/"
        },
        {
            "@type": "Person",
            "name": "Carrie Snodgress",
            "url": "/name/nm0811202/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2575,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0733967/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015279/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068283/"
        },
        {
            "@type": "Person",
            "name": "Sandy Tung",
            "url": "/name/nm0876619/"
        }
    ],
    "datePublished": "1991-02-15",
    "description": "Two brothers: one a drug-dealing layabout, while the other is a hardworking \"model son.\" When the one begins straightening himself out by becoming a high school track star, the other is jealous and retreats into alcohol.",
    "director": [
        {
            "@type": "Person",
            "name": "Sandy Tung",
            "url": "/name/nm0876619/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYThjZWMzMzYtOTJiZS00YjA5LTlmNzAtNjZmNzMzNWJlZTcxXkEyXkFqcGdeQXVyMjg4NTk2OQ@@._V1_.jpg",
    "keywords": "undershirt,men's locker room,bare chested male,man undresses,nunchaku",
    "name": "Across the Tracks",
    "original_info": {
        "id": "Across the Tracks_1989",
        "name": "Across the Tracks",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wes-connors"
        },
        "dateCreated": "2011-09-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101268/"
        },
        "name": "He Ain't Heavy, He's My Brother Runner",
        "reviewBody": "In what looks like the Los Angeles area, pot-smoking hot blond Rick Schroder (as William \"Billy\" Maloney) steals a car and gets caught by the cops, while skuzzy pal David Anthony Marshall (as Louie) escapes by dumpster diving. After a year in reform school, Mr. Schroder is granted probation. He goes home to live with poor widowed mother Carrie Snodgress (as Rosemary) and older brother Brad Pitt (as Joe \"Joey\" Maloney), a high school track star aching for a Stanford scholarship...\n\nScrew-up Schroder is enrolled in a (nicer) high school on the other side of town, due to some program set up with the reformatory. This sets up the storyline as the brothers may eventually face-off \"Across the Tracks\" on opposing track teams. Apparently, Mr. Pitt did not get long well with his kid brother, and gives him a really hard time. Schroder has sweaty nightmares and must resist strong lures to return to his delinquent lifestyle. Mother Snodgress loves both of her sons with all of her heart...\n\nThis story of sibling rivalry takes a long time to get off the ground as the opening acts do little to make it convincing. Schroder and Pitt do not initially impress as brothers. Pitt employs some obvious \"high school gosh\" for his characterization; with a good tail wind, his bangs threaten to win the race on their own. Surprisingly, considering their subsequent acting reputations, Schroder is the one who builds-up some believability, minus the partying. Turnabout is fair play, in brotherly love and acting.\n\n****** Across the Tracks (1991) Sandy Tung ~ Rick Schroder, Brad Pitt, Carrie Snodgress, David Anthony Marshall",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0101268/"
}