{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Spencer Tracy",
            "url": "/name/nm0000075/"
        },
        {
            "@type": "Person",
            "name": "Katharine Hepburn",
            "url": "/name/nm0000031/"
        },
        {
            "@type": "Person",
            "name": "Judy Holliday",
            "url": "/name/nm0391062/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21890,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Ruth Gordon",
            "url": "/name/nm0002106/"
        },
        {
            "@type": "Person",
            "name": "Garson Kanin",
            "url": "/name/nm0437717/"
        }
    ],
    "datePublished": "1949-11-17",
    "description": "Domestic and professional tensions mount when a husband and wife work as opposing lawyers in a case involving a woman who shot her husband.",
    "director": [
        {
            "@type": "Person",
            "name": "George Cukor",
            "url": "/name/nm0002030/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmEyY2ExYTMtN2VmNi00MTMwLWE3MmQtZDM1NDAxNDdhZDRlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "husband wife relationship,battle of the sexes,national film registry,lawyer,canoe",
    "name": "Adam's Rib",
    "original_info": {
        "id": "Adam's Rib_1949",
        "name": "Adam's Rib",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "swayland7"
        },
        "dateCreated": "2004-10-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041090/"
        },
        "name": "The Best of Hepburn and Tracy",
        "reviewBody": "Of the nine films which paired Spencer Tracy and Katherine Hepburn, Adam's Rib is often considered the best. Writers Ruth Gordon and Garson Kanin were friends of the famous couple and wrote the film specifically for them. Kate insisted the film be directed by her favorite screen director, George Cukor, who services the brilliant writing and on-screen chemistry with his trademark elegant staging and unobtrusive style. The result is a comedy that remains the best \"battle of the sexes\" films ever made.\n\nWhen Doris Attinger (Judy Holliday) discovers her husband in the arms of another woman, she opens fire and is charged with attempted murder. Enter Adam and Amanda Bonner (Tracy and Hepburn), married lawyers whose lives are turned upside down when Adam is assigned to the prosecution. An ardent proponent of women's rights, Amanda decides to represent Doris, claiming that if the sex of the parties on trial were switched, the jury would feel differently. This conflict of interests creates friction in the courtroom as well as the Bonners' home.\n\nSpencer Tracy, with his confident and relaxed screen presence, paints Adam as a man quite comfortable with his wife's force and ambition. But Adam grows upset with Amanda as the media spotlight finds the case and magnifies it into a cause for women's rights. He accuses Amanda with disregard for the law, reminding her that no one, man or woman, has the right to take the law into their own hands, and that Amanda is using the case for her own selfish purposes. The script is careful not to polarize Adam's interests. He reveres the law and has no special affection for Doris' husband. In opposing him, Katherine Hepburn manages to retain her signature strength while also portraying Amanda as a loving wife who fears the damage her marriage may sustain because of the case and its publicity. Amanda alleges that Doris is doomed to an unfair trial because the general public irrationally feels male infidelity is much more permissible than female infidelity. \n\nThe courtroom becomes a spectacle when Amanda puts a circus strong-woman on the stand and asks her to lift Adam. Tracy rises to the occasion, with an angry outburst that is empowered by his otherwise calm and restrained performance. Despite their marital bliss before the case, Adam admits that he likes \"two sexes\" and doesn't care for having a wife who is a \"new woman\" and a \"competitor\". This rare outpouring causes Amanda to realize just how personally Adam is taking the trial, and that it could result in their divorce. \n\nRuth Gordon and Garson Kanin deserve special recognition for creating a balanced on-screen battle in what has always been a controversial debate - gender equality. Amanda's plight is shaded by her experiences as a woman, and Adam is presented as a man who admits to always trying to hear her side of the story. That their marriage was a happy one before the trial is an indication of the equality they had achieved together. Amanda is, in fact, equal to Adam in both the career and financial worlds. To create a sparring partner for Amanda, Gordon and Kanin could easily have presented a misogynist, or even a lovable but cantankerous traditionalist. They were wiser to portray Adam as a man who simply refused to see the case as one for gender equality, but for vigilantism. \n\nAs directed by George Cukor, Adam's Rib features a great many long takes that play uninterrupted. Even during moments of action, like the scene in which both Bonners are getting dressed for dinner, Cukor utilizes minimal staging and camera movement. The camera points directly across the Bonners' bedroom, with her dressing room off frame left and his off frame right. They shout at each other, poking their heads into the frame, occasionally walking through the frame and back again. And later, when Adam discovers Kip and Amanda together, the ensuing fight is framed similarly, with the camera looking down the apartment hallway, characters popping into frame from the left or right and back again. This isn't to say Cukor doesn't move his camera much. There are several decisive camera movements, but Cukor's sparing use of them, and his tendency to rely more on well-composed master angles gives the film an elegant, traditional Hollywood style. The film also benefits from a lively score by Mikos Rozsa and a catchy Cole Porter tune, \"Farewell Amanda\". Jean Hagen, unforgettable for her comic turn in Singin' in the Rain, again demonstrates her talent for comedy as the \"other woman\". \n\nCukor must have realized that with Tracy and Hepburn on screen, all the camera really had to do was follow them, frame them, and let the sparks fly.\n\nThe screenplay and the actors' off-screen romance are gifts to the film. We feel for both of them, and believe in what both are trying to achieve. It is rare that a film about difference and equality plays so fairly to all parties involved, and also rare that such a sensitive subject can retain its comic appeal. But for all the film says about equality, Adam's Rib ultimately serves to remind us that when it comes to Hepburn and Tracy, there is no equal. - Scott Schirmer",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Domestic and professional tensions mount when a husband and wife work as opposing lawyers in a case involving a woman who shot her husband.",
        "duration": "PT3M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi302367001",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2UzYzIyNjItZWUzZS00MjQ2LWE5NzEtMmU4ODJmODY5OWUwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2UzYzIyNjItZWUzZS00MjQ2LWE5NzEtMmU4ODJmODY5OWUwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-01-05T14:51:09.180Z",
        "url": "https://www.imdb.com/video/vi302367001/"
    },
    "url": "/title/tt0041090/"
}