{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elisabeth Shue",
            "url": "/name/nm0000223/"
        },
        {
            "@type": "Person",
            "name": "Maia Brewton",
            "url": "/name/nm0108315/"
        },
        {
            "@type": "Person",
            "name": "Keith Coogan",
            "url": "/name/nm0176861/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 46092,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076881/"
        },
        {
            "@type": "Person",
            "name": "David Simkins",
            "url": "/name/nm0799562/"
        }
    ],
    "datePublished": "1987-07-03",
    "description": "A babysitter must battle her way through the big city after being stranded there with the kids she's looking after.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Columbus",
            "url": "/name/nm0001060/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Adventure",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWU0MjgzOGYtZGNmMC00ODAwLTk0NzUtNDdjMTYwMTlkMTQ2XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "female protagonist,babysitter,suburb,chase,teenage girl",
    "name": "Adventures in Babysitting",
    "original_info": {
        "id": "Adventures in Babysitting_1987",
        "name": "Adventures in Babysitting",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhaggardjr"
        },
        "dateCreated": "2000-09-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092513/"
        },
        "name": "This is one awesome movie!",
        "reviewBody": "\"Adventures in Babysitting\" is a movie that I'll never forget. One of the reasons why this film is so memorable is because of the Chicago locations. For the past 25 years or so there have been lots of good movies shot in and around Chicago (as well as the suburbs) such as \"Risky Business\", \"Ferris Bueller's Day Off\", and \"The Fugitive\" just to name a few. But \"Adventures in Babysitting\" is probably my favorite movie to be made in Chicago. I saw this movie when it first came out in the summer of 1987 (a year after \"Ferris Bueller\" which \"Adventures\" bares somewhat of a resemblence to) and while I was watching the film it felt to me like I was part of the adventure. Today, this is still a very entertaining picture, and a lot of fun. Elisabeth Shue is terrific in her first leading role as Chris Parker, a 17-year-old high school senior who prepares for a big date with her boyfriend at the beginning of the film. But he cancels the date, and since she's now free for the night, she's asked to babysit for the Anderson kids. She agrees. Once she gets over there, she gets a frantic phone call from her best friend Brenda (Penelope Ann Miller) who's run away from home and is now stranded at a bus station in downtown Chicago. Terrified after witnessing a shooting, Brenda asks Chris to pick her up because she blew all her money on the cab ride to the bus station. Hesitant, Chris has no choice but to take the two Anderson kids Sara (Maia Brewton) and Brad (Keith Coogan) with her to pick up poor Brenda. Also going along for the ride, Brad's horny best friend Daryl (Anthony Rapp). Once they get on the expressway, things start to go wrong. Very wrong. This is where \"Adventures in Babysitting\" turns into a fun movie. The foursome experience car troubles; run-ins with a friendly car thief, a mob group the thief works for (who spend most of the movie chasing the kids through the streets of Chicago), and two gangs on a train; a short trip to a hospital (when one of the kids is slightly injured by a member of one of those gangs); a brief stop at a frat party; a chase to the top of a high-rise building; and a show stopping classic scene in a blues bar. And much more happens as the hapless Brenda continues to wait and wait and wait for Chris to come get her. \"Adventures in Babysitting\" was directed by Chris Columbus in his directing debut after writing screenplays for a couple of Steven Spielberg produced movies (\"Gremlins\", \"The Goonies\", and \"Young Sherlock Holmes\"). Since this film, Columbus has gone on to direct some of the biggest box office hit comedies of all-time such as \"Home Alone\", \"Home Alone 2\", and \"Mrs. Doubtfire\". \"Adventures in Babysitting\" was nowhere near as big a hit as those films, but it did modestly well. I would have loved to see a sequel to this. It would have been interesting to see what kind of misadventures were next for Chris and company. Shue, Brewton, Coogan, and Rapp all seem to be having a blast on screen, and I would too if I were up their on the screen. Even though Miller doesn't seem to be having a good time, she's a scream as Brenda (she would later show off some real good acting in \"Kindergarten Cop\" and \"Awakenings\"). And Vincent D'Onofrio (of \"Men in Black\" and currently \"The Cell\") has one of his first film roles in a very small part as the owner of a auto repair shop (where the broken down car gets fixed). \"Adventures in Babysitting\" is a movie that's great fun from start to finish and never lets up. This comedy/adventure is awesome!\n\n**** (out of four)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1679343129",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzMwNDE1OTctNTBlYi00NDU1LThhOGUtOTMyYTk2NmYwOTc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzMwNDE1OTctNTBlYi00NDU1LThhOGUtOTMyYTk2NmYwOTc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-29T09:32:31.816Z",
        "url": "https://www.imdb.com/video/vi1679343129/"
    },
    "url": "/title/tt0092513/"
}