{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aerosmith",
            "url": "/name/nm0012613/"
        },
        {
            "@type": "Person",
            "name": "Richard Conner",
            "url": "/name/nm8045332/"
        },
        {
            "@type": "Person",
            "name": "Tom Hamilton",
            "url": "/name/nm0358195/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 95,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "description": "Aerosmith performs live at the Office Depot Center in Sunrise, FL on April 3, 2004 in support of their blues tribute album Honkin' On Bobo.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Haefeli",
            "url": "/name/nm1299739/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTFmNDVjYTAtMzg2OC00YTA5LWE3Y2QtMGMyN2E0NzBkNTNhXkEyXkFqcGdeQXVyNTk1NTMyNzM@._V1_.jpg",
    "keywords": "live performance,concert film",
    "name": "Aerosmith: You Gotta Move",
    "original_info": {
        "id": "Aerosmith: You Gotta Move_2004",
        "name": "Aerosmith: You Gotta Move",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2008-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0889166/"
        },
        "name": "Great",
        "reviewBody": "Aerosmith: You Gotta Move (2004) \n\n**** (out of 4) \n\nFrom their early records like Toys in the Attic and Rocks all the way up to P.U.M.P the boys knew how to deliver a high energy concert full of sexual innuendo plus a crowd full of beautiful women who certainly didn't mind showing off their sexuality. In 2004 the boys went back to their roots and released Honkin' on Bobo, which was a blues album---done Aerosmith style of course.\n\nAerosmith: You Gotta Move originally aired on A&E but this DVD release features more interviews, more loud music all in a glorious 5.1 package. In interviews Aerosmith said they wanted their first live DVD to be something memorable and this certainly is.\n\nThe features works perfectly as a documentary, which mixes in the concert cuts perfectly.\n\nIf you ever wanted to know what goes on back stage before the concert then this film gives you a wonderful look. Everything from the pre-concert rituals to even arguments over what songs to include on the set list is here for fans to see. The most interesting stuff is the talk about the making of the blues album and how it almost didn't get released because they didn't know if they could make it strong enough. Also mixed in is some scenes with the boys meeting fans plus the likes of other rock stars who are just as star struck as the actual fans paying for the tickets.\n\nI've seen Aerosmith nine times since that show in 1997 but unfortunately didn't catch this last one. I had high hopes this DVD would capture the spirit of an Aerosmith show and for the most part it succeeds. The show starts off with the always welcomed Toys in the Attic, which they can't do any wrong with. The version is played just the same as previous tours but it's a good way to get the crowd going. The raunchy Love in an Elevator follows and if you've ever seen these guys live, you just know this is a song to bring the roof down. Up next are Road Runner and Baby, Please Don't Go, which are from the latest album. I first came familiar with the band with their Get A Grip album, which of course featured Cryin'.\n\nOut of the nine shows I've been to this one has been played at each and I can't wait to hear it for a tenth time. The harmonica solo towards the end of the song is worth the $100 price tag for tickets.\n\nUp next we get The Other Side from P.U.M.P. followed by classics like Back in the Saddle, Draw the Line and Dream On, which are all incredible songs for the show. The guitar solo by Joe Perry during Draw the Line shows why he's one of the best in the business and can anyone top Tyler's vocal performance from Dream On? Another highlight of seeing the boys in concert is hearing Perry take the microphone and do a blues number, Stop Messin' Around. The encore then kicks in with recent crowd favorites like Jaded and I Don't Want to Miss a Thing, which, depending on the show, can sound great or bad. As silly and as sappy as I find IDWTMAT, I can't help but fall for it each time I hear it. It's probably due to the vocals by Tyler but the concert version also has a nice piano solo, which sets the song up nicely. Finally the boys hit the climax with a rocking variety of classics and recent songs. Sweet Emotion kicks things off followed by the new Never Loved a Girl, which fits in perfectly. The greatest hard rock song, Walk This Way follows with Train Kept A Rollin' closing the show out.\n\nAs with The Making of P.U.M.P, this feature here will be a huge delight to fans as well as though who haven't experienced an Aerosmith concert before. The band perfectly blends the sexuality of rock with the blues and performs one of the best live shows out there. Plus, it never hurts when a band has played together for such a long time."
    },
    "url": "/title/tt0889166/"
}