{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Mellencamp",
            "url": "/name/nm0577908/"
        },
        {
            "@type": "Person",
            "name": "Terrylene",
            "url": "/name/nm0856105/"
        },
        {
            "@type": "Person",
            "name": "Michael Zelniker",
            "url": "/name/nm0954677/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 362,
        "ratingValue": 3.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005432/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010183/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030599/"
        },
        {
            "@type": "Person",
            "name": "Robert Manganelli",
            "url": "/name/nm0542126/"
        },
        {
            "@type": "Person",
            "name": "Tony Schillaci",
            "url": "/name/nm0771616/"
        }
    ],
    "datePublished": "2003-05-16",
    "description": "The story of a clairvoyant who falls in love with a crime photographer. Soon, both become involved in the search for a pathological murderer.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Manganelli",
            "url": "/name/nm0542126/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTM0MzU1MjU2NF5BMl5BanBnXkFtZTcwNjA4MDYyMQ@@._V1_.jpg",
    "keywords": "scene of the crime,photographer,vision,serial killer,clairvoyant",
    "name": "After Image",
    "original_info": {
        "id": "After Image_2001",
        "name": "After Image",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Polaris_DiB"
        },
        "dateCreated": "2005-12-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0157007/"
        },
        "name": "Kind of unnecessary",
        "reviewBody": "I used to like thrillers over horror movies because I figured that the psychology involved meant a lot more thought needed to be put into the characters and plot line to make it work. Lately that kind of reasoning has been kind of failing me.\n\nNot that this is a bad movie by any means. It's just kind of unnecessary. The idea is good and I'm attracted to it because of a similar situation in a Carl Hiaasen novel. A crime-scene photographer who is severely affected by the nature of his photographs decides to escape for a while, going to stay with his aunt. Unfortunately, a psychopath is loose and chasing down the photographer and his new girlfriend, who is deaf and sees visions of future crimes, a la something like In Dreams and whatnot.\n\nI figured this movie would be interesting to see because of the idea of an \"after image\" affecting the photographer character and how he deals with his, erm, photographic memory, but it didn't really concentrate on that. I thought it'd be interesting seeing Louise Fletcher, the ol' Nurse Ratchet herself, in a different role than the one that terrorized Jack Nicholson in One Flew Over the Cuckoo's Nest. Instead, besides her being older and a bit more heavy, it's not.\n\nI can't really say for sure that this movie is that good or that bad. On one hand, it took the time to really develop an interesting group of characters. On the other hand, most of them were archetypes and presented half of the time in slow motion to create drama. The self-reflective element of the camera or the mirror, reflected and divided imaging and the like, wasn't really there. The director obviously took a lot of time finding ways to present the action through an \"other\" lens, but not really for any real reason except maintaining consistency.\n\nI want to say this to the director: good work, now go make something interesting. Maybe we just have someone who needs a bit of practice on our hands.\n\n--PolarisDiB",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0157007/"
}