{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hiroshi Abe",
            "url": "/name/nm0008346/"
        },
        {
            "@type": "Person",
            "name": "Yôko Maki",
            "url": "/name/nm1536988/"
        },
        {
            "@type": "Person",
            "name": "Satomi Kobayashi",
            "url": "/name/nm0462050/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11912,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "After the Storm",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0172041/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055529/"
        },
        {
            "@type": "Person",
            "name": "Kore-eda Hirokazu",
            "url": "/name/nm0466153/"
        }
    ],
    "datePublished": "2016-05-21",
    "description": "After the death of his father, a private detective struggles to find child support money and reconnect with his son and ex-wife.",
    "director": [
        {
            "@type": "Person",
            "name": "Kore-eda Hirokazu",
            "url": "/name/nm0466153/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzQxZGFmNGUtNDcxNC00NGE2LThlODItNDU1OTZjYTIyMjI2XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg",
    "keywords": "money problems,mother son relationship,father son relationship,family relationships,radio news",
    "name": "Umi yori mo mada fukaku",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheMovieDiorama"
        },
        "dateCreated": "2019-03-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt5294966/"
        },
        "name": "After The Storm emulates an estranged family through a blustery typhoon.",
        "reviewBody": "Kore-eda is a renowned Japanese director for personable family dramas. His work in 'Still Walking' and 'Like Father, Like Son' (although yet to see) prove he is a capable writer when dealing with common family experiences. Marital woes, grief, father and son relationships. The list goes on. This being my first Kore-eda experience, I was unsure which angle to approach this blistering drama with. Regardless, no matter how I set my mind, it was an evocative and multi-layered drama with a masterful level of maturity. A novelist turned private detective, who is struggling for money due to a gambling addiction, coincidentally finds himself stuck at his mother's house overnight when a typhoon hits Japan. At the time the storm hits, his ex-wife and son are also there and spend the night within this claustrophobic environment.\n\nMetaphorically speaking, the typhoon is a vivid representation of the estranged behaviour from both Ryota and Kyoko. Their differences splitting the family apart with such velocity. Yet, there is no hatred. No malice. And that is what I adore about Kore-eda's approach, it doesn't conform to typical clichés. He treats the audience like adults and executes a realistic family drama without needing any overly dramatic plots. Just two characters talking, with personable dialogue that has a surprising amount of wit, attempting to reconcile their differences for the betterment of themselves and their son. The storm acts as plot device for Ryota, allowing him to use the natural disaster to bond with his son. Then, once it subsides, life continues. A profound statement for most families.\n\nKore-eda explores various areas of urban Japanese culture, especially gambling and poverty, that enables this drama to be multi-layered. But what really cemented his masterful screenplay was just how it personal it was to him. Immediately the characters are bursting with dimensionality, enabling us to invest the time into their stories. Whilst also dealing with the scope of life, by indicating that \"grown-ups cannot live only with love\". A fascinating character study of a man who's personal ambitions get in the way of living life now. Though the narrative structure is not as fluid as the rain pummelling down from the storm, due to the abrupt transition between the first half before the storm and the second half, it still remains a rigid story.\n\nThis is helped by Abe's resourceful performance which was incredibly nuanced. Ryota is a complicated character, and Abe executed his complexions with ease. The late Kiki also gave a noteworthy performance as his mother, offering various lessons on life as she attempts to fix broken bonds within her family. Yamasaki's cinematography was gorgeous, cleanly enveloping you in Japan's natural and urban beauty. Kore-eda also frequently utilised long takes of unedited dialogue exchanges which subconsciously draws you into the drama.\n\nAnother small criticism would be the underutilisation of Kyoko's new boyfriend, whom of which could've been used more effectively to display her inner conflict for starting a new family or mending the existing bonds for the sake of her son. Small nitpicks here and there for what is a genuinely mature drama that felt both personal and personable, bolstered by sterling performances and a valuable screenplay. Am excited to see what Kore-eda has in store for us in the future. Oh, and bonus points for showcasing 'Taiko No Tatsujin' (I frickin' love that game...).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4256610585",
        "name": "AFTER THE STORM - OFFICIAL US Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGQyN2MyNjYtMWNkMy00NjdhLTk5NjMtMmVlZTNjNjY1NDc3XkEyXkFqcGdeQXVyNTkyMjQwNw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGQyN2MyNjYtMWNkMy00NjdhLTk5NjMtMmVlZTNjNjY1NDc3XkEyXkFqcGdeQXVyNTkyMjQwNw@@._V1_.jpg",
        "uploadDate": "2017-04-11T17:12:40Z",
        "url": "https://www.imdb.com/video/vi4256610585/"
    },
    "url": "/title/tt5294966/"
}