{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Jarvis",
            "url": "/name/nm1317804/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 66,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0092013/"
        },
        {
            "@type": "Person",
            "name": "Allen J. Abel",
            "url": "/name/nm1297821/"
        },
        {
            "@type": "Person",
            "name": "Daniel Sekulich",
            "url": "/name/nm1320081/"
        },
        {
            "@type": "Person",
            "name": "Donovan Webster",
            "url": "/name/nm1320416/"
        }
    ],
    "datePublished": "2002-02-28",
    "description": "This overview of the horrors of 20th century war reminds us that war does not end when peace treaties are signed and the soldiers have gone home.",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel Sekulich",
            "url": "/name/nm1320081/"
        }
    ],
    "duration": "PT1H14M",
    "genre": [
        "Documentary",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU4ODkyMzEzNV5BMl5BanBnXkFtZTgwNDY4OTk1MDE@._V1_.jpg",
    "keywords": "agent,vietnam,trauma,skeleton,munitions",
    "name": "Aftermath: The Remnants of War",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Zen Bones"
        },
        "dateCreated": "2004-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0352143/"
        },
        "name": "Great, but incomplete",
        "reviewBody": "As I watched French citizens digging up unexploded shells from WWI, it seemed almost incomprehensible to think of the task they still have ahead of them. Millions of shells were fired in that war and one out of every eight didn't explode. Thousands of those live shells are still buried in the forests and farmlands of France, and every year, several people are wounded or killed by these bombs that are nearly a century old. This film also documents the hundreds of thousands of unexploded shells and live mines still surrounding populated villages in Russia and Bosnia, and the effects still prevalent in Vietnam of Agent Orange. It's a fascinating documentary, and the interviews with the folks who live with these lurking dangers brings a human touch that defines bravery in measurements we rarely see. I was sort of surprised to see that the film didn't cover the estimated 8 to 24 million unexploded cluster bombs still scattered throughout Laos that to date have killed over 5,700 and injured over 5,600. Nor does it cover the fact that nations today are knowingly using weapons whose destructive capabilities will still be viable for thousands of years. In Bosnia, Kuwait and Southern Iraq, the US and Britain used weapons made from uranium-238 (depleted uranium), which upon impact vaporizes into fine dust and gas that causes both heavy-metal poisoning and irradiation to anyone nearby. During the Persian Gulf War, three hundred tons of U-238 were spread over Kuwait and Southern Iraq. According to a US Department of Defense survey, more than 436,000 US troops have entered contaminated battlefields. How many Iraqis have been exposed to date no one knows but the fact that hundreds of Iraqis have scavenged the wreckage of tanks and jeeps and sold the contaminated scrap metal they salvaged throughout Southern Iraq, just boggles the imagination. As of today, over 140,000 US soldiers from the Persian Gulf War have filed for disability, and over 9,600 have died. These weapons are still being used. [IMDb's guidelines ask us to refrain from listing URLs, but one can look up the sources for this information on any search engine: The National Gulf War Resource Center, The Military Toxic Project, The Cluster Munition Coalition, and The Center for Defense Information]\n\nStill, this film is excellent, fascinating and vitally important viewing for everybody, and teachers should consider it for children over 12 years of age."
    },
    "url": "/title/tt0352143/"
}