{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Laura Dern",
            "url": "/name/nm0000368/"
        },
        {
            "@type": "Person",
            "name": "Robert Loggia",
            "url": "/name/nm0005162/"
        },
        {
            "@type": "Person",
            "name": "Vincent Spano",
            "url": "/name/nm0001759/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 654,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Chandler",
            "url": "/name/nm0151358/"
        }
    ],
    "datePublished": "1992-05-30",
    "description": "Based on a true story, one woman takes on the U.S. military and General Dynamics; maker of the F-16, thought to be the very best tactical fighter in the world. Air Force Captain Theodore T. Harduvel was one of the best F-16 pilots...",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Markowitz",
            "url": "/name/nm0548740/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTY1YTZmYWYtMTQ2My00MjA2LWIyMGUtZjAzODAwZTJjNjFmXkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "name": "Afterburn",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rmax304823"
        },
        "dateCreated": "2003-08-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0103626/"
        },
        "name": "Low-Class Floozie Fights Injustice",
        "reviewBody": "There were a spate of movies that came out over the course of a decade or so in which ordinary women, rather than saints, saw injustice in the system and fought against it. In \"Marie,\" Sissy Spacek was the woman next door who just happened to stumble over state corruption and righted it despite resistance. That was in, I think, 1984. A few years later, Jodie Foster turned in a first-rate performance as a victimized woman who fights the legal bureaucracy in \"The Accused.\" The innovate feature of \"Accused\" was that Foster played a young woman who was not only less than saintly but positively low-class. The film won Foster an Academy Award and it must have light a few light bulbs among the MBAs who greenlight projects, because in 2000, Julia Roberts won accolades for a similar part.\n\nThis one, starring Laura Dern, and featuring Loggia, Spano, and perennial heavy Rooker, among others, came in between -- 1992. And it really is derivative. Vincent Spano is a sexy pilot and Dern is a sexy waitress in a saloon. She brash and vulgar. She talks back to authority figures and smartasses smug housewives. She smokes. She wears her golden hair up in a great big pile on top of her head. She wears cheap-looking clothes, and she's easy. We can all recognize her as exactly the type of girl a Captain in the United States Air Force, an officer and a gentleman by act of Congress, would propose marriage to. \n\nBut, not to worry. The producers and writers must have realized that if they wanted to hook the female audience, this coarseness could only be taken so far. Therefore, as the movie progresses, so does Dern. She remains an outspoken woman, of course, but her demeanor and grooming change, gradually, until by the end she is perfectly fashionable by any middle-class definition.\n\nIt's not Dern's fault. She gives the role everything she's got and is quite good, throwing her ectomorphic body with those endlessly long legs around so carelessly. Her face is an interesting object as well, long and thin, with appealing blonde hair and darker brows and lashes. Spano is handsome too, I suppose, although we see a bit more of him than we need to perhaps. Robert Loggia is his dependable self. Rooker plays a mixed-up family friend who's heart is in the right place.\n\nGeneral Dynamics is the villain here. Spano's F-16 nosedives into the ground. The Air Force deems it pilot error, but Dern, the faithful wife, knows there is what she calls \"a cover up.\" And so there is. General Dynamics is taken to court. No power on earth could force me to reveal who wins the case.\n\nThe plot is conventionally structured. The music stays in the background. The location shooting, in Southern California, isn't bad. It's derivative, yes, but so were several films that followed \"Accused.\" That floozy business is the most interesting part of the pattern, though, and this made-for-TV movie gets rid of it pretty quickly."
    },
    "url": "/title/tt0103626/"
}