{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Craig Rodwell",
            "url": "/name/nm4732123/"
        },
        {
            "@type": "Person",
            "name": "Melissa Etheridge",
            "url": "/name/nm0004902/"
        },
        {
            "@type": "Person",
            "name": "Mike Carney",
            "url": "/name/nm9358186/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 657,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0633276/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0223930/"
        },
        {
            "@type": "Person",
            "name": "Andrew Podell",
            "url": "/name/nm9358199/"
        },
        {
            "@type": "Person",
            "name": "John Scagliotti",
            "url": "/name/nm0768715/"
        }
    ],
    "datePublished": "1999-06-06",
    "description": "Documentary/Historical retrospective of the Gay Rights movement from the 1969 Stonewall riots to the present.",
    "director": [
        {
            "@type": "Person",
            "name": "John Scagliotti",
            "url": "/name/nm0768715/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU4NzU2MzIzOF5BMl5BanBnXkFtZTcwOTY0NjcyMQ@@._V1_.jpg",
    "keywords": "lgbt,lesbian interest,lesbian,act up,two word title",
    "name": "After Stonewall",
    "original_info": {
        "id": "After Stonewall_1999",
        "name": "After Stonewall",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jzappa"
        },
        "dateCreated": "2008-11-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0244955/"
        },
        "name": "An Optimistic Composition",
        "reviewBody": "John Scagliotti's sequel to Before Stonewall, in the middle of the rejuvenated concentration on the hostile response toward gay visibility, for all intents and purposes works from looking at how far the gay community has come in such a fleeting spell, for example how swiftly time passed between the Stonewall uprising to the liberation that was the American Psychiatric Association's elimination of homosexuality from the list of mental illnesses. Not that everything had revolutionized across the board.\n\nThis optimistic Melissa Etheridge-narrated composition dials up the pixels of a period in history and sees it as a storm of individual memories and personal epiphanies accented by palpable benchmarks like disco, San Francisco, Anita Bryant, Harvey Milk, AIDS, Rock Hudson and the betrayal that was \"Don't Ask, Don't Tell.\" It is illuminating that more than once in this relatively positive and buoyant doc, everyone seems as if to have a particular, inimitable remembrance in which they declare to have understood that their task in the gay movement has reached its fulfillment.\n\nDespite the fact that the ultimate breakdown exposing a documentary that on the whole simmers three decades of the gay rights movement down to disjointed, particular separate acts, it would be unreasonable to consider each remote epiphany in doubt. With expressive, colloquial interviewees like Allison, Larry Kramer, Barbara Gittings, and Charles Ching offering review, isolated moments of clarification come out seemed like t. Nor is it to After Stonewall's detriment to suggest that it pretty much organized itself, and all Scagliotti had to do was keep the pace up in the editing room.\n\nToward the end of the documentary, the Rev. Troy Perry declares that the most important thing gays and lesbians have done to change the world has been coming out of the closet. In other words, forget all the pride parades, the political lobby efforts, the letters to congressmen, the increasing commercialization of the gay dollarthe last piece of the puzzle, both he and the patchwork After Stonewall (alright, and me) seem to be saying, in staving off what could easily turn out to be an extremely lean period in social history for gay rights is to ensure that as many people as possible can put the face of a close individual on the complex, volatile, and nebulous identity of what is so often viciously attacked as \"The Gay Agenda.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0244955/"
}