{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Mithun Chakraborty",
            "url": "/name/nm0149822/"
        },
        {
            "@type": "Person",
            "name": "Madhavi",
            "url": "/name/nm0534863/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9170,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0078768/"
        },
        {
            "@type": "Person",
            "name": "H. Banerjee",
            "url": "/name/nm2832163/"
        },
        {
            "@type": "Person",
            "name": "Kader Khan",
            "url": "/name/nm0434318/"
        },
        {
            "@type": "Person",
            "name": "Santosh Saroj",
            "url": "/name/nm0765454/"
        }
    ],
    "datePublished": "1990-02-16",
    "description": "A young boy's quest for revenge leads him to become a gangster as an adult, and with each day he becomes more and more like his enemies. Can he find vengeance and redemption?",
    "director": [
        {
            "@type": "Person",
            "name": "Mukul Anand",
            "url": "/name/nm0002172/"
        }
    ],
    "duration": "PT2H54M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGIyNGNhN2EtYTZiNC00MDJjLWI2M2ItZjA1MTBlYmNiODNlXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "revenge,running through fire,tamil,famous line,title based on poem",
    "name": "Agneepath",
    "original_info": {
        "id": "Agneepath_1990",
        "name": "Agneepath",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sidyaqub"
        },
        "dateCreated": "2010-10-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098999/"
        },
        "name": "A powerhouse of intensity from the great Amitabh Bachchan",
        "reviewBody": "Amitabh Bachchan has always been highly respected and critically praised actor in the Indian film industry. Ever since his breakthrough in Prakash Mehra's Zanjeer (1973), Amitabh had become a personified leading man (prior to which he was mainly a strong supporting-actor with films like Saat Hindustani and Anand, for which he had won awards for his performances). But it was his charismatic turn in Zanjeer that established Bachchan as the Angry Young Man of Bollywood cinema - following up with the blockbusters Deewar, Trishul, Kaalia, Laawaris, Shakti throughout the 1970s and 80s.\n\nThe late 1980s were not so smooth in terms of career, with average fairers like Toofan and the box-office failures Ganga Jamuna Saraswati (1988), Main Azaad Hoon and Jaadugar in 1989, Bachchan needed a comeback.\n\nProlific Hindi filmmaker Mukul Anand had cast Amitabh in Agneepath - which was released in 1990 to critical and commercial success. The film sees a young boy named Vjay (child actor Master Manjunath), living a simple, peaceful life in the village Mandwa. His father Master Dinanath (Alok Nath) is an honest and truthful school teacher, who has always taught his son that the path for honesty is a tough and challenging route; a path of fire (literal translation of the film title), but whoever does travel the Path of Fire, no challenge would be an obstacle for that person. Master Dinanath is highly respected and much loved in Mandwa, as he intends to improve conditions of the village step-by-step. But not everyone wants to follow the wiseman's path to prosperity - Local Landlord Dinkar Rao (Goga Kapoor), sees an opportunity to make it rich by selling the village Kancha Cheena (Danny Denzongpa) - a rich, ambitious and ruthless drug-lord. Who wants to make the village a port for narcotics,since it does not appear on the Indian map and is only a stones-throw away from Bombay City (now Mumbai). The only way they could succeed is by ridding the village of Master Dinanath, after being framed for adultery, Master Dinanath is mercilessly beaten to death by the villagers, and his son Vijay is left as the sole breadwinner for his mother and younger sister.\n\nUpon leaving Mandwa for Bombay - the young Vijay swears to give the village back to his mother. Once entering Bombay, Vijay and his family endure poverty, from sleeping on the streets, becoming a shoeshine and also witnessing his mother being taken advantage of. After retaliating against local goons by burning a petrol pump, his reputation as a hardknock is established and he is taken under by 4 rival gangsters of Kancha Cheena. Vijay grows up to be a key figure of Bombay's underworld (now played by Amitabh Bachchan), but also known as Vijay 'Bhai' (meaning 'Don' or literally 'Brother' Vijay) by the poor for his good deeds and charity. Once surviving an encounter with death from his 4 bosses, Vijay exacts his revenge one-by-one and also getting closer to drug-lord Kancha Cheena. He befriends a street vendor Krishnan Iyer MA (Mithun Chakraborthy), who then is given the job to protect his younger sister Siksha (Neelam), and the two become romantically involved. As he delves deeper into the life of crime, Vijay takes the opportunity exact revenge against Kancha and the people responsible for his fathers' death.\n\nMany comparisons have been made with Agneepath and Brian De Palma's Scarface (1983), saying Agneepath is a remake of De Palma's crime epic. But this is absolutely not the case. As some scenes do resemble hints of Scarface (i.e. Vijay killing 2 of his bosses in a Police station lock-up, the meeting between Vijay and Kancha) even the use of Grigio Moroders' score (in the re-dubbed version with Amitabh's regular voice), other than that the film itself is a completely different story. If anything the film draws similarities to Amitabh's own classic Deewar from 1975, about the rise and fall of a rags-to-riches gangster. The film itself was inspired by the life of Indian gangster Manya Surve; who was shot to death by a police encounter in 1982. Amitabh used many of the late gangsters' mannerisms, the way he sits and even his voice (in the original version of the film). Plot-wise the film is familiar territory for Amitabh, but what excels it above many Indian crime thrillers of that era is the outstanding performances from Amitabh - whose eyes just express the emotions and thoughts of the character and villain Danny - a very hard negative performance to top.\n\nThe film is well-directed as is the cinematography, the violence is not glamorised but rather shown in realistic context which can be gruesome and gritty as well. The best cinematography in the whole film is during the film's finale - where Vijay runs through fire and faces his nemesis. The music used throughout a lot of the film and the finale is from French composer Jean Michel-Jarre's 'Second Rendezvous' and 'Third Rendezvous' albums, as well as Hans Zimmers' score to 'Black Rain' (1988). The performances of the main players as well as strong supporting cast make this an unmissable piece of Hindi cinema. As it was the first Hindi film which saw gangsters wearing Ray Ban sunglasses, driving Bentley's and living in exotic locations. Dialogue by Kader Khan is also a driving force as many quotable lines are mentioned in this film.\n\nOverall the film is a brilliant attempt as performances, dialogue and cinematography make it a great example of Bollywood's best actor at his finest.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A young boy's quest for revenge leads him to become a gangster as an adult, and with each day he becomes more and more like his enemies. Can he find vengeance and redemption?",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2194718489",
        "name": "Agneepath (1990) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTkyZWIyMDktOTVjNi00ZjU5LTk2MzMtNmQ5MTRjOGY1MGFiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTkyZWIyMDktOTVjNi00ZjU5LTk2MzMtNmQ5MTRjOGY1MGFiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-11-02T07:46:07.689Z",
        "url": "https://www.imdb.com/video/vi2194718489/"
    },
    "url": "/title/tt0098999/"
}