{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aileen Wuornos",
            "url": "/name/nm0943368/"
        },
        {
            "@type": "Person",
            "name": "Nick Broomfield",
            "url": "/name/nm0112374/"
        },
        {
            "@type": "Person",
            "name": "Terry Humphreys-Slay",
            "url": "/name/nm3613206/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6816,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018051/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103528/"
        }
    ],
    "datePublished": "2003-11-21",
    "description": "Nick Broomfield's second documentary about serial killer Aileen Wuornos, focusing on her mental state on death row.",
    "director": [
        {
            "@type": "Person",
            "name": "Nick Broomfield",
            "url": "/name/nm0112374/"
        },
        {
            "@type": "Person",
            "name": "Joan Churchill",
            "url": "/name/nm0161443/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Documentary",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWZlY2JlMmYtMGU2YS00MDU0LWFiZDEtOGE2OTJiY2RiMDI5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "death penalty,lawyer,court,prison,interview",
    "name": "Aileen: Life and Death of a Serial Killer",
    "original_info": {
        "id": "Aileen: Life and Death of a Serial Killer_2003",
        "name": "Aileen: Life and Death of a Serial Killer",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0364930/"
        },
        "name": "Suffers a bit from Broomfield's bias but is still chilling and Wuornos is clearly not mentally competent",
        "reviewBody": "Almost a decade after he made his original documentary around the trial of Aileen Wuornos, Nick Broomfield is surprised to open his door one morning and be served with a subpoena to attend what would turn out to be Wuornos final appeal. After being heavily criticised for editing his film to give false impressions, Broomfield's involvement is finished when Wuornos gives up on her appeal and volunteers for the death sentence. Broomfield continues his documentary, looking back at the original trial and getting several interviews with Aileen before her death.\n\nI have not seen the film Monster but I may rent it out after seeing this film as it has raised my interest and given me more factual background to the story than I imagine a Hollywood film would give me. I'm not a massive fan of Broomfield and I was amused to see him being slightly hauled over the coals in court over his editing (the implication being that he made it look like Aileen's lawyer had smoked several spliffs before coming to advise her). However, despite opening himself to this criticism, Broomfield starts looking at the case and digs up some interesting fans, but the real value of the film is the interviews with Wuornos herself. While the film has plenty of little legal points about whether or not she was well advised and about how the media seemed to vilify her more than other similar male killers, it is almost impossible to agree with the penalty when you hear Wuornos talking.\n\nThroughout the film her story changes and I was confused as to what the truth was as she seemed to be lying with every other word. We are then given background of abuse and tough living conditions and suggestions that she is the creation of her harsh and unpleasant background. Despite some interviews (particularly with her mother) that cast doubt on her life, the overwhelming impression of her youth is one of suffering, hardship and cruelty. On top of this, Wuornos herself is increasingly erratic and is clearly not in her right mind  reason enough for locking her away for life rather than killing her. She appears to be suffering from some form of split personality  one moment talking calmly to Nick, the next swearing non-stop at the courts to let her die. The idea that Bush's competency hearing lasting 15 minutes just makes matters worse.\n\nBroomfield is clearly a liberal and is very against the death penalty (his comment 'it has been proven that the death penalty is no deterrent' is just lazy) and this does give the film a real slant in Aileen's favour. Despite this the film is still chilling  it is not totally clear what is true and what isn't but there are two things that are very clear. Firstly, there is no doubt that Aileen killed those men and that (in my opinion) self-defence is no defence for all of them. Secondly, Aileen is not in her right mind and should not have been killed but should have been jailed for life. It is chilling that so much is stacked in her favour and that Wuornos is only one of many people involved who want to flick the switch.\n\nOverall, this is not an easy watch and even the Bush brothers would maybe have doubts over her death penalty. Her last interview descends into total paranoia and instability and is horrible to watch  I was left in no doubt that she deserved jail but in no way did this woman deserve to be killed. It is a well made film despite some bias from Nick and the end result is a chilling film that really made me worry about the systems in some states in the US that seem to treat the death penalty with such ease  like Nick says in reference to the physiological competency test, 'it makes you wonder what you have to do to fail'. After this film Broomfield was interviewed in The Times and said 'When I moved to the US in the 1970's, I had a real belief that it was the land of the free. For me this film marked the end of that belief'  it is to the film's credit that many viewers will be shaken in the same way."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1991573785",
        "name": "Aileen: Life and Death of a Serial Killer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWNjNGRkMWYtZDQ4My00MjhhLWE3MjgtMWFiZmMxZDUwNTMyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWNjNGRkMWYtZDQ4My00MjhhLWE3MjgtMWFiZmMxZDUwNTMyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:19:32Z",
        "url": "https://www.imdb.com/video/vi1991573785/"
    },
    "url": "/title/tt0364930/"
}