{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matthew Leitch",
            "url": "/name/nm0500614/"
        },
        {
            "@type": "Person",
            "name": "Diana Quick",
            "url": "/name/nm0703438/"
        },
        {
            "@type": "Person",
            "name": "George Asprey",
            "url": "/name/nm0039697/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1217,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Duncan Roy",
            "url": "/name/nm0747003/"
        }
    ],
    "datePublished": "2002-10-11",
    "description": "AKA is the story of a disaffected youth's search for love, status, and identity in late 1970s Britain. 18-year old Dean is handsome and bright, but feels hampered by his working-class background and by his family, which includes a...",
    "director": [
        {
            "@type": "Person",
            "name": "Duncan Roy",
            "url": "/name/nm0747003/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU1MzU2MTI5OF5BMl5BanBnXkFtZTcwMDk3NjYyMQ@@._V1_.jpg",
    "keywords": "incest,father son incest,talking through a door,aristocracy,texas",
    "name": "AKA",
    "original_info": {
        "id": "AKA_2002",
        "name": "AKA",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fitchalex"
        },
        "dateCreated": "2002-10-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0317052/"
        },
        "name": "Excellent split-screen film about crossing the class divide",
        "reviewBody": "In Britain, while the class divide is no longer relevant to most people's lives in terms of access to education or employment, there is still a great fascination with the lives of the rich. This takes the form of magazines such as 'Hello!' and 'OK!', various TV shows (particularly 'Faking it' in which a person of a certain profession/background/up-bringing is taught to behave in an opposite manner) and the enduring popularity of 'My Fair Lady' on the London stage. AKA deals with this fascination with the upper class and the way a person might assimilate into the group by deceit. Plot-wise the film is therefore quite similar to 'The Talented Mr. Ripley' and indeed also includes the homo-eroticism of that film (a symptom of privileged all male education perhaps?) as well as a certain similarity between the two leads (Matthew Leitch particularly reminds the viewer of Matt Damon when he smiles).\n\nThis is another excellent film by the recently deceased Film Four in its Film Four Lab guise (following 'Jump Tomorrow', 'My Brother Tom' & 'This Filthy Earth') which allowed for some experimentation in the cinema - which in this case means the entire film is shown in triple split screen. Creating an image even wider than 2.35:1 this does mean the viewer has to look from one third of the picture to another to entirely follow the action, but unlike Mike Figgis' 'Time Code' this is never distracting as each of the images is chosen to complement the others - for example a shot of two people talking is split between two images with the third providing a close up - and the audience does get used to this after a couple of minutes when it becomes second nature experiencing a film in this way. There doesn't seem to be a particular reason why the film is set up in this fashion at first, but it does compliment the duplicity of the lead character and the layered facades the other characters in the film hide behind (especially Benjamin). It also obviously provides a way for a 4:3 DV image to fill the cinema screen. Coming from TV backgrounds, all the actors put in reasonable performances, especially the 'adults' but Matthew Leitch in particular (who, like Peter Youngblood-Hills, comes from 'Band of Brothers') gives a commanding performance and it is no surprise that he followed this film with a Hollywood movie (David Twohy's 'Below'). While there are a few problems with the plot - the film implies that homosexuality stems from childhood abuse - an occasional problems with the quality of the sound (due to the budget) this is nevertheless a brilliant feature debut for writer director Roy, and together with his lead actor, I will be surprised if an impressive career does not follow...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0317052/"
}