{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aamir Khan",
            "url": "/name/nm0451148/"
        },
        {
            "@type": "Person",
            "name": "Manisha Koirala",
            "url": "/name/nm0463539/"
        },
        {
            "@type": "Person",
            "name": "Master Adil",
            "url": "/name/nm0011995/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5273,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0156546/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038817/"
        },
        {
            "@type": "Person",
            "name": "Nasir Hussain",
            "url": "/name/nm0403826/"
        },
        {
            "@type": "Person",
            "name": "Mansoor Khan",
            "url": "/name/nm0451257/"
        }
    ],
    "datePublished": "1995-11-30",
    "description": "An estranged couple battle for the custody of their only son.",
    "director": [
        {
            "@type": "Person",
            "name": "Mansoor Khan",
            "url": "/name/nm0451257/"
        }
    ],
    "duration": "PT2H40M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmM4YWQ2NTAtNzQ5Yy00ZmE0LTg4NDUtNzI2MWQwNWUyMGU2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "man carries a boy,man keeps house,wife leaves her husband,marriage,singer",
    "name": "Akele Hum Akele Tum",
    "original_info": {
        "id": "Akele Hum Akele Tum_1995",
        "name": "Akele Hum Akele Tum",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Peter_Young"
        },
        "dateCreated": "2009-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112313/"
        },
        "name": "Abhimaan meets Kramer vs. Kramer, and somehow succeeds!",
        "reviewBody": "Akele Hum Akele Tum is a very entertaining and charming film. The film seems to have been inspired by two films, Abhimaan and Kramer vs. Karmer. Abhimaan showed the rise of one spouse in the music industry to another's fall, and Kramer vs. Kramer showed two separated parents fighting over their child's custody. The film has bits of both films, though it's much more similar to the latter. There are actually several sequences which are copied frame-by-frame, which is annoying, but I did like the fact that it was like an expansion of the Kramer vs. Kramer plot. It's like showing the motives behind Meryl Streep's character's decision to leave her husband, giving a larger view of what could probably have happened in the middle, and ending it up with a more complete ending. That's why this is one remake which is easier to forgive.\n\nMansoor Khan's direction is very good and it is aided by a very memorable soundtrack and great casting. Anu Malik's music is exceptional and every song stands out (even though some of them, like the film itself, are unoriginal). \"Raja Ko Rani Se\" is very melodious and romantic, \"Aisa Zakham Diya\" is youthful and catchy, \"Akele Hum Akele Tum\" is a great song showing the loving relationship of a father and his son (and the fact that it's actually sung by Udit Narayan and his real-life son Aditya makes it even more convincing), \"Dil Mera Churaya Kyon\" is beautifully melancholic, and \"Dil Kehta Hai\" is another amazingly exciting and romantic gem. All the songs are extremely well pictured in the film. \n\nAamir Khan and Manisha Koirala have a fantastic chemistry (I also loved their collaboration in the 1999 film Mann). This is one of Khan's best performances - very mature, very natural, at times restrained and at times temperamental. Koirala is both beautiful and convincing. She is first a young dreamy girl who wants to become a singer, then a married woman, then an angry mother/homemaker whose inferiority complex and dissatisfaction from her life and marriage cause her to try to find a new life, then a reigning singer, then a suffering mother whose determination to get her son back looks almost selfish. She is credible in every shade her character goes through. Tanvi Azmi also gives a very fine performance.\n\nOverall, Akele Hum Akele Tum is a very enjoyable family drama. It has bits of everything and is generally well made, although it does tend to be melodramatic at several sequences. It did bother that some scenes were copied frame-by-frame, but as a whole, it is a decently Indianised film and as already said, it updates and expands the Kramer vs. Kramer plot quite effectively. I'm not saying it's a great film, but it is one of those films which show the magic of Bollywood's 1990s, which may not have had the great technical advances of today, but were much more simple, naive and alluring thanks to their very profound Hindi film style, extremely melodious songs and great human and family values.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0112313/"
}