{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 564,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0147898/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074086/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061425/"
        },
        {
            "@type": "Person",
            "name": "Mose Richards",
            "url": "/name/nm0724255/"
        }
    ],
    "datePublished": "1997-04-11",
    "description": "A look at the Alaskan wilderness throughout the year, from the harsh winters to the rejuvenating spring, and the animals (including its human residents) who learn to adapt to the extremes of Alaskan weather.",
    "director": [
        {
            "@type": "Person",
            "name": "George Casey",
            "url": "/name/nm0143426/"
        }
    ],
    "duration": "PT41M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODkwNzE0NTI3MV5BMl5BanBnXkFtZTcwOTMxOTkxMQ@@._V1_.jpg",
    "keywords": "denali national park,northern u.s.,cold water,state name in title,wilderness",
    "name": "Alaska: Spirit of the Wild",
    "original_info": {
        "id": "Alaska: Spirit of the Wild: IMAX_1997",
        "name": "Alaska: Spirit of the Wild: IMAX",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2022-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0130445/"
        },
        "name": "Alaskan wilderness",
        "reviewBody": "'Alaska Spirit of the Wild' immediately appealed first hearing about it. The subject sounded very interesting, as did the location of Alaska which doesn't feature enough in documentaries. Also like a lot of Charlton Heston's work and he always did have a great authoritative voice and presence. That it was nominated for an Oscar added further to the interest and there are some very good and more IMAX documentary films and short subjects.\n\nWhile not one of my all time favourite documentaries or one that is ground breaking (naming them would be unfair though due to the approach being very different), 'Alaska Spirit of the Wild' does a great job with its subject and location and of all the IMAX documentaries it's one of the best and most educational. It's also one of the better narrated and scored ones and one of not enough that feature humans to not feel disjointed or unbalanced.\n\nThe only major debit to me was the too short length, many of the IMAX documentaries would have benefitted from being 10-15 minutes longer and 'Alaska Spirit of the Wild' is one of those.\n\nHowever, it looks absolutely beautiful with some truly stunning shots and great expansive use of the varied location that is both beautiful and unforgiving. This is also one of the few IMAX 3D nature documentaries where the 3D actually doesn't look cheap, too gimmicky or/and too reliant upon. The wildlife absolutely dazzle, having an otherworldly alien-like effect in the early stages which was fascinating to watch.\n\nMoreover, the music is accessible in style that has appeal for all ages and suits the theme and content very well. It is also absolutely beautiful on its own terms in its own right. It is relaxing in some parts, but also has edge and a not too intrusive sweep in others. The wildlife are a great mix of adorable, menacing and exotic, as well as beautifully varied in size and whether they are prey or predator. Cannot get enough of the bears and the whales.\n\nAlso learnt such a lot from the information given. It is not only educational and brings a fresh slant on familiar material, it is also entertaining and emotionally investable without any dumbing down or over-complicated terminology. Nothing should disturb younger viewers, yet it's not cookie cutter or sugar coated, it isn't afraid to show that daily life in the habitat is not easy and very comprehensively shows why. Heston delivers this information very authoritatively and with gravitas.\n\nVery good overall. 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0130445/"
}