{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        },
        {
            "@type": "Person",
            "name": "Harry Tyler",
            "url": "/name/nm0878826/"
        },
        {
            "@type": "Person",
            "name": "John Williams",
            "url": "/name/nm0002369/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18024,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0137799/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137800/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059434/"
        }
    ],
    "datePublished": "1955-10-02",
    "description": "Series of unrelated short stories covering elements of crime, horror, drama, and comedy about people of different backgrounds committing murders, suicides, thefts, and other sorts of crime caused by certain motivations, perceived ...",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWQ1OGI0ZTItOTNkYi00NWFhLWE3ZWYtODVmMjkzMmM1NDYwXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "death,director name in series title,famous opening theme,comedic bit,director as tv host",
    "name": "Alfred Hitchcock Presents",
    "original_info": {
        "id": "Alfred Hitchcock: Young & Innocent | The Cheney Vase_1937",
        "name": "Alfred Hitchcock: Young & Innocent / The Cheney Vase",
        "year": "1937"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Gunnar_Runar_Ingibjargarson"
        },
        "dateCreated": "2008-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0047708/"
        },
        "name": "Hitchcock, the Greatest",
        "reviewBody": "When it premiered on CBS on October 2, 1955, Alfred Hitchcock Presents was an instant hit destined for long-term popularity. The series' original half-hour anthology format provided a perfect showcase for stories of mystery, suspense, and the macabre that reflected Hitchcock's established persona. Every Sunday at 9:30 p.m., the series began with the familiar theme of Gounod's \"Funeral March of a Marionette\" (which would thereafter be inextricably linked with Hitchcock), and as Hitchcock's trademark profile sketch was overshadowed by the familiar silhouette of Hitchcock himself, the weekly \"play\" opened and closed with the series' most popular feature: As a good-natured host whose inimitable presence made him a global celebrity, Hitchcock delivered droll, dryly sardonic introductions and epilogues to each week's episode, flawlessly written by James Allardyce and frequently taking polite pot-shots at CBS sponsors, or skirting around broadcast standards (which demanded that no crime could go unpunished) by humorously explaining how the show's killers and criminals were always brought to justice... though always with a nod and a wink to the viewer. This knowing complicity was Hitchcock's pact with his audience, and the secret to his (and the series') long-term success. It's also what attracted a stable of talented writers whose tele plays, both original and adapted, maintained a high standard of excellence. Hitchcock directed four of the first season's 39 episodes, including the premiere episode \"Revenge\" (a fan favorite, with future Psycho costar Vera Miles) and the season highlight \"Breakdown,\" with Joseph Cotten as a car-accident victim, paralyzed and motionless, who's nearly left for dead; it's a perfect example of visual and narrative economy, executed with a master's touch. (The fourth episode, \"Don't Come Back Alive,\" is also a popular favorite, with the kind of sinister twist that became a series trademark.) Robert Stevenson directed the majority of the remaining episodes with similar skill, serving tightly plotted tales (selected by associate producers Joan Harrison and Norman Lloyd) by such literary greats as Ray Bradbury, Robert Bloch, Cornell Woolrich, Dorothy L. Sayers, and John Collier. Adding to the series' prestige was a weekly roster of new and seasoned stars, with first-season appearances by Cloris Leachman, Darren McGavin, Everett Sloane, Peter Lawford, Charles Bronson, Barry Fitzgerald, John Cassavetes, Joanne Woodward, Thelma Ritter, and a host of Hollywood's best-known character players. With such stellar talent on weekly display, Alfred Hitchcock Presents paved the way for Thriller, The Twilight Zone, and other series that maximized the anthology format's storytelling potential.\n\nPacked onto three double-sided DVDs, these 39 episodes hold up remarkably well, and while some prints show the wear and tear of syndication, they look and sound surprisingly good (although audio compression will cause many viewers to turn up the volume). The 15-minute bonus featurette, \"Alfred Hitchcock Presents: A Look Back\" is perfunctory at best, but it's nice to see new anecdotal interviews with Norman Lloyd, assistant director Hilton Green, and Hitchcock's daughter Pat (a frequent performer on these episodes), who survived to see their popular series benefit from the archival convenience of DVD.\n\nStarring: Alred Hitchcock (Host) Director: Robert Stevens."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Series of unrelated short stories covering elements of crime, horror, drama, and comedy about people of different backgrounds committing murders, suicides, thefts, and other sorts of crime caused by certain motivations, perceived or not.",
        "duration": "PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1047576089",
        "name": "DVD Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjg2YzU0YWEtMDE0Ni00NTlkLTgwM2ItMmRhOTA3ZTI4ODE1XkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjg2YzU0YWEtMDE0Ni00NTlkLTgwM2ItMmRhOTA3ZTI4ODE1XkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg",
        "uploadDate": "2020-07-17T09:49:35.409Z",
        "url": "https://www.imdb.com/video/vi1047576089/"
    },
    "url": "/title/tt0047708/"
}