{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Will Smith",
            "url": "/name/nm0000226/"
        },
        {
            "@type": "Person",
            "name": "Jamie Foxx",
            "url": "/name/nm0004937/"
        },
        {
            "@type": "Person",
            "name": "Jon Voight",
            "url": "/name/nm0000685/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 102097,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035930/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011877/"
        },
        {
            "@type": "Person",
            "name": "Gregory Allen Howard",
            "url": "/name/nm0397322/"
        },
        {
            "@type": "Person",
            "name": "Stephen J. Rivele",
            "url": "/name/nm0729151/"
        },
        {
            "@type": "Person",
            "name": "Christopher Wilkinson",
            "url": "/name/nm0929349/"
        }
    ],
    "datePublished": "2001-12-25",
    "description": "A biography of sports legend Muhammad Ali, focusing on his triumphs and controversies between 1964 and 1974.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Mann",
            "url": "/name/nm0000520/"
        }
    ],
    "duration": "PT2H37M",
    "genre": [
        "Biography",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjA3OTUxNTktN2FlNC00NGUyLWI1NDktY2FlZTc5MDlmOGFhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "1960s,1970s,africa,muslim,black muslim",
    "name": "Ali",
    "original_info": {
        "id": "Ali_2001",
        "name": "Ali",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Old Joe"
        },
        "dateCreated": "2002-09-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0248667/"
        },
        "name": "Forget What You Think You Know",
        "reviewBody": "He ' floated like a butterfly and stung like a bee' and the world says he was the 'greatest'. Of course I am talking about Muhammad Ali, the world's most famous boxer. The movie to celebrate his life was an exceptional piece of cinematography. With an outstanding cast and hypnotic story, 'Ali' brings to life the controversial and popular boxer that we all love. This movie can be enjoyed by anyone, whether they like boxing or not.\n\nThe Champ Is Here! With wit and athletic genius, with defiant rage and inner grace, Muhammad Ali forever changed the American landscape. Fighting all comers, Ali took on the law, conventions, the status quo and the war - as well as the fists in front of him. Ali both ignited and mirrored the conflicts of his time and ours to become one of the most admired fighters in the world.\n\nWhat an unbelievable role, by Hollywood superstar, Will Smith. He was fantastic in the role of Muhammad Ali. The work that he must have had to put into become 'Ali', would have been so grueling. I remember reading that Smith had to go through heavy amounts of boxing and weight training, to feel like a boxer, and then also look at Ali as a youngster from footage, and then become him. That he did, in only the way that Will Smith can. He was so good that the academy saw the role to be worthy of an academy award nomination. It was a shame that he did not win it.\n\nThe other roles in this film were also of a high quality. I found Jon Voight's role as the outlandish sports commentator, Howard Cosell, to be brilliant. At no stage can you pick that it is him. I am sure that what we see of Cosell, from Voight, is the true man of the time. It was also interesting to see Will Smith's real wife, Jada Pinkett, in the same movie. She was good as one of Muhammad's love interests.\n\nThe story to this film was interesting, as it had many fascinating facets to it. I found the way that we see Muhammad's interaction with the many women in his life to be written and portrayed well. I also enjoyed the way that Ali stood up for himself outside of the ring, with a poignant time in the film being when Cassius Clay rejects serving in the US army to fight in the Vietnam war. In addition to the fighting scenes that were interweaved brilliantly, to help balance this film's story. A lot of the praise must be given to the main man behind this film, director Michael Mann. He did an amazing job bringing 'Ali' to life. He was also a producer and a writer, so he had a big role in making 'Ali' the film it was.\n\nAlso having real boxers appear in this film, made the movie all the more enjoyable, as you believe the fighting is real. In fact the boxing scenes in this film, are of the finest quality. Will Smith put a lot of himself on the line, by really fighting as a boxer. He was up against fighters such as Malick Bowens, Michael Bentt, James Torney, Alfred Cole and Charles Shufford. I am certain that these men could pack a good punch, so Will was very willing to put his health on the line to make this film 'believable'.\n\nI must make mention of what a personality Muhammad must have been. He was very opinionated, but also stood up for what he thought was true. I remember one comment about Ali being that he was 'a loud mouth', and that was so true. I mean the way that he must have fired up his opponents before a fight, by his blind arrogance is truly amazing. Again praise must be given to the way that Will Smith captured Ali's personality, to be really coming 'the greatest'. It is a shame that Muhammad's life has been affected by the horrible 'Parkinson's disease'. Yet I am sure that he is giving a great battle against this.\n\nAli is another film based on a true story, with a role that one performer makes his own. Smith is now in the class of actors such as Jim Carrey who became the crazy Andy Kaufman, Denzel Washington who became Rubin 'Hurricane' Carter, the fine role taken on by Academy Award winner Hilary Swank, who became the controversial figure of Teena Brandon in 'Boys Don't Cry' and Julia Roberts, who was Erin Brockovich, in one of the best performances of her career. This role was great from Smith, as it can and will show many people of my generation how great a legend Ali really was and is. This movie gives us all an important lesson. That we can be anything we want, against adversary and for the only person who counts - that being you!\n\nCMRS gives 'Ali': 4 (very good film)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2319302425",
        "name": "Ali",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTRiNDE5OTYtMmI0ZS00ZWI3LWJiNmItZjI4NzdhZmZhNTY0XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTRiNDE5OTYtMmI0ZS00ZWI3LWJiNmItZjI4NzdhZmZhNTY0XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-12-05T17:05:05.279Z",
        "url": "https://www.imdb.com/video/vi2319302425/"
    },
    "url": "/title/tt0248667/"
}