{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sandrine Kiberlain",
            "url": "/name/nm0452161/"
        },
        {
            "@type": "Person",
            "name": "Nicole Garcia",
            "url": "/name/nm0305368/"
        },
        {
            "@type": "Person",
            "name": "Mathilde Seigner",
            "url": "/name/nm0782565/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1617,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Alias Betty",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071664/"
        },
        {
            "@type": "Person",
            "name": "Claude Miller",
            "url": "/name/nm0002218/"
        },
        {
            "@type": "Person",
            "name": "Ruth Rendell",
            "url": "/name/nm0719334/"
        }
    ],
    "datePublished": "2002-09-13",
    "description": "Novelist Betty Fisher enters a dark depression after her young son Joseph dies. Hoping to bring her out of it, her mother Margot arranges to kidnap a boy named Jose to replace the son Betty lost. Although she knows that it's wrong...",
    "director": [
        {
            "@type": "Person",
            "name": "Claude Miller",
            "url": "/name/nm0002218/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGU1MGU4M2EtODQ2NS00M2JmLWE0N2MtYjRkZTk3YzhiYmYyXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "france,child,novelist,depression,death",
    "name": "Betty Fisher et autres histoires",
    "original_info": {
        "id": "Alias Betty_2001",
        "name": "Alias Betty",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2002-10-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0269329/"
        },
        "name": "Nothing to do with the original novel",
        "reviewBody": "I can now understand why authors feel leery about letting screenwriters adapt a novel. First of all, a full length novel doesn't translate well to the screen. There are too many nuances and too many details, that trying to do them all, will humble the most talented scribe.\n\nTake the case of the novel in which this film is based. The Tree of Hands by the magnificent British master of suspense, Ruth Rendell. The adaptation has nothing to do with the brilliant narrative she gave us with this novel. If anyone wants to see the best adaptation of a Rendell book, I would recommend to see Claude Chabrol's, \"La Ceremonie\".\n\nNot only was that a superior film, but it reveals the essence of the book with little effort. \n\nThe problem with \"Alias Betty\" is Mr Miller's scenario. He has changed the basic premise of the book into something else. Now, don't get me wrong, it is a better film than some of the mediocrity coming from France lately.\n\nThe big problem is with the character of the mother. Nicole Garcia is out of her range here. Not only that, one never understands what's wrong with her, even though she appears to be schizophrenic. She's a loose cannon up to no good. In the novel she's even more so. \n\nBetty is ambiguously played by Sandrine Kiberlain, which in a way, suits the character better. She is the only sane person around, even though she is unable to control the mother. \n\nThe minor side plots add to the story, but everything at the end is resolved so easily that one wonders if anything like that is possible in life. The films end in an upbeat note, even though it has nothing to do with the original novel.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0269329/"
}