{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wayne D. Barlowe",
            "url": "/name/nm0055297/"
        },
        {
            "@type": "Person",
            "name": "Curtis Clark",
            "url": "/name/nm1927307/"
        },
        {
            "@type": "Person",
            "name": "James Garvin",
            "url": "/name/nm1877129/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1609,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045277/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130849/"
        },
        {
            "@type": "Person",
            "name": "Peter Crabbe",
            "url": "/name/nm0185578/"
        },
        {
            "@type": "Person",
            "name": "Steve Eder",
            "url": "/name/nm1511414/"
        }
    ],
    "datePublished": "2005-05-14",
    "description": "The CGI or computer animated drama/documentary takes place on Darwin IV, a planet 6.5 light years from earth, with 2 suns and 60% of Earth's gravity. Having identified Darwin as a world that could support life, Earth sends a pilot...",
    "director": [
        {
            "@type": "Person",
            "name": "Pierre de Lespinois",
            "url": "/name/nm0504273/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Documentary",
        "Animation",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjE4OWI2MGUtNzkxNy00NmI5LTllMTEtODAxZDQ1Y2RjY2ZkXkEyXkFqcGdeQXVyNjcwMzExMzU@._V1_.jpg",
    "keywords": "lightspeed,alien creature,space exploration,national aeronautics and space administration,astronomical object in title",
    "name": "Alien Planet",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ThurstonHunger"
        },
        "dateCreated": "2009-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0453446/"
        },
        "name": "It's Wayne Douglas Barlowe's world, and we...",
        "reviewBody": "...just don't live in it. Yet?\n\nThe film may not be for self-proclaimed serious scientists....or for \"serious creationists\"...but for curious six year olds this was more than watchable and raised interesting questions in the xenobiological realm. So for me, as their Dad it was a success.\n\nBut even for all those serious science fans, with the commentary of Hawking, Kaku, Venter...what is the quibble about? Admittedly we are talking about something that if it happens will happen well after my children's children are dead, but trying to estimate what might be still is fun, and ideally incentive enough to continue to search the stars. Kaku works in a message of how rare and treasured life should be, even here on our own planet. Have any of the participating scientists rebuked this film?\n\nAs for all the \"serious creationists\", I still think this movie is more captivating than a discussion of how many angels could dance on the head of a pinhead. \n\nThe probes, with their wide eyes and narrow dots inside, gave a nice illusion of shock as each new creature was unfurled. The DVD came packaged for the sake of TV with commercial inserts, and sneak previews for something coming in the next three seconds. I found that a bit annoying.\n\nAnyways, I can see some of the criticism, overly sleek animation leaves the creatures devoid of texture...more insight into the animals behavior (eating, socialization)...but I think this was mostly a chance to introduce the basic concept of life on another planet (hence disappointing to the two groups above) and a chance to display Wayne Douglas Barlowe's artwork...with whom I was regrettably unfamiliar, so I'll look forward to sharing some of his library books with the boys.\n\nNot sure if he has done illustrations for the Book of Revelation, but that might appeal to some.\n\nYours for heresy and fantasy,\n\nThurston Hunger\n\n7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0453446/"
}