{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Broderick Crawford",
            "url": "/name/nm0002024/"
        },
        {
            "@type": "Person",
            "name": "John Ireland",
            "url": "/name/nm0409869/"
        },
        {
            "@type": "Person",
            "name": "Joanne Dru",
            "url": "/name/nm0238445/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15675,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Robert Penn Warren",
            "url": "/name/nm0913014/"
        },
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        }
    ],
    "description": "The rise and fall of a corrupt politician, who makes his friends richer and retains power by dint of a populist appeal.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjQyN2MwMjAtNmJmZS00OWZlLWE1NGQtOGZmYmRjZjIyNWEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "politician,governor,rise and fall,election campaign,political corruption",
    "name": "All the King's Men",
    "original_info": {
        "id": "All the King's Men_1949",
        "name": "All the King's Men",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "VideoJoeD"
        },
        "dateCreated": "2006-10-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041113/"
        },
        "name": "The Test of Time!",
        "reviewBody": "I viewed this film for the first time this past week. It was one of only a few \"Best Picture\" Oscar winners over the past fifty or sixty years that I had not previously seen. I have found most, but not all, of these films to be absorbing and/or entertaining with the majority deserving of the awards they received. I included this specific film in a personal test that I conducted recently. I initially viewed the current version of this film, which features an impressive cast headed up by Sean Penn, Jude Law, Kate Winslet and Anthony Hopkins. Then I rented this 1949 award winner to compare both versions.\n\nI am aware that when you first see a film or program that you find to be an excellent presentation and then you view a newer version of the same entity, the normal tendency is to find the new version not up to the standards of the original due to the unfairly high expectations. For the test conducted, I switched viewing order of the two versions. I anticipated finding the newer version more rewarding due to the more than half century difference in the two presentations and the fact that Sean Penn and Anthony Hopkins have each artistically created several roles which I have found to be top of the line performances. It did not work out that way in this case. I found the 1949 version withstood the test of time and in my opinion was the superior production. This had to do with several factors, the primary one being that the screen play of the older version seemed to be better paced and the presentation flowed more evenly. I believe this version more closely followed the novel and the depiction of the central character \"Willie Stark\". The novel loosely based this character on real life Louisiana politician \"Huey Long\". I concluded that the newer version tried to capture more of Longs' character along with his political successes and failures. In doing so it lost some of the novels flow and impact.\n\nBoth versions have excellent casts and the performances given by both Sean Penn and Broderick Crawford (Oscar winning) as Willie Stark are first rate. I consider this version to be a top 25 all time political drama and gave it an 8 out of 10 IMDb rating, but I would recommend both versions for fans of semi-biographical political dramas.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The rise and fall of a corrupt politician, who makes his friends richer and retains power by dint of a populist appeal. ",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1816854553",
        "name": "All the King's Men -- Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjExMTcyNTg5Ml5BMl5BanBnXkFtZTcwODk0NDQwMg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjExMTcyNTg5Ml5BMl5BanBnXkFtZTcwODk0NDQwMg@@._V1_.jpg",
        "uploadDate": "2008-11-18T17:54:57Z",
        "url": "https://www.imdb.com/video/vi1816854553/"
    },
    "url": "/title/tt0041113/"
}