{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Hurt",
            "url": "/name/nm0000457/"
        },
        {
            "@type": "Person",
            "name": "Christian Bale",
            "url": "/name/nm0000288/"
        },
        {
            "@type": "Person",
            "name": "Daniel Benzali",
            "url": "/name/nm0073137/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3073,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029168/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019383/"
        },
        {
            "@type": "Person",
            "name": "Eski Thomas",
            "url": "/name/nm0858811/"
        },
        {
            "@type": "Person",
            "name": "Walker Hamilton",
            "url": "/name/nm0358207/"
        }
    ],
    "datePublished": "1999-07-09",
    "description": "Bobby Platt is a mentally slow young man who escapes an abusive, hateful stepfather who has killed his pets one by one. To save himself, Bobby runs away and meets a strange old man who wanders the highways to bury roadkill animals...",
    "director": [
        {
            "@type": "Person",
            "name": "Jeremy Thomas",
            "url": "/name/nm0859016/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Adventure",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTBlNjVhNzEtODA4MS00YjQ0LTlhZjMtYjY3NTFiYTRlMDM4XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "escape,feature film directorial debut,producer director,based on novella,mentally challenged man",
    "name": "All the Little Animals",
    "original_info": {
        "id": "All the Little Animals_1998",
        "name": "All the Little Animals",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sigsrfun"
        },
        "dateCreated": "2006-10-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120584/"
        },
        "name": "Excellent acting, but soft on story line",
        "reviewBody": "It seems that most child actors don't transition well as they mature. They either end up with childish physical features or an acting style that suffers from an inability to evolve past the primitive roles they had in their youth. Then there's Christian Bale. From Empire of the Sun to American Psycho he has displayed a competent transition into adulthood and has made a fan out of me. And unlike female fans, guys who like Christian Bale, nine times out of ten, are not transfixed on the shower scene in AP.\n\nAll the Little Animals is yet another competent performance, and not only from Christian, but for the impeccable John Hurt and the terrifying Daniel Benzali. Christian Bale plays Bobby Platt, a twenty-four year old man child. He tells us that when he was younger he was hit by a car and has never been the same since. Bobby is very emotionally fragile and slightly simple minded, though not to the degree of a virtual on screen degenerate. This is the key to his performance. Most actors playing the role of the mentally handicapped overplay the affliction thus making their characters completely incapable of functioning in society, a la Rainman. Christian's Bobby Platt is 95% normal, like any other person, but when stressed he starts to cry, more like a 10 year old child than a 24 year old man. Coupled with the fact that he is relatively simple and not capable of expressing himself as well as he otherwise would, he ends up being victimized by his step father (played perfectly by Daniel Benzali), whom Bobby refers to as \"the Fat.\" Benzali's character is a sadist who suffocates Bobby's pet mouse in order to get Bobby to sign legal documents which Bobby is clearly not capable of understanding. Bobby has enough intelligence to refuse to sign anything and out of fear of the Fat's threat that he will be institutionalized he runs away from home.\n\nBobby eventually comes across Mr. Sommers (John Hurt) who is an eccentric recluse who goes around Englands small country roads burying animals that have been crushed by motorists. Bobby begs Mr. Sommers to let him live with him and Mr. Sommers reluctantly agrees.\n\nAs the story unfolds, Bobby becomes comfortable enough with Mr. Sommers to reveal his secret (that he has run away) and Mr. Sommers likewise tells him of his own, strangely similar past which I will not reveal. Realizing that running away from the Fat is not a solution to Bobby's problems, Mr. Sommers convinces Bobby to return to the Fat, sign the legal documents and then live with Mr. Sommers without any more fear of his stepfather. However, Mr. Sommers is a bit naive about dealing with the Fat who reveals in the last 20 minutes of film just why he may very well be one of the most evil stepfathers of all time.\n\nThe ending is unfortunately predictable and unnecessarily long. Also, far too much of the film focuses on Mr. Sommers curious \"work\" of burying road kill. This would not be so bad had there been more of a story line. Also, this film propounds a simplistic moral message about life being precious. Yet the ending completely undermines this moral absolute.\n\nThis film is plot driven, and not a character study, and therefore the good performances are not enough to make this film worthy of greater praise. If not for the powerful acting this film would be merely mediocre.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "All the Little Animals Trailer - Directed by Jeremy Thomas and starring John Hurt, Christian Bale, Daniel Benzali, James Faulkner, John O'Toole. An emotionally challenged young man named Bobby (Christian Bale) runs away from home in order to escape his abusive stepfather who has killed his pets. He meets an old man, Mr. Summers (John Hurt), who spends his time traveling and giving burials to animals that have been killed by cars. Bobby, also having an affinity for animals, becomes friends with the old man and aids him in his task.",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3482436377",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGJjM2U5ODAtMjA1Mi00Mjk5LTgxZjItOTZmYzkyOWU4YWIzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGJjM2U5ODAtMjA1Mi00Mjk5LTgxZjItOTZmYzkyOWU4YWIzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-04T01:51:34.125Z",
        "url": "https://www.imdb.com/video/vi3482436377/"
    },
    "url": "/title/tt0120584/"
}