{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dustin Hoffman",
            "url": "/name/nm0000163/"
        },
        {
            "@type": "Person",
            "name": "Robert Redford",
            "url": "/name/nm0000602/"
        },
        {
            "@type": "Person",
            "name": "Jack Warden",
            "url": "/name/nm0912001/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 118970,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0034515/"
        },
        {
            "@type": "Person",
            "name": "Carl Bernstein",
            "url": "/name/nm0077012/"
        },
        {
            "@type": "Person",
            "name": "Bob Woodward",
            "url": "/name/nm0940124/"
        },
        {
            "@type": "Person",
            "name": "William Goldman",
            "url": "/name/nm0001279/"
        }
    ],
    "datePublished": "1976-04-09",
    "description": "\"The Washington Post\" reporters Bob Woodward and Carl Bernstein uncover the details of the Watergate scandal that leads to President Richard Nixon's resignation.",
    "director": [
        {
            "@type": "Person",
            "name": "Alan J. Pakula",
            "url": "/name/nm0001587/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Drama",
        "History",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWI2YWQxM2MtY2U4Yi00YjgzLTgwNzktN2ExNTgzNTIzMmUzXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "investigative journalism,watergate,newspaper,journalist,scandal",
    "name": "All the President's Men",
    "original_info": {
        "id": "All the President's Men_1976",
        "name": "All the President's Men",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2004-03-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074119/"
        },
        "name": "Required viewing.",
        "reviewBody": "If you were to imagine yourself as a newspaper journalist, one of the best conspiracies you could ever find yourself stumbling upon would undoubtedly be the infamous Watergate Scandal. And reporters Bob Woodward (Robert Redford) and Carl Bernstein (Dustin Hoffman) were the two men who found themselves head-above-water in an elaborate cover-up that went all the way up the chain of command to the United States President himself.\n\nOn June 17th, 1972, Watergate hotel security guard Frank Wills spotted a possible break-in at the Democratic Party's National Committee. Some apparent CIA agents were arrested for breaking and entering, and later held at a trial, where Bob Woodward first found out that they were more than mere intruders. They worked for the government.\n\nAfter researching into the matter, Woodward soon realized that one of the intruders had the name of a political figure scrawled in a notebook located within his shirt pocket. \n\nAnd with the help of Carl Bernstein, a fellow Washington Post reporter (and a veteran of the field), Woodward followed the slight tracks, and the two men soon found themselves unearthing a shattering conspiracy that did indeed lead all the way up to President Richard Nixon, the 37th President of the United States of America, himself.\n\nBased on Woodward and Bernstein's own memoirs, William Goldman's Oscar-winning script makes for a brilliant subtle mystery; a true-life story as amazingly honest and forthright as it is entertaining and engaging. It would always remain the late Alan J. Pakula's greatest film, and its standing as one of the top films of all time on many various \"great movies lists\" is certainly merited. \n\nIt's a shame that both Hoffman and Redford were snubbed by the Academy Awards for their performances here. As Woodward and Bernstein, the two are amazingly convincing and bounce dialogue off of each other with striking clarity and realistic quality. Hoffman, who is top billed, appears in the film less than Redford, but gives just a performance just as amazing. He would gain an Oscar twelve years later for his portrayal of Raymond Babbitt in \"Rain Man,\" his finest performance to date, but his role in \"All the President's Men\" is of a different caliber. Woodward and Bernstein are two complete opposites, and at first they rub each other the wrong way -- Bernstein, a veteran reporter, takes one of Woodward's articles and starts making revisions. \"I don't mind what you did,\" Woodward says, \"I just mind how you did it.\" Even though it's not anything special, this if my favorite scene in the movie, and perhaps the best example of just how well these two actors are able to bring their characters to life.\n\nThe movie is a mystery but not in the traditional sense. Almost all of us watching the film already know how the story is going to turn out, but the way it makes its dynamic revelations seem surprising and its story tense and exciting is one of the greatest examples of compelling filmmaking.\n\n For the film's opening sequence, in which Woodward and Bernstein's condemning news is written on a typewriter, Pakula used sounds of gunshots to clarify each separate key of the device striking downwards. The 37th President of the United States of America was sentenced to a sort of death with the publishing of that article, and the bold gunshots add an extra depth and meaning to this fact.\n\n\"All the President's Men\" has no hidden morals, messages, meanings. It's just a true story about something that happened, brought to life on the big screen by a great director, an influential screenwriter and two of the best actors of all time. No, it's not going to have you thinking after it's over, but if anything, it's the type of movie that will generate a lot of talk instead. And more often than not, that's a good thing.\n\n5/5 stars.\n\n\n* John Ulmer\n",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for All the Presidents Men",
        "duration": "PT2M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2958664729",
        "name": "All the President's Men",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzNmNzY0MWYtZjc5ZC00Y2E1LTkzYTMtODU0ZWFmZjkwMTI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzNmNzY0MWYtZjc5ZC00Y2E1LTkzYTMtODU0ZWFmZjkwMTI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-10-31T03:02:42Z",
        "url": "https://www.imdb.com/video/vi2958664729/"
    },
    "url": "/title/tt0074119/"
}