{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Roy Scheider",
            "url": "/name/nm0001702/"
        },
        {
            "@type": "Person",
            "name": "Jessica Lange",
            "url": "/name/nm0001448/"
        },
        {
            "@type": "Person",
            "name": "Ann Reinking",
            "url": "/name/nm0718237/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33126,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Robert Alan Aurthur",
            "url": "/name/nm0015899/"
        },
        {
            "@type": "Person",
            "name": "Bob Fosse",
            "url": "/name/nm0002080/"
        }
    ],
    "datePublished": "1979-12-20",
    "description": "Director/choreographer Bob Fosse tells his own life story as he details the sordid career of Joe Gideon, a womanizing, drug-using dancer.",
    "director": [
        {
            "@type": "Person",
            "name": "Bob Fosse",
            "url": "/name/nm0002080/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Drama",
        "Music",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2YzMGE2NmUtOTlhMi00MzQyLTgyOTAtMTNiNWRiMjFjYjE3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "price of fame,dancer,surgery,self destructiveness,cigarette smoking",
    "name": "All That Jazz",
    "original_info": {
        "id": "All That Jazz_1979",
        "name": "All That Jazz",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RyanCShowers"
        },
        "dateCreated": "2013-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078754/"
        },
        "name": "An Artistic View on Life",
        "reviewBody": "Artistic people probably do not understand how creatively-lacking people function in their day to day lives. Uncreative people judge artists are pretentious, ridiculous, and unrealistic because of their own lack in understanding of an artistic mind. Ignorance no longer need be a problem, not once you see All That Jazz. I've never seen an artist's thinking, inspiration, and life depicted better in a more flashy, colorful, and wild film.The protagonist, Joe Gideon is for the first two thirds of the film, practically never captured on screen without a cigarette on his lips. Watching All That Jazz is like stealing the cigarette from his mouth and inhaling his artistic expression. \n\nThe most obvious aspect of All That Jazz that is successful is the manner in which its technically made. Bob Fosse is the director here and each scene is directed with such precision, you can feel the real-life, artistic pain melt off the screen. In a film that centers itself around dancing, the choreography is feisty, swift, and collectible complex and inventive. The sets and costumes are dazzling and prove the film cares about it's look just as much it does entertaining us and even more so than both of those, it makes a priority of saying something about artists. The film editing is used as a poem of madness and completely works for All That Jazz.\n\nThe grounding strength of All That Jazz is Roy Scheider being front and center breathing life and artistic \"smoke\" into the film. Never a moment where he takes things too far, everything is held back like a man who has bit off more than he could chew would hold things back. Scheider is perfectly astute and the film wouldn't be the same without his understanding of the character and story. All That Jazz is centered around a flawed man with a drug addiction, uncontrollable sexual desires, stress levels that go through the roof, and personal relationships that have more bumps than they are smooth. Yet, we understand this man's life and work because of Scheider.\n\nAll That Jazz is bright, flashy, and seeking attention to this business and lifestyle. Artistic people are misunderstood by people as some sort of hippie that tries to sway away from \"the norm\" any chance they get. No, they understand themselves and feel they have something to share with the world. They see the world differently than \"normal\" people do. They have a firmer grasp on what things mean to them. It almost feels like a style of film Fellini would be directing. All That Jazz is in tune with the the work, the stress, and the real-life hardships that come as a package deal in the entertainment industry. The film is like shining bright lights on big distress.\n\nThrough this wild, raunchy film, Fosse makes a commentary on an artist's experience understandable to the common man in a very entertaining way. All That Jazz reinvents the word style, flashing new visuals, songs, and choreography at us every minute. Filled with art, dance, and personal expression, All That Jazz will suffocate you with its fantastically told metaphor of an artist's life."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi469220121",
        "name": "All That Jazz",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTA4ZWM3MTgtMzA0YS00MjJlLWIxZGQtZmQ1MTU2NmMyYTdlXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTA4ZWM3MTgtMzA0YS00MjJlLWIxZGQtZmQ1MTU2NmMyYTdlXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-06-20T17:02:08.943Z",
        "url": "https://www.imdb.com/video/vi469220121/"
    },
    "url": "/title/tt0078754/"
}