{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Carroll O'Connor",
            "url": "/name/nm0005279/"
        },
        {
            "@type": "Person",
            "name": "Jean Stapleton",
            "url": "/name/nm0822958/"
        },
        {
            "@type": "Person",
            "name": "Rob Reiner",
            "url": "/name/nm0001661/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17397,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001874/"
        },
        {
            "@type": "Person",
            "name": "Norman Lear",
            "url": "/name/nm0005131/"
        }
    ],
    "datePublished": "1971-01-12",
    "description": "A working class man constantly squabbles with his family over the important issues of the day.",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyOTExMDA5OF5BMl5BanBnXkFtZTcwNjM2NjQ3Mg@@._V1_.jpg",
    "keywords": "based on british tv series,working class,groundbreaking,topical humor,queens new york city",
    "name": "All in the Family",
    "original_info": {
        "id": "All in the Family: Season 2_1971",
        "name": "All in the Family: Season 2",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tfrizzell"
        },
        "dateCreated": "2004-06-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066626/"
        },
        "name": "Arguably the Most Important Television Series of All Time.",
        "reviewBody": "The series was a powder keg immediately from the start as Civil Rights unrest and equal rights not only for minorities, but also women dominated headlines. And then there was Vietnam and Watergate. There was total chaos still in places in the south and in larger metropolitan areas in the north. Could television bring these public affairs to light in a comical and thought-provoking way? The answer was a resounding yes as \"All in the Family\" tore down perpetual American television programming walls with brash views, crazed situations, envelope-pushing elements and dominant film-making techniques (even though this was a sitcom) which all merged to paint a canvass of programming superiority that lasted for 212 mind-blowing episodes over nine years from 1971 through 1979. \"The Andy Griffith Show\" in the 1960s displayed how Americans wanted life to be, while \"All in the Family\" in the 1970s showed how American life really was. The result was a ratings monster pretty much from the word go as people watched to be entertained, to be disgusted, to praise and to criticize. The show itself was about a blue-collared New York dock worker (Carroll O'Connor) who has bigoted expressions because life continues to slap him in the face. O'Connor was definitely anti-woman, anti-minority, anti-youth and anti-liberal. He also had crazed views that would show him as being pro-Nixon and pro-Vietnam (real hot button topics back then). The show struck cords the nation over, but comedy was always mixed in and the series thrived due to both its supporters and its detractors. \"All in the Family\" fought problems in the U.S. by poking fun at very serious issues instead of sweeping them under the carpet like other programs of the period did. Jean Stapleton was priceless as O'Connor's kind, naive and somewhat dumb housewife. Sally Struthers was their only child, a liberal who showed the viewpoints of the Baby Boom generation. She was also married to a young man (Rob Reiner) who was O'Connor's emotional and verbal sparring partner. Reiner was of a Polish descent and that only fueled more fire between the volatile pair. O'Connor's Archie Bunker is arguably the deepest and most unique television character of all time as his crazed and sometimes silly views overshadow the fact that he is a highly sensitive middle-class man who is doing the best for himself and those around him. He is someone who does not always think before he speaks and therein lied his greatest weakness. Eventually most who saw the program embraced him as a flawed and tortured hero (not because of who he was, but because of who he really wanted to be). The lasting effect of \"All in the Family\" is something to think about, even today. The program continues to be vitally important to 1970s art, society and history. The success of the program even led to spin-offs galore. \"Maude\", \"The Jeffersons\", \"Archie Bunker's Place\" and \"Gloria\" were all the birth-children of this innovative, smart and completely original taste of Americana that still lives on strong today through many cable channels. 5 stars out of 5."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "All In The Family",
        "duration": "PT2M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1775090969",
        "name": "All In The Family",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWMyMzI4NjktN2NkYy00MDFjLTk3OGEtZjI2MDFhYWY3ZTBmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWMyMzI4NjktN2NkYy00MDFjLTk3OGEtZjI2MDFhYWY3ZTBmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-06T20:11:46.104Z",
        "url": "https://www.imdb.com/video/vi1775090969/"
    },
    "url": "/title/tt0066626/"
}