{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emmanuelle Chaulet",
            "url": "/name/nm0154299/"
        },
        {
            "@type": "Person",
            "name": "Stephen Lack",
            "url": "/name/nm0480099/"
        },
        {
            "@type": "Person",
            "name": "Katie Garner",
            "url": "/name/nm0063793/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1031,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057924/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0268574/"
        },
        {
            "@type": "Person",
            "name": "Jon Jost",
            "url": "/name/nm0430927/"
        }
    ],
    "datePublished": "1991-04-04",
    "description": "Anna, a French actress, is approached by financial broker Mark in the Vermeer room of a New York gallery. However, romance does not ensue.",
    "director": [
        {
            "@type": "Person",
            "name": "Jon Jost",
            "url": "/name/nm0430927/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI5NDExMjkzOF5BMl5BanBnXkFtZTcwMDgxMjIyMQ@@._V1_.jpg",
    "keywords": "actress,world trade center manhattan new york city,wall street manhattan new york city,metropolitan museum of art manhattan new york city,manhattan new york city",
    "name": "All the Vermeers in New York",
    "original_info": {
        "id": "All the Vermeers in New York_1990",
        "name": "All the Vermeers in New York",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nick-6"
        },
        "dateCreated": "2001-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099014/"
        },
        "name": "A lot of depth and lets you find it on your own terms",
        "reviewBody": "In this review I reveal why the movie is entitled \"All The Vermeers In New York\". I don't think knowing this spoils the film, though.\n\nPeople's expectations of a film reflect a lot about them. A lot of people expect to be moved watching a film when the music swells. They expect to get excited when the shots are cut faster. This film allows you to get excited or moved about what's going on because of what is happening to the _people_, not the camera or the music. Films that cut the \"crap\" of \"high-quality\" production values and concentrate on character and story show how our ordinary lives achieve a cool, plausable if brief potentiality for soaring.\n\nThis film works on this premise, and that's why I love it. It's really a fairly wrenching story that gets told by the people, not as much by the camera and soundtrack (although the shooting and music are brilliantly understated). I identified very closely with the high-powered New York currency trader who couldn't live with himself unless he could come to the museum to gaze at the Vermeer portraits. It allows him to cross the threshold of his own limited life staring at a stock-ticker into a world of pure love, desire and ultimately, hope.\n\nTo Jost, nothing seems ordinary, unalive. He is the Van Gogh of film makers. If he made a film about pebbles in the gutter, it would be worth watching."
    },
    "url": "/title/tt0099014/"
}