{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hayato Ichihara",
            "url": "/name/nm1130046/"
        },
        {
            "@type": "Person",
            "name": "Shûgo Oshinari",
            "url": "/name/nm1099171/"
        },
        {
            "@type": "Person",
            "name": "Ayumi Ito",
            "url": "/name/nm0411683/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9753,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "All About Lily Chou-Chou",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058872/"
        },
        {
            "@type": "Person",
            "name": "Shunji Iwai",
            "url": "/name/nm0412517/"
        }
    ],
    "datePublished": "2001-10-06",
    "description": "The problematic lives of teenager students for whom the singer Lily Chou-Chou's dreamy music is the only way to escape an alienating, violent and insensitive society.",
    "director": [
        {
            "@type": "Person",
            "name": "Shunji Iwai",
            "url": "/name/nm0412517/"
        }
    ],
    "duration": "PT2H26M",
    "genre": [
        "Crime",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzhkMzYyYzYtMDJmNi00MzZkLTkyYzQtNGUzOGQ5NjMxZTU0XkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "bully,japan,prostitute,summer vacation,gang rape",
    "name": "Riri Shushu no subete",
    "original_info": {
        "id": "All About Lily Chou-Chou_2001",
        "name": "All About Lily Chou-Chou",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2004-12-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0297721/"
        },
        "name": "Wow truly mesmerising.",
        "reviewBody": "This is a tale about the lows of a group of high school kids that turn to crime and cyberspace obsession of a pop singer named Lily Chou-Chou.\n\nWriter/director Shunji Iwai film is complex, dark and depressing, with a real intense feel of teenage angst, but truly it's a beautiful film to watch. Shunji Iwai gives us disturbing images of youth's harrowing experiences, in which some characters you feel for, but then after a while you might suddenly despise or the opposite.\n\nWith visually stunning and fresh cinematography, it felt like I was watching an arty music video clip at times. The scenery in the film is lush and exquisite, from the contrast of the alluring islands and the rich grass fields to the harshness of the city and school.\n\nA distinguished and unique soundtrack surrounds and overwhelms the film; the songs we hear are those from the fictional pop singer Lily Chou-Chou. The music really added to the beauty and mystique of this film.\n\nHayato Ichihara as Yûichi Hasumi, a troubled kid that is involve in a crime gang and under an alias, runs the fan club website about Lily Chou-Chou, Shûgo Oshinari as Shusuke Hoshino, once a top student and then suddenly changes and becomes a gang leader and Ayumi Ito as the quiet Yôko Kuno, an outstanding piano player but because of that she is bullied. The performances are brilliantly absorbing and there are no hiccups to say off.\n\nSince the Lily Chou-Chou Website is an important part of the film, we don't actually see anyone in front of the computer screen, except for Yuichi. Whenever there were conversations on her fan's Website, the user-name and their comment would pop up on the screen throughout different scenes in the film or on a black background, though some of the conversations have no resemblance to what's actually happening on screen. At first some of the people were hard to work out who was who on the net, but still I found it quite intriguing.\n\nThe time line in the story goes from the present to past and back to the present, where we learn in detail about Yuichi and Shusuke. There are a couple of surprises that you don't see coming and the story might have its flaws- but they didn't seem to bother me, as I was simply engrossed with the dense context of the film.\n\nLike I typed before this is an haunting and intense tale about teenage angst, there is a lot of agonizing imagery and confronting situations like violence, depression, rape, suicide, prostitution and bullying. This gives it such a grim and disturbing undertone, so it might alienate certain viewers. \n\nFor me it was a breath-taking and visually satisfying experience. \n\n5/5",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0297721/"
}