{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Timothy",
            "url": "/name/nm0863790/"
        },
        {
            "@type": "Person",
            "name": "Robert Hardy",
            "url": "/name/nm0362735/"
        },
        {
            "@type": "Person",
            "name": "Peter Davison",
            "url": "/name/nm0205749/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3973,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "alternateName": "All Creatures Great and Small",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0207399/"
        }
    ],
    "datePublished": "1978-01-08",
    "description": "The trials and misadventures of the staff of a country veterinary office in Yorkshire from the 1930s to the 1950s.",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzU2Mjg1OTAtOTc3ZS00MTk4LTliYWEtZWU1OTk2YTg3MzdkXkEyXkFqcGdeQXVyMTgxOTIzNzk@._V1_.jpg",
    "keywords": "timeframe 1940s,veterinary,period drama,timeframe 1930s,timeframe 20th century",
    "name": "All Creatures Great & Small",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pedro_H"
        },
        "dateCreated": "2006-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075472/"
        },
        "name": "Warm family entertainment with a great setting.",
        "reviewBody": "The life and times of Yorkshire Dales veterinary practise in the years leading up to WWII. Based on the million selling James Herriot autobiographies.\n\nJames Herriot (real name Alfred White) came to Yorkshire as a young vet looking for his first job and despite being of Scottish origins made the place his own. They have even turned his old surgery (in Thirsk) in to a museum and it well worth a visit. Look it up on the internet if you are visiting the area.\n\nThere are very few books well enough written that within a few pages you are dragged inside and falling in love with the characters. I was around when they still were being written and when a new one came out you could be sure I'd be first in line at the bookshop. I'd even set the alarm clock an hour early so I could find more time for them.\n\n(I doubt I'll ever be as excited as that over a book again!) \n\nThe fact that the main man carried on long after becoming a millionaire author showed that he was a man of dedication and integrity. Today there is a shortage of farm vets in that part of the world. The life is no easier now than it was then.\n\nThe series got together a dream cast and the male leads are fabulous and very true to the pages of the book - while the women try and make the best of their tea making, love-interest and showing-people-in roles.\n\nMany of the pets on the show were treated for free in exchange for them being used on the show. It doesn't get any more \"method\" than having your hand up the backside of a cow for real! In one episode a foreign female vet seems poised to get involved in the practise -- but she only seems to upset the happy home and soon leaves. Also to be noted is that pages of the book involved bad people and youngsters who turned to crime. Even a suicide. You won't find them here. Nevertheless some of the farmers are less than pleasant people -- with the vets prepared to take them on as clients despite their character and (in real life) propensity for not paying their bills. \n\nThe central problem with this series is that sometimes you feel you are born in the wrong age. Oh for the time when country cottages were within the budget of a working man and everyone had time to stop and chat over tea. \n\nYes, it is a bit misty eyed and cute (although not all the animals are), but there are plenty of morals and lessons-in-life too.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Clip: Do I look so smug?",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1244070681",
        "name": "All Creatures Great And Small",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmJkYWI3ZjgtODBkYy00MmFmLWE0MWYtMTgyNmJhMWMxYjY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmJkYWI3ZjgtODBkYy00MmFmLWE0MWYtMTgyNmJhMWMxYjY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-02-15T06:05:16Z",
        "url": "https://www.imdb.com/video/vi1244070681/"
    },
    "url": "/title/tt0075472/"
}