{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stephen Chow",
            "url": "/name/nm0159507/"
        },
        {
            "@type": "Person",
            "name": "Man-Tat Ng",
            "url": "/name/nm0628806/"
        },
        {
            "@type": "Person",
            "name": "Man Cheung",
            "url": "/name/nm0156522/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2591,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "All for the Winner",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0069083/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006356/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0333647/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Lau",
            "url": "/name/nm0311508/"
        }
    ],
    "datePublished": "1990-08-18",
    "description": "A man discovers that his dumb, lovable nephew can see through objects and decides to unleash him into the world of gambling.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeffrey Lau",
            "url": "/name/nm0311508/"
        },
        {
            "@type": "Person",
            "name": "Corey Yuen",
            "url": "/name/nm0477035/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2VmNjk3ZWQtMDEzOC00Yjk2LWJmMTMtZTU1ODNmNTFhOTNkXkEyXkFqcGdeQXVyOTMzMDk1NTY@._V1_.jpg",
    "keywords": "nephew",
    "name": "Do sing",
    "original_info": {
        "id": "All for the Winner_1990",
        "name": "All for the Winner",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gorthu"
        },
        "dateCreated": "2009-04-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104147/"
        },
        "name": "\"You use a hammer to castrate?\"",
        "reviewBody": "Stephen Chow stars as a young man who goes to visit his uncle (played by Ng Man Tat of course). When his uncle finds out he has a supernatural power that allows him to see through objects, he gets Chow to become a gambler. Things don't start off so great for Chow, but he finally puts his special power to use when a certain woman is around. When the King of Gamblers finds out Chow will be in the World Gambling Tournament, he has his gang take Chow out. After his lady friend is kidnapped, he may not be able to participate in the finals of the tournament.\n\nThe comedy is very funny and not many jokes fall flat. In one scene Chow makes his first entrance as the Saint of Gamblers and walks into the room in slow motion. I probably shouldn't try to describe it, but it's a must see moment and had me crying with laughter. There are plenty of other great parts like when Chow tries to do some fancy shuffling and sends all the cards flying into a guy's face. Paul Chun does a good job as the King of Gamblers and the whole cast is enjoyable. Jeffrey Lau is one of my favorite Hong Kong directors and he really makes the gambling scenes fun. You never know what kind of movie you will get from him, but they are usually good. I have seen every Stephen Chow movie except his TVB work, and this is one of my favorites. It's a brilliant showcase of his comic genius.\n\nThe fight scenes are not long, but still really good. Corey Yuen's choreography is as masterful as it gets. Chow is not one of the better action stars, but he can can get the job done. With Corey Yuen helping him out, expect the action to be top notch. There are 4 fights, and the one shootout scene is very exciting. Like most Chow movies from 1990-1996, Cheung Man plays his love interest, and thanks to Corey Yuen, she isn't just eye candy but also gets to show off her athletic skills. 'Last Hero of China', 'Fist of Fury 91' and 'Sword Stained With Royal Blood' are the only movies I have seen where she looks this good.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0104147/"
}