{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ice Cube",
            "url": "/name/nm0001084/"
        },
        {
            "@type": "Person",
            "name": "Mike Epps",
            "url": "/name/nm0258402/"
        },
        {
            "@type": "Person",
            "name": "Tommy Flanagan",
            "url": "/name/nm0281107/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15112,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044714/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0114024/"
        },
        {
            "@type": "Person",
            "name": "Ronald Lang",
            "url": "/name/nm0485898/"
        },
        {
            "@type": "Person",
            "name": "Ice Cube",
            "url": "/name/nm0001084/"
        }
    ],
    "datePublished": "2002-03-08",
    "description": "Bounty hunter Bucum chases bail-jumper Reggie, who runs right into the scene of a diamond heist and murder and gets shot at as well. Later they become partners in their pursuit of the $20M in diamonds and lottery ticket. Their wom...",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Bray",
            "url": "/name/nm0106230/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjM0MzliMDktZGFlOS00NmQ3LWJhYWItMjBhZmI2OGRlMmMwXkEyXkFqcGdeQXVyNjExODE1MDc@._V1_.jpg",
    "keywords": "bounty hunter,money,diamond,machismo,black comedy",
    "name": "All About the Benjamins",
    "original_info": {
        "id": "All About the Benjamins_2002",
        "name": "All About the Benjamins",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "StevePulaski"
        },
        "dateCreated": "2010-12-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0278295/"
        },
        "name": "It's all about the clichés, explosions, and mere originality as well",
        "reviewBody": "Though it may appear as a Friday style film, All About the Benjamins is far from the comedy franchise as possible. Instead of being a slacker, buddy comedy, it's an action cop film similar to 48 Hours or Beverly Hills Cop. It isn't necessarily bad, but it takes a path I didn't expect. How could you blame me for mistaking it was a straight forward comedy? It's in a four pack that includes all Ice Cube movies, and it stars Mike Epps as well. The same characters that portrayed Craig and Dey Dey are in a movie that is included in a Friday four pack. Can't be that far off.\n\nSadly, it takes the path and cliché of every cop movie out there. There's explosions, swearing, two friends, etc. It gets old very fast. There's not much new or fresh utilized here. If there is a low six star movie rating, this is the one. It's not a five star film, but it's not a seven or eight star film. It's kind of tilting on the edge.\n\nBucum (Cube) is a bounty hunter who's goal is to get money to open his own investigation firm. Reggie (Epps) is a con artist that somehow escaped Bucum's clutches three times. After winning big on the lottery, but losing the ticket in the back of a van with diamonds thieves, Bucum and Reggie have no choice but to work together to get the thieves and retrieve the lottery ticket so Reggie can claim his riches.\n\nIt reminds me of a film I watched not too long ago called Lottery Ticket that also stars Cube, about a young man trying to survive a weekend with a $370 million lottery ticket the whole neighborhood is aware of. The only difference is the ticket never leaves the man's possession. In this one they need to get it back.\n\nThe film has frequent chases and action moments, but I find them unappealing and just a little much. I would have liked less of the over exaggerated, played out action sequences and more of the witty dialog. Ice Cube and Mike Epps made a great duo in Next Friday and Friday After Next, and had numerous dialog scenes in the film that were utterly hilarious and clever. This film relies too much on action movie clichés, and a drawn out plot. You know they'll retrieve the ticket, and most likely fight towards the end. The suspense is none.\n\nYou may say it's my fault for comparing the film too much to Friday, but I'm not analyzing the film based on my first impression. I'm grading on behalf of the film's plot, characters action scenes, and suspense. The film had everyone of those in decent context. But so decent they were forgettable.\n\nStarring: Ice Cube, Mike Epps, Eva Mendes, Tommy Flanagan, Carmen Chaplin, Valarie Rae Miller, Roger Guenveur Smith, and Anthony Michael Hall. Directed by: Kevin Bray.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Home Entertainment",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2914320665",
        "name": "All About The Benjamins",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOThiOTQxMTUtMTc5Yi00YWI2LTg3ODQtMDk0MTUwYzQwYjdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOThiOTQxMTUtMTc5Yi00YWI2LTg3ODQtMDk0MTUwYzQwYjdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:22:59Z",
        "url": "https://www.imdb.com/video/vi2914320665/"
    },
    "url": "/title/tt0278295/"
}