{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Billy Crudup",
            "url": "/name/nm0001082/"
        },
        {
            "@type": "Person",
            "name": "Patrick Fugit",
            "url": "/name/nm0297578/"
        },
        {
            "@type": "Person",
            "name": "Kate Hudson",
            "url": "/name/nm0005028/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 281801,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0819670/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047730/"
        },
        {
            "@type": "Person",
            "name": "Cameron Crowe",
            "url": "/name/nm0001081/"
        }
    ],
    "datePublished": "2000-09-22",
    "description": "A high-school boy in the early 1970s is given the chance to write a story for Rolling Stone magazine about an up-and-coming rock band as he accompanies them on their concert tour.",
    "director": [
        {
            "@type": "Person",
            "name": "Cameron Crowe",
            "url": "/name/nm0001081/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzY1ZjMwMGEtYTY1ZS00ZDllLTk0ZmUtYzA3ZTA4NmYwNGNkXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "rock 'n' roll,1970s,rolling stone magazine,smoking marijuana,on the road",
    "name": "Almost Famous",
    "original_info": {
        "id": "Almost Famous_2000",
        "name": "Almost Famous",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2013-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0181875/"
        },
        "name": "Perhaps the Best Film of the Decade",
        "reviewBody": "Almost Famous (2000) \n\n**** (out of 4)\n\nCameron Crowe's masterpiece about high schooler William Miller (Patrick Fugit) who gets a job with Rolling Stone to do a story on an upcoming band named Stillwater. The young and naive kid gets to go out on the road with them where he quickly grows up and sees that the world isn't always perfect. ALMOST FAMOUS is one of the greatest coming of age movies ever made and it's perhaps the greatest love story to rock 'n roll ever filmed. I think a strong argument could also be made that it's the greatest film of the decade as well. There's so much love and passion during every single scene that you can't help but see and feel that this is Crowe's baby and it's easy to see why since much of this is based on his life growing up. This film contains so many terrific moments but I think what makes it so special are the various relationships that are built on the road. This includes William trying to mix it up with the band's guitar player (Billy Crudup) who refuses to give him an interview as well as the girl (Kate Hudson) that both of them love for different reasons. The overly worried mother (Frances McDormand) is perfectly written and thrown into the story for some comic relief but even the smaller characters are so well-written and detailed that by the time the movie is over it's almost like you've seen a documentary of a real band. Crowe's direction has never been better as this film has quite a bit of different emotions going for it yet he perfectly holds it together and really makes the film take off to levels one wouldn't expect. As a fan of rock and roll you have to love the behind-the-scenes look at a tour and the various problems that come from the sex and drugs. You also have to have fun and admire this young kid being able to go out on the road as this would be an ultimate dream job for many. The film mixes in some terrific music but the highlight is of course 'Tiny Dancer' from Elton John, which is without question one of the best and most magical scenes from any movie. The performances are all a major plus from the bigger acts to the smaller roles. Everyone fits their roles perfectly and help bring the story to life. ALMOST FAMOUS is a flawless picture that just keeps getting better with each new viewing. Some say the film is too soft and should have attacked the music harder or been more raw but I really disagree with these comments. The film is a love story to the music and one of the greatest out there."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Dreamworks",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2943458841",
        "name": "Almost Famous",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTRmOGU3MjktN2I2OC00OWRiLWI5ZWQtNWYzMjVlMzM5MTAyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTRmOGU3MjktN2I2OC00OWRiLWI5ZWQtNWYzMjVlMzM5MTAyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-12-01T06:05:23Z",
        "url": "https://www.imdb.com/video/vi2943458841/"
    },
    "url": "/title/tt0181875/"
}