{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mindi Miller",
            "url": "/name/nm0709938/"
        },
        {
            "@type": "Person",
            "name": "Penelope Reed-Woods",
            "url": "/name/nm0715632/"
        },
        {
            "@type": "Person",
            "name": "Joseph Whipp",
            "url": "/name/nm0924178/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1074,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042914/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061080/"
        },
        {
            "@type": "Person",
            "name": "Charles Saunders",
            "url": "/name/nm4884222/"
        }
    ],
    "datePublished": "1986-10-29",
    "description": "An evil king made a deal with the devil and received a deadly power that will defeat anyone standing in his way. It's up to a fearless warrior to find a magical sword, which's the only weapon that could stop him.",
    "director": [
        {
            "@type": "Person",
            "name": "Alejandro Sessa",
            "url": "/name/nm0785909/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Action",
        "Adventure",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGEwOWE4NWItMWExZC00NGM1LWJkN2UtMDY0ZTJhMTYyNmI3XkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_.jpg",
    "keywords": "female nudity,amazon tribe,amazon warrior,sword and sorcery,big breasts",
    "name": "Amazons",
    "original_info": {
        "id": "Amazons_1986",
        "name": "Amazons",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "skinnybert"
        },
        "dateCreated": "2019-08-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090627/"
        },
        "name": "Flawed but surprisingly sincere",
        "reviewBody": "Reading the already-written reviews here, it's hard to get a real sense of what this film is like -- is it soft-core? (answer: no). Is it good sword/sorcery? (answer: hm, not really). Is it too terrible to watch? (not exactly, but ...)\n\n\"Thelma and Louise\" it ain't, but Dyala's role is clearly a Heroic Quest through-and-through, and if being an Amazon means she has to do it in a leather bikini and an Olivia Newton-John headband, then that's what she'll have to do.\n\nFirst, the good: the main character is actually, really, in real-life, honestly trained in weapons fighting, and it shows. This is important because -- if you hadn't guessed -- a lot of this movie involves fighting.\n\nThe not-so-good: a lot of the fighting is 1960s TV-level, and a lot of the acting is worse. Some of it isn't, but enough is. This wouldn't matter so much if it wasn't a bit sluggish for the first half. Being very low-budget, it compensates for all of its faults with showing more skin than might otherwise seem necessary.\n\nNow, here's where \"Amazons\" reveals a surprising quality: it overwhelmingly meets the Bechdel-Wallace test for the portrayal of women in fiction. Almost all significant characters are women (the notable exception being the villain), and they almost never talk about men. There are indeed Amazon men, but the actresses perform all the heroic functions, and the story is entirely what dominates their conversations. So this film accomplishes the interesting feat of being an overtly exploitative film (in that almost every one of them are young, athletic females who are minimally clothed) that's also a semi-capable celebration of female self-empowerment. And they don't do it campy or cartoonish; the actresses are quite serious about their roles and relationships, and the camera/direction shoots them as heroic. Some of it may come across silly, contrived, or poorly done, but never insincere.\n\nWould I recommend this? For those wanting Conan-type sword/sorcery that doesn't take itself too seriously, this sorta works, though clearly a lesser execution. For those seeking mere exploitation, it's a bit slow, and not the constant nudity-fest some reviewers would have you believe. And those seeking feminist Xena-type empowerment will find that here, though they might have trouble seeing it sometimes (e.g., when the heroine skinny-dips in a river and then finds herself fighting off would-be rapists with her top untied).\n\nBut that's where \"Amazons\" steps up: in most movies, female body exposure + male attack = victim, but not here. The messages throughout this film clearly portray the women in charge of their lives and their bodies, regardless of very real challenges and threats. Even the one sex scene shows us the degree of complicity between The Villain and his confederate -- not just socially but personally.\n\nAs a result, there's a qualitative difference between this and the Deathstalker movies, which take themselves less seriously, and feel more cartoonish. No, \"Amazons\" is not a great movie, or even a very good one; it's more an OK movie really. But I think the women who acted in it felt it was a film they could be proud of: one that showed them capable of being decisive, strong and heroic, rather than just assisting (or often, waiting for) a man who does it for them. And if doing that half-naked means the funding comes through, so be it.\n\nRating: 5.5/10, rounded up to 6",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0090627/"
}