{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Cole",
            "url": "/name/nm0170550/"
        },
        {
            "@type": "Person",
            "name": "Lucas Black",
            "url": "/name/nm0085407/"
        },
        {
            "@type": "Person",
            "name": "Paige Turco",
            "url": "/name/nm0876958/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4650,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070627/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046592/"
        },
        {
            "@type": "Person",
            "name": "Shaun Cassidy",
            "url": "/name/nm0001027/"
        }
    ],
    "datePublished": "1995-09-22",
    "description": "A quiet, seemingly-quaint small town is ruled over by its charming yet evil sheriff who uses his demonic powers to remove anyone who dares to stand in his way. The only one he fears is a young boy he fathered through rape.",
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmExN2UzMGQtOWRiOS00YWQxLWI2NDAtNmRhYzQzZTVhM2UyXkEyXkFqcGdeQXVyMTE1MTYxMzk2._V1_.jpg",
    "keywords": "supernatural horror,town with a dark secret,doctor,south carolina,small town",
    "name": "American Gothic",
    "original_info": {
        "id": "American Gothic_1988",
        "name": "American Gothic",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ravnereiret"
        },
        "dateCreated": "2005-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111880/"
        },
        "name": "Dark, beautiful and non-typical",
        "reviewBody": "Hello, I first saw this series in my teens, when a Norwegian television channel had by some accident bought a television series worth watching. I must admit that I did not see all the episodes at that time, but I have since. As has already been stated by many reviewers before me, American Gothic is not available to the public in any legal way. Why is beyond me, so I have acquired a pirate-copy, but will of course buy it at once if it is ever released.\n\nThe series itself is (the way I see it) ultimately about Lucas Buck and the way he deals with problems and manipulates people into behaving or doing what he wants. And also, of course, the way he punishes those who dare cross him. The first few episodes are about an incident that shapes the rest of the series, and which involves elements from Buck's and other central characters' past. Some of the episodes are pretty much stand alone, but you can not fully appreciate the series without having seen at least the first couple of episodes, preferably all. I do not know if it was a popular series in the US, but if not, this may be the reason. Another thing about it is that it has an element of tragedy in it, a most admirable trait in these times of good vs evil. Some of that can of course be seen in this series as well, but it also goes much deeper, it asks of the viewer: what is right? can there be happiness without sorrow? is not the strength of Lucas beautiful? does most people perhaps need looking after by a superior, a leader? Is there comfort in his presence? is morale just a burden brought upon us by history and the fear of change and those able to take advantage of it? Important questions, brought up again and again...\n\nI am a philosopher by nature, and that may be the reason why I like American Gothic. It certainly does not contain much action, it is all about the story, the message behind the moving and talking picture, its meaning, truer and darker than in most series I have seen. If you can not keep your eyes and your thoughts focused upon something for periods of 60 minutes at a time, then forget it. It might be mildly entertaining, but in the end a waste of time, go watch one of the many trendy new series; simple, superficial and action-packed, simply intended to be a waste of time.\n\nThat is all, enjoy!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "American Gothic",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3639524633",
        "name": "American Gothic",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDhkOWYyZTgtNjI3YS00ZjgwLTllOTEtYjFlYjc4MzQ2YmNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDhkOWYyZTgtNjI3YS00ZjgwLTllOTEtYjFlYjc4MzQ2YmNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-05T01:29:06.554Z",
        "url": "https://www.imdb.com/video/vi3639524633/"
    },
    "url": "/title/tt0111880/"
}