{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Gere",
            "url": "/name/nm0000152/"
        },
        {
            "@type": "Person",
            "name": "Lauren Hutton",
            "url": "/name/nm0001381/"
        },
        {
            "@type": "Person",
            "name": "Hector Elizondo",
            "url": "/name/nm0001185/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 27474,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0174838/"
        },
        {
            "@type": "Person",
            "name": "Paul Schrader",
            "url": "/name/nm0001707/"
        }
    ],
    "datePublished": "1980-02-01",
    "description": "A Los Angeles male escort, who mostly caters to an older female clientèle, is accused of a murder which he did not commit.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Schrader",
            "url": "/name/nm0001707/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzJkZjE1ZjUtNTUyNy00ODk1LTgzYzUtY2VmZjhlODM5OWYwXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "murder,politician's wife,male prostitute,neo noir,candaulism",
    "name": "American Gigolo",
    "original_info": {
        "id": "American Gigolo_1980",
        "name": "American Gigolo",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheSteelHelmetReturns"
        },
        "dateCreated": "2010-11-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080365/"
        },
        "name": "80s suspense film about a gigolo.",
        "reviewBody": "Giorgio Moroder's signature synths followed by Deborah Harry's instantly recognisable new wave classic, Call Me, opens up American Gigolo as we see a pretty suave 80s Richard Gere in a black Cadilliac driving along the beachside. Gere has all the trappings of a wealthy 80s lifestyle so usually romanticised in a Bruckheimer production but the film establishes in its first few scenes that Gere is pretty much a buck for hire with little sway over his Aryan madam. This form of bait and switch appears throughout the movie, with Gere appearing in control and pretty cool at first and then as a total whore. The dichotomy between these two personas plays a big part of the film's plot as Julian K., Gere, becomes entangled in a murder investigation of a trick who is the wife to a wealthy S&M aficionado and learns that he should question the many friendships he's procured during his career as a loverboy. Lauren Hutton plays a random woman that Gere meets and develops into the film's love interest after one of the most minimalist sex scenes in an 80s film. The set production, music, acting and story is all very connotative of the eighties. Apartments are gray or salmon coloured with minimalist artwork and expensive vases and silver blocky stereo systems - it's clear with some scenes, including one where Gere hangs upside down to do some crunches, that the set design heavily influenced the mise-en-scene of Mary Harron's adaptation of American Psycho. Moroder's various compositions of Blondie's Call Me highlight the continuing descent of Julian k. as the chorus becomes more melancholic and ominous - it's all very suspenseful from an eighties perspective. Some may find the final scenes slightly ridiculous and most likely unrealistic, but one should remember that American Gigolo was produced by Jerry Bruckheimer and even on the tail end of New Hollywood, the film does show caution in its dark themes as not to alienate mainstream audiences. I definitely felt the material was pretty subdued for a film written and directed by Taxi Driver's Paul Schrader. However, it doesn't matter as the film is effective as a time capsule of the seedier side of the eighties.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount",
        "duration": "PT1M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1924530457",
        "name": "American Gigolo",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzVlYzhkNjEtN2U0Mi00MTdlLWEyZDItMGExZjNlOTBhYTlkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzVlYzhkNjEtN2U0Mi00MTdlLWEyZDItMGExZjNlOTBhYTlkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:34:59Z",
        "url": "https://www.imdb.com/video/vi1924530457/"
    },
    "url": "/title/tt0080365/"
}