{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dustin Hoffman",
            "url": "/name/nm0000163/"
        },
        {
            "@type": "Person",
            "name": "Dennis Franz",
            "url": "/name/nm0001240/"
        },
        {
            "@type": "Person",
            "name": "Sean Nelson",
            "url": "/name/nm0625735/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3880,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060324/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028841/"
        },
        {
            "@type": "Person",
            "name": "David Mamet",
            "url": "/name/nm0000519/"
        }
    ],
    "datePublished": "1996-09-13",
    "description": "Long-repressed feelings of bitterness and betrayal explode when three inner-city losers plot the robbery of a valuable coin in a seedy second-hand junk shop.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Corrente",
            "url": "/name/nm0180912/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2Y4MDdhNjQtYjdhYi00M2ZjLThiZWEtZTYwMDRjNzU1YjQ1XkEyXkFqcGdeQXVyNTc1NTQxODI@._V1_.jpg",
    "keywords": "all male cast,coin,loser,betrayal,robbery",
    "name": "American Buffalo",
    "original_info": {
        "id": "American Buffalo_1996",
        "name": "American Buffalo",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mattymatt4ever"
        },
        "dateCreated": "2002-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115530/"
        },
        "name": "Great, solid acting and brilliant dialogue. A supreme pleasure!",
        "reviewBody": "Watching this film on screen and on stage (I imagine) wouldn't be a hell of a lot different. It's still a 3-character film that revolves around the same setting--most of the time. But when you see great acting like this, how can you complain?? Dustin Hoffman is great at whatever he does, and he's perfectly believable as the foul-mouthed Teach. He has some of the greatest lines. My favorite is \"Guys like that, I'd like to f**k their wives.\" He is rude and obnoxious with barely a sympathetic quality, but he's the guy you love to hate. I just recently started watching \"NYPD Blue\" and just from watching a few episodes, I can say that Dennis Franz is one of the best actors I've ever seen. He deserves to be on the big screen a lot more, because he has abilities as an actor that only few TV actors also possess. He delivers every line and every emotion with such power that your eyes are wide open with amazement every minute he's on screen. Even young actor (I assume he's now in his late teens) Sean Nelson is perfectly cast, blowing me away with a performance I'm sure very few young actors can pull off just as effectively. He only has about 20 or 30 minutes of screen time, yet he's the character you most feel sorry for at times, despite the fact that he lives an unclean life, dealing with thugs and earning his money via dishonest methods. You can just sense that he didn't have any parental leadership, and he wasn't sure what path in life to take, so he took the most easy one--and also the most dangerous one. In a way, the two guys are like his surrogate parents. \n\nI've never seen the play, but when I see the name \"David Mamet\" under the writing credits, I immediately know that I'm gonna hear some priceless dialogue. I don't know how he does it, but he just has a relentlessly quick wit when it comes to creating dialogue. Like a play, this movie is composed of 80 % dialogue, but the dialogue is so great that I don't really care if there's no exciting visuals. And last but no least, I loved the opening and closing theme song. It just has that grungy quality that perfectly fits the tone of \"American Buffalo.\" If you're a fan of superb acting, this will be a real treat! A real treat! \n\nMy score: 8 (out of 10)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Long-repressed feelings of bitterness and betrayal explode when three inner-city losers plot the robbery of a valuable coin in a seedy second-hand junk shop.",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3380134681",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGI2OGRkYjUtNjM3Mi00Mjg0LThlYTEtN2NlYmFjMWI2ZjY1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGI2OGRkYjUtNjM3Mi00Mjg0LThlYTEtN2NlYmFjMWI2ZjY1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-02-17T15:23:04.033Z",
        "url": "https://www.imdb.com/video/vi3380134681/"
    },
    "url": "/title/tt0115530/"
}