{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cathe Curtis",
            "url": "/name/nm1192211/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 44,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036540/"
        }
    ],
    "datePublished": "2001-12-11",
    "description": "Welcome to New Hope Pennsylvania, where even death it would seem is not the final departure for many of the towns residents.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Child",
            "url": "/name/nm1188916/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAyMzM2OTQxMV5BMl5BanBnXkFtZTcwNDM0MDcxMQ@@._V1_.jpg",
    "name": "America's Most Haunted Town",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "insightstraight"
        },
        "dateCreated": "2008-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0321194/"
        },
        "name": "Fun ghost stories from locals, boring psychic, crappy photo \"evidence\"",
        "reviewBody": "The popularity of the \"Ghosthunters\" show has seen many more of these videos hitting the market: documentaries on supposedly-true hauntings. This particular video also serves to advertise a particular psychic, and some of the sites featured.\n\nThe interviewed locals have some fun stories to tell. But so do many locals in many other older towns across America; whether this town deserves the \"most haunted\" label is highly debatable and largely advertising spin.\n\nUnfortunately, the psychic/photographer investigative team fall far short of convincing me. And as for the photo evidence... Well, part of the reason \"professional\" (which, all too often, means publicity-seeking) ghost investigators like to use \"orb\" photos as evidence of spiritual presence is that orb photos are so very easy to get! I have a camera that gets flash orbs 20% of the time, in all sorts of settings -- I had to buy another camera so I wouldn't spend all my time Photoshopping the dust blobs out! (Ironic, isn't it -- far from faking an orb photo, I have to use a computer to remove the darn blemishes.)\n\nIn fact, the breathy psychic is so credulous about the videos that she disproves her point -- the \"spirits flying in from everywhere\" are so obviously dust particles streaming past a light that I think even true believers would find it hard to swallow.\n\nWhen the locals are telling their stories this video is as interesting as any travelogue about a small town can be. Whenever the investigators are on the screen (with \"orbs\" in photos conveniently circled in still frames), it is time to reach for the fast forward.\n\nOverall, I give this video a miss.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0321194/"
}