{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Biggs",
            "url": "/name/nm0004755/"
        },
        {
            "@type": "Person",
            "name": "Alyson Hannigan",
            "url": "/name/nm0004989/"
        },
        {
            "@type": "Person",
            "name": "Seann William Scott",
            "url": "/name/nm0005405/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 210159,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100462/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033633/"
        },
        {
            "@type": "Person",
            "name": "Adam Herz",
            "url": "/name/nm0381221/"
        }
    ],
    "datePublished": "2003-08-01",
    "description": "It's the wedding of Jim and Michelle and the gathering of their families and friends, including Jim's old friends from high school and Michelle's little sister.",
    "director": [
        {
            "@type": "Person",
            "name": "Jesse Dylan",
            "url": "/name/nm0245888/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTAwNTIzNDk1MDVeQTJeQWpwZ15BbWU3MDMwNzAwMDE@._V1_.jpg",
    "keywords": "wedding,bachelor party,sex comedy,wedding ring,resort hotel",
    "name": "American Wedding",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "christian123"
        },
        "dateCreated": "2005-07-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328828/"
        },
        "name": "The Weakest of the Series but Still Worth Watching",
        "reviewBody": "American Wedding is the weakest of the series but its still very funny and very enjoyable to watch. Jim and Michelle are getting married and Jim wants nothing wrong to happen. Stifler is going to the wedding against the wishes of Jim and Michelle. He is more interested in Cadence who is Michelle's sister and one of her bridesmaids. The wedding is close and there are a lot of things left to do. However, some of the wedding plans go wrong and it looks like this wedding is going to be a disaster, Can Jim pull it together and make it through the wedding? The plot is interesting as one of the guys get married. With this type of film though, the plot is a non issue. People who see this type of movie just want to have a good laugh and they won't be disappointed. The bets thing about this sequel is defiantly Stifler. Sean William Scott gives a really funny performance and pretty much carries this film. He goes over the top sometimes but for the most part he is pretty good. Jason Biggs gives a god performance as Jim. He is pretty much the same as the first two films so if you liked him before then you will like him again. Alyson Hannigan plays Michelle and I find her character really annoying and not funny. Eddie Kaye Thomas does an okay job as Finch, he just isn't as funny as he is in the previous films. Thomas Ian Nicholas plays Kevin and he is sort of just there. He doesn't do anything memorable his character is kind of countless at times. Eugene Levy is back as Jim's dad and he gives a funny performance. Compared to the first two though, its not as strong. January Jones plays Cadence and does a really bad job. If she wasn't pretty then she probably wouldn't be in Hollywood. Fred Willard and Deborah Rush play Michelle's parents. They both are very funny and nice additions to the cast. Missing from the film this time around are Shannon Elizabeth, Chris Klein, Tara Reid, Natasha Lyonne and Mena Suvari. They are not missed and their characters wouldn't really feel right in this film either. James B. Rogers directs and does a good job. The jokes in the film may be funny but they are not as good as the first two. Its surprising how good this film turned out to be as the second sequel is usually stale and bad. Running time is 106 minutes with the directors cut and it's the version you should see. The movie is also a bit more serious at times then the other two. This isn't a bad thing but its just a little different mood then expected. In the end, this is a very funny sequel that's worth checking out. Rating 7.2/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Universal Studios Home Entertainment",
        "duration": "PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2478178585",
        "name": "American Wedding",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWY0NjYwYzItODM4ZC00NmYxLTgwYTYtOWU0MTAyMzkyMzdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWY0NjYwYzItODM4ZC00NmYxLTgwYTYtOWU0MTAyMzkyMzdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:37:03Z",
        "url": "https://www.imdb.com/video/vi2478178585/"
    },
    "url": "/title/tt0328828/"
}