{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ving Rhames",
            "url": "/name/nm0000609/"
        },
        {
            "@type": "Person",
            "name": "Ron Silver",
            "url": "/name/nm0798779/"
        },
        {
            "@type": "Person",
            "name": "Bruno Kirby",
            "url": "/name/nm0456124/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 235,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056447/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094955/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051008/"
        },
        {
            "@type": "Person",
            "name": "Lawrence Schiller",
            "url": "/name/nm0771659/"
        },
        {
            "@type": "Person",
            "name": "James Willwerth",
            "url": "/name/nm0932775/"
        },
        {
            "@type": "Person",
            "name": "Norman Mailer",
            "url": "/name/nm0537551/"
        }
    ],
    "datePublished": "2000-11-12",
    "description": "Johnnie Cochran defends O.J. Simpson who is on trial for his wife's murder.",
    "director": [
        {
            "@type": "Person",
            "name": "Lawrence Schiller",
            "url": "/name/nm0771659/"
        }
    ],
    "duration": "PT2H50M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTE3OWE0NGItMGFiMi00ZmFiLTlkOTItYmUxM2ZkNzdjZWU4XkEyXkFqcGdeQXVyMTU2ODc4ODQ@._V1_.jpg",
    "keywords": "lawyer,trial,courtroom,race,argument",
    "name": "American Tragedy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bill (\"A Cat's Full Nine\") Drake- ¤"
        },
        "dateCreated": "2000-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250135/"
        },
        "name": "¤¤¤ Five Stars !! ¤¤¤ Plus !! ¤¤¤",
        "reviewBody": "Norman Mailer's brilliant teleplay deserves to stand alongside the finest work that he has ever done. Adapted from Lawrence (`Perfect Murder, Perfect Town') Schiller's book in collaboration with newcomer James Willwerth, it almost dispels the stigmas that the media conviction imposed on the OJ trial from the beginning.\n\nThere are some disappointments from the cast - possibly because expectations were so high based on Ving Rhames' dazzling embodiment of Don King, and the backgrounds of some other stellar personages present here.\n\nMost deficient is Bruno Kirby as Barry Scheck; wrong for the part physically and inflectionally.\n\nBut Ron Silver is as on target as Robert Shapiro as he was as Dershowitz in `Reversal of Fortune.' You can't say more than that, can you? Mailer explores at great length the facets of Shapiro's courage and genius contributing to the defense, and only fleetingly touches upon the jerk he became later on. Christopher Plummer does not look like F. Lee Bailey, and the characterization never attains the stature of its depictee. Bailey was and is one of the towering figures of the 20th century, the Disraeli and Dreyfuss and Clarence Darrow of modern times.\n\nThe two female leads are magnificent. The gifted and beautiful Sandra Prosper is Shawn Chapman, a fledgling figure inside the team - a dips**t girl spouting caucasiphobic cliches who grows into an insightful woman adept at absorbing and reflecting and expanding upon the greatness that surrounds her. And Diana LaMar is 100% at recreating the imperious and acerbic Marcia Clark.\n\nRhames' delivery of Cochran's soaring summation equals the oration of Chaplin at the end of `Great Dictator.'\n\nThe verdict of `Not Guilty!' - an anthem that rings out across the world declaring to the power-driven starched and cleanshaven deranged sadists who believe that people should be herded into groups and burned: `Rightly or wrongly, you will not always have your way!'"
    },
    "url": "/title/tt0250135/"
}