{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Scott Plank",
            "url": "/name/nm0686568/"
        },
        {
            "@type": "Person",
            "name": "Melora Walters",
            "url": "/name/nm0001828/"
        },
        {
            "@type": "Person",
            "name": "John Savage",
            "url": "/name/nm0001698/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 699,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004023/"
        },
        {
            "@type": "Person",
            "name": "Michael Covert",
            "url": "/name/nm1027203/"
        }
    ],
    "datePublished": "1996-09-13",
    "description": "The film is three stories about one story, featuring an exciting and quirky cast of characters living on the edge.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Covert",
            "url": "/name/nm1027203/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmQ0MGVlZTctYjNjYi00MGU5LThkNTctOWRmOGY3MTVhOThmL2ltYWdlXkEyXkFqcGdeQXVyNTE4MzAyNDk@._V1_.jpg",
    "keywords": "morose,seductive behavior,cool,man tied up,man's shirt accidentally rides up",
    "name": "American Strays",
    "original_info": {
        "id": "American Strays_1996",
        "name": "American Strays",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "film-critic"
        },
        "dateCreated": "2004-09-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115531/"
        },
        "name": "Nothing to see here folks...",
        "reviewBody": "Using elements from several other more popular films, American Strays brings together six different stories with the meeting room being a cafe in the desert. In one story we have Luke Perry as a man who cannot cope with his life and hires an 'Exterminator' to help him end his existence. The second story is about two hit men who are driving through the desert. One is cut up really bad and is wearing band-aids, the other is an overweight gentlemen with stomach problems. They really don't have much plot other than they provide the ending with some more bodies. The third story is about two people who are driving through the desert. They have a moment in their car where you question their friendship. Nothing becomes of this moment, and eventually they make it to the cafe. The fourth story is about a vacuum salesman. For more than half the film, we follow the path of Dwayne, a salesman who is willing to try any pitch to try to get his vacuum sold. Interestingly played by John Savage, this is the best story of the film. He travels from door to door in the desert demonstrating to potential buyers the effectiveness of his vacuum at a 'killer' price. The fifth story is about two lovers on the run from the law. Constantly in some sort of sexual embrace, these two have just robbed something, and are driving around and having sex whenever they want. The sixth and final story has to do with just a random family. Eric Roberts plays a man who is lost in the desert with his family in a minivan. All of these stories interweave together when they should all be going in separate directions. \n\nWhat happened in 1996? This film made no sense at all. I felt like I began the film in the middle of the actual movie. There is no discussion at all, there is not even a hint, as to how all these characters happened to be in the same desert. All this film is meant to show is violence can happen to anybody. \n\nWhile other are happy with comedic lines, I actually needed some pre-story to bring this film together. Literally, we jump right into the middle of the robber's story. We have no clue how he got the cash, or how long him and his lady friend have been together. We have no history of Roberts family. No clue what happened to him prior to entering the desert, or where they are headed to. All that we know is that they are as lost as I was in this film. What was the point of the train that Luke Perry kept seeing? Was it to symbolize that his life was about ready to arrive? How did the hit men get the cop in the back of their car, and why were they still carrying it? Who were the gangsta's and what was their part in this film? \n\nQUESTIONS, QUESTIONS, QUESTIONS......I NEED ANSWERS ANSWERS ANSWERS!!!\n\nThere were some decent ideas in this film, but without building a story it is hard to develop these ideas. My feeling is that perhaps the director made this film, and found that he only had the budget to release the second half. If that was the case, here is my advise to the director...scrap the project...there is no reason to beat a dead horse. A self-conscious, contrived gallery of oddball characters are simply derived from parts of David Lynch, and the Coen brothers, with some sub-Tarantinoesque dialogue thrown in. \n\nUnless you, as a viewer, enjoy picking out odd character actors, then I suggest slowly backing away from this film because 'there is nothing to see here folks.'\n\nGrade: * out of *****"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Ardustry Home Entertainment",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2662727961",
        "name": "American Strays",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGQxMzZmOWQtOTEzMS00MjA3LWJmMjctZjBiZmIxOTQwMGRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGQxMzZmOWQtOTEzMS00MjA3LWJmMjctZjBiZmIxOTQwMGRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:36:50Z",
        "url": "https://www.imdb.com/video/vi2662727961/"
    },
    "url": "/title/tt0115531/"
}