{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Adrianne Curry",
            "url": "/name/nm1428355/"
        },
        {
            "@type": "Person",
            "name": "Yoanna House",
            "url": "/name/nm1518565/"
        },
        {
            "@type": "Person",
            "name": "Tyra Banks",
            "url": "/name/nm0004723/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18187,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0112253/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0194254/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0139886/"
        },
        {
            "@type": "Person",
            "name": "Ken Mok",
            "url": "/name/nm0596298/"
        },
        {
            "@type": "Person",
            "name": "Tyra Banks",
            "url": "/name/nm0004723/"
        },
        {
            "@type": "Person",
            "name": "Kenya Barris",
            "url": "/name/nm1244069/"
        }
    ],
    "datePublished": "2003-05-20",
    "description": "A cyclical competition in which women from all over the U.S. compete for the honor of being America's next \"it girl\" in the modeling world.",
    "genre": [
        "Game-Show",
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjlmZjBkMzUtOGFmYy00Nzk0LTg0ZWUtNThiMGQzODAxOGUyXkEyXkFqcGdeQXVyMTkzODUwNzk@._V1_.jpg",
    "keywords": "african american woman,supermodel,competition reality tv,beauty game show,female model",
    "name": "America's Next Top Model",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2006-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0363307/"
        },
        "name": "The indefinable nature of the \"talent\" means that the show mostly trades on bitchy tension  watchable rubbish but nothing more than that",
        "reviewBody": "Under the tutelage of supermodel and chat show host Tyra Banks, a group of young hopefuls are pulled together to try and make it through a series of weeks to be offered a shot at their own modelling contract. Each week one girl will leave based on the opinion of the panel of judges and the results of their most recent modelling assignment. Of course there is also the ongoing risk of some bitchy infighting but really we're all here to try and learn how the fashion industry works.\n\nYou may have detected a hint of sarcasm in my last sentence and you would be correct in that observation because personally I find the professional fashion industry to be a vacuous waste of space whose only purpose to me seems to be to provide laughs at the clichés they embrace. And so it is with this show because really I don't know anyone who watches it in order to see the girls embrace their natural talent for modelling, no, we're pretty much all here to see and partake in just one series long bitching session. As a formula the series doesn't do much to discourage this view because it doesn't have a lot going on other than this. The modelling shoots are fairly boring affairs on their own terms and it is hard to care about a \"look\" that nobody can really define.\n\nOf course this is part of the problem. Because so much of it is \"indefinable\" it pretty much makes whatever the judges say right or wrong, depending on how much you buy into them as experts. So they say things like \"they hate that look\" or they \"love that look\" but really it is hard to see what they are seeing and none of them bother to really explain their reasons. Of course this plays into their hands because generally the judges are fairly worthless fashion divas who are there to stir things up a bit and don't have much of value to say. The girls themselves are fairly interesting but not in a good way  they are mainly basket cases swarming to an industry that eats up young girls and spits them out. Some of them are nice and don't last long, others are bitchy and last longer  presumably because the judges know that they need the ratings more than they need to actually produce a top model. They are mostly all good looking in various different ways but there are few I would want to spend much in the way of time with.\n\nOverall then this is a fairly pointless and vacuous show but then I suppose that is the point. With a \"talent\" that is so less tangible than singing or dancing, the comments of the judges and the individual performances of the contestants become less important than the bitchy histrionics between the contestants and with the tutors & judges. On this level it is amusing and distracting but never \"good\" television although it is worth a look if you are looking to veg in front of reality television and have no demands for anything that could be considered \"good\" on a tradition scale."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "America's Next Top Model",
        "duration": "PT17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4018453785",
        "name": "America's Next Top Model",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGI0ZDRhMDktMDcxYS00MmFiLTk5ZWEtYmUxYzZiNjEyNjAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGI0ZDRhMDktMDcxYS00MmFiLTk5ZWEtYmUxYzZiNjEyNjAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-18T02:37:06.094Z",
        "url": "https://www.imdb.com/video/vi4018453785/"
    },
    "url": "/title/tt0363307/"
}