{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robin Thomas",
            "url": "/name/nm0859450/"
        },
        {
            "@type": "Person",
            "name": "Starr Andreeff",
            "url": "/name/nm0028299/"
        },
        {
            "@type": "Person",
            "name": "Allen Cutler",
            "url": "/name/nm0193896/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2685,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "alternateName": "Amityville Dollhouse",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048922/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066053/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037026/"
        },
        {
            "@type": "Person",
            "name": "Joshua Michael Stern",
            "url": "/name/nm0827750/"
        }
    ],
    "datePublished": "1997-02-18",
    "description": "A children's doll house, which is a miniature of the infamous haunted Long Island house, is given to a young girl where the demonic evil soon comes out to cause more terror.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve White",
            "url": "/name/nm0925474/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzEzYjUzNGItOGU3Zi00ZDQ1LWI2NTktNzRmMzAxN2NhODBjXkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_.jpg",
    "keywords": "psychotronic film,evil doll,female nudity,killer doll,new home",
    "name": "Amityville: Dollhouse",
    "original_info": {
        "id": "Amityville Dollhouse_1997",
        "name": "Amityville Dollhouse",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "drownsoda90"
        },
        "dateCreated": "2004-12-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115535/"
        },
        "name": "Not That Bad, But Nothing Special.",
        "reviewBody": "\"Amityville Dollhouse\" is your average low budget B-horror movie, but it isn't too bad in my opinion. It follows a suburban family who moves into a new house the father built, so it seems that there's no way the house could be haunted. But the Amityville evil finds it's way in there, after they discover a dollhouse replicating the Amityville house. They decide to give the dollhouse to their youngest daughter for her birthday, and that's where it all begins. The dollhouse begins to exert an evil force upon the family. \n\nI tend to have a soft spot for low budget, cheesy type horror films of this type. Even though they may not be top notch quality, I find most of them entertaining, and they still manage to be alright in my book. Most of the cast here are unknowns, I only recognized one actress: Lisa Robin Kelly, who plays Eric's sister, Laurie Forman, on That '70s Show (my favorite television show by the way). The whole dollhouse idea is kind of dumb, I don't know what a dollhouse really has to do with \"Amityville\", but in the context of the movie it seems to work. There aren't really any scary moments, and when it tries to be scary, it comes off more as campy, but I don't really take this film so seriously.\n\nGranted it is a campy, low-budget horror flick, but \"Amityville Dollhouse\" still finds a way to entertain you, despite the cheap effects and minimal scares that it provides. Some may think I'm crazy, but I was entertained by this flick. It's nothing special and I wouldn't go too far out of your way to see it, but it's an okay corny horror movie. Like I said, nothing special, but not too bad. 5/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0115535/"
}