{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kerry Fox",
            "url": "/name/nm0289098/"
        },
        {
            "@type": "Person",
            "name": "Alexia Keogh",
            "url": "/name/nm0449038/"
        },
        {
            "@type": "Person",
            "name": "Karen Fergusson",
            "url": "/name/nm0272649/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8208,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0133569/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065796/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049815/"
        },
        {
            "@type": "Person",
            "name": "Janet Frame",
            "url": "/name/nm0289737/"
        },
        {
            "@type": "Person",
            "name": "Laura Jones",
            "url": "/name/nm0428630/"
        }
    ],
    "datePublished": "1990-09-20",
    "description": "Janet Frame was a brilliant child who, as a teen, was misdiagnosed with schizophrenia. Explore Janet's discovery of the world and her life in Europe as her books are published to acclaim.",
    "director": [
        {
            "@type": "Person",
            "name": "Jane Campion",
            "url": "/name/nm0001005/"
        }
    ],
    "duration": "PT2H38M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGViMGM0ZGItMWRkOC00NjA5LWE0MDgtNWJjZTJjMjk5ZmM1XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "new zealand,writer,based on autobiography,based on novel,f rated",
    "name": "An Angel at My Table",
    "original_info": {
        "id": "An Angel at My Table_1990",
        "name": "An Angel at My Table",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zclark8"
        },
        "dateCreated": "2002-08-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099040/"
        },
        "name": "Easily one of my favorite films of the 90's.",
        "reviewBody": "An Angel at My Table tells the story of famed New Zealand author Janet Frame. We are drawn into the quiet world of the shy, red-haired girl who struggles with her life, but succeeds through her exceptional talent of writing. Since her autobiography was written in three separate volumes, we are treated to a film in three separate parts, beginning with her journey through childhood. The film does an excellent job at portraying the character of Frame, and her nervous attitude when brought into social situations. Every ounce of shyness is felt off-screen, which is a kudos to the direction of Campion, that plays an important part in making sure that this woman is brought to life, as realistic, and as close to the truth as possible.\n\nGrowing up in poverty, with two hard-working parents, and 4 siblings, life must've been hard. But when you're thrust into such a difficult situation, it somehow seems normal and it doesn't bother that it's a much harder life than other people currently living are. But Janet lived through her childhood, finding that she would love to spend her life as a poet, or just writing. A depression hit her hard during her teenage years when an unexpected tragedy occurred, and she had chosen to write, instead of being with that person beforehand. Not knowing she was a depressed young person, Frame was sent to a mental hospital, and forced to undergo several shock treatments, under the incorrect diagnosis of schizophrenia. However, Frame persevered through it, using writing as a way of expressing her own thoughts. While still in the mental hospital, she was able to publish a book. The years inside the hospital are the most unpleasant of film, and Campion perfectly captures the deranged conditions that Janet experienced. The most remarkable part about the direction is how it doesn't go over the top to deliver a nauseating film in those scenes. Rather, she plays to the quiet personality of Frame. The film is kept with the same pace, and focused in a way that never wants to show itself off, but keeps the main character always in the center, without losing that focus.\n\nThe blown-up biopic `Malcolm X' was released around a year later, and while I admire that film, it was also very hyped-up before it's release. I found a strange drawing power in the fact that Jane Campion's film wasn't about spectacle, but about someone's life that is done more sincerely, and realistically, paying close attention to details, both period and human. Something you wouldn't find in a Hollywood biopic, such as Milos Foreman's `Man on the Moon,' which I openly despise.\n\nThe writer and director surprised me a bit concerning a small detail in the film. In films concerning `writing', and an exceptional author (Wonder Boys, Finding Forrester), there is never any real proof of how good the writer supposedly is. We are never allowed to read the great book they wrote, nor are there much of any excerpts written to prove to us that the writer is indeed as great as it is suggested. In films, I realize that it really isn't possible to show such a thing, since film is a visual medium instead of a literary one. Campion and the screenwriter know this, and without subjecting us to Frame's writing, she adds in some narration, using actress Kerry Fox's voice. The narration is spread out in small bits throughout the film, never taking control of telling the story. Instead, it conveys the thoughts going on in Frame's mind, which are all little excerpts from the writing contained in her autobiographies. It begins with narration and ends with it. A surprising detail that is small, but adds much to the overall film, and gives the ending a sweet, and optimistic touch to an amazing film.\n\n Frame was (is) talented at what she did most of the time, without knowing the talent was there. She only knew that she loved to do it, and wanted to continue doing it for the rest of her life. That is true talent. She had it, even at times when she thought there wasn't any hope; she had the ability to write. And because of that ability, that talent, she was able to gradually come to terms, and live comfortably with her life. ****1/2 of five or (9/10)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Janet Frame was a brilliant child who, as a teen, was misdiagnosed with schizophrenia. Explore Janet's discovery of the world and her life in Europe as her books are published to acclaim.",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi204849433",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTQ3ZjA2YzQtNDJmYi00OTQ1LTgwNGYtNzgxMmE0ODdmYmY1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTQ3ZjA2YzQtNDJmYi00OTQ1LTgwNGYtNzgxMmE0ODdmYmY1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-27T10:16:25.688Z",
        "url": "https://www.imdb.com/video/vi204849433/"
    },
    "url": "/title/tt0099040/"
}