{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shammi Kapoor",
            "url": "/name/nm0004433/"
        },
        {
            "@type": "Person",
            "name": "Sharmila Tagore",
            "url": "/name/nm0846616/"
        },
        {
            "@type": "Person",
            "name": "Sarita",
            "url": "/name/nm1057180/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 381,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064267/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0148522/"
        },
        {
            "@type": "Person",
            "name": "Sachin Bhowmick",
            "url": "/name/nm0080432/"
        },
        {
            "@type": "Person",
            "name": "Ramesh Pant",
            "url": "/name/nm0659760/"
        }
    ],
    "description": "After being left brokenhearted several times, wealthy, beautiful Deepa travels to City of Love Paris to live in her palatial house and meets Shyam (Sam), an Indian who is fascinated by her beauty. She tries to ignore him and final...",
    "director": [
        {
            "@type": "Person",
            "name": "Shakti Samanta",
            "url": "/name/nm0759662/"
        }
    ],
    "duration": "PT2H48M",
    "genre": [
        "Musical",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGYzODFhZTQtMWE0My00NTA3LWFlYzEtYmYyYjNlNjU1MTJiXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "love,swimsuit,child kidnapping,water skiing,motorboat",
    "name": "An Evening in Paris",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nadkarnisumeet"
        },
        "dateCreated": "2021-03-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074503/"
        },
        "name": "Ticket to Europe",
        "reviewBody": "An Evening In Paris review :\n\nWant an extensive Europe trip with a complimentary Niagara falls view for price of just one cinema ticket??!! Well, An Evening in Paris is just what you need to see. \"Aisa Mauka phir kahan milegaa\" as its title song goes. Starring rockstar Shammi Kapoor and the gorgeous Sharmila Tagore, the film explores exotic locales of Paris, Swiss, Beirut and ends at the Niagara Falls. The Switzerland locales are truly awesome and mind you, this was a decade before Yash Chopra started filming his chiffon saree songs there..\n\nSharmila Tagore played a Richie rich heiress who comes to Paris to find true love and has Shammi pursuing her through its galli kucha. \"Akele Akele, Kahan jaa rahe ho!!\" goes the melodious sung by Mohammed Rafi and composed by Shankar Jaikishan.\n\nAn Evening in Paris goes down in history of Bollywood for being the first one to feature a mainstream heroine in a negative role - she plays a doppelganger in a plot partially inspired from Producer - Director Shakti Samanta's own China Town (1962) with gender reversal. Sharmila Tagore also sizzled in a light blue bikini paving the way for future sex symbols like Zeenat Aman and Parveen Babi in the '70s. Sharmila's uninhabited exposure in this film was talk of the town then and she even appeared in an itsy bitsy bikini on cover of Filmfare magazine around the same time.\n\nAs for the performances, Shammi was earnest as the lover boy and so was Pran with fake blonde hair playing the mandatory villain. But then An Evening in Paris was all about Sharmila and her bold attitude. I can't imagine any other top heroine of that time pulling off this audacious role. Kudos!!\n\nOverall, the film was a complete entertainer but unfortunately, turned out to be an average grosser only due to its high budget. Shooting in foreign locales in those days was a costly affair and only the legendary Raj Kapoor Saahab had taken his Radha to Europe for his Sangam (1964). Bro Shammi Kapoor was never too far behind either!!\n\nRegards, Sumeet Nadkarni.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0074503/"
}