{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Gere",
            "url": "/name/nm0000152/"
        },
        {
            "@type": "Person",
            "name": "Debra Winger",
            "url": "/name/nm0000700/"
        },
        {
            "@type": "Person",
            "name": "David Keith",
            "url": "/name/nm0001418/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 58771,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037360/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Douglas Day Stewart",
            "url": "/name/nm0829343/"
        }
    ],
    "datePublished": "1982-08-13",
    "description": "A young man must complete his work at a Navy Officer Candidate School to become an aviator, with the help of a tough Gunnery Sergeant and his new girlfriend.",
    "director": [
        {
            "@type": "Person",
            "name": "Taylor Hackford",
            "url": "/name/nm0000431/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTM5NmY2MTktODRiMS00NTQwLTk2ODEtZTFhYjAyMTZmMTc5XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "u.s. navy,naval aviation,officer training school,flight instructor,military officer",
    "name": "An Officer and a Gentleman",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Wuchakk"
        },
        "dateCreated": "2014-01-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0084434/"
        },
        "name": "The best of its kind",
        "reviewBody": "Released in 1982, \"An Officer and a Gentleman\" was the obvious inspiration of films like Tom Cruise's \"Top Gun\" and \"Days of Thunder.\" \"An Officer and a Gentleman\" was the first and best, by far.\n\nThe plot similarities are obvious: They all include the angry young man who needs to prove his gifting, the uncompromising mentor, the encouraging babe, the craft, the arena and the doomed buddy. In \"An Officer\" the angry young man is Richard Gere as Mayo, the mentor is Louis Gossett Jr. as Drill Instructor Folely, the babe is Paula (Debra Winger), the craft is aviation basic training, the arena is a Naval academy and the Puget Sound area of Washington (shot on location) and the buddy is Sid Worley (David Keith).\n\nThankfully, the film doesn't get bogged down telling the back-story of Mayo. Instead, it ingeniously shares his past in a matter of minutes at the very beginning. It's all we need to know to understand why Mayo is the way he is. And then we're off to basic training where he's tested. Does he have what it takes? Can someone as lowborn, aloof and un-trusting as Mayo make it as an officer?\n\nDebra Winger and Lisa Blount shine here as Mayo and Worley's babes. Winger is alluring in a humble \"girl next door\" type of way (she out-shined Lynda Carter as Wonder Girl on \"Wonder Woman,\" which is hard to believe), but Blount is even more alluring -- yes, despite the negative aspects of her character. I'll just put it this way, she really fills out a pair of jeans, lol. \n\nBoth couples get intimate way too quickly, but maybe this is one of the flaws of the \"Puget Debs\" and explains why they have a problems getting marriage material, if you know what I mean. Besides this, time has to be condensed in a two-hour film.\n\nBOTTOM LINE: If you're in the mood for a film of this ilk \"An Officer and a Gentleman\" is the best of the lot.\n\nGRADE: A\n\nINSIGHTS ABOUT THE ENDING (***SPOILER ALERT*** Don't read further unless you've seen the film):\n\nAn officer is a military leader. Drill Instructor Foley's job is to weed out those who can't hack it as an officer. It's an important job because people's lives in combat are dependent on the quality of the leaders and Foley takes his job seriously.\n\nFoley rightly pegs Mayo as a lowlife loner from the outset -- a wannabe officer -- and therefore puts on the pressure. This is especially so on the one weekend where he has Mayo to himself. Foley does everything he can to make Mayo break AND quit, but Mayo doesn't. He breaks, indeed, but he refuses to quit on the grounds that he has no where to go. At the end of this scene you can see that Foley develops respect for Mayo (which you get a glimpse of earlier when Mayo does extremely well on the obstacle course).\n\nLater, Mayo disregards breaking the record on the obstacle course (which he was definitely able to do) in order to encourage Seegar (the female recruit) to finally make it over the wall. Foley sees that Mayo's no longer the aloof and selfish loner he was when he rode in on his motorcycle. He's matured; he's developed character. It was already there, of course, but the boot camp training has brought it to the fore, and Foley sees it.\n\nAfter Worley's tragic death, Mayo confronts Foley while he's drilling the platoon. Foley informs Mayo that they all know what happened and even tells him they're sorry about Worley. He didn't have to do this and it shows that Foley isn't just an honorable man, but also that he cared about Worley. After all, Worley was only one week away from graduating! In a sense, he was one of Foley's kids. In other words, Foley and the platoon were grieving too. But Mayo was closest to Worley and he's crazy with shock & grief at this point. He insists that he's going to quit, to which Foley tells him to meet him for a fight. Sure, there's some testosterone in his words, but he actually does this out of respect for Mayo as a last ditch effort to keep him from dropping out.\n\nAnd Foley doesn't \"kick his axx\", as some claim. It was essentially an even match and Foley barely walks off the mat, which is the only reason he technically wins. But that's inconsequential. The purpose of the fight was to run Mayo's steam out so he didn't make a rash decision in an obvious moment of grief & anger. Foley accomplished his purpose. Once Mayo was no longer blinded by rage he makes the right choice and graduates.\n\nThis is why he thanks Foley at the end.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3847618585",
        "name": "An Officer And A Gentleman",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDQ2YjgyZGQtMjhmOS00MDFlLWFjMDQtMGYwYjJkOTNhNWY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDQ2YjgyZGQtMjhmOS00MDFlLWFjMDQtMGYwYjJkOTNhNWY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-11-05T06:05:02Z",
        "url": "https://www.imdb.com/video/vi3847618585/"
    },
    "url": "/title/tt0084434/"
}