{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Morris Chestnut",
            "url": "/name/nm0004820/"
        },
        {
            "@type": "Person",
            "name": "KaDee Strickland",
            "url": "/name/nm0834380/"
        },
        {
            "@type": "Person",
            "name": "Eugene Byrd",
            "url": "/name/nm0126021/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32464,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010568/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059925/"
        },
        {
            "@type": "Person",
            "name": "Hans Bauer",
            "url": "/name/nm0061829/"
        },
        {
            "@type": "Person",
            "name": "Jim Cash",
            "url": "/name/nm0143596/"
        },
        {
            "@type": "Person",
            "name": "Jack Epps Jr.",
            "url": "/name/nm0258390/"
        }
    ],
    "datePublished": "2004-08-27",
    "description": "A scientific expedition sets out for Borneo to seek a flower called the Blood Orchid, which could grant longer life. Meanwhile, they run afoul of snakes and each other.",
    "director": [
        {
            "@type": "Person",
            "name": "Dwight H. Little",
            "url": "/name/nm0514546/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzc5MDg1NTkxNl5BMl5BanBnXkFtZTYwNTcyNjA3._V1_.jpg",
    "keywords": "orchid,flower,borneo,anaconda,expedition",
    "name": "Anacondas: The Hunt for the Blood Orchid",
    "original_info": {
        "id": "Anacondas: The Hunt for the Blood Orchid_2004",
        "name": "Anacondas: The Hunt for the Blood Orchid",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheMovieMark"
        },
        "dateCreated": "2004-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0366174/"
        },
        "name": "A movie that exists for no other reason than to be the butt of our mockery.",
        "reviewBody": "Bring the crackers because mama, this movie is bringin' the cheese! If there has ever been a more culturally diverse group of no-name actors to brave the jungles of Borneo then I'll end my movie reviewing career right now (future users of the Alan Smithee pseudonym applaud). All right, I've kept this secret, but I actually sat in on a production meeting for Anacondas and here's how it went down:\n\n\"Annoying black dude who just screams the whole time?\"\n\n\"Check. But let's put a tough black dude in there as well. Don't wanna be accused of stereotyping.\"\n\n\"Good idea. Who is Morris Chestnut?\"\n\n\"Well, we thought it was a brand of chewing tobacco, but he's actually who we're gonna use as our tough black guy.\"\n\n\"Oh, OK. How about a Latino woman with an unnecessarily bad attitude?\"\n\n\"You mean the J-Lo wannabe? Check.\"\n\n\"Good. Did y'all find that tough-looking Asian guy?\"\n\n\"Check. It wasn't easy, but we found one with a mullet.\"\n\n\"Perfect. That'll alert everybody that he's not one of those brainy Asians. How about a blonde babe with a thick, fake Southern accent?\"\n\n\"Check. She's from Georgia, but her accent sounded too realistic. We told her to fake it up.\"\n\n\"Good job. And I saw that you found a white European male, but how about the protagonist?\"\n\n\"Oh, you mean the muscular white guy with a 2-day beard growth and husky voice? Check. He's in wardrobe right now having the sleeves on his tight shirt rolled up.\"\n\n\"Perfect. Just don't forget the tattoos. Now how about somebody who's actually famous?\"\n\n\"Um, well, we don't exactly have that. But hey, we've got everything else!\" And that, my friends, is your cast. Some other guy of some sort of foreign descent was thrown in there as well. He looked like Gregg Rainwater from The Young Riders. He died soon enough, so it doesn't really matter.\n\nMy money says you really won't care about anybody involved in this production. Well, I did like the southern girl. She was pretty hot. But why do producers insist on accents being so fake? Her accent dwindled as the movie went along. She eventually was only accenting about one word per sentence, but by the climax she started fakin' it up with reckless abandon!\n\nAnd I'm sure plenty of girls will think Johnny \"Five O'Clock Shadow\" Messner is pretty hot, but for the most part you'll spend the first 10 minutes of the movie picking which characters you want to see swallowed whole by a giant anaconda. My first choice was the Jennifer Lopez wannabe. When B-movie characters like her prance around with a huge chip on their shoulder, I usually pray for some sort of creature to sneak up and bite that chip right off. Along with the entire shoulder.\n\nThis is one of those movies that relies on every cliché in the B-movie book. In other words, you can expect a whole lot of stuff like a door opening slowly and then something jumping out while a loud noise is made. And since this is a \"creature feature,\" by definition a lot of the action takes place at night, in dark caves and in water, with only flashlights to light the way.\n\nDialogue is expectedly bad. We're treated to such intellectually-challenged exchanges as: \"What's wrong with this picture?\" \"You're in it.\" And it's mostly dominated by Messner's Michael Paré-esque line delivery and Eugene Byrd's banshee-like screeching. It's funny up to a point, but eventually you start looking at your watch and thinking, \"OK snake, it's time to eat this kid.\"\n\nThe CGI looks a little goofy at times, but most of it is well done thanks to the wise decision to hide the flaws with darkness and water. If you're wondering how this compares to the original Anaconda, well, the two really have nothing to do with each other except for presence of an anaconda. The first movie had famous people in it, this one doesn't. However, this one does have more anacondas! It's been 7 years since I saw the original, but I'm pretty sure it's the better of the two.\n\nMy biggest complaint is that Anacondas wasn't cheesy ENOUGH! If you're gonna be bad, then go as far out on the cheesy limb as you can go! Instead of a blood orchid, their research should've discovered a rare, Indonesian banana that held the secret to long life. Then once it was discovered the anacondas were eating these things and living forever, one of the bad actors could've deadpanned, \"What are these things? Bananacondas?\" BWAHAHAHAHA! Man, I really need to start writing screenplays for intentionally bad movies.\n\nAnd I've said this before, but I'll say it again. Since \"versus\" movies are the current sequel trend, they should've dug up Harrison Ford (it's been four years since the guy had a hit), given him the Jack Ryan moniker again, and given *us* Jack Ryan Vs. Anaconda: The Hunt for the Blood Red Orchid in October. He could've been the guide for the scientists, and when one of them started whining he could've cracked, \"Traveling through Borneo ain't like dusting crops, boy.\" Then he would've looked into the camera and winked. It'd have been awesome and you know it.\n\nOh, and let me leave with a word of advice. If a bad guy is standing near the edge of an anaconda pit, and he's holding a gun on one of your colleagues, but his back is to you, then please, for the love of all that is holy, instead of whimpering like someone forced to sit through a post-1987 Corey Feldman movie, stand up and kick the guy in the pit."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2746614041",
        "name": "Anacondas: The Hunt for the Blood Orchid",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjcwMTI2ZTgtZTU0Zi00YWY5LTk0MDgtODYyZWM5ZjI4NGRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjcwMTI2ZTgtZTU0Zi00YWY5LTk0MDgtODYyZWM5ZjI4NGRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:39:08Z",
        "url": "https://www.imdb.com/video/vi2746614041/"
    },
    "url": "/title/tt0366174/"
}