{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Andre Gibbons",
            "url": "/name/nm10415318/"
        },
        {
            "@type": "Person",
            "name": "Jarrod Emick",
            "url": "/name/nm0256372/"
        },
        {
            "@type": "Person",
            "name": "Frederic Forrest",
            "url": "/name/nm0002078/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2020,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053080/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045447/"
        }
    ],
    "datePublished": "1996-03-03",
    "description": "The story of the most notorious Confederate prisoner of war camp in the American Civil War.",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIyNTE2NDgzOF5BMl5BanBnXkFtZTcwNzM0NDUxMQ@@._V1_.jpg",
    "keywords": "andersonville prison,andersonville,confederate states of america,tv mini series,prisoner",
    "name": "Andersonville",
    "original_info": {
        "id": "Andersonville_1996",
        "name": "Andersonville",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "PMFan"
        },
        "dateCreated": "1999-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115097/"
        },
        "name": "Finally, the Civil War, down and dirty",
        "reviewBody": "The movie Andersonville was one of intense drama. The historical subject matter made the film all the more pertinent to society today. Man against Man, Brother against Brother. That is what the Civil War was, and Andersonville was its worst. Men treating other men like animals and game for sport. The utter despair. The terrible suffering.\n\nAndersonville is set during the Civil War, in the south, in a Prisoner Of War camp run by the Confederate Army. The story depicts the conditions of suffering that the Union soldiers endured while held captive. The best and the worst of humanity is shown in this film as the viewer is shown all ends of the spectrum of pain and suffering.\n\nPeter Murnik's character, Limber Jim, was the voice of conscience in this film. Jim was the one who finally stood up to the injustice that other Union soldiers were enacting against their fellows. It was Jim who rallied the troops to a riot to stop the \"Raiders\" from continuing their carnage. Not a single 'Peter' scene went by without the viewer sensing the intensity. He portrayed it in his face, in his demeanor and most of all, in his eyes. In this film, Peter said so much without uttering a word. The look he gave in his eyes told the viewer the intensity of his feelings. His determination. His desire to see the wrongs righted. In a sense, Limber Jim was one of the saviours of this film. His standing up to the injustice he witnessed and lived through, enabled his fellow prisoners to also rise up and change the world around them, as small as it was.\n\nIn spite of the fact that this was a film and an artistic production, the real Andersonville shone through. The viewer came away knowing the despair that the Union soldiers felt and lived. There was no question that humanity, as a whole, had been wronged by the cruelty that took place at Andersonville. The human race came away from Andersonville worse off for having realized that we could fall so far from the very civilization we pride ourselves on creating to treat other fellow human beings the way the Union soldiers were treated.\n\nAndersonville actually existed, and does so today as a Federal Park and tourist attraction. This movie is a very good link in telling the tale that so many never got to tell. The actors, staff and crew of Andersonville did such a magnificent job that anyone seeing this movie will know what it was like to have been there. They will know the suffering, the pain, the disease, the despair. The cast and crew are to be applauded for their efforts.\n\nIn his bio, Peter lists Andersonville as one of the projects he is most proud of. And, well he should be. He did an excellent performance and is to be commended. It will go down as one of the favorites with his fans. Once again, Peter's genius comes shining through."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Andersonville",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi623688729",
        "name": "Andersonville",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDI4YjM1YWItZjFhNi00ZjUyLThjMTYtY2NjMzlkOTIyNjMxXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDI4YjM1YWItZjFhNi00ZjUyLThjMTYtY2NjMzlkOTIyNjMxXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-06-27T13:06:27.709Z",
        "url": "https://www.imdb.com/video/vi623688729/"
    },
    "url": "/title/tt0115097/"
}