{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anatoliy Solonitsyn",
            "url": "/name/nm0813463/"
        },
        {
            "@type": "Person",
            "name": "Ivan Lapikov",
            "url": "/name/nm0487553/"
        },
        {
            "@type": "Person",
            "name": "Nikolay Grinko",
            "url": "/name/nm0342458/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 54821,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "alternateName": "Andrei Rublev",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0917448/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0501778/"
        },
        {
            "@type": "Person",
            "name": "Andrey Konchalovskiy",
            "url": "/name/nm0464846/"
        },
        {
            "@type": "Person",
            "name": "Andrei Tarkovsky",
            "url": "/name/nm0001789/"
        }
    ],
    "description": "The life, times and afflictions of the fifteenth-century Russian iconographer St. Andrei Rublev.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrei Tarkovsky",
            "url": "/name/nm0001789/"
        }
    ],
    "duration": "PT3H25M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjM2MjMwNzUzN15BMl5BanBnXkFtZTgwMjEzMzE5MTE@._V1_.jpg",
    "keywords": "15th century,painter,religious art,slow cinema,genius",
    "name": "Andrey Rublyov",
    "original_info": {
        "id": "Andrei Rublev_1966",
        "name": "Andrei Rublev",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Vadim_"
        },
        "dateCreated": "2005-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060107/"
        },
        "name": "What side will you take?",
        "reviewBody": "Some historical knowledge will definitely not hurt while watching this film.\n\nThe medieval society was deeply religious. The church influenced every aspect of people's lives from birth to death and was part of the state. It means religious leaders were as important as rulers.\n\nIn Russian society men were wearing beards and women covered hairs. Remove a beard from a man or uncover woman's hair and you will humiliate them, they would feel like modern people being undressed in public.\n\nPaganism is a form of religion, where people believe in many gods instead of one. The main Russian pagan gods are the goddess of the earth and the god of the sun. Among others - the god of storms and lightning, the mythical young women living in forests and rivers. Despite many centuries of suppression of paganism by authorities some in modern Russia still celebrate the feast of Ivan Kupala (which could be translated as Ivan Gathering) depicted in the movie.\n\nAlso I have to mention, that Soviet censors told Tarkovski the movie is too cruel. They told him the scene with a burning cow, for example, is absolutely unacceptable. Tarkovski tried to defend the movie. The cow wasn't harmed, was his reasoning. Still the film was cut. The censors knew better what is good and what is not for the viewer.\n\nThis brings us to what is the message of Tarkovski in this film. There are many messages actually. I'll be telling only about one here, because it is not hidden. It is there, in the dispute between Rublov and Theophanes The Greek. They both are talented, both want to bring people to humanity. Theophanes is tired, he says - common people live in darkness, they are completely consumed by sin and the only way to make them humans is to scare them and punish them. Rublov advocates for love. He says: people live very difficult life, it's amazing how they endure it. We have to love them, to remind them, they are humans, they are Russians. You see, the first is the position of the Soviet system, the second - of Jesus Christ.\n\nMe? I'm still sitting on the fence. :)\n\nI recommend to watch this movie many times. You will do it without my recommendation though, if you (like me) will not understand everything from the first view and you like to think. The mesmerizing beauty of this movie will help you to return easier. For the first time be prepared for not a cakewalk. There are two things to consider here. One is the cruelty. Though it is absolutely necessary in this film, most of us living in a comfort of modern society are not ready to it. The other is the pace. Often it is a pace of real life. \n\nPeace.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2806824473",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTkyNTE5ODctZTYyMy00MmQzLThiNmYtNzQxZTBiODI4N2Y2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTkyNTE5ODctZTYyMy00MmQzLThiNmYtNzQxZTBiODI4N2Y2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-28T17:38:59.115Z",
        "url": "https://www.imdb.com/video/vi2806824473/"
    },
    "url": "/title/tt0060107/"
}