{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Warhol",
            "url": "/name/nm0912238/"
        },
        {
            "@type": "Person",
            "name": "Paul Morrissey",
            "url": "/name/nm0607407/"
        },
        {
            "@type": "Person",
            "name": "Viva",
            "url": "/name/nm0900201/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 124,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "datePublished": "1987-06-09",
    "description": "The first major profile of the American Pop Art cult leader after his death in 1987 covers the whole of his life and work through interviews, clips from his films, and conversations with his family and superstar friends. Andy Warh...",
    "director": [
        {
            "@type": "Person",
            "name": "Kim Evans",
            "url": "/name/nm0262952/"
        },
        {
            "@type": "Person",
            "name": "Lana Jokel",
            "url": "/name/nm0427015/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg2MDc4MjA3M15BMl5BanBnXkFtZTcwMDQwNDEyMQ@@._V1_.jpg",
    "keywords": "interview,art,artist,celebrity,character name in title",
    "name": "Andy Warhol",
    "original_info": {
        "id": "Andy Warhol_1987",
        "name": "Andy Warhol",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "strong-122-478885"
        },
        "dateCreated": "2015-04-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0163526/"
        },
        "name": "Warhol: A \"Famous For 15-Minutes\" Flake",
        "reviewBody": "I have never liked 1960's pop artist Andy Warhol. And now, after watching him in this documentary, I dislike him even more than ever.\n\nFrom my personal viewpoint, I think that Warhol was a despicable, snivelling suck who, because the times were what they were, hit it super-lucky and went on to become a pop culture icon without rightfully earning that celebrated status.\n\nIf you ask me - Warhol never had an original idea in his life. He was the ultimate rip-off artist who shamelessly plagiarized and borrowed heavily from others.\n\nIn every interview presented in this documentary, Warhol repeatedly came across as being the dullest, most inarticulate subject imaginable. He had zero-charisma. He was as drab and colourless as his \"art\" was repetitive and redundant.\n\nAs I understand it - Not only was Warhol an annoyingly eccentric flake, but he was also a callous, vicious, little control-freak who manipulated those who worked for him and got them to do all of the tedious tasks like silk-screening, etc., etc., while he sat around whining and bitching, non-stop.\n\nI mean, all you have to do is take a real good look at Andy in this documentary to clearly see that he wasn't a nice person at all. Warhol's looks were so utterly creepy that it's more than enough to make one's skin crawl. (Hey! I won't even begin to talk about those absolutely hideous wig he wore!)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0163526/"
}