{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Hanks",
            "url": "/name/nm0000158/"
        },
        {
            "@type": "Person",
            "name": "Ewan McGregor",
            "url": "/name/nm0000191/"
        },
        {
            "@type": "Person",
            "name": "Ayelet Zurer",
            "url": "/name/nm0957909/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 298899,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003687/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0124737/"
        },
        {
            "@type": "Person",
            "name": "David Koepp",
            "url": "/name/nm0462895/"
        },
        {
            "@type": "Person",
            "name": "Akiva Goldsman",
            "url": "/name/nm0326040/"
        },
        {
            "@type": "Person",
            "name": "Dan Brown",
            "url": "/name/nm1467010/"
        }
    ],
    "datePublished": "2009-05-15",
    "description": "Harvard symbologist Robert Langdon works with a nuclear physicist to solve a murder and prevent a terrorist act against the Vatican during one of the significant events within the church.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Howard",
            "url": "/name/nm0000165/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Action",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzNzM2MjgxMF5BMl5BanBnXkFtZTcwNTQ1MTM0Mg@@._V1_.jpg",
    "keywords": "illuminati,reference to bernini,reference to raphael,murder of a priest,psychotronic film",
    "name": "Angels & Demons",
    "original_info": {
        "id": "Angels and Demons Revealed_2004",
        "name": "Angels and Demons Revealed",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TJ-Deen"
        },
        "dateCreated": "2009-05-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0808151/"
        },
        "name": "Despite its obvious flaws, A&D is surprisingly good.",
        "reviewBody": "Before seeing the sneak preview today of Angels & Demons, I cleared my mind of any uncertainties that might hold me back from enjoying it; the enormous amount of hatred towards Dan Brown, the fact that it was written by Dan Brown, and because Dan Brown's name is slapped on all of the posters. I went in with an open mind, and expected the worse, but instead what I got was a 2 and a half hour Roman cat and mouse game with Forrest Gump, and that is by all means good entertainment value.\n\nThe movie hangs loosely on the actual novel itself. Harvard symbologist Robert Langdon (Hanks) jets off to Rome after the Pope's sudden death and the re-election through Papal Conclave. Arranging all of this is the carmelengo, Patrick McKenna (McGregor). However, he soon learns of a new threat, one that involves a secret brotherhood making its presence known, an anti-matter time bomb that Vatican City is now targeted with and the kidnapping of four cardinals. Langdon, using his intellects (and trust me, you'll be hearing a LOT from it) is given the task of finding and rescuing them using the mysterious Path of Illumination. Aiding him on the quest is CERN scientist Vittoria Vetra (Zurer), who is also the co-creator of the anti-matter. \n\nThe movie itself runs at an uneven pace. One minute Langdon and the Swiss Guard are speeding to save a branded cardinal, the next minute he bores you with pointless information about every random object he passes, evidently slowing the book's much anticipated action/thriller sequences down. It makes for an interesting read on paper, but on screen it can go either way. \n\nThe character's are decently written onto the big screen. Ewan McGregor does a convincing performance as the quiet but knowledgeable Patrick McKenna, famous accent included. Tom Hanks is slightly more agile, intellectually and physically, since his last performance in the mediocre Da Vinci Code. Stellen Skarsgard plays Commander Richter, the straight-faced leader of the Swiss Guard. Unfortunately, neither his nor Ayelet Zurer's performance are worthwhile ones, and instead of playing a part in the story, they are just kicked aside as assets. \n\nHowever, Angels & Demons accomplishes what DVC could never; a thrilling fast-paced movie filled with satisfying explosions, beautiful recreations of St. Peter's Square and Basilica (including many of the churches) and a pulsing bomb counting down the midnight hour. Ron Howard does a decent job at directing this second Langdon adventure, this time taking in much criticism and almost completely exchanging the boring dialogue for tense chases (almost). \n\nWhile newcomers might call it a \"National Treasure 3\" with a much larger threat, there is still enough contagious suspense/thriller eye-candy and brilliant still shots of Rome to breathe in. Fans of the book might feel differently towards the movies drastic changes, but considering the amount of blasphemy and inaccuracy it generates, A&D does exceedingly well at keeping the viewer locked on to the screen this time rather than on their sleepy shoulder. \n\nA good book-to-movie adaption that will both appeal and entertain.\n\n7.4/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Harvard symbologist Robert Langdon works to solve a murder and prevent a terrorist act against the Vatican. ",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1394934553",
        "name": "Angels & Demons: Trailer #2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTAzMDkwMzE2NzVeQTJeQWpwZ15BbWU4MDQzNzU3MzMx._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTAzMDkwMzE2NzVeQTJeQWpwZ15BbWU4MDQzNzU3MzMx._V1_.jpg",
        "uploadDate": "2009-02-13T17:06:36Z",
        "url": "https://www.imdb.com/video/vi1394934553/"
    },
    "url": "/title/tt0808151/"
}