{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Miranda Rhyne",
            "url": "/name/nm0722614/"
        },
        {
            "@type": "Person",
            "name": "Charlotte Eve Blythe",
            "url": "/name/nm0090033/"
        },
        {
            "@type": "Person",
            "name": "Anna Thomson",
            "url": "/name/nm0505764/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 973,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070326/"
        },
        {
            "@type": "Person",
            "name": "Rebecca Miller",
            "url": "/name/nm0589182/"
        }
    ],
    "datePublished": "2015-05-02",
    "description": "Rebecca Miller's riveting drama examines how two sisters cope with their mother's mental illness.",
    "director": [
        {
            "@type": "Person",
            "name": "Rebecca Miller",
            "url": "/name/nm0589182/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTJlZTgyYjEtN2Y4Mi00MDU4LTliNzAtZmU1N2Y3YmNhOWQwXkEyXkFqcGdeQXVyMjkyMDI4NTQ@._V1_.jpg",
    "keywords": "girl,mental illness,little girl,reference to heaven,angel",
    "name": "Angela",
    "original_info": {
        "id": "Angela_1995",
        "name": "Angela",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tlyoung88"
        },
        "dateCreated": "2005-05-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112364/"
        },
        "name": "A beautiful film, working on many levels",
        "reviewBody": "This is an amazing if bizarre film. The acting of the two little girls is superb and far surpasses those of child actors in big budget studio films. \n\nI've read some disturbing posts accusing this film of child exploitation, particularly in the use of nudity. The nudity in this film is as innocent as a baby on a bearskin rug, but too many narrow-minded morons with internet access confuse this with pornography.\n\nThe use of nudity in this film is a bit artsy, but very natural and represents the only beauty in these girls lives. Swimming nude with their mother the only time in their lives they've experienced joy. But the religious views of Angela makes her see herself as sinful, and her sister as unclean. This film could have been improved by more nudity to show how this budding adolescent views her own body. She already has a negative view of sexuality. But it's an issue no American filmmaker would dare explore, and I don't blame them.\n\nThis is where the film becomes a near-satire of the dangers of blind faith in fear-based religions. This view of sin and uncleanliness leads Angela down a dangerous path but in her innocence, she doesn't view her actions as having negative consequences on her sister. \n\nWithout giving any spoilers, Ellie experiences true freedom at the end only by experiencing, in the director's words, \"an intense emotional experience.\"\n\nThe only negative comment I have is I already know ahead of time how society views films of this nature. I'm surprised to see that few religious nuts who have seen this film never recognized it as a criticism of their faith. No one seems to be able to get over the sight of a naked baby to be able to do that.\n\ntlyoung88",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0112364/"
}