{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emily Watson",
            "url": "/name/nm0001833/"
        },
        {
            "@type": "Person",
            "name": "Robert Carlyle",
            "url": "/name/nm0001015/"
        },
        {
            "@type": "Person",
            "name": "Joe Breen",
            "url": "/name/nm0106736/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22443,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031919/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0502036/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093765/"
        },
        {
            "@type": "Person",
            "name": "Frank McCourt",
            "url": "/name/nm0566660/"
        },
        {
            "@type": "Person",
            "name": "Laura Jones",
            "url": "/name/nm0428630/"
        },
        {
            "@type": "Person",
            "name": "Alan Parker",
            "url": "/name/nm0000570/"
        }
    ],
    "datePublished": "2000-01-21",
    "description": "Based on the best-selling autobiography by Irish expatriate Frank McCourt, Angela's Ashes follows the experiences of young Frankie and his family as they try against all odds to escape the poverty endemic in the slums of pre-war L...",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Parker",
            "url": "/name/nm0000570/"
        }
    ],
    "duration": "PT2H25M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjQ5MTY1NTgtZGNiNy00MTk4LWI3MGItYjZiN2Y5NmI2MzY0XkEyXkFqcGdeQXVyMjgyNjk3MzE@._V1_.jpg",
    "keywords": "irish,based on autobiography,ireland,based on book,pulitzer prize source",
    "name": "Angela's Ashes",
    "original_info": {
        "id": "Angela's Ashes_1999",
        "name": "Angela's Ashes",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mstomaso"
        },
        "dateCreated": "2005-05-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0145653/"
        },
        "name": "Good adaptation of a great book",
        "reviewBody": "Alan Parker has made many films which adapt material from other media. I have been less than thrilled with most of these, but I've enjoyed one or two. Angela's Ashes is one of his better works, but it adapts a book which< I would argue, can not be properly adapted. \n\nThis is a very pure, almost sterile, adaptation of the original memoir \"Angela's Ashes\" by Frank McCourt. It chronicles vignettes in the family history of the McCourt's, a poor Irish Catholic family struggling to survive in early 20th century Ireland. The film, like the book, is stark, painful, hopeful, powerful, and deftly accurate. More than a period piece, this film works as a dramatic rendering of social history.\n\nUnlike the book, this film depicts Frank's childhood from a disembodied third person perspective, though it is liberally complemented by an effective voice-over narrative drawn almost directly from McCourt's own prose. Frank is the oldest of several siblings (many of whom never reach adulthood), in a family suffering from poverty, alcoholism, and persecution. Although the film has many positive messages, like the lives of the McCourt's, it's not an easy road. Those who wish to be simply entertained should probably not bother.\n\nThe performances are all exquisite. Kudos to the cast and the director for making them all look so great. Visually, the film is stunning for its starkness and powerful use of contrast. The pace is a little breathless at times, but, given the richness of the original work, this is appropriate.\n\nAll considered, this is a very worthy representation of the book. The only quibble I have stems from the very act of translating what was a very intensely personal, first-person memoir into a third-person medium like film, not from anything the production team did, or from the script and cast. It would likely have been impossible in a mainstream film to depict the texture and poetics of McCourt's prose to the extent that viewers would really feel that they had grown up with him and knew him like a member of their own family. This is how the book made me feel, and seeing the movie after the book I was reminded of the feeling, but not quite so powerfully affected. I would agree that reading the book first will help you enjoy this film, however, I also believe that this stands well on its own.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount",
        "duration": "PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4155900185",
        "name": "Angela's Ashes",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGI1ZDdiM2UtMDI5OS00OTdkLWJlMjEtZjhjMDQwZDI3ODJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGI1ZDdiM2UtMDI5OS00OTdkLWJlMjEtZjhjMDQwZDI3ODJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:41:44Z",
        "url": "https://www.imdb.com/video/vi4155900185/"
    },
    "url": "/title/tt0145653/"
}