{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Douglas Fairbanks Jr.",
            "url": "/name/nm0001195/"
        },
        {
            "@type": "Person",
            "name": "Rita Hayworth",
            "url": "/name/nm0000028/"
        },
        {
            "@type": "Person",
            "name": "Thomas Mitchell",
            "url": "/name/nm0593775/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1253,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Ben Hecht",
            "url": "/name/nm0372942/"
        }
    ],
    "datePublished": "1940-10-02",
    "description": "A cuckolded embezzler on the verge of suicide is helped by a tout, an alcoholic playwright, and a pick-up girl to reimburse the money with a gambling sting.",
    "director": [
        {
            "@type": "Person",
            "name": "Ben Hecht",
            "url": "/name/nm0372942/"
        },
        {
            "@type": "Person",
            "name": "Lee Garmes",
            "url": "/name/nm0005716/"
        }
    ],
    "duration": "PT1H19M",
    "genre": [
        "Adventure",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDVkYmI4Y2EtZjY1NC00NjE4LTkyMzgtZDY3ZTQ0MWI3NTYzXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_.jpg",
    "keywords": "henchman,damsel in distress,held at gunpoint,theatre watchman,theatre prop room",
    "name": "Angels Over Broadway",
    "original_info": {
        "id": "Angels Over Broadway_1940",
        "name": "Angels Over Broadway",
        "year": "1940"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ytbufflo"
        },
        "dateCreated": "2012-01-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0032209/"
        },
        "name": "Rita Hayworth - The Original Marilyn",
        "reviewBody": "It is so easy to write off beauty as the reason an actress achieves great rank in Hollywood, and it is what also plagued Marilyn Monroe - the desperate need to be taken seriously for your talent rather than your looks once you have become famous for beauty alone.\n\nI myself had never given Rita Hayworth props for anything other than her luminous visual persona. So it was with great delight that I came across this exceptional film, with its screwball comedy timing and humor, and its amazing ensemble casting - from a sleazy but compelling performance by Douglas Fairbanks Jr. to the ironic portrayal of the has-been drunk played to iconic perfection by Thomas Mitchell.\n\nBut the two real gems are John Qualen as a suicidal bookkeeper who is the target of a 2 bit mob scam, and Rita Hayworth in a portrayal as exceptional to me as Rosalind Russell in The Front Page, or Marilyn Monroe in 7 Year Itch - a star-struck wanna-be who is barely making it in shady circumstances, yet manages to convey tremendous innocence and idealism in spite of her deeply compromised situation.\n\nThe most striking thing to me of all is how uncanny it is to watch what one would consider to be a classic Monroe performance coming from an actress seven years prior to Marilyn having been given her first on screen part. Suddenly I felt like I understood how Marilyn had crafted her persona - hours of sitting in darkened theaters watching Rita Hayworth concoct her brilliant magic of innocence and seduction like it was real and not a carefully crafted act.\n\nIn my humble opinion, I don't believe Marilyn would have been nearly as iconic had she not had Rita Hayworth's example to follow, and this portrayal in Angels Over Broadway is the link that, to me, irrefutably proves my point! What an amazing, under-appreciated work of group talent and screen writing art! Rita is poignantly brilliant and her performance ranks for me with Robert Williams in Platinum Blonde for great, naturalistic acting that lasts through time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0032209/"
}