{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Patrick Warburton",
            "url": "/name/nm0911320/"
        },
        {
            "@type": "Person",
            "name": "Britt Irvin",
            "url": "/name/nm0410127/"
        },
        {
            "@type": "Person",
            "name": "Kurt Fuller",
            "url": "/name/nm0298281/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 556,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0152165/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013021/"
        },
        {
            "@type": "Person",
            "name": "Richard Conlin",
            "url": "/name/nm0174823/"
        },
        {
            "@type": "Person",
            "name": "Robert King",
            "url": "/name/nm0455207/"
        },
        {
            "@type": "Person",
            "name": "Holly Goldberg Sloan",
            "url": "/name/nm0805965/"
        }
    ],
    "datePublished": "2000-04-09",
    "description": "A group of angels try to help a baseball team win a championship game, while at the same time helping to reunite the pitcher's family.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert King",
            "url": "/name/nm0455207/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAyNDU2MTM4OF5BMl5BanBnXkFtZTcwMzE4OTUyMQ@@._V1_.jpg",
    "keywords": "fireworks,baseball movie,sports team,father daughter relationship,devil",
    "name": "Angels in the Infield",
    "original_info": {
        "id": "Angels in the Infield_2000",
        "name": "Angels in the Infield",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2006-08-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0238038/"
        },
        "name": "Occasionally very funny, but contains unfortunate problems",
        "reviewBody": "Not as good as the first film of the trilogy, Angels in the Outfield (1994), but nowhere near the dire mess of the second, Angels in the Endzone (1997), Angels in the Infield is a moderate success that even shows occasional flashes of brilliance.\n\nThe film works best when all involved concentrate on being funny. Director/writer Robert King and co-writer Garrett K. Schiff's teleplay has a lot of hilarious moments, especially in the hands of actors Patrick Warburton, as a down-on-his-luck pitcher for the (now dubbed) Los Angeles Angels of Anaheim, and Kurt Fuller, as his eager beaver agent. There are smaller roles that are just as good, such as Peter Keleghan's, as a cynical and smarmy broadcaster, and some that are not as good as you'd expect them to be, such as David Alan Grier's, as the angel who must lend a helping hand this time around. But overall, when King's directorial timing is on and he's not being too toddler-style silly (but even those few moments almost work), this is the funniest film by far out of the trilogy.\n\nThe problem is that far too often, his timing isn't on. It's hard to pinpoint the exact source of the pacing problems--they probably stem from a confluence of factors, but sometimes we travel through a wide morass of unfunny, somewhat weak sentimental material, sometimes scenes just go on too long, and sometimes the dramatic \"beats\" seem to be following a broken metronome--quite a few times my wife or I felt the urge to push the actors into their next lines or actions.\n\nOf course, the film isn't exactly original--the first film was a remake of an MGM vehicle from 1951, and as another Angels film where baseball is the sport of choice and the driving force is a child trying to win the love of a father, this has a large number of parallels to the 1994 gem. But as a sequel, especially, it doesn't have to be overly original. It's familiar enough to fit the series (whereas the second film was almost too different), while still fresh enough to hold your attention. King infuses Angels in the Infield with a successful, more irreverent attitude--not too far removed from two other films that featured Warburton to great effect, The Emperor's New Groove (2000) and its sequel, Kronk's New Groove (2005). He also adds a nice, new dramatic twist, and features a lot of attractively stylized sets and cinematography.\n\nIt's a shame that those pacing problems are present. Without them, this could have easily been the best of the series. I'm anxious to see what King might have in store for us as a director in the future.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H27M",
    "url": "/title/tt0238038/"
}