{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tamara Landry",
            "url": "/name/nm0485112/"
        },
        {
            "@type": "Person",
            "name": "Steven Ginsburg",
            "url": "/name/nm0320120/"
        },
        {
            "@type": "Person",
            "name": "Susan Featherly",
            "url": "/name/nm0269947/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 382,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "alternateName": "Animal Attraction: Carnal Desires",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052202/"
        },
        {
            "@type": "Person",
            "name": "D. Ray Morton",
            "url": "/name/nm0607952/"
        }
    ],
    "description": "When business becomes pleasure at a massage parlor, someone has to lose.",
    "director": [
        {
            "@type": "Person",
            "name": "Eric Gibson",
            "url": "/name/nm0316957/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY3ODkxMDQyM15BMl5BanBnXkFtZTcwNTE0OTgyMQ@@._V1_.jpg",
    "keywords": "male nudity,cowgirl sex position,erotica,adultery,sex",
    "name": "Carnal Desires",
    "original_info": {
        "id": "Animal Attraction_2000",
        "name": "Animal Attraction",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Smooth B"
        },
        "dateCreated": "2003-05-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0225339/"
        },
        "name": "Lots of sex, and a good dose of Susan Featherly....I give it a B.",
        "reviewBody": "You can tell by the name of the film, \"Carnal Desires\", what you're gonna get--a flimsy plot, lots of simulated sex, and good looking babes. If that's what you're looking for, this is your film. I could stop here, but I'll elaborate on the particulars a bit more.\n\nSteven Ginsburg is Mick, a \"massage therapist\" looking to open his own shop. He goes to the husband of one of his regular clients for a little seed money. You pretty much know the tale after this...obviously, he's sleeping with the woman, but not only that, he's sleeping with another girl (Susan Featherly), with yet another one (Peggy Trentini) he's THIS close to getting into bed. Oh, and you can't forget about Mia. Yep, this guy gets around.\n\nI lost track of the plot after this, since the story did a disappearing act halfway through. There were plenty of sex scenes, though, so someone watching this film probably wouldn't notice the dialogue getting repetitive and the story going absolutely nowhere.\n\nWomen: B+ (A good selection of women to choose from in this film.)\n\nSex: B+ (A number of sex scenes, most of them quite good. About two-thirds of the way through, the masseuse guy is banging not one, but two women simultaneously. Sound impossible? First he's having sex with the wife, then the scene fades into another scene with him having sex with Susan Featherly. It goes back and forth like this all the way through the scene. Susan's facial expressions are hilarious in this scene.)\n\nStory: D+ (It does its job, if the primary objective was to get from one sex scene to another. There's a big train wreck among the characters at the end which will confuse you...trust me, you'll be confused.)\n\nOverall: B (The \"Story\" grade lowers the overall a bit, but the good looking women and the number of good sex scenes made up for it. Not a great softcore film, but it's okay.)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0225339/"
}