{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jodie Foster",
            "url": "/name/nm0000149/"
        },
        {
            "@type": "Person",
            "name": "Chow Yun-Fat",
            "url": "/name/nm0000334/"
        },
        {
            "@type": "Person",
            "name": "Bai Ling",
            "url": "/name/nm0000499/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 37944,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093776/"
        },
        {
            "@type": "Person",
            "name": "Anna Leonowens",
            "url": "/name/nm0503103/"
        },
        {
            "@type": "Person",
            "name": "Steve Meerson",
            "url": "/name/nm0576228/"
        },
        {
            "@type": "Person",
            "name": "Peter Krikes",
            "url": "/name/nm0471298/"
        }
    ],
    "datePublished": "1999-12-17",
    "description": "The story of the romance between the King of Siam and widowed British schoolteacher, Anna Leonowens, during the 1860s.",
    "director": [
        {
            "@type": "Person",
            "name": "Andy Tennant",
            "url": "/name/nm0855035/"
        }
    ],
    "duration": "PT2H28M",
    "genre": [
        "Drama",
        "History",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWQzMmY1ZDktMjk0Yi00MGJmLWI0ZWQtYzQzNjU2MTk5ZjA5XkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "1860s,king,siam,schoolteacher,thailand",
    "name": "Anna and the King",
    "original_info": {
        "id": "Anna and the King_1999",
        "name": "Anna and the King",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bopdog"
        },
        "dateCreated": "2000-01-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0166485/"
        },
        "name": "Flawed, but good anyway. The romance felt real; the visuals are spectacular!",
        "reviewBody": "This is a good movie, and it's very much worth seeing. Visually it is stunning-- the fake palace they built, and the geography is well worth the price. There are some complications that make it less than great, however. These problems might be inherent in the material-- adapting an actual English lady's actual diary. Should one poke fun at the colonializing 19th century British? The various \"local\" political rivals who evidently were more than willing to accept British trade and other \"help\" in exchange for fulfillment of personal ambitions? Or does one go entirely modern and politically correct, and pretend that the entire planet was a Berkeley coffee house just waiting for a chance to express neo-Marxist thought?\n\nThis movie tried really hard to appear \"p.c.\" and historical at the same time. There were some glaring inconsistencies, however-- e.g., the British woman was evidently \"shocked\" by the death penalty being applied for what amounted to treason against the king, and yet in her own country, just 15 years before, the death penalty was routinely applied to shoplifters, petty thieves, vagrants, and anyone else the English nobility found inconvenient, annoying, or simply yucky.\n\nThe domestic montages were at times awkward and fakey. E.g., when the camera tried to build a sense of \"Hey, we're getting along now!\" by roaming around the palace grounds, showing the king, his kids, his old ladies and Anna all noticing birds and smiling at each other; noticing ducks and smiling at each other; noticing cutesy-poo antics of the young ones and smiling at each other. That was very stilted and phony feeling.\n\nBut this movie was much better than the critics mostly said. For example, for me, the relationship between the king and the teacher was actually very realistic, quite believable, and powerful. So maybe it's just that many professional critics don't like to see what real humans might do in a love situation with complications-- after all, they do go apoplectic whenever a movie wants you to feel something deep and real. So ignore them, and enjoy it for what it is-- a valiant and earnest effort to tell a complicated and difficult story. I gave it an \"8.\""
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi28770585",
        "name": "Anna and the King",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODZjNmFiNTItMjRmZC00Y2VjLTkxYTAtMTJjOTFjNmM5MTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODZjNmFiNTItMjRmZC00Y2VjLTkxYTAtMTJjOTFjNmM5MTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:43:48Z",
        "url": "https://www.imdb.com/video/vi28770585/"
    },
    "url": "/title/tt0166485/"
}