{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Miriam Chin Wah Yeung",
            "url": "/name/nm1173559/"
        },
        {
            "@type": "Person",
            "name": "Ekin Cheng",
            "url": "/name/nm0155562/"
        },
        {
            "@type": "Person",
            "name": "Chuen-Yee Cha",
            "url": "/name/nm0149216/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 259,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "alternateName": "Anna in Kung-Fu Land",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032768/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0089518/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078389/"
        },
        {
            "@type": "Person",
            "name": "Hing-Ka Chan",
            "url": "/name/nm0150916/"
        },
        {
            "@type": "Person",
            "name": "Man-Lung Ho",
            "url": "/name/nm3332524/"
        },
        {
            "@type": "Person",
            "name": "Ho-Leung Lau",
            "url": "/name/nm1210118/"
        }
    ],
    "datePublished": "2003-12-24",
    "description": "(Cantonese with English subtitles) An advertising executive revamps a defunct martial arts tournament in order to use it in an advertising campaign for his current project. He also enlists the expert help of a young kung fu studen...",
    "director": [
        {
            "@type": "Person",
            "name": "Wai-Man Yip",
            "url": "/name/nm0948145/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUyNzc1ODExNF5BMl5BanBnXkFtZTgwMzkxMDA2MDE@._V1_.jpg",
    "name": "An Na yu wu lin",
    "original_info": {
        "id": "Anna in Kung Fu Land_2003",
        "name": "Anna in Kung Fu Land",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "esteepswong"
        },
        "dateCreated": "2004-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0395942/"
        },
        "name": "Miriam in Eye-Candy Land",
        "reviewBody": "The kindest thing one can say about this romantic comedy is that it is a crowd-pleaser made for fans of Ekin Cheng and Miriam Yeung. There are very few laughs to be found in the entire movie and even less in terms of romance. The comedy is just as tacky and the kungfu won't even impress a child.\n\nComic book fan Kin (Ekin Cheng) works for a marketing company owned by the father of her girlfriend. One day, while trying to come up with ideas to promote a health drink for a client, Kin makes a wild suggestion that they organize an international martial arts competition offering a HK$5 million prize. As the client's company would be the main sponsor therefore worldwide exposure would be imminent. To Kin's surprise, this harebrained idea is accepted and what's more, a Shaolin master is even fielding some competitors. Next we find Kin flying off to Japan to invite a famous Chinese kungfu master to join up. However instead of agreeing to take part himself, the old man sends his daughter Anna (Miriam Yeung). However Anna has something else in mind besides the prize money. Learning that a talent scout from Hollywood is involved, she plans to use her kungfu moves to become a movie star. Somehow Anna is attracted to Kin, who already has a girlfriend and he is too much of a clad to come clean with the two women until it is too late.\n\nDon't ask how the competition works because among the 16 odd-balls taking part, there is a pair of hot-chicks and three kids fighting as a team. There is also a black American and some of the sorriest looking martial arts exponents you can ever lay your eyes on. Director Raymond Yip Wai Man seems so proud of the fighting sequences that he repeats them as if they were costly stunts!\n\nThese days, the Hong Kong box-office goes for name-recognition rather than acting talent and budding singers like Miriam Yeung become movie stars almost by default. That should give you an idea of her performance here. Ekin Cheng is of no help either. He just goes through the paces as if he were attending a media function. But then, nobody really expected him to act, anyway."
    },
    "url": "/title/tt0395942/"
}