{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Dreyfuss",
            "url": "/name/nm0000377/"
        },
        {
            "@type": "Person",
            "name": "Emilio Estevez",
            "url": "/name/nm0000389/"
        },
        {
            "@type": "Person",
            "name": "Rosie O'Donnell",
            "url": "/name/nm0005280/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14937,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0321485/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0153710/"
        },
        {
            "@type": "Person",
            "name": "Jim Kouf",
            "url": "/name/nm0467942/"
        }
    ],
    "datePublished": "1993-07-23",
    "description": "Two immature detectives are joined by a pesky assistant district attorney in staking out a lakeside home where a Mafia trial witness is believed to be heading.",
    "director": [
        {
            "@type": "Person",
            "name": "John Badham",
            "url": "/name/nm0000824/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWZmMzIwZTgtYmMyZi00ZWMwLWJjYzYtNGQzNTE1NmVlNjkxXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "stakeout,witness,surveillance,panties,bound and gagged",
    "name": "Another Stakeout",
    "original_info": {
        "id": "Another Stakeout_1993",
        "name": "Another Stakeout",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2004-01-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106292/"
        },
        "name": "Another Miserable Retread...",
        "reviewBody": "\"That's it, nobody calls me Ed McMahon!\"\n\n\n* Emilio Estevez saying the funniest line from a rather dry sequel\n\n\n\"Another Stakeout\" was six years in the waiting. After the first film, \"Stakeout,\" made a huge splash at the box office in 1987 (the same year another cop-buddy film came out--can you guess which one?), everyone anticipated an unnecessary--but perhaps funny--sequel that would inevitably result after box office earnings were tallied up by film executives in an office somewhere. \n\nAlas, the six years passed, and we got...this mess?\n\nRichard Dreyfuss and Emilio Estevez reprise their roles as stakeout cops who get paired with a new partner in this watered-down sequel. The new partner is played by Rosie O'Donnell, who is so startlingly unfunny in this it almost makes you involuntarily switch off the television as soon as you see her chubby face smiling at you.\n\nThe story starts with a bang--literally--as a trial witness being protected by the CIA is unsuccessfully assassinated--and by that I mean: They die, she lives. What a surprise. (This is the type of scene where the villain is able to blow up a house but the witness just happens to be taking a stroll outside as it happens--or something like that--preventing her from dying along with the other agents who were previously protecting her. This type of thing was spoofed greatly in the truly underrated \"Last Action Hero.\" It's not a joke in \"Another Stakeout.\") Unfortunately for the United States, the trial witness never returns--she runs away and doesn't let anyone know where she is. Afraid she may be in danger, afraid to lose a star witness, and believing that she might try to contact old friends, the gruff chief of police assigns the unlucky trio of Dreyfuss, Estevez and Donnell to watch the her old pals to see if she turns up.\n\nShe eventually does, of course, but first we get some painfully unfunny buddy-buddy moments between Dreyfuss and Estevez and O'Donnell. She brings a bunch of clothing and a dog with her. They don't like it. Har-har. This was used a bit better in \"Spaceballs,\" in which Princess Vespa brought along that entire luggage through the desert (remember?). This is just a copy of that scene, minus the punch line.\n\nEstevez also shaves his mustache, which is supposed to be a type of sacred moment and is referenced at least ten times throughout the film (he goes to stroke his mustache, he complains about chopping it off, Dreyfuss complains about it, etc.). But for heaven's sake, he's only been in one film so far--we've only seen the mustache once--so a better thing to do would have been this: make a few more sequels and, when the last entry comes, have him shave it off. By then the audience realizes that his mustache is part of him, and that losing it is like losing part of his soul.\n\nBut I'm glad they didn't make any more than one sequel.\n\nOne of the things that kept the \"Lethal Weapon\" franchise going was the fresh ideas, fresh buddies, and fresh scripts. (Great actors never hurt an action comedy, either.) The \"Stakeout\" franchise--which didn't even last long enough to spawn more than one sequel--tries to copy this formula but isn't sure how. The introduction of Joe Pesci in \"Lethal Weapon 2\" was great because he thereby became the Third Stooge, whereas O'Donnell's entry into the series is nothing but a humiliating reminder that talk show hosts can't always act in front of a camera and maintain the same type of humor they may (or may not) exhibit on their (awful) TV \"talk show.\" (Which is, by the way, consumed of entirely staged so-called \"interviews.\")\n\nAnd whereas Pesci, as Leo Getz, added a type of silly vibe to the \"LW\" series, O'Donnell just seems like a carbon copy clone of Estevez from the first \"Stakeout.\" Dreyfuss didn't like him at first, and--guess what--they suddenly became best buds. The same thing happens in the sequel, much to the audience's chagrin. \n\nOf course, \"Lethal Weapon\" and its sequels were never more than a few years apart (the first coming out in 1989, two years after the original). But \"Stakeout\" had six years to make a respectable sequel, and it fails. It fails the same way that many prolonged sequels do. But, for once, it's not because the audience has forgotten the original film--it's because the audience is fed up with the same routine.\n\nThe film was directed by John Badham, which is surprising, since he's a talented director (\"Saturday Night Fever,\" \"The Hard Way,\" \"Stakeout\"). Here he jumps through all the hoops, turning his own series into a pale retread of the original--only watered down: minus the violence, language, nudity, and humor. I'm not saying a movie has to be R to be funny. But if you've got a sequel to an R-rated movie like \"Stakeout\" and you decide to turn its sequel into a cutesy-tutesy children's entertainment program, you'd better advise the audience before they sit down expecting something funny and fresh.\n\nWhat a disappointment.\n\n2/5 stars.\n\n\n* John Ulmer\n",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2831728665",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWJiYzQxN2YtNjg1NS00MWI0LTk2Y2QtYjc0ZTFkMzYyZTJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWJiYzQxN2YtNjg1NS00MWI0LTk2Y2QtYjc0ZTFkMzYyZTJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-20T11:52:27.328Z",
        "url": "https://www.imdb.com/video/vi2831728665/"
    },
    "url": "/title/tt0106292/"
}