{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gena Rowlands",
            "url": "/name/nm0001687/"
        },
        {
            "@type": "Person",
            "name": "Mia Farrow",
            "url": "/name/nm0001201/"
        },
        {
            "@type": "Person",
            "name": "Ian Holm",
            "url": "/name/nm0000453/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14433,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008432/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "datePublished": "1988-11-18",
    "description": "Facing a mid-life crisis, a woman rents an apartment next to a psychiatrist's office to write a new book, only to become drawn to the plight of a pregnant woman seeking that doctor's help.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWVhMDczZTQtOGMxYS00NmY3LTg1M2QtMDRmYzI3NmMzMTc0XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "apartment,female writer,interior monologue,therapy session,chance meeting",
    "name": "Another Woman",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "majikstl"
        },
        "dateCreated": "2004-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094663/"
        },
        "name": "But seriously, folks...",
        "reviewBody": "If there is a moral to Woody Allen's ANOTHER WOMAN, it is that we should live our lives with passion, spontaneity and optimism. Ironically, these are the very elements that are noticeable missing from the film. ANOTHER WOMAN seems to be selling products it doesn't have in stock, let alone on display.\n\nANOTHER WOMAN is an immaculate movie; sensitively acted, concisely written and lovingly filmed. But like so many of Allen's \"serious\" films, it is cold and strangely impersonal. It is Woody standing back and looking at someone else's life, composing a precise picture, but with a hands-off, leave-no-fingerprints approach. It is one of those films that is so easy to admire, but very difficult to embrace. It desperately wants to touch you, but refuses to come within touching distance. The film's central character is described thus: \"She's just a little judgmental. You know, she sorta stands above people and evaluates them.\" That is how Allen approaches his characters here, like they're specimens. \n\nThere is, of course, two Woody Allens: the comedy genius and the always aspiring dramatist. Most of his comedies are pretty good, but the best are those that let the serious Woody sneak into the film and give the material backbone, as in ANNIE HALL, MANHATTAN, STARDUST MEMORIES and DECONSTRUCTING HARRY. He allows the serious Woody to make cameo appearances in his comedies, but when he sets his sites on meaningful drama, the funny Woody is barred from the set. It is as though Allen is afraid that so much as a smile will break the mood and make people forget just how serious his intentions are. He so easily mocks intellectual thought in his comedies, that he seems to have no faith in his ability to \"be serious\" and mean it. As such his serious comedies are alive and filled with insight, while his serious dramas are filled with pretense. How seriously can one take a line like \"I shouldn't have seduced you. Intellectually, that is.\"? I mean, who the heck talks like that? In his comedies, such dialogue shows how pretentious the characters are; in his dramas, it seems meant to show just how sincere the characters are. \n\nAnd words are an important element of ANOTHER WOMAN. Allen's dialogue and narration is eloquent and sophisticated, but stiff and formal. Even when discussing their deepest feelings or expressing anger or reliving joyous moments in their lives, all the characters speak as though they are discussing the terms of their life insurance policies. There is a solemn emptiness to the tone of the film; even at the end, when Marion tries to make amends for past failings, she seems to be negotiating a contract, not saying \"Let's start again.\" Such pompous droning seems designed to reflect the tone of the characters' lives; but the end result is monotonous and deadening, rather than being poetic and compelling. \n\nThe film does have a clever conceit: the always marvelous Gena Rowlands plays Marion Post, a professor of philosophy, who sublets an apartment to serve as an office where she can write her latest book. A quirk in the ventilation system allows her to inadvertently eavesdrop on the conversations going on next door. The next apartment is the office of a psychiatrist, who counts among his patients a young pregnant woman, played by Mia Farrow. The young woman discusses at length her sorrowful life and suicidal impulses. Because she identifies with the younger woman's feelings of loneliness and alienation, Marion becomes obsessed with eavesdropping on the sessions and uses the situation as a springboard for reevaluating her own life. \n\nIt is significant that just as Allen tells the story from a sterile distance, Marion reviews her life only indirectly, though voice-overs, flashbacks, dreams and even symbolic stage productions. Even her psychoanalysis is conducted through a surrogate, Farrow's character, who is rather obviously named Hope. Much of the interaction with other characters occurs in Marion's mind. And rather predictably, Marion's journey of self discovery is, well, rather predictable. She discovers -- as protagonists in this sort of film always discover -- that her successful career and her well-ordered life are a facade hiding her empty relationships and assorted personal failures. Her life of satisfied accomplishment is meaningless and the trust, love and respect she believes she shares with others are delusions. It's like IT'S A WONDERFUL LIFE in reverse: Just as the angel Clarence acts as George Bailey's conscience to show him how valuable his life has been, Hope acts as Marion's conscience to reveal how empty her life as become. \n\nANOTHER WOMAN has a counterpart in Allen's 2003 film, ANYTHING ELSE; another film with an obvious doppelganger. The former is about a woman who encounters her younger alter ego and reevaluates her past choices, while the latter is about a young man whose encounters with his older alter ego (played by Woody Allen) effects the choices that will shape his future. The same basic story is approached from opposite directions.\n\nIt's dangerous to speculate, but it seems that Allen made ANOTHER WOMAN during a time in his life when he was hugely admired for his accomplishments and he was deeply involved in a relationship with Mia Farrow and her extended family. Certainly Farrow's playing a pregnant woman and Marion's second thoughts over placing career over personal relationships seem to suggest a parallel. By contrast, ANYTHING ELSE, made a decade and a half later, finds Allen's character playing a mentor at a time when he is apparently happily married to a much younger woman, and where his status as a filmmaker is more iconic than in vogue. As such, his surrogate changes from being the central figure to the sadder but wiser voice of experience.\n\nBoth films are steeped in regret, but make an effort to end in an upbeat fashion. But while ANOTHER WOMAN is an accomplished, polished work striving for a cool perfection, it is not persuasive in its attempt to inspire us with optimism. ANYTHING ELSE is rambling and unfocused and, well, sloppy, but its optimism is honest and funny. ANOTHER WOMAN is about getting another chance, but there is no reason to believe that anything will really change in Marion's tight, introspective little life."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Facing a mid-life crisis, a woman rents an apartment next to a psychiatrist's office to write a new book, only to become drawn to the plight of a pregnant woman seeking that doctor's help.",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4091200281",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2U4ZjM4YzctOTA1NS00ZDcxLWIwNGQtNmQ2ZmJiN2MzMWE0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2U4ZjM4YzctOTA1NS00ZDcxLWIwNGQtNmQ2ZmJiN2MzMWE0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-12-02T18:31:15.029Z",
        "url": "https://www.imdb.com/video/vi4091200281/"
    },
    "url": "/title/tt0094663/"
}