{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rajesh Khanna",
            "url": "/name/nm0004435/"
        },
        {
            "@type": "Person",
            "name": "Sharmila Tagore",
            "url": "/name/nm0846616/"
        },
        {
            "@type": "Person",
            "name": "Sujit Kumar",
            "url": "/name/nm0474895/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1908,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064267/"
        },
        {
            "@type": "Person",
            "name": "Sachin Bhowmick",
            "url": "/name/nm0080432/"
        },
        {
            "@type": "Person",
            "name": "Ramesh Pant",
            "url": "/name/nm0659760/"
        }
    ],
    "datePublished": "1969-09-27",
    "description": "Arun meets Vandana during a vacation and very soon they secretly get married. Arun is an Air Force pilot and dies in a crash, leaving pregnant Vandana heartbroken--and unable to prove that she is a married mother-to-be. As her mar...",
    "director": [
        {
            "@type": "Person",
            "name": "Shakti Samanta",
            "url": "/name/nm0759662/"
        }
    ],
    "duration": "PT2H49M",
    "genre": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTVjM2M5ZmYtYmU0MC00MzYzLWIwNTktODUyYWMwNWNhODcyXkEyXkFqcGdeQXVyNjc1MzY5NDU@._V1_.jpg",
    "keywords": "love,pilot,wedding,incarceration,female protagonist",
    "name": "Aradhana",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "amiyshrivastava"
        },
        "dateCreated": "2021-03-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065416/"
        },
        "name": "Advent of the Superstar - RAJESH KHANNA.",
        "reviewBody": "I know many film critics will probably lambast me for calling this a Rajesh Khanna movie, but trust me fellas, RAJESH KHANNA truly steals the show here, inspite of the screenplay being heavily dominated by Sharmila Tagore.\n\nRajesh Khanna fits in perfectly in the 2 roles he played (both were very similar characters TBH). His looks, His Voice, His Dialogue Delivery and His Performance was something that'll definitely make you fall for him.\n\nHe brought in the much needed Charm and Style into this movie which is otherwise pretty serious.\n\nDon't get me wrong, Sharmila Tagore did a wonderful job as Vandana Tripathi, first as a young girl in Love and then as a devoted and sacrificing Mother. She rightly recieved her first Filmfare Award for Best Actress for this Performance.\n\nThe Songs are wonderful, especially Mere Sapno ki Rani and Roop tera Mastana. The Storyline is a bit offbeat I'd say, but it keeps you glued to the Screen.\n\nWonderful Direction, Wonderful Music, Wonderful Locales, Wonderful Performances, And of course, The Unforgettable Charisma of Rajesh Khanna......... Highly Recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Arun meets Vandana during a vacation and very soon they secretly get married.Arun is a air force pilot an dies in a crash leaving pregnant Vandana heartbroken.As her marriage was never formalized she decides not to accept the kid her father to dies in between this.Vandana gives birth to her son who gets adopted by a childless couple and she decides to take care of him as her nanny.The child is name Suraj things are well until Shyam starts to eye her an done day while trying to molest her Suraj stabs him .But Vandana takes the blame on her spending rest of her life in jail.Years later she is to be freed from jail and the jailer takes her to his house to take care of her daughter Renu.Renu starts bonding well with Vandana and introduces her to her lover whose none other then Suraj.At the very firs moment Vandana realizes that he is her son whose exact replica of his father Arun.But decides no to break the truth as Suraj might be embarrassed.",
        "duration": "PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1499905817",
        "name": "Aradhana (1969) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTRlZTIyOWItMTNiZS00NWNiLWE2ZTUtYjE0N2M5ZWZjZTk5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTRlZTIyOWItMTNiZS00NWNiLWE2ZTUtYjE0N2M5ZWZjZTk5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-01-22T03:51:39.377Z",
        "url": "https://www.imdb.com/video/vi1499905817/"
    },
    "url": "/title/tt0065416/"
}