{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jôji Nakata",
            "url": "/name/nm0620124/"
        },
        {
            "@type": "Person",
            "name": "Sôichirô Hoshi",
            "url": "/name/nm0395950/"
        },
        {
            "@type": "Person",
            "name": "Houko Kuwashima",
            "url": "/name/nm0476678/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 160,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Argentosoma",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006858/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061915/"
        }
    ],
    "datePublished": "2003-02-06",
    "description": "Undergoing an identity shift following a horrible laboratory accident involving an alien creature known as Frank, a young man joins an anti-alien task force to exact his revenge.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2U0MDM4N2UtMzBhNC00NjQ1LTg1MWQtMTQ3YzFlYWM5MmJiXkEyXkFqcGdeQXVyNjA4MDUzNjA@._V1_.jpg",
    "keywords": "kaiju,anime animation",
    "name": "Argento Soma",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "xamtaro"
        },
        "dateCreated": "2010-09-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0353039/"
        },
        "name": "The Iron Giant with elements of \"Frankstein\" and Evangelion's premise.",
        "reviewBody": "In an alternate future world, a failed space exploration program led to a major invasion by towering golden titans from beyond the stars. Though the initial invasion was repelled, isolated incidents of alien incursions still crop up, all with a similar M.O: the alien titans seem intent on reaching a location in known as \"Pilgrimage point\". The world governments set up the organization known as FUNERAL to repel invasions and prevent any alien from reaching Pilgrimage point. At the same time, ongoing research into the aliens have provided earth with defensive technology known as the SARG mecha.\n\nYes, already the more hardcore anime fans would be screaming at the resemblance this premise has with that of the famous anime Evangelion. But rest assured, the resemblance is only superficial. The production team at Sunrise has taken what could have been a tired clichéd story and presented it in a fresh light, making ArgentoSoma its own organism.\n\nEnter Takuto Kaneshiro, a kind hearted and extremely brilliant young man who, along with his girlfriend Maki Agata, assists their mentor Dr Noguchi in his alien research. Tragedy strikes when an experiment to revive an alien, artificially reconstructed with parts of other dead aliens, goes awry. Takuto is the only survivor, scarred both physically and emotionally. Convinced that the awakening alien killed his girlfriend, Takuto's kind hearted nature gave way to grief, regret and pain. One day, Takuto is visited by the mysterious, Shakespere quoting \"Mr X\", who offers him a chance at revenge. The revived alien has been taken in by FUNERAL and renamed FRANK (as it was constructed from dead body parts similar to Frankenstein's monster) to be used as a last resort weapon against other aliens. In exchange for agreeing to work for Mr X as a double agent, Takuto begins his new identity as Ryu Soma; the stoic, cold ace pilot and latest recruit into the FUNERAL combat team. He is a man with a hidden agenda, that is to sabotage the FUNERAL operations and ultimately destroy Frank. \n\nBoasting a rich, character driven narrative, every single one of the characters, even down to those who would normally be relegated to mere side characters are given ample development. The story takes on a very personal feel as we literally \"get into the heads\" of the FUNERAL team members; their motives, what drives them and what connects them to each other. Take Ryu for example, whose obsession for vengeance has blinded him to new friendships, and slowly eats away at the kind man he used to be. To make matters worse is the introduction of young Hattie Bartholomew, a blond girl who shares an almost magical connection with the alien Frank, and also bears and uncanny resemblance to Takuto's dead girlfriend. Ryu's frustration soon turns to delusion as his two personalities, Ryu Soma and Takuto Kaneshiro, clash. Even the nature of \"Mr X\" is not clearly defined as he is able to appear and disappear almost like a ghost. Is he an actual person? Or just another delusion caused by Takuto's psychological trauma? This seething pot of hatred stands in stark contrast to Hattie's childlike outlook; she adapted to her past trauma not with bitterness but with a kind of psychological regression into her own world of innocent fantasy to the point of referring to Frank as an elf. \n\nSimilar to the alien Frank, ArgentoSoma is composed of familiar parts of different anime series, combined and given new life. The premise is evangelion, the relationship between Hattie and Frank is as heartwarming as \"The Iron Giant\" and the shady alien conspiracies within the higher powers is somewhat like X-files. It is in this almost bizarre combination that Argentosoma becomes its own creature. A lot of attention is paid to making the inner workings of the FUNERAL organization as believable as a real military branch. The combination of personal little character arcs with a grand scale invasion backdrop works well despite its slow pace at times.\n\nThe characters are all really easy to relate to and through them, the show slowly explores themes of psychological withdrawals in the face of trauma, military ethics, political conspiracies and, later in the series, ontological questions about human identity. More common themes of trust, love and loneliness play out along the unraveling mystery right up to the startling revelation about the true nature of the invaders. Adding to the very \"human\" experience is a fine cast of voice actors who play their parts with utmost professionalism. The English dub cast wins out as being more enjoyable only because most of the characters are Caucasian or non-Asian to begin with. Some of the actors also gave their characters accents to match their nationality.\n\nFor a lack of publicity or perhaps a lack of audience interest, ArgentoSoma can easily be considered a \"second tier\" production no doubt overshadowed by SUNRISE's more successful mecha franchises like Gundam. And with good reason too. As clever, complex and emotionally engaging as its story is, ArgentoSoma does not hold that same level of proficiency in its technical aspects. The animation is generally passable for a year 2000 series, but the artwork takes a while to get used too. Especially the character designs which seriously lack noses, thus giving them a very flat and sometimes inhuman appearance. Some episodes, particularly the early ones, do move at a slower pace, but in this case it works in the show's favor, allowing the mystery and tension to build.\n\nCredit goes to the fact that Argentosoma is an original anime screenplay not based on any manga or light novel. If it were only given a higher production budget and more publicity it might have become a true anime legend that withstands the test of time. Alas, most fans may just be content to pick it apart and deride its influences and homages as being \"unoriginal\", never giving ArgentoSoma a chance to touch their hearts and minds.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0353039/"
}