{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Anil Kapoor",
            "url": "/name/nm0438463/"
        },
        {
            "@type": "Person",
            "name": "Preity G Zinta",
            "url": "/name/nm0006689/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1164,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0081527/"
        },
        {
            "@type": "Person",
            "name": "Javed Akhtar",
            "url": "/name/nm0015287/"
        },
        {
            "@type": "Person",
            "name": "Honey Irani",
            "url": "/name/nm0409790/"
        }
    ],
    "datePublished": "2003-05-16",
    "description": "Dr. Siddharth Sinha is a dedicated selfless doctor who dreams of building a state-of-the-art hospital with all the modern instruments and amenities for patient care . His foster son Akash shares his dream . Akash falls in love wit...",
    "director": [
        {
            "@type": "Person",
            "name": "Honey Irani",
            "url": "/name/nm0409790/"
        }
    ],
    "duration": "PT2H38M",
    "genre": [
        "Drama",
        "Family",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmY4MGEzMTktZDI3OC00NzIzLWE1ZDItNjkxNTg0MmE3MmExXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "child in jeopardy,hospital,marriage,doctor,patient",
    "name": "Armaan",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ilpintl"
        },
        "dateCreated": "2003-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0331851/"
        },
        "name": "I desired more from this \"Armaan\"!",
        "reviewBody": "`Armaan', which marks Honey Irani's directorial debut, has a surfeit of high-minded sentiments, some genuinely honest and lovely moments, and unfortunately, also a number of snigger-inducing scenes. Mind you, her direction is charmingly understated, and the leads are truly likable. You have that eminence grise of the Hindi film industry, Amitabh Bachchan, playing the noble Dr. Siddharth Sinha and Anil Kapoor as his equally noble son, Dr. Akash Sinha. Gracy Singh, who was a winsome village maiden in `Lagaan: Once Upon a Time in India', and selflessly stood by her man, plays Dr. Neha Mathur, a winsome anesthetist here, and again selflessly stands by her man. Preity Zinta, that cherubic-looking leading lady, is cast against type and has fun as a spoilt heiress (is there any other kind?), unhampered by scruples or too much clothing, who will do anything to get her way. At one point, she helpfully dons a pair of scarlet horns to show just how diabolical her character is. She has a hoot being devious and gleefully smiles at the camera as she mouths insincere apologies to her rival in love, the upstanding anesthetist. Her angelic face belies her spiteful machinations; she makes a persuasive bitch. Randhir Kapoor, appearing on-screen after a long absence, plays her guilt-ridden tycoon father, who gives in to her every whim to atone for his preoccupation with making money, and in so doing, creates a monster, albeit a very pretty one.\n\nAll of this is fine, except that several of Honey Irani's characters in this film (based on her story; she co-wrote the screenplay, as well) are doctors, and most movie actors, I suspect, are congenitally incapable of convincingly portraying the medical profession. Amitabh has style and panache, and in his role of CEO of this hospital, he has less medical jargon to spout, which helps his credibility enormously. He also makes an extremely dapper ghost; his demise does not prevent him from making several well-dressed and chatty appearances each time his screen son is faced with ethical or emotional dilemmas. However, Anil Kapoor playing a neurosurgeon, in an otherwise competent performance, is at his hokiest when called upon to be doctor-ly. The movie includes a couple of surgery sequences where Anil's character peers flummoxed into his patient's open skull and haplessly mumbles to his cohorts, `This is a very complicated case!'.not the most confidence-inspiring talk from a celebrated neurosurgeon. No number of defibrillators, the glittering array of scalpels and other medical paraphernalia managed to influence me otherwise! Not for a moment did I buy that Anil and Gracy Singh are overworked, put-upon members of the medical profession, especially when after the first messy surgery, they take a song-and-dance break in the bucolic vistas surrounding the hospital. There they finally get the opportunity to discard their drab hospital scrubs, wear true movie-star designer clothing, break into song and be themselves: a Hindi film hero and heroine!\n\nThe strongest points of the movie are the lovely depiction of the father-son relationship--Amitabh and Anil exhibit wonderful chemistry together, the well-etched characters of the principled Dr. Siddharth Sinha, his son, and the willful heiress. Randhir Kapoor makes a welcome return to the screen looking, more than ever, like his father Raj Kapoor during his character actor years. Honey Irani elicits sincere performances from her entire cast and deftly stages the emotional scenes with poignancy. Too bad the story is set in a hospital, and the actors make such awful neurosurgeons and anesthetists."
    },
    "url": "/title/tt0331851/"
}