{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ryôka Yuzuki",
            "url": "/name/nm0951216/"
        },
        {
            "@type": "Person",
            "name": "Hikaru Hanada",
            "url": "/name/nm1097137/"
        },
        {
            "@type": "Person",
            "name": "Yuka Imai",
            "url": "/name/nm0408042/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1197,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "Armitage III: Dual Matrix",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054537/"
        },
        {
            "@type": "Person",
            "name": "Naoko Hasegawa",
            "url": "/name/nm0367943/"
        },
        {
            "@type": "Person",
            "name": "Hideki Kakinuma",
            "url": "/name/nm0435393/"
        }
    ],
    "description": "Five years after the OAV series, Third series robot Naomi Armitage and her husband Ross Sylibus now live peacefully on Mars with their daughter, until a corporation wants to know the secrets of the third's ability to bear children.",
    "director": [
        {
            "@type": "Person",
            "name": "Katsuhito Akiyama",
            "url": "/name/nm0015425/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Animation",
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTUwOTY3Mjg1MF5BMl5BanBnXkFtZTcwODI2MTAyMQ@@._V1_.jpg",
    "keywords": "robot sci fi,female rear nudity,buttocks,child in jeopardy,cg animation",
    "name": "Armitage: Dual Matrix",
    "original_info": {
        "id": "Armitage: Dual-Matrix_2001",
        "name": "Armitage: Dual-Matrix",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2002-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0303678/"
        },
        "name": "Digitally animated action-packed sequel to ARMITAGE III",
        "reviewBody": "ARMITAGE: DUAL MATRIX (2001) is a sequel to ARMITAGE III (1994), a four-part made-for-video Japanese animated series that was also re-edited as a two-hour feature (ARMITAGE: POLY-MATRIX) and shown in the U.S. on the Sci-Fi Channel. (The III in the earlier title is not the mark of a sequel but a reference to \"Thirds,\" a special class of cyborg.) It helps to have seen the earlier production in order to better grasp what's going on in this one, which doesn't stop to fill in the background. Instead it plunges us right into the continuing tensions between humans and robots in this far-off future society in which a growing Mars colony seeks independence from Earth and greater rights for robots. It picks up the characters of Naomi Armitage, a Third, and her human mate, Ross Sylibus, as they lead a quiet life together incognito on Mars with a young daughter, Yoko, after having been fugitives at the end of ARMITAGE III, in which they'd been cops investigating murders of Thirds by anti-robot factions. (The big secret of female Thirds was that they had the power to procreate, which made them such hated targets.)\n\nThe couple's familial bliss is disrupted when a zealous army colonel leads a raid on a secret Earth plant doing illegal robot research and kills the robots and humans working there. Naomi has a connection to the plant and heads to Earth to seek out the perpetrator, Colonel Strings, who turns out to actually work for the Earth Robotronics Corporation, which wants to redirect research away from robots to human cloning. Ross is sent to Earth also, as a Mars delegate to the Chicago Summit to vote on the Robot Rights bill, and he and Naomi soon find they have a common enemy in Demetrio Mardini, an executive with Earth Robotronics. Odds against the couple increase when Mardini sends two powerful new clones of Naomi to stop them.\n\nOn the surface, DUAL MATRIX is an exciting, action-packed thriller bursting with extraordinary high-tech touches dotting this exquisitely rendered futuristic landscape. The digital animation used to render this vision is often quite spectacular, particularly in the plentiful action scenes which range from car chases and shootouts involving high-powered automatic weapons fire to copter attacks and hand-to-hand battles with robot fighting machines. The final stage of the film is particularly riveting as Ross, accompanied by the child, Yoko, tries to make it to the landing platform at the top of a huge spaceport where a shuttle waits to take them all back to Mars while Naomi fights off the two clones.\n\nThe problem for fans of the original is that the science fiction themes that once predominated--questions of identity, status of androids, and ability of human society to coexist with them--are overshadowed here by an emphasis on action elements. Naomi Armitage was originally a much spunkier character who played on the ambiguity of her origins and made viewers care because she seemed human and triggered deep emotions in Ross as they bonded in their efforts to carry out their mission. She joked, laughed, cried, loved and searched desperately for answers. Here Naomi is much less emotional and more of a traditional anime fighting cyborg. She's still a colorful heroine, but most of her screen time is devoted to demonstrating her considerable powers. Ross seems subdued and more in need of protection than he did in the original. Furthermore, the motivations for most of the main characters are not always clear.\n\nThe new one also looks quite different from the original which was still done in the now long ago era of hand-drawn animation. While digital animation (which replicates the two-dimensional look of traditional cel animation) can create all sorts of elaborate effects and details that are most helpful in crafting the suitably dazzling future society on display here, it still lacks some of the vigor and artistry of traditional animation. All anime is done digitally now and I miss the occasional imperfections--the jerky movements and shifts in color that reflected hand-painted work--as well as the bold lines and bright comic book colors that used to burst off the screen. Everything looks so slick and polished now that I tend to get the greatest anime pleasure these days from such older series as \"Kimba, the White Lion,\" \"Star Blazers\" and the original \"Mobile Suit Gundam.\"\n\nDUAL MATRIX is still quite an entertaining 90-minute thriller and will no doubt please many young anime fans, but for those with a special interest in more challenging Japanese sci-fi anime, such as PATLABOR 1 & 2, GHOST IN THE SHELL and SERIAL EXPERIMENTS LAIN, it will be less satisfying, although the impressive visual design may provide some compensation. The English voice cast features one name actress, Juliette Lewis, in the role of Naomi Armitage. (ARMITAGE: POLY-MATRIX had two name actors, Elizabeth Berkley and Kiefer Sutherland, in the roles of Naomi and Ross.) Serious fans of anime are advised to pick up the DVD and opt for the Japanese-language soundtrack."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1723269401",
        "name": "Armitage: Dual-Matrix",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWQ0ZjA3Y2YtMjE4Yi00MzQ2LTg4MWYtY2VlZTNmYTkyY2FhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWQ0ZjA3Y2YtMjE4Yi00MzQ2LTg4MWYtY2VlZTNmYTkyY2FhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:05:15Z",
        "url": "https://www.imdb.com/video/vi1723269401/"
    },
    "url": "/title/tt0303678/"
}