{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Niven",
            "url": "/name/nm0000057/"
        },
        {
            "@type": "Person",
            "name": "Cantinflas",
            "url": "/name/nm0134594/"
        },
        {
            "@type": "Person",
            "name": "Finlay Currie",
            "url": "/name/nm0192958/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28454,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062074/"
        },
        {
            "@type": "Person",
            "name": "James Poe",
            "url": "/name/nm0688117/"
        },
        {
            "@type": "Person",
            "name": "John Farrow",
            "url": "/name/nm0268513/"
        },
        {
            "@type": "Person",
            "name": "S.J. Perelman",
            "url": "/name/nm0673279/"
        }
    ],
    "datePublished": "1956-10-17",
    "description": "A Victorian Englishman bets that with the new steamships and railways he can circumnavigate the globe in eighty days.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Anderson",
            "url": "/name/nm0027183/"
        },
        {
            "@type": "Person",
            "name": "John Farrow",
            "url": "/name/nm0268513/"
        }
    ],
    "duration": "PT2H55M",
    "genre": [
        "Adventure",
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjRhNjVlYTgtODZiOS00OTVhLWE4ZTItZjc3MTFiYWY1YjI5L2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "hot air balloon,race against time,based on novel,london england,gentleman's club",
    "name": "Around the World in 80 Days",
    "original_info": {
        "id": "Around the World in 80 Days: Special Edition_1956",
        "name": "Around the World in 80 Days: Special Edition",
        "year": "1956"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Scaramouche2004"
        },
        "dateCreated": "2005-09-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048960/"
        },
        "name": "The greatest supporting cast in the history of film",
        "reviewBody": "Michael Todd's screen adaptation of Jules Verne's classic novel is a masterpiece.\n\nBeautifully shot in over 100 different locations around the world, it is one of the few novels which actually benefits from big screen treatment. No longer do we have to imagine these fine exotic places in our minds, they are presented here in full cinematic and Technicolour brilliance.\n\nThe great David Niven plays the quintessential English gentleman to the hilt as Philias Fogg, the well to do bachelor who after calmly announcing that it was possible, accepts a £20,000 wager from his fellow Reform Club members to travel round the world in 80 days.\n\nIn tow on this mammoth voyage are newly appointed man servant Passepartout played by Mexican entertainer Cantinflas, a rather miscast Shirley MacLaine as Aouda a recently rescued Indian Princess and the lovable and ever watchable Robert Newton as Mr. Fix the detective who is convinced Fogg is a master criminal who left Britain having just robbed the Bank of England. \n\nYet what adds flavour to an already wonderful story and fascinating movie, is that no matter what corner of the globe our intrepid Fogg appears, he is helped, hindered, slowed down, befriended and attacked by a myriad of world renowned movie stars. Never before or since has a film boasted so many top named stars in cameo appearances.\n\nRobert Morley, Ronald Squire, Finlay Currie, Basil Sydney, Noel Coward, John Gielgud, Trevor Howard, Harcourt Williams, Martine Carol, Fernandel, Charles Boyer, Evelyn Keyes, Gilbert Roland, Cesar Romero, Alan Mowbray, Cedric Hardwicke, Melville Cooper, Reginald Denny, Ronald Colman, Charles Coburn, Peter Lorre, George Raft, Red Skelton, Marlene Dietrich, John Carradine, Frank Sinatra, Buster Keaton, Tim McCoy, Joe E. Brown, Andy Devine, Edmund Lowe, Victor McLaglen, Jack Oakie, Beatrice Lillie, John Mills, Glynis Johns and Hermione Gingold all come along for this bizarre journey. \n\nNow thats what I call a cast list.\n\nNiven is as always a joy to watch as the seemingly unstoppable and resourceful Fogg, so much so that the film can be forgiven its epic length. \n\nHowever, I do feel as though a good half an hour could have been trimmed had Todd decided to tone down some of Cantinflas' over long routines. We know what a fantastic and talented performer he was, there was no real need to hammer the point home with a nigh on 15 minute bull fight sequence, Japanese circus tricks and stunt horse riding. \n\nHowever despite this one criticism, the film is legend, the story is legend and was fully deserving of the five Oscar's it was awarded, including Best Picture of 1956.\n\nIn fact I feel certain that if Philias Fogg had a film like this on DVD, he would have much preferred to stay at home and watch it. I know I certainly would.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT4M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2559950361",
        "name": "Around the World in 80 Days",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzRiYjgzN2EtMmM3OS00Mzg2LTk0ZmQtMTJhZDlmMWM3ZWEzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzRiYjgzN2EtMmM3OS00Mzg2LTk0ZmQtMTJhZDlmMWM3ZWEzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-21T17:03:33.681Z",
        "url": "https://www.imdb.com/video/vi2559950361/"
    },
    "url": "/title/tt0048960/"
}