{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        },
        {
            "@type": "Person",
            "name": "Christopher Walken",
            "url": "/name/nm0000686/"
        },
        {
            "@type": "Person",
            "name": "Josh Lucas",
            "url": "/name/nm0524197/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4380,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106448/"
        },
        {
            "@type": "Person",
            "name": "Jordan Roberts",
            "url": "/name/nm1471001/"
        }
    ],
    "datePublished": "2005-01-14",
    "description": "A bitter, recently divorced man is goaded by his grandfather and son into going on a family road trip to reconcile with his estranged father.",
    "director": [
        {
            "@type": "Person",
            "name": "Jordan Roberts",
            "url": "/name/nm1471001/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4OTEyMTk3N15BMl5BanBnXkFtZTYwMjU2NTY2._V1_.jpg",
    "keywords": "watching tv,trip,bus,on the road,dog",
    "name": "Around the Bend",
    "original_info": {
        "id": "Around the Bend_2004",
        "name": "Around the Bend",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Tubular_Bell"
        },
        "dateCreated": "2006-05-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0384810/"
        },
        "name": "Mindblowing surprise",
        "reviewBody": "I can't give this movie a perfect score, which I reserve for classic, Earth-shattering movies that may truly change one's ways of watching movies. But I give this a high nine, and as it stands, this is one of the very, very few movies that I could watch dozens of times more without ever feeling tired, and wanting more. This is a gripping, fearless movie that instead of drenching itself with tears and syrup, it grips you and plays with your feelings as if it owned you. You'll have to be willing to be taken over, of course, but once you do, you're in for a ride.\n\nHonestly, I find it a bit banal to label this as a \"road movie\". To me, it's a genuinely comical family drama. I had great laughs with this movie, the way it was written and directed, and with the actors' performances, but especially because it wasn't aching to be a comedy. Nothing here looked contrived and forced, and none of the events, no matter how unexpected, felt like it didn't belong there. And we're talking about one interesting plot here. I suppose you can find a good synopsis of the movie elsewhere, so I'd rather settle on the review proper here, instead of giving details of how the movie goes. Suffice to say, it's a powerful story, intelligently written, cleverly paced, directed and acted with talent and care. You see, most times I demand a film to have content, something interesting to say, which this movie certainly has. But I was also delighted and entertaining by the way the movie was told. Being this Jordan Roberts's first effort, I think it's a particularly impressive one.\n\nAs for the actors, you must know them by heart, and if you're a fan of any of them, you won't be disappointed. Yes, Caine's present in only a fifth of the movie's length, but it's a memorable performance alright. Christopher Walken is the main force in the movie, and I really enjoyed his performance and his character, Turner. Lots of fun. Josh Lucas's character, Jason, isn't as immediately striking, but he's quite intricate, and the performance here is just spot on. And of course, the big focus isn't on either of them exclusively, but on their relationship. I just wasn't expecting to be so utterly amazed by Jonah Bobo, though! I was already familiar with his work on the children's cartoon The Backyardigans, doing the voice of my favourite character, no less. But to me, at least, he stole the scene almost every time; even when he didn't say a thing, for he could show only with his facial expressions, his movements and everything else, his character and what he was going through, in particular how curious he was about Turner and how attuned he was getting to him, and vice versa. It's worthy to mention how, in the \"making of\" documentary, we see he's a playful, intelligent and happy kid, and that he can switch into another kid entirely, wholly absorbed by the movie, with so much ease. I can't say the movie couldn't possibly be anywhere below \"okay\" with Jonah in it, and yes, I'm aware Caine and Walken are in it too. But the movie isn't just about that. It's much more. And if people can give up their resistance and make themselves ready for a thrilling, shameless emotional ride, this is a movie I can recommend. It's short, yes, but if you feel it's too short, just watch it again.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2276917529",
        "name": "Around The Bend",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjhkMjQ4YWUtMWFjNy00NWFiLWEwOGYtODcwNzQ5MzAzYmMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjhkMjQ4YWUtMWFjNy00NWFiLWEwOGYtODcwNzQ5MzAzYmMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:07:37Z",
        "url": "https://www.imdb.com/video/vi2276917529/"
    },
    "url": "/title/tt0384810/"
}