{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dudley Moore",
            "url": "/name/nm0001545/"
        },
        {
            "@type": "Person",
            "name": "Liza Minnelli",
            "url": "/name/nm0591485/"
        },
        {
            "@type": "Person",
            "name": "John Gielgud",
            "url": "/name/nm0000024/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6571,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0129767/"
        },
        {
            "@type": "Person",
            "name": "Steve Gordon",
            "url": "/name/nm0330619/"
        },
        {
            "@type": "Person",
            "name": "Andy Breckman",
            "url": "/name/nm0106563/"
        }
    ],
    "datePublished": "1988-07-08",
    "description": "Arthur loses his fortune for staying with Linda, right as the two were preparing to adopt a child. As their marriage suffers, Arthur plans for a way to get his money back, but first he must sober up and get a real job.",
    "director": [
        {
            "@type": "Person",
            "name": "Bud Yorkin",
            "url": "/name/nm0005570/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjRlZmQyNTUtYmY1YS00ZmQ1LTgwMzktZmJhNWVlYTgwOTZjXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "alcoholism,butler,adoption,timeframe 1980s,alcoholic",
    "name": "Arthur 2: On the Rocks",
    "original_info": {
        "id": "Arthur 2: On the Rocks_1988",
        "name": "Arthur 2: On the Rocks",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2003-11-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094678/"
        },
        "name": "He's Back!",
        "reviewBody": "\"Arthur 2: On the Rocks\" is the story of how Arthur (Dudley Moore), the drunken title character, loses his $750,000,000 fortune and sobers up so he can adopt a baby. It starts out very good and right on target, but towards the last 45 minutes the film loses not only all credibility, but also all sense of cohesiveness. It's as if the writer wrote himself into a wall and tried to cut through it with a spoon. I'm not sure if that analogy was any good, but it's a bit better than the end of the movie.\n\nOf course, I haven't seen the original Oscar-winning \"Arthur\" (1981), which may be a part of the reason I enjoyed the first half of \"Arthur 2\" (1988). I still remember when I first saw \"The Fly\"--I had read all the positive reviews, I was really pumped up and after the credits started to roll I just sort of sat back and let out a sigh. But I had already seen its sequel, aptly named \"The Fly II,\" and I had enjoyed it. Why? Because prior expectations can truly ruin a great movie. If I had gone into \"The Fly\" expecting nothing, I probably would have come out of it satisfied. But, in hindsight, I expected too much. And I hadn't expected anything going into \"The Fly II,\" which may amount to why I prefer it to the first film, despite its goofy nature and campy effects.\n\nMaybe that's why \"Arthur 2: On the Rocks\" didn't seem so bad when I watched it. I didn't find a single positive review of the film on the Internet. IMDb's average user rating is currently 3.6, and a year ago it was lower. Rotten Tomatoes' rating is 0%, with not a single positive thing to say. And I can understand why people might not like this movie, but if they think it's one of the worst films of all time...they've got another thing coming.\n\nArthur and his wife, Linda (Liza Minneli), are living freely. They own five homes in and around New York City, and Arthur's only worry in life is that he may get some. Linda, on the other hand, has a single worry: she can't have children, and she wants some. So they visit an adoption agency downtown, run by Mrs. Canby (Kathy Bates), who promises she'll do her best to fix them up with a kid. Joy!\n\nBut then Burt Johnson (Stephen Elliot) buys out Arthur's family company, promising to sell out if Arthur is cut off from the family fortune -- all 750,000,000 dollars. Johnson's scheming is because he wants his daughter, Susan (Cynthia Sikes), to be happy -- and she still wants to marry Arthur. If Arthur divorces his true love, Linda, and marries Johnson's snobby daughter, he can get his money back. But soon Arthur learns that money isn't the most important thing in life.\n\nThis is an interesting premise, of course, but the fact that the entire character of Arthur is one built upon the sole theory that there's nothing to worry about in life is contradictory. If \"Arthur\" were a television show, it would have been a decent half hour of laughs to see him hit the streets in an attempt to sober up. But as a 107-minute film, \"Arthur 2's\" premise just isn't \"Arthur,\" as far as I can tell. At the end, Arthur cleans up and gets sober, and -- without spoiling how -- wins the day (like there were any doubts as to whether that would happen). But the lasting image of a sober Arthur is far from the central idea of the character in the first place.\n\nAnd I must complain about something else I noticed -- something more disturbing than anything else in the film. At the very end, Kathy Bates delivers an adopted baby to the couple as they reunite on the street, only for Linda to announce on the spot that she's pregnant. Wouldn't Mrs. Canby (Bates) take the baby back and give her (the baby, that is) to a couple that can't have children? No, she just smiles and stands back from the scene. This is an example of poor scriptwriting. \n\n\"Arthur 2: On the Rocks\" is a hilarious film in its first half, and a bumbling message-driven snoozer in its second. If only all comedies could sustain laughs at a steady pace throughout. I can't necessarily say that \"Arthur 2\" is a very bad movie, but I can't necessarily say I can recommend it, either.\n\n2.5/5 stars.\n\n\n* John Ulmer\n",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Arthur loses his fortune for staying with Linda, right as the two were preparing to adopt a child. As their marriage suffers, Arthur plans for a way to get his money back, but first he must sober up and get a real job.",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2004599577",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGYwYzQ5NWEtMzdjZS00Mzk3LTg3MGQtMjdiNWZmMjFkNDQ2XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGYwYzQ5NWEtMzdjZS00Mzk3LTg3MGQtMjdiNWZmMjFkNDQ2XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-02-18T14:27:50.171Z",
        "url": "https://www.imdb.com/video/vi2004599577/"
    },
    "url": "/title/tt0094678/"
}