{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Zbigniew Cybulski",
            "url": "/name/nm0194193/"
        },
        {
            "@type": "Person",
            "name": "Ewa Krzyzewska",
            "url": "/name/nm0473109/"
        },
        {
            "@type": "Person",
            "name": "Waclaw Zastrzezynski",
            "url": "/name/nm0953664/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12618,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "Ashes and Diamonds",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016599/"
        },
        {
            "@type": "Person",
            "name": "Jerzy Andrzejewski",
            "url": "/name/nm0029156/"
        },
        {
            "@type": "Person",
            "name": "Andrzej Wajda",
            "url": "/name/nm0906667/"
        }
    ],
    "datePublished": "1961-05-29",
    "description": "As WWII and the German occupation ends, the Polish resistance and the Russian forces turn on each other in an attempt to take over leadership in Communist Poland.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrzej Wajda",
            "url": "/name/nm0906667/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDQ5NGI1NDUtNWI0NS00OWNkLWJlZmMtNmYyYmMwOGI0YmY2XkEyXkFqcGdeQXVyOTk4MjA5NjQ@._V1_.jpg",
    "keywords": "1940s,resistance movement,world war two,soviet troops,russian abroad",
    "name": "Popiól i diament",
    "original_info": {
        "id": "Ashes and Diamonds_1958",
        "name": "Ashes and Diamonds",
        "year": "1958"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "maciosgh"
        },
        "dateCreated": "2006-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0052080/"
        },
        "name": "A masterpiece that should never be forgotten",
        "reviewBody": "First, I've read a book by Jerzy Andrzejewski and then I've seen the movie. After that, I never went back to the book. It was not because it was bad, quite the contrary - it was very good. But the movie by Andrzej Wajda is definitely a masterpiece of Polish movie-making. The main plot of the movie revolves around Maciek Chelmicki, a young idealist who fought against the Germans and then turned to fight against the Communists. He is sent to kill Szczuka, one of The Party's middle rank administrators, by the Polish underground.That's the plot. The movie itself is about a lot of important things, common to all people (but I believe the Polish people will find a few of them more emotionally binding):\n\n1. Nothing is black or white, everything is just a shade of gray \n\n2. Is death, no matter how you try to justify it, senseless? \n\n3. Is it better to live, while on your knees or die standing straight? Or maybe it's better to try to live standing straight? \n\n4. That sometimes it's not war that is hell, it's living through war and trying to live a normal life that is a lot harder (thank God I do not know if it is so)\n\nWajda's movie doesn't give direct answers to any of these questions - each person may watch the movie from a different point of view and get to a totally different conclusion. But even if you're not into psychological movies about war, or noir-movies (and Popiol i Diament is definitely a sort of a noir-movie) it's worth watching for just one scene - the burning vodka glasses at the bar - Cybulski at his best.\n\nAnd lastly - the motto of the movie (and of the book as well):\n\n\"Will ash and chaos be left in the end, that follows a storm into abyss Or may a diamond be found in the ash, a dawn of an everlasting victory\"\n\nCyprian Kamil Norwid\n\nPS: I hope Mr Norwid will not turn in his grave at the quality of my translation but that part of a poem by CK Norwid sums up the movie really well.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0052080/"
}