{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Gross",
            "url": "/name/nm0343472/"
        },
        {
            "@type": "Person",
            "name": "Peter Berg",
            "url": "/name/nm0000916/"
        },
        {
            "@type": "Person",
            "name": "Finola Hughes",
            "url": "/name/nm0001370/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3086,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076240/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059172/"
        },
        {
            "@type": "Person",
            "name": "Patrick Hasburgh",
            "url": "/name/nm0367895/"
        }
    ],
    "datePublished": "1993-01-22",
    "description": "An autoworker and his buddy exit Detroit, move to Colorado, and become popular ski instructors.",
    "director": [
        {
            "@type": "Person",
            "name": "Patrick Hasburgh",
            "url": "/name/nm0367895/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama",
        "Romance",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjEwZWUzOGQtODExZS00Y2NiLWI0ZTgtMWQ4OTI0MDIxZjcwXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "ski instructor,friendship,public nudity,michigan,aspen colorado",
    "name": "Aspen Extreme",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Okonh0wp"
        },
        "dateCreated": "2004-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106315/"
        },
        "name": "A good skiing movie",
        "reviewBody": "*** out of ****:\n\nAs a skier, I'm a little prejudiced to see a movie about skiing, with such good skiing action, and as someone who always thought of Aspen as one of the country's more overrated mountains, I'm happy to see it portrayed in such negative light (no one would ever make such a movie about Vail or Sun Valley, for example). Anyway, on to the film:\n\nThe film centers around two friends stuck in low-paying manual labor jobs, one of which, TJ, suddenly decides to go out and live the American dream. He wants to leave his blue-collar life behind and using his instincts and boldness, attain entrance into the upper echelons of society, in this case, skiing. Knowing he can't do it without his best friend Dexter, by his side, he convinces him in going along. The two embark in Aspen, and fall upon gorgeous women, a job they love, and fame and prestige. Well, at least one of them does. Dexter, although an able skier, does not get the ski instructor job as his friend does, and the two start to drift off onto two different paths. TJ gets all the breaks, and Dexter doesn't, to the point where it tears apart their friendship. One of the big strengths of the movie, was the authenticity and chemistry with which Berg and Gross display as friends, and the interesting, if not somewhat obvious paths, that the two take.\n\nA couple of ladies make their way, into TJ's life on and off, one of which is played very well by Teri Polo, who's drop-dead gorgeous yet down-to-earth in this film, and who provides for one of the films most uplifting moments, when she arrives at Dexter's place right after he's hit rock bottom, and assertively throws his booze away, forces him into the shower, and to go jogging with her, so that he can regain control of his life, even though she always paid a lot more attention to T.J. The story is not afraid to dig into deep levels of tragedy, yet keep a balance, that makes it uplifting overall.\n\nIt's set in 1993, but there's a lot of 80s flavor in this. Along with the synthesizer-dominated score, T.J, is to a lesser extent the kind of Tom Cruise/Mel Gibson/Kurt Russell-like hero, who's just booming with masculinity. He's overconfident, he doesn't back down from a fight (including a fight with a comically villanous ski instructor who feels threatened by other good ski instructors, yeah that happens all the time on the ski slopes), he's strong and resilient, he goes full-force after whatever girls come his way, and he's clearly the good guy. On the whole, it's pretty action-packed and filled with plenty of genuine drama that I really do like it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An autoworker and his buddy exit Detroit, move to Colorado, and become popular ski instructors.",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2096743193",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDhkNzUwZjItMGFlMS00Nzc1LTg4MjEtYjM0NDY4Yzc4N2NjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDhkNzUwZjItMGFlMS00Nzc1LTg4MjEtYjM0NDY4Yzc4N2NjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-05T16:28:55.888Z",
        "url": "https://www.imdb.com/video/vi2096743193/"
    },
    "url": "/title/tt0106315/"
}