{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Austin Stoker",
            "url": "/name/nm0831288/"
        },
        {
            "@type": "Person",
            "name": "Darwin Joston",
            "url": "/name/nm0430944/"
        },
        {
            "@type": "Person",
            "name": "Laurie Zimmer",
            "url": "/name/nm0956633/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 52427,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0676288/"
        },
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        }
    ],
    "datePublished": "1976-11-05",
    "description": "A Highway Patrol Officer, two criminals and a station secretary defend a defunct Los Angeles precinct office against a siege by a bloodthirsty street gang.",
    "director": [
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzVhNDIyOTgtNzNmMy00ZGEyLTliN2UtMTgwNTYyNDJlYTE1XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "street gang,power outage,social decay,inner city,mauser c96 pistol",
    "name": "Assault on Precinct 13",
    "original_info": {
        "id": "Assault on Precinct 13_1976",
        "name": "Assault on Precinct 13",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-02-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074156/"
        },
        "name": "Brilliant, Suspenseful and Beautiful",
        "reviewBody": "Set in gang-riddled Los Angeles in the 1970s, director John Carpenter was inspired to make a film that was basically a combination of Rio Bravo (1959) and Night of the Living Dead (1968) with rookie cop Ethan Bishop in John Wayne's Rio Bravo role/Duane Jones' Ben, a recently vacated police precinct as the small town jail/farmhouse, and with gang members in place of Night of the Living Dead's zombies/Nathan Burdette's men.\n\nFor some viewers, that premise alone may be enough for them to not be able to grant this film a 10, but Assault on Precinct 13 is yet another example of why quality isn't correlated to having unprecedented ideas.\n\nOne of the first striking things about Assault on Precinct 13 is that it looks beautiful. It was made on a relatively low budget, and it looks like a large percentage of the money must have gone into camera rental, film stock and film processing. Douglas Knapp's color cinematography is crisp, innovative (I just love the shot with the camera mounted in front of the car headlight, with the sunset in the background) and marvelously portrays Los Angeles as a gritty, suburban wasteland as well, if not better, than any other film I can think of. What makes it effective isn't over-the-top, run down buildings and heavily populated streets, but vast, wide-open spaces, with squat, nondescript houses and buildings, all fading into nothingness. Knapp even manages to make the streets look like this, and a couple scenes are set in what is effectively a sand-logged desert, with a lonely, dangerous phone booth sitting in isolation. The police station also reflects the suburban wasteland look in terms of its spaces and their relationship to each other, its sparseness and its colors.\n\nThe low budget nature of the film forced a very successful straightforward, brutal and realistic approach to the action, especially the violence. Carpenter, on his commentary track on the DVD, notes that some scenes weren't as he would have liked because they didn't have the coverage they needed, and had to let them play out, longer than normal, from a single angle. Thank the heavens for a lack of time and funding! Despite the over-the-top mayhem in subsequent action films by other directors, the impact of many of the scenes in this film cannot be topped, and it's often because of the unusual, almost documentary-like feel of the film.\n\nAlso adding to the effect is Carpenter's score. Although it's technically primitive, it's just as good as any of his other music, and Carpenter is as talented as a film composer as he is as a director. His use of motifs, often in an almost trance-like repetition, is similar too, and just as effective as, both Bernard Herrmann and Ennio Morricone.\n\nThe performances are all excellent, and the staging is even better. If you know anything about the premise of the film before you begin watching it for the first time, you may have difficulty figuring out how they're going to pull off the central situation of the film. The logistics seem to be against creating a prolonged tense situation. Carpenter and company create the perfect scenario with just a couple ingenious moves, and the unending threat, combined with the unusual pacing of the zombie-like menace make Assault on Precinct 13 as frightening as any horror film could be.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Restored Collectors Edition",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3579577113",
        "name": "Assault on Precinct 13",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzc5ODhiYTQtNzBmMS00Y2U3LWE2YWYtYmQ3NDRhZmQ2Y2ZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzc5ODhiYTQtNzBmMS00Y2U3LWE2YWYtYmQ3NDRhZmQ2Y2ZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-04-11T03:10:05Z",
        "url": "https://www.imdb.com/video/vi3579577113/"
    },
    "url": "/title/tt0074156/"
}