{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        },
        {
            "@type": "Person",
            "name": "Luciana Pedraza",
            "url": "/name/nm1119283/"
        },
        {
            "@type": "Person",
            "name": "Rubén Blades",
            "url": "/name/nm0001952/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3288,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026841/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0020958/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073152/"
        },
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        }
    ],
    "datePublished": "2003-09-04",
    "description": "An aging hitman gets a contract to kill a General in Buenos Aires, Argentina. But when his mark becomes unavailable, he becomes involved in Argentinian tango culture.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA1MzkyNDU2OV5BMl5BanBnXkFtZTYwNjM5NzM3._V1_.jpg",
    "keywords": "salsa music,gringo,weight room,murder contract,contract killer",
    "name": "Assassination Tango",
    "original_info": {
        "id": "Assassination Tango_2002",
        "name": "Assassination Tango",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Wryter47"
        },
        "dateCreated": "2008-04-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283897/"
        },
        "name": "My observations about the film after living here three years",
        "reviewBody": "I love this film so much I bought it in DVD, and in the last three years have shown it to 1) my Argentine wife; 2) her adult children and their friends; 3)several of my Argentine friends, and 4) the cats (who have to watch it while I'm watching it). All except the last have -- to a person -- found it both completely believable and unremarkable in the sense of \"yeah, so what's new?\" in its verisimilitude. The film is just about as crazy as real life is in Argentina, and the police-overruling-police scene is just one example. The conversations in the tango joint about the tango and people and Argentina and life are all about as real as I've witnessed here myself.\n\nThe longer I'm here the more I realize how difficult it is to portray what Argentina is \"really like,\" mainly because it isn't any one thing but a whole mishmash of cultural, historical, economic, and political things that career around in people's lives and their minds and their emotions continuously.\n\nThe only thing I can say for sure is that if you meet anyone -- even an Argentine -- who tells you Argentina and its life and culture are easy to explain, don't believe it.\n\nSomeone said living here is like living a Kafka novel, and sometimes it certainly can feel that way. Conspiracy theory as a way of life has been endemic here, as far as I can tell, since the country first got going. The rural-urban split is real -- the whole City of Buenos Aires votes completely differently from the rest of the country and it doesn't mean a whit of difference except that the federal government becomes even more reluctant to help the capital because its politics are so frequently played out on another planet. And I'm not sure I agree with other comments that Argentines have a big inferiority complex; I think it's more like a \"confusion\" complex, i.e., \"Why don't these other people understand life the way I do?\"\n\nThe film also reminds me a bit of Apochalypse Now in that you just sort of have to watch it -- many times, perhaps -- and realize at the end you're just about as confused as you were when you first saw it, so if you're like me, you accept that, live with it, and are happy to hear any new interpretations that might come along.\n\nFinally, I believe that Argentina is not a comfortable place to live if you're not extremely familiarity with and experienced in living in paradox, confusion, and Isaiah Berlin's theory of \"negative freedoms.\" Thank God, I love it. But I know many don't!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An aging hitman gets a contract to kill a General in Buenos Aires, Argentina. But when his mark becomes unavailable, he becomes involved in Argentinian tango culture.",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi581616153",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTRiZjUyNGQtMTY2NS00OTkxLWFlOGYtNDZlMDMyNGU5NmUxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTRiZjUyNGQtMTY2NS00OTkxLWFlOGYtNDZlMDMyNGU5NmUxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-04-19T14:52:43.216Z",
        "url": "https://www.imdb.com/video/vi581616153/"
    },
    "url": "/title/tt0283897/"
}