{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fletcher Sharp",
            "url": "/name/nm3210928/"
        },
        {
            "@type": "Person",
            "name": "Francine York",
            "url": "/name/nm0948696/"
        },
        {
            "@type": "Person",
            "name": "Sean Morelli",
            "url": "/name/nm0999011/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 117,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0255875/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0235095/"
        },
        {
            "@type": "Person",
            "name": "Ted V. Mikels",
            "url": "/name/nm0586399/"
        },
        {
            "@type": "Person",
            "name": "Cory Udler",
            "url": "/name/nm2944301/"
        }
    ],
    "description": "Demented mutants return with one objective in mind: Kill, kill, kill.",
    "director": [
        {
            "@type": "Person",
            "name": "Ted V. Mikels",
            "url": "/name/nm0586399/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzM1NTMzMTUwMl5BMl5BanBnXkFtZTcwMzI0NDM1Mw@@._V1_.jpg",
    "keywords": "mutant",
    "name": "Astro Zombies: M3 - Cloned",
    "original_info": {
        "id": "Astro Zombies_1969",
        "name": "Astro Zombies",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2011-01-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1662628/"
        },
        "name": "Who in 1969 Would Have Imagined a Trilogy of Astro-Zombies?",
        "reviewBody": "Astro-Zombies: M3 Cloned (2010) \n\n* (out of 4) \n\nEight years after MARK OF THE ASTRO-ZOMBIES, Mikels is back with the third film in the series. This time out the government is working at Area 51 and want to bring the astro-zombies back to life to use in war. One scientist thinks the zombies should be taught good things but sadly the evil wins out and soon the creatures escape the lab and start killing. Yes, they have their machetes. At over 80-years-old you can't help but tip your cap to Mikels for staying in the business for so long and still cranking out movies. With that said, he certainly should have gotten a better story on hand because what we get here is incredibly painful to sit through and especially at 104-minutes. I have no idea why on Earth anyone decided to have a \"Z\" grade, shot on digital video flick run this long as it pretty much kills everything fun that can be found here. There's no question that the astro-zombies are still goofy fun in their own way and seeing them running around in groups is rather campy and fun. Seeing their violent murder scenes is another plus as the machetes go through just about every body part you can think of with plenty of red stuff to follow. That is fun but sadly this doesn't happen until nearly the 80-minute mark and everything that comes before this is just downright boring. Everything dealing with the scientist and her boyfriend is boring. Even more lame is everything trying to connect this film to the earlier movies and we even get a brief appearance of the fake head of John Carradine that showed up in the previous movie. The film goes through all sorts of long dialogue sequences and there isn't a single one that is interesting or entertaining. When people watch stuff like this they want exploitation and not just long dialogue talking about everything under the son. None of the performances are anything to write home about but we do get brief bits by Mikels himself as well as Tura Satana and Shanti. The film has a few clever touches including some of the canned cat food previously seen in THE CORPSE GRINDERS. Also on hand are a new group of Doll Squad members who get to kick the astro-zombies around but again this happens way too late. ASTRO-ZOMBIES: M3 CLONED is another really bad movie in a really, really bad series and is only for those who must watch anything they can."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Demented mutants return with one objective in mind: Kill, Kill, Kill.",
        "duration": "PT1M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1935017753",
        "name": "ASTRO ZOMBIES: M3:Cloned",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTgwOTcwNDYyNl5BMl5BanBnXkFtZTcwNjM5NTI1Mw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTgwOTcwNDYyNl5BMl5BanBnXkFtZTcwNjM5NTI1Mw@@._V1_.jpg",
        "uploadDate": "2010-05-31T03:16:04Z",
        "url": "https://www.imdb.com/video/vi1935017753/"
    },
    "url": "/title/tt1662628/"
}