{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1902,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0172053/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037028/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054564/"
        }
    ],
    "description": "Atmospheric soundtrack follows this compilation of nature footage that focuses on the ocean and various life forms that live, mate and die in it.",
    "director": [
        {
            "@type": "Person",
            "name": "Luc Besson",
            "url": "/name/nm0000108/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTljM2Y1ODMtYWJjZi00YTIxLWEyZDUtMDNjN2FmMmJkODJkXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "underwater scene,ocean,nature,shark,octopus",
    "name": "Atlantis",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TSHunter"
        },
        "dateCreated": "2005-01-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101376/"
        },
        "name": "Hydrolicious",
        "reviewBody": "I just would like to say that this film is quite unique. It is really not a Documentary, per se; it is more like a Special Interest Music Video. To try and explain it to someone who has never seen it, I would say it is like a cross between Jacques Cousteau, Fantasia, & an Enigma CD. Keep in mind there is no dialog other than the introduction at the beginning of the film, so it doesn't matter what language you speak to enjoy this. Frankly, the footage speaks for itself. If you want someone telling you what you see with your own eyes, look elsewhere. But if you want something so lulling it could very easily put you in a state of comatose, this is it. Truly, I fell asleep for at least the first 5 times I saw it. This is not a bad thing, I realized, because it helps you unwind if you had an extremely harsh day. More art than movie, this is a film you might see playing at an exhibit in an art museum. But give it a chance. It has some of the most utterly fascinating underwater wildlife footage and cinematography, with an ambient soundtrack throughout that I think fits it perfectly. It is very possible that you will see things here that you will not see elsewhere. The clarity defies underwater footage, at least that I have seen. I really don't know how they got some of the shots they did. And there are underwater animals that you may have never seen before, as well as tons of fish. If aquatic nature were to produce a music video, it would look like this. So in short, this is a keeper, and one I'm sure to have in my collection. Hopefully you will give it a chance and not write it off because it isn't the Disney film of the same name. 10/10"
    },
    "url": "/title/tt0101376/"
}