{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mike Myers",
            "url": "/name/nm0000196/"
        },
        {
            "@type": "Person",
            "name": "Heather Graham",
            "url": "/name/nm0001287/"
        },
        {
            "@type": "Person",
            "name": "Michael York",
            "url": "/name/nm0001868/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 238706,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048779/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037668/"
        },
        {
            "@type": "Person",
            "name": "Mike Myers",
            "url": "/name/nm0000196/"
        },
        {
            "@type": "Person",
            "name": "Michael McCullers",
            "url": "/name/nm0567112/"
        }
    ],
    "datePublished": "1999-06-11",
    "description": "Dr. Evil is back and has invented a new time machine that allows him to go back to the 1960s and steal Austin Powers' mojo, inadvertently leaving him \"shagless\".",
    "director": [
        {
            "@type": "Person",
            "name": "Jay Roach",
            "url": "/name/nm0005366/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmFkZGQxN2YtODNlYS00MzM5LTk3NjQtNTUxYmQ1YzkwMDhmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "penis joke,spy,sexy agent,sexual joke,parody",
    "name": "Austin Powers: The Spy Who Shagged Me",
    "original_info": {
        "id": "Austin Powers: The Spy Who Shagged Me_1999",
        "name": "Austin Powers: The Spy Who Shagged Me",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mic check"
        },
        "dateCreated": "2000-05-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0145660/"
        },
        "name": "Mr. Mojo rising",
        "reviewBody": "Austin Powers is one of those movies that has become MORE popular as time wears on. Austin's slang has worked its way into the lexicon and everything from the redhot video to the Austin Powers Penis Enlarger is on sale and raking in meeeeeelions. When news of a sequel hit the streets, fans freaked. It's safe to say that AP2 is rivaled only by The Phantom Menace as 1999's must see.\n\nThe wait is over.\n\nThe second-most anticipated movie of 1999 finally comes to theaters. We're ecstatic to report that AP is a friggin' laugh riot, as Myers and crew have strung together another brilliant collection of one-liners and over the top, sometimes horribly disgusting, sight gags. The follow-up to 1997's video hit has Austin heading back to the 60s to track down his mojo, stolen by one of Dr. Evil's comically evil hapless henchmen. What's mojo? A multi-colored, stringy looking mess that makes Austin irresistible to the ladies. But the plot isn't so important. This is the Austin you know and love, only this time he's even more raw and hardcore.\n\nIt's clear that Myers was given a much larger budget to bring his vision to the screen after the runaway success of Austin Powers on video. The sets in Spy are much more vibrant and huge, the effects (yes, effects) are top-notch, and the pacing is completely nonstop. I had a perma-grin stuck on my face through the whole thing and will need to see it again just because the audience drowned out some lines with laughter.\n\n Here Kitty Kitty Kitty Spy picks up with Austin taking a trip in a time machine back to the smashing 60s where, as we all know, he is a sexual dynamo. The time travel bits can get confusing, but as Basil Exposition of British Intelligence says, \"Just sit back and enjoy yourself.\" Back in the 60s, Austin quickly draws the attention of his nemesis Dr. Evil. The hilarity begins as a patchwork parade of moronic henchmen attempt to wipe out Austin.\n\nStill, the best reason to shell out your cash is that AP2 is clearly Dr. Evil's movie. If he's your favorite, you're in luck. Most important, we see him get some.\n\n The film does lean a bit too heavily on gags from the first flick and some of the \"Yeah, baby\" schtick grows old fast. (When your Mammy starts saying \"Yeah, baby,\" it's clearly tired, right?) Still, fans of the original will feel right at home with the budget destructo devices, the horrid teeth, and the clumsy bumblings of Austin himself. In a summer full of high concepts and big budget, AP2 is just the ticket.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi918028569",
        "name": "Austin Powers: The Spy Who Shagged Me",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTY3MTk4MDAtNDY4Ni00ZTRkLTg2M2UtMDM5ZDQ4N2ZlY2NmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTY3MTk4MDAtNDY4Ni00ZTRkLTg2M2UtMDM5ZDQ4N2ZlY2NmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:15:26Z",
        "url": "https://www.imdb.com/video/vi918028569/"
    },
    "url": "/title/tt0145660/"
}