{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Oleg Basilashvili",
            "url": "/name/nm0059847/"
        },
        {
            "@type": "Person",
            "name": "Natalya Gundareva",
            "url": "/name/nm0348039/"
        },
        {
            "@type": "Person",
            "name": "Marina Neyolova",
            "url": "/name/nm0628669/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3413,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "Autumn Marathon",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0917448/"
        },
        {
            "@type": "Person",
            "name": "Aleksandr Volodin",
            "url": "/name/nm0901668/"
        },
        {
            "@type": "Person",
            "name": "Georgiy Daneliya",
            "url": "/name/nm0199381/"
        }
    ],
    "datePublished": "1979-11-23",
    "description": "School teacher is cheating on his wife and lies about it.",
    "director": [
        {
            "@type": "Person",
            "name": "Georgiy Daneliya",
            "url": "/name/nm0199381/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjMxZmI4NDgtYTNkNy00ODhjLThlNzgtNDg0YTQ1MGVhMGEzXkEyXkFqcGdeQXVyNjg3MTIwODI@._V1_.jpg",
    "keywords": "russia,neighbor,alcoholism,alcoholic,language learning",
    "name": "Osenniy marafon",
    "original_info": {
        "id": "Autumn Marathon_1979",
        "name": "Autumn Marathon",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Niffiwan"
        },
        "dateCreated": "2004-11-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079679/"
        },
        "name": "A sad comedy",
        "reviewBody": "This film takes a while to get going, but once it does it's a pretty good film. I strongly recommend it to those who'd like to see how ordinary people lived in the USSR in the early 80s.\n\nThe film takes place in Leningrad (now St. Petersburg), which is Russia's second largest city after Moscow. The cinematographer is this film is a very good one, and there are a lot of great compositional shots... I'd say that the cinematography in this film seems more western than a lot of other Russian films. The editing work and script, by contrast, is not always so good, especially in the beginning of the film (for the first 1/2 hour I didn't even know who the main character was!). The actors are all very believable though, and by the end of the film I pretty much understood everything that I was so confused about at first.\n\nThis film isn't a traditional comedy; it's more of a sad morality tale told with some humour to keep it from becoming depressing. If you liked \"Moscow Does not Believe in Tears\", you may like this movie as well. Interesting to note is that the director was female (EDIT: Sorry folks, he's male. I assumed that the director was Russian, in which case a last name ending with \"a\" would signify a female).\n\nOverall, I'd give it a 7/10. Westerners may want to watch this if they want to see a \"typical\" Soviet movie from the last half of the century. Most critics only notice the more \"avant garde\" movies of Soviet cinema like \"Andrei Rublev\" or \"Battleship Potemkin\", and that becomes people's impression of what Russian movies are like. This is for those who want to see a simple movie about a man's life that can be pretty much universal anywhere; there is no over-the-top patriotism or strangeness in this film and it's a good film regardless. \n\nBTW, the Russian voices are better than the English voice-overs.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0079679/"
}