{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Lemmon",
            "url": "/name/nm0000493/"
        },
        {
            "@type": "Person",
            "name": "Juliet Mills",
            "url": "/name/nm0005236/"
        },
        {
            "@type": "Person",
            "name": "Clive Revill",
            "url": "/name/nm0720890/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10889,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011112/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035095/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066779/"
        },
        {
            "@type": "Person",
            "name": "Samuel A. Taylor",
            "url": "/name/nm0853138/"
        },
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        },
        {
            "@type": "Person",
            "name": "I.A.L. Diamond",
            "url": "/name/nm0224634/"
        }
    ],
    "datePublished": "1972-12-17",
    "description": "A successful businessman goes to Italy to arrange for the return of his tycoon father's body only to discover dad died with his long-time mistress.",
    "director": [
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        }
    ],
    "duration": "PT2H24M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTVkMGRhNjItNzlkMi00MGRlLTlkNTctNzk5ZDc3ZGIxNGYzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "italy,female frontal nudity,blackmail,businessman,mistaken identity",
    "name": "Avanti!",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ackstasis"
        },
        "dateCreated": "2008-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068240/"
        },
        "name": "\"You remember Mussolini?\"",
        "reviewBody": "After decades of dishing out enough cynicism to make a clergyman lose all faith in humanity, I'm almost glad that, by 1972, director Billy Wilder and co-screenwriter I.A.L. Diamond had gotten most of it out of their system. Wilder's fifth film with Jack Lemmon, 'Avanti! (1972),' can only be described as a pleasant comedy  so pleasant, in fact, that our lead character commits adultery seemingly out of politeness. There are, of course, elements of satire concerning foreign policy and the miles of red-tape surrounding international commerce, but the overwhelming emotional tone is one of bittersweet fulfillment. This is a great director approaching the twilight of his life and career, and finally recognising that there is, after all, much goodness in this world, even if one must travel to Italy in order to experience it. Nevertheless, the three major creative talents (Wilder, Diamond and Lemmon) would subsequently return to cynical quickfire screwball with 'The Front Page (1974),' an adaptation of the same play that spawned Howard Hawks' 'His Girl Friday (1940).'\n\nJack Lemmon plays Wendell Armbruster, Jr, a wealthy American businessman who boards the first plane to Italy following the news of his father's death. Wendell Armbruster, Sr was killed in an automobile accident while on his annual pilgrimage to the Grand Hotel Excelsior, where he goes, he says, to rejuvenate in their famous Italian mud baths. It doesn't take long, however, for Wendell to discover that his much-respected father had not died alone, and that his secret English mistress of ten years had also perished when their vehicle ploughed off a winding road and into a vineyard. Pamela Piggott (Juliet Mills), the mistress' open-minded daughter, has also arrived in the country to claim her mother's body, and Wendell treats her poorly, his steadfast morals refusing to acknowledge their parents' liaison for the great love that it was. As the two corpses become embroiled in endless lengths of red tape  including the need to acquire two zinc-lined coffins, and no shortage of obscure contracts to be signed  Wendell and Pamela begin to understand their close connection, and form a touching relationship of their own.\n\nThough the two leads both deliver sterling comedic performances, Clive Revill is undoubtedly the film's highlight as Carlo Carlucci, the world's most accommodating hotel manager. Blessed with political connections of all kinds, and an inability to sleep until the hotel's off-season, Carlo darts endlessly across town to tie up all the loose ends, apparently expecting nothing in return  he's probably Wilder's all-time nicest comedic creation. The narrative style is similar to that of Arthur Hiller's 'The Out of Towners (1970),' in that the story is comprised of many consistently-mounting setbacks, though the overall effect is far less frustrating for the audience and spares sufficient time to allow some important character development. There is also a rather unnecessary subplot involving a deported American immigrant and his disturbingly-masculine girlfriend, and the film, however nice its intentions, does run about half an hour overtime. Nevertheless, 'Avanti!' is a mature romantic comedy with memorable performances and a very enjoyable story; I wouldn't be surprised if it warms to me greatly with repeat viewings.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A successful businessman goes to Italy to arrange for the return of his tycoon father's body only to discover dad died with his long-time mistress.",
        "duration": "PT2M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi936624921",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDUzZDk5YzctOTQ5Yy00OTY4LWI1NTEtNjEyZjQ3ZmYxYmVjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDUzZDk5YzctOTQ5Yy00OTY4LWI1NTEtNjEyZjQ3ZmYxYmVjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-11-24T21:52:32.851Z",
        "url": "https://www.imdb.com/video/vi936624921/"
    },
    "url": "/title/tt0068240/"
}