{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Allison Valentino",
            "url": "/name/nm1910586/"
        },
        {
            "@type": "Person",
            "name": "Rodney Jackson",
            "url": "/name/nm1907267/"
        },
        {
            "@type": "Person",
            "name": "Eric La Brador",
            "url": "/name/nm11747673/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 77,
        "ratingValue": 2.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0151425/"
        },
        {
            "@type": "Person",
            "name": "Leon Hunter",
            "url": "/name/nm1914784/"
        }
    ],
    "datePublished": "2005-06-21",
    "description": "Avia Richards wages a one-woman war against the evil demons hidden amongst us waiting to kill the next person they see. Armed only with a Samurai sword she boldly hunts them down putting her life on the line in a do or die battle,...",
    "director": [
        {
            "@type": "Person",
            "name": "Leon Hunter",
            "url": "/name/nm1914784/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Action",
        "Horror"
    ],
    "name": "Avia Vampire Hunter",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pincake"
        },
        "dateCreated": "2006-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0457285/"
        },
        "name": "Was this meant to be a comedy??",
        "reviewBody": "I have no idea how this movie has a professional looking cover, because it looks like it was made by high school students with mom's camcorder. The crappyness started with the beginning credits which consisted of canned music playing for about 20 minutes in front of a bunch of blurry halloween props and basically naming everyone who even stood near the movie. The movie starts with detectives or something in suits examining a body when Avia comes along and cops an attitude. Then she's in their car and has no idea what's going on. They walk into some nerdy goth kid's house and pull some of the worst stunts and cop etiquette i've ever seen in a movie. And then avia kills some ugly 80's metal guy with fangs (an artistic scene showing her lunging her sword into nothing from 10 different angles). Then all of sudden Rodney \"jamal\" jackson moves in with Avia and they have sex with their clothes on. Avia has a bunch of weird scenes where she runs around with a sword and a dumb look on her face. Then there's a dramatic, heartfelt scene where Jamal finds out Avia used to be in a mental institution and she's wanted for murder, even though he boasted about doing a background check on her before. Some weird stuff happens, Avia takes drugs. I'm not even going to spoil the ending for you.......because I don't even really get what happened. The entire movie makes no sense and there's no plot. It's not a horror or a thriller, it's complete cheese. How anyone decided this was good enough to put in a professional DVD is beyond me. The soundtrack was really generic and nothing even comparable to Danny Elfman. The acting was abysmal (with the exception of jamal, who wasn't THAT bad), not that the characters had a script to work with. Even walking around and silent scenes were murdered by these \"actors\". The funniest scene was one where Avia walks outside dressed in full out Ninja garb (sword included) in the middle of suburbia.....and hails a cab! Only get this movie if you want to laugh at it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A war against evil in this trailer",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi911999513",
        "name": "Avia Vampire Hunter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTIyMGRiODktYTc4MC00YjJkLTk5MmMtY2Q1ZWIyOTY4ODc5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTIyMGRiODktYTc4MC00YjJkLTk5MmMtY2Q1ZWIyOTY4ODc5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-09T09:56:24Z",
        "url": "https://www.imdb.com/video/vi911999513/"
    },
    "url": "/title/tt0457285/"
}