{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sharon Gless",
            "url": "/name/nm0002102/"
        },
        {
            "@type": "Person",
            "name": "Michael S. Berliner",
            "url": "/name/nm0075640/"
        },
        {
            "@type": "Person",
            "name": "Harry Binswanger",
            "url": "/name/nm0083112/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 617,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048675/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029886/"
        },
        {
            "@type": "Person",
            "name": "Michael Paxton",
            "url": "/name/nm0668132/"
        }
    ],
    "datePublished": "1998-02-13",
    "description": "A documentary focusing on the life of novelist and philosopher Ayn Rand, the author of the bestselling novels The Fountainhead and Atlas Shrugged and originator of the Objectivist philosophy.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Paxton",
            "url": "/name/nm0668132/"
        }
    ],
    "duration": "PT2H25M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2Y3NzZkMGYtOTAxMS00ZTMyLTk5N2EtZWQ5MmQwMTNiNzNkXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "jewess,saint petersburg russia,writer,book,freedom",
    "name": "Ayn Rand: A Sense of Life",
    "original_info": {
        "id": "Ayn Rand: A Sense of Life_1998",
        "name": "Ayn Rand: A Sense of Life",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "filmbay"
        },
        "dateCreated": "2008-07-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118662/"
        },
        "name": "Ayn Rand movie suffers a bit from a lack of objectivity",
        "reviewBody": "The memorable, and ultimately appalling, thing about Ayn Rand: A Sense of Life,the new film biography of the right-wing novelist-philosopher, is that it is perfectly true to its subject. Just as Rand, who was born in 1905 in Leningrad as it was convulsed by revolution, declared that she had not changed her ideas about anything since the age of 2½, this reverential documentary presents her thoughts as uncontested truth.\n\nThe evangelical tone is set by filmmaker Michael Paxton, quoted in the press material as saying that he first found Ayn Rand when he was an adolescent trying \"to find a book that would answer all of my questions and give my life meaning.\" A Sense of Life contents itself with interviewing her friends and acolytes. It acknowledges that she was much criticized, and even considered a crank, but her critics don't appear on screen and their views are not explained.\n\nBut neither Rand nor the film should be dismissed, if only because she is widely read and her ideas have been deeply influential. They lie behind much neo-conservative commentary, which recasts democracy -- essentially an untidy contest of ideas and interests -- as a secular religion (she called it Objectivism) where competing points of view are greeted with adolescent impatience.\n\nBut more particularly, Rand's influence helps explain the concealed romanticism of much right-wing commentary, which replaces iconic figures from other belief systems with buccaneering businessmen and entrepreneurs. As this film unwittingly makes clear, Rand herself was one of the great romantics. A worshipper of Hollywood, and partly successful screenwriter, she laments that the film version of her novel The Fountainhead \"lacked the Romanticism of the German films she had loved as a youth.\" That these films were the precursors of fascism seems to have escaped the notice of Rand and her disciples.\n\nThis appealing simplicity, a charming oblivion to her own contradictions, gave Rand a widespread following among those looking for answers, even as it exasperated intellectuals. She believed that each individual has a sacred core of personal talents and dreams which can be expressed in a free society. People may choose to co-operate, but these choices must ultimately serve their self-interest. If an action is truly selfless, she often said, it is \"evil.\" Her reasoning was that selflessness in one's own life can be enlisted by political systems such as communism that call on human beings to sacrifice themselves for the state.\n\nThese views were apparently burned into Rand's consciousness by the horrors she witnessed during and after the Russian Revolution -- a period the film recalls through family photographs and archival film footage. She decided that capitalism was the only hope for mankind. \"Capitalism leaves every man free to choose the work he likes,\" she declares on screen, oblivious to the deadening monotony of most people's jobs, not to mention unemployment.\n\nLike her spiritual successors she prefers the grand and distant vista, and does not approach closely to see the outcasts and victims who are part of every great undertaking. She loved \"the view of the skyscrapers where you don't see the details,\" declares the film, unselfconsciously.\n\nThis made her a formidable popular writer. She was seriously able to declare that Marilyn Monroe seemed to have come from an ideal, joyful world, that the star was \"someone untouched by suffering.\" The hero of her last novel, Atlas Shrugged,was the direct descendant of Cyrus, the hero of a boy's adventure story she read at the age of 16. Like most libertarians, she had a deeply childish world view.\n\nNever beautiful, Rand's intensity (and searching black eyes) seduced more than a few men. According to Harry Binswager, one of her academic admirers, \"her idea of feminity was an admiration of masculine qualities.\" This was also Hitler's idea of feminity, and Rand's screenplays invariably include an idealized hero or heroine standing on a distant promontory, Leni Riefenstahl-style, but these fascinating parallels are of course not examined in A Sense of Life.\n\nRand had a powerful, if not searching, intellect. In many on screen interviews seen in the film, she gives apparently convincing answers to her critics. But the answers are always framed in absolutes -- \"man wants freedom, suffering has no importance\" -- which are essentially empty postulates. But they have an attractive ring.\n\nA Sense of Life is worth seeing because its naive presentation of Rand is consonant with Rand herself. In fact, it feels like nothing so much as an in-house biography of the founder of some fundamentalist religious sect. It acknowledges its subject's imperfections (her infidelity to her husband of 50 years, for example), but only to declare them redeemed by her quest for truth.\n\nRand was, of course, a lifelong atheist. But her work is a testament to the yearning for belief. The film concludes on a lingering shot of a poster for Atlas Shrugged,\"Don't call it hero worship: it's a kind of white heat where philosophy becomes religion.\" Or, perhaps, the ashes that are left when you turn up the temperature on a new belief system to the point where human community and compassion are burnt away. Conrad Alton, Filmbay Editor.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0118662/"
}