{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carroll Baker",
            "url": "/name/nm0004647/"
        },
        {
            "@type": "Person",
            "name": "George Eastman",
            "url": "/name/nm0247642/"
        },
        {
            "@type": "Person",
            "name": "Isabelle De Funès",
            "url": "/name/nm0208494/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2069,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053891/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070239/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0238425/"
        },
        {
            "@type": "Person",
            "name": "Corrado Farina",
            "url": "/name/nm0003165/"
        },
        {
            "@type": "Person",
            "name": "Guido Crepax",
            "url": "/name/nm0187421/"
        },
        {
            "@type": "Person",
            "name": "Giulio Berruti",
            "url": "/name/nm0077460/"
        }
    ],
    "datePublished": "1973-09-20",
    "description": "A photographer finds herself falling under the spell of a witch.",
    "director": [
        {
            "@type": "Person",
            "name": "Corrado Farina",
            "url": "/name/nm0003165/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODdkZmRiYjItYmE4MS00NWRkLWFkY2MtZTBhNTNlZmQ4YWQwXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "fumetti,based on fumetti,woman in jeopardy,giallo,french giallo",
    "name": "Baba Yaga",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2018-02-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069753/"
        },
        "name": "The Seductive Witch",
        "reviewBody": "In Milan, the professional photographer Valentina Rosselli (Isabelle De Funès) takes a ride close to her home with two friends in a party and decides to walk alone in the middle of the night. She saves a dog from a fancy car driver by Baba Yaga (Carroll Baker), a mysterious older woman that insists to drive her home. From this moment on, the life of Valentina changes and she has nightmares and her camera seem to be cursed. She believes Baba Yaga is a witch and that she is under a spell to possess her but her skeptical friend and filmmaker Arno Treves (George Eastman) does not believe. Until the day Valentina visits Baba Yaga´s house.\n\n\"Baba Yaga\" is a film with stylish cinematography, beautiful music score that becomes tiresome after many repetitions, and a storyline typical from the Italian films from the 70´s (especially from Jesse Franco) with eroticism and cult elements such as references to Goddard and \"The Golem\". The conclusion is a plus in this interesting witch movie. My vote is six.\n\nTitle (Brazil): \"Baba Yaga - A Bruxa Maldita\" (\"Baba Yaga - The Coursed Witch\")",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The S&M Classic Restored, Re-graded, Re-edited and Re-Imagined\r\n\r\nThe line between perverted dreams and fevered reality are torn apart as a beautiful witch (Carroll Baker, Baby Doll) gets her sapphic claws into a beautiful young photographer in this rampant adaptation of the classic Guido Crepax comic-book.\r\nNow 35 years after original release director Corrado Farina has re-edited his film exclusively for Shameless, re-inserting footage cut by both the producers and censors, to bring us for the first time his vision as he would really have liked it seen. Restored, Re-graded, re-edited and re-imagined this is Baba Yaga: The Final Cut on a features-packed UK DVD!\r\n\r\nWhen the beautiful Valentina spurns the advances of the enigmatic witch, a curse is put on her camera and all those who pose for her are damned. Pursued by the sensuous seduction of Baba Yaga at every turn, she must either submit to her S&amp;M desires or confront the repressed lesbian feelings buried deep within. Carnal lust explodes as she must choose between external decadence and staid reality, with her very soul at stake as witchcraft casts its spell.\r\n\r\nCombining the haunting atmosphere of Polanski with the sexual styling of Argento on Crystal Meth, it's all here: gorgeous lesbians, Nazi fantasies and even sinister sewing machines! Baba Yaga is 70's Euro-sleaze at its very best, showcasing stunning cinematography and is a must for everyone let down by the distinctly prudish Barbarella when it comes to erotic Euro-comics.\r\n\r\nBaba Yaga: The Final Cut (cert. 18) is released uncut on DVD by Shameless Screen Entertainment. The new edit of the film will be presented remastered in 1.85:1 with choices of either English or Italian 2.0 sound with optional English subtitles.",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2285700121",
        "name": "Baba Yaga",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI2MDI1NTY2NV5BMl5BanBnXkFtZTcwODI2NDYxMw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI2MDI1NTY2NV5BMl5BanBnXkFtZTcwODI2NDYxMw@@._V1_.jpg",
        "uploadDate": "2010-02-04T09:49:57Z",
        "url": "https://www.imdb.com/video/vi2285700121/"
    },
    "url": "/title/tt0069753/"
}