{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Magda Szubanski",
            "url": "/name/nm0844294/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Daily",
            "url": "/name/nm0197354/"
        },
        {
            "@type": "Person",
            "name": "Mickey Rooney",
            "url": "/name/nm0001682/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 34308,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066464/"
        },
        {
            "@type": "Person",
            "name": "George Miller",
            "url": "/name/nm0004306/"
        },
        {
            "@type": "Person",
            "name": "Judy Morris",
            "url": "/name/nm0606688/"
        },
        {
            "@type": "Person",
            "name": "Mark Lamprell",
            "url": "/name/nm0483953/"
        }
    ],
    "datePublished": "1998-11-25",
    "description": "Babe, fresh from his victory in the sheepherding contest, returns to Farmer Hoggett's farm, but after Farmer Hoggett is injured and unable to work, Babe has to go to the big city to save the farm.",
    "director": [
        {
            "@type": "Person",
            "name": "George Miller",
            "url": "/name/nm0004306/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjI4ZDQ3NjktNjQ4Mi00NjU2LWFiZTEtYzhjODNlM2VhYTIzXkEyXkFqcGdeQXVyNDIwODAwNzg@._V1_.jpg",
    "keywords": "hotel,pig,big city,friends who live together,manhattan new york city",
    "name": "Babe: Pig in the City",
    "original_info": {
        "id": "Babe: Pig in the City_1998",
        "name": "Babe: Pig in the City",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-12-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120595/"
        },
        "name": "How to make a sow's ear out of a purse  charmless tat",
        "reviewBody": "Fresh from sheep dog trials success, Babe and Farmer Hogget are the toast of the land. However an accident puts Hogget in traction and leaves the farm dangerously close to being repossessed. Mrs Hogget sets out to America with Babe to attend a major Fare with a large appearance fee, however a misunderstanding at customs results in them missing the fare and being stranded in the city. The pair go to a hotel that illegally takes animals of all sorts but Mrs Hogget's arrest and the capture of the animals leads Babe to once again show determination against the odds.\n\nAt the end of the film Babe, Farmer Hogget says `that'll do pig, that'll do'. It is a wonderfully touching moment that is fitting for such a charming story that was told without malice or clumsy humour  just one warm moment after another. However the studio didn't hear Hogget's words and pumped out a sequel that will have all but the least demanding child clambering to watch the original to wash away the bad taste in their mouths from this. The plot is nothing like the original in theme  it tries to set out it's stall (sorry) as being a tale of how the brave heart overcomes etc but it is nonsense, instead it is more like Home Alone with monkeys than Babe.\n\nThe humour comes with things falling etc and the plot is far too dark and cruel to have anything like the original's charm. It is just plain dull to be honest and I never found myself involved in the hectic going-ons that were occurring before me. Worse still are the characters. On one hand we have a few famous (read American) voices added to the cast (Wright, Rooney and a few I couldn't place) but they don't ever get close to being as good CHARACTERS as the original had. Where the original had animals that we knew or grew to care for as Babe did, here we have comedy monkeys (one alarmingly dressed as an `Nu Yark' hussy!) and dogs that barely get a line. These are animals played for laughs (oh, look at the monkey getting dressed!) and not played as characters as in the first film.\n\nOverall this is not awful it is just very poor and difficult to enjoy. Kids will laugh at the animals chasing humans etc but adults will be unmoved and uninvolved. For me this film was worse than it actually was as it traded on the name of that charming film Babe. It slightly ruined the memory of the original for me with a sour taste and I shall never wish to see this thing again. If you loved the original and were interested in seeing this  don't. Just don't."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1136132377",
        "name": "Babe: Pig in the City",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzVkYzlhOGMtNzI2Zi00ZDBkLTgzOGQtNDU5M2MyOWY0OTczXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzVkYzlhOGMtNzI2Zi00ZDBkLTgzOGQtNDU5M2MyOWY0OTczXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:17:10Z",
        "url": "https://www.imdb.com/video/vi1136132377/"
    },
    "url": "/title/tt0120595/"
}