{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liev Schreiber",
            "url": "/name/nm0000630/"
        },
        {
            "@type": "Person",
            "name": "Karl Benish",
            "url": "/name/nm11842019/"
        },
        {
            "@type": "Person",
            "name": "Ben Bentley",
            "url": "/name/nm0072783/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 231,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030292/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033562/"
        },
        {
            "@type": "Person",
            "name": "Steven Stern",
            "url": "/name/nm0827853/"
        }
    ],
    "datePublished": "1998-08-16",
    "description": "He was perhaps the greatest ballplayer who ever lived. A larger-than-life hero on the field, Babe Ruth's exploits off the field were just as legendary. Don't miss this compilation of rarely seen footage, home movies and revealing ...",
    "director": [
        {
            "@type": "Person",
            "name": "George Roy",
            "url": "/name/nm0747025/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary",
        "Biography",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTczODA1Mjk1NV5BMl5BanBnXkFtZTcwMTcxMzYxMQ@@._V1_.jpg",
    "keywords": "baseball,professional sports,narration,two word title,sports documentary",
    "name": "Babe Ruth",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pavel-8"
        },
        "dateCreated": "2003-06-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0166497/"
        },
        "name": "Very good character study.",
        "reviewBody": "HBO's \"Babe Ruth\" looks, feels, and sounds like a longer version of a chapter of Ken Burns's \"Baseball.\" Many of Burns's techniques are used. Methods like panning along pictures, use of rare archival footage, and interspersing narration with interviews. That's a compliment though, as Burns's work is typically considered the definitive presentation of baseball history.\n\n\"Babe Ruth\" is an exploration of the legend of Babe Ruth, as it concentrates more on the man and the myth rather than his on the field exploits. This is still a fascinating study, but will likely leave fanatics of the game (like myself) wanting for more hard-core baseball information. But the issue there is probably more with my expectations that with the doc itself. It isn't as much about baseball as it is about a pop culture icon who just happened to play the game.\n\nAs an historical character study, the documentary is solid, delving into most all of the Babe Ruth lore you may have heard. It doesn't provide many new tales to someone who has seen \"Baseball\" or knows a decent amount about Ruth, but it does go a little deeper into most of those tales. Stories like Ruth's Called Shot and his promise to the dying boy are addressed, and their veracity is examined.\n\nI appreciated how the documentary did not pander to or worship Ruth. Instead it painted a realistic picture of Ruth's life. Although media at the time often overlooked his personal vices, this film points them out, not maliciously, but as the way things were.\n\nThe personal testimonies are the highlight of the doc. Never have I seen such a collection of people who had personal contact with the Babe in one documentary. From his young 'mascot' to teammates to family to his contemporary media to historical biographers, just about every angle is covered in these interviews. Seeing the eyes of the men and women who provide recollections sparkle as they talk says just as much about Ruth as their words. The man was a giant in many different ways, and these people explain how and why.\n\n(Side note...As a DVD, \"Babe Ruth\" is pretty lame. There is nothing on the disc besides the 60-minute documentary. If you saw the special on HBO, you've seen the disc. I don't recommend purchasing this if you're not an avid Babe Ruth fan, unless you find it cheap somewhere.)\n\nBottom Line: As fine a portrait of Babe Ruth the man as you'll find. 7 of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0166497/"
}