{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael J. Fox",
            "url": "/name/nm0000150/"
        },
        {
            "@type": "Person",
            "name": "Christopher Lloyd",
            "url": "/name/nm0000502/"
        },
        {
            "@type": "Person",
            "name": "Mary Steenburgen",
            "url": "/name/nm0005460/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 456615,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009119/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010110/"
        },
        {
            "@type": "Person",
            "name": "Robert Zemeckis",
            "url": "/name/nm0000709/"
        },
        {
            "@type": "Person",
            "name": "Bob Gale",
            "url": "/name/nm0301826/"
        }
    ],
    "datePublished": "1990-05-25",
    "description": "Stranded in 1955, Marty McFly learns about the death of Doc Brown in 1885 and must travel back in time to save him. With no fuel readily available for the DeLorean, the two must figure how to escape the Old West before Emmett is m...",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Zemeckis",
            "url": "/name/nm0000709/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Adventure",
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjhlMGYxNmMtOWFmMi00Y2M2LWE5NWYtZTdlMDRlMGEzMDA3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "year 1955,time travel,steampunk,back to the future,year 1885",
    "name": "Back to the Future Part III",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "clydestuff"
        },
        "dateCreated": "2004-03-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099088/"
        },
        "name": "Marty, Doc, Zemeckis, And Gale pay homage to the Old West",
        "reviewBody": "Having set a new standard in time travel films with Back To The Future and Back To The Future Part II, it was with eager anticipation that I looked forward to seeing if Robert Zemeckis could bring his trilogy to a satisfying conclusion. To conclude any trilogy in a successful manner some of the key ingredients you need are: 1. do something in your wrap up you haven't done before 2. keep the main characters true to what they have been previously 3. tie up all the loose threads and 4. give us a satisfying ending.\n\nFor this third outing in the series, Zemeckis takes us where we have yet to tread, that being 1885 Hill Valley. With Marty trapped once again in the year 1955, he enlists the 1955 Doc Brown to help him return home. As we know by now, things are never that simple when it comes to Marty and Doc. Marty has no magic ruby slippers to click together three times and say, \"There's no place like home.\" It seems Doc ended up in the Old West, but hid the DeLorean in a cave for Marty to find some 70 years later so he may return home back to 1985 and destroy the time machine. After discovering that Doc met with some misfortune shortly after arriving in 1885 Hill Valley, Marty decides to travel back in time to rescue him. \n\n While BTTFIII does not have the break neck frantic pace of Part II, it is a good film on its own. For the first time, Zemeckis slows things down a bit, making this third film straightforward, yet just as delightful in a lot of ways as the other films. The first thing he does is throw us a little change up. Zemeckis and Gale decide to center the complications of this third film around Doc Brown by having him fall unexpectedly in love with a school teacher by the name of Clara(Mary Steenburgen). In essence, Doc loses his head over a woman and loses his scientific reasoning in the process. It is left up to Marty to become the voice of reason when Doc begins to let his emotions rule his reactions. Yet, Marty seems as a amused as we are by the whole thing. This is one romance that could easily have been the downfall of this film, but thanks to the performances of Steenburgen and Christopher Lloyd, together they develop a chemistry that makes it all work and work to perfection. So by having the majority of the film take place in the old west, then introducing something to the plot we didn't expect, Zemeckis takes care of the first point I mentioned above. \n\n There's also the matter of Buford \"Mad Dog\" Tannen. The meanest, grimiest, filthiest, most ruthless outlaw to ever inhabit Hill Valley. If you liked Thomas F. Wilson's portrayals of Biff, you'll be amazed at his rambunctious portrayal of Mad Dog. He even somehow manages to top his villainous portrayals in the first two films which is not an easy task. So yes, all the characters from the first two films are here in some form or another, and though Doc Brown may be in love, he is still the Doc. This solidly takes care of my second point about keeping the characters true to what they have been before.\n\nZemeckis and Gale have been absolute geniuses in writing these films. In each film they have taken little pieces from the previous films and make them essential to what's happening. For instance, if you've seen the second part there is a short scene that is extremely relevant to what goes on in the finale. When originally viewing it in Part II, I'm sure you never gave it a second thought. When the pay off comes in this film, you can't help but chuckle and say, oh I see. As for my third point about tying up loose ends, they do that and tie up some things we didn't even know were loose ends.\n\nIn Part II, it was necessary for several of the actors to play different roles. This one is no different. Besides being Marty Mcfly, Fox also portrays his ancestor Shamus Mcfly, who is Irish, and again Fox shows his versatility as Lea Thompson does as his wife Maggie. Of course James Tolkan is back as Strickland and theres a couple of good jokes about his character that will surprise you...well at least one of them will surprise you the other will just leave you laughing. As if all this wasn't good enough, Zemeckis also gives us several old western character actors, Dub Taylor, Pat Buttram, and Harry Carey Jr. Another great touch thrown in just for the fun of it.\n\nIn reviewing the fist two parts of the trilogy, I failed to mention Alan Silvestri's terrific score. All three films owe a great deal of their success to it, and the fact that he was able to keep the same theme, yet do variations on it that perfectly fitted each film deserves as much credit as all the others responsible for making this film received.\n\nSo what about point 4, a satisfying ending? Of course, you'll have to see the film to find out for yourself. I can only say that when Part 3 was over I felt a certain amount of sadness that the trilogy had ended. Even now when I watch the three films, I wish there had been a fourth, and a fifth. This was not because the ending of the third film left me unsatisfied in anyway, quite the contrary in fact. It was because I would miss not only the films themselves, but most of all the rich detail and characterizations brought to life for us by a wonderful cast, director, writers and the rest of the crew responsible for enabling us to enjoy one of the most memorable series of films ever. And when you live in my memory forever, you get my grade. For Back To The Future Part III it's an A+. As for the trilogy, there is no grade high enough, no rating high enough, for me to give it the award it so richly deserves.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Back to the Future: 25th Anniversary Trilogy",
        "duration": "PT1M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2184091929",
        "name": "Back to the Future: The Trilogy: 25th Anniversary Trilogy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDJiZTVlMGItNzIzZS00ZThlLTk2NWMtMWQ5OGIwNmZiODliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDJiZTVlMGItNzIzZS00ZThlLTk2NWMtMWQ5OGIwNmZiODliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-10-15T03:06:31Z",
        "url": "https://www.imdb.com/video/vi2184091929/"
    },
    "url": "/title/tt0099088/"
}