{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gael García Bernal",
            "url": "/name/nm0305558/"
        },
        {
            "@type": "Person",
            "name": "Fele Martínez",
            "url": "/name/nm0555093/"
        },
        {
            "@type": "Person",
            "name": "Javier Cámara",
            "url": "/name/nm0194572/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 61435,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Bad Education",
    "contentRating": "NC-17",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071913/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006440/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071642/"
        },
        {
            "@type": "Person",
            "name": "Pedro Almodóvar",
            "url": "/name/nm0000264/"
        }
    ],
    "datePublished": "2005-02-11",
    "description": "An examination on the effect of Franco-era religious schooling and sexual abuse on the lives of two longtime friends.",
    "director": [
        {
            "@type": "Person",
            "name": "Pedro Almodóvar",
            "url": "/name/nm0000264/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmFjNWU1YjMtOWVhZC00OGI4LTgwN2UtNDQ1ODMxZGZmZTFmXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "sexual abuse,pubic hair,sex with a priest,blow job,story within a story",
    "name": "La mala educación",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "alex1975-714-592858"
        },
        "dateCreated": "2010-05-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0275491/"
        },
        "name": "Spanish Film = Superb",
        "reviewBody": "Bad Education is an interesting and dark crime film by Pedro Almodovar. This film has many layers and various dimensions of a story; stories of obsession, role-playing, and revenge. Almodovar's mis-en-scene was the excellent use of bright colors which helped the scenes pop from the screen. These colors were used as a vibrant explosion that helped in the dramatic effect of the stories this film presented. He also used excellent cinematography to lead his audience into this mysterious, bizarre world where graphic simulation of sexual acts was used. When viewing this film, the audience will notice that it is impossible not to get lost in the story played by the characters, because Almodovar augments the width of the image to where the audience will not notice the dimensions of fiction and reality.\n\nAs a viewer of this film, I began to notice several themes. The first theme I noticed was the theme of indifferent attitudes toward women because there were no significant women's parts or roles played in this film, besides the role played in drag. Another theme is that of false identity - the movie's present tense is the 1980s, where a film director Enrique is searching desperately for a new project, hoping to find it by clipping through newspapers, when a young actor comes into his office with a story he's written. The young actor claims to be Ignacio, the boy Enrique fell in love with while they were in a Roman Catholic boarding school together. Although Enrique wanted to believe it to be true, he knew that something was not right. Enrique would eventually find out that Ignacio was not who he thought he was but played with the thought anyway; the theme of falling in love was also prominent in this film as it was shown - the Priest falls in love with Ignacio and the love between two young boys. \n\nIn the end, as a reviewer, I enjoyed all the different art forms that this film presented. The art of mis-en-scene, the art of realism versus fictional and the art of love."
    },
    "url": "/title/tt0275491/"
}