{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Sheen",
            "url": "/name/nm0000640/"
        },
        {
            "@type": "Person",
            "name": "Sissy Spacek",
            "url": "/name/nm0000651/"
        },
        {
            "@type": "Person",
            "name": "Warren Oates",
            "url": "/name/nm0643105/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 74789,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038090/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0219583/"
        },
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "datePublished": "1974-01-05",
    "description": "An impressionable teenage girl from a dead-end town, and her older greaser boyfriend, embark on a killing spree in the South Dakota Badlands.",
    "director": [
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2VhZGExZDQtMTZlOS00OTNmLThjYzktN2VhZDg2ZDA3YzEzXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "serial killer,cult film,on the run,first sex,lovers on the lam",
    "name": "Badlands",
    "original_info": {
        "id": "Badlands_1973",
        "name": "Badlands",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2006-08-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069762/"
        },
        "name": "A slow but rewarding film and an impressive debut",
        "reviewBody": "Based on the Starkweather-Fugate killing spree of the 1950's, this film follows 15 year old Holly Sargis as her quiet, small town existence is changed when she is approached by the 25 year old Kit Carruthers. The pair get friendly as they take walks together but Holly has to keep it a secret from her father, knowing he will disapprove. When her father finds out he shoots her dog as punishment but neither Holly nor Kit are dissuaded from being together. Kit decides to leave town and take Holly with him, when her father tries to stop him he kills him and heads off on the run.\n\nAlthough on the surface this sounds like a lovers-on-the-run film with a serial killer edge, Malick's writing and direction prevents it from just being what you expect as he delivers a memorable debut. I first saw this about 15 years about when I was about 13 or 14 and at the time I only remembered that not a lot happened and that I was quite bored, so I can appreciate why some viewers don't find this to their tastes. Watching it again the other day I found it much more interesting, perhaps because I am older or maybe because I wasn't paying attention the first time. The film is slow but it is very interesting because of the characters that Malick has written and then allowed to develop out over the film. On one side we have the cold Kit who is a cold killer on one hand but breaks into a smile at comparisons with James Dean and the chance of fame. It has been done loads since but the look at the fame-hungry killer here still feels fresh.\n\nOn the other side of the story is Holly. As narrator a lot of weigh is put on her but the way it is done she is more than just a story teller. While the on screen action tells us about Kit, Holly's narration says a lot about her mind. Her fairytale, sing-song delivery and dialogue contrasts really well with the cold, unromantic violence on the screen. Her denial and desire to explain it all away is clear but not forced down the viewer's throat. The cast respond well to the direction and both give restrained but strong performances, avoiding showboating or pushing too hard. Sheen is strong, holding back for the majority and coming out at the end. Spacek is the heart of the story and her innocent (or naïve) character is played well both on screen as well as in her narration. Malick's direction is patient and as dry as the violence. The scenes are blessed with an open (empty) feel thanks to the impressive cinematography.\n\nOverall this is a slow film that is fairly empty if viewed on a superficial level just looking at the narrative. However the characters and the examination of their mindsets is what makes the film interesting and Sheen and Spacek both react well to that. It also helps that Malick has done a great job as writer and director while his cinematographers have produced a barren and pointless landscape to match the heartless and pointless killings."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An impressionable teenage girl from a dead-end town, and her older greaser boyfriend, embark on a killing spree in the South Dakota Badlands.",
        "duration": "PT2M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2689909273",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmVmMzE3YmYtYmRiZi00YjVhLTkxYzQtY2ZhYWQxYmFlNzkwXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmVmMzE3YmYtYmRiZi00YjVhLTkxYzQtY2ZhYWQxYmFlNzkwXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-09-10T14:29:42.778Z",
        "url": "https://www.imdb.com/video/vi2689909273/"
    },
    "url": "/title/tt0069762/"
}