{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Antonio Banderas",
            "url": "/name/nm0000104/"
        },
        {
            "@type": "Person",
            "name": "Lucy Liu",
            "url": "/name/nm0005154/"
        },
        {
            "@type": "Person",
            "name": "Talisa Soto",
            "url": "/name/nm0000650/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20410,
        "ratingValue": 3.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043393/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012408/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052540/"
        },
        {
            "@type": "Person",
            "name": "Alan B. McElroy",
            "url": "/name/nm0568416/"
        }
    ],
    "datePublished": "2002-09-20",
    "description": "Tasked with destroying each other, an FBI agent and a rogue DIA agent soon discover that a much bigger enemy is at work.",
    "director": [
        {
            "@type": "Person",
            "name": "Wych Kaosayananda",
            "url": "/name/nm1126346/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Crime",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkwMDk0OTcyMF5BMl5BanBnXkFtZTYwNzcxMDg5._V1_.jpg",
    "keywords": "one woman army,wu shu,secret agent,stylized violence,standoff",
    "name": "Ballistic: Ecks vs. Sever",
    "original_info": {
        "id": "Ballistic: Ecks vs. Sever_2002",
        "name": "Ballistic: Ecks vs. Sever",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Li-1"
        },
        "dateCreated": "2003-04-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0308208/"
        },
        "name": "It actually sucks the fun of a moviegoing experience.",
        "reviewBody": "1/2 out of ****\n\nI'm not typically a particularly demanding moviegoer when it comes to action films; just give me well-choreographed mayhem set amidst a plot that makes a little bit of a sense or a few engaging characters and I'll probably be reasonably pleased. Ballistic fails to follow even that, which explains why the film bored the hell out of me. I'm almost hesitant to say this, but the latest straight-to-video Jean-Claude Van Damme schlock might actually be better than Ballistic, which was arguably 2002's worst film (I've never seen Rollerball).\n\nThere's something of a plot here, but I'm not entirely sure what the hell was going on. Antonio Banderas plays FBI Agent Ecks, Lucy Liu is Agent Sever, and the two of them are duking it out because they somehow have crossed paths with a wealthy man (Gregg Henry) who is determined to smuggle a small electronic device that can assassinate its intended victim via heart attack. Mixed up in it all is Talisa Soto as Banderas' supposedly dead wife, only she's not really dead. Much mayhen ensues.\n\nBallistic is directed by Kaos, a Thai filmmaker who apparently wanted his movies to live up to his name. This is his first American feature and he shows almost no ability in crafting an action sequence. Martial arts fights that should get the adrenaline-pumping are so stiltedly choreographed, it'll inspire either laughs or yawns. Kaos also goes overboard on the slow motion, ensuring there's never an opportunity for the fight scenes to build momentum. And this is the only film I can think of where the people involved in a car chase actually follow the speed limit!\n\nI feel a bit sorry for the cast here, particularly Lucy Liu, whose martial arts talents are squandered here. To date, she hasn't been much of an actress, but she looks and convincingly acts tough so such a role here must have seemed like a good idea. For Banderas, this is the third film where he has trouble with mysterious women. I've heard of typecasting, but never to such a ridiculous extent. The only thing keeping this guy's career afloat is Robert Rodriguez and that Spy Kids franchise."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT2M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2998403353",
        "name": "Ballistic: Ecks vs. Sever",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODNlOGQ1NmItYjllOS00NWZmLTk3ODAtYjBmNzM1NzYxZjhiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODNlOGQ1NmItYjllOS00NWZmLTk3ODAtYjBmNzM1NzYxZjhiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:20:05Z",
        "url": "https://www.imdb.com/video/vi2998403353/"
    },
    "url": "/title/tt0308208/"
}