{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Astin",
            "url": "/name/nm0000276/"
        },
        {
            "@type": "Person",
            "name": "Jodi Benson",
            "url": "/name/nm0072533/"
        },
        {
            "@type": "Person",
            "name": "Keith Carradine",
            "url": "/name/nm0001018/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3280,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0202966/"
        },
        {
            "@type": "Person",
            "name": "Cliff Ruby",
            "url": "/name/nm0748429/"
        },
        {
            "@type": "Person",
            "name": "Elana Lesser",
            "url": "/name/nm0504327/"
        }
    ],
    "datePublished": "2004-09-30",
    "description": "The mail in the north used to be delivered by dogsled, but the success of airplane delivery leaves Balto and the other sled dogs feeling neglected. However, when a delivery plane crashes on a mountain side, the sled dogs get the o...",
    "director": [
        {
            "@type": "Person",
            "name": "Phil Weinstein",
            "url": "/name/nm0918465/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Animation",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWZmYTBhMzMtMmVjZS00Y2YzLTllMmMtM2NhOGM3ZDc0Yzc5XkEyXkFqcGdeQXVyNDgyODgxNjE@._V1_.jpg",
    "keywords": "balto character,roman numeral in title,direct to video,slimehouse,furry",
    "name": "Balto III: Wings of Change",
    "original_info": {
        "id": "Balto 3: Wings of Change_2005",
        "name": "Balto 3: Wings of Change",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2012-08-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0423849/"
        },
        "name": "Not that bad a sequel",
        "reviewBody": "It is not as good as the first film, which I just love. But it is a notch above the second film, which I personally didn't think was that bad, just the weakest of the three. There are some things that were lacking. The animation is rather rough-around-the-edges, more in the character designs than in the backgrounds and graphics. There are some scenes also detailed in another review that do feel a little random and feel little more than filler. And I really disliked the character of Stella, she was annoying and served no real purpose to the story. However, apart from Stella's song, which I have always found ear-gratingly-bad, the songs are really quite nice especially the credits song. The soundtrack has that mysterious whimsy that fits wonderfully, and the dialogue is thought-provoking and means well. There are also improvements over Wolf Quest, there is a much more coherent story, there is more of the first movie's feel here and Kodi is a much more likable character than Aleu. Other than Stella the characters are great. The voice acting, while not as good as any of that of the first film, is decent. Sean Astin is great as Kodi, and as Balto, while not sounding entirely like Kevin Bacon, Maurice LaMarche again shows what a superb voice actor he is. Jodi Benson is appropriately sympathetic as Jenna, and Keith Carradine brings a certain gruffness to Duke. All in all, not a bad sequel if not on the same level as the original Balto. 7/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0423849/"
}