{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Scott Grimes",
            "url": "/name/nm0342241/"
        },
        {
            "@type": "Person",
            "name": "Damian Lewis",
            "url": "/name/nm0507073/"
        },
        {
            "@type": "Person",
            "name": "Ron Livingston",
            "url": "/name/nm0515296/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 479402,
        "ratingValue": 9.4,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040938/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003158/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005861/"
        }
    ],
    "datePublished": "2001-09-09",
    "description": "The story of Easy Company of the U.S. Army 101st Airborne Division and their mission in World War II Europe, from Operation Overlord to V-J Day.",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3ODc2ODc0M15BMl5BanBnXkFtZTYwMjgzNjc3._V1_.jpg",
    "keywords": "world war two soldier,military,20th century,1940s,weapon",
    "name": "Band of Brothers",
    "original_info": {
        "id": "Band of Brothers_2001",
        "name": "Band of Brothers",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bsmith5552"
        },
        "dateCreated": "2001-11-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0185906/"
        },
        "name": "Realistic WWII Drama With Warts Included",
        "reviewBody": "\"Band of Brothers\" in a word is awesome. I couldn't wait to see each episode. Co-Executive Produced by Tom Hanks and Steven Spielberg, it has the realism, look and feel of Spielberg's \"Saving Private Ryan\" (1998) but with more insight into the characters. Hanks even directed one episode himself.\n\n Told over ten gut wrenching episodes, the story centers on a company of soldiers in the 101st American Airborne Division in WWII from their initial basic training to their landing in France on D-Day to their many battles and ordeals through to the liberation of a concentration camp and finally through to the end of the war.\n\n The soldiers are ordinary people thrust into horrific situations and shows how each is able (or not able) to deal with the situations. The battle scenes are realistic and convincing and the special effects are breath taking. While the series depicts the trials and tribulations of the company, it isn't afraid to show how the war affects seemingly sane and rational men. For example there is a scene where the nominal hero of the story, Winters (Damien Lewis) shoots an unarmed German soldier out of frustration. There is also a scene where a group of German prisoners are cut down by an American officer after he had given them cigarettes. Even after the German surrender there are instances of out and out murder of Germans. This is very rare for an American war story.\n\n The cast is of largely unknown actors, which makes for a more effective telling of the story. There is no John Wayne leading the troops to victory kind of thing. Damien Lewis is very good as Winters who rises through the ranks to lead the company. Ron Livingston plays his friend and second in command, Nixon. Others include David Schwimmer, excellent as the training officer, Scott Grimes as Malarkey the grizzled sergeant and ex New Boys on the Block member Donnie Wahlberg effective as Corporal Lipton.\n\n \"Band of Brothers\" is a story that could only be told in a mini-series. It clearly shows that war really is hell.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Band of Brothers Blu Ray Trailer",
        "duration": "PT2M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3629711385",
        "name": "Band of Brothers",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWIzZTIzMGMtOGViYi00NTQ1LTlkYzctOWYzNGZlYTI1NWM3XkEyXkFqcGdeQWpybA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWIzZTIzMGMtOGViYi00NTQ1LTlkYzctOWYzNGZlYTI1NWM3XkEyXkFqcGdeQWpybA@@._V1_.jpg",
        "uploadDate": "2008-11-07T14:48:47Z",
        "url": "https://www.imdb.com/video/vi3629711385/"
    },
    "url": "/title/tt0185906/"
}