{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel Okrent",
            "url": "/name/nm0645711/"
        },
        {
            "@type": "Person",
            "name": "George F. Will",
            "url": "/name/nm0929547/"
        },
        {
            "@type": "Person",
            "name": "John Chancellor",
            "url": "/name/nm0151253/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4434,
        "ratingValue": 9.2,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023559/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048672/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0083965/"
        }
    ],
    "datePublished": "1994-09-18",
    "description": "A documentary on the history of the sport with major topics including Afro-American players, player/team owner relations and the resilience of the game.",
    "genre": [
        "Documentary",
        "History",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2FmNjM0NzMtYjZjZi00NzQ0LWE5MjMtOWEzOGNmYjZkNmI1XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "american history,timeframe 1900s,sports documentary,baseball sport,1800s",
    "name": "Baseball",
    "original_info": {
        "id": "Baseball_1994",
        "name": "Baseball",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "grantss"
        },
        "dateCreated": "2020-02-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0108700/"
        },
        "name": "Superb documentary series",
        "reviewBody": "The history of baseball, covering the disputed origins of the game, its evolution, historic moments, the key players of each era, regulation changes, the commercial side and societal and community impact as well as controversies and other setbacks.\n\nSuperb documentary series, written and directed by master documentarian Ken Burns. In 1990 Burns wrote, directed and produced the greatest documentary series ever made, The Civil War, and he applies the formula that worked so successfully there to a series on baseball.\n\nOn paper, that shouldn't work. The Civil War was brilliant because of how the story flowed so effortlessly, how accurate and detailed the research was, how every event seemed to have a profound meaning, for the poetic, momentous way the events were described and for the gravitas and pin-point timing of David McCullough's narration. All those things work perfectly for a documentary on a nation-defining, history-changing, ideal-laden war but on something as non-serious as sport? In addition, The Civil War was about 10 hours long. Baseball is 22 hours long. Surely it's just going to be a dull, dry slog?\n\nWell, it works, and it works wonderfully well. Burns turns the history of baseball into something as momentous as the American Civil War. Every key moment and character in its history is discussed with reverence and with a sense of a massive historic event. The research is excellent of course and John Chancellor brings the same level of gravitas and timing that David McCullough brought (with a very similar voice too - I thought it was David McCullough narrating until I read the credits).\n\nAdding to the engagement levels are the interviews. There's who you would expect - baseball historians, former players/managers/administrators and sports writers. But many are not in the baseball profession, but are people from various walks of discussing what baseball means to them. Among the non-experts are actor-comedian Billy Crystal, political commentator Doris Kearns Goodwin and New York Governor Mario Cuomo (who played in the Minor Leagues before getting into politics). All these add a wonderful flavour to proceedings, showing what it was like growing up with baseball, the highs and lows of supporting your team and how baseball is an integral part of US society.\n\nRather than being narrow-focussed, Burns weaves several sub-strands into the series. Most prominent is the segregation that existed in baseball (and the US) between black and white, the effects this had, how it was overcome and the current residual effects. Black players who should have been as big a name as Babe Ruth or Ty Cobb but aren't due to the racist policies of the time, e.g. Satchel Paige and Josh Gibson, are discussed at great length. Jackie Robinson (and the man who gave him his big break, Branch Rickey) is discussed in even more detail. All this gives Burns a much wider canvas on which to work, adding more facets to the baseball story and shows how baseball reflected society and ultimately helped change society for the better.\n\nAnother sub-strand is the continuity of baseball and how it binds generations together. Interviewees talk about how they went to games with their parents or took their kids to games.\n\nIn short: nothing less than brilliant. All this coming from someone from South Africa (and now Australia) who has never played baseball, never attended a live baseball game and only really gets into baseball in the post-season (and then only if a team I like is playing). Makes me wish I had played baseball as a kid...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from PBS",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi28901657",
        "name": "Baseball: A Film by Ken Burns",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjA1Y2E4Y2UtMmJlNC00OTQ5LTg1MjAtODJiMTBiMmJmMjRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjA1Y2E4Y2UtMmJlNC00OTQ5LTg1MjAtODJiMTBiMmJmMjRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:23:51Z",
        "url": "https://www.imdb.com/video/vi28901657/"
    },
    "url": "/title/tt0108700/"
}