{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Taylor",
            "url": "/name/nm0001791/"
        },
        {
            "@type": "Person",
            "name": "George Murphy",
            "url": "/name/nm0614278/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Nolan",
            "url": "/name/nm0634313/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2540,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Robert Hardy Andrews",
            "url": "/name/nm0028826/"
        },
        {
            "@type": "Person",
            "name": "Garrett Fort",
            "url": "/name/nm0287124/"
        },
        {
            "@type": "Person",
            "name": "Dudley Nichols",
            "url": "/name/nm0629580/"
        }
    ],
    "datePublished": "1944-04-15",
    "description": "In 1942, in the Bataan peninsula of the Philippines, a ragtag American unit commanded by Sergeant Bill Dane attempts to blow-up a bridge in order to slow the Japanese advance.",
    "director": [
        {
            "@type": "Person",
            "name": "Tay Garnett",
            "url": "/name/nm0307819/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2UzOTY3NGQtMTE2My00OGJmLWJlMDUtMDYwMWYyYmUwNmRmXkEyXkFqcGdeQXVyNDYzNTI2ODc@._V1_.jpg",
    "keywords": "war propaganda,tropics,u.s. soldier,sabotage,japanese occupation of the philippines",
    "name": "Bataan",
    "original_info": {
        "id": "Bataan_1943",
        "name": "Bataan",
        "year": "1943"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "telegonus"
        },
        "dateCreated": "2001-10-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0035664/"
        },
        "name": "No Spoilers Here",
        "reviewBody": "1943 audiences already knew how Bataan would end before they went to see the film, but they went anyway, since this Tay Garnett-directed combat picture is a rugged tribute to the 'expendable' men of the Philippines of 1942. I can't do better than James Agee's fine review when the movie came out, but would like to add a few things of my own.\n\nRather than try to show the entire evacuation and abandonment of the Phillipines, which would be perhaps overwhelmingly depressing, the film-makers decided to focus on one small, fictional incident that could, in effect, stand in for everything else. They chose wisely. What happens is that we watch a group of soldiers defend and then destroy a bridge, so as to slow down the Japanese army's advance, if only by a few hours, to buy precious time for everyone else. None of these men wants to be a hero. They're all stuck there, and would rather be someplace else. While some are more aggressive than others, no one is wholly brave; and though there is a good deal of nervousness and occasional cowardice, they all pull together admirably in the end. \n\nThough filmed on the Culver City lot, the film cleverly and expressionistic ally suggests a tropical environment. As the story progresses the jungle gets foggier. It was never too inviting to begin with; by the movie's end it is absolutely forbidding. \n\nThe acting is variable. Some of the casting is peculiar. Thomas Mitchell plays a corporal named Feingold, but can't seem to get rid of the slight, American-style brogue that was so much a part of his screen persona. Desi Arnaz has a small role. There is a fairly straightforward presentation of a black man whose color is the least important thing about him. Robert Walker, in what I believe is his first film, has a showy role as a garrulous, yarn-spinning sailor. His character is, I imagine, supposed to be a typically charming, bumptious All-American boy, along the lines, perhaps, of Van Johnson. I find Walker,--who was an excellent actor--obnoxious in the part. Lloyd Nolan is tough as nails as a hard-case soldier with a dark past. \n\nThe movie's biggest asset in the acting department also happens to be its star: Robert Taylor. This pretty boy matinée idol gives a fine performance as the sergeant with a job no man in his right mind would want. And he is in his right mind. Taylor has no vanity in the part. He is as dirty and unshaven as everyone else in the cast, and at times shows flashes of depth and insight that are startling given his lightweight reputation. Taylor pulls the film together, with no Duke Wayne ostentation or posturing, and proves, like the film, to be stronger and truer to life than we might at first have imagined.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In 1942, in the Bataan peninsula of the Philippines, a ragtag American unit commanded by Sergeant Bill Dane attempts to blow-up a bridge in order to slow the Japanese advance.",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3158098713",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDkwNGUxOTUtODYzNy00N2NjLWE0OGEtM2JmYjdhYTMyNDY3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDkwNGUxOTUtODYzNy00N2NjLWE0OGEtM2JmYjdhYTMyNDY3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-06T21:44:34.158Z",
        "url": "https://www.imdb.com/video/vi3158098713/"
    },
    "url": "/title/tt0035664/"
}