{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Lowery",
            "url": "/name/nm0523225/"
        },
        {
            "@type": "Person",
            "name": "Johnny Duncan",
            "url": "/name/nm0242001/"
        },
        {
            "@type": "Person",
            "name": "Jane Adams",
            "url": "/name/nm0011037/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1965,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0713059/"
        },
        {
            "@type": "Person",
            "name": "Bob Kane",
            "url": "/name/nm0004170/"
        },
        {
            "@type": "Person",
            "name": "George H. Plympton",
            "url": "/name/nm0687741/"
        },
        {
            "@type": "Person",
            "name": "Joseph F. Poland",
            "url": "/name/nm0688853/"
        }
    ],
    "datePublished": "1949-05-26",
    "description": "The caped crusaders versus The Wizard, black-hooded mastermind.",
    "director": [
        {
            "@type": "Person",
            "name": "Spencer Gordon Bennet",
            "url": "/name/nm0071560/"
        }
    ],
    "duration": "PT4H23M",
    "genre": [
        "Action",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk3MzU1OTM2Nl5BMl5BanBnXkFtZTgwOTIyODM1MjE@._V1_.jpg",
    "keywords": "gotham city,batman character,bruce wayne character,robin character,dick grayson character",
    "name": "Batman and Robin",
    "original_info": {
        "id": "Batman and Robin: The Serial Collection_1949",
        "name": "Batman and Robin: The Serial Collection",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "redryan64"
        },
        "dateCreated": "2006-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041162/"
        },
        "name": "\"NEW ADVENTURES\" gives Dynamic Duo Complete Make Over",
        "reviewBody": "With the end of World War II, there was a marked change of tone and settings in the film world. This was especially true in that staple of the Saturday Matinée, the Serial. After all,Nazi Germany,Fascist Italy and Imperial Japan had now been defeated. There were no Nazi U Boats, Imperial Japanese soldiers, nor any Axis Spies or 5th Column Traitors to deal with. Now the bad guys would either have to be of the domestic variety of crook. Or, if by chance the baddies were of the international espionage set, their Nationality would have to be kept a secret. Just as before the United States got into the War, the villains country could be implied, but not specifically stated.\n\nThe second Batman chapter-play did follow all of the above mentioned, using a large number of common underworld types and a secret leader of unknown origin and identity (until the end), who was bent on, what else, world domination.\n\nThe cast and production team changed as Columbia had Sam Katzman produce it. Mr. Katzman's Production Company, called ESKAY, was known for the frugality of its productions. Much of its output was done at and released by Monogram Pictures. The best known of these would probably be the EAST SIDE KIDS series, one branch of the DEAD END Family Tree.\n\nThis was the second serial for a comic character;but it was not the first time that it was done. Flash Gordon, Don Winslow, The Spider, Tailspin Tommy, Jungle Jim,The Green Hornet and Secret Agent X9, had all had 2 or more.DICK TRACY leads the pack with four serials. But unlike these others, which may have had one or two changes in cast, the 1949 Batman film cleaned house, leaving no one from the original.\n\nVeteran Robert Lowery, who referred to himself as \"the King of the B's\", was a good choice for Bruce Wayne/Batman. His dead panning of Wayne's dialog contrasted with the so-serious speech of Batman. He possessed the build and obvious athleticism to bring a certain authenticity to the role.\n\nJohn Duncan* had been around doing juvenile roles for several years (including the previously mentioned EAST SIDE KIDS series), and now had matured some, giving him both the youthful appearance and the gymnast-like musculature that Robin would have.\n\nAdditionally, we have all characters and elements taken directly from the comics feature. News Photographer,Vicki Vale (Jane Adams), Alfred the Butler(Eric Wilton) and Police Commissioner James Gordon(Lyle Talbot) were all characters out of the comic book adventures. They reprised the Bat Cave from the '43 version and added The Bat Signal(the bat emblemed searchlight,Batman summoner of Gotham City's sky), albeit in a sort of vest pocket size.\n\nLike many serials, they did employ a hooded mystery man villain as the \"brains\" heavy you know, unknown but having several on screen suspects to keep the audience guessing for 15 chapters.This was okay, or at least adequate, but begs the question: Why not use one of the great colorful villains from the comics pages? The Batman TV of 2 decades later did so, making the series so memorable.\n\nAs for THE NEW ADVENTURES of BATMAN and ROBIN, it ranks far above most serials of its Post World War II period. As well as common crooks and masked super villains, it confronted the Super Nova Explosion of Technological Advancement, a phenomenon of which we still have a lot of apprehension.\n\nNOTE* John Duncan, now a man in his 80's, still makes appearances a various Film Fan conventions around the country. We met him in a Bud & Sharon Courts promoted event, here in Chicago about 2 years ago. He was most energetic and gracious to the fans (including this writer).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0041162/"
}