{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Edward James Olmos",
            "url": "/name/nm0001579/"
        },
        {
            "@type": "Person",
            "name": "Mary McDonnell",
            "url": "/name/nm0001521/"
        },
        {
            "@type": "Person",
            "name": "Katee Sackhoff",
            "url": "/name/nm0755267/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 77066,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0140197/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103971/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107062/"
        }
    ],
    "datePublished": "2003-12-08",
    "description": "Following the destruction of the Twelve Colonies of Kobol by the Cylons, a rag-tag fugitive fleet of the last remnants of mankind flees the pursuing Cylons while simultaneously searching for their true home: Earth.",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjJlYzgzOWUtZmJlZi00ZGM4LTliNzctNWFkNThlMDJhZDQxXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "woman smokes a cigar,time dilation,woman wears a uniform,cylon,survivor",
    "name": "Battlestar Galactica",
    "original_info": {
        "id": "Battlestar Galactica: The Miniseries_2003",
        "name": "Battlestar Galactica: The Miniseries",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nomen_meltdown"
        },
        "dateCreated": "2004-10-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0314979/"
        },
        "name": "Some of the anti-BSG2003 complaints are just crazy",
        "reviewBody": "Besides saying that I really liked the re-imagining of Galactica, I just wanted to point out the madness in one of the recurring complaints I've noticed among fans *and* nay-sayers of BSG2003. I read a lot of people saying \"the new one doesn't have the humour of the original\" or \"it takes itself so seriously, the characters are too serious,\" or things to that effect. \n\nI'm just wondering... how funny do you expect a nuclear holocaust to be?? I mean, writers of fiction are hoping that you can suspend your disbelief and try for a moment to imagine that what you are seeing is real, or could be real. So imagine for a moment, if you can, that you live in NYC and you just heard on the news that H-bombs have started falling from the sky in LA, and they're coming down in waves, west-to-east, and humanity is being utterly wiped out. Millions of people-- men, women and children, perhaps members of your own family, are dying in terror. Are you *really* going to be cracking jokes? Imagine that the human race is quickly being massacred, only a few hundred are managing to escape-- a tiny fraction of what civilization was, and you aren't sure if you're going to survive into tomorrow. Just how much humour is going to be in the air, mixing with the fallout and all? Even before the bombs start falling, all of the \"overly serious\" characters seem to me to have pretty good reasons... Adama's ship is being turned into a museum, effectively ending a major chapter in his military career (which is his life), Apollo's having to face his father, whom he blames for his brother's death, Teague is a drunk (they're not often the cheeriest people), Lauren's just been diagnosed with terminal cancer... you expect these people to be making with the ha-ha?\n\nThe character I did find funniest was Starbuck. Be it because she was a little 'crazy' or because she had the least on her shoulders (besides her boyfriend dying 2 years ago because of a decision she made... hm, may explain the 'crazy' a little, y'think?) to spoil her mood, and what do people say about Starbuck? \"She was too crazy.\" There really *is* no pleasing some people.\n\nArguing that the characters in a story that depicts the extermination of said characters' species are \"too serious\" is... well, it only shows that you either can't do what the writers would like you to do-- and imagine yourself as a part of this world-- or that you can, but you're a suicidal sociopath.\n\nI thought the miniseries was excellent; the re-worked premise made for a more textured story, the characters actually had some depth this time around, and were well-played by actors who obviously tried to 'get' some of the nuances of their characters and could take a serious situation (however imaginary) seriously. And I loved the special effects, too.\n\nSo with all due respect, the puritans who prefer the shallow, campy 70's series with its recycled fx footage, its 2-dimensional characters and it's plot that provides little context or background, can stick their complaints in their old pipes and smoke 'em.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1220083993",
        "name": "Battlestar Galactica",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjU1MDNiNDEtMDMwZC00ZDUyLTlkZWItZjBlYWJiMmY3MDA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjU1MDNiNDEtMDMwZC00ZDUyLTlkZWItZjBlYWJiMmY3MDA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:25:33Z",
        "url": "https://www.imdb.com/video/vi1220083993/"
    },
    "url": "/title/tt0314979/"
}