{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Henry Fonda",
            "url": "/name/nm0000020/"
        },
        {
            "@type": "Person",
            "name": "Robert Shaw",
            "url": "/name/nm0001727/"
        },
        {
            "@type": "Person",
            "name": "Robert Ryan",
            "url": "/name/nm0752813/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17007,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079079/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0110887/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        },
        {
            "@type": "Person",
            "name": "Milton Sperling",
            "url": "/name/nm0818328/"
        },
        {
            "@type": "Person",
            "name": "John Melson",
            "url": "/name/nm0578367/"
        }
    ],
    "datePublished": "1966-01-28",
    "description": "A dramatization of Nazi Germany's final Western Front counterattack of World War II.",
    "director": [
        {
            "@type": "Person",
            "name": "Ken Annakin",
            "url": "/name/nm0002175/"
        }
    ],
    "duration": "PT2H47M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDEzMWI4ZWMtNGFiMy00M2QzLTlhZWUtY2QwZTcyYzMwODAwXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "wehrmacht,battle of the bulge,world war two in belgium,year 1944,cold weather",
    "name": "Battle of the Bulge",
    "original_info": {
        "id": "Battle of the Bulge_1965",
        "name": "Battle of the Bulge",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sddavis63"
        },
        "dateCreated": "2016-09-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058947/"
        },
        "name": "A Lot Of Historical Inaccuracies, But Not A Complete Waste Of Time",
        "reviewBody": "A few years before this was released, there was \"The Longest Day\" - a movie version of the Allied invasion of Normandy in 1944. That was a very good movie with a star-studded cast. I'm guessing that \"Battle of the Bulge\" was an attempt to unofficially follow up on that movie. It's not as star-studded (although there's a bit of cross over in the cast, most notably Henry Fonda.) Truthfully, though, this movie is nowhere near as good as \"The Longest Day.\"\n\nIt's supposed to be an account of The Battle of The Bulge, which took place in December of 1944. It was the last significant German offensive of the war, intended to break through the Allied lines and re- capture the port city of Antwerp, Belgium - thus throwing Allied supply lines into chaos. The movie gets some things right. The Germans did, indeed, get troops disguised as American MPs behind the American lines, and they were able to cause confusion and chaos. The Germans were also woefully short of fuel, and had targeted an American supply depot which would have given them access to a huge amount of gasoline for their tanks. The famous demand for the surrender of Bastogne, and the reply of the commanding American general to that demand - \"NUTS!\" - is accurate. But there are also a lot of problems with the historical accuracy of the film. First is that all of the characters are just that - characters. Composites, perhaps, but there's no portrayal of anyone who actually fought in the battle. There's also no mention at all of General George Patton's 3rd Army dramatically saving the besieged Americans at Bastogne. That's one of the better known incidents of the Battle of the Bulge, and why you wouldn't even mention it is beyond me. Many, of course, note the problem that the tanks used in the movie were of a much later vintage, and were't an accurate representation of the tanks that would have been used.\n\nAt best, I'd say that this movie was OK. Terrible if you're thinking that you're learning much history from it, but OK as a movie that's somewhat dramatic, and I thought it was a reasonable portrayal of the ugliness of war - the Malmedy massacre (the cold blooded murders of Americans who had been taken prisoner by German SS troops) was portrayed, for example. \n\nI'd definitely say that if I were going to watch either again, I'd take in \"The Longest Day.\" It's the better movie. This one gets a 5/10 from me.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi226474521",
        "name": "Trailer [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTNlYzQwNDMtZjBkMS00ODUwLTkwZTktZGI0NjY2ODM5NDRmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTNlYzQwNDMtZjBkMS00ODUwLTkwZTktZGI0NjY2ODM5NDRmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-02-08T14:24:44.240Z",
        "url": "https://www.imdb.com/video/vi226474521/"
    },
    "url": "/title/tt0058947/"
}