{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Van Johnson",
            "url": "/name/nm0004496/"
        },
        {
            "@type": "Person",
            "name": "John Hodiak",
            "url": "/name/nm0388303/"
        },
        {
            "@type": "Person",
            "name": "Ricardo Montalban",
            "url": "/name/nm0001544/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7505,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Robert Pirosh",
            "url": "/name/nm0685265/"
        }
    ],
    "datePublished": "1950-01-20",
    "description": "True tale about a squad of the 101st Airborne Division coping with being trapped by the Germans in the besieged city of Bastogne, Belgium during the Battle of the Bulge in December of 1944.",
    "director": [
        {
            "@type": "Person",
            "name": "William A. Wellman",
            "url": "/name/nm0920074/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Action",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTYzOGIyNGQtZDljZi00NGYzLThkOTktNzNhMTM1M2Y1NDlhL2ltYWdlXkEyXkFqcGdeQXVyNDQzMDg4Nzk@._V1_.jpg",
    "keywords": "year 1944,cold weather,world war two in belgium,american abroad,u.s. soldier",
    "name": "Battleground",
    "original_info": {
        "id": "Battleground_1949",
        "name": "Battleground",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "smiley-39"
        },
        "dateCreated": "2001-05-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041163/"
        },
        "name": "Christmas crisis in the Ardennes, December 1944",
        "reviewBody": "This is not a large scale multi-million dollar epic of World War Two. No thousands of extras, no wide panoramic sweep of battle scenes. This says more about The Battle of the Bulge than the movie of the same name. It's just an ordinary black and white M.G.M. production. What it lacks in size and scope it makes up for in impact.A simple story very well told, of a squad of GI's of the 101st Airborne Division, thrown into the maelstrom that was the German offensive in the Ardennes in December of 1944 against the Allied ground forces. \n\nIt's hard to believe that this film was not shot on location; but on a Metro sound stage. And Metro's Culver City was turned into the only outdoor location for the snow-covered, rubble-strewn town of Bastogne under siege, which was tenaciously held by the 101st, under the command of Brig. General Anthony McAuliffe. \n\nWith the exception of Van Johnson as Pvt. Holly who was high profile on the Metro lot in his time, and George Murphy as Pvt. Stazak, the rest of the cast were character-type actors who filled their roles perfectly. James Whitmore as Sgt. Kinnie is drilling the squad in the opening scenes. \n\nThe squad members talk of an enjoyable furlough in Paris which is suddenly cut short by the German breakthrough in the Ardenne. Ptv. Stazak hopes of going home are dashed because his authorised documents have not come through before the squad moves up front. Douglas Fowley as Pvt. Kippton seems to be the best in the squad at bellyaching.Maybe it's his dentures that make him a sourpuss. But Fowley's dentures turn into a class act; clicking away to the old song, \"I Surrender Dear,\" through the courtesy of a German propaganda broadcast heard over the radio in a Sherman tank. Denise Darcel comes as a welcome relief of feminine pleasure; not out of place in the town of Bastogne itself. In an indoor scene, Pvt. Holly's eyeballs go into left-to-right overdrive as he stares at Denise's buxom rear end descending a flight of stairs. Then there's Holly again, nursing stolen newly-laid eggs, as valuable as gold nuggets. He's about to scramble them over a fire when the squad is told to saddle up and move out. Not for the first time does Johnson (Pvt. Holly) yell, \"oh no!\" A expression he's used in past movies also. The broken eggs in his upturned helmet are now a problem. In the end it's disaster. The German artillery scramble the eggs for Holly. Problem solved! \n\nOn a three man patrol, Holly, Hodiak as Janness, Montalban as Rodriguez, intercept and force a jeep carrying a Major and two sergeants to stop and identify themselves. The knowledge that Germans are infiltrating in GI uniforms has made the patrol suspicious so the Major is asked how the Dodgers made out in 1944. The Major hesitates,but the Sergeant in the rear seat asks Holly who Betty Grable is married to. Montalban shouts back, \"Cesar Romero\". The Major says Romero is out. \"Betty Grable is married to Harry James\". The tense atmosphere relaxes. The patrol is convinced they're friendly. \n\nWhat is displayed authentically on this studio sound stage is the icy, bone-chilling atmosphere of the battlefield. The men hunkered down; the deeper the better, in their foxholes. Throughout nearly all this movie there is the constant rise and fall in the background of continuous artillery fire, like a rolling thunder. It never seems to cease. Sometimes it's close, sometimes distant. That, along with the freezing fog hanging like a thick whitish-grey blanket in the air, enveloping everything, gives off an atmosphere of crisis; a feeling of fearful tension. The men endeavour to dispel the fear with humour. Waiting and wondering when the enemy will appear ghost-like out of the mist-shrouded forest. \n\nNear the end of the movie, Leon Ames gives a good performance as a Army Chaplain. Trying to explain the reason for this necessary trip to Europe, to kill off a murderous political system that has already killed off millions. Before the end, the tables turn in the Allies favour. Sergeant Kinnie notices his shadow against the snow. The sun is breaking through and the mist rises. Allied tactical air power is back in business again with a vengeance.\n\nVeteran director William Wellman was not found wanting when he directed this movie. He had already proved himself with, \"The Story of GI Joe\", in 1945. Antiwar film? Any war film well made and convincing can be antiwar, and you do not need blood all over the silver screen to prove it. Antiwar or not, World War Two was a \"popular\" war. The reasons stuck out a mile. The Army Chaplain said so in so many words. \n\nThe Ardennes offensive caught the Allies unawares, in short, too cocksure. By late 1944, battered the German forces may have been. But they still had a few nasty shots in their locker to scare the living daylights out of the Allied Command. The allies paid the penalty in lost ground and casualties for General Eisenhower's insistence for a broad front advance. We thought the Germans had run out of fighting steam, but old Field Marshal Karl Rudolf Gerd Von Rundstedt thought different!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi658096153",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDU1YTcwY2UtY2M0NC00M2JiLTlkMTktNzVjNWIwNzVlNmQyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDU1YTcwY2UtY2M0NC00M2JiLTlkMTktNzVjNWIwNzVlNmQyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-06-03T19:05:27.491Z",
        "url": "https://www.imdb.com/video/vi658096153/"
    },
    "url": "/title/tt0041163/"
}