{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paige O'Hara",
            "url": "/name/nm0641314/"
        },
        {
            "@type": "Person",
            "name": "Robby Benson",
            "url": "/name/nm0000913/"
        },
        {
            "@type": "Person",
            "name": "Jesse Corti",
            "url": "/name/nm0181425/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 461390,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008970/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0133018/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074039/"
        },
        {
            "@type": "Person",
            "name": "Linda Woolverton",
            "url": "/name/nm0941314/"
        },
        {
            "@type": "Person",
            "name": "Brenda Chapman",
            "url": "/name/nm0152312/"
        },
        {
            "@type": "Person",
            "name": "Chris Sanders",
            "url": "/name/nm0761498/"
        }
    ],
    "datePublished": "1991-11-22",
    "description": "A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love.",
    "director": [
        {
            "@type": "Person",
            "name": "Gary Trousdale",
            "url": "/name/nm0873779/"
        },
        {
            "@type": "Person",
            "name": "Kirk Wise",
            "url": "/name/nm0936374/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Animation",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzE5MDM1NDktY2I0OC00YWI5LTk2NzUtYjczNDczOWQxYjM0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "rose,castle,france,prince,fairy tale",
    "name": "Beauty and the Beast",
    "original_info": {
        "id": "Beauty and the Beast: Special Edition: Bonus Material_1991",
        "name": "Beauty and the Beast: Special Edition: Bonus Material",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2005-03-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101414/"
        },
        "name": "Classy piece of animation",
        "reviewBody": "When an arrogant Prince turns away an old woman looking for shelter with only a rose for a gift, she warns him not to just take the surface appearance as being the all of a person; however he rejects her a second time  only for her to reveal herself as a beautiful enchantress. She casts a spell on him, turning him into a beast with the only hope of return being to fall in love with a woman and have her fall in love with him before the rose wilts and dies. Resembling a carpet stuffed with walnuts, the prince figures he has no chance and withdraws into his castle. When an elderly man wanders into the castle, the Beast holds him prisoner and only lets him go when his daughter, Belle, offers to replace him in the Beast's castle. With time running out, the Beast's staff hope that Belle will be the one to break the curse but the Beast cannot remember how.\n\nBeing quite a cynical, acerbic person I must admit that I prefer modern animated films that deliver lots of adult humour along with a good emotional story and often I struggle to enjoy films that take the more traditional Disney route. However with this film I was quite taken by how classy the whole affair was, with great effort being shown in every area from the animation, to the songs through to the emotionally involving story whose telling is touched with a nice sense of wonder throughout. The story doesn't really hit many bum notes (I thought Gaston's sidekick was a bit too obvious and half cooked) and it is interesting and enjoyable for the vast majority of the time. The story and comedy is aimed at both adults and children  but the stuff for kids is not basic pratfalls, nor is the adult material just a load of references or suggestive jokes. Instead the two are quite well blended with good physical comedy and plenty of wit. Again, it is the sense of spectacle and wonder that came through that I really appreciated.\n\nThe animation feels more impressive for the reliance on mostly traditional animation rather than computer effects  in fact the computer effects look a bit dated now, even if they do still produce the goods in some key scenes. Mainly it is the feeling that every frame has had a lot of effort and love put into it that makes the whole affair feel classy. The songs are also great and feature quite a few memorable songs that stick in the mind; meanwhile the choreography of these scenes is generally very imaginative (Be Our Guest was my favourite). The cast don't feature many big stars and perhaps this is good because the real people don't distract from their characters. That said, I thought that Benson, O'Hara, White and a few others were quite unremarkable even if they were good enough for the film. Orbach, Stiers, Lansbury and others provided comic work in the support characters and everything worked well.\n\nOverall this is a really classy animated film that shows the effort and care put into it in many different regards. It does suffer a bit from cuteness and sentimentality but I didn't think this was a massive problem or something that was not to be expected from Disney and generally I really enjoyed the film and see it as one of the films that define Disney for people of my generation."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Belle, whose father is imprisoned by the Beast, offers herself instead and discovers her captor to be an enchanted prince. ",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1040490009",
        "name": "3D Re-release Version",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTA2MjU2MDkxOV5BMl5BanBnXkFtZTgwOTE2ODMzMzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTA2MjU2MDkxOV5BMl5BanBnXkFtZTgwOTE2ODMzMzE@._V1_.jpg",
        "uploadDate": "2011-11-24T12:20:54Z",
        "url": "https://www.imdb.com/video/vi1040490009/"
    },
    "url": "/title/tt0101414/"
}