{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "description": "The magical story of a beautiful young woman named Beauty whose family were at one time wealthy merchants and how through great family misfortune and drama she finds herself living in a palace with a grotesque beast.",
    "duration": "PT50M",
    "genre": [
        "Animation"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzhkODYyNTMtODA3Mi00ZjcxLTk3YTktN2Y1MWY4NGIyMjI2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "name": "Beauty and the Beast",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2019-05-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0237031/"
        },
        "name": "More beastly than beautiful",
        "reviewBody": "Again like was said for the very bad Burbank Animation Studios version (one of the worst from that studio), this is being said with a very heavy heart as the story is timeless and there are some good and more adaptations of it. Disney's may not be the most faithful, but that doesn't stop it from being one of my favourite films while 1946's 'La Belle et La Bete' is also stunning. If you haven't seen the latter, it is not recommended highly enough.\n\nGolden Films is also an inconsistent studio. Still have a fondness for 'Thumbelina', 'The Little Mermaid', 'The Three Musketeers', 'Pinocchio' and 'The Princess Castle', but others are mediocre or less. Those including 'Tarzan of the Apes', 'Hercules', 'The Jungle King', 'The Hunchback of Notre Dame' and 'Anastasia'. This is down there with the studio's worst and along with the aforementioned version from Burbank is one of the worst adaptation of 'Beauty and the Beast'. Am not sure which one is worse of the two, this has the better animation, Beast is a little less annoying and looks and sounds slightly better, doesn't have over-explanatory narration and this has the better handled garden scene (not as cheesy). This also though has the ghosts, some inappropriate music, more overlong and pointless scenes and even less chemistry between Beauty and the Beast which was a major problem in the other animation.\n\nThere are a few good points. Beauty is a beautiful and likeable character, actually find her more likeable and more interesting here so that's another improvement to the other version. Despite being one of Golden Films worst, their 'Beauty and the Beast' is actually one of their best looking. Some very nice colours and backgrounds that have vibrancy and detail. The drawing has moments of smoothness, even if the finesse isn't there.\n\nDespite being overlong and coming out of nowhere, Beauty's song was sweet and had a pleasant melody.\n\nHowever, the rest of the characters are poorly handled. Have never been more irritated by any depiction of Belle's father of any 'Beauty and the Beast' adaptation and that's his voice alone. Beast is generally an improvement over Burbank's version, he doesn't look as weird, showed a little promise in his initially quite suspenseful first appearance and sounds a little more appropriate and less of a spoiled child. How he's characterised however is still a failure, his voice is also too reminiscent of someone involved in criminal activity on the telephone trying to disguise their voice and like the Burbank version he fails as either being a menacing (apart from one scene) or sympathetic character. There is like that version very little development to him, and he does come over as too mean in his treatment of Beauty and refuses help and criticism. He and Beauty have very little chemistry and their relationship has barely anything to it and doesn't grow, the latter parts feeling rushed. Part of it is down to that they are over-beared by the music and especially the ghosts. The ghosts are unbearably irritating, their antics slows everything down and they mostly add nothing to the story. Probably the most annoying character in a Golden Films animation, alongside the lead character in 'The Jungle King'\n\nWhile the classical music on its own terms is amazing, it's the way it is used and its placement that are problems and those are things that didn't bother me on the whole in other Golden Films animations. Most of it is placed inappropriately and doesn't fit the mood or scene, sometimes it is not even needed. One of the few successfully placed classical music cues is the use of Tchaikovsky's 'Capriccio Italien' in Beast's first appearance. Only Beauty's song of the songs work, the others are forgettable at best and are quite corny. Was actually nauseated by the song of the ghosts and seldom feel that way with songs in animation or film, or at least not in a long time. The dialogue is full of cheese and the story has no charm, suspense or emotion, plus it takes far too long to get going and has too much padding. Getting rid of the ghosts and making scenes shorter would have already made things much better. With the voice acting, only Beauty is above serviceable, the others got on my nerves.\n\nAltogether, very weak and not a beauty. 3/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0237031/"
}