{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Barry Gibb",
            "url": "/name/nm0002956/"
        },
        {
            "@type": "Person",
            "name": "Maurice Gibb",
            "url": "/name/nm0316465/"
        },
        {
            "@type": "Person",
            "name": "Robin Gibb",
            "url": "/name/nm0316471/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 159,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0115521/"
        },
        {
            "@type": "Person",
            "name": "David Leaf",
            "url": "/name/nm0494938/"
        },
        {
            "@type": "Person",
            "name": "John Scheinfeld",
            "url": "/name/nm0770643/"
        }
    ],
    "datePublished": "2000-12-10",
    "director": [
        {
            "@type": "Person",
            "name": "David Leaf",
            "url": "/name/nm0494938/"
        },
        {
            "@type": "Person",
            "name": "John Scheinfeld",
            "url": "/name/nm0770643/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM0MjUxMzI1M15BMl5BanBnXkFtZTcwODA3OTIyMQ@@._V1_.jpg",
    "name": "Bee Gees: This Is Where I Came In",
    "original_info": {
        "id": "Bee Gees: This is Where I Came In_2000",
        "name": "Bee Gees: This is Where I Came In",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "petershelleyau"
        },
        "dateCreated": "2003-07-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0297771/"
        },
        "name": "video biography of a legendary group",
        "reviewBody": "The DVD version of this title runs an additional 30 mins (plus extras)and considering some of the waffle presented, I think I would have preferred the 90 min version made for TV. It's telling that by the time the narrative reaches the title song, the film-makers provide multiple endings. Of course, the brothers Gibb are talented record-breaking singer-songwriters, however superlative testimony become tedious real quick.\n\nThose hoping for some insight into the brothers' ability to write songs will be disappointed, since even they don't know how they do it, although their youthful ambition \"to be famous\" reads as rather shallow. However the story is leavened by a very slow rise to success; 2 break-ups and re-unions; the requisite broken marriages, drug and alcohol abuse; disappointing sales and overdue critical recognition. The death of brother Andy isn't given much exposure, with his drug addiction leading to a heart disease demise at 30, and the fate of the 2 silent Bee Gee's - Colin Peterson and Vince Maloni - is not revealed. We aren't told why Robert Stigwood stopped being the group's manager at the height of their fame, and their infamous music video for \"Stayin' Alive\" is missing.\n\nHowever some interesting things are included, as well as the notion that success can be so overwhelming as to be artistically and personally destructive. The Gibb family left the Australia they had emigrated to, believing that only a move back to England would help with their career, just as \"Spicks and Specks\" hit number down under. \"To Love Somebody\" had been written for Otis Redding who died before he could record it, and which gave them a hit. Robin quit the group in the early 1970's believing that Stigwood favoured Barry over him, and the re-union was made easier because the brothers are related. Their \"Mr Natural\" album producer Arif Martin encouraged the move to the Miami studio, dance music, and Barry's use of a Robin-ish falsetto that re-invented their sound. The songs they contributed to the \"Saturday Night Fever\" soundtrack had all been written before they heard of the film. Producing Barbra Streisand's Guilty album came about for a need for a new \"voice\", to fight the Disco Sucks backlash that cost them radio airplay. And their On Night Only concert events were designed to work around their inability to tour because of Barry's back problems.\n\n Narrated by Fred Applegate, the doco includes Bee Gee concert performances, footage from the Cucumber Castle TV special Barry and Maurice made, The Sgt Peppers film that they begged Stigwood to get them out of, Australian TV footage, Streisand and Barry performing \"Guilty\" from her \"One Voice\" concert, and home movies. We also have to-camera interviews with the 3 brothers, Barbara Gibb, Yvonne Gibb, Dwina Gibb, Stigwood (who sounds like Alfred Hitchcock), George Martin, Tim Rice, Billboard editor Timothy White (who gushes), RSO recording president David English, and Left Bank Management Allen Kovac."
    },
    "timeRequired": "PT1H30M",
    "url": "/title/tt0297771/"
}