{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dave Thomas",
            "url": "/name/nm0858686/"
        },
        {
            "@type": "Person",
            "name": "Faith Ford",
            "url": "/name/nm0004933/"
        },
        {
            "@type": "Person",
            "name": "Daveigh Chase",
            "url": "/name/nm0153738/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3432,
        "ratingValue": 4,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163456/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009722/"
        },
        {
            "@type": "Person",
            "name": "Cliff Ruby",
            "url": "/name/nm0748429/"
        },
        {
            "@type": "Person",
            "name": "Elana Lesser",
            "url": "/name/nm0504327/"
        },
        {
            "@type": "Person",
            "name": "John Hughes",
            "url": "/name/nm0000455/"
        }
    ],
    "datePublished": "2003-12-02",
    "description": "Sara Newton and Beethoven spends summer with Freddy Kablinski in Quicksilver, a weird town.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Griffiths",
            "url": "/name/nm0341716/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Family",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGJmYmY3NWQtYmU5Ny00ZTZjLTliOWUtNDg4MzBkMTc3NDhiXkEyXkFqcGdeQXVyNDgyODgxNjE@._V1_.jpg",
    "keywords": "nightmare,animal character name as title,beethoven the dog character,slimehouse,dog movie",
    "name": "Beethoven's 5th",
    "original_info": {
        "id": "Beethoven's 5th_2003",
        "name": "Beethoven's 5th",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2010-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0342108/"
        },
        "name": "Sorry, but for me Beethoven was the only good thing about this film",
        "reviewBody": "I enjoyed the first Beethoven film, it was flawed but it was cute and charming. The second had its contrivances but it was watchable, while the third and fourth films were mediocre at best. So what can I say about Beethoven's 5th? My, my, my, this is by far the worst of the series, a real dog of a movie with one redeeming quality. And I have already given away that redeeming quality in the title. Yes, sorry to say, but for me Beethoven was the only good thing about this film, he is likable, funny and well trained and he is the only likable character here. I guess I could say the same for the previous two canine adventures, though the films themselves didn't quite reach this one's awfulness. Everything else did not work at all. The soundtrack, one of the redeeming qualities of the previous films, isn't necessarily horrendous, it is just the matter of how it was placed in the film. Sometimes it felt obtrusive and predictable here. But that isn't the worst part. Beethoven's 5th I felt was shoddily made, almost direct-to-video quality. Even worse than this was the direction, it was so awful and unfocused. The script has too many cheesy moments, and the plot is dreadfully weak. I know the plot wasn't necessarily a strong point of the first film not to mention the sequels that followed, but here it is disjointed and poorly structured with no sense of drive. And the characters, with the exception of Beethoven, don't have any sparkle. The actors just look as though they are trying to say here I am, and what am I doing in this movie, in short they looked embarrassed even those who were trying to give the film energy did not succeed due to the failure of the script and plot. Overall, this is an awful entry of the Beethoven series. 1/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0342108/"
}