{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Linda Hunt",
            "url": "/name/nm0001373/"
        },
        {
            "@type": "Person",
            "name": "John Slattery",
            "url": "/name/nm4169435/"
        },
        {
            "@type": "Person",
            "name": "Ben Cotton",
            "url": "/name/nm0970805/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 96,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045277/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130849/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072554/"
        }
    ],
    "datePublished": "2003-02-09",
    "description": "Before We Ruled the Earth is an odyssey of evolution, from Homo ergaster in Africa at 1.7 million years ago, to Paleo-Indians living in North America at 11,000 years ago. Detailed recreations of hominid life over seven time period...",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTUyZGIyNzktYmVjNy00ZjQwLWI2YzQtYTRmYWNhMDExMWYxXkEyXkFqcGdeQXVyMTAwMzM3NDI3._V1_.jpg",
    "keywords": "dancing,preservation,bison,giant sloth,waterfall",
    "name": "Before We Ruled the Earth",
    "original_info": {
        "id": "Before We Ruled the Earth: Hunt or Be Hunted_2003",
        "name": "Before We Ruled the Earth: Hunt or Be Hunted",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "joeysazo"
        },
        "dateCreated": "2007-10-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0298673/"
        },
        "name": "decent, but not as good as \"Walking with Cavemen\"",
        "reviewBody": "I just saw \"Before We Ruled the Earth\" on the Science channel (one of several Discovery channel spin-offs). I'm a bit surprised that there's only one brief review and 7 ratings for a Discovery channel documentary that's 4 years old. But I'm not that surprised since it's not as good as the more popular series \"Walking with Cavemen\". Before I address why, I'll briefly describe the documentary itself since there's very little info here on IMDb.\n\nThis is a 2-part documentary totaling 2 hours. The first part, \"Mastering the Beasts\", depicts a few homo ergaster/erectus scenarios from ~1.7 million to ~500,000 years ago. Then it continues with neanderthals during the ice age ~50,000 years ago. The second part, \"Hunt or Be Hunted\", depicts several homo sapien scenarios during the ice age and prehistoric north America. (Imporant note: I got the episode titles from amazon. Each episode is its own DVD with zero bonus features. What a gyp since both could easily fit on one disc.) \n\nWhat I liked: The scenarios were based on specific archaeological finds that are briefly described at the end of each scenario. Some of this was new information for me (I've studied anthropology a good bit in the past year). The costumes and make-up were very well done, and the actors did a fine job. \n\nWhat I didn't like: The biggest weakness was the sometimes dull, boring storytelling. Some of the scenarios were mildly interesting, but I zoned out during others. The narration was often very dry. It wasn't nearly as engrossing as \"Walking with Cavemen\". (I think this is the main reason for the sparse feedback here and at amazon). Another weakness is that the extinct animals were animated with lousy CGI for a 2003 production. \n\nBottom-line: I've watched \"Walking with Cavemen\" twice in the past year and I'll probably watch it again sometime in the near future. On the other hand, \"Before we Ruled the earth\" was worth watching once since I'm very interested in the subject matter, but I have no desire to watch it again.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0298673/"
}