{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gene Hackman",
            "url": "/name/nm0000432/"
        },
        {
            "@type": "Person",
            "name": "Owen Wilson",
            "url": "/name/nm0005562/"
        },
        {
            "@type": "Person",
            "name": "Gabriel Macht",
            "url": "/name/nm0532683/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 108158,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022730/"
        },
        {
            "@type": "Person",
            "name": "Jim Thomas",
            "url": "/name/nm0859029/"
        },
        {
            "@type": "Person",
            "name": "John Thomas",
            "url": "/name/nm0859049/"
        },
        {
            "@type": "Person",
            "name": "David Veloz",
            "url": "/name/nm0892705/"
        }
    ],
    "datePublished": "2001-11-30",
    "description": "A disillusioned pilot shot down over war-torn Bosnia is ensnared in the conflict in war-torn Bosnia. In the crosshairs of the enemy and an assassin, the spoiled pilot runs for his life as his commanding officer risks all to save him.",
    "director": [
        {
            "@type": "Person",
            "name": "John Moore",
            "url": "/name/nm0601382/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzUyOTE4MjktZmU2Ni00OWI5LWJmNGQtNDRkZGIzMjdiY2JiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "bosnian war,u.s. navy,man portable air defense system,f 18,f 18 hornet",
    "name": "Behind Enemy Lines",
    "original_info": {
        "id": "Behind Enemy Lines_2001",
        "name": "Behind Enemy Lines",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RawkStah"
        },
        "dateCreated": "2001-11-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0159273/"
        },
        "name": "Owen Wilson. And stuff blowing up. Sounds good to me!",
        "reviewBody": "Behind Enemy Lines ***\n\nBravo niner delta, what's your vector, Victor?\n\nYou'll hear lots of dialogue like that in Behind Enemy Lines. Military code talk is one of the coolest things ever. Vector, copy, come back, affirmative, negative, no-go, R(ally)P(oint)... That stuff is just plain COOL.\n\nBack to the movie review. So  you're making a war movie with airplanes. Let's make sure you have everything you need. Stock footage? Check. Lieutenant with a bad boy' attitude? Check. Stuff blowing up? Check. Politically ambiguous military situation? Che  what? That doesn't make sense. I mean, we're America... (Don't worry  We're the good guys. It's all the rest that's ambiguous.)\n\nSee, Behind Enemy Lines is set in Bosnia during the last' days of the civil war in Serbia/Yugoslavia/Bosnia-Herzegovina. Chris Burnett (Wilson) is stationed on an aircraft carrier in the Adriatic Sea. The ship is commanded by Admiral Leslie Reigart (Hackman), who in turn is under the command of NATO, represented by Admiral Piquet (de Almeida). Now, Burnett is a bit of a maverick. Not like the Tom Cruise type  Burnett is tired of being in the Navy. He signed on to be a fighter pilot, not a sitting around on the ship pilot. In fact, he's handed in his resignation papers. Of course, you can't just leave in the middle of a mission. When the ship returns to port, Burnett is done. Reigart doesn't really care for Burnett  he used to have potential, but now he's just dead weight. So, in a bit of vindictiveness, Reigart assigns Burnett (a navigator) and his pilot, Stackhouse (Gabriel Macht), on a recon mission on Christmas. The recon? A lake. Lovely. But, radar picks up some activity. Activity OFF OF THE ASSIGNED COURSE. Now, we've established that Burnett is a maverick, so, naturally they do recon over there. They take pictures of mass graves. Then, they get shot down. BEHIND ENEMY LINES. This is not good. See, NATO planes were not supposed to be making fly-bys in that area. A peace treaty has just been signed, and things could fall apart at any moment. So, Reigart has a choice to make  does he risk the lives of thousands of people to get one man? Does he ensure peace and leave a man behind? We all know the answer to that.\n\nBehind Enemy Lines is slick. It is very, very slick. Teflon. It looks like a video game. A really cool video game. Shifty frame-rates, cool filters, Matrix-style special effects, Saving Private Ryan-camera-effects, it looks way cool. It's not universally realistic, but, stylistically it works very well.\n\nThe acting is also good. No one is going to win any acting awards in this picture, but, no one stinks. If you don't know who Gene Hackman is, turn off your computer right now. You have some serious catching up to do. If you don't know who Owen Wilson is, start paying attention. This guy is good. Very, very good. You may have seen him in Zoolander (he was the blonde model). You may have seen him in Shanghai Noon with Jackie Chan. You may have seen an underrated comedy called Rushmore  he co-wrote that. He's just beginning to get recognition, and he deserves it. While I think he's better in comedies, he's no slouch as a leading-man-action-hero. Joaquim de Almeida doesn't stand out, but you've seen him before. (He played Bucho (the bad guy) in Desperado)\n\nSo, that leaves us with the story. It must be tough to make a war movie now. WWII was easy  the bad guys were easy to spot. But, to make a movie based on any war post-1970 must be tricky. Things like finding bad guys' aren't easy anymore. Even in something like the Gulf War. To paraphrase Mark Wahlberg from Three Kings: `I forget... Are we shooting people anymore?' The Balkan conflict was really, really tricky. First of all, there were three sides. Secondly, there was a huge history of racial strife in the area. Thirdly, NATO stepped in to prevent the war from spreading into Macedonia, which would have brought Greece (a NATO member) and Turkey (another NATO member) into the war against each other. Fourthly, keeping all the factions straight was very, very hard unless you studied political science. Behind Enemy Lines doesn't get too bogged down in the details, which is good. Nor does it name real names. Slobodan Milosovic is not mentioned, but he is implied. The story is about an American airman in the middle of the conflict, but it's not based on the story of Lt. Scott O'Grady.\n\nWhat we have here is a slick, mostly non-political (there are some references to landmines being bad for children and other living things) war movie. It's not perfectly paced, but it's close. The cinematography is really, really cool. And stuff blows up."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3736666393",
        "name": "Behind Enemy Lines",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGJkMGFkZjItY2VkYy00YWNjLWE0NjYtNzhiODg2NzI2OWQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGJkMGFkZjItY2VkYy00YWNjLWE0NjYtNzhiODg2NzI2OWQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:29:27Z",
        "url": "https://www.imdb.com/video/vi3736666393/"
    },
    "url": "/title/tt0159273/"
}