{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Cusack",
            "url": "/name/nm0000131/"
        },
        {
            "@type": "Person",
            "name": "Cameron Diaz",
            "url": "/name/nm0000139/"
        },
        {
            "@type": "Person",
            "name": "Catherine Keener",
            "url": "/name/nm0001416/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 341754,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0129487/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018555/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058765/"
        },
        {
            "@type": "Person",
            "name": "Charlie Kaufman",
            "url": "/name/nm0442109/"
        }
    ],
    "datePublished": "1999-12-03",
    "description": "A puppeteer discovers a portal that leads literally into the head of movie star John Malkovich.",
    "director": [
        {
            "@type": "Person",
            "name": "Spike Jonze",
            "url": "/name/nm0005069/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTFlYjgyMjUtNmJhZS00MDY2LTg0ZmMtNTVlNDA2NTUwYTRjXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "puppeteer,portal,body swap,three word title,celebrity name in title",
    "name": "Being John Malkovich",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "1999-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120601/"
        },
        "name": "One of the most unique, imaginative movies ever made. **** out of ****",
        "reviewBody": "BEING JOHN MALKOVICH (1999) ****\n\nStarring: John Cusack, Cameron Diaz, Orson Bean, Catherine Keener, John Malkovich, and Charlie Sheen Director: Spike Jonze Running Time: 113 minutes Rated R (for sexuality and language)\n\nBy Blake French:\n\nIt is not every day that I use words in my movie reviews such as unique, creative, inventive, imaginative, original, fresh, mesmerizing, and unmatched. Under the circumstances of \"Being John Malkovich,\" a wonderfully hilarious presentation of an incomprehensible idea, I find myself using every one of those phrases and then some more being deserved. Everything about it is labyrinthine, intriguing, and very funny. It is one of the years best films, and should be well presented come Academy Award time.\n\n \"Being John Malkovich\" details the relationship between Craig and Lotte Schwartz. They basically live an old fashioned life in a small apartment with a miniature zoo of pets and a puppet factory inside. Lotte is a typical, unattractive homemaker while Craig holds that unusual occupation of being a professional puppeteer. Desperately searching for employment, Craig soon visits a business for an interview as a filer when he discovers for some odd reason the construction of the office floor is all but several feet tall, forcing all employees to bend over backwards just to walk around.\n\n One of those employees is named Maxine, a highly seductive co-worker of Craig's. When he asks her out for a beer one night, Craig experiences lustful thoughts about her, and nearly begins an affair as his seemingly loving wife wonders around her happy little apartment all by herself.\n\n As you can see, the household isn't exactly a joyful situation. All things change, from blossoming sexual confusion to inner self-esteem, when Craig uncovers a small door behind a filing cabinet in his office. It is tucked away, hidden acutely well in a dark corner, which is found mysteriously by accident when Craig droops a paper behind the cabinet. After Craig explores this deep miniature, seemingly endless hallway, he discovers this secret door leads to the brain of actor John Malkovich for fifteen minutes, then spits you out along the roadside afterwards.\n\nWow, sounds like \"Alice in Wonderland,\" doesn't it...well, sort of. Craig first tells his co-worker about his discovery, who continues to think he's nuts. Then, after explaining and showing this portal to his wife, who is hysterical, Maxine begins to believe Craig, and concoct a devilish idea. To sell tickets allowing a pedestrian to enter the mind of a famous celebrity. The tagline: Ever wanted to be someone else? Now you can.\n\nIt is very intriguing how the narrative point of view is juggled between Craig and then Lotte after the problem is introduced and then solved: the couples dead-end lives are lifted in glory. This creates a second conflict moving us smoothly into the second act. Perfect internal problems are created with the two female leads; Lotte and Maxine find themselves physically attracted to each other in unbelievable character twists. The two end up having a femininity sexual relationship while one is entrapped in the mind of Malkovich, and the other experiences the actual Malkovich. It is a beautifully crafted structure, with act breaks so clear and complications so faultless it is no wonder while this is such an effective picture.\n\n Also first rate here are the performances. Although the film offers strange types of roles for these actors to indulge themselves in, they do a wonderfully energetic job. Cameron Diaz is flawlessly cast as Craig's sexually and mentally uncoordinated wife, and delivers us a comically riotous character. John Cusack as Craig himself is superior and believable as a down on his luck puppeteer, and possesses a perfect blend of humor and unpredictable qualities with his character. Also quite good here, John Malkovich, who has much more of a difficult role than one would think. He has some hard scenes where Craig controls him while inside his mind, which requires great skill to perform.\n\nHowever, better than any performance, and more amazing then any flawless characters or plot, is the concept of a human being thinking up such an absurd idea as the imagination behind the beauty of \"Being John Malkovich.\" With such a penetrating, magical atmosphere to it, it is kind of a shame that the filmmakers created this film in the form of a black comedy instead of something more harrowing. Although comedy is simply the most logical choice to categorize this type of film, wouldn't it have been interesting to see this movie as a drama, or perhaps as a spiritual awakening picture.\n\n Regardless, the film still has an oddly powerful message to it, which I will not, nor do I ever directly reveal in any of my reviews. You see, since different individuals come from different backgrounds, and thus see things differently. It is because of this that I do not allow my personal take on a message persuade another filmgoer whose idea of a moral may be much different than my own. But I will say that \"Being John Malkovich\" might not overtake the box office, but for appreciative movie patrons, this one is sure to be treasured for a long time to come.\n\nBrought to you by Gramercy Pictures.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3568894233",
        "name": "Being John Malkovich",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTA0ZjIyNmEtZTE4Mi00NDRiLWI3YjQtMDVlNDgyNWIxN2UxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTA0ZjIyNmEtZTE4Mi00NDRiLWI3YjQtMDVlNDgyNWIxN2UxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:29:40Z",
        "url": "https://www.imdb.com/video/vi3568894233/"
    },
    "url": "/title/tt0120601/"
}