{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        },
        {
            "@type": "Person",
            "name": "Byron Mann",
            "url": "/name/nm0542677/"
        },
        {
            "@type": "Person",
            "name": "Monica Lo",
            "url": "/name/nm1195347/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6509,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0123055/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0112191/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102280/"
        },
        {
            "@type": "Person",
            "name": "Thomas Fenton",
            "url": "/name/nm0272090/"
        },
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        },
        {
            "@type": "Person",
            "name": "James Townsend",
            "url": "/name/nm1329977/"
        }
    ],
    "datePublished": "2003-12-30",
    "description": "An ex-CIA agent's quest to find his kidnapped daughter leads him on a trail of political intrigue, corruption, danger and betrayal; he will stop at nothing to save her.",
    "director": [
        {
            "@type": "Person",
            "name": "Siu-Tung Ching",
            "url": "/name/nm0155642/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2U2YTFjZDUtNmU0ZS00YTJhLWIzZDItODFiMjI5OGFmM2RhXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg",
    "keywords": "thailand,skinny dipping,female frontal nudity,washington monument washington d.c.,cia central intelligence agency",
    "name": "Belly of the Beast",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CelluloidRehab"
        },
        "dateCreated": "2005-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0357474/"
        },
        "name": "Ong Bak - Stevie Seagal Version",
        "reviewBody": "From the director of Chinese Ghost Story and Naked Weapon (and collaborator in the action scenes from Hero and House of the Flying Daggers), we have a story about an ex-CIA agent who's daughter is kidnapped. Its not just any ex-CIA agent, but Steven Seagal. Yes !! Pony-tail is back, BACK WITH A VENGEANCE. (Sorry, I had to do that).\n\nThis is your typical action movie, usually based on some revenge/honor theme, where the hero has to take out dozens to hundreds of henchman and usually a \"Boss\" character, or several. The acting is atrocious and all we are left with is the action (and a lot of wire-work). Steven brought his typical dead-pan/Prozac acting along. This movie is not going to be on anybody's Christmas list, however, it is hysterical and very very light. I was laughing the whole way through the movie.\n\nSteven Seagal is looking to do some major butt-kicking. Unfortunately, most of the serious butt-kicking is done by a much younger, thinner man (the stunt guy is actually wearing fake fat to look like Steven), who has a lot more physical talent than Steven had in his prime. This is further compounded by the fact that the stunt man performs stunts that Steven could never perform (jump kicks, jump spin kick, and all other stunts involving jumping high).\n\nThe movie seems to have been filmed entirely in Bangkok, Thailand and recruited what seems to be the entire cast of Onk Bak, minus Tony Jaa. The wheelchair boss and Don the drug dealer stand out in my mind.\n\nThere are somethings about the movie that bother me. Steven (who is the star of the movie) looks like he just woke up in Bangkok after weeks of binging on milkshakes and vodka, with no money and no change of clothes. He looks dirty and grimy. I wouldn't sit next to him on the subway if he looked like that. Next, what was up with the Steven's gun? He seemed to have a magic weapon. This weapon fires anywhere from 30-50 bullets and rarely needs another clip. Also Steven has become such a big star, he no longer needs to aim his weapon. He just fires in the general direction of his target. Steven's sex scene was certainly interesting. It made me quite nauseous. Shoving toothpicks under my fingernails is pleasurable as compared to watching Steven has sex. The cinematography was quite strange. I didn't realize the same guy who did certain Outer Limit and Star Trek episodes was still alive (tilt the camera 45 degrees). The wire action becomes ridiculous, especially when you are trying to make a somewhat realistic action movie (imagine what one would think if Tony Jaa jumped 10 feet straight in the air and did 2 full revolutions). I also like the variation on Thai boxing : Thai Transvestite Claws and High Heels Boxing. Not only that, what was the deal with all the mystical crap introduced 10 minutes before the end of the movie, complete with with a Thai Mako impersonator who had taken too much PCP ??\n\nOne may think from my review that I hated this movie. This is not true. This is the funniest movie I've seen since Shaun of the Dead, unfortunately that movie was trying to be funny. I do recommend this movie as a rental,a discount-bin purchase, or a late night cable session while completely wasted.\n\n-Celluloid Rehab",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Belly Of The Beast",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2291636249",
        "name": "Belly of the Beast",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDZkOWJiZDItN2Q2Mi00MjIzLTkxYTYtOGRhMzEwYTBhZWQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDZkOWJiZDItN2Q2Mi00MjIzLTkxYTYtOGRhMzEwYTBhZWQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-12-11T06:07:17Z",
        "url": "https://www.imdb.com/video/vi2291636249/"
    },
    "url": "/title/tt0357474/"
}