{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Catherine Deneuve",
            "url": "/name/nm0000366/"
        },
        {
            "@type": "Person",
            "name": "Jean Sorel",
            "url": "/name/nm0814799/"
        },
        {
            "@type": "Person",
            "name": "Michel Piccoli",
            "url": "/name/nm0681566/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 46190,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "Belle de Jour",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0250812/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077278/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008735/"
        },
        {
            "@type": "Person",
            "name": "Joseph Kessel",
            "url": "/name/nm0450262/"
        },
        {
            "@type": "Person",
            "name": "Luis Buñuel",
            "url": "/name/nm0000320/"
        },
        {
            "@type": "Person",
            "name": "Jean-Claude Carrière",
            "url": "/name/nm0140643/"
        }
    ],
    "datePublished": "1968-04-10",
    "description": "A frigid young housewife decides to spend her midweek afternoons as a prostitute.",
    "director": [
        {
            "@type": "Person",
            "name": "Luis Buñuel",
            "url": "/name/nm0000320/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjJiMGEwYTQtOGM0Ni00ZDQ0LThlNWItNzgwNTBlYmE1YzdjXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "prostitute,blonde,double life,white bra and panties,brothel",
    "name": "Belle de jour",
    "original_info": {
        "id": "Belle de Jour_1967",
        "name": "Belle de Jour",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Eumenides_0"
        },
        "dateCreated": "2005-03-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061395/"
        },
        "name": "Buñuel Never Disappoints",
        "reviewBody": "'Belle de Jour' is Buñuel at his weirdest: the Spanish master builds this movie on the relationship between the fantasy of conscious and unconscious dreams and reality. The dreamer is the beautiful Séverine (the magnificent Catherine Deneuve) a petite bourgeois woman trapped in a dull marriage which leads her to strive for something else, first in fantasy, and then in outright real life. Séverine's dreams are vividly sexual: the opening scene marks the tone of the movie and the character as she dreams with being raped, spanked and humiliated while her angered husband watches. Throughout the rest of the movie, Séverine will be trying to make these fantasies come true in a brothel she starts working at or is she? This is what's fun in Buñuel's movie: it's impossible to tell fiction from fact.\n\nSéverine is the heart and soul of 'Belle de Jour:' her journey through her own sexuality is riveting; she starts with as a repressed woman who's having marital problems, probably due to sex. As a way to get out of her dull life she starts working at a brothel during daytime, hence her nickname 'beautiful by day.' Some of the episodes at the brothel are funny: her first attempt at playing a dominatrix is an embarrassing experience for the poor Séverine who's not accustomed to the relationship between dominator/dominated; her experience with a creepy Asian client is highly enigmatic, mainly because of the famous and mysterious box the client brings whatever it is, it seems to bring Séverine a lot of pleasure. Her she participates in a role-playing situation with a rich enigmatic man who asks her to perform a dead woman in a bizarre ritual/funeral scene the level of insinuations this scene creates in one's mind is outstanding! Meanwhile, amidst all the pleasure, Séverine is haunted with a sense of guilt and shame as she keeps imagining herself being punished by her husband and his best friend. She ponders leaving the brothel until a new client, arrives and she's immediately attracted to him.\n\nPierre Cleménti was an outstanding revelation: although I had unknowingly seen him once before in Bertolucci's 'The Comformist' as the homosexual driver Lino, I certainly noticed him in this movie: he's a fascinating combination of style and substance with his amazing performance, playing the sophisticated, leather-wearing, cane-wielding, gold-toothed young criminal, Marcel, meeting Séverine when celebrating a successful bank heist. His obsession for her grows to fantastic proportions culminating in the unexpected tragedy of the third act. The end of the movie is perhaps the weirdest part of the narrative, the one where all interpretations become valid; it's also a great send-up on happy endings, and a fine conclusion to a thriller if this movie were a thriller Buñuel is just genius! \n\n\"Belle de Jour\" is a funny, tragic, and ultimately unique movie. I had the opportunity to watch it at a theatre room last year and obviously I felt the pleasure of seeing this bizarre masterpiece as all movies should be seen: on the big screen. I'll certainly feel the lack when I have to watch it on TV one day.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three Reasons Criterion Trailer for Belle de Jour",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3795297305",
        "name": "Belle de Jour: The Criterion Collection [Blu-Ray]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWYxZDZlYmItZTk2My00ZGI5LWEwNzktYTAwYWM1NDc2ZDk4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWYxZDZlYmItZTk2My00ZGI5LWEwNzktYTAwYWM1NDc2ZDk4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-09-26T03:07:59Z",
        "url": "https://www.imdb.com/video/vi3795297305/"
    },
    "url": "/title/tt0061395/"
}