{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Easton",
            "url": "/name/nm0247733/"
        },
        {
            "@type": "Person",
            "name": "Dylan Baker",
            "url": "/name/nm0048414/"
        },
        {
            "@type": "Person",
            "name": "Colm Feore",
            "url": "/name/nm0272173/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 170,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0075436/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014245/"
        }
    ],
    "datePublished": "2002-11-19",
    "description": "The story of the renowned American polymath.",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxNDY5MzExN15BMl5BanBnXkFtZTcwNzQ3MTIzMQ@@._V1_.jpg",
    "keywords": "tv mini series,scientist,diplomat,colonial america,american revolution",
    "name": "Benjamin Franklin",
    "original_info": {
        "id": "Benjamin Franklin_2002",
        "name": "Benjamin Franklin",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2012-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0348896/"
        },
        "name": "Does it get any better?",
        "reviewBody": "It is not surprising that this biography of Ben Franklin received an Emmy Award as Outstanding Non-Fiction Special. After all, the show is a quality production throughout and has more than enough of the usual PBS polish and glitz to many anyone happy.\n\nThis documentary consists of narration, paintings and historical recreations. And, much of the narration is based on the actual writings of the various folks. So, while you often see an actor very ably play Franklin, you also see actors as his sons, friends, foreign acquaintances and the like. It tends to make the story a lot more real--like the real life folks are talking directly to us--as if we are confidants.\n\nContent-wise, this is also an exceptional film. Being so long was important, as too often biographies of larger than life people are too short. This on allows a deeper exploration of the man and covers much of the same material in the masterful biography \"The First American: The Life and Times of Benjamin Franklin\"--which would make for great reading AFTER you see this film. Wonderful and expertly made in every way--this is simply terrific.\n\nBy the way, the best part, to me, was in the second half when Franklin did a wonderfully witty dialog with 'Madame Gout'--as if his gout pains were alive and having a conversation with him. It's quite clever and made me laugh. I also appreciated the insight from the lady who explained why she thinks that Franklin never received as much acclaim as George Washington in this country--it made sense and made me think.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0348896/"
}