{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Benjamin Dickerson",
            "url": "/name/nm0225399/"
        },
        {
            "@type": "Person",
            "name": "Tim Campion",
            "url": "/name/nm0133070/"
        },
        {
            "@type": "Person",
            "name": "Brian Halloran",
            "url": "/name/nm0356710/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 227,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0116515/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001359/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075757/"
        },
        {
            "@type": "Person",
            "name": "Jem Cohen",
            "url": "/name/nm0169486/"
        },
        {
            "@type": "Person",
            "name": "Peter Sillen",
            "url": "/name/nm0798079/"
        }
    ],
    "datePublished": "2000-06-17",
    "description": "This highly unorthodox documentary follows the crooked path of Benjamin (no last name). He lives in a hidden neighborhood of Atlanta, Georgia called \"Cabbagetown.\" Drag-queen, speed-freak, all-around renegade, Benjamin left the st...",
    "director": [
        {
            "@type": "Person",
            "name": "Jem Cohen",
            "url": "/name/nm0169486/"
        },
        {
            "@type": "Person",
            "name": "Peter Sillen",
            "url": "/name/nm0798079/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzM4MDA0MjY2OV5BMl5BanBnXkFtZTcwMTMzMjYxMQ@@._V1_.jpg",
    "keywords": "gay interest,singer songwriter,rock musician,time lapse photography,drag",
    "name": "Benjamin Smoke",
    "original_info": {
        "id": "Benjamin Smoke_2000",
        "name": "Benjamin Smoke",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Erich-13"
        },
        "dateCreated": "2000-12-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0233315/"
        },
        "name": "Absorbing portrait of a man who should have been famous",
        "reviewBody": "I was lucky enough to see Benjamin sing in concert once (playing Caiaphas in a production of \"Jesus Christ Superstar\"), and was struck by his craggy, Tom Waits-like vocal delivery, as well as his cadaverous but flamboyant stage persona. Now, thanks to the documentary \"Benjamin Smoke,\" I've got a more fully rounded picture of this enigmatic performer. Virtually unknown outside his hometown (although his music did inspire Patti Smith to write a song about him), Benjamin deserved to be a bigger star. Hopefully, this film will introduce more people across the country (and even around the world) to both the man and his music.\n\nThe filmmakers spent several months (years?) just hanging out with Benjamin. They let him talk about whatever he wanted, and he held nothing back, freely discussing his numerous addictions, his HIV-positive status, his mother's reaction to his homosexuality...and he tells all these stories with an easy-going charm and wit.\n\nWhile I hope people from all over the world will seek out and watch this movie, I do feel a twinge of pity for viewers outside Atlanta. They'll never experience the heady feeling of connectedness that I got from attending the premiere at the Lefont Plaza theater...located directly across the street from the apartment building where Benjamin lived out his last months, next door to the diner where the filmmakers recorded a conversation with the band, and just down the street from the club where Benjamin played his final concert. After leaving the theater, I made a point of visiting all of these sites and soaking up the atmosphere of Benjamin history.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0233315/"
}