{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nick Whitaker",
            "url": "/name/nm0924293/"
        },
        {
            "@type": "Person",
            "name": "Chris Kendrick",
            "url": "/name/nm1445677/"
        },
        {
            "@type": "Person",
            "name": "Nate Bynum",
            "url": "/name/nm0125967/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 650,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0251093/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025928/"
        },
        {
            "@type": "Person",
            "name": "Joe Camp",
            "url": "/name/nm0131995/"
        }
    ],
    "datePublished": "2004-08-20",
    "description": "Lost and alone on the streets of a small Mississippi town, Benji struggles to save his mom from a backyard puppy mill, avoiding two dopey dogcatchers and an unwanted sidekick.",
    "director": [
        {
            "@type": "Person",
            "name": "Joe Camp",
            "url": "/name/nm0131995/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk0NzczMjQ5NV5BMl5BanBnXkFtZTcwMjI0NzUyMQ@@._V1_.jpg",
    "keywords": "2000s,benji the dog character,animal character name in title,four word title,slimehouse",
    "name": "Benji: Off the Leash!",
    "original_info": {
        "id": "Benji: Off the Leash_2004",
        "name": "Benji: Off the Leash",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "eat-5"
        },
        "dateCreated": "2004-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0315273/"
        },
        "name": "I love this film.",
        "reviewBody": "Benji Off the Leash! is no one-trick-pony. The film should win audiences of all ages and defrost even the most hardened canine-phobe. Both the movie and the mutt are that good.\n\nMovies targeted for family trade often seem designed by committees hoping to lure all demographics. Happily, Benji Off the Leash! attains purity in every sense of the word; unlike many films of any genre, it reflects a unified vision. Benji producer/director/screenwriter Joe Camp has not stooped to conquer.\n\nIn direction, story construction, camera-work and performances both human and canine, Benji Off the Leash! is the best of the Benji canon. Its two-legged hero is Colby, a stalwart youngster who loves dogs. Its two-legged villain is Colby's harsh father, whose appropriate last name is Hatchett. He runs an illegal dog mill and mistreats all beings, both two-legged and four-legged.\n\nColby and Benji have parallel plights, dealing with the rescue of loved ones and strong maternal bonds.\n\nBenji Off the Leash! has serious undercurrents, but it never turns grim. The film's canine comic foil is a character named Lizard Tongue, whom Benji befriends and then probably wonders if making friends with the rascally Lizard Tongue was a wise move. Two goofy dogcatchers and one eccentric recluse provide the human comedy.\n\nAs before, Mr. Camp films the canine scenes from the dogs' perspectives, and the desire to reach out and touch is irresistible. Benji interacts gamely with Lizard Tongue, a chatty parrot named Merlin and even a cow. Don Reddy's cinematography exquisitely captures each moment.\n\nWith eyes born for movie camera close-ups, Benji is a female mixed-breed terrier, three and one-half years of age. She is a wonder-dog, but she doesn't hog the show. As played by Shaggy, a dog from the south side of Chicago, Lizard Tongue is also one formidable scene-stealer.\n\nTwo-legged stars also fare well. Nick Whitaker has the essential soulfulness for Colby, while Duane Stephens has some hilarious bits as the goofier of the two dogcatchers. Mr. Stephens also sings a lilting \"It Had To Be You\" over the closing credits. Neal Barth relishes each moment as town eccentric Zacharia Finch, fond of improvising quotes from phony sources.\n\nCalling a movie \"the best of its kind\" often has a condescending tone. In the case of Benji Off the Leash!, no condescension is warranted. This Benji's a beaut, for all ages. Woof. \n\nBenji Off the Leash!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\"This Summer\"",
        "duration": "PT2M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4038656281",
        "name": "Benji: Off the Leash!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjZkYTQxMTctODM2MS00YTdmLWE1NmEtMGQxMmY4MDc4MTQwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjZkYTQxMTctODM2MS00YTdmLWE1NmEtMGQxMmY4MDc4MTQwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:30:35Z",
        "url": "https://www.imdb.com/video/vi4038656281/"
    },
    "url": "/title/tt0315273/"
}