{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Wilby",
            "url": "/name/nm0928134/"
        },
        {
            "@type": "Person",
            "name": "Alan Bates",
            "url": "/name/nm0000869/"
        },
        {
            "@type": "Person",
            "name": "Eileen Atkins",
            "url": "/name/nm0040586/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 667,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103706/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026733/"
        },
        {
            "@type": "Person",
            "name": "Nigel Williams",
            "url": "/name/nm0931388/"
        }
    ],
    "datePublished": "2002-06-04",
    "description": "A chronicle of the life of George VI, who was forced to become King following the abdication of his brother Edward VIII, and his relationship with his wife, Elizabeth.",
    "director": [
        {
            "@type": "Person",
            "name": "Giles Foster",
            "url": "/name/nm0287821/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjcyMTk5MDg1Ml5BMl5BanBnXkFtZTcwNzkyOTcyMQ@@._V1_.jpg",
    "keywords": "queen,abdication,royal romance,victory in europe day,royal family",
    "name": "Bertie and Elizabeth",
    "original_info": {
        "id": "Bertie & Elizabeth_1997",
        "name": "Bertie & Elizabeth",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Philby-3"
        },
        "dateCreated": "2003-03-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0310733/"
        },
        "name": "Wasted opportunity",
        "reviewBody": "You're right folks, this really was below par. I now know why it went straight to cable. Yet it wasn't for lack of acting talent. James Wilby was excellent as the shy and fearful Bertie, thrust onto the throne by his brother David's abdication, and Juliet Aubrey was fine as Elizabeth. Alan Bates harrumphs splendidly as George V and Eileen Atkins, although too old for the role, carries off Queen Mary in a sympathetic manner. Charles Edwards as Edward VIII (`David') has plenty of presence and Paul Brook is superb as private secretary Tommy Lascelles. So what went wrong?\n\nThe scriptwriters clearly set out not to offend anybody living, and while Elizabeth the Queen mother died in 2001 her daughter is very much alive and occupying a position of some importance. They were so careful in fact that Prince Philip, always good for some boorish misunderstanding, does not even appear. Neither does his conniving uncle Dickie Mountbatten, though he is mentioned in the dialogue. The enmity between Elizabeth and Wallis Simpson is merely hinted at. But the real problem is the failure to identify the strong elements in the story, the courtship/ wedding, the abdication and the war and write around them, instead of putting the whole thing together as a sort of photo album. Maybe as another commenter says, the mini-series format would have been better, though it might have just created a longer mess.\n\n If you really want to know about the history of the early Windsors, you are going to have to read some books. Edward VIII wrote his account in `A King's Story' published in the early 1950s. He blames Baldwin for forcing him out but makes it clear that he had little difficulty in choosing between love and duty. Poor old Bertie had no such choice and was saddled with the extra burden of being King during wartime. His father describes himself and Edward as `ordinary men' and Bertie, like most of the hereditary aristocrats of Britain was deeply ordinary (and interested mainly in country pursuits). The most remarkable thing about Bertie was the way he overcame his stutter (especially over `B' words). It would have been interesting to know how this was done, but though the stutter gets some attention we are hustled out of the (Australian) therapist's rooms just as the treatment starts.\n\n So, more or less a waste of space. There's been plenty of attention given to `David' before, but this show fails to give a new perspective to the historical events it so lightly covers. A great pity the Queen Mum never wrote her memoirs  now that would have been interesting."
    },
    "url": "/title/tt0310733/"
}