{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred Willard",
            "url": "/name/nm0929609/"
        },
        {
            "@type": "Person",
            "name": "Eugene Levy",
            "url": "/name/nm0506405/"
        },
        {
            "@type": "Person",
            "name": "Catherine O'Hara",
            "url": "/name/nm0001573/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 63847,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040620/"
        },
        {
            "@type": "Person",
            "name": "Christopher Guest",
            "url": "/name/nm0001302/"
        },
        {
            "@type": "Person",
            "name": "Eugene Levy",
            "url": "/name/nm0506405/"
        }
    ],
    "datePublished": "2000-10-20",
    "description": "A behind-the-scenes look into the highly competitive and cut-throat world of dog shows through the eyes of a group of ruthless dog owners.",
    "director": [
        {
            "@type": "Person",
            "name": "Christopher Guest",
            "url": "/name/nm0001302/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ5OTc0NDU1MF5BMl5BanBnXkFtZTYwNzk1OTI3._V1_.jpg",
    "keywords": "mockumentary,dog show,gay,gay couple,gay hairdresser",
    "name": "Best in Show",
    "original_info": {
        "id": "Best in Show_2000",
        "name": "Best in Show",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2001-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0218839/"
        },
        "name": "Basically an improvised \"home movie\" that uses a dog show as the reason to introduce the various strange characters.",
        "reviewBody": "After watching \"Best In Show\" my first question was, \"Why did so many rate this movie so highly?\" My wife walked out after 10 minutes. In a fit of generosity I gave it a \"6\" of 10, only after I viewed the DVD version with the director's commentary turned on.\n\nThe director and co-writer is Christopher Guess, who also stars as Harlan Pepper, a country bumkin who is showing his bloodhound, and studies ventriloquism on the side. The other co-writer is Eugene Levy who stars as Jerry Fleck, who meets up with another of his wife's ex-lovers almost everywhere they go. Jerry as two left feet, literally.\n\nTo say the movie was \"written\" is a bit of a stretch because, as Guess and Levy explain, all scenes and dialog were improvised, with no rehearsals. Except for Parker Posey, who plays the out-of-control housewife, all the actors are veterans of improvisation, and most have worked together in other movies. The whole film has the feel of \"improvisation\", and the look of a hand-held home movie, but with better sound. Instead of using selective focus to isolate the subject, almost everything is in focus in most scenes.\n\nFred Willard was the most entertaining. Many of us have seen him regularly in comic skits on the Jay Leno late night TV show. He was one of the two announcers at the dog show, and his questions and comments never fit, but were funny because of that. \"How do they get those Scnauzers to become minature? Do they shrink them? Do you know they eat dogs in some cultures? That judge, examining the dog's testicles, I would be uncofortable on a date with her!\"\n\nThe dog show brings forth the gay couple, the quarreling couple, the March/December couple, and so forth. After \"best in show\" is picked, and everyone goes their separate ways, the short epilog shows how the show influenced them and what they did afterward. The funniest was the calendar the gay couple were making, showing two dogs posed as various famous movie characters.\n\nWhy do I think this is a mediocre movie? It is obviously a vanity project. Guess and Levy apparently said, let's make a comedy with lots of funny people and sight gags, let's use improvisation, and use a dog show in Philadelphia as a reason for following the lives of all these \"fringe\" personalities. I found it entertaining for the most part, but also found Parker Posey's acting to be too much \"over the top\", and found myself cringing instead of laughing. Too many of the \"gags\" came across as forced humor. While I admire the project, having made many home movies myself when my children were growing up, overall the effort misses the \"entertainment\" mark of a major film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 2 for Best in Show",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1651507993",
        "name": "Best in Show",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmNkODcwNjQtZDUwNy00NDllLTg1YWMtYTE5YjUzNzVhZTY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmNkODcwNjQtZDUwNy00NDllLTg1YWMtYTE5YjUzNzVhZTY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-03-20T03:13:49Z",
        "url": "https://www.imdb.com/video/vi1651507993/"
    },
    "url": "/title/tt0218839/"
}