{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Debra Winger",
            "url": "/name/nm0000700/"
        },
        {
            "@type": "Person",
            "name": "Tom Berenger",
            "url": "/name/nm0000297/"
        },
        {
            "@type": "Person",
            "name": "John Heard",
            "url": "/name/nm0001334/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6647,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026841/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049390/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075397/"
        },
        {
            "@type": "Person",
            "name": "Joe Eszterhas",
            "url": "/name/nm0000390/"
        }
    ],
    "datePublished": "1988-08-26",
    "description": "An FBI agent posing as a combine driver becomes romantically involved with a Midwest farmer who lives a double life as a white supremacist.",
    "director": [
        {
            "@type": "Person",
            "name": "Costa-Gavras",
            "url": "/name/nm0002020/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWViZDNhNjMtYzY0MC00YWYwLTkxMTQtNzQ5M2RlOGM2YzlkXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "extremism,corn belt,fbi agent,widower,white supremacist",
    "name": "Betrayed",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol-kay"
        },
        "dateCreated": "2004-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094731/"
        },
        "name": "My loyalties are all screwed up!",
        "reviewBody": "****SPOILERS**** Shocking disturbing but at the same time penetrating film by director Costa-Garvras about terror in Americas heartland spilling over into the big city, Chicago. A popular but controversial Jewish talk show host Sam Kraus, Richard Libertini, gets gunned down by a group of white separatists in the garage of his apartment building the killers leave their calling card on the murder scene Z.O.G : Zionist occupied government. A phrase that the separatists use to refer to the US government all throughout the movie. \n\nThe FBI in trying to find and arrest those who perpetrated the crime send agent Cathy Phillips/ Kathy Weaver, Debra Winger, undercover to the farm land in the area where they think that the killers come from. Due to the very high anti-government sentiment there with farmers in danger of losing their land. It turns out that Agent Phillips should have been the last person for the FBI to put on a case like that due to her very sad home and family life. Phillips lost her parents at a very young age and had no family her entire life but her employer the FBI which was anything but loving and personal to her.\n\nIn the farm land and being undercover as Cathy Weaver she falls in love and lives with murder suspect Gary Simmons, Tom Berenger, and his family. Simmons is a widower with children who's mother also lives with him that has Cathy/Katie for the first time in her life have the family that she always longed for. This very fact is what Cathy says is \"Screwing up her loyalties\" to the government and FBI that she works for.Cathy/Katie desperately wants to be taken off the case before she betrays the man, Gary, as well as the family that she loves. Still the FBI refuses to do so because Cathy's in too deep and is too close to break the case on the Kraus killing.\n\nGary is also very honest with Cathy/Katie by telling her about himself and what he and his friends, the anti-government white separatists, are all about. Gary even takes Cathy/Katie out one night to a \"Hunt\" where Gary and his friends hunt down and murder a terrified young black man in the back woods. This makes Cathy/Katie feel terribly guilty since she's not honest with Gary even though Gary is so brutally honest with her about himself.\n\nDebra Winger is phenomenal as the FBI undercover agent who's emotions are stronger the her senses and is tortured in what she's doing by setting up her lover as well as his family for the FBI. Even though he's a murder and is planing with his friends to commit a major attack and assassination of a number of top government leaders. Tom Berenger is as good as he ever was as the all-America Vietnam war hero who comes across as a cross between Gary Cooper and Jimmy Stewart that it's hard to believe that he not only believes the radical ideas that he openly talks about but also practices them. Meanwhile with all this going on there's a sinister sub-plot about an Illinois election that is connected with Gary's group that goes totally unnoticed by the FBI until it's too late that Gary kept from Cathy/Katie which exploded at the end of the film.\n\nPre-dating April 19, 1995 Oklahoma City bombing by seven years and the 9-11 terrorists attacks on New York City and Washington D.C by thirteen the film is without a doubt one the best movie about terrorism on US soil ever made and It puzzles me why Costa-Garvras' \"Betrayed\" doesn't get the attention that it should after those two terrible events.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2949169177",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWVjMTcwODktOWE5Zi00MDA0LWEwYzUtZTIxN2JjNGE2ZWJhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWVjMTcwODktOWE5Zi00MDA0LWEwYzUtZTIxN2JjNGE2ZWJhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-20T11:56:47.246Z",
        "url": "https://www.imdb.com/video/vi2949169177/"
    },
    "url": "/title/tt0094731/"
}