{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean-Hugues Anglade",
            "url": "/name/nm0000767/"
        },
        {
            "@type": "Person",
            "name": "Béatrice Dalle",
            "url": "/name/nm0001095/"
        },
        {
            "@type": "Person",
            "name": "Gérard Darmon",
            "url": "/name/nm0201462/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22222,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Betty Blue",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066515/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090290/"
        },
        {
            "@type": "Person",
            "name": "Philippe Djian",
            "url": "/name/nm0229172/"
        },
        {
            "@type": "Person",
            "name": "Jean-Jacques Beineix",
            "url": "/name/nm0000894/"
        }
    ],
    "datePublished": "1986-11-07",
    "description": "A lackadaisical handyman and aspiring novelist tries to support his younger girlfriend as she slowly succumbs to madness.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Jacques Beineix",
            "url": "/name/nm0000894/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDEwYmM1MzktMzYyMy00M2VhLWJkZTUtNmIyMTcxZmRiZjQ1XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "obsessive love,nudity,public nudity,sexuality,sensuality",
    "name": "37°2 le matin",
    "original_info": {
        "id": "Betty Blue_1986",
        "name": "Betty Blue",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pedro_H"
        },
        "dateCreated": "2005-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090563/"
        },
        "name": "Funny, sexy, romantic, off-beat and a personal favourite.",
        "reviewBody": "A happy-go-lucky odd job man (Jean-Hugues Anglade as Zorg) falls in to a relationship with a slightly unhinged -- but very sexy/sexual -- French teenager named Betty (Béatrice Dalle in her debut role.) \n\nThere are very few films that are totally different from anything you have seen before. While sexually explicit -- it is far from objectionable because the two parties are in love and passionate about one another.\n\nBetty Blue/37°2 le matin doesn't really fall in to any one category -- going from farce to tragedy, stopping off at oddball. The two leads are amazing in their chemistry -- they really do look and act like they are in love. Also what an amazing debut by the Dalle, although her later life has shown that she has plenty of the Betty Blue in her for real.\n\n(Was this script written with her in mind? -- my search for the truth goes on.) \n\nStarting the film with a sex scene sets the film off on the totally the wrong foot. While the film is about sex -- and at times sexual repression -- there are times when it looks like it was set in a nudist camp. Even Jean-Hugues Anglade strolls around with it all on show -- thankfully he looks like he has kept up his gym membership.\n\nThe scene in which Betty throws the whole of the fixtures and fittings of the beach apartment out of the window was stolen by a famous car advert (in the UK) and it really is a stretch of the imagination in that Zorg doesn't respond to it. He just paints on and lets her get on with it -- like he doesn't care.\n\n(I think we all know how we would react in a similar situation and it wouldn't be like Zorg!)\n\nThis has great cinematography with every scene framed to perfection. The dour insides of the French household and the generally dirty oven and sink (usually with two weeks worth of dishes in them.) Very true if you know that part of the world!\n\nThe repeating, irregular, piano theme tune is what cinema is about -- when in the hands of people that know how to marry both mediums. Images and music fitting together to form a perfect marriage. Fantastic and moving.\n\nThe famous Roger Ebert of the Chicago Sun Times gives this low marks -- citing too much flesh being on display (among other faults) -- and this is sad given that he gave Kill Bill Part One top marks. A woman making love to a man she is in passionately in love with is tasteless -- a homicidal woman slicing the arms of a whole room of gangsters is OK?\n\nRoger -- I respect you a great deal, but you are as wrong as Leslie Halliwell (author of the world's most famous film guide book) when he gave Close Encounters no stars at all.\n\nYou should come over here (Europe) a bit more. Walk about the beaches of France and Spain and look at the amount of flesh on display and the way people show affection for one another without glancing 'round to see who is looking. True it has one or two sex scenes too many -- as I hinted before -- but it is sex that means something and is about something.\n\nBetty Blue is one of my top 200 films of all time and while it has its limits and its faults (it does sag a little in middle) it remains a powerful piece of work about living with crazy people and how easily good times can slip in to bad. I think if the sex was toned down and there was a bit more of the comedy/romance in the centre than this could easily be part of the IMDb top 200. Not that this really matters all that much.\n\nA product that only the French could make and one gets under your skin and stays there. \n\nThis review is a reference to the original cinema cut.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Betty Blue: The Director's Cut (Zorg Arrives Home To Find Betty Gone)",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1289274393",
        "name": "Betty Blue: The Director's Cut (Zorg Arrives Home To Find Betty Gone)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzY1YTViZjgtMDZmMy00YzdmLTg2ZTEtY2M5MzUzZDEwZjk5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzY1YTViZjgtMDZmMy00YzdmLTg2ZTEtY2M5MzUzZDEwZjk5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-03-03T19:02:28.333Z",
        "url": "https://www.imdb.com/video/vi1289274393/"
    },
    "url": "/title/tt0090563/"
}