{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbara Marten",
            "url": "/name/nm0551649/"
        },
        {
            "@type": "Person",
            "name": "Andrina Carroll",
            "url": "/name/nm1180911/"
        },
        {
            "@type": "Person",
            "name": "Andrew Dunn",
            "url": "/name/nm0242492/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 657,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0105008/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0937856/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003875/"
        },
        {
            "@type": "Person",
            "name": "Steven Woodcock",
            "url": "/name/nm1180439/"
        }
    ],
    "datePublished": "2021-12-10",
    "description": "Set in Northern England, this powerful tale of suppressed sexuality offers poignant and sharply observant social commentary, interlaced with a tender romance. Vetern actress Barbara Marten tugs at the heart as Ellen Hardy, a worki...",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Woodcock",
            "url": "/name/nm1180439/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA1NDg2NzUxNF5BMl5BanBnXkFtZTgwODM1NDk5NTE@._V1_.jpg",
    "keywords": "teacher,northern england,1950s,lesbian,period piece",
    "name": "Between Two Women",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jkujo"
        },
        "dateCreated": "2009-07-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0319056/"
        },
        "name": "f you consider yourself a purist, romanticist or idealist, you would appreciate this title!",
        "reviewBody": "If you consider yourself a purist, romanticist or idealist, you would appreciate this title! Very subtle yet a captivating screenplay throughout. A magnificent portrayal of a woman's love that only could be brought by woman's heart. Devastatingly romantic story. I am quite impressed by the splendid talents of captivating leading casts, masterful director, screen writer and crew of those who made the creation of this Magnificent masterpiece possible. I would not call this movie a lesbian film. It deserves to be categorised as mainstream story of love and trust between women so beautifully and intimately portrayed\n\nSince the beginning of civilisation philosophers, psychologists, many scholars and like had debated against the superiority of love that a woman can offer to all of man kinds (to both men and to women) . I personally view that of women are definitely superior to the others. Since the majority of us do not experience temporary loss of vision or complete loss of consciousness due to the required depth of sedation for major surgery such as open heart or open skull procedures. These procedures can cause tremendous trauma to your psyche. It is not unusual for patient and nurse to develop an almost like loving attachment to each other from the moment the nurse transfers you from a rolling bed to a recovery bed, then calling your name and caressing you as if rescuing you from desolated realm of unconscious. If you compare it with the same task performed by male surgical assistants at operating room ,you will be impressed with the fact that a woman's love is a priceless enlightenment. It is highly likely that someone like Ellen had finally awakened from a life-long repression to that enlightenment by following her own heart. Every female child has dreams of being swept up into a great adventure, of being the beautiful princess. Lamentably, when women grow up, they are often swept up into a life filled merely with demands, duty and responsibility. Many women are tired, struggling under the senseless pressure to be of a faithful servant, or a caregiver for children, husband or father and like. If Chen An had realised that demands from her father were unreasonable, the both girls could have survived. I have known an award winning blind female writer and her nurse companion who helped her publishing her novels until the end of writer's life age 72. The nurse died next summer found afloat on River Kamo during Gion Festival (Buddhist Spiritual season) leaving a will to be buried next to the writer. In fact I have seen them twice together on the bridge across a pond within the property of an ancient Buddhist temple in 1970's. Nurse were eyes to the writer and describing everything that the nurse can see. The both women looked very beautiful radiating the glory of love between them. They both were descendant of ancient noble families go back to 11th century and their presence seemed to enhance the tranquillity of the mid-autumn setting. I could not help but wishing their happy union forever from the moment I saw the strength and intensity of woman's love. I have always been a straight male, However, it has forever changed my attitude about woman's love. So let's wish the two women best luck and let them pursue their happiness! Julien Kujo a.k.a.,Pinecloud, Palo Alto, CA., USA",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Set in Northern England, this powerful tale of suppressed sexuality offers poignant and sharply observant social commentary, interlaced with a tender romance.",
        "duration": "PT5M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1629405977",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2RlZGM1NWQtMWEwNC00ODA3LWExYzItNzAxN2ZiMGM1MDVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2RlZGM1NWQtMWEwNC00ODA3LWExYzItNzAxN2ZiMGM1MDVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-28T21:47:45.527Z",
        "url": "https://www.imdb.com/video/vi1629405977/"
    },
    "url": "/title/tt0319056/"
}