{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lou Castel",
            "url": "/name/nm0144589/"
        },
        {
            "@type": "Person",
            "name": "Eddie Constantine",
            "url": "/name/nm0176061/"
        },
        {
            "@type": "Person",
            "name": "Marquard Bohm",
            "url": "/name/nm0006739/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2415,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Beware of a Holy Whore",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0130368/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137950/"
        },
        {
            "@type": "Person",
            "name": "Rainer Werner Fassbinder",
            "url": "/name/nm0001202/"
        }
    ],
    "datePublished": "1983-07-15",
    "description": "On a film set there are two things missing, the film material and the director. So the actors and actresses as well as the crew try to make the best out of the situation. When the director arrives the material is still missing and...",
    "director": [
        {
            "@type": "Person",
            "name": "Rainer Werner Fassbinder",
            "url": "/name/nm0001202/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzUyNjYyYTYtYWVkNi00ZGU1LTg3MDYtZmM3ZTBhMTZiNzg0XkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_.jpg",
    "keywords": "drunk,alcohol consumption,new german cinema,animosity,bisexual interest",
    "name": "Warnung vor einer heiligen Nutte",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "semiotechlab-658-95444"
        },
        "dateCreated": "2010-03-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067962/"
        },
        "name": "Auto-Psychogram of the Fassbinder family",
        "reviewBody": "\"Warnung Vor Einer Heiligen Nutte\" (1971) is everything else than an obscure, hermetic and highly stylized movie. Before you watch this masterpiece of the middler Fassbinder, you should read the biography by Peter Berling, \"Die 13 Jahres Des Rainer Werner Fassbinder\" (1992). Peter Berling was also the producer of the \"Holy Whore\" and acted a part in it. It is a very precise description of practically all members of Fassbinder's troop since the time of the \"antiteater\". However, the persons have been exchanged. So, f.ex. Magdalena Montezuma plays \"Irm\", i.e. Irm Hermann, who also is the dubbing voice of Montezuma. She accuses \"Jeff Kocsinsky\", the director of the picture \"Morte o Patria\", of having stolen her years, promised to marry her and have children with her. Jeff is of course Fassbinder, while Fassbinder himself plays the role of \"Sasha\", probably an invented role. However, it is astonishing that Fassbinder's family agreed to unwrap their own and not only personal but highly private problems in front of the public. A highlight in this respect is \"Fred\" alias Kurt Raab. He is the artistic director of the movie - as he was in his real life, a weak and subordinate creature depending on love or hatred of his always changing lovers. It shows anew what a magnificent actor Raab was. Lou Castel as Fassbinder alias \"Jeff\" does a very great job. The same man who is determined to make a movie against brutal state force is using on the set all imaginable means of force up to terror against his actors and staff. Concluding, I would even say that \"The Holy Whore\" is a example of bravura of how one can make a movie with basically nothing, if there is a group who is determined to create something together.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0067962/"
}