{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Motoko Kumai",
            "url": "/name/nm1050267/"
        },
        {
            "@type": "Person",
            "name": "Houko Kuwashima",
            "url": "/name/nm0476678/"
        },
        {
            "@type": "Person",
            "name": "Aya Hisakawa",
            "url": "/name/nm0386752/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 435,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0135045/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0940087/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015560/"
        },
        {
            "@type": "Person",
            "name": "Takao Aoki",
            "url": "/name/nm1247689/"
        },
        {
            "@type": "Person",
            "name": "Yoshio Takeuchi",
            "url": "/name/nm0847614/"
        },
        {
            "@type": "Person",
            "name": "Robert Pincombe",
            "url": "/name/nm1416643/"
        }
    ],
    "datePublished": "2005-03-22",
    "description": "Tyson and the Bladebreakers must stop an unleashed dark shadow group called the Shadow-Bladers and save the world in the ultimate Beyblade showdown battle!",
    "director": [
        {
            "@type": "Person",
            "name": "Yoshio Takeuchi",
            "url": "/name/nm0847614/"
        }
    ],
    "duration": "PT1H14M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2YxNGY1YTQtNjM3Ny00NDJlLThjMWMtYmM1NTMyNWYwMDBkXkEyXkFqcGdeQXVyNjQyNzU5NzU@._V1_.jpg",
    "keywords": "anime animation,battle,shadow,vacation,teenager",
    "name": "Beyblade: The Movie - Fierce Battle",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "smetin"
        },
        "dateCreated": "2017-05-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0459080/"
        },
        "name": "Fun movie on an alternate timeline",
        "reviewBody": "I have recently watched the 3 seasons of Beyblade and was told about this movie. All I knew is that it was non-canon and is an alternate account about how Tyson met Daichi (somewhat different to how Harry met Sally...). \n\nThe movie introduces the concept of dark bitbeasts and their release into the world when Tyson battles Daichi for the first time. These bitbeasts are reflections of Dragoon, Dranzer, Driger and Draciel and builds on the idea that these are the Guardian bitbeasts (from season 2). It was a novel idea that was a nice break from the World Championships and the repetitive element of someone trying to steal bitbeasts to rule the world. In this instance, 4 innocent people are possessed to embody the Bladers that control the dark bitbeasts. These Bladers were out to defeat the Bladebreakers and imprison the Guardian bitbeasts. \n\nIt is quite a simple story in essence, but I was happy that it returned the origins of the bitbeasts and gave us a bit more of an explanation about them. I almost wish that this story replaced the comparatively lacklustre introduction of Daichi in season 3. It was not a perfect story though. I wished that the other members of the Bladebreakers had more of a role in this movie. It just felt as though there were cameos and the main focus was on Tyson and Daichi. Although Tyson is the main protagonist in this story, the other characters still deserved to have more of a role. I was also slightly annoyed by how they changed the voice of Chief, although this was only a minor issue.\n\nThe animation was as it was in season 3. The characters looked their age, which was the main issue I had with their overly youthful look in season 2. In places the animation was a bit off. It just seemed that the movie was made in a bit of a rush. Perhaps there were time pressures or cost cutting problems. I still think that these issues could have been solved by a more intensive editing process that gave season 3 such a high quality look. \n\nAll in all, I enjoyed this movie and would recommend it if you enjoyed the original series. There are a few minor annoyances in the storyline and the character's involvement, but it does not detract from the overall experience. Enjoy!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0459080/"
}