{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeffrey Combs",
            "url": "/name/nm0001062/"
        },
        {
            "@type": "Person",
            "name": "Tommy Dean Musset",
            "url": "/name/nm1459586/"
        },
        {
            "@type": "Person",
            "name": "Jason Barry",
            "url": "/name/nm0058029/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12443,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071913/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080776/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019535/"
        },
        {
            "@type": "Person",
            "name": "José Manuel Gómez",
            "url": "/name/nm1265923/"
        },
        {
            "@type": "Person",
            "name": "H.P. Lovecraft",
            "url": "/name/nm0522454/"
        },
        {
            "@type": "Person",
            "name": "Miguel Tejada-Flores",
            "url": "/name/nm0854185/"
        }
    ],
    "datePublished": "2003-07-25",
    "description": "After 13 years in prison, the mad scientist from Re-Animator (1985) gets a new chance to experiment with the arrival of a young prison doctor, who secretly hopes to learn to reanimate dead people. Good intentions turn to horror.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Yuzna",
            "url": "/name/nm0951206/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWJkZGFiYWQtZmU3ZS00NDhhLThlYzAtNzkzNjRhYTAxYjg3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "based on short story,part of trilogy,childhood trauma,gore,sequel",
    "name": "Beyond Re-Animator",
    "original_info": {
        "id": "Beyond Re-Animator_2003",
        "name": "Beyond Re-Animator",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bmoviep"
        },
        "dateCreated": "2017-02-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0222812/"
        },
        "name": "A failed attempt to give life to a dead series",
        "reviewBody": "Beyond re-animator is the final installment of Stuart Gordon's \"Re-animator\" series that began in 1985 and like most late installments, comes off as unnecessary and a failed attempt to cash in on a popular title. In the fashion of \"Jason goes to Hell\", \"Freddy's dead: The Final Nightmare\" and \"Halloween: H20\", Beyond Re-animator attempts to restart the series by trying to retcon certain plot elements while pretending to be a legitimate sequel. The result, as usual was a colossal mess of inconsistencies, leaving only the most superficial elements from the original two films without the heart of what made those films so beloved in the first place. We find our protagonist Herbert West imprisoned in a federal jail after his former assistant Dan Kain apparently turned him in to the authorities for his illegal experimentation. We never find out why Dan, a prominent character in the original films would do such a thing and Beyond Re-animator brushes off any details as unimportant. We're also provided with no explanation as to how West escaped the cliffhanger conflict at the end of the last film \"Bride of Re-animator\". Jeffrey Combs reprises his role as the mad scientist, who continues his devilish experiments on whatever subjects he can gain access to within the confines of his small prison cell. However, everything changes for West when Dr. Howard Philips (Jason Barry) takes over as the prison physician. Philips had witnessed the power of West's reagent serum as a child and has since become obsessed with the science of re-animating the dead. Handing West his iconic syringe containing the glowing green reagent, it's only a matter of time before West restarts his old experiments, and the entire prison is thrown into chaos. The film plays out in the typical fashion that we've come to expect from this series. Characters die only to be used as test subjects for West and Philips who bring them back to life as vicious, murderous monsters. The style blends graphic body horror with ridiculous slap stick comedy. While entertaining at times, Beyond Re-animator does little more than copy it's predecessors and fails to further the story of Herbert West in any meaningful way. The absence of Stuart Gordon is obvious as the film feels more like a what if scenario, rather than a genuine attempt to further an existing mythos. The story is convoluted as the majority of scenes serve little more than excuses to get from A to point B. For example, there's an ongoing joke about one of the inmates having a pet rat. We see West experiment on the rat which serves as an all to predictable foreshadowing of the rat being re-animated as one of West's experiments and eventually attacking his former owner. The characters in this film, save for Herbert West, were all one dimensional and failed to establish meaningful identities for themselves. Herbert West is deranged and lacking in social graces as always, making him the sole source of entertainment. By comparison, the scenes without West were uninteresting and took up far to much of the film's run time. It was fun seeing Jeffrey Combs reprise his most famous role one last time. However, the unoriginal plot and hollow performances by the rest of the cast simply couldn't keep up with him and ultimately dragged him down along with them and the rest of this film. Beyond Re-animator attempted to bring new life to the Re-animator series. Unfortunately, this experiment was a failure.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0222812/"
}