{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fanny Ardant",
            "url": "/name/nm0000272/"
        },
        {
            "@type": "Person",
            "name": "Chiara Caselli",
            "url": "/name/nm0143309/"
        },
        {
            "@type": "Person",
            "name": "Irène Jacob",
            "url": "/name/nm0001393/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6026,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Beyond the Clouds",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062587/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010766/"
        },
        {
            "@type": "Person",
            "name": "Tonino Guerra",
            "url": "/name/nm0346096/"
        },
        {
            "@type": "Person",
            "name": "Michelangelo Antonioni",
            "url": "/name/nm0000774/"
        },
        {
            "@type": "Person",
            "name": "Wim Wenders",
            "url": "/name/nm0000694/"
        }
    ],
    "datePublished": "1995-10-27",
    "description": "Four stories about short or long relationships between men and women in Italy and France.",
    "director": [
        {
            "@type": "Person",
            "name": "Michelangelo Antonioni",
            "url": "/name/nm0000774/"
        },
        {
            "@type": "Person",
            "name": "Wim Wenders",
            "url": "/name/nm0000694/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTQ0MmFkYTUtMzQ1Yy00MGEzLWE3YTItYTBjNWZkMGFhNGY1XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "female rear nudity,nudity,france,promiscuous woman,coitus",
    "name": "Al di là delle nuvole",
    "original_info": {
        "id": "Beyond the Clouds_1995",
        "name": "Beyond the Clouds",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zetes"
        },
        "dateCreated": "2001-04-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114086/"
        },
        "name": "A moderate failure; still worth seeing",
        "reviewBody": "Michelangelo Antonioni is one of the major figures of cinema history, even if most people haven't heard of him. He was nowhere near as prolific as filmmakers such as Fellini, Godard, Bergman, Kurosawa, or Truffaut. And his films now are difficult to procure. There are only a few readily available, and I have seen all of those but one (Il Grido, which has recently been released on DVD by Kino). Four of the five Antonioni films that I've seen, L'Avventura, Red Desert, Blowup, and The Passenger are among the best films ever made. One other that I've seen, L'Eclisse, I think probably is also to be included among them; if only the video that I saw would not have been so horribly defiled! Now I have seen Beyond the Clouds.\n\nI had always heard that it was a great failure, but it was difficult to lower my expectations of Antonioni. Wim Wenders' presence did not help, either. Throughout the film, there were many things that annoyed me, and also many things that I loved. I think a pros/cons list will help here.\n\nCons:\n\n1. The writing seems weak. All the stories told have little depth, it seems, and we find out almost nothing about anybody we meet in the picture. Usually, Antonioni's writing can be used to show just how well a film can be written, and his characters are the definition of \"complex.\" But in another way I can also see the style of writing presented here in a more positive light, which I'll comment on later.\n\n2. The acting is really weak. I cannot in any way defend it. There is not one performer who isn't subpar here, and most of the actors are second-rate actors in the first place (Irene Jacob excepted). John Malkovich is one of the hammiest actors who's ever lived. The only thing I ever liked him in was Being John Malkovich, because that film delightfully (and, apparently, unnoticeably, at any rate by Malkovich himself) mocked his very pretensions, which are in full force in this film.\n\n3. Casual nudity - okay, no one on Earth wants to see John Malkovich buck naked. Fortunately, if you are a fan of female nudity, nearly every woman in the film, including Bond girl Sophie Marceau, appears naked from head to foot with everything in between (sorry, Irene Jacob fans, no nudity from her!). I myself don't mind nudity when it is called for, like in Last Tango in Paris, but the rampant nudity in this film makes it seem like European softcore along the lines of Emmanuel. Actually, the softcore it really reminded me of was Red Shoe Diaries. The light jazz by Van Morrison just adds to this effect. Antonioni was once a proto-feminist. Many of his most famous films were from a distinctly female point of view. And when men did take over in his films, they were very unlikable. Here, the women are often exploited.\n\nPros:\n\n1. Cinematography - okay, we have two of the best visual directors of all time working on this film, the cinematography ought to be outstanding. It is, generally. There are a couple of visual moments that are absolutely spectacular, some of the best I've ever seen. This includes an ethereal scene where Malkovich explores a deserted playground on a beach. He sits on a swing, spins around in it with a shot that involves a beautifully moving camera, and then we watch a strong wind blow sand around on the beach (Antonioni loves showing the wind in his films). Another great visual scene involves a camera gliding about a spiral staircase near the end of the film.\n\n2. Mood - The nonchalant flow of the narrative actually adds a lot of mood. The title of the film is entirely appropriate. You do feel as if you're witnessing something beyond the clouds. Certain stories are left in suspension, never to be resolved, and it feels right. By the final scene, Beyond the Clouds had nearly won me over. Still, there were too many things wrong with it to suggest it to non-Antonioni fans, but Antonioni fans owe it to themselves to see it once. 6/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0114086/"
}