{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin Spacey",
            "url": "/name/nm0000228/"
        },
        {
            "@type": "Person",
            "name": "Kate Bosworth",
            "url": "/name/nm0098378/"
        },
        {
            "@type": "Person",
            "name": "John Goodman",
            "url": "/name/nm0000422/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15217,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104308/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0128465/"
        },
        {
            "@type": "Person",
            "name": "Kevin Spacey",
            "url": "/name/nm0000228/"
        },
        {
            "@type": "Person",
            "name": "Lewis Colick",
            "url": "/name/nm0171474/"
        }
    ],
    "datePublished": "2004-12-29",
    "description": "A swooning study of \"Mack the Knife\" singer Bobby Darin and specifically his relationship with wife Sandra Dee.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Spacey",
            "url": "/name/nm0000228/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY2MzI0ODE3NF5BMl5BanBnXkFtZTYwODI4NDM3._V1_.jpg",
    "keywords": "sandra dee,bobby darin,career,marriage,singer",
    "name": "Beyond the Sea",
    "original_info": {
        "id": "Beyond the Sea_2004",
        "name": "Beyond the Sea",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JohnDeSando"
        },
        "dateCreated": "2004-12-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0363473/"
        },
        "name": "Beyond the Sea is as much about Kevin Spacey as it is Bobby Darin.",
        "reviewBody": "If you can overcome what I can't, you will enjoy Beyond the Sea: Kevin Spacey is too old to play Bobby Darin, the 50's pop singer who died from long-term effects of rheumatic heart at 37. At times Spacey is playing Darin in his twenties when no matter how you tighten and pin Spacey's face, he is still a 44-year old man with all the lovely creases and bags time awards. The dislocation bothered me so that I couldn't fully appreciate what is otherwise an outstanding performance.\n\nBut then Spacey is the director, so he has to be responsible for miscasting (or put another way, why didn't he do this 10 years ago when no one on this planet could have denied that he is the perfect Darin?). As John Irving said in \"My Movie Business\" about the choice of actors, \"Looks do count.\" Although others have criticized Beyond the Sea as a Spacey vanity project, I found his performance believable and engaging with style appropriate to the best lounge singers of the time (Sinatra included) and spot-on perfect for Darin, if not better than the original. I've heard Spacey is touring with his band to promote this biopic; I'd go just to enjoy Spacey as a gifted singer.\n\nThe only moments to get past the many Darin songs and into his life are those centering on the influence of his \"mother\" (Brenda Blethyn, \"Secrets and Lies\") and his marriage to Sandra Dee (Kate Bosworth). In the former, Blethyn does a bit of singing and dancing to show that Spacey is not the only multi-talent on the set. In the latter, the pop- culture lite of their romance is handled believably, as one might try to do David Beckham and his spicey love, a marriage just a vacuous and emblematic as the Darins'.\n\nThe irony of Sandra's mother wanting her to go after Rock Hudson rather than Darin brings laughter, intended for sure, as the audience is aware of Spacey's contending with rumors about being gay. Even jokes about Darin's toupee resonate with Spacey's own rugs in real life and for this part. Spacey doesn't take himself as seriously as critics do (witness an early scene where in the framing device of Darin filming his own life, he is accused of being too old to play himself).\n\nThe conjunction of subject and biographer is challenging at best. Paul Murray Kendall in \"The Art of Biography\" says, \"On the trail of another man, the biographer must put up with finding himself at every turn: any biography uneasily shelters an autobiography within it.\" In that sense, Beyond the Sea is as much about Kevin Spacey as it is Bonny Darin.\n\nThis biopic ranks third next to Ray and De-Lovely; in another less-full year, it would be the best."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Music Makers' edition of the biopic",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1541866521",
        "name": "Beyond the Sea",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWMzYzY1NjItNWIxZi00Y2EyLWE1ZjctOGU4YWY3ZTQ5Nzg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWMzYzY1NjItNWIxZi00Y2EyLWE1ZjctOGU4YWY3ZTQ5Nzg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T14:30:21Z",
        "url": "https://www.imdb.com/video/vi1541866521/"
    },
    "url": "/title/tt0363473/"
}