{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ching Wan Lau",
            "url": "/name/nm0490513/"
        },
        {
            "@type": "Person",
            "name": "Jordan Chan",
            "url": "/name/nm0150952/"
        },
        {
            "@type": "Person",
            "name": "Tat-Ming Cheung",
            "url": "/name/nm0156579/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 974,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Big Bullet",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035542/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033915/"
        },
        {
            "@type": "Person",
            "name": "Benny Chan",
            "url": "/name/nm0150802/"
        },
        {
            "@type": "Person",
            "name": "Susan Chan",
            "url": "/name/nm0151113/"
        },
        {
            "@type": "Person",
            "name": "Joe Ma",
            "url": "/name/nm0530865/"
        }
    ],
    "datePublished": "1996-06-25",
    "description": "After assaulting his tactical commander during a raid gone sour, a dedicated but temperamental cop Sergeant Bill Chu is demoted to the Emergency Unit, long considered to be the police force's dumping ground for problem cops.",
    "director": [
        {
            "@type": "Person",
            "name": "Benny Chan",
            "url": "/name/nm0150802/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWZlOTY3NmEtNjgxNy00YTViLTliYTYtYjQzY2RkMjRkZTBhXkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_.jpg",
    "keywords": "police,police protagonist,police misconduct,attacking superior officer,british hong kong",
    "name": "Chung fung dui: No foh gai tau",
    "original_info": {
        "id": "Big Bullet_1996",
        "name": "Big Bullet",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SiuWing"
        },
        "dateCreated": "1999-12-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0126839/"
        },
        "name": "Hong Kong Emergency Police Unit vs International Criminals",
        "reviewBody": "When you hear of dealing with international criminals, you may think of great detectives or whatever high competent police units. This film, therefore, can give you surprise that the emergency police unit, which is actually in relatively low level, was the main team to cope with the great organized criminals by some reasons.\n\nI found it is not only a great and brilliant action movie, but also a good drama. The team, consisted of several policemen and one policewoman who have different characteristics, showed many precious human relationships. There are brotherhood, conflict, collaborating as well as compromising. I love this film because I was touched by their team working spirit. I felt as if I were one of them.\n\nMoreover, I appreciate Benny Chan who was a director of this film so much. He has his own style to create action scenes, they are poetic instead of too violent. I especially love the shooting scene in Central(where is the most crowded place in Hong Kong), just see it and you'll know how intense the shooting was. If you've already watched all John Woo's films and hence you're hunger for seeing somthing great and stylish action scenes, Benny Chan can satisfy your needs.\n\nBesides the actors in the emergency unit, I was excited by the performance of Francis Ng. He did a short part of the film since he was killed in a busy road in Central at the quite beginning. I was impressed the way he presented his character.\n\nIn short, good plot, good director and brilliant actors as well as great action scenes (though it still have rooms for improvement if there is higher budget ) you'll find in this film. I rate it 10 out of 10! Make Benny Chan's film as your first choice!"
    },
    "url": "/title/tt0126839/"
}