{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adam Sandler",
            "url": "/name/nm0001191/"
        },
        {
            "@type": "Person",
            "name": "Joey Lauren Adams",
            "url": "/name/nm0000725/"
        },
        {
            "@type": "Person",
            "name": "Jon Stewart",
            "url": "/name/nm0829537/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 223382,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064748/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052395/"
        },
        {
            "@type": "Person",
            "name": "Steve Franks",
            "url": "/name/nm0291692/"
        },
        {
            "@type": "Person",
            "name": "Tim Herlihy",
            "url": "/name/nm0379056/"
        },
        {
            "@type": "Person",
            "name": "Adam Sandler",
            "url": "/name/nm0001191/"
        }
    ],
    "datePublished": "1999-06-25",
    "description": "A lazy law-school grad adopts a kid to impress his girlfriend, but everything doesn't go as planned and he becomes the unlikely foster father.",
    "director": [
        {
            "@type": "Person",
            "name": "Dennis Dugan",
            "url": "/name/nm0240797/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWJmZTExZTYtZjg1Mi00ZDFmLTk3MTYtZTUwYzkzODA2M2ZmXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_.jpg",
    "keywords": "new york city,adoption,responsibility,immaturity,homosexual",
    "name": "Big Daddy",
    "original_info": {
        "id": "Big Daddy_1999",
        "name": "Big Daddy",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Brogan"
        },
        "dateCreated": "1999-06-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0142342/"
        },
        "name": "Adam Sandler in top form!",
        "reviewBody": "While all of the somphoric pre-teens will be giggling silly at the childish potty jokes shown in AUSTIN POWERS 2, the real adults will be laughing their heads off in a much funnier film called BIG DADDY. This is Sandler's sixth starring role feature, and it seems that the sixth time is a splending charm. This is Sandler's best work yet! Now in case you are wondering, I enjoyed both HAPPY GILMORE, and THE WEDDING SINGER. But there's something charming and wonderful on why I enjoyed BIG DADDY more. Perhaps it's seeing a over-grown kid taking care of a little boy. Or it's Sandler mixing his in your face attitude that he gave in HAPPY GILMORE with his soft-spot attiude from THE WEDDING SINGER. Whatever it is, it works, and it works very well! The simple plot of BIG DADDY is a 5 year old child is left on the doorstep of Sandler's apartment. It turns out to be the child of his roommate (Jon Stewart), who's on his way to China for a legal case. So what is Sandler to do, but to give him to the child protective service. But it's a holiday, and they are closed, so Sandler keeps him for a day, then another day, and... well you get the picture. But the plot doesn't matter much with this film, it's the laughs, and you do get plenty of those. But you also get a wonderful supporting cast. There's a good support from Jon Stewart, the always wonderful and beautiful Joey Lauren Adams, Leslie Mann, and Kristy Swanson (the original Buffy the Vampire Slayer). And what's a Sandler movie like if you don't have his usual character actor friends in small comic roles; Rob Schrieder, Steve Buscemi, Josh Mostel, Allen Covert (the caddy from HAPPY GILMORE who was also the limo driver friend in THE WEDDING SINGER), and Jonathan Loughran (the lazy-eyed football player in THE WATERBOY). There's even a funny cameo role by director Dennis Dugan, as the man who refuses to answer the door on Halloween, while Sandler is taking his adopted son trick or treating. This film was a lot more funnier that THE WATERBOY, it was also funnier than THE WEDDING SINGER and HAPPY GILMORE. It was believe it or not, more touching. You can understand why Sandler doesn't want to let this boy go, since he reminds him so much of himself. And Sandler sees that being a father figure isn't only fun, but it redeems himself from the lost of his girlfriend. I have to give both Sandler and director Dennis Dugan (the same director of HAPPY GILMORE) a round of applause. They teamed up for a comedy that is not only successful, but will make A LOT of money. Sandler and Dugan are the best comedian/director team since the late John Belushi and John Landis. I'm just hoping that they will continue to do films together in the futrue. Until then, take your date, your friends, or heck just go alone and enjoy one of the funniest comedies (next to ANALYZE THIS, ELECTION, and RUSHMORE) of this year. This is a wonderful treat! ****1/2 (out of five)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Big Daddy",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi979346457",
        "name": "Big Daddy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjE1ZjZjZDAtNzFmZS00YzM3LWIzYzAtOThhZTU0NTA0YmI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjE1ZjZjZDAtNzFmZS00YzM3LWIzYzAtOThhZTU0NTA0YmI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-11-02T03:05:05Z",
        "url": "https://www.imdb.com/video/vi979346457/"
    },
    "url": "/title/tt0142342/"
}