{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Arye Gross",
            "url": "/name/nm0343325/"
        },
        {
            "@type": "Person",
            "name": "Eric Schweig",
            "url": "/name/nm0777760/"
        },
        {
            "@type": "Person",
            "name": "Tim DeKay",
            "url": "/name/nm0215229/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4708,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064208/"
        },
        {
            "@type": "Person",
            "name": "Thomas Bezucha",
            "url": "/name/nm0080120/"
        }
    ],
    "datePublished": "2000-04-18",
    "description": "Big Eden is a small, fictional northwestern Montana town.",
    "director": [
        {
            "@type": "Person",
            "name": "Thomas Bezucha",
            "url": "/name/nm0080120/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmJhM2Q1NDItMGVhNi00ZTg5LTkwMmMtODQ3NmNlMjNiOGJiXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "gay relationship,montana,artist,native american,kiss",
    "name": "Big Eden",
    "original_info": {
        "id": "Big Eden_2000",
        "name": "Big Eden",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbrumburgh-1"
        },
        "dateCreated": "2001-07-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0212815/"
        },
        "name": "Too good to be true...still a warm, wistful romantic comedy with its heart in the right place.",
        "reviewBody": "'Eden' is right...for this rustic, fictional Montana town is a gay-embracing garden paradise. And why not? Movies are for dreamers and in this dream of a movie we get to witness a basically straight-laced, flag-waving midwestern town embrace homosexuality like never before. In fact, the town is more openly accepting of the gay lifestyle than the rather emotionally repressed romantic trio who are at the core of the piece. And therein lies its simple bouquet of a message. The only one who usually gets in the way of you being yourself...is yourself.\n\nA lovely cross between Meg Ryan-Tom Hanks fluff and \"Northern Exposure\" quirkiness, \"Big Eden\" insists on keeping it merry and informal, confident in knowing that its casual, natural stance on the whole gay element actually gives it universal appeal.\n\nArye Gross fills in for Meg here as Henry Hart, a former citizen of \"Big Eden\" who many years ago moved to the Big City to 'be himself'. The prodigal son, still single, reluctantly returns home following the illness of a beloved relative and is surprisingly met with open arms. The rather chummy, eccentric inhabitants, in fact, hatch matchmaking plans to hopefully dissuade him from leaving.\n\nTim DeKay plays the muscular, clean-cut Dean, a former school chum and longtime crush of Henry's who has returned to his roots following a failed marriage and is now a doting single parent with two kids in tow. Henry is hoping to spark the dormant but still smouldering feelings they once shared. Eric Schweig plays another classmate, Pike, a strong, silent, highly sensitive Native-American who has longed for the unsuspecting Henry since their early school days.\n\nThe story keeps its limited sights on the amusing entanglements of the trio, never allowing itself to get overly serious or preachy. Things may end up a bit too tidy and neat, but, again, the beauty of the piece is in its \"gay is normal\" approach and almost 60s-like wholesomeness.\n\nThe performances are nothing spectacular to write home about, but nevertheless quite winning and thoroughly entertaining. Arye Gross (former of \"Ellen\") is a pleasant centerpiece, as a man searching not only for love, but for himself and his place in life. DeKay is equally charming as Henry's object of desire though his sexual confusion (or acceptance) seems puzzling coming from such a liberal-minded town. Schweig, looking like he belongs in a production of \"One Flew Over the Cuckoo's Nest\" instead of a gay love story, overplays the unbearably shy, intensely quiet type at first, but eventually relaxes into his role as he begins to make his feelings known.\n\nThe mirthful supporting cast is littered with fresh takes on old stereotypes, none more so than the wonderful Nan (\"Goodbye Columbus\") Martin as the brazenly intrusive Widow Thayer, whose bold, Yenta-styled matchmaking methods are never less than delightful. Louise Fletcher and, particularly, George Coe give wise, restrained performances that lend a touch of class to the silly antics and superficial tendencies of the story. Veanne Cox too provides a bit of amusing sass as Henry's endearing 'Big City' partner and friend.\n\n\"Big Eden\" settles in as one of the more 'feel good' movies of the year. I think even Doris Day would give it her stamp of approval. A welcome time-filler indeed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Big Eden",
        "duration": "PT3M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2552345369",
        "name": "Big Eden: Blu Ray",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmZkNmQ4NjgtNzA5OS00ZTc1LTg0NzMtM2RkMjhhNWRlY2U4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmZkNmQ4NjgtNzA5OS00ZTc1LTg0NzMtM2RkMjhhNWRlY2U4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-09-03T04:20:11Z",
        "url": "https://www.imdb.com/video/vi2552345369/"
    },
    "url": "/title/tt0212815/"
}