{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marcus Thomas",
            "url": "/name/nm0859197/"
        },
        {
            "@type": "Person",
            "name": "Amy Smart",
            "url": "/name/nm0005442/"
        },
        {
            "@type": "Person",
            "name": "John Corbett",
            "url": "/name/nm0179173/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1554,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0143069/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142408/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0084000/"
        },
        {
            "@type": "Person",
            "name": "Rodney Patrick Vaccaro",
            "url": "/name/nm0882867/"
        }
    ],
    "datePublished": "2005-02-18",
    "description": "A man with a boring personality, job, life, and dumped by girlfriend, auditions at the community theater and gets the lead role as Cyrano despite no acting experience. It changes his life forever.",
    "director": [
        {
            "@type": "Person",
            "name": "Al Corley",
            "url": "/name/nm0179959/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyODE0OTk3NF5BMl5BanBnXkFtZTcwODM4MzgyMQ@@._V1_.jpg",
    "keywords": "male female relationship,play within film,portland oregon,theater,sword fight",
    "name": "Bigger Than the Sky",
    "original_info": {
        "id": "Bigger Than the Sky_2005",
        "name": "Bigger Than the Sky",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gradyharp"
        },
        "dateCreated": "2005-07-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0363504/"
        },
        "name": "\"There is no 'I' in me...\"",
        "reviewBody": "BIGGER THAN THE SKY has the feel of an Indie that was made out of a lot of love and commitment from all concerned. That's a good thing, but at the beginning of this little film the viewer questions whether or not the actors can make the story fly - and if you actually want to take the trip with them. But stick it out because a sound film well made rewards the hesitation. It is a 'little man finds his way' tale that makes good sense and provides good entertainment.\n\nPeter Rooker (Marcus Thomas) is in a depressed slump after his girlfriend has dumped him. He is a 'cellophane man' computer artist, living the solitary life, noticed by no one, longing for a feeling of belonging. The place is Portland, Oregon. Peter notes the posting of auditions for a Portland Community Theater production of 'Cyrano de Bergerac' and slowly decides to attempt a moment of belonging by auditioning for the play: if he could just land a small part at least he'd belong.At the auditions he meets the warmly friendly theatrical group: Michael (John Corbett) who is a fine actor with no sense of future, Grace (Amy Smart) a pretty young sprite and competent trouper, director Edwina (Clare Higgins) who is a true theater person preferring to unmask the real Cyrano rather than hide him behind the infamous nose, sassy costumer Mrs. Keene (Patty Duke), and theater founder and adviser Kippy (Alan Corduner) who has retired from the theater due to his progressive cancer.\n\nTo everyone's surprise, especially Peter's, Peter lands the title role of Cyrano while Michael becomes Christian and Grace becomes Roxanne. Edwina's faith in the audition honesty of Peter has bolstered her own commitment to her dreams and she works with the cast to mold this very inexperienced (read lousy) actor into the tough role of Cyrano. Peter finds joy in the camaraderie of the actors, and for the first time in his life he becomes a social person. As the play is rehearsed Peter and Michael and Grace become a misguided trio - Peter does not understand the promiscuous life of the actors - and when Peter loses his job because of his increased involvement in the theater, he is informed that Edwina is forced to replace him with a seasoned actor Ken Zorbell (Sean Astin) at the 13th hour.\n\nAs good comedies go there are unexpected turns of events at every level of the remaining time until the opening night and the ending results in the personal growth of each of the actors and company. There are some well-drawn performances from John Corbett, Amy Smart, Clare Higgins, Patty Duke (in two roles), Alan Corduner, and ultimately Marcus Taylor (he is so convincingly an untrained actor at the beginning of the film that the audience will think he is wholly without talent!). Director Al Corley keeps the community theater magic alive and Rodney Patrick Vaccaro's script is sparkled by incidental quotes from Rostand's play. And to sum up the final product of the film in Cyrano's word, it has 'panache'. Not a great film, but a warm little story that examines the lonely lives of people who need the stage of a community theater to find themselves. Grady Harp",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0363504/"
}