{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Billy Joel",
            "url": "/name/nm0005055/"
        },
        {
            "@type": "Person",
            "name": "David Brown",
            "url": "/name/nm1075354/"
        },
        {
            "@type": "Person",
            "name": "Tommy Byrnes",
            "url": "/name/nm1343943/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 170,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0585524/"
        },
        {
            "@type": "Person",
            "name": "Martin Torgoff",
            "url": "/name/nm2240285/"
        }
    ],
    "description": "This concert includes Billy Joel's performances of \"Scenes From An Italian Restaurant,\" \"Storm Front,\" \"Downeaster Alexa,\" \"Pressure,\" and \"Piano Man.\"",
    "director": [
        {
            "@type": "Person",
            "name": "Jon Small",
            "url": "/name/nm0806484/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc5MzEwMzU5M15BMl5BanBnXkFtZTcwNjcyNjYxMQ@@._V1_.jpg",
    "keywords": "concert film,billy joel,bronx new york city,yankee stadium bronx new york city,tv special",
    "name": "Billy Joel: Live at Yankee Stadium",
    "original_info": {
        "id": "Billy Joel: Live at Yankee Stadium_1990",
        "name": "Billy Joel: Live at Yankee Stadium",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wordcomber"
        },
        "dateCreated": "2000-10-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0215569/"
        },
        "name": "A concert master at his best",
        "reviewBody": "Billy Joel seems incapable of putting on anything but a stunning concert. He is a master of the form, and for nearly 30 years he consistently has sold out any venue he has chosen to play. Still, it was a remarkable feat to sell out Yankee Stadium, not once, but twice. A native New Yorker (and avid baseball fan), Joel was the first pop/rock performer allowed to play \"The House That Ruth Built,\" and on the first two nights of summer in 1991, he brought the house down.\n\n\"Billy Joel: Live at Yankee Stadium\" arguably is the singer/songwriter's finest concert video. The cinematography and editing are impressive, giving the feel at times of a theatrical release rather than a television special. Skillful editing effectively captures the interplay among Joel, his band, and the enthusiastic fans who crowd the tiered stage. The sound is fine on VHS and promises to be superb on a new DVD edition (October 2000), digitally mastered in Dolby Digital 5.1 Surround Sound and PCM Stereo.\n\nBut, as always, the power of a Billy Joel concert is in the music, and The Piano Man takes the field in Yankee Stadium as a true triple threat: songwriter, singer, and musician. It's difficult not to be a bit disappointed knowing that the 85-minute video represents little more than half the actual concert. But while most fans are likely to have at least two or three favorite songs that didn't make the cut, the 12-song play list is solid, with a half-dozen Billy Joel classics logically chosen from a very lengthy list.\n\nA stop on the \"Storm Front\" tour, the concert opens with two numbers from that album -- the title song, followed by a rousing rendition of one of the album's best, \"I Go to Extremes.\" The first \"classic\" on the video is a perennial crowd favorite, \"Scenes From an Italian Restaurant,\" after which Joel trades the piano for an accordian to perform another \"Storm Front\" cut, \"The Downeaster Alexa,\" accompanied by a haunting violin.\n\nAn energetic rendition of \"Pressure\" is followed by a hometown crowd-pleaser, \"New York State of Mind,\" and a new song that would become a classic in its own right: \"We Didn't Start the Fire.\" Joel closes the main part of the show on the lower tier of the stage with a blues harmonica and \"That's Not Her Style.\"\n\nJoel opens the encore with another New York special, an apocalyptic 1976 number he rarely plays in concert anymore, \"Miami 2017 (Seen the Lights Go Out on Broadway).\" He follows with \"A Matter of Trust\" and the finale, \"Piano Man,\" which has evolved into the audience's tribute to Joel. He doesn't even bother to try singing the chorus anymore. The audience takes care of that.\n\n\"Live at Yankee Stadium\" is an important concert video. Since \"Storm Front,\" Joel has released only one album of original music, \"River of Dreams,\" and no subsequent concert video has matched the energy of that captured in Yankee Stadium. Given Joel's stated plans to eliminate lengthy tours and to limit concerts, it's unlikely we'll see another video of this quality. It's very good work, and it has a place in the collection of any Billy Joel fan.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi7848473",
        "name": "Billy Joel: Live at Yankee Stadium",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGYzNDU5MjEtN2EzNS00ZDc0LTllZGItOTEyNzFlNGRhNWQ2XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGYzNDU5MjEtN2EzNS00ZDc0LTllZGItOTEyNzFlNGRhNWQ2XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-08-17T17:02:53.681Z",
        "url": "https://www.imdb.com/video/vi7848473/"
    },
    "url": "/title/tt0215569/"
}