{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ken Bradshaw",
            "url": "/name/nm0103502/"
        },
        {
            "@type": "Person",
            "name": "Ken Collins",
            "url": "/name/nm1303461/"
        },
        {
            "@type": "Person",
            "name": "Brian L. Keaulana",
            "url": "/name/nm0444205/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 493,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0111155/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0110984/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021446/"
        }
    ],
    "datePublished": "2004-03-25",
    "description": "Action sports documentary that follows the industry's best big wave surfers as they travel the world searching for the largest waves that nature has to offer. The journey spanned 18 months, 6 continents and produced up to 70 foot ...",
    "director": [
        {
            "@type": "Person",
            "name": "Philip Boston",
            "url": "/name/nm0098273/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODVkNTczZDctYmU4ZC00NjNlLTg4NGItYWRjYmQwMTEyM2YwXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "outdoor sport,aquatic sport,wave,travel,surfer",
    "name": "Billabong Odyssey",
    "original_info": {
        "id": "Billabong Odyssey_2003",
        "name": "Billabong Odyssey",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "roguesk8rgrl"
        },
        "dateCreated": "2004-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0379713/"
        },
        "name": "The longest 80 minutes of my life",
        "reviewBody": "The reason I saw this movie, a film which I would ordinarily not have given a thought to was because I work at my university cinema. I'm an usher and I was needed to fill in for someone else who couldn't make it. So, as you can probably tell already I had no interest in watching a movie about surfers and surfing. However, I was prepared to watch it through, and I started out with an open mind. Ten minutes in I was bored out of my mind, to the point where I closed my eyes and attempted to catch up on some sleep...unfortunately the obligatory heavy rock soundtrack stopped me from doing this. I understand that the waves shown throughout the movie are very impressive. Some of them are absolutely massive and I did occasionally find myself inwardly gasping at the enormity of the waves. However, after having seen 50 of them, in a row with various surfers battling against them I completely lost interest. It all became monotonous and dull because these shots were shown one after the other for five minutes at a time. There were occasional bright moments throughout the movie which succeeded in peaking my interest. The all too short and shallow look back at the beginning of the popularity of the sport was good but unfortunately didn't provide any insight. The small section about the newest innovations in the surfing world were also good, giving the audience an opportunity to see what surfing could potentially become in a few years time. But, both of these were cut short by more shots of the surfers and the waves, shots which might as well have been recycled for all the originality they presented.\n\nThe documentary, I'm sure would be of some interest to surfing fans and, for a brief moment would interest non-surfers. The waves were impressive and the way the camera managed to get inside the waves, capturing everything on film was impressive, but there was just not enough depth to keep any interest sustained."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2025455897",
        "name": "Billabong Odyssey",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmFmOTU4YWYtZmI5NC00OTgwLWEzNzctMjM2ZTVjZWM4NTg2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmFmOTU4YWYtZmI5NC00OTgwLWEzNzctMjM2ZTVjZWM4NTg2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:34:54Z",
        "url": "https://www.imdb.com/video/vi2025455897/"
    },
    "url": "/title/tt0379713/"
}