{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bill Maher",
            "url": "/name/nm0005175/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 738,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093906/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137915/"
        },
        {
            "@type": "Person",
            "name": "Bill Maher",
            "url": "/name/nm0005175/"
        }
    ],
    "datePublished": "2000-06-10",
    "description": "Bill Maher, creator of the immensely popular late-night talk show Politically Incorrect with Bill Maher and host of the HBO hit series Real Time with Bill Maher, displays his celebrated, biting wit in his fifth HBO stand-up comedy...",
    "director": [
        {
            "@type": "Person",
            "name": "Keith Truesdell",
            "url": "/name/nm0874133/"
        }
    ],
    "duration": "PT1H8M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTE1MDA0NTktMTg3Yy00MzE4LWI3NDAtMmVhN2Y2N2IwMjMzXkEyXkFqcGdeQXVyMTk3NDAwMzI@._V1_.jpg",
    "keywords": "stand up,stand up comedy,stand up comedian,politics,live audience",
    "name": "Bill Maher: Be More Cynical",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2008-11-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250256/"
        },
        "name": "Consistently amusing but never as sharp or as funny as you would like",
        "reviewBody": "Over the last year or so I have become a regular viewer of Real Time on HBO because I do like the discussion format whether I agree or not. I do of course tend to agree as I am liberal but the one consistent weakness with the show is Bill Maher himself as he tends to push his extreme points without ever defending them and often losing his own audience. This is his weakness and it is partly because he is a stand-up who is used to playing the extremes for laughs with an audience who are laughing and not taking him seriously enough to pause for long to question him. Knowing this I have caught a couple of his shows and generally I quite like them for what they are.\n\nThe same sort of feeling is true of Be More Cynical because it is not brilliant enough to rave about but it is still good enough to enjoy if you can take Bill Maher. Those familiar with him from Real Time will see this show as a solid mix of his jokes and his actual political beliefs and mostly it works pretty well. It is not often hilarious though because he cannot manage to shape his opinions into sharp and funny commentary; instead he manages to make the show into a consistently amusing discussion through his politics, flowing from subject to subject relatively easily. The problem is that this discussion is the same as his views  a bit half-developed and occasionally miles from the middle ground. This makes it harder to get drawn into the material in the way the best comedians do, because he is not forceful or convincing enough to win over those that do not 100% agree with him (which will be the majority).\n\nIt does rather come down to your opinion of Maher I suppose and one can gauge that from Real Time. If, unlike me, you see Maher as a brilliant presenter of that show then you will love this piece of stand-up. Personally I don't see it that way and, as he is being his usual self here, I cannot escape seeing the same weaknesses. Overall though it is an amusing show  never as funny or as sharp as one would hope it would be but still an amusing piece of liberal stand-up from the far left."
    },
    "url": "/title/tt0250256/"
}