{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matthew Broderick",
            "url": "/name/nm0000111/"
        },
        {
            "@type": "Person",
            "name": "Christopher Walken",
            "url": "/name/nm0000686/"
        },
        {
            "@type": "Person",
            "name": "Matt Mulhern",
            "url": "/name/nm0611827/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16097,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047780/"
        },
        {
            "@type": "Person",
            "name": "Neil Simon",
            "url": "/name/nm0800319/"
        }
    ],
    "datePublished": "1988-03-25",
    "description": "A group of young recruits go through boot camp during the Second World War in Biloxi, Mississippi. From the play by Neil Simon.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Nichols",
            "url": "/name/nm0001566/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGQ5ZjA2OTEtOTE2OC00ZDc0LTk4Y2ItNTdkZjEzM2EwNjc2XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "gay,coming of age,gay character,military training,biloxi mississippi",
    "name": "Biloxi Blues",
    "original_info": {
        "id": "Biloxi Blues_1988",
        "name": "Biloxi Blues",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OCOKA"
        },
        "dateCreated": "2004-09-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094746/"
        },
        "name": "The Hilarious Side of Basic Training!",
        "reviewBody": "The timing for my catching of this flick couldn't have been more appropriate. I caught it with a few of my squadmates on a 72-hour pass at the post theater on Ft. Benning, in the middle of my 12-weeks of basic training and infantry school. It was the summer of 1988, \"Biloxi\" had just hit the screens, and it was the hottest summer on record in 25-years in the already quite sultry city of Columbus, Georgia (about two hours south of Atlanta). \n\nJust imagine, an army base theater -- that had changed very little from its WW2 days -- filled with 200+ Army recruits in uniform, on pass, watching a movie about Army recruits on pass! It was a hilarious deja vu, although I suspect that such irony was lost on the majority of the individuals present that night.\n\nAnyways, my favorite scenes in the movie include the following: Matthew Broderick (as Pvt. Eugene Jerome) moving through the chow line at breakfast for the first time, when the army cook slings some unmentionable godforsaken gloop on his stainless steel G.I. mess tray. The look on Eugene's face is worth its weight in gold as it was almost as if he had been insulted and violated at the same time. (This is especially funny for anyone who has ever stood in a messhall chowline and eaten army \"food\" before.)\n\nMy next favorite scene was when Eugene makes up a game with his bunkmates one night, about what they would do with the last 72 hours of their lives. What every man reveals about himself is not only telling, but an ominous harbinger of what is to come. Hennesey, for example, asks to be with his family. The others scoff. Little do they know, however, that soon enough, even that modest hope will seem like a pipedream to the starcrossed Hennesey.\n\nThe funniest aspects of Neil Simon's mostly autobiographically inspired play though, is his comedic depiction of the inevitable culture clash that invariably occurs when the New York quasi-intellectualism and Jewish urbane sensibility that Eugene Jerome and Arnold Epstein are products of, confronts head on the southern white-redneck military subculture that Sgt. Toomey represents. \n\nThis theme especially struck a chord with me, having come down to Georgia for boot camp from Chicago that summer. It was quite a culture shock for me upon my first visit to the south. when I stepped off the bus at Ft. Benning, as I quickly had to get myself accustomed to the almost incomprehensible southern accents, idiosyncratic differences in attitude and weird regional expressions employed by our mostly colorful, yet totally profane and predominantly redneck drill sergeants at Ft. Benning.\n\nAnother aspect about this film that touched me personally is the fact that it was filmed filmed almost entirely at Ft. Chaffee in Ft. Smith Arkansas, where I had trained extensively when I was in the U.S. Army. From WW1 to the early 1990s, Ft. Chaffee was an active U.S. Army reservation that has since been mothballed. \n\nBeing able to see scenes of Ft. Chaffee, especially the exterior and interior shots of Chaffee's vintage WW2-era barracks on my very rare DVD version which I am most fortunate to have, always brings back some rather fond -- and not so fond memories -- of the times I spent at Chaffee. This movie mostly reminds me of all those days and nights I spent training in those chigger and tick-ridden forests, doing PT around post, and living in those godforsaken WW2-era barracks. \n\nHats off to a great five-star WW2 coming-of-age flick!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A group of young recruits go through boot camp during the Second World War in Biloxi, Mississippi. From the play by Neil Simon.",
        "duration": "PT1M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi875741465",
        "name": "Blu-ray Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjMzZmJkMGYtZDMyYi00YjE0LWJjMDktOWU2YWYxMzQ3Y2MyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjMzZmJkMGYtZDMyYi00YjE0LWJjMDktOWU2YWYxMzQ3Y2MyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-25T11:29:30.909Z",
        "url": "https://www.imdb.com/video/vi875741465/"
    },
    "url": "/title/tt0094746/"
}