{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kotono Mitsuishi",
            "url": "/name/nm0594074/"
        },
        {
            "@type": "Person",
            "name": "Tetsuya Iwanaga",
            "url": "/name/nm0412561/"
        },
        {
            "@type": "Person",
            "name": "Yukana",
            "url": "/name/nm0633989/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 233,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "Birdy the Mighty",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022946/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011744/"
        }
    ],
    "datePublished": "1996-07-25",
    "description": "A Tokyo teenager's world is turned upside down when he is accidentally killed by a Federation officer. In order for Tsutomu to live, he must share a body with the female officer, Birdy. While Tsutomu tries to live his life as a no...",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA0MzE3MDc2Ml5BMl5BanBnXkFtZTcwMzI5MjUyMQ@@._V1_.jpg",
    "keywords": "tv mini series,anime animation,based on comic",
    "name": "Tetsuwan Bâdî",
    "original_info": {
        "id": "Birdy the Mighty_1996",
        "name": "Birdy the Mighty",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2014-08-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0160979/"
        },
        "name": "Below-average anime from an above-average creative team",
        "reviewBody": "\"Birdy the Mighty\" is a four-part anime OAV (made-for-video) series about a super-powered intergalactic policewoman, Birdy Cephon Altera, who takes over the body of a hapless Tokyo high school boy named Tsutomu and has to switch back and forth with him when danger approaches. In the first three episodes she fights various cyborg and android creatures, for reasons that are never terribly clear. Eventually—and way too late in the narrative for anyone to care anymore—we learn that it all has something to do with secret experiments in creating super-soldiers that were begun by the Japanese during the war and are now being revived by a high-powered villainess, Christella Revi, who comports herself like a fashionable corporate head and directs her team to poison Tokyo's water supply with a serum derived from those experiments. Her motive is never spelled out and the implications of Japan's involvement in research like this is never dealt with. Nor is it ever clear why some space federation is involved in all of this.\n\nIt's slow going and lacking in any of the excitement that we usually find in anime sci-fi action. There's never any suspense as Birdy fights one android or cyborg per episode in the first three episodes, none of which represent any significant threat to her. Besides, the comic potential of a high school boy coping with the presence in his body of a beautiful, voluptuous intergalactic space warrior is never adequately explored. Yes, there's a scene or two where he switches genders in front of his high school girlfriend, but it's never played for laughs. And there is one scene where Tsutomu's father barges into the bathroom as the boy is supposedly bathing only to encounter a nude Birdy. But even then, it's not staged to be funny. (Didn't \"Ranma ½\" mine similar territory successfully for 161 episodes?) \n\nIt's hard to believe that Yoshiaki Kawajiri is credited with directing something this bland and undistinguished. There are absolutely none of the graphic stylistic touches one would associate with the director of WICKED CITY, NINJA SCROLL or VAMPIRE HUNTER D: BLOODLUST. Nor would you imagine that this was written by Chiaki Konaka, the man who gave us the scripts for \"Serial Experiments Lain,\" \"Armitage III,\" \"Bubblegum Crisis Tokyo 2040\" and any number of highly imaginative sci-fi series he is connected with. My guess is that these two had a contract to fulfill and a short deadline and dashed this off without a great deal of thought or effort.\n\nI have this series on a two-tape VHS edition in its English-dubbed version, which I purchased in 1999. I remember taking a long time to see the whole thing back then, if I ever did. I never liked it enough to want to upgrade to the bilingual DVD edition that came out in 2004 and which is now out of print. When I learned that no comments had been posted to IMDb about it, I watched the series again in its entirety to see if it had improved any. It hadn't. To make matters worse, the English dubbing is some of the worst I've ever heard. The actor who does the voice of Tsutomu speaks in a grating high-pitched whine that kills off any sympathy we might have mustered for the character. I'm sure the Japanese track would be easier on the ears, but it wouldn't solve the problems with the shallow script, tame direction, or lackluster concept behind it all."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Birdy The Mighty",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3393240857",
        "name": "Birdy The Mighty",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWViMjAzYjctNGJiZC00MTAwLWI3NzktNmE2ZjQyYjA3YmRlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWViMjAzYjctNGJiZC00MTAwLWI3NzktNmE2ZjQyYjA3YmRlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-09T13:01:58.802Z",
        "url": "https://www.imdb.com/video/vi3393240857/"
    },
    "url": "/title/tt0160979/"
}