{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Karl Malden",
            "url": "/name/nm0001500/"
        },
        {
            "@type": "Person",
            "name": "Thelma Ritter",
            "url": "/name/nm0728812/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18276,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136681/"
        },
        {
            "@type": "Person",
            "name": "Guy Trosper",
            "url": "/name/nm0873613/"
        },
        {
            "@type": "Person",
            "name": "Thomas E. Gaddis",
            "url": "/name/nm0300532/"
        }
    ],
    "datePublished": "1962-07-04",
    "description": "A surly convicted murderer held in permanent isolation redeems himself when he becomes a renowned bird expert.",
    "director": [
        {
            "@type": "Person",
            "name": "John Frankenheimer",
            "url": "/name/nm0001239/"
        }
    ],
    "duration": "PT2H27M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4NDc3MjIyMV5BMl5BanBnXkFtZTcwMTEyNDcyNA@@._V1_.jpg",
    "keywords": "bird,prison,alcatraz,solitary confinement,life sentence",
    "name": "Birdman of Alcatraz",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2008-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055798/"
        },
        "name": "Who cares about truth! Birdman Of Alcatraz 1962 is fabulous.",
        "reviewBody": "This is a loose telling story of Robert Franklin Stroud (Burt Lancaster) who became known as The Birdman Of Alcatraz.\n\nHave to say I have avoided this film for years purely because of its leading man, but before you Burt Lancaster fans jump on me let me say here and now that I'm now very much a convert these days. A dear on line friend of mine convinced me to check out some of his work last year after they found out I wasn't all that impressed with him, so after watching Atlantic City and his supreme film noirs, I was quickly back in line. This one landed from the rental folk strangely after me enjoying Lancaster in The Unforgiven only last week.\n\nA strange thing with prison films is that few of them actually capture the oppressive feel of incarceration, so when I see one that does, then I'm very over the moon. Director John Frankenheimer manages to put the viewer in with Stroud because the pace is perfect, it's meant to be slow, prison time is slow time, the film is always close and intimate to give you the feel of being there. This film, much like two other greats from the genre in Papillon & Escape From Alcatraz, needs its lead actor to be restrained yet brood with menace, and Lancaster delivers from the top draw here. How unfortunate for him that he should turn in a fantastic turn in the same year that Atticus & Lawrence were dazzling cinema goers. The film never veers into over sentimental slumber because there is much more going on with Stroud, be it his Mother, business acumen, or the political fall out of this murderous man's time in prison.\n\nWatching such macho men like Lancaster & Savalas grow fond of our feathered friends is priceless and brings about scenes that are both touching and poignant at the same time. Whatever the distortion of the facts as regards Robert Stroud's penal life, one thing we do know is that he made an official impact and it makes for one hell of a story. Added bonus here is that you've got Frankenheimer directing deftly in his black & white style, aided considerably by the smart cinematography from Burnett Guffey. And of course from a memorable performance from Big Bad Burt.\n\nI was so impressed I ordered it for my own collection. 9/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this classic prison drama",
        "duration": "PT2M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi571148057",
        "name": "Birdman of Alcatraz",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGM3MzhkMmUtMjIwOC00NjJmLWI1MjctOGE1MWZhNzkzNTJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGM3MzhkMmUtMjIwOC00NjJmLWI1MjctOGE1MWZhNzkzNTJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T14:56:01Z",
        "url": "https://www.imdb.com/video/vi571148057/"
    },
    "url": "/title/tt0055798/"
}