{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nicole Kidman",
            "url": "/name/nm0000173/"
        },
        {
            "@type": "Person",
            "name": "Vincent Cassel",
            "url": "/name/nm0001993/"
        },
        {
            "@type": "Person",
            "name": "Ben Chaplin",
            "url": "/name/nm0001035/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25863,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002948/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061216/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038270/"
        },
        {
            "@type": "Person",
            "name": "Tom Butterworth",
            "url": "/name/nm0125358/"
        },
        {
            "@type": "Person",
            "name": "Jez Butterworth",
            "url": "/name/nm0125336/"
        }
    ],
    "datePublished": "2002-02-01",
    "description": "A thirtysomething bank clerk from St Albans has his small-town life exploded by the arrival of his Russian mail-order bride.",
    "director": [
        {
            "@type": "Person",
            "name": "Jez Butterworth",
            "url": "/name/nm0125336/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmZhZTcxYTQtNzkxNy00MzlmLTg5NTMtNDU4NDVmNDIwMTBlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "mail order bride,bank clerk,sex scene,con artist,tied up while barefoot",
    "name": "Birthday Girl",
    "original_info": {
        "id": "Birthday Girl_2000",
        "name": "Birthday Girl",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2002-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0188453/"
        },
        "name": "offbeat, underplayed drama",
        "reviewBody": "Roughly one part crime drama to two parts offbeat love story, `Birthday Girl' is a nifty little British film that gives Nicole Kidman a chance to strut her stuff as an actress. Here she gets to play a Russian `mail order bride' (though, of course, in the modern world she is actually ordered off the internet) who's come to England to start a new life with John, a mild-mannered banker unsuccessful in the ways of love. John is one of those bland, utterly undistinguished `good guys' who everyone seems to like but no one seems to notice. Even his boss at the bank gives him one of those noncommittal job evaluations (saying what a swell guy he is and what a great way he has with people) used to fob people off when they are not good enough to merit a raise or a more prestigious position in the corporation. Forced to go the unconventional route in finding himself a wife, John hooks up with the lovely but inscrutable Nadia, a Russian woman who, John is appalled to learn, does not understand a word of English. Then just as John and Nadia seem to be forming a close relationship (literally bonding over bondage), complications arise when two of Nadia's bizarre `friends' from Russia suddenly arrive on the scene.\n\nTo reveal more of the plot would be unfair to both the viewer and the makers of this film, since much of the movie's intrigue arises from the frequent turnabouts in the plot itself. Although there is always the threat of violence hammering at the film's edges, writers Tom and Jez Butterworth (the latter serving as the film's director as well), manage to keep the film fairly havoc free while they focus on the developing relationship between the two main characters. Kidman, who speaks nary a word of English in the first half of the film (and only with a heavy accent thereafter), does a beautiful job conveying both the toughness and the vulnerability inherent in this woman. Though innately compassionate, Nadia has had to learn how to survive in a brutal world - even if that means having to exploit naïve, good-natured shmucks like John. As John, Ben Chaplin conveys just the right mixture of shyness, befuddlement and ultimate self-assuredness to make us root for the character. Because of his Everyman characteristics, we want to see John triumph in the end.\n\n`Birthday Girl' doesn't try to push the envelope by indulging in elaborate action scenes or patently theatrical heroics. Its events seem to unravel in a spontaneous, naturalistic manner, which helps the film to remain relatively true to life most of the time. It tells an unusual story, one filled with wry humor, understated suspense and a compassionate recognition of human frailty. Well written and well acted, `Birthday Girl' is an unheralded film that deserves to be seen."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1743691289",
        "name": "Birthday Girl",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjk1MzczYjctZjZkMC00MzI1LTg5MzgtNzJhNDA2ZThhY2NlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjk1MzczYjctZjZkMC00MzI1LTg5MzgtNzJhNDA2ZThhY2NlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:09:46Z",
        "url": "https://www.imdb.com/video/vi1743691289/"
    },
    "url": "/title/tt0188453/"
}