{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Rani Mukerji",
            "url": "/name/nm0611552/"
        },
        {
            "@type": "Person",
            "name": "Shernaz Patel",
            "url": "/name/nm1617909/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35384,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0168350/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0128784/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142417/"
        },
        {
            "@type": "Person",
            "name": "Sanjay Leela Bhansali",
            "url": "/name/nm0080220/"
        },
        {
            "@type": "Person",
            "name": "Bhavani Iyer",
            "url": "/name/nm1818188/"
        },
        {
            "@type": "Person",
            "name": "Prakash Kapadia",
            "url": "/name/nm1165501/"
        }
    ],
    "datePublished": "2005-02-04",
    "description": "The cathartic tale of a young woman who can't see, hear, or speak, and the teacher who brings a ray of light into her dark world.",
    "director": [
        {
            "@type": "Person",
            "name": "Sanjay Leela Bhansali",
            "url": "/name/nm0080220/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTI5MmE5M2UtZjIzYS00M2JjLWIwNDItYTY2ZWNiODBmYTBiXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "deafblindness,deaf,mute,deaf blind,deaf mute",
    "name": "Black",
    "original_info": {
        "id": "Black_2005",
        "name": "Black",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shehzada0"
        },
        "dateCreated": "2005-04-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0375611/"
        },
        "name": "Black will be remembered as a 'Classic' in days to come",
        "reviewBody": "Black is an unusual and interesting film in idea and visualization. It's a very special film and there is no doubt; Sanjay Leela Bhansali is among the best talents Indian Film Industry has produced. \n\nThere have been films like Sadma, Sparsh and Koi Mil Gaya and Sanjay's directorial debut Khamoshi - The Musical, where the protagonists of the films were physically challenged. KHAMOSHI - THE MUSICAL, was a tale of a deaf and dumb couple and their ordinary child. Despite the presence of matinée idols like Salman Khan, Manisha Koirala and Nana Patekar, the film failed. \n\nBlack cannot be described in sheer words. It has been handled with extreme kindliness and it does boast of a plot that's rarely attempted on the Indian screen. Before this movie, Gulzar made a movie 'Koshish' in early 70's starring Jaya Bhaduri and Sanjeev Kumar for which they have won the awards.\n\nMichelle McNally (Ayesha Kapur/Rani Mukerji), born to an Anglo-Indian family, is deaf and blind. She is a bright and intelligent girl and she lives in the world of black and this frustrates her because she desires to speak. Therefore, because of her frustration she becomes harsh and cruel on numerous events.\n\nDebraj Sahai (Amitabh Bachchan) is a strange person. He is an alcoholic, a teacher to the deaf and blind children. The principal of the school believes in his ability and sends him to the McNally house to teach Michelle. Debraj's arrival at the McNally home is far from favorable, as he arrives intoxicated, annoyed and impolite. On encountering Michelle, Debraj realizes that the only way to tackle her is to distress her, be violent at times and at the same time, show her the love.\n\nDebraj succeeds and Michelle amazingly learns her first word - Ma. But this is just the beginning. There are several battles to be won. His dreams of Michelle going to a college with students without any disability. But, at this stage, Debraj starts to suffer from Alzheimer. He slowly forgets everything including all words and their meanings. The roles are now reversed!\n\nSanjay Leela Bhansali explanation of Helen Keller's outstanding life and the role Annie Sullivan played in her life. The real-life story was presented on the big screen in the 1962's Hollywood flick THE MIRACLE WORKER, which starred Patty Duke and Anne Bancroft for which both the performers won the Oscars.\n\nA film like BLACK relies heavily on performances and Bhansali has extracted award-worthy work from practically the entire cast. When you talk of BLACK, it's not just Bachchan or Rani's work you would like to extol, but Shernaz Patel, Nandana Sen, Dhritiman Chaterji and Ayesha Kapur's contribution as well.\n\nInternational Cinematography by Ravi K. Chandran. Each and every frame is laudable of a great compliment. Omung Kumar has created lively sets for the film. The Shimla shopping mall has been reconstructed to precision in Mumbai. Background music by Monty is apt. BLACK belongs to Amitabh Bachchan and Rani Mukerji primarily. After Khakee and Dev, this one is his best performance and for this role, he felt that for the last 25 years I have been working in the movies but this is the first time that I have shown such an interest. Bachchan comes up with a performance that he'll always be remembered for!\n\nThere's no denying that Rani delivers her best performance to date and her performance in this movie has topped on the number one spot and crossed her early performances i.e. 'Yuva', 'Hum Tum' and 'Veer - Zaara'. Rani has conveyed through expressions exclusively. Here's a performance that should act as a reference guide for all aspiring actors. And yes, she's bound to walk away with all major awards next year as well!\n\nShernaz Patel is exceptional. Her sequences with Bachchan are awesome. Dhritiman Chaterji is excellent. Nandana Sen impresses in a small but significant role. Ayesha Kapur is first-rate and she should be given a special award next year in every award ceremony. And also Best Perfromances award should be given to Mr. Amitabh Bachchan and Rani Mukherjee. If Bollywood has to move ahead with time we will be open to experiments like this. A must watch for those who like different cinema. After Lagaan, The Legend Of Bhagat Singh, Kaante, Khakee, this is the movie, which can compete with any Hollywood Movie. Rating: 4 Out Of 5"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2489302041",
        "name": "Black",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGY5OWJjODctNmJkNy00OWM3LWFjZDEtMTk0NjU4N2I2YTRlXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGY5OWJjODctNmJkNy00OWM3LWFjZDEtMTk0NjU4N2I2YTRlXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-09T17:06:50.261Z",
        "url": "https://www.imdb.com/video/vi2489302041/"
    },
    "url": "/title/tt0375611/"
}