{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lothaire Bluteau",
            "url": "/name/nm0089937/"
        },
        {
            "@type": "Person",
            "name": "Aden Young",
            "url": "/name/nm0949237/"
        },
        {
            "@type": "Person",
            "name": "Sandrine Holt",
            "url": "/name/nm0002142/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7379,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0077387/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099117/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053578/"
        },
        {
            "@type": "Person",
            "name": "Brian Moore",
            "url": "/name/nm0600972/"
        }
    ],
    "datePublished": "1991-10-04",
    "description": "In the 17th century, a Jesuit missionary nicknamed Black Robe by the natives and his small party of companions try reaching the Huron tribe in Canada all while facing mistrust, Iroquois warring parties and harsh winter conditions.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Beresford",
            "url": "/name/nm0000915/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Adventure",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGUyNTVhOGMtYmNlNy00YTU0LWFhOGQtMTg2MjFkZTRkZjY4XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "1600s,christian missionary,conversion to christianity of native americans,conversion to christianity of first nations people in canada,historical fiction",
    "name": "Black Robe",
    "original_info": {
        "id": "Black Robe_1991",
        "name": "Black Robe",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "eunicem"
        },
        "dateCreated": "2000-08-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101465/"
        },
        "name": "Magnificent!",
        "reviewBody": "I don't know why it took me so long to see this film, as I had heard of it many times. I think that I was put off by films like \"The Last of the Mohicans\", which I found dreary. There is no comparison with the oft-mentioned \"Dances With Wolves\". This film is an outstanding and riveting piece of work. Why others seem to have found it slow or heavy going is beyond me. When I reached the end (far too quickly) I just wanted to sit through it over again. \n\nHaving lived in Canada for some years, I could only marvel at the early colonizers who explored and settled Canada, a vast wilderness with a long, hard, bitterly cold winter - and I never went further north than Toronto! Whether or not one agrees with their reasons for going, whether it be trading, grabbing land or the salvation of the native population, the thought of being completely alone in the bitterly cold wilderness does command respect for their courage. \n\nThe film is set in 1634, a time when France was a cesspool of venality, corruption, intrigue and religious fanaticism, and when the pilgrims had been in Massachusetts for less than 10 years. The French Revolution was 150 years away. Life was hard for the settlers, who were on their own, without the survival kills evolved over thousands of years by the native population, whose life seemed brutally harsh but was a necessary adaptation to the land in which they lived. Early in the film the Algonquin chief tells his daughter than she cannot marry the Frenchman who she had fallen for, as he was a fool and did not know how to provide for her. That was the key. If a man could not provide for his family he could not take a wife. Anyone who became sick or injured must be left behind to take their chances, otherwise they would endanger the survival of the group. I think that this film makes that very clear. As the little group makes their way through Iriquois territory they are attacked by the Iriquois who plan to torture and sacrifice them, not apparently out of malice or wanton cruelty, but to please their God. (We had already seen the Jesuit priest flagellating himself for having impure thoughts). \n\nThe films deals at length with the misunderstanding of each other's religion and way of life, which causes us to question our own - just why do we do that? Why do the Iriquois fight the Algonquin, and the Huron when there is land to spare for all of them? Why did the French and English use the native people to fight their wars? The Indians cannot understand the Jesuit concept of paradise, sitting on a cloud all day with no tobacco, and no sex, but if accepting baptism helps them recover from a sickness , they will compromise. One gets the feeling that if the Jesuits moved out and another sect moved in, the Indians would convert to the new faith if it suited their purpose. \n\nThe scenery, as the party begins its long trek to the Huron mission is breathtaking. What they find when they reach the mission is not surprising, but once again, one has a feeling of admiration for the stoicism and faith of the Jesuit priests who knew that they were going to the ends of the earth and would likely never see their families again. To someone who buys all their food at the supermarket, or from the take out window, the thought of the self sufficiency of these people who live entirely on what they can catch or forage is quite mind boggling. Already the Indians are becoming dependent on the white man's goods. The trading post will not be long in coming. The Husdons Bay Company was set up by Royal charter about 30 years later. \n\nI would recommend this film to anyone who likes a beautiful, thought provoking film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In the 17th century, a Jesuit missionary nicknamed Black Robe by the natives and his small party of companions try reaching the Huron tribe in Canada all while facing mistrust, Iroquois warring parties and harsh winter conditions.",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi280346649",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjkxNzdlZjYtMmYwNC00Y2JkLTk5NGMtZWYzYTVjZTEyNDMxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjkxNzdlZjYtMmYwNC00Y2JkLTk5NGMtZWYzYTVjZTEyNDMxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-25T15:06:57.482Z",
        "url": "https://www.imdb.com/video/vi280346649/"
    },
    "url": "/title/tt0101465/"
}