{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Black Sabbath",
            "url": "/name/nm1277292/"
        },
        {
            "@type": "Person",
            "name": "Tony Iommi",
            "url": "/name/nm0409546/"
        },
        {
            "@type": "Person",
            "name": "Ozzy Osbourne",
            "url": "/name/nm0005285/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 122,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0811271/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0811271/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0420261/"
        }
    ],
    "datePublished": "2003-03-04",
    "description": "Great Concert footage of one of the best and original heavy metal bands to grace the stage.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Wiseman",
            "url": "/name/nm0936447/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM0Mzk2MDgzN15BMl5BanBnXkFtZTcwNzE1MzYxMQ@@._V1_.jpg",
    "keywords": "hard rock,live performance,concert film",
    "name": "Black Sabbath: Never Say Die",
    "original_info": {
        "id": "Black Sabbath: Never Say Die_2003",
        "name": "Black Sabbath: Never Say Die",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2005-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0413846/"
        },
        "name": "not at their best, but still a wild show",
        "reviewBody": "I saw Black Sabbath last year on tour for Ozzfest. They were co-headlining with Judas Priest on reunion, and while Priest gave an overall stunner of a show, Sabbtath didn't disappoint in the least. They went through their hits, with some video montages to accompany songs, and Ozzy and the other superb fogie metal Gods sounded stronger than ever. Ironically, this concert video from 1978, on the verge of their break-up, isn't at their very best.\n\nIndeed, there are signs in the show that seem to indicate not necessarily that they're playing bad, but some spots are a little sloppy, and one can sense the impact that drugs were having on the group (Ozzy, of course, who seems to be hyped on something at the start of the show, but Bill Ward too, who admitted in later interviews to feel almost like God on drugs). Still, if one can find this DVD it isn't without merit- there are songs that you may not hear them play live but are classics like 'Symptom of the Universe' and 'Dirty Women'. There are also good, energetic versions of 'War Pigs' and their title track from their debut.\n\nThe quality of the video is a little weak, and oddly has almost a disco feel to the lighting for a hard rock show (Ozzy is in a strange get-up too, like a Bee Gee almost). In a way its a successful show if only on its curious odd, excessive demeanor; this is not the Black Sabbath that I've seen footage of from the early 70's. Yet somehow its worth recommending, more so to fans of Sabbath and Ozzy, due to the strength inherent in the songs, in the magnetic (if flawed) performances, and of-its-time direction.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0413846/"
}