{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Deborah Kerr",
            "url": "/name/nm0000039/"
        },
        {
            "@type": "Person",
            "name": "David Farrar",
            "url": "/name/nm0268119/"
        },
        {
            "@type": "Person",
            "name": "Flora Robson",
            "url": "/name/nm0733460/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25887,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103153/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041089/"
        },
        {
            "@type": "Person",
            "name": "Rumer Godden",
            "url": "/name/nm0323869/"
        },
        {
            "@type": "Person",
            "name": "Michael Powell",
            "url": "/name/nm0003836/"
        },
        {
            "@type": "Person",
            "name": "Emeric Pressburger",
            "url": "/name/nm0696247/"
        }
    ],
    "description": "A group of nuns struggle to establish a convent in the Himalayas, while isolation, extreme weather, altitude, and culture clashes all conspire to drive the well-intentioned missionaries mad.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Powell",
            "url": "/name/nm0003836/"
        },
        {
            "@type": "Person",
            "name": "Emeric Pressburger",
            "url": "/name/nm0696247/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjIyOTM3NGMtNDA5Mi00MWUzLWJiMDMtMzhhZTdhOTQ2ODNiXkEyXkFqcGdeQXVyMTIzMzQ1ODg4._V1_.jpg",
    "keywords": "himalayan mountains,sexual repression,female protagonist,nun,mountain",
    "name": "Black Narcissus",
    "original_info": {
        "id": "Black Narcissus_1947",
        "name": "Black Narcissus",
        "year": "1947"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2006-02-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0039192/"
        },
        "name": "The palace in the mountain",
        "reviewBody": "Wind is always blowing throughout the monastery the Servants of God nuns have inherited in a remote part of India. In accepting being in charge of the new place, Sister Clodagh will question her faith as she faces one of the greatest challenges of her life.\n\nMichael Powell, working with his usual collaborator, Emeric Pressburger, on the Rumer Godden's novel, created a film that stands the test of time. His achievement is even more incredible as he shot this film in an English studio. The film, brilliantly photographed by Jack Cardiff, one of the best men in the business, and a frequent ally of Mr. Powell, is one of the best pictures of the English cinema. The glorious Technicolor still looks great.\n\n\"Black Narcissus\" questions how some Christians, in this case, nuns of a religious order, can be so blind about things that deviate from what it deems is the right way. When the young General wants to be part of the school the nuns are creating, they reject him, yet, he asks about how would a God, made human in the form of Christ, would respond to his petition.\n\nSister Clodagh is also put in a spot when she wants to get rid of the old man who day after day sits staring at the distant mountains. It's Mr. Dean who challenges her in asking how would her God deal with the old man. Sister Clodagh's past is revealed in flashbacks when she was a young woman and in love with a young man who wanted to emigrate to America and she wasn't ready to follow him.\n\nAlso, Sister Ruth, who is a rebel, decides to abandon the order because she is in love with Mr. Dean. The highlight of the film is the scene in which Ruth begins applying the deep red lipstick, which makes quite a contrast with her beautiful reddish hair to the horror of Sister Clodagh, who clearly is not prepared for the desertion.\n\nThere is also an undercurrent between Sister Clodagh and Mr. Dean, who one feels loves her. The nun is too loyal to the principles that made her take the vows. She realizes at the end that while she had the best intentions to transform the place, she is only a human being who suffers a defeat because of her surroundings.\n\nDeborah Kerr enjoyed one of the best triumphs of her career with the role of Sister Clodagh. She is seen as a young woman of great beauty and the austere nun she became later in her life. David Farrar is Mr. Dean, the Englishman who is now living in that remote part of India and knows the people well. Kathleen Byron makes an excellent contribution as the rebel Sister Ruth. Flora Robson plays the kind Sister Philippa. Jean Simmons appears as a cruel Indian girl, and Sabu has some interesting moments in the film.\n\nThis is one of Mr. Powell's best movies in his influential film career. He was one of the most innovative film makers of his generation and it shows well in \"Black Narcissus\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this classic drama",
        "duration": "PT2M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3210478105",
        "name": "Black Narcissus",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmI0OWY5ZmUtMDI2NC00OGIwLThkMzUtNzNiY2NiYjhhNzJkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmI0OWY5ZmUtMDI2NC00OGIwLThkMzUtNzNiY2NiYjhhNzJkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-09T11:24:33Z",
        "url": "https://www.imdb.com/video/vi3210478105/"
    },
    "url": "/title/tt0039192/"
}