{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel Lapaine",
            "url": "/name/nm0487406/"
        },
        {
            "@type": "Person",
            "name": "Hannah John-Kamen",
            "url": "/name/nm4789912/"
        },
        {
            "@type": "Person",
            "name": "Michaela Coel",
            "url": "/name/nm3948190/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 564049,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104481/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103528/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0454147/"
        },
        {
            "@type": "Person",
            "name": "Charlie Brooker",
            "url": "/name/nm0111765/"
        }
    ],
    "datePublished": "2011-12-04",
    "description": "An anthology series exploring a twisted, high-tech multiverse where humanity's greatest innovations and darkest instincts collide.",
    "genre": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTM3YWVhMDMtNjczMy00NGEyLWJhZDctYjNhMTRkNDE0ZTI1XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
    "keywords": "anthology,satire,dystopian future,dystopia,psychological thriller",
    "name": "Black Mirror",
    "original_info": {
        "id": "Black & White_1998",
        "name": "Black & White",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ftonks"
        },
        "dateCreated": "2020-07-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt2085059/"
        },
        "name": "A unique and different tv experience, with an episode for everyone.",
        "reviewBody": "Black Mirror is an anthology, meaning it is complied of different sci fi tales to make their seasons. This means the series doesn't really have any synopsis I can say, the only thing I can say is just watch the bloody show already. Every episode is different, some horror, some romance, some drama, and if you don't like the episode then just skip it, it's not like you'll miss anything as the next episode on your binge watch will be the complete opposite of what you just watched. As far as acting goes, it's top notch, stars like Jon Hamm, Daniel Kaluuya also appear on episodes bringing their amazing performances to the table. Every episode has their own cinematography, some bright and colorful, one episode will be black and white, really adding in on the unique feel of the whole thing. I would definitely call this show a masterpiece, but i almost gave it a 9 because of the 5th series. 2 episodes from the fifth series were pretty sh*te. Smithereens was great, so was Andrew Scott's performance. So yes, a masterpiece still, I won't let 2 bad episodes change that especially when compared to the works of art that the previous series had to offer. So ignore season 5 apart from Smithereens, Smithereens had a very important message and was a wonderfully shot and acted tale. Think of it as a mix of mini films. Now there may be some things that you may not find good, but there's always an episode for you. There 's twists, laughs, scares all in hour long episodes and tied up in a neat little bow just for you. And the Christmas Special was stunning, don't forget to watch that. But if that isn't enough, they have their own interactive film, Bandersnatch. An. Interactive. Film. You choose what the main character does, and it is awesome. So please, If you have the time, try watching this, you will not be disappointed. Verdict: With something new every episode, Black mirror really gets to you, and in all the right ways. A+"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Two estranged college friends reunite in later life, triggering a series of events that could alter their lives forever.",
        "duration": "PT56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1456913433",
        "name": "\"Striking Vipers\" Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTlhZGU5ZWMtZWY4ZS00Y2VhLTg0YzUtMzEwN2Q2M2E0Yzc0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTlhZGU5ZWMtZWY4ZS00Y2VhLTg0YzUtMzEwN2Q2M2E0Yzc0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-05-21T15:40:58.464Z",
        "url": "https://www.imdb.com/video/vi1456913433/"
    },
    "url": "/title/tt2085059/"
}