{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yixiang Li",
            "url": "/name/nm0508566/"
        },
        {
            "@type": "Person",
            "name": "Baoqiang Wang",
            "url": "/name/nm1316170/"
        },
        {
            "@type": "Person",
            "name": "Shuangbao Wang",
            "url": "/name/nm1179392/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2811,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Blind Shaft",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0351078/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0109148/"
        },
        {
            "@type": "Person",
            "name": "Yang Li",
            "url": "/name/nm1317258/"
        },
        {
            "@type": "Person",
            "name": "Liu Qingbang",
            "url": "/name/nm10719658/"
        }
    ],
    "datePublished": "2005-11-10",
    "description": "Two Chinese coal miners have hit upon the perfect scam: murder one of their fellow mine workers, make the death look like an accident, and extort money from the boss to keep the incident hushed up. For their latest \"mark,\" they ch...",
    "director": [
        {
            "@type": "Person",
            "name": "Yang Li",
            "url": "/name/nm1317258/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODRmYjFiYjYtZjZjNy00MTM2LWIxNTUtOTdlZjVkNDRmNjFmXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg",
    "keywords": "coal mining,coal,death,chinese,scam",
    "name": "Mang jing",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2005-02-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0351299/"
        },
        "name": "unique serial killer film",
        "reviewBody": "Written and directed by Yang Li, \"Blind Shaft\" provides us with a fascinating twist on the serial killer scenario. In most such films, the killer is usually relegated to the role of a shadowy antagonist whose basic function is to allow a brilliant investigator to outwit and outsmart him and bring him to justice in time for the closing credits. Not so in \"Blind Shaft.\" For here the killers themselves take center stage and there isn't a single law officer in sight to foil the plan or mitigate our fear about what is going to happen.\n\nSong and Yuan are two struggling Chinese laborers who've come upon an ingenious but grizzly scheme to make money. They befriend a stranger who is desperate for employment and convince him to come work with them in a nearby mine. All he has to do is agree to pass himself off as a relative of one of the two men. When they have their unsuspecting victim alone in the mine shaft, Song and Yuan cold-bloodedly murder him, claiming that the death was the result of a mining accident. Eager to avoid a scandal, the boss of the mine invariably pays a generous sum of money to the dead man's \"relatives,\" whereupon Song and Yuan take their ill-gotten gains, lure another man into their trap, and head off to another mine to repeat the scenario.\n\nWhat separates \"Blind Shaft\" from so many American tales about serial killers is that Song and Yuan are not portrayed as writhing, eye-rolling, hand-rubbing psychopaths, devising elaborate schemes to torture their victims and antagonize the authorities. Rather, these two killers approach their \"business\" in the most banal, matter-of-fact (i.e. \"businesslike\") way imaginable, making them all that much more chilling and believable. We feel we really could encounter people like these in our own lives. Their acts of murder are no more extraordinary to them than folding their clothes, ordering at a restaurant, or consorting with local prostitutes. In fact, the film spends far more of its time observing the mundane minutiae of their day-to-day existence than detailing the mechanics of their crimes. To these two men, killing is a means to survival (much of the money they earn from their killings they send back to their own relatives), and no moral or ethical code or twinge of compassion is allowed to stand in the way of ensuring that survival. And if it does It is their utter disregard for human life, their indifference to the intrinsic value of the individual that make them and their story so discomfiting and disturbing. Yet, even in this darkest of scenarios, Li gives us a glimmer of hope. When the latest intended victim turns out to be a naïve 16-year-old lad looking for money so that he can resume his studies, one of the killers begins to have second thoughts about what they have planned for him, primarily because he himself has a son who is also a student. The film, thus, becomes a gripping and fascinating study of whether or not even the most amoral person has a line beyond which he will not cross. Yet, what is most unsettling about the film is the way in which the two killers can treat their victim so \"humanely\" - they even insist on paying for a visit to a prostitute so that the boy won't die never having had sex - all the while knowing full well what they intend to do to him. What monster in any horror film could be scarier than that? \"Blind Shaft\" is not a thriller in the conventional sense of the term. It relies less on plot and more on observation, as we follow this fascinating trio through the brothels and marketplaces of rural China, seeing a world and a lifestyle wholly unfamiliar to most of us. Li remains utterly objective and detached as he records the doings - sometimes major, sometimes trivial - of Song and Yuan as they go through their day. Stylistically, the director brings an almost documentary feel to the story, and by dedicating as much screen time to the trivial details as to the murder plot itself, he conveys the sense of moral equivalence and bankruptcy that defines the characters' way of thinking. With no melodramatic background music to cheapen the suspense, Li allows the horror to develop naturally, out of a situation in which conscience and basic human compassion have been essentially drained. As we get to know this kid, and as his two intended killers get to know him as well, we can do little but watch helplessly as the elements of the plot move inexorably to their foregone conclusion. Through this approach, \"Blind Shaft\" generates a kind of \"suspense\" that the typical slick Hollywood thriller can only dream of achieving.\n\nWith brilliant performances from the three leads, Li forces us to look into the darkness that often lurks in the heart of Man. It is a frightening but unforgettable vision.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0351299/"
}