{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Craig Sheffer",
            "url": "/name/nm0001729/"
        },
        {
            "@type": "Person",
            "name": "Terence Stamp",
            "url": "/name/nm0000654/"
        },
        {
            "@type": "Person",
            "name": "Sheryl Lee",
            "url": "/name/nm0498247/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2698,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053086/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043832/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001100/"
        },
        {
            "@type": "Person",
            "name": "Lance Young",
            "url": "/name/nm0949796/"
        }
    ],
    "datePublished": "1997-04-14",
    "description": "A newly married happy couple visits a sex therapist to determine why the wife can't achieve an orgasm with her husband. This causes a horrific suppressed memory to emerge and she becomes more and more distant.",
    "director": [
        {
            "@type": "Person",
            "name": "Lance Young",
            "url": "/name/nm0949796/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTQyYTdlOWMtOTM1MC00ZTRiLWEzYzQtNmFjOTFhOTJkZjI1XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "couples therapy,sexuality,rape victim,sexually dissatisfied wife,sex",
    "name": "Bliss",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "regkat"
        },
        "dateCreated": "1999-06-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118742/"
        },
        "name": "Bliss is a good movie about real people",
        "reviewBody": "Movies made about problems in sex in marriage usually draws expressions of horror, or we don't want to know about it. Bliss explores one area, and there are many, of one cause and it is not uncommon, and a remedy other than traditional medicine to fix that problem.\n\nCritics have called Bliss educational to laughable and even soft porn. Foxtel Australia (released on cable May 1999) say the truth lies in- between. Foxtel saw fit to censor several scenes of the cable version, which in my opinion completely destroyed the Director's main plot and visual effects to tell the real story of something quite different in the use of another therapy, Tantric therapy. I obtained my own uncensored copy so my comments are based on visual scenes and dialogue on the therapy used, very limited but the basics are there.\n\nThe film was dedicated to Pauline; Maria's characterisation could have been Pauline. There are many Pauline's in this world that have had help or still need it.\n\nThe dialogue exchanged between Joseph (Craig Sheffer) and Tanner (Casey Siemaszka) on the wedding day when Joseph said, Maria (Sheryl Lee)\"she has some problems\". She sleeps with a fly swatter [little bugger], cleans the house twice a day, locked bathroom door, suicidal, neurotic, compulsive. Oh! how I know about bathroom doors and neurosis.\n\nMaria's nonchalance of her wedding day to her Mother is obvious when she shrugs her shoulders and regurgitates. This is when the plot starts to unfold Maria's mannerisms and idiosyncrasies (getting her Father to check if there is a snap undone), the nervousness and stomach upset.\n\nThrough the gateway from this borderline psychotic state (we learned this later on) that Maria has, sometimes ends in Depression, and Baltazar Vincenza (Terence Stamp) stops Maria going there with the use of the ancient art of Tantric lovemaking, so it seems. It didn't take much to work out that if Maria had more therapy from the staid and clinical Alfred (Spalding Gray) she may have ended up on the wrong side of that borderline.\n\nThere are some lighthearted scenes and dialogue because this movie, Bliss, is about real people, real problems and real things. The scene on the building site is especially real where Carlos and Nick advise that Baltazar Vincenzahas have 4-6 women on the hour and every hour per day and teases all of them. The uniniated into tantalic doctrine would find this perhaps laughable.\n\nThe scene in the hospital where Maria is pouring out the reasons she is there is a gem. This explanation of Marias' problems comes late into the film, but that's the way it seems the Director wanted it, and it captures my imagination to find the reasons later.\n\nThe on screen chemistry and interactions of Sheryl Lee as Maria, and Mark Scheffer as Joseph capture the moments magically.\n\nThe special artistry of capturing what matters by Australian Cinematographer Mike Malloy (A Clockwork Orange) is again done with due care and in good taste in some of the explicit scenes, where it is important to explain visually the method of this chosen therapy.\n\nTerence Smart invigorates the movie as Baltazar Vincenza, confidently played with clear diction, precise timing (cup of tea) (like to dance) (I promise) reminiscent of the transvestite Bernadette in Priscilla Queen of the Desert, realising a different role once again.\n\nAlfred, well played by Spalding Gray as the run of the mill, we will get it fixed by conventional therapy eventually. Until Joseph asks about Baltazar Vincenza, and then the sparks fly and the film enters a new panorama of drama, explanation and entry into a New World of therapy.\n\nThis movie has a tight script, well directed, excellent acting, and a very different way of surrounding the plot with something different to fix a common problem in marriage. It is a scene that few wish to be in, Vincenza (to Joseph), why do you put so much into it when you get so little back? Indeed, I know what he means.\n\nLance Young worked with production executives of Warner Bros. And Paramount and no doubt saw some fabricated screen plots, so he took to writing his own screenplay about real things and people. He no doubt found this hard and personal, but the end result in Bliss was worth the effort.\n\nThe film, in my opinion is educational to someone who knows the problems of Maria and the adoration a husband like Joseph places on his partner and marriage. The more it is viewed, the better and educational it gets, rather than having to read and view many volumes of text and videos on the subject of Tantric lovemaking, a subject that has it's poo-hoo critics.\n\nI will be waiting eagerly for Lance Young's sequel to this excellent movie, if any."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Bliss: Sometimes I Wonder",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3870999577",
        "name": "Bliss: Sometimes I Wonder",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTEwMTY0ZTMtYWU4MS00YzgzLWJiMmYtMTljMGIxZTMzZGIyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTEwMTY0ZTMtYWU4MS00YzgzLWJiMmYtMTljMGIxZTMzZGIyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-02-17T21:28:45.984Z",
        "url": "https://www.imdb.com/video/vi3870999577/"
    },
    "url": "/title/tt0118742/"
}