{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Buchholz",
            "url": "/name/nm0118176/"
        },
        {
            "@type": "Person",
            "name": "Connie Sue Cook",
            "url": "/name/nm0176974/"
        },
        {
            "@type": "Person",
            "name": "Frances Kelly",
            "url": "/name/nm0446390/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 96,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040748/"
        },
        {
            "@type": "Person",
            "name": "Steve Pinto",
            "url": "/name/nm0684710/"
        },
        {
            "@type": "Person",
            "name": "Stephen Rollman",
            "url": "/name/nm0738473/"
        },
        {
            "@type": "Person",
            "name": "Kent Skov",
            "url": "/name/nm0804779/"
        }
    ],
    "description": "That oozing pink terror, \"The Blob,\" lives again in this irreverent and hilarious send up of the 1958 classic. But this time, Steve McQueen has to face off against a wise-cracking pile of goo when, for the first time, The Blob spe...",
    "director": [
        {
            "@type": "Person",
            "name": "Kent Skov",
            "url": "/name/nm0804779/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5MzI4NTM4Ml5BMl5BanBnXkFtZTcwNTMwODYxMQ@@._V1_.jpg",
    "keywords": "blob,redubbed with comedy soundtrack,based on play,character name in title",
    "name": "Blobermouth",
    "original_info": {
        "id": "Blobermouth_1990",
        "name": "Blobermouth",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Richard Keith Carson"
        },
        "dateCreated": "2001-02-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0207346/"
        },
        "name": "If you like this sort of thing, this is the sort of thing you'll like",
        "reviewBody": "The L.A. Connection are a comedy troupe who did live performances at the Nuart Theatre in the early '90s, several of which I attended. They would show some campy '50s movie with the sound turned off and recite their own (scripted) dialog over it, in the manner of \"What's Up, Tiger Lily?\" This is a recording of one such revision, that of the original 1958 \"The Blob.\"\n\nSome people see nothing at all funny in this sort of thing. I must confess that I am an easy audience, as I have always found this premise intrinsically funny no matter what is done with it. But even with that caveat, I insist that the L.A. Connection do it better than anyone else. Every gesture and nuance of the actors on screen is incorporated into the new dialog in hilarious fashion. They also contrive an entirely new \"story\" around the action. In \"What's Up, Tiger Lily?\" Woody Allen kept the original notion that it was a spy story, whereas if the Connection had done it, they would have made it about something completely different. Whatever kind of comic genius it takes to do that, I wish I had it.\n\nMy only quibble with this preserved record is that, unlike the live performances where the film was untampered with, this version has occasional animation, music video-style editing, and a \"plot\" recap at the midpoint, all of which are unnecessary. But that didn't stop me from laughing through the whole thing. I am delighted to have this tape as a memento of the performances I saw, and I wish they would release more of them.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0207346/"
}