{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Rydell",
            "url": "/name/nm0753068/"
        },
        {
            "@type": "Person",
            "name": "Sharon Stone",
            "url": "/name/nm0000232/"
        },
        {
            "@type": "Person",
            "name": "Ana Torrent",
            "url": "/name/nm0868479/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1134,
        "ratingValue": 4.5,
        "worstRating": 1
    },
    "alternateName": "Blood and Sand",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015969/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Vicente Blasco Ibáñez",
            "url": "/name/nm0087658/"
        },
        {
            "@type": "Person",
            "name": "Rafael Azcona",
            "url": "/name/nm0044156/"
        },
        {
            "@type": "Person",
            "name": "Ricardo Franco",
            "url": "/name/nm0002797/"
        }
    ],
    "datePublished": "1990-01-26",
    "description": "Juan is a young Spanish man whose dream is to become one of the famous toreros. When he was caught making an illegal (and in fact for the real torero life endangering) night bullfight with one of the destinated bulls for the corri...",
    "director": [
        {
            "@type": "Person",
            "name": "Javier Elorrieta",
            "url": "/name/nm0255546/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2YxZjY1NmItODBmYS00NjJjLTgyZDItZTBiMmRhNGM5ODQ4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "male buttocks,male nudity,female nudity,adultery,female topless nudity",
    "name": "Sangre y arena",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Falconeer"
        },
        "dateCreated": "2014-06-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098251/"
        },
        "name": "Sexy remake of a classic",
        "reviewBody": "This 1989 re-telling of the life of Juan Gallardo, famed Matador, is actually the closest thing you will get to the book that it was based on. Of the three movies, this one has the deepest understanding of Spain's culture, and what the art of bullfighting means to the people of this land. It's also an incredibly sexy movie, filled with passion, violence and betrayal. Chris Rydell is perfectly cast as the young bullfighter, determined to make a name for himself in the arena, while following his dream. Things go well for him until Sol comes into his life. Played with typical erotic flair, Sharon Stone is the beautiful woman who enters Juan's life, threatening his marriage, as well as his career, for no other reason than her own personal pleasure. It's a heartbreaking love story as well, as Juan and his innocent wife are such likable characters. for this production, the story is adjusted so that it takes place in modern times. Surprisingly, that decision takes nothing away from the power of this wonderful film. Featuring gorgeous cinematography and a beautiful, capable cast, as well as an intoxicating score, this one should please fans of the 1922 original, starring Rudolph Valentino. Also featured are some impressive and sometimes bloody footage of Matadors and bulls in the arena. Scenes that were surprisingly heavily censored for the Spanish language video release. I'm not sure why this film is virtually unknown in North America, as it deserves attention. Perhaps it is due to the subject matter of bullfighting,, which holds little interest to most of the population, and the sport offends many animal rights activists as well. Still, for those with open minds, looking for an old fashioned tragic romance, \"Blood and Sand\" is worth tracking down. But be aware; you might need a cold shower afterwards.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0098251/"
}