{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Seamus O'Brien",
            "url": "/name/nm0639804/"
        },
        {
            "@type": "Person",
            "name": "Viju Krem",
            "url": "/name/nm0470769/"
        },
        {
            "@type": "Person",
            "name": "Niles McMaster",
            "url": "/name/nm0573197/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6016,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "alternateName": "Blood Sucking Freaks",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0391612/"
        },
        {
            "@type": "Person",
            "name": "Joel M. Reed",
            "url": "/name/nm0715485/"
        }
    ],
    "datePublished": "1976-11-03",
    "description": "In the Theatre of the Macabre in New York Sardu and his assistants present a show involving the torture and mutilation of young women. The audience assumes it is just an act but the torture is real, as are the deaths.",
    "director": [
        {
            "@type": "Person",
            "name": "Joel M. Reed",
            "url": "/name/nm0715485/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA1NzcxNzg1NzZeQTJeQWpwZ15BbWU4MDU4MDM5MDMx._V1_.jpg",
    "keywords": "torture,hung by wrists,master,murder,ballerina",
    "name": "The Incredible Torture Show",
    "original_info": {
        "id": "Bloodsucking Freaks_1978",
        "name": "Bloodsucking Freaks",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2015-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077247/"
        },
        "name": "One of the Kings of Exploitation Films",
        "reviewBody": "Bloodsucking Freaks (1976) \n\n** 1/2 (out of 4)\n\nJoel M. Reed's notorious exploitation flick about an off, off Broadway show being hosted by Sardu (Seamus O'Brien), which advertises \"torture\" but it is in fact real torture. Sardu and his dwarf assistant Ralphus (Luis De Jesus) keeps a group of women chained up with the sole purpose of killing them on stage. Sardu eventually decides to kidnap a ballerina (Natasha Di Natalie) so that he can impress (and kill) a critic who sees him as trash. Soon her football star boyfriend (Niles McMaster) and a crooked detective (Dan Fauci) are trying to find out what's really going on. \n\nAlso known as THE INCREDIBLE TORTURE SHOW, this film became best known under the BLOODSUCKING FREAKS title and there's no question that it's quite vile, disgusting, sexist, revolting and just about every other negative word you can think of. With that said, there's something so beautifully bizarre and weird with this picture that, if you can stomach it, you can't help but have some dirty fun with it. Yes, technically speaking there's really nothing impressive here and you could bash some of the bad acting and poor effects but why hate? Yes, this is an extremely low-budget movie and we could nitpick it to death but you can't get over the fact that this thing picks up new fans each and every year.\n\nI think what makes this film work so well is the simple fact that it's downright bizarre. It almost seems like a group of friends just got together to make a movie and decided to come up with the craziest situations they could think of. There are numerous torture sequences here, which are so over-the-top that you can't help but laugh at them. Unlike many exploitation films, this one here is shockingly not mean- spirited and this here is another reason it works. This actually plays quite well as a black comedy and there's no doubt that you'll be laughing at how silly some of the stuff is. Just take a look at the cannibal women living in the basement. Watch the \"doctor\" scene and the brain drilling. Just the way this scene plays out is meant to make your stomach sick and you to laugh at how crazy it actually is.\n\nThe film will always be remembered for how crazy it is and there's no doubt that the violence and gore is so over-the-top that you often can't believe what you're watching. The non-stop nudity is another thing the film is notorious for and when you combine all of this stuff it's easy to see why it earned (and deserved) the X-rating. It should also be noted at how fun the cast is. Seamus O'Brien, who was murdered shortly after the film was released, is simply charming in the lead role and De Jesus is also a blast as the assistant. Fauci is also entertaining in the role of the crooked detective and especially the wonderful way he delivers the lines.\n\nBLOODSUCKING FREAKS certainly isn't going to be a movie for everyone. In fact, the overwhelming majority are going to be highly offended and disgusted by it, which is a good thing if you're a fan of exploitation. Any movie that continues to shock nearly forty-years after it was made means that it was done correctly."
    },
    "url": "/title/tt0077247/"
}