{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Don Wilson",
            "url": "/name/nm0933310/"
        },
        {
            "@type": "Person",
            "name": "Rina Reyes",
            "url": "/name/nm0721402/"
        },
        {
            "@type": "Person",
            "name": "Joe Mari Avellana",
            "url": "/name/nm0042884/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 740,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001838/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0089259/"
        },
        {
            "@type": "Person",
            "name": "Catherine Cyran",
            "url": "/name/nm0194274/"
        },
        {
            "@type": "Person",
            "name": "Michael Ferris",
            "url": "/name/nm0274905/"
        }
    ],
    "datePublished": "1990-10-12",
    "description": "Kickboxing champion Jake Raye thought his fighting days were over, until a call from an old friend draws him to the Far East and into the hands of a madman. This time Jake's fighting for his life!",
    "director": [
        {
            "@type": "Person",
            "name": "Andy Blumenthal",
            "url": "/name/nm1223105/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Action",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcxNDMwNDA2Ml5BMl5BanBnXkFtZTcwODA3NjkxMQ@@._V1_.jpg",
    "keywords": "interracial relationship,asian man white woman relationship,female topless nudity,thong panties,white panties",
    "name": "Bloodfist II",
    "original_info": {
        "id": "Bloodfist 2_1990",
        "name": "Bloodfist 2",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Leofwine_draca"
        },
        "dateCreated": "2013-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099155/"
        },
        "name": "Relentless side-scrolling beat 'em up",
        "reviewBody": "BLOODFIST II is a shambolic production: clearly made on the ultra-cheap, consisting of non-actors who couldn't look more wooden if they tried, with a threadbare story that shamelessly rips off ENTER THE DRAGON at every opportunity from the island tournament to the chunky henchmen and urbane criminal overlord. And yet it's still ten times better than the truly execrable BLOODFIST, which remains one of the worst films I've ever watched.\n\nThe reason this sequel is better is purely because it has more action – and a lot more action, at that. In fact, there's a fight scene regular as clockwork every five minutes or so, and sometimes even more frequently. Sadly, the fights aren't up to much; the choreography is about as boring as it could be, and the opponents display no discernible talent, merely running towards the hero and falling down when they get kicked in the face. But at least there's stuff happening, unlike in the first movie.\n\nSadly, the numerous faults are still too major to make this even remotely resemble anything approaching a good movie. Don \"The Dragon\" Wilson is a humourless and extraordinarily wooden leading man, my least favourite of all the martial arts stars, and he goes through the motions here. The supporting cast are even worse and some of the performances are downright appalling. The plot is dull and tired and far too simplistic, and in the end this is nothing more than moving wallpaper, or a film version of the old side-scrolling beat 'em ups where exchangeable thugs are mown down by a one-dimensional hero character.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0099155/"
}