{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yûki Kudô",
            "url": "/name/nm0473802/"
        },
        {
            "@type": "Person",
            "name": "Saemi Nakamura",
            "url": "/name/nm0620217/"
        },
        {
            "@type": "Person",
            "name": "Joe Romersa",
            "url": "/name/nm0589007/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12914,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132285/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054187/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002212/"
        },
        {
            "@type": "Person",
            "name": "Kenji Kamiyama",
            "url": "/name/nm0436784/"
        },
        {
            "@type": "Person",
            "name": "Katsuya Terada",
            "url": "/name/nm1056267/"
        }
    ],
    "datePublished": "2001-08-17",
    "description": "Saya is a Japanese vampire slayer whose next mission is in a high school on a US military base in 1960s Japan, where she poses as a student. She uses a katana/samurai sword to kill vampires.",
    "director": [
        {
            "@type": "Person",
            "name": "Hiroyuki Kitakubo",
            "url": "/name/nm0457541/"
        }
    ],
    "duration": "PT48M",
    "genre": [
        "Animation",
        "Action",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2I0ZWIwZjktZThjOS00YTI3LTlhOGQtMzNmOTQxYmUyZjM0XkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "japan,anime,ova,woman wears a uniform,anime animation",
    "name": "Blood: The Last Vampire",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2019-02-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0275230/"
        },
        "name": "It felt like an appetiser for things to come.",
        "reviewBody": "A quick bite, digestible, but not completely fulfilling. \"Blood: The Last Vampire\" is situational storytelling that doesn't really delve too deep into the background of its characters, or plights other than what's happening right in front of you. It's a slight premise, light-weight script - so maybe it could've used an extra 5-10 minutes to flesh out things further more. But I guess in doing so the enigma of the protagonist would lose out, as the script doesn't completely come out with her infliction in other than one word, or minor visual hints.\n\nSaya, a half-human, half-vampire samurai is all edge, and it looks like it doesn't take much to tick her off. She works for a shadowy society known as the council dispatching demons infesting the earth. Her next assignment sees her at an American military base, where there have been some strange, grisly deaths possibly the work of vampires and the bases' school nurse finds herself stuck in the middle of it all.\n\nThis is just another chapter to the story's universe, as the investigative build-up eventually breaks out the gushing blood and precise blade-work of Saya going to work (slaying) when she uncovers the suspect/s. It didn't take much in the way of clues to get to that point. Once the horror erupts the vampires go on the rampage, where the imagery becomes mildly hallucinogenic, pace quickens up and sudden violence is unforgiving. These vampires are monsters; feral in their actions and fearsome in sight when they reveal their true nature. The connection between the vampires and Saya might be all business, but the last shot we see of her is a touching moment of compassion that shared enough light on her character than a bloated exposition dump could ever do. As for the animation, it had creative flashes, but more often I thought it was ulgy and grim in the details. While I wasn't particularly fond of its style, no way did it get in the way of my enjoyment and it probably suited the cold and foreboding temperament. In saying that, the opening sequence with the credits is beautifully framed and edited, so are the beastly encounters.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"August 28th\"",
        "duration": "PT1M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1018888473",
        "name": "Blood: The Last Vampire",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzJhYWU1MTEtNWY0OC00NDE0LTk2ZDMtNDViYmViNGEyNzFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzJhYWU1MTEtNWY0OC00NDE0LTk2ZDMtNDViYmViNGEyNzFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:41:39Z",
        "url": "https://www.imdb.com/video/vi1018888473/"
    },
    "url": "/title/tt0275230/"
}