{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mickey Hargitay",
            "url": "/name/nm0362927/"
        },
        {
            "@type": "Person",
            "name": "Walter Brandi",
            "url": "/name/nm0081714/"
        },
        {
            "@type": "Person",
            "name": "Luisa Baratto",
            "url": "/name/nm0053115/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2205,
        "ratingValue": 4.5,
        "worstRating": 1
    },
    "alternateName": "Bloody Pit of Horror",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0110892/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075271/"
        },
        {
            "@type": "Person",
            "name": "Romano Migliorini",
            "url": "/name/nm0585971/"
        },
        {
            "@type": "Person",
            "name": "Roberto Natale",
            "url": "/name/nm0622099/"
        }
    ],
    "datePublished": "1967-05-16",
    "description": "A photographer and models go to an abandoned castle to shoot some sexy covers for horror novels. Unbeknownst to them, the castle is inhabited by a lunatic who believes himself to be the reincarnated spirit of a 17th century execut...",
    "director": [
        {
            "@type": "Person",
            "name": "Massimo Pupillo",
            "url": "/name/nm0700659/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjk0ZDMxNGItYmNkYi00OGI3LWIxMWEtYmU3ZGU5NGI4ZDgxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTE2NzA0Ng@@._V1_.jpg",
    "keywords": "castle,female model,male model,photo shoot,booby trap",
    "name": "Il boia scarlatto",
    "original_info": {
        "id": "Bloody Pit of Horror_1965",
        "name": "Bloody Pit of Horror",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "samhill5215"
        },
        "dateCreated": "2010-01-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058983/"
        },
        "name": "Perfect bodies",
        "reviewBody": "Surely nobody goes into this laughable cheese-fest expecting to see a quality horror film. Even by Italian standards - Bava and Argento excepted - this is utter nonsense. The horror part is well, what horror part? The plot is utterly predictable, no surprises there. The dialog is just as predictable. As for the scenery we are treated to some spectacular vistas (they caught my wife's fancy long enough to pause in passing and in her determination to avoid taking part in my passion for horrible films) and the castle where the action takes place is really cool! So what else is there to recommend this? It's all about perfect bodies, a good number of them, enough to keep members of both sexes entertained. Mickey Hargitay who plays our villain has, as he so proudly informs the audience often enough, THE perfect body. He puts the rest of us puny males to shame with the utter certainty that no matter how hard we try we'll never reach that level of physical beauty. On the other side of the gender barrier the women are equally gorgeous. They are all curvaceous, luscious, mouth-watering eye candy to awaken the man-beast in every male out there. Bear in mind there is no real nudity. The closest we get to risqué scenes is just the hint of the top part of nipples. Otherwise it's all designed to tantalize the male spectator with the prospect of revealing the hidden parts without doing so. How delicious! Well, perhaps not for recently pubescent and inexperienced teens. For them it might be too frustrating.\n\nOne final point. The hero is the exact opposite of our gorgeous villain. A Joe Pesci look-alike, he's not exactly my idea of a hero and he in fact gets beat up pretty regularly until he finally prevails with strategic karate chops. Makes you wonder why he doesn't use them before he gets punched out within an inch of his life, but I digress. The heroine is clearly above his league in the looks department but also not as sexy or exotic as any one of the other four women. So I'm not sure but maybe the producers were trying to insert a moral about looks and death but who knows? Any way you look at it this movie will keep you chuckling and salivating neither of which is a bad thing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Writer Rick and his publisher Daniel Parks finally find the ideal location in Italy to shoot some photographs for Rick's Horror photo-novel when they come across an ideal spot. The seemingly deserted castle looks perfect from the outside, so Rick and Daniel, accompanied by his secretary Edith, their photographer Dermott, and his five young models decide to break in. They soon find the castle is actually occupied by former actor, Travis Anderson, who initially is annoyed with these visitors until he recognizes Edith, his ex-fiancèe amongst them. He decides to give them permission to use his castle, but warns them that the dungeons are off limits. Will they heed his warning?",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3053044505",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzE3ZGU4MmYtMmM0NS00NjEyLTllZjEtNGE0NzgzODBiYzAzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzE3ZGU4MmYtMmM0NS00NjEyLTllZjEtNGE0NzgzODBiYzAzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-05T19:28:28.522Z",
        "url": "https://www.imdb.com/video/vi3053044505/"
    },
    "url": "/title/tt0058983/"
}