{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Don Wilson",
            "url": "/name/nm0933310/"
        },
        {
            "@type": "Person",
            "name": "John Patrick White",
            "url": "/name/nm0925003/"
        },
        {
            "@type": "Person",
            "name": "Jillian McWhirter",
            "url": "/name/nm0574766/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 366,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Alex Simon",
            "url": "/name/nm0800057/"
        }
    ],
    "datePublished": "1996-10-29",
    "description": "A former CIA agent (Wilson) lives a suburban life as a high school teacher with his teen son (White). When the agent is attacked by former allies because of knowledge he possesses and his son is kidnapped, he is forced back into t...",
    "director": [
        {
            "@type": "Person",
            "name": "Rick Jacobson",
            "url": "/name/nm0414910/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzQ5OTc2OTU1N15BMl5BanBnXkFtZTcwODg0ODYxMQ@@._V1_.jpg",
    "keywords": "betrayal by a friend,betrayal,psychotronic film,cia central intelligence agency,cia agent",
    "name": "Bloodfist VIII: Trained to Kill",
    "original_info": {
        "id": "Bloodfist 8: Hard Way Out_1995",
        "name": "Bloodfist 8: Hard Way Out",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fmarkland32"
        },
        "dateCreated": "2006-07-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115711/"
        },
        "name": "Hard Way To Kill...",
        "reviewBody": "Don Wilson stars as George MacReady who kicks into high gear, when his son is kidnapped by CIA agents who are targeting him for death because of his secret identity being blown, now he must fight his ex-comrades and save his son, while not ripping his pants in the process. That is not an unworthy observation, Don Wilson wears jeans so tight they might as well be spandex and it becomes quite believable that Wilson is a true martial artist because somehow he can kick way over his head and do so without once tearing a hole in his pants. If anything else though, Bloodfist VIII is a one man show with Wilson quite invincible against assembly line villains who say everything that villains of this nature do. The one interesting element is that the characters are named after classic actors and directors such as George MacReady, Emeric Pressburger and Michael Powell. Other then that the production values are better this time around although who ever was behind the radio shock effect should be walloped with a tire-iron, overall i'm saying this is the least terrible of the last 4 sequels. But really this is a fifty cent rental at best, once again Don Wilson fans will enjoy this but other then that it holds little appeal. Also John Patrick White has to be the oldest teenager ever.\n\n*1/2 out of 4-(Poor)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0115711/"
}