{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Travolta",
            "url": "/name/nm0000237/"
        },
        {
            "@type": "Person",
            "name": "Nancy Allen",
            "url": "/name/nm0000262/"
        },
        {
            "@type": "Person",
            "name": "John Lithgow",
            "url": "/name/nm0001475/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 56778,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065715/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025507/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0838571/"
        },
        {
            "@type": "Person",
            "name": "Brian De Palma",
            "url": "/name/nm0000361/"
        },
        {
            "@type": "Person",
            "name": "Bill Mesce Jr.",
            "url": "/name/nm0581785/"
        }
    ],
    "datePublished": "1981-07-24",
    "description": "A movie sound recordist accidentally records the evidence that proves that a car accident was actually murder and consequently finds himself in danger.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian De Palma",
            "url": "/name/nm0000361/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmZiMmZmNjQtNGM3OC00MTFkLWIxMzktZmJhMGYzMjYwYzZmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "political conspiracy,damsel in distress,psychotronic film,hitchcockian,roman a clef",
    "name": "Blow Out",
    "original_info": {
        "id": "Blow Out_1981",
        "name": "Blow Out",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fernandoschiavi"
        },
        "dateCreated": "2022-05-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082085/"
        },
        "name": "Brian De Palma's Blow Out brings a reasonable narrative of mystery, whose greatest strength is its interest in cinematic metalanguage",
        "reviewBody": "Unfortunately, the work does not appear among De Palma's most remembered titles, but it is still a milestone in his career, both for the aesthetics and outstanding resources used, as well as for his passion for cinema, applying several references to the films and directors that inspire him. Until today. Blow Out has everything to do with cinema, and the metalanguage present in the plot is a positive differential from the beginning. Here the references to Alfred Hitchcock are less explicit and more inspiring, and there is a reverse homage to Michelangelo Antonioni's classic, Blow Up: After That Kiss (1966) - not for nothing the film's original title (Blow Out) refers to the feature by the Italian filmmaker. The conspiracy takes over the story from an accident that may seem simple, but is filled with plots of the highest level.\n\nEven at the beginning, De Palma establishes the internal logic of the film: two bands, one for the images and the other for the sounds. We see Jack in his office, working on organizing and ordering a series of tapes where the sound effects he works with are recorded. A break to rest, sit in the armchair, turn on the television. In the news, the latest presidential poll results: Governor McRyan is way ahead of the other candidate. Jack gets up and goes back to work, but leaves the television on. The use of split-screen, a resource that no other filmmaker uses as well as De Palma. 50% of the screen will show us coverage of the presidential elections on television; another 50% will show Jack in his work, and what that work consists of. While in one band we have a narrative principle in which De Palma shows us with the fragile images of a TV news program various information that will be part of the film's intrigue, in the other band we have a rehearsal, the preparation of all the sounds that will constitute in a moment or another from the film (to come) vital information for the sound designer (a shot, the wind, a window breaking). Image and sound in their embryonic stages, still waiting for their father/creator/subverter to allow them to develop in narrative terms: the miracle of cinema, of the birth of cinema, filmed in all its splendor by De Palma.\n\nAs in most of the films written by De Palma, the story of One Shot in the Night is far from being the main force of the work. In addition to the absolutely brilliant proposal of making a neo-noir allied to a detective film using cinematographic instruments as investigative resources, De Palma opts for always shady choices for his story. Already betting the entire narrative by putting a common man inside a conspiracy plot bordering on exhaustion - the 1970s must have been champions with so many conspiracy films that were released, following the chaotic political wave of the USA at the time.\n\nThe script itself, signed by the director himself, suffers from some narrative exaggerations and questionable decisions by the characters, especially in the third act, where the film suffers a little from the pace of twists and easy solutions. At this point, it causes a certain distance in terms of veracity. Excess doesn't work so well here, but it is a hallmark of the filmmaker's career, a trait that elevated other of his projects to become classics, such as Scarface (1983) and The Untouchables (1987).\n\nEven bringing a story full of ups and downs, De Palma manages to transform his film with a direction that is nothing short of exceptional. Having never experienced the magic of the steady cam, the director already starts the film with a very fun intro in a long shot, inserting a subjective camera from the point of view of a hellish assassin on the loose in a dormitory full of slutty and perversion. Extrapolating with a myriad of sound effects, De Palma already infers the importance that sound will have in the work. It doesn't take long to emerge with the brilliant murder sequence, in which we have the exemplary creation of a peaceful atmosphere with Jack behaving like a voyeur of sounds capturing the conversations of others, owls hooting, frogs croaking and, finally, the own accident/murder.\n\nWhat makes the sequence phenomenal is the efficient decoupage in which in simple matters of close-up/reverse-shot, in addition to presenting close-up details of the directional microphone, De Palma creates the magnetism that links sounds and images separately. When he wants to impress, he uses the underappreciated technique of Split focus, a lens that allows him to simultaneously focus images that are in the foreground and foreground. Despite using the mesmerizing feature in several scenes, the most striking is when he frames the owl in the foreground, fitting Jack into the depth of field, establishing a poetic relationship of night watchmen, observers of the forbidden.\n\nAfter surprising us with the cinematographic quality presented in this opening excerpt, De Palma evokes his Baroque style full of passionate aesthetic touches - many of them taken from Hitchcock's work, such as the beautiful projection of shadows to illustrate the horror of yet another beheading in the city. In countless sequences, De Palma shows a relentless mastery over the camera creating a very personal cinematic signature that loves to explore both the montage - see the split-screen scenes, and the staging that reaches the apex of perfection in the scene of the murder of the prostitute at the station. By train, resulting in a suspense worthy of a master, by converging two excitations in the psychopath: sexual and the power to kill.\n\nIt's clear that De Palma wanted to be as creative as possible to give this passionate style to the work. Despite creating these great murder sequences and even a bizarre chase, the biggest efforts are concentrated on the elaborate scenes that exhibit the metalinguistic characteristic of Jack's work. There, yes, the montage is transformed to show all the intricate parts of the analog devices that help the protagonist to create the most different sounds. As there are many scenes involving the exercise of listening and manipulation of tapes, De Palma always brings some new element, whether in the creation of an inventive flashback based solely on the staging of the microphone's direction or in the simple sequence shot in which I rotate the camera in 360 degrees to show Jack's desperation to discover that all of his audio tapes have been erased.\n\nUsually, the characters are slightly superficial, though there is indeed a redemption arc that the screenwriter is creative in crafting, speaking directly to Jack's and Sally's abilities as well - as well as serving well as motivation for Jack's insistence on proving it. The murder given as a mere accident. Inevitably, De Palma creates a romantic arc for the main characters, which doesn't mesh very well due to the nature of excessive conflict, in addition to the complete lack of chemistry between Nancy Allen and Travolta. In fact, despite Travolta holding the film very well in a dense role, Nancy Allen is terrible at sustaining an annoying timbre, in addition to maintaining the same silly expression in every scene. But in fact, who steals the show is John Lithgow incarnating the interesting psychopath Burke - the candidate's enforcer who goes after the loose ends to leave no trace of the work.\n\nThe relationships between reality and fiction in Blow Out are two-way. If the cinematographic technique allows the unveiling of an event at first unknown (the murder covered up by an apparent accident), the real serves the cinema in the epilogue: the initial search for the perfect scream for a horror scene, frustrated throughout the narrative by artificiality. From the staging with bad actresses, it is finally concluded with the involuntary capture (and purposeful inclusion) of the desperate cry of a woman on the verge of death. Equality and fraternity between reality and fiction, as defended by Godard in Stories of Cinema (1988-1998). But perhaps these are overly positive terms to define how De Palma articulates this relationship. In the shot that closes One Shot in the Night, Jack sees the glowing result of his work with a mixture of pride and deep sadness. \"It's a good scream,\" he repeats in response to his boss's excitement, but then immediately covers his ears in anguish. The irony that exists in the film's absorption of reality is not treated by the director as a mere amusing joke, but with bitterness.\n\nFilled with the style of one of the most interesting minds in New Hollywood, Blow Out brings a reasonable narrative of mystery, whose greatest strength is its interest in cinematic metalanguage. However, despite a story that takes time to become memorable, De Palma invites us to a very accurate audiovisual journey in which he presents his best directing techniques, managing to make any fan of the filmmaker smile, who knows very well that we will be enjoying himself in the circular conclusion of his work on screams lost in the night.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three Reasons Criterion Trailer for Blow Out",
        "duration": "PT1M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1767089689",
        "name": "Blow Out: The Criterion Collection",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDBiYjYzMWMtOTkyOS00NGM5LTk5ZTMtMTNlMWY2YTU1NTZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDBiYjYzMWMtOTkyOS00NGM5LTk5ZTMtMTNlMWY2YTU1NTZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-06-07T04:05:34Z",
        "url": "https://www.imdb.com/video/vi1767089689/"
    },
    "url": "/title/tt0082085/"
}