{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Johnny Depp",
            "url": "/name/nm0000136/"
        },
        {
            "@type": "Person",
            "name": "Penélope Cruz",
            "url": "/name/nm0004851/"
        },
        {
            "@type": "Person",
            "name": "Franka Potente",
            "url": "/name/nm0004376/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 265388,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072799/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028247/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Person",
            "name": "Bruce Porter",
            "url": "/name/nm0692051/"
        },
        {
            "@type": "Person",
            "name": "David McKenna",
            "url": "/name/nm0571346/"
        },
        {
            "@type": "Person",
            "name": "Nick Cassavetes",
            "url": "/name/nm0001024/"
        }
    ],
    "datePublished": "2001-04-06",
    "description": "The story of how George Jung, along with the Medellín Cartel headed by Pablo Escobar, established the American cocaine market in the 1970s in the United States.",
    "director": [
        {
            "@type": "Person",
            "name": "Ted Demme",
            "url": "/name/nm0001130/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjg5ZDkzZWEtZDQ2ZC00Y2ViLThhMzYtMmIxZDYzYTY2Y2Y2XkEyXkFqcGdeQXVyODAwMTU1MTE@._V1_.jpg",
    "keywords": "drug abuse,nosebleed,police officer,drug cartel,cocaine",
    "name": "Blow",
    "original_info": {
        "id": "Blow_2001",
        "name": "Blow",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mentalcritic"
        },
        "dateCreated": "2004-11-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0221027/"
        },
        "name": "Uneven, but entertaining, all the same",
        "reviewBody": "Since not every film can be a great masterpiece, it only stands to reason that there are some which, as good as they are, will never be mentioned in the same breath as The Godfather. Blow happens to be one of those films. In today's market, where films are literally churned out with more attention paid to marketability than merit, it is no surprise that films of almost every subject are saturating the market. Even films about, or based upon, historical crime figures are a dime a dozen these days. The plus to this is that the ones that do come out have to do something special in order to be considered good.\n\nBlow's strengths lie in a couple of performances, and the scenes in which George Jung's ability to negotiate his way out of a fix (or into one) are displayed. Johnny Depp plays Jung with a consummate authenticity that, especially when sees the interviews with the real George Jung, literally leaps out of the screen. It's hard to believe this guy who I saw as a fresh-faced semi-nerd in A Nightmare On Elm Street is able to portray such a wide and varied range of characters. Ray Liotta gives him ample support as Fred Jung, showing a man hit hard by his own unsuccessful attempts to keep himself independent and free, therefore fully understanding of how far his son will go to see he doesn't fail in the same endeavour. The final scene with Liotta, where he is listening to the tape recording, is one of the most touching examples of men declaring they cannot regret their defiance seen on film.\n\nThe scenes with Pablo Escobar are especially amusing. As we see how George was able to charm his way into any deal he set his mind to, one cannot help but admire the man. Merely standing before the most powerful drug lord in South America at that time would have taken more guts than most people are allotted. The Jungian method of keeping oneself calm while smuggling through customs, even if completely fictional, sums up this this calmness in the face of danger quite brilliantly.\n\nBut, and it seems there always is a but with Hollywood product these days, some aspects of the film are terrible. Penélope Cruz is absolutely horrible as Mirtha Jung, and it is hard to believe that someone as cocky and bold as George would tolerate her presence. I've heard Salma Hayek (or horse-jaw as she is probably better-known) suggested for the part, but she is just as bad. Given how many actresses there are in Spain who would appreciate a break, and know a mode of speech other than screaming, one can't help but wish the director could have shown a bit of Jungian testicular fortitude and cast an unknown.\n\nAdding to the film's woes is the end of the story. Compared to the first two thirds, where we seem to be going along at the speed of one of Jung's sports cars, the whole thread about Jung's inability to live without contact with his daughter brings affairs to a screeching halt. That Christina Jung has never visited her father, at least according to the ending crawl, is a pretty sad fact. What's even worse is that after viewing this film, we never learn anything about Christina. We don't learn if the cocaine abuse on her mother's part during pregnancy had any ill effects, or whether she has led a life she would call satisfactory. She is little more than a prop. The fact that Jaime King, the actress who played her during the final wrap-up, is a recovering heroin addict only makes one wonder more. Especially among those of us who really have to live with permanent physical damage that may have been caused by parental drug abuse during in utero development (even if it was only nicotine in my mother's case).\n\nIn all, I gave Blow an eight out of ten. If you want to know anything about George Jung and how cocaine got to be such a hot item in America, then this film does make some excellent points. With the poor economy in America where blue-collar workers are in borderline poverty while CEOs rip them off something blind, it really is a wonder we aren't seeing the rise of an army composed of George Jung wannabes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from New Line Cinema",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3504603417",
        "name": "Blow",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzUyMmUwMWQtYWFkZC00YTAxLWJiNjUtMTA0NzY0OTZlMGFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzUyMmUwMWQtYWFkZC00YTAxLWJiNjUtMTA0NzY0OTZlMGFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-05-29T15:22:50Z",
        "url": "https://www.imdb.com/video/vi3504603417/"
    },
    "url": "/title/tt0221027/"
}