{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Foxworthy",
            "url": "/name/nm0289344/"
        },
        {
            "@type": "Person",
            "name": "Bill Engvall",
            "url": "/name/nm0257821/"
        },
        {
            "@type": "Person",
            "name": "Ron White",
            "url": "/name/nm1247387/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4582,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0081469/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008059/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0085172/"
        },
        {
            "@type": "Person",
            "name": "Bill Engvall",
            "url": "/name/nm0257821/"
        },
        {
            "@type": "Person",
            "name": "Jeff Foxworthy",
            "url": "/name/nm0289344/"
        },
        {
            "@type": "Person",
            "name": "Larry the Cable Guy",
            "url": "/name/nm1249256/"
        }
    ],
    "datePublished": "2003-03-28",
    "description": "The comedic stylings of four sort-of famous funnymen are brought to the big screen courtesy of this 2002 documentary.",
    "director": [
        {
            "@type": "Person",
            "name": "C.B. Harding",
            "url": "/name/nm1085552/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy",
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQyNzY0ODA4Ml5BMl5BanBnXkFtZTYwOTc3MTg5._V1_.jpg",
    "keywords": "stand up comedy,redneck,stand up comedian,live audience,stand up",
    "name": "Blue Collar Comedy Tour: The Movie",
    "original_info": {
        "id": "Blue Collar Comedy Tour: The Movie_2003",
        "name": "Blue Collar Comedy Tour: The Movie",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rdwright"
        },
        "dateCreated": "2004-07-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0330069/"
        },
        "name": "Watch it once...that is plenty",
        "reviewBody": "I am not a yuppie, country club golfer, or business tycoon. I have been called a redneck among other things, and I went to Agriculture school and am employed as a salesman for a livestock equipment company. I say all that to say this- I am a blue collar North Carolina country boy, and I think this movie just doesn't cut it.\n\nRON WHITE- Perhaps the funniest of the comedians featured here (believe me, there's more on the unfunny ones later), Ron White's material deals with small town life in a different way than Foxworthy/Engvall/LTCG. His comedy is more cerebral than the others, so I'm sure that fans of the other 3 won't find White as funny.\n\nBILL ENGVALL- Bill Engvall's shtick has worn thin by now. The \"Here's Your Sign\" bit died in 1996, but don't tell that to Bill. Watching this film, I get the feeling that Bill Engvall thinks he is funnier than he really is. If you can make it through Bill Engvall, here's to ya.\n\nLARRY THE CABLE GUY- Larry the Cable Guy I just don't get. His voice is an obvious caricature of the dumb redneck at the gas station and I admit that the first time I saw this movie, I actually thought he was kind of funny, but the more I see his act and hear his voice, the more it grates on my nerves. He has a knack for making up \"madder than\", \"happier than\", \"meaner than\" type quips that some audiences have howled at, but I just scratch my head. The material in this movie isn't so bad and it's not totally unfunny, but if you get a chance (and God help you if you consciously do so) to see Git-R-Done, which is LTCG's full routine, you will see some of the worst comedy ever recorded. And yet, the audiences roar and Larry is hotter than a rocket. Go figure\n\nJEFF FOXWORTHY- Foxworthy is now a guilty pleasure. The \"You Might Be A Redneck\" routine has worn VERY thin by now, and you can even see apprehension on Foxworthy's part when he is going through this bit later in his act. I think it has pigeon holed him as the redneck comic. His stand-up is better than Engvall & LTCG, but the whole bit is nothing new. The guilty pleasure part of all of this is that I can't turn away from Jeff Foxworthy. When he's on the radio, I can't help but listen to the same routines that I've heard a thousand times before. Maybe that is the appeal of Blue Collar comedy.\n\nIronically, I think people who get the biggest kicks out of this aren't rednecks at all. I watched this on Comedy Central with 2 guys- one from Maine, one from New Hampshire- and they laughed like this was the funniest thing they had seen.\n\nThe beautiful thing about comedy is that it knows no bounds and is broad enough to appeal to every human being on earth. I prefer a Brian Regan or Dennis Miller, while some prefer Chris Rock, David Brenner, or Bob Hope. There is no one alive who doesn't like to laugh and the bottom line is that this is a love-it or hate-it film based on what makes you laugh; there are no gray areas here."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi750453017",
        "name": "Blue Collar Comedy Tour: The Movie",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmRkYzEzNzMtMzgzMS00NDY5LTg4ZDAtMmQ3MTRkOTFhMjY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmRkYzEzNzMtMzgzMS00NDY5LTg4ZDAtMmQ3MTRkOTFhMjY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:42:15Z",
        "url": "https://www.imdb.com/video/vi750453017/"
    },
    "url": "/title/tt0330069/"
}