{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Lawrence",
            "url": "/name/nm0001454/"
        },
        {
            "@type": "Person",
            "name": "Luke Wilson",
            "url": "/name/nm0005561/"
        },
        {
            "@type": "Person",
            "name": "Peter Greene",
            "url": "/name/nm0338886/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 85348,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0149490/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059088/"
        },
        {
            "@type": "Person",
            "name": "Michael Berry",
            "url": "/name/nm1158243/"
        },
        {
            "@type": "Person",
            "name": "John Blumenthal",
            "url": "/name/nm0089824/"
        },
        {
            "@type": "Person",
            "name": "Stephen Carpenter",
            "url": "/name/nm0139461/"
        }
    ],
    "datePublished": "1999-09-17",
    "description": "A former convict poses as a cop to retrieve a diamond he stole years ago.",
    "director": [
        {
            "@type": "Person",
            "name": "Les Mayfield",
            "url": "/name/nm0562645/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTJkYTBlZjktYmYyYi00ZWQ0LTgyMWYtMjQ5Yzg1Y2M3YzE5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "fish out of water,diamond,detective,criminal,double cross",
    "name": "Blue Streak",
    "original_info": {
        "id": "Blue Streak_1999",
        "name": "Blue Streak",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "1999-09-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0181316/"
        },
        "name": "Martin Lawrence fits his role perfectly--not a bad film, but not necessarily great either. *** out of ****",
        "reviewBody": "BLUE STREAK (1999) ***\n\nStarring: Martin Lawrence, Luke Wilson, Peter Greene, David Chappelle, Graham Beckel Director: Les Mayfield 93 minutes Rated PG-13 (for language and violence) \n\nBy Blake French:\n\n\tMartin Lawrence was born to star in movies like \"Blue Streak,\" a film with much energy and wit, both elements he has coming out of his ears. The film has no major flaw in it. There are no structural problems, dialogue issues, disruptive subplots, characterization uncertainty or tedious nuggets found in it. The filmmakers take advantage of Lawrence being in the movie, and have lots of fun with both him and the plot--things that make this comedy worthy of a minimal recommendation. \n\nThe film opens with four jewel thieves, Miles Logan, Deacon, Eddie, and Tulley, constructing a heist in the middle of a dark, cold night attempting to steal a large diamond worth millions. Miles and Eddie sneak in the building, that beholds the valuable rock, from the roof using a steady rope to lure them down through the elevator shaft to their destination: a security safe, located a few floors down. Deacon stays above assuring Eddie and Miles' safely, while Tulley stands watch below in the getaway car.\n\n Then, something goes wrong. While the team of bandits do indeed succeed in breaking through the buildings security and swindle the diamond, when Miles and Eddie reach Deacon on the roof, however, he states that he is too greedy to spilt the value of the gem four ways, thus killing Eddie, and attempting to finish off Miles, who is holding on to the jewel, but before Deacon has the chance, the police arrive, and off goes Tulley in the getaway car, leaving Deacon and Miles no way to escape except to flee to a construction site nearby. There, Deacon manages to avoid being arrested by the cops, but never gets his hand on the gem. However, Miles keenly hides the jewel in the duct of this developing building, and makes note of where he hides it. As he arrested by the police, he vows to return for the secret treasure after his prison sentence is up--whenever that may be.\n\n Two years pass. Miles is happy to once again be a free citizen. He returns to his girlfriend, who, after never visiting him once in the two years he spent in jail, dumps him without a second thought. Miles is not too depressed, however, for he still has seventeen million dollars waiting for his arrival at the old contraction site where he hid it. The problem: that exact constriction site is now finished. It is a brand spanking new police headquarters! \n\nMiles tries desperately to enter the building, only to be rejected by security every time. That is, however, until one of his old buddies manufactures a false police identification for him, thus allowing him to break into the building, and search for his beauty. This is when he becomes involved with a crime bust that leads the police chief to believe that Miles is a professional, experienced cop, who is then partnered up with novice detective Carlson (Luke Wilson) to solve a criminal case. From here on out, the film runs from high energy and action packed excitement to clumsy and funny stunts of Logan trying to undercover the dream he once had located in what is now his office building. \n\nDirector Les Mayfield lets the film's writers have a lot of fun with the plot. The setup is at shaky and first a bit ridiculous, but then propels the entire story following it though the problems it faces; when the plot stumbles at times and forgets its purpose, the Logan character still has reason to continue on: the 17 million dollar jewel. The filmmakers do rely a bit much on that concept, but for the most part, the film stays clear from too many troubles. \n\nJust a few days ago, I screened the horror thriller \"Stigmata,\" and ended up not recommending it due to the fact that the film's scenes did not fit together to create a story possible to follow. While \"Blue Streak\" does fit together evenly and is distributive, if the truth be know, I would choose to see something with a little more depth, like \"Stigmata,\" than something as shallow as \"Blue Streak.\" But I feel that the majority of an audience goes to the movies for entertainment, not for some deep, disturbing message--if you're that kind of a moviegoer, then \"Blue Streak\" is for you.\n\n Brought to you Columbia Pictures.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Blue Streak",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1012900889",
        "name": "Blue Streak",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzNkYmQyNTYtMmY4YS00NjljLWFiZGYtNjM4ZTI2MzgzMzdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzNkYmQyNTYtMmY4YS00NjljLWFiZGYtNjM4ZTI2MzgzMzdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-11-02T03:05:40Z",
        "url": "https://www.imdb.com/video/vi1012900889/"
    },
    "url": "/title/tt0181316/"
}