{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dedee Pfeiffer",
            "url": "/name/nm0679410/"
        },
        {
            "@type": "Person",
            "name": "Randall Batinkoff",
            "url": "/name/nm0000871/"
        },
        {
            "@type": "Person",
            "name": "Danny Woodburn",
            "url": "/name/nm0940173/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1104,
        "ratingValue": 2.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0149603/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057336/"
        },
        {
            "@type": "Person",
            "name": "Brett Thompson",
            "url": "/name/nm0859920/"
        },
        {
            "@type": "Person",
            "name": "Lisa Morton",
            "url": "/name/nm0608037/"
        },
        {
            "@type": "Person",
            "name": "Ron Oliver",
            "url": "/name/nm0646987/"
        }
    ],
    "datePublished": "2004-10-15",
    "description": "When sharks come from afar, searching for food find a beach for meat. A group of people must stop them before they head for the beach. Will they make it?",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel Grodnik",
            "url": "/name/nm0342841/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY4MzE5NTEwNV5BMl5BanBnXkFtZTcwMTk3NTA1MQ@@._V1_.jpg",
    "keywords": "creature feature,shark feature,shark,cg effects,terrorist plot",
    "name": "Blue Demon",
    "original_info": {
        "id": "Blue Demon_2004",
        "name": "Blue Demon",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2015-07-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0444723/"
        },
        "name": "Pretty dire apart from the opening scene",
        "reviewBody": "The only good thing about Blue Demon is the opening, which actually was suspenseful and scary, and the one scene or even component of the movie that has any kind of professionalism. The rest of Blue Demon, on the other hand, is a massive waste of potential.\n\nIt's a very badly made movie for starters, too drably lit, too obviously shot with some unfocused and headache-inducing camera work and haphazardly edited. Worst of all were the special effects which were appallingly fake (not in a long time have I seen more artificial-looking sharks), especially the shark fins. The music is completely inappropriate and out of place, being too jazzy and upbeat when it should have been a more suspenseful and subdued approach. The script is very forced and like listening to gibberish, and the flow from one piece of dialogue to another is incredibly awkward and slow. It also tries to do far too much, with elements of horror, sci-fi and action, and executes all of them badly, with a seriously muddled sensation.\n\nBlue Demon's horror elements are neither scary nor suspenseful, apart from the opening. The shark attacks are too few and too brief, and they are also incredibly predictable that getting any surprises out of them is impossible, the cheapness of the shark effects also don't help. The sci-fi elements strains credibility to the extreme, even for the term science-fiction. The logic lapses are enough to fill a big notebook, and it was like the writers made the sci-fi elements up on the spot. The action suffers from the worst of the editing, and suffers even further with the tedious pacing and indifferent and over-silly choreography. The story is very dull, with a lot of scenes that add little, and there wasn't anywhere near enough of it to sustain the running time.\n\nDirection ranges from flat to incompetent, with seemingly no idea to generate any suspense or tension, instead playing it far too safe and by-the-numbers. The characters are annoying or bland stereotypes, and if you have a list in front of you with the most overused clichés in the genre written on it, it is more than likely that there will be ticks besides every cliché written down. The acting is very poor, with Jeff Fahey embarrassingly over-bearing and the rest of the acting is personality-deprived.\n\nOverall, apart from the opening scene, which prevents it from being down there with the worst shark movies ever, this is pretty dire all round. 2/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Blue Demon",
        "duration": "PT1M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi92539161",
        "name": "Blue Demon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDQyODhhOTMtMzg2ZS00YzNkLWFlNTYtZWQ4NWQyNDM1NzA3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDQyODhhOTMtMzg2ZS00YzNkLWFlNTYtZWQ4NWQyNDM1NzA3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-09-10T03:07:31Z",
        "url": "https://www.imdb.com/video/vi92539161/"
    },
    "url": "/title/tt0444723/"
}