{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Allen Payne",
            "url": "/name/nm0005300/"
        },
        {
            "@type": "Person",
            "name": "Angelle Brooks",
            "url": "/name/nm0111860/"
        },
        {
            "@type": "Person",
            "name": "Michael Taliferro",
            "url": "/name/nm0848075/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1437,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019977/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042833/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088429/"
        },
        {
            "@type": "Person",
            "name": "Craig Ross Jr.",
            "url": "/name/nm0743164/"
        }
    ],
    "datePublished": "2001-08-03",
    "description": "A child of a middle class home with solid moral values is lured into a world of crime and corruption.",
    "director": [
        {
            "@type": "Person",
            "name": "Craig Ross Jr.",
            "url": "/name/nm0743164/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwMTA2MjIyMl5BMl5BanBnXkFtZTcwMTUwNDQyMQ@@._V1_.jpg",
    "keywords": "hood,female rear nudity,female nudity,black independent film,crack cocaine",
    "name": "Blue Hill Avenue",
    "original_info": {
        "id": "Bluehill Avenue_2001",
        "name": "Bluehill Avenue",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SRLReeves"
        },
        "dateCreated": "2004-07-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283952/"
        },
        "name": "Negative men....Women are to blame....??",
        "reviewBody": "I'll explain my One line Summary but let me start by saying... I thought this movie was okay, because it didn't glamorize the life of a drug dealer. If you noticed, Tristan (Allen Payne) had that worried look on his face from the moment of all their wrong doings. LOL. Although, it didn't depict how two children raised in a middle-class home got sucked into the drug game....meaning Tristan as a dealer and his sister as an addict... but life itself is unpredictable. And so is CRACK...Altogether it was played out gracefully. \n\nOne flaw to me....was the way it ended, so cheesy after such a well thought out plot...but this is explained in the DVD director's scenes ...that there was only 20-something 11HR days to actually shoot film....But....there was at least one woman in the film that in some way to each character...was responsible for them ending up the way they were. Drug dealers. At first I thought, I am glad this film is not making excuses for them as to why.....they were poor (so is the rest of the world) and etc..but when I looked deeper...cause some of the issues in this film are DEEP.... i STARTED THINKING....he is casting blame on someone....WOMEN. From grandmomma, momma, girlfriend and wife. All the women in any man's life. Is it me, or did anyone else get that...?? Tristan's girlfriend who vowed not to get involved with a drug dealer.....did not only that, but married him. \n\nThe grandmother who cared enough about E-Bone (William L. Johnson)...to spoon-feed his butt when he was beaten up by those hoodlums ...came off like such a women-hater. He actually told her to her face that she failed him in the deleted scenes. And did he say \"Nobody cared about him?\"... I really wondered why E-bone was so angry...or how his mother died.....but was certainly glad that, THAT scene was cut from the actual film...it was filled w/ too much disrespect. We certainly don't want our grandchildren or children for that matter telling the grandmothers who didn't want them to go to a foster home and decided to try to raise them although old-fashioned, into a productive members to society. But that she failed because wasn't YOUNG enough !!! And on screen he displays his distaste w/ women by referring to even Tristan's wife as \"bi..h\" Uh....I smell a pattern. Mr. Carl Ross, Jr. ...Do you have something you want to say to us women, damn. To your mother. To your grandmother. To your wife. To your sister. Let's not forget Benny's (Clarence Thomas III) double-crossing two-timing girlfriend. Even Simon's mom was revealed to be a \"hoe\" and was still sleeping w/ his pimp daddy, but never bothered to tell him that the neighborhood thug was his daddy.....who was always under his nose.....Now what Pimp Father does to Simon, in the film was a very \"gotcha\" moment for me. Although you figure it out when watching cuz you gave us a clue in the beginning. This isn't necessary because the audience is not stupid. \n\nIn my experience as a once-aspiring actress....in the words of Uta Hagen...it was said: Acting is THINK AND NOT WHAT YOU DO....well in addition to that, as an audience we are there to watch...so lay-off a little on the narration and one too many clues...but still very nicely written. I liked the twists. Especially between Tristan and wife. I was fooled a little too and the way they finally \"set-it-straight\"...was also nicely written. The ending stunk though, I reiterate. Stunk very badly. William L. Johnson who played E-BONE was cast off too quickly and let's not forget how the girlfriend was discarded so non-chalantly. She thought she was a key player.....She even said so in the Trailer interviews on the DVD. LOL. And the survivor, was too smug after having his entire life, altered...won't give too much away....but watch how smug he is.....Although he broke down up the street....maybe he should have broken down in his woman's arms.... I know all roles for women can't be uplifting..cuz we do have some mommas who just are not there for their growing children but we wives re-raise some of these street punks or inspire them to be what they should have been....but I can suspend my disbelief and say again, Carl Ross, Jr. I liked the film And I am going to Netflix for more independent films to see if I can get more of your movies. ..but let me leave with this thought that when a boy grows to a man and decides to become a drug dealer, low-life, jail-bird...a film director or producer ....it is not all his momma's fault. Maybe its his daddy's....."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An otherwise upstanding boy is lured into a life of drugs and crime",
        "duration": "PT3M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1277625113",
        "name": "Blue Hill Avenue",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDA2MTVjYTYtZTUzZS00MjBlLWExODUtOWY4Mjc3Mzk1ZGI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDA2MTVjYTYtZTUzZS00MjBlLWExODUtOWY4Mjc3Mzk1ZGI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-02-15T06:12:58Z",
        "url": "https://www.imdb.com/video/vi1277625113/"
    },
    "url": "/title/tt0283952/"
}