{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Billy Gardell",
            "url": "/name/nm0974080/"
        },
        {
            "@type": "Person",
            "name": "Folake Olowofoyeku",
            "url": "/name/nm1919154/"
        },
        {
            "@type": "Person",
            "name": "Christine Ebersole",
            "url": "/name/nm0002056/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4663,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0004981/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005035/"
        },
        {
            "@type": "Person",
            "name": "Eddie Gorodetsky",
            "url": "/name/nm0331212/"
        },
        {
            "@type": "Person",
            "name": "Alan J. Higgins",
            "url": "/name/nm0383322/"
        },
        {
            "@type": "Person",
            "name": "Chuck Lorre",
            "url": "/name/nm0521143/"
        }
    ],
    "datePublished": "2019-09-23",
    "description": "An American guy falls in love with his Nigerian nurse.",
    "genre": [
        "Short",
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGEzOTc3MTctY2ExZi00MDViLWFkYTQtN2Y2MDFmN2NhZTI4XkEyXkFqcGdeQXVyNjc0MjkzNjc@._V1_.jpg",
    "keywords": "love,laugh track",
    "name": "Bob Hearts Abishola",
    "original_info": {
        "id": "Bob & Rose_2001",
        "name": "Bob & Rose",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "memekiller"
        },
        "dateCreated": "2021-03-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt10329024/"
        },
        "name": "Fine acting, some very funny scenes, but inauthentic",
        "reviewBody": "As a white guy who's dated Nigerian women, some of these scenes ring true and are perfectly done. Others are absurd and would NEVER happen. Lack of authenticity is why I deducted three stars. This show obviously is appealing to an American Chuck Lorre fanbase who enjoys sappy happy stuff, authenticity be damned. The good parts first: Folake is a treasure - she's a phenomenal actress and does everything right, dead-on a perfect representative of a West African princess. Gina Yashere is both hilarious and is part of the writing team, so she gets a lot of credit. Bob is also quite good, but some of his interactions are among the most absurd. A white guy dating an African woman would never get away with half the confrontational stuff he gets away with. He's a good actor, but his character is alternately too weak to hang with an African woman or too confrontational and the Nigerian community would ostracize him for some of the nonsense. In general, the Nigerian cast is excellent, and a bit of a surprise considering how bad the acting is in most Nollywood films. Now for the bad: Any Nigerian woman of Folake's intelligence and beauty falling in love with a socks maker? Hahahaha, not in a milliion years. If there's one thing all Africans know about Nigerians, other than they're considered arrogant in general, is that the women are totally, and I mean totally into status and money. And yes, I dated both Yoruba and Igbo women, and had a great time with Oti, Abiola, Saadatu, Blessing et all, but there was no hope of my getting to second base with their families without some serious coin. Also, as a white guy, you'd better be a bit fit and fashionable, as West Africans always look their best, and Billy Gardell looks way too big-belly and unfashionably dressed to attract a hot African woman. Cute story, and I enjoy a lot of the humor and recognize some of the situations as on-target, but they picked the wrong white guy to play the part, as much as I like Gardell's acting. The scene where Bob gives Abi some socks and later Kemi looks them over and Bob wins Abi's heart is for a sappy American audience who knows nothing about Africa. For my part, that scene, although well-done, made me choke and almost turn it off. I won't belabor the point, and there's some fine situations and acting and I find some scenes really great, but too many that are absurd who knows the lay of the land.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi26394137",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzg5ODE5ZDMtZGIzMC00MzZkLWFhNzMtMjZmZGMyMjJmZWU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzg5ODE5ZDMtZGIzMC00MzZkLWFhNzMtMjZmZGMyMjJmZWU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-18T13:36:04.475Z",
        "url": "https://www.imdb.com/video/vi26394137/"
    },
    "url": "/title/tt10329024/"
}