{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Dylan",
            "url": "/name/nm0001168/"
        },
        {
            "@type": "Person",
            "name": "Albert Grossman",
            "url": "/name/nm0343606/"
        },
        {
            "@type": "Person",
            "name": "Bob Neuwirth",
            "url": "/name/nm0627260/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9646,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "alternateName": "Bob Dylan: Dont Look Back",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045479/"
        },
        {
            "@type": "Person",
            "name": "D.A. Pennebaker",
            "url": "/name/nm0672060/"
        }
    ],
    "datePublished": "1968-02-24",
    "description": "Documentary covering Bob Dylan's 1965 tour of England, which includes appearances by Joan Baez and Donovan.",
    "director": [
        {
            "@type": "Person",
            "name": "D.A. Pennebaker",
            "url": "/name/nm0672060/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGM1ZTVmNGItOTIyNS00OTA4LTkxYjEtYTA0ZmQ2YjkxN2YwXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "timeframe 1960s,tour,hotel,music fan,guitarist",
    "name": "Dont Look Back",
    "original_info": {
        "id": "Bob Dylan: Don't Look Back_1967",
        "name": "Bob Dylan: Don't Look Back",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mcshortfilm"
        },
        "dateCreated": "2005-07-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061589/"
        },
        "name": "one of the best rock documentaries ever made",
        "reviewBody": "This is the documentary that gave meaning to the term \"cinema-verite\";\n\na term used to describe films that looked as if they were happening in real time. This is one of those films. It is a gritty black and white documentary that follows the legendary Bob Dylan during a tour in England. This is not a conventional rock documentary where we are shown endless concert footage and interviews with musicians talking about their philosophies and the meanings of their songs. Instead, the camera follows Dylan in a frenzy capturing every detail of social interaction with his fans, entourage, and the press. Dylan appears arrogant but it is no surprise when Pennebaker allows us to see the hypocrisy and greed of the outside world. A memorable moment in the film involves a fan whose invited himself backstage to meet Bob Dylan. He asks him absurd questions such as \"what is your attitude on life?\" Dylan decides to tease him and the conversation gets pretty ugly. Nevertheless, it is an important scene to the film because it shows us how difficult it is for a superstar such a Dylan to keep a smile and act nice to everyone. Do we gain sympathy for Dylan? We do because we see how alienated he feels among even his closest friends. We also feel a sense of envy for his ability to be so unapologetic and rebellious about his attitude. He is honest but he also has to protect himself from the public. After a Time magazine reporter asks him whether or not he cares what he's saying . Dylan attacks him and then tries to give him a straight answer . \"Do you think anyone who comes to these concerts is looking for anything other then entertainment?\" The next day, Dylan hears a quote from the papers that describes him as an anarchist. The sequence of these events show clearly how Dylan is at a loss with the public's perception of him. He can't just be himself. He wants to come across as a guy like anyone else but his sarcastic and meaningless interaction with the press only makes things worse. The film also includes appearances with Joan Baez, Donovan, Allen Ginsberg, and Dylan's sleazy manager Albert Grossman. I've seen this film dozens of times and I still see something new with every viewing. It is a true masterpiece.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Soon\"",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi614596889",
        "name": "Don't Look Back",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDZkNTU4Y2MtNDNmZi00MjkzLWFmNDUtMmY1MmYyYzIzZTU5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDZkNTU4Y2MtNDNmZi00MjkzLWFmNDUtMmY1MmYyYzIzZTU5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:51:36Z",
        "url": "https://www.imdb.com/video/vi614596889/"
    },
    "url": "/title/tt0061589/"
}