{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anita Ekberg",
            "url": "/name/nm0001179/"
        },
        {
            "@type": "Person",
            "name": "Sophia Loren",
            "url": "/name/nm0000047/"
        },
        {
            "@type": "Person",
            "name": "Romy Schneider",
            "url": "/name/nm0002769/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4724,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0004944/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136684/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0113968/"
        },
        {
            "@type": "Person",
            "name": "Giovanni Arpino",
            "url": "/name/nm0037097/"
        },
        {
            "@type": "Person",
            "name": "Suso Cecchi D'Amico",
            "url": "/name/nm0147599/"
        },
        {
            "@type": "Person",
            "name": "Italo Calvino",
            "url": "/name/nm0130902/"
        }
    ],
    "datePublished": "1962-06-26",
    "description": "Inspired by Boccaccio's novellas, each episode focuses on sex, love and seduction in Italy in the 1960s, an era of economic growth and major cultural changes.",
    "director": [
        {
            "@type": "Person",
            "name": "Vittorio De Sica",
            "url": "/name/nm0001120/"
        },
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        },
        {
            "@type": "Person",
            "name": "Mario Monicelli",
            "url": "/name/nm0598102/"
        }
    ],
    "duration": "PT3H25M",
    "genre": [
        "Comedy",
        "Fantasy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzM1MjVkZWItMTYxYi00YzNkLTk1NjktNTY3OTc1MGI1ZGQ5XkEyXkFqcGdeQXVyMzIzNDU1NTY@._V1_.jpg",
    "keywords": "episodic structure,anthology,italy,anthology film,portmanteau film",
    "name": "Boccaccio '70",
    "original_info": {
        "id": "Boccaccio '70_1962",
        "name": "Boccaccio '70",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rogierr"
        },
        "dateCreated": "2001-10-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055805/"
        },
        "name": "temptations and taboos",
        "reviewBody": "These three directors definitely distinguish themselves here from each other without being cocky. Well, Fellini and Ekberg may be VERY audacious, but that just adds positively to his work in my opinion. In his segment 'The temptations of Dr. Antonio' is enough material to fill an entire feature. It brings big fun and surrealism in a story about a very BIG billboard with a picture of Anita Ekberg on it holding a glass of milk. A moralistic guy (censor?) who lives right in front of the billboard (and BTW gets a very funny introduction in the film) can't accept the supposedly scandalous picture and takes action. After seeing it, I couldn't get this tune out of my head: 'Bevete piu latte' (you must drink milk) which is a commercial tune for the billboard. It is all very carnavalesque, versatile and entertaining. It's a pity Giuseppe Rotunno (Amarcord, Città delle donne, il Gattopardo, Carnal Knowledge) didn't dignify this segment with his cinematography (as he DID with Visconti's poetic segment which has a much more distinct atmosphere and has less special effects).\n\nThe common factor between the three segments is a (light) moral discussion about what sexual borders people can have and what must occur to make them actually think about it. Where exactly lies the border of your taboos? The film is also watchable as plain entertainment, for the three starring ladies are captivating and intense here (though in general I don't like Ekberg that much). Romy Scheider played a girl in the silly 'Sissy' (1955-57), but is already glorious with her subtle impression in this segment of a mature lady who gets double-crossed by her fiancee and takes revenge.\n\nI didn't see the segment 'Renzo e Luciana' unfortunately, because it was unavailable :(, but I guess I liked Fellini's part best and De Sica's least (as most of his work): De Sica had some better short films in 'Ieri, oggi, domani' (1963, all starring Sophia Loren). Or it could be that I liked the first two segments best, because there was Nino Rota's (Godfather, Amarcord) score under them. De Sica's segment is just not interesting in any way. Nevertheless this is a triptych of the highest order: underrated.\n\n9/10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A bigot obsesses over the gigantic poster of a voluptuous pin-up, a married woman finds a way of dealing with her husband's passion for call-girls, a sacristan wins a night with a beautiful fairground woman in a village lottery and a married couple's mishap enables them to buy their own house. Four of the greatest Italian directors - Fellini, Visconti, De Sica and Monicelli - join forces with show-stoppers Sophia Loren, Anita Ekberg and Romy Schneider in a carousel of sex and satire mocking the mores of Italian 60's society...\n\nFour arresting tales of women's empowerment and the sexual revolution in Italy's 1960s boom years. This light-hearted hymn to life is presented for the first time in both English and original Italian, with improved subtitles, and shown here as originally intended by the filmmakers in the original widescreen film format - now in restored HD.",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1638710809",
        "name": "Boccaccio '70 trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDI4ZDQ0OTMtYzU5Yi00MGRmLTgwMDMtMTE0NWU4Njk1Y2QzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDI4ZDQ0OTMtYzU5Yi00MGRmLTgwMDMtMTE0NWU4Njk1Y2QzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-12T12:43:03.161Z",
        "url": "https://www.imdb.com/video/vi1638710809/"
    },
    "url": "/title/tt0055805/"
}