{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Madonna",
            "url": "/name/nm0000187/"
        },
        {
            "@type": "Person",
            "name": "Willem Dafoe",
            "url": "/name/nm0000353/"
        },
        {
            "@type": "Person",
            "name": "Joe Mantegna",
            "url": "/name/nm0001505/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15683,
        "ratingValue": 4.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002257/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Person",
            "name": "Brad Mirman",
            "url": "/name/nm0592436/"
        }
    ],
    "datePublished": "1993-01-15",
    "description": "A lawyer defends a woman accused of killing her older lover by having sex with him.",
    "director": [
        {
            "@type": "Person",
            "name": "Uli Edel",
            "url": "/name/nm0248942/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDMxYzMzYTktNzE2MC00YWVkLWI0NDEtN2I3OTVhMzkzOThmXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "erotic thriller,female nudity,videotaped sex,sex with a handcuffed woman,blonde",
    "name": "Body of Evidence",
    "original_info": {
        "id": "Body of Evidence_1993",
        "name": "Body of Evidence",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "juliankennedy23"
        },
        "dateCreated": "2018-11-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106453/"
        },
        "name": "It is both as bad as you remember it but somehow endlessly entertaining.",
        "reviewBody": "Body of Evidence: 7 out of 10: A woman is on trial for seducing men to death. Will her lawyer get her off? Will she get him off? Stay tuned for the drama both inside and outside of the courtroom.\n\nThe case for the Prosecution:\n\nExhibit A: The courtroom scenes: AKA half the bloody movie. Body of Evidence is often considered an erotic thriller. However, it spends an amazing amount of time in the courtroom. Now courtroom scenes can work in thrillers (see 1990's Presumed Innocent), but they should be to the point and thrilling. The scenes here are pointless with half a dozen side characters introduced and then forgotten. It never feels like a real trial. The judge allows so many shenanigans that she makes Judge Ito look like Judge Judy.\n\nExhibit B: William Defoe: I genuinely like William Defoe. But as the lead character in an erotic thriller? As Weird Al Yankovic wrote about Mr. Defoe in his song \"Ode To A Superhero\"\n\n And he's ridin' around on that glider thing And he's throwin' that weird pumpkin bomb Yes, he's wearin' that dumb Power Rangers mask But he's scarier without it on\n\nNow If William Defoe switched roles with Joe Mantegna as the prosecutor that might have worked a lot better. Both are wonderful charismatic actors but nobody wants to see William Defoe's O face.\n\nExhibit C: Madonna: Madonna makes bad movies. This is a Madonna movie. Hence this is a bad movie. Prosecution rests.\n\n The prosecution is feeling a bit overconfident there and rested their case without mentioning Anne Archer's performance or the horrifying screenplay.\n\nThe Defense:\n\nExhibit A: Madonna: In 1992 naked Madonna was everywhere. People were buying $50 coffee books that consisted if nothing but pictures of her naked while hitchhiking. (This is true ask your cool aunt). As Rosie O'Donnell said to her in A League of Their Own. \"You think there are men in this country who ain't seen your bosoms?\" What a difference twenty-six years makes. We are not inundated with Madonna nowadays (naked or otherwise) so she seems fresh again. Also, she really isn't bad in this movie considering the lines she is given. She certainly gives a better performance than Anne Archer.\n\nExhibit B: Erotic Thrillers: Erotic thrillers enjoyed a moment between Basic Instinct and Showgirls. We really don't see them like these anymore and haven't for a long time. There were a lot of them in that time period (Heck there were two with Billy Baldwin for God's sake) So we often will revisit the lesser known ones for some nostalgia much like future generations will watch Ant-Man and muse how they don't make Superhero movies anymore.\n\nExhibit C: That one scene you forgot was in the movie: The defense is wheeling out a TV and DVD player. Looks like they are going to show a clip. The overconfident prosecution doesn't object. Is that a young naked Julianne Moore? Wow, that sex scene is so intense. Where did that come from and how did Madonna allow herself to be upstaged.\n\nThe Verdict: In 2018 the defense wins. Time has been kind to this movie. I certainly understand the panning this received when it hit the local cineplex in 1992. For one thing, Madonna and Julianne Moore fighting over William Defoe sounds like a mental patient's fan fiction. For another, this is a Netflix and chill movie, not something you want to see in a theater filled with suburban housewives and Paul Reubens. It is both as bad as you remember it but somehow endlessly entertaining.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi256818201",
        "name": "Body of Evidence",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjkzZGI4ZjgtYmRiNC00ZWM4LThmYWYtZTk4MzZhYTg3MDkzXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjkzZGI4ZjgtYmRiNC00ZWM4LThmYWYtZTk4MzZhYTg3MDkzXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-21T17:03:08.971Z",
        "url": "https://www.imdb.com/video/vi256818201/"
    },
    "url": "/title/tt0106453/"
}