{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Lorne Greene",
            "url": "/name/nm0001296/"
        },
        {
            "@type": "Person",
            "name": "Michael Landon",
            "url": "/name/nm0001446/"
        },
        {
            "@type": "Person",
            "name": "Dan Blocker",
            "url": "/name/nm0088779/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10013,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072315/"
        },
        {
            "@type": "Person",
            "name": "David Dortort",
            "url": "/name/nm0234228/"
        },
        {
            "@type": "Person",
            "name": "Fred Hamilton",
            "url": "/name/nm0357855/"
        }
    ],
    "datePublished": "1959-09-12",
    "description": "The Wild West adventures of Ben Cartwright and his sons as they run and defend their Nevada ranch while helping the surrounding community.",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGE2ZjIxZjgtMzdhMS00ZTYzLWFjMjQtN2U4ZTQ1NDVkNDBhXkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "nevada,brother brother relationship,father son relationship,patriarch,family patriarch",
    "name": "Bonanza",
    "original_info": {
        "id": "Bonanza_1959",
        "name": "Bonanza",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AlsExGal"
        },
        "dateCreated": "2010-10-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0052451/"
        },
        "name": "A great long-running western series that rode out the troubled 1960's",
        "reviewBody": "Bonanza explores the adventures of the Cartwright family consisting of three-time widower Ben Cartwright and his three sons Adam, Hoss, and Little Joe. Ben is a self-made man who has carved out a piece of Nevada - a large piece - as a prosperous ranch. Each of Ben's sons has a different mother and a very different background. Adam's mother is from New England, Hoss' mother had Scandinavian roots and met Ben out on the Great plains when Ben and Adam were on the way west after Ben's first wife died. Little Joe's mother was a southerner from New Orleans. This difference in roots is explored even in the first season when Little Joe almost joins the Confederate army after having someone come into town and stir up his feelings for his southern roots. However, the full story doesn't come out until later. There is one episode each in seasons two, three, and four that are dedicated to telling the story of each of Ben's wives.\n\nThis first season follows the successful road map that all of the seasons did. Many have a guest star that is recognized even today. For example, Yvonne De Carlo is the guest star in the very first episode. Alan Hale Jr. (The Skipper of Gilligan's Island) also makes the first of several guest appearances he will make over the years during the first season.\n\nMost episodes involve heavy-hitting drama often involving some injustice which the Cartwrights, with their prominent place in the community, are in a place to right. The show often used the fact that it was set in the old west to explore some of the social issues of the 1960's without stirring present-day controversy. However, there are a few almost completely comedic episodes here and there. The odd thing is, nobody did comedy as well as Bonanza did when Bonanza decided to do comedy, and usually Hoss is at the center of it all.\n\nThe show never really produces a long story arc. Each episode pretty much stands alone. The show really had only two disruptions. The first, which didn't prove fatal to the show, was when Pernell Roberts left in the late 1960's. His \"place\" was taken by Candy. Candy was not another son - he was a hired hand, but he was also a trusted friend of the Cartwrights.\n\nThe second disruption probably was fatal by most accounts. Dan Blocker, who played Hoss, died suddenly of a heart attack in 1972. The show only lasted one more season before it was canceled. Blocker's character of Hoss wasn't the most handsome of the Cartwrights in the conventional sense, but he was the heart and very much the sense of humor of the show. His loss was irreplaceable.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Clip: Original episodic promo",
        "duration": "PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2908488217",
        "name": "Bonanza: The Official First Season",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjJhY2U3M2YtMjIzOC00MzNiLTlhYzMtYjFhNTY1MDliYTQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjJhY2U3M2YtMjIzOC00MzNiLTlhYzMtYjFhNTY1MDliYTQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-09T11:29:31Z",
        "url": "https://www.imdb.com/video/vi2908488217/"
    },
    "url": "/title/tt0052451/"
}