{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Snoop Dogg",
            "url": "/name/nm0004879/"
        },
        {
            "@type": "Person",
            "name": "Pam Grier",
            "url": "/name/nm0000427/"
        },
        {
            "@type": "Person",
            "name": "Michael T. Weiss",
            "url": "/name/nm0919117/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7836,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007933/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039844/"
        },
        {
            "@type": "Person",
            "name": "Adam Simon",
            "url": "/name/nm0800048/"
        },
        {
            "@type": "Person",
            "name": "Tim Metcalfe",
            "url": "/name/nm0582481/"
        }
    ],
    "datePublished": "2001-10-24",
    "description": "Over 20 years after his death by a gunshot, Jimmy Bones comes back as a ghost to wreak revenge on those who killed him and to clean up his neighborhood.",
    "director": [
        {
            "@type": "Person",
            "name": "Ernest R. Dickerson",
            "url": "/name/nm0225416/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGU0NDRiNzMtNmNhNi00MmFkLWE1MjUtZTk4ZDk3ODRlZmE0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "revenge,mouth zoom,sexual assault,forced to kill,incest",
    "name": "Bones",
    "original_info": {
        "id": "Bones_2001",
        "name": "Bones",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "casey_choas66"
        },
        "dateCreated": "2002-10-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0166110/"
        },
        "name": "**** out of 5",
        "reviewBody": "The name Jimmy Bones strikes fear into the hearts of all who hear it. Back in 1979 he ruled the street, now after his death, over twenty years later Jimmy Bones is still in charge. After a group of teens buy Jimmy's building and turn it into a dance club, his sprit is released and he goes on a bloody rampage, seeking revenge on his killers. Sounds like a horror movie doesn't it? It even looks and feels like a horror movie. But if it's a horror movie your expecting you may be in for a little disappointment. We spend the entire film switching back and forth from 1979 to the present day. The 1979 scenes seem to be knocking on blacksplotion flicks. The present day scenes are a parody of new age fright flicks. Between the two settings everything seems to be played for laughs and it works wonderfully well. Back in 1979 there is everything you would expect to see in a blacksplotion flick, the afros, the sideburns, the stylish clothes and they even use phrases like \"kracker Saturday mourning special\" and you know what? It's pretty darn funny. Now we move to the present day. Seems like everyone in the film knows that they are ripping off House on Haunted Hill, there is even a reference to Vincent Price in there somewhere. You can also see all of your favourite old school horror cliches, projectile vomit made of maggots, the pipes that bleed, the severed head that still talk even after they have been decapitated, the pool table that bleeds after it is cut and the perfect silhouettes of blood that splatter on the wall. But what makes it so enjoyable is not the fact that we have seen it all before, it is how we get the feeling that film makers don't want us to take the film seriously, they just want us to sit back and enjoy. The film has a very \"fun\" atmosphere surrounding it and that is something that you don't find often in horror flicks today. The script is so clever you almost have to let out a chuckle because everything that happens is so predictable. What do you think will happen when a turn table group called the Resurrection Brothers enter a haunted house or when you find a dog with glowing red eyes that attacks you and you keep him and call it Bones? It's almost like the fact that everything is so stupid and cliched that it comes off as being smart. Now I'm not saying that everything is all fun and games. Director Ernest R. Dickerson throws in some very distorted camera angles and creepy imagery to keep the horror fans please and the meek on the edge of their seats and it comes off rather effective. Snoop Dogg is wilding over the top and entertaining as Jimmy Bones who could very well have been making the next Crow film right here without anyone knowing and blacksplotion queen Pam Grier can also be seen as Bones' girl. The special effects are very enjoyable whether they are serious (the night club explosion) or amusing (the talking head) or even just plain bad (the fake looking blood) and not to mention there is never an absence of gore through out. If I didn't know any better I would have to say that this is a feel good movie. So if you are looking for an entertaining nod to the old school that doesn't require and thinking or logic than you are in for one of the summers best horror flicks, it not you'd better just pass this one by."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1838530073",
        "name": "Bones",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzk4ZWQ4MDktMmUzNC00ZWMxLWIwMTUtNjY0NDQyM2QzZGFmXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzk4ZWQ4MDktMmUzNC00ZWMxLWIwMTUtNjY0NDQyM2QzZGFmXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-21T17:03:08.396Z",
        "url": "https://www.imdb.com/video/vi1838530073/"
    },
    "url": "/title/tt0166110/"
}