{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean Seberg",
            "url": "/name/nm0781029/"
        },
        {
            "@type": "Person",
            "name": "David Niven",
            "url": "/name/nm0000057/"
        },
        {
            "@type": "Person",
            "name": "Deborah Kerr",
            "url": "/name/nm0000039/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5341,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Bonjour Tristesse",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0167772/"
        },
        {
            "@type": "Person",
            "name": "Arthur Laurents",
            "url": "/name/nm0491306/"
        },
        {
            "@type": "Person",
            "name": "Françoise Sagan",
            "url": "/name/nm0755982/"
        }
    ],
    "description": "Spoiled Cecile, 17, spends her summer at the French Riviera with her rich, widower, playboy dad and Elsa. Anne, her late mom's friend, visits and brings changes to all.",
    "director": [
        {
            "@type": "Person",
            "name": "Otto Preminger",
            "url": "/name/nm0695937/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTAzOTY5NTU2NDJeQTJeQWpwZ15BbWU4MDAyNzMyMTAx._V1_.jpg",
    "keywords": "playboy,french riviera,french literature,foreign language adaptation,based on novel",
    "name": "Bonjour tristesse",
    "original_info": {
        "id": "Bonjour Tristesse_1958",
        "name": "Bonjour Tristesse",
        "year": "1958"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2008-08-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051429/"
        },
        "name": "Sagan soaper",
        "reviewBody": "David Niven and Jean Seberg say \"Bonjour Tristesse\" in this 1958 film directed by Otto Preminger and also starring Deborah Kerr and Mylène Demongeot. Niven and Seberg are Raymond and Cecile, a father and daughter vacationing on the Riviera and having a superficial blast for themselves. Raymond has his current girlfriend Elsa (Demongeot) living with them as well. When a good friend of Raymond's late wife, Anne (Kerr) comes to visit, things change - at first for the better, as the four of them continue the party atmosphere. Later, when Anne becomes Raymond's fiancée and begins to discipline Cecile, the fun stops. Cecile decides that Anne will have to go.\n\nThe film is told in flashback, black and white representing the present and glorious color used to tell the story, which is narrated by Seberg.\n\nThere's lots about this movie that is fascinating, and some of it just sort of falls flat. The idea that a deep-thinking, responsible career woman comes into the lives of two bon vivants is an interesting one, and you couldn't ask for a better cast. The beginning of the film, and even Cecile's plan to get rid of Anne that she brings Elsa and her own boyfriend Phillipe in on has a lighthearted feel to it. What Raymond and Cecile never considered is that there are ramifications for actions, Cecile due to her immaturity and Raymond because he's Raymond.\n\nDavid Niven is terrific as the dashing Raymond, who loves a party, and Deborah Kerr gives a warm performance as Anne, who truly loves him and wants to ground both him and his daughter. The curiosity here is Seberg. She is as always the perfect gamine. Any time she's in a scene, you can't take your eyes off of her. She's so darn beautiful. Yet I don't think I've ever heard her say one line that I believed. And she's one actress where it just doesn't seem to matter. We hear a lot about \"it\" - well, she really had it.\n\nGorgeous scenery - you want to leave for the Riviera immediately. And, truth to tell, spending some time with Raymond, Cecile and Elsa before the arrival of Anne wouldn't be bad either.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi160677657",
        "name": "Bonjour Tristesse",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWM5ODJmZjktOWM4MS00M2MxLWI2OWQtZDQzYzU0YzhjMDdiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWM5ODJmZjktOWM4MS00M2MxLWI2OWQtZDQzYzU0YzhjMDdiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-09-17T17:05:36.875Z",
        "url": "https://www.imdb.com/video/vi160677657/"
    },
    "url": "/title/tt0051429/"
}