{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kaori Shimizu",
            "url": "/name/nm0793654/"
        },
        {
            "@type": "Person",
            "name": "Crispin Freeman",
            "url": "/name/nm0293342/"
        },
        {
            "@type": "Person",
            "name": "Rachael Lillis",
            "url": "/name/nm0510418/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 996,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Boogiepop Never Laughs: Boogiepop Phantom",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066114/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022946/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011066/"
        }
    ],
    "datePublished": "2001-10-09",
    "description": "A light in the sky, followed by a strange aura and grisly murders. Each character tells their own connection to the event and to a similar murder spree 5 years ago. All of the different stories are slowly tied together by seemingl...",
    "genre": [
        "Animation",
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzkxNWZmYTEtYjY0YS00YTk4LTkxNDEtMDU2ODM3YjUzZDU1XkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "alter ego,memories,phantoms,psychology,urban legend",
    "name": "Boogiepop Phantom: Boogiepop wa Warawanai",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "csi_yellowknife"
        },
        "dateCreated": "2003-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0324700/"
        },
        "name": "A Confusing, dark, yet beautiful show",
        "reviewBody": "I must admit I giggled when I heard the name \"Boogiepop Phantom\" at first. It had the sound of a cheap 60s cartoon that combined Scooby Doo's ghosts and Archie's bad music. Nothing could be further from the truth.\n\nBPP is an anime, but much more than that. It is a show that is rather difficult to describe, but I'll try. \"Boogiepop\" is something of an urban legend, like the Boogieman, a being that takes people at the end of their life, or something like an angel of death. However, people living now claim to have seen Boogiepop. In addition, there was an unexplained column of light that appeared, people missing, a serial murderer that suddenly stopped years ago, and an abandoned Amusement Park that is suddenly coming to life. That just scratches the surface.\n\nWhat is impressive about BPP is the way the story is told. The 4th episode happens before the first three. We are introduced to major characters in the first episode who do not appear again for a few episodes. Things happen on screen out of time with the rest of what's going on. Overall, the show should be one that fans of X-Files, The 6th Sense, or the Twilight Zone should enjoy. That's a challenging show that will make you use your rewind button more than once."
    },
    "url": "/title/tt0324700/"
}