{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Suzanna Love",
            "url": "/name/nm0522429/"
        },
        {
            "@type": "Person",
            "name": "Ulli Lommel",
            "url": "/name/nm0518579/"
        },
        {
            "@type": "Person",
            "name": "Shannah Hall",
            "url": "/name/nm0356094/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1155,
        "ratingValue": 2.1,
        "worstRating": 1
    },
    "alternateName": "Boogeyman II",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0228068/"
        },
        {
            "@type": "Person",
            "name": "Ulli Lommel",
            "url": "/name/nm0518579/"
        },
        {
            "@type": "Person",
            "name": "Suzanna Love",
            "url": "/name/nm0522429/"
        },
        {
            "@type": "Person",
            "name": "Bruce Pearn",
            "url": "/name/nm0213179/"
        }
    ],
    "datePublished": "1983-08-24",
    "description": "Lacey travels to Hollywood, to the home of a film director, where she brings along the last surviving haunted mirror shard from the end of the first movie as proof to her horrifying experiences.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Pearn",
            "url": "/name/nm0213179/"
        },
        {
            "@type": "Person",
            "name": "Ulli Lommel",
            "url": "/name/nm0518579/"
        },
        {
            "@type": "Person",
            "name": "Paul Willson",
            "url": "/name/nm0932750/"
        }
    ],
    "duration": "PT1H19M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzI4YjAzZTctYjU3MC00YTIyLWI0NDEtODkyMzNjMDExMzQwXkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_.jpg",
    "keywords": "mirror,flashback,traumatic childhood experience,broken mirror,director",
    "name": "Revenge of the Boogeyman",
    "original_info": {
        "id": "Boogeyman 2_1983",
        "name": "Boogeyman 2",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2008-03-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085266/"
        },
        "name": "Redux version",
        "reviewBody": "Boogeyman II(1983/2002) \n\n* 1/2 (out of 4) Original Cut \n\nBOMB (out of 4) Redux Version\n\nNotorious follow up to the 1980 cult classic has that films only survivor (Suzanna Love) going to Hollywood to see a friend when several producers become interested in her story. The only problem is that part of the broken mirror from that original film is with her and soon the boogeyman is once again killing folks. If the story sounds mildly interesting then you can just forget that because sadly this film is made up of at least sixty-percent of footage from the original movie. I still remember the first time I watched this film and how confused and disappointed I was that it didn't feature more of a story. THE BOOGEYMAN was a surprise hit and an effective thriller but none of that eeriness made its way to this cheap sequel, which was made after Lommel turned down an offer from Paramount for a bigger budget. Once you try and get past the fact that the majority of this movie is from the original, you're left with a rather nutty film. We get some extremely bizarre and at times downright stupid death scenes including one with a tooth brush and another with a car muffler. How these death scenes are carried off are rather obvious and cheap. I hated this film with a passion when I first saw it and the \"director's cut\", released through Image, didn't do the film any justice as it just featured this film minus about twenty-minutes and then with new footage thrown back into the film making it more BOOGEYMAN 4 than anything else. I was rather shocked to see how much nostalgia this film carries and how much better it plays out today. You can just look at the thing and see, smell and taste the cheapness of those early 80's and on that level the film mildly works. The performances are all rather bland, especially Lommel as the director and it's a shame Love wasn't given more to do here. No matter how the movie struck me this time there's no denying that this is still a major disappointment considering how effective the first film was and how much more could have been done here. As it is, the film comes off as Lommel just throwing a fit about Hollywood as that's what takes up a lot of the new footage.\n\nWhen THE BOOGEYMAN became a huge hit in 1980 every studio lined up hoping Ulli Lommel would do a sequel. For a while he refused but when he finally gave in he turned out one of the worst films ever made. Boogeyman 2 started with over forty-minutes worth of footage from the first film and then the second half had the director starring as a director being forced into making a sequel and the boogeyman shows up to kill the producer's. Then in 2002 for the DVD release, the director decided he didn't like this version so what's he do? He keeps all the footage from The Boogeyman but with the Boogeyman 2 footage he turns the color into B&W and has the scenes play in a fast forward mode. He then adds fifteen minutes of newly shot footage (of himself) and pretty much changes the entire film to where you should really be calling this Boogeyman 4. On the DVD interview the director says that parts 5-9 will be coming soon. Since there isn't a part 4 I'd say that's what this is suppose to be, although Image is still selling the DVD as a sequel to the original film, which is certainly false marketing. So in the end, Lommel made a hit film in 1980, kept the rights to that film and since then has made two sequels plus this thing with that original footage with newly added stuff on each one. Talk about milking a movie.\n\nThis \"Redux\" version actually adds more scenes from the original movie and takes away several scenes from the original part 2. Again, the original part 2 was a horrid film but it did feature some hilarious death scenes including one by a muffler and another by a toothbrush. This \"Redux\" version makes the film look even worse and it's a damn outrage that Image would release what's basically part 4 as the original part 2. I'm counting this as a new view."
    },
    "url": "/title/tt0085266/"
}