{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Loretta Young",
            "url": "/name/nm0949835/"
        },
        {
            "@type": "Person",
            "name": "Cary Grant",
            "url": "/name/nm0000026/"
        },
        {
            "@type": "Person",
            "name": "Jackie Kelk",
            "url": "/name/nm0445470/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1186,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067247/"
        },
        {
            "@type": "Person",
            "name": "Ralph Graves",
            "url": "/name/nm0336339/"
        }
    ],
    "datePublished": "1934-05-18",
    "description": "An immoral mother blackmails a wealthy businessman after he accidentally hits her delinquent son with his truck.",
    "director": [
        {
            "@type": "Person",
            "name": "Lowell Sherman",
            "url": "/name/nm0792514/"
        },
        {
            "@type": "Person",
            "name": "Jack Conway",
            "url": "/name/nm0176699/"
        }
    ],
    "duration": "PT1H2M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjI4MTAxMDYxN15BMl5BanBnXkFtZTgwNzkzODgwMzE@._V1_.jpg",
    "keywords": "damsel in distress,film title in tagline,1930s,deception,grief",
    "name": "Born to Be Bad",
    "original_info": {
        "id": "Born to Be Bad_1934",
        "name": "Born to Be Bad",
        "year": "1934"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jmileslaw"
        },
        "dateCreated": "2012-07-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0024906/"
        },
        "name": "Just watch the clothes, not the story line",
        "reviewBody": "This movie is worth watching if only for the costumes. Loretta Young's hair is soft, shiny, straight at the top and fuzzy and curly at the bottom. It's a virtually impossible hair style to achieve. Her acting is stellar, her figure so razor thin,yet still feminine and curvy. This was before there were anything but natural fibers, and the cloth used to make the costumes in the movie looks like liquid silver and gold. Cary Grant is a little weak, hair plastered down, no good dialogue for him. But he's still Cary Grant, so that's all you need to hold your attention completely. The little kid actor is awful, and worse, he's not even cute! He makes you want to turn away from the screen. Huge ears, huge nose, looks like he's already hit puberty--really embarrassing scene where he's in a tight swimming suit and his mother comments it looks like a girl. Also some icky scenes of what could only be described as family violence between the mother and the son. When the movie is over you say, \"What!? It's over?\" Then you start going over the last scene to see if you missed anything. Keep your eyes open in the last five minutes. Not that the surprise is anything but the abrupt ending, but you'll feel better if you were concentrating. Just sit back and get lost in those beautiful Loretta Young eyes, and ask yourself, \"Are her eyes blue or violet?\" *sigh* It's also a little disturbing when you think about how the movie is portending Loretta's own life. I really hate the character of the creepy little book store owner who is supposed to represent decency in Loretta's character's life. He just comes off as a perv. Also insulted by the antisemitism in what appears to be a crooked Jewish lawyer. Still rude even though it's 1934. I think Cary's wife is actually a strong character, though not well-developed. Probably most of her scenes ended up on the floor. Interesting use of the latest technology of the age--movies in the courtroom and recording in your own home. Must have been very space age at the time, and it's so fun to see the old 78 records you could break apart with your hands. It's a revealing slice of 1934 which shows that the human experience has not changed much in 75 years. But the movies have-where are those gorgeous movie stars?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0024906/"
}