{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kochi",
            "url": "/name/nm2100653/"
        },
        {
            "@type": "Person",
            "name": "Avijit Halder",
            "url": "/name/nm2099087/"
        },
        {
            "@type": "Person",
            "name": "Shanti Das",
            "url": "/name/nm2092248/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17548,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0230229/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0123742/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0176723/"
        },
        {
            "@type": "Person",
            "name": "Zana Briski",
            "url": "/name/nm1498640/"
        },
        {
            "@type": "Person",
            "name": "Ross Kauffman",
            "url": "/name/nm1502104/"
        }
    ],
    "datePublished": "2005-03-11",
    "description": "Two documentary filmmakers chronicle their time in Sonagchi, Calcutta and the relationships they developed with children of prostitutes who work the city's notorious red light district.",
    "director": [
        {
            "@type": "Person",
            "name": "Zana Briski",
            "url": "/name/nm1498640/"
        },
        {
            "@type": "Person",
            "name": "Ross Kauffman",
            "url": "/name/nm1502104/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Documentary",
        "Biography",
        "News"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY0Nzc4NDEwNl5BMl5BanBnXkFtZTcwMjMyNzcyMQ@@._V1_.jpg",
    "keywords": "prostitute mother,prostitute,photograph,children,poverty",
    "name": "Born Into Brothels: Calcutta's Red Light Kids",
    "original_info": {
        "id": "Born Into Brothels_2004",
        "name": "Born Into Brothels",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "khwangbo"
        },
        "dateCreated": "2005-03-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0388789/"
        },
        "name": "Problems with Born into Brothels",
        "reviewBody": "I saw BIB last night. I expected to love it, since it had won the Oscar and I am a documentary filmmaker. I thought it was a well-crafted documentary, but there was a surprising \"ick\" factor to the film for me. First, I was turned off by Zana Briski's personality...the way she was talking to the school officials. She seemed self-conscious in her role as the kids' advocate...she sounded stilted, preachy and thus, ineffective. I also didn't like the way she imposed a solution on the kids, a solution that worked for her but not for them. The photography class sounded like a \"cool\" thing that she could tell her liberal artsy friends about back in England, but was probably less helpful to the kids than social work, a free lunch program or academic tutoring. Also her solution was for the girls to go to a boarding school \"to get them away from all this.\" I thought that showed a lack of understanding about the situation the girls were in. How could they succeed in a boarding school when they probably weren't academically ready? How could they succeed without emotional support, separated from their families? How could their mothers be expected to accept being separated from their daughters? It bothered me the way that the school officials kept telling Avyjit, the brightest and most talented boy, that he would have to work hard and improve his grades. No wonder Avyjit was turned off. How is he supposed to improve his grades when he hasn't had enough structure in his life to develop good study habits? The whole photography project smacked of some well-intended idea by some liberals who thought, \"wouldn't it be cool if we gave cameras to a bunch of street urchins and they came up with cool photos? We could do an art show and other do-gooders would think we were cool!\" I'm sure Zana Briski intended to help the children and she did help a few, but why did she set out to help so few to begin with? I keep trying to say nice things about the film and end up criticizing it again. It seemed almost like a reality show...pick seven street urchins and shower them with amazing opportunities. Pour tons and tons of resources into a few kids, then make a film about it. Despite dangling the opportunities in the kids faces, more than half of them did not see their lives improve. It was a well-crafted film which educated many people about the plight of these children. I just hope that other people who know more about social work than these filmmakers do, will be able to really help these children. Maybe I will since I have seen this movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Think Film, Inc",
        "duration": "PT2M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2965045529",
        "name": "Born Into Brothels: Calcutta's Red Light Kids",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTcxYzA0ODQtYTk2NS00MzNiLWI1ZmMtYmUzMTY1MjE3NDQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTcxYzA0ODQtYTk2NS00MzNiLWI1ZmMtYmUzMTY1MjE3NDQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:46:02Z",
        "url": "https://www.imdb.com/video/vi2965045529/"
    },
    "url": "/title/tt0388789/"
}