{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jet Li",
            "url": "/name/nm0001472/"
        },
        {
            "@type": "Person",
            "name": "Keith Anthony",
            "url": "/name/nm0030927/"
        },
        {
            "@type": "Person",
            "name": "Kaiming Chen",
            "url": "/name/nm1152569/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2016,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "alternateName": "Born to Defense",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0239007/"
        },
        {
            "@type": "Person",
            "name": "Jia Er-Ge",
            "url": "/name/nm0258576/"
        },
        {
            "@type": "Person",
            "name": "Yeung-Ping Sze",
            "url": "/name/nm0843867/"
        }
    ],
    "datePublished": "1986-02-16",
    "description": "Jet, a young soldier at the end of the second World War must overcome some abusive Americans who are bullying him as well as the Chinese people.",
    "director": [
        {
            "@type": "Person",
            "name": "Jet Li",
            "url": "/name/nm0001472/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Action",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGZkY2I3N2YtMjBiZi00ODNlLTliMTktODMzOGI1YjU0NzkwXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "victory,opening action scene,gun fu,bolt action rifle,infantry",
    "name": "Zhong hua ying xiong",
    "original_info": {
        "id": "Born to Defense_1986",
        "name": "Born to Defense",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BA_Harrison"
        },
        "dateCreated": "2006-09-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096507/"
        },
        "name": "A disappointing martial arts movie directed by, and starring, Jet Li.",
        "reviewBody": "Jet Li directs and stars in Born to Defend, a fight-packed martial arts movie set in China shortly after the end of the second world war. Li plays Jet, a soldier returning from the war who begins working with his pal (and ex-lieutenant), Zhang, helping with his rickshaw business. But when his wartime buddy is hospitalised in a fight with an American, and the rickshaw is trashed by a gang of US Navy bullies, Jet seeks revenge\n\nI love the majority Jet Li's movies, so it is a shame to report that this one is a bit of a letdown action-wise, and also extremely xenophobic; every American is portrayed as a drunken, brawling, womanising, murderous thug without any redeeming features whatsoever, whilst the Chinese are (mostly) seen as hard-working and honourable people. I realise that foreigners are often used as bad-guys in this kind of movie, but the 'racism' in Born to Defend is taken to a ridiculous level which is totally unacceptable (and I'm not even an American).\n\nThe fight action, although plentiful, doesn't live up to the standard that fans have come to expect from a Jet Li movie, and the fact that the hero gets his butt kicked for the majority of the running time makes the film even more disappointing. Jet's incredible martial arts skills take a back seat, with most of the early fights being boxing matches (with only a few kung fu kicks thrown in to occasionally spice things up).\n\nThe finale sees events improve somewhat with a terrific showdown between Jet and his enemies in a factory, but it is a case of too little, too late.\n\nJet handles the direction well and it is a shame that he hasn't tried helming a movie since; maybe his debut's lack of business at the box-office knocked his confidencea shame, since he shows promise behind the camera, with an impressive explosive battle at the beginning and some lovely rain drenched scenes later on.\n\nDie hard Jet Li fans will probably want to check this out regardless, but casual viewers bewarethis is not one of his better efforts.\n\n5.5/10 (which I will generously round up to 6 for the IMDb rating).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0096507/"
}