{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michel Simon",
            "url": "/name/nm0800302/"
        },
        {
            "@type": "Person",
            "name": "Marcelle Hainia",
            "url": "/name/nm0354325/"
        },
        {
            "@type": "Person",
            "name": "Sévérine Lerczinska",
            "url": "/name/nm0503495/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5946,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Boudu Saved from Drowning",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044664/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0213218/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0170729/"
        },
        {
            "@type": "Person",
            "name": "René Fauchois",
            "url": "/name/nm0268988/"
        },
        {
            "@type": "Person",
            "name": "Jean Renoir",
            "url": "/name/nm0719756/"
        },
        {
            "@type": "Person",
            "name": "Albert Valentin",
            "url": "/name/nm0884152/"
        }
    ],
    "datePublished": "1967-02-23",
    "description": "A bookseller saves a tramp from drowning and shelters him, but the tramp's odd behavior starts to wear everyone down.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean Renoir",
            "url": "/name/nm0719756/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzlhYTI1MzgtZTU4MS00MDhmLWE5NjUtNTJjYTY4NmJhNjIxXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "comedy of manners,satire,fish out of water,rags to riches,eccentric family",
    "name": "Boudu sauvé des eaux",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2020-07-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0022718/"
        },
        "name": "Worth the rediscovery",
        "reviewBody": "There is plenty more of Jean Renoir's films to see, but what has been seen of his work has been good to brilliant (my first film of his being the quite fascinating 'Madame Bovary'), only not caring for 'Woman on the Beach'. He was my main reason for seeing 'Boudu Saved from Drowning'. The very neat idea was another selling point as well as my general love for French, and foreign in general, cinema, and the high recommendation given by trusted friends.\n\n'Boudu Saved from Drowning' is not one of Renoir's best out of the films seen so far, and it is not hard to see why some would not care for it if they prefer their lead characters to be likeable. In 'Boudu Saved from Drowning's' case the lead character is pretty much the complete opposite of that. The exceptionally high quality of the production values and the direction cannot really be denied though, regardless of what one's thoughts on everything else is.\n\nWill start with the numerous good, great even, things. 'Boudu Saved from Drowning' is an exceptionally well made film on the visual front. The cinematography is just exquisite and at its best visual poetry, some of the best of its year. There is nothing claustrophobic or over-intimate about it so visually it doesn't look too stagy, the settings are handsome and evocative and the lighting quite atmospheric. The music has great use of the flute and chorus, is beautifully orchestrated and fits the story's tone very well. Renoir's direction is exemplary, always keeping what's going on engaging and not disjointed while showing a visual mastery.\n\nReally liked how 'Boudu Saved from Drowning' was scripted, the humour is essentially satirical and it is scathing but also clever and not too heavy, with the right amount of light-heartedness. The story isn't dull and unlike 'Woman on the Beach' doesn't feel choppy or incomplete, understanding what's going on wasn't an issue for me. The titular character is as unlikeable as they come and is a very juicy role, but the film just about avoids being mean-spirited thanks to some amusing comic timing and energy. Michel Simon is larger than life great and the rest of the cast do well.\n\nDespite their character writing being very thinly sketched and dominated by Boudu, so 'Boudu Saved from Drowning' is thin when it comes to characterisation.\n\nAlthough it's not a dull film and is cohesive, the film could have been a little longer to allow the drama later on to flow a little more naturally.\n\nIn summary, very good. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0022718/"
}