{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "James Getzlaff",
            "url": "/name/nm1445454/"
        },
        {
            "@type": "Person",
            "name": "Dani Behr",
            "url": "/name/nm0066982/"
        },
        {
            "@type": "Person",
            "name": "Wes Culwell",
            "url": "/name/nm0191758/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 203,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071084/"
        },
        {
            "@type": "Person",
            "name": "Tom Campbell",
            "url": "/name/nm1737859/"
        }
    ],
    "datePublished": "2003-07-29",
    "description": "An American reality television show in which a gay man meets and chooses a mate from a group of 15 potential male suitors. The twist is that the \"leading man\" does not know the mix of suitors includes both gay and heterosexual men.",
    "genre": [
        "Game-Show",
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQyODE3OTI5M15BMl5BanBnXkFtZTcwMjAwODUyMQ@@._V1_.jpg",
    "keywords": "deception game show,gay,gay straight relations,dating,pretending to be gay",
    "name": "Boy Meets Boy",
    "original_info": {
        "id": "Boy Meets Boy: Season 1_2003",
        "name": "Boy Meets Boy: Season 1",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "emilie8605"
        },
        "dateCreated": "2004-01-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368474/"
        },
        "name": "great job with the reality!",
        "reviewBody": "I find that nowadays the bravo network are only getting hits with the homosexuals. they are wanted now for queer eye and this show, and the other shows are getting nothing, not even a decent hit. boy meets boy is like the bachelor, only the bachelor wants other bachelors. i found the man looking for love to be rather attractive, and doubted him to be homosexual. bringing on the emotional best friend was a huge mistake for james, since she only cried and whined about all the men trying to compete for his love. but, of course, reality tv had to throw in a curveball, and had some straight men posing to be gay, and some gay men also on really trying to date james. i found that to be hurtful, since he could be falling for a straight man and get his heart broken. that is where they should have drawn the line, but that probably boosted everyone's attention, since the first 2 episodes, they all start to get to know each other and that can be pretty boring when the title guy is a shy one. one word of advice, james, dont go on a tv show when you are shy at the dating game. the show was a great view, after you know all the contestants and the main man, and i hope they will do another one, using a new, attractive man and have a star cast competing for his love. (B B-)"
    },
    "url": "/title/tt0368474/"
}