{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jonathan Pryce",
            "url": "/name/nm0000596/"
        },
        {
            "@type": "Person",
            "name": "Kim Greist",
            "url": "/name/nm0002114/"
        },
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 204113,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066289/"
        },
        {
            "@type": "Person",
            "name": "Terry Gilliam",
            "url": "/name/nm0000416/"
        },
        {
            "@type": "Person",
            "name": "Tom Stoppard",
            "url": "/name/nm0001779/"
        },
        {
            "@type": "Person",
            "name": "Charles McKeown",
            "url": "/name/nm0571650/"
        }
    ],
    "datePublished": "1985-12-18",
    "description": "A bureaucrat in a dystopic society becomes an enemy of the state as he pursues the woman of his dreams.",
    "director": [
        {
            "@type": "Person",
            "name": "Terry Gilliam",
            "url": "/name/nm0000416/"
        }
    ],
    "duration": "PT2H12M",
    "genre": [
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDM0YTM3Y2UtNzY5MC00OTc4LThhZTYtMmM0ZGZjMmU1ZjdmXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "bureaucracy,wrongful arrest,dystopia,dream,clerical error",
    "name": "Brazil",
    "original_info": {
        "id": "Brazil_1985",
        "name": "Brazil",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MrsRainbow"
        },
        "dateCreated": "1999-03-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0088846/"
        },
        "name": "\"Consumers for Christ\"",
        "reviewBody": "Regarding the symbolism in Brazil, of course that's the point. Lowry's dreams are not all that unique. They are a result of the regimented world he lives in. Look at all of our modern films: the two dominant characters are the rebel and the ordinary joe living a mundane life who somehow escapes from it or begins to do outrageous things.\n\n(That's why I hated Titanic, well, partially. Rose is breaking out of her supposedly constricted life. It's propaganda. It makes it appear that the \"freedoms\" we have now are exactly what we need in order to escape from the restriction of prejudices and ignorance. Rose tied herself into the ever-growing strait-jacket of modern political myths. But in order to glorify those myths Cameron had to denigrate our past and all that it stood for, making its adherents look like chauvinistic fools. The person I know who liked Titanic the most liked it for that reason - she wanted to escape from her own life and envied Rose. But such people always stop there. They live in their fantasies and never stop to investigate why they feel their lives must be escaped from.)\n\nAnother note about the samurai he fights is that it continued to suddenly disappear. Lowry initially didn't know what he was fighting, for one. There really is no definitive enemy to fight. We are boxing shadows. It is a system which has no heart or kill point. That's part of the frustration, particularly for those who can't think abstractly. Most of them lash out at \"the media.\" They can't locate who they're fighting, and so they accept the lies.\n\nListen to the opening interview on the television. The terrorists are refusing to \"play the game.\" The assumption is that they are simply jealous because someone else is \"winning the game.\" Why play at all? Any hope of that is over though. The 60s was the last gasp of opposition and it got swallowed up. Now the nostalgia for protest is a marketing tool. Consumption is a replacement for thought. When you feel angst you go shopping. We've been convinced that our anxiety is caused by something other than what it really is. Commercials are not about self-gratification, but self-doubt.\n\nI read an interview with Gilliam in which he said the reason he could no longer live in America is that there was an unwillingness to think about anything. In the end, you are fighting the conditioning you have received from your entire culture, in essence, fighting yourself and struggling to regain control of your own mind. Parallels between Lowry seeing his own face and Skywalker seeing the same in Return of the Jedi are illuminating.\n\nThe point that Gilliam makes in the end is that the enemy is ubiquitous yet intangible. Lowry wanted to run from it, go \"far away,\" never realizing that you can't escape. We still think in terms of a locus of power. But Gilliam, throughout the last part of the film, continually crushed our naive hopes that somehow we can act out the fantasy that many of us may have, to get away, find the girl of our dreams and live in a trailer in a beautiful setting.\n\nBecause we have no fear of physical control, we assume that we are free. Some Americans still believe in the myth of rugged individualism. The system is built on lies and that's what Gilliam was showing. It's a \"State of mind.\" You can't escape. The only place that you can be free is in your head. \"He got away from us,\" as they say at the end. That's really the only hope we have left.\n\nOn a lighter note, I derive so much glee from watching Lowry's mother walk around with a boot on her head."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three Reasons Criterion Trailer for Brazil",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1783866905",
        "name": "Brazil: The Criterion Collection",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTMxNTlmY2MtZWU0NS00ZmZhLWE0NjctNjU4MjU1OGY3ZThhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTMxNTlmY2MtZWU0NS00ZmZhLWE0NjctNjU4MjU1OGY3ZThhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-06-07T04:05:59Z",
        "url": "https://www.imdb.com/video/vi1783866905/"
    },
    "url": "/title/tt0088846/"
}