{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Audrey Hepburn",
            "url": "/name/nm0000030/"
        },
        {
            "@type": "Person",
            "name": "George Peppard",
            "url": "/name/nm0000577/"
        },
        {
            "@type": "Person",
            "name": "Patricia Neal",
            "url": "/name/nm0623658/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 184425,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074967/"
        },
        {
            "@type": "Person",
            "name": "Truman Capote",
            "url": "/name/nm0001986/"
        },
        {
            "@type": "Person",
            "name": "George Axelrod",
            "url": "/name/nm0043480/"
        }
    ],
    "datePublished": "1961-10-06",
    "description": "A young New York socialite becomes interested in a young man who has moved into her apartment building, but her past threatens to get in the way.",
    "director": [
        {
            "@type": "Person",
            "name": "Blake Edwards",
            "url": "/name/nm0001175/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGEwMTRmZTQtMDY4Ni00MTliLTk5ZmMtOWMxYWMyMTllMDg0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "urban setting,writer,manhattan new york city,female protagonist,typewriter ribbon",
    "name": "Breakfast at Tiffany's",
    "original_info": {
        "id": "Breakfast at Tiffany's_1961",
        "name": "Breakfast at Tiffany's",
        "year": "1961"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Poseidon-3"
        },
        "dateCreated": "2004-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054698/"
        },
        "name": "Fluffy, if a bit empty, but delicious breakfast.",
        "reviewBody": "An army of fans consider this Hepburn's signature role and in many ways it is, even if she overcame miscasting to portray it. Based on a rather biting novella by Truman Capote, he (somewhat surprisingly) wanted Marilyn Monroe to play the role. The casting of Hepburn couldn't be more different, yet she made it her own and in the process created an icon that is every bit as lasting as Marilyn's skirt-over-the-subway-grate or Bette Davis's off-the-shoulder, chain-smoking Margo Channing. She plays an offbeat, effortlessly sophisticated party girl in New York City who subsists on the favors of various rich men. Though her livelihood couldn't be more tasteless, somehow Hepburn's presence adds a sheen of innocence and sweetness to it. When blocked writer Peppard moves in upstairs (\"kept\" by married socialite Neal), the two find themselves developing a friendship which eventually begins to turn into love. But since they are both people who use their bodies to earn their keep and are heavily dependent on others, the chances of their relationship lasting are slim at best. To read the above synopsis, one would expect a gritty, vulgar film. However, in director Blake Edwards' hands and with Hepburn floating around in exquisite Givenchy gowns, the movie is a candy box of color, style, humor and romance.\n\nEven when she's hungover or just getting home from an all-nighter (as in the famous opening scene), Hepburn strikes a graceful and glamorous figure. In fact, it's when she's trying to act disoriented or disheveled that her performance is at it's weakest. It's as if she was so inherently stylish that she had to try (too) hard to present anything else! She does a very fine job with the role, even if the character's past is nothing short of preposterous. Peppard comes off as blandly attractive, but wooden. His arrogance regarding his role (fiercely protecting the traditional leading man image) not only undercut his own performance, but also slighted that of Neal's who was diminished as a result. However, sentimental filmgoers probably prefer his more heroic approach and Neal would certainly recoup her losses, earning an Oscar a short time later for \"Hud\". The most controversial aspect of the film is Rooney's portrayal of an Asian man who lives above Hepburn and who is awakened at all hours by her lifestyle. Whether or not one is offended by the over-the-top stereotype of the buck teeth and slant eyes, the role is not funny anyway! It's all way too forced and obvious, with his pratfalls in sight long before they occur. (A lamp exists RIGHT over his bed for the express purpose of giving him something to hit his head on continuously. Move it, already!) There are many memorable moments in the film including a sequence of Hepburn and Peppard doing things they've never done before, Hepburn sitting on the fire escape plaintively singing the Oscar-winning song \"Moon River\" (which is used throughout the film by master composer Henry Mancini) and wacky party scene (a prelude to Edwards' \"The Party\"?) in which all sorts of outre things take place including the cry \"Timber!\" when a tipsy guest begins to collapse. There's a surprising frankness, for the time, regarding Peppard and Neal's relationship. It seems to be one of the earliest Hollywood films in which the leading man is implied to be nude under the covers in his bed. The film is not without its flaws. Some of the dialogue is annoyingly indulgent and the storyline is fairly patchy (with a tacked on ending.) Still, with the sparkling presence of Hepburn (in some mind-blowing hats and costumes) and the slick work of Edwards, it is easy entertainment."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Watch the original trailer for Breakfast at Tiffany's, starring Audrey Hepburn and George Peppard. ",
        "duration": "PT2M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi786734361",
        "name": "Breakfast at Tiffany's: Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzc2NzY0NTQ3N15BMl5BanBnXkFtZTcwODE0NzM4NA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzc2NzY0NTQ3N15BMl5BanBnXkFtZTcwODE0NzM4NA@@._V1_.jpg",
        "uploadDate": "2011-03-31T13:02:14Z",
        "url": "https://www.imdb.com/video/vi786734361/"
    },
    "url": "/title/tt0054698/"
}