{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Gere",
            "url": "/name/nm0000152/"
        },
        {
            "@type": "Person",
            "name": "Valérie Kaprisky",
            "url": "/name/nm0438585/"
        },
        {
            "@type": "Person",
            "name": "Art Metrano",
            "url": "/name/nm0582586/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9786,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042218/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0779514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073543/"
        },
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        },
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        },
        {
            "@type": "Person",
            "name": "L.M. Kit Carson",
            "url": "/name/nm0141281/"
        }
    ],
    "datePublished": "1983-05-13",
    "description": "When Jesse Lujack steals a car in Las Vegas and drives down to LA, his criminal ways only escalate - but when will it end?",
    "director": [
        {
            "@type": "Person",
            "name": "Jim McBride",
            "url": "/name/nm0564319/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Action",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODE0MDE2MTg2M15BMl5BanBnXkFtZTcwNjE2NjgyNA@@._V1_.jpg",
    "keywords": "comic book,remake of french film,neo noir,one word title,anti hero",
    "name": "Breathless",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BlackJack_B"
        },
        "dateCreated": "2005-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085276/"
        },
        "name": "Lurid fun and has aged well.",
        "reviewBody": "Back in 1983, the remake of Jean-Luc Godard's \"A Bout de Soufflé\" was savagely attacked by critics. It was understandable at the time. Today, I'll bet many of the critics probably feel the film is much better compared to today's bottom feeder cinema (many of which top the box office).\n\nRichard Gere's Jesse LuJack does the rare feat of being both repulsive and likable. Early in the film, you despise the reckless, cocky, S.O.B. of a criminal that he is but as the film wears on you suddenly find his character extremely appealing. Once you warm up with him, you realize how much fun Gere is having playing LuJack. His traipsing in L.A. becomes very entertaining in a video game sort of way. Singing to Elvis and Jerry Lee Lewis, disrupting his girlfriend's exam, and his role as The Fugitive makes the film so compelling and fun to watch. He embodies coolness while being hip; which can be hard to do.\n\nAs for Valerie Kapinsky, I have seen some of her soft-core films from Europe and she is tremendously sexy. She has sex appeal and looks delicious in virtually every scene. Her acting here gave her an undeserved rap. She's supposed to be playing a French exchange student. I think she did the best job possible by playing herself. I would take Kaprinsky over some American actress faking a French accent. There could have been other French actresses out there that could have taken the part but she fit in perfectly for the role IMO. She probably didn't object to the nudity required.\n\nThe film also delivers some steamy situations. Making love in front of a huge screen showing an old movie (I think Judy Garland was in it) while being on the lam in L.A. just sounds so dreamy. Makes me want to do the same with my girl; only I won't have an arrest warrant on my head LOL! \n\nSo yes, the movie isn't a classic and it isn't Casablanca but the film is much, much better than the turkey it received in 1983. It's definitely worth seeing.\n\nInterestingly enough, Jim McBride would later direct a biopic of Jerry Lee Lewis in 1988 called \"Great Balls Of Fire\" so his interest in late 50's rockabilly was apparent here regarding the great soundtrack.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0085276/"
}