{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Holden",
            "url": "/name/nm0000034/"
        },
        {
            "@type": "Person",
            "name": "Kay Lenz",
            "url": "/name/nm0001464/"
        },
        {
            "@type": "Person",
            "name": "Roger C. Carmel",
            "url": "/name/nm0138354/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5419,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0102264/"
        },
        {
            "@type": "Person",
            "name": "Jo Heims",
            "url": "/name/nm0374268/"
        }
    ],
    "datePublished": "1974-02-22",
    "description": "A young girl tries to find her way in life, suffering from her own naivete and sincerity.",
    "director": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzE2ZDIxNGYtM2MxMS00ZDEzLWE2ZjktNDdiOTE1NmUwNzNiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "flirting,character name as title,female hitchhiker,age gap,lincoln continental",
    "name": "Breezy",
    "original_info": {
        "id": "Breezy_1973",
        "name": "Breezy",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2011-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069822/"
        },
        "name": "Soured on the Female of the Species, until...........",
        "reviewBody": "When William Holden took the part of Frank Harmon in Breezy it was a dress rehearsal for the same kind of role in Network where he was the older man who had fallen out of love with his wife and looking for something new and different. Of course his taste in women is a whole lot different. In Network Holden falls for the chic Network news executive Faye Dunaway and in Breezy he's entranced by the free spirited young hippie chick in the title role which Kay Lenz got her breakout role. These two women are about as different as they come.\n\nOne thing that the story and director Clint Eastwood failed to do is give us all that much information about Breezy and how her character developed as it did. She's a type that was quite common in 1973 and it's assumed by the audience that the Vietnam War and the counterculture of free love makes her typical of young people. So when she drops into Holden's life by kind of forcing him to give her a lift in his car after a night of sex with Dennis Olivieri who picked her up.\n\nHolden's gone through a bitter and nasty divorce and we also are not quite sure about the whys and wherefores there. But Eastwood kind of takes care of it from his end when Holden and Lenz at a fancy restaurant encounter his ex-wife Joan Hotchkiss who's there with a date. Her one scene with Holden and Lenz is Breezy's most unforgettable point. This is one bitter and drunken women and while we don't really know what went wrong, it's clear why Holden wanted out of the marriage and why he's soured on the female of the species. \n\nThere was a 33 year age difference between Holden and Lenz and most wouldn't give odds for this lasting, but you never know.\n\nBoth Holden and Lenz give a good account of themselves making up for some plot deficiencies in Breezy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A carefree young hippie, Edith Alice \"Breezy\" Breezerman, meets Frank Harmon, a divorced, middle-aged real estate agent. They fall in love, and each teaches the other a little about life.",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3650011929",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTI4ZjU0MTgtNjUxZS00YTlmLTg0MDMtZjdmZjhkODhmZjdjXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTI4ZjU0MTgtNjUxZS00YTlmLTg0MDMtZjdmZjhkODhmZjdjXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-28T00:41:18.919Z",
        "url": "https://www.imdb.com/video/vi3650011929/"
    },
    "url": "/title/tt0069822/"
}