{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brian Wilson",
            "url": "/name/nm0933092/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Foskett",
            "url": "/name/nm3620677/"
        },
        {
            "@type": "Person",
            "name": "Darian Sahanaja",
            "url": "/name/nm0756286/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 44,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0947007/"
        }
    ],
    "datePublished": "2005-05-24",
    "description": "Brian Wilson, a genius way ahead of his time musically, created The Beach Boys concept (UNRELEASED) album \"SMILE\" with musical themes never before created musically created in the late 60's over 10 months. This is the documentary ...",
    "director": [
        {
            "@type": "Person",
            "name": "John Anderson",
            "url": "/name/nm2001520/"
        }
    ],
    "duration": "PT51M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmU2Y2M5NTktNTg0MS00ZDk1LThlODUtZTJkN2E0NGNlN2I3XkEyXkFqcGdeQXVyMTY4MTg5MzA@._V1_.jpg",
    "name": "Brian Wilson Presents Smile",
    "original_info": {
        "id": "Brian Wilson Presents Smile_2004",
        "name": "Brian Wilson Presents Smile",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dan1863Sickles"
        },
        "dateCreated": "2012-10-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1607595/"
        },
        "name": "Skip This One -- Look For \"I Just Wasn't Made For These Times\" Instead",
        "reviewBody": "As Brian Wilson documentaries go, this one is nothing special. It only covers the Good Vibrations/Smile period, when the Beach Boys songwriting genius was working on a psychedelic concept album which he later destroyed. Rock and roll fans know the legend -- this album would have been greater than SGT. PEPPER, but the music was so powerful and unorthodox that writing it made Brian lose his mind. And then he destroyed all the tapes. But now he's back playing what he can remember, forty years after the fact. And his brain is still not quite right. But he's a great guy! \n\nProblem is, this \"documentary\" consists exclusively of interviews from the \"usual suspects.\" Van Dyke Parks, David Anderle, et. al. These guys have been dining out for over forty years on the great music they didn't quite write with Brian Wilson! So all they talk about is how Brian was a genius, it was a great project, it would have been a masterpiece, and so on. Like they're going to say anything else! \n\nWhat you don't get here -- but you do get in IJWMFTT -- is a balanced picture of Brian's slow self-destruction. His first wife Marilyn and his original Beach Boys songwriting partner Mike Love have a lot to say about the \"creative\" users and pushers who got Brian heavily into LSD in the name of \"opening his mind.\" Not mentioning any names, but these are the bright lights behind the SMILE project. And I'm not sure the music was worth the collateral damage inside Brian's brain.\n\nIt's ironic that the bells and whistles of the psychedelic era have dated,while the pure harmonies of the earlier period are still fresh. So again, if you're looking for a definitive documentary on Brian Wilson, look for I JUST WASN'T MADE FOR THESE TIMES.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt1607595/"
}