{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeremy Irons",
            "url": "/name/nm0000460/"
        },
        {
            "@type": "Person",
            "name": "Diana Quick",
            "url": "/name/nm0703438/"
        },
        {
            "@type": "Person",
            "name": "Roger Milner",
            "url": "/name/nm0590411/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7603,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103289/"
        }
    ],
    "datePublished": "1982-01-18",
    "description": "The life, friendships and romances of the protagonist Charles Ryder-including his friendship with the Flytes, a family of wealthy English Catholics who live in a palatial mansion called Brideshead Castle.",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDUxNGZkNTctODE5MC00Njc1LWJhZDUtODc0NzliYzMyMzM1XkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "homosexual subtext,atheist,catholicism,alcoholism,religion",
    "name": "Brideshead Revisited",
    "original_info": {
        "id": "Brideshead Revisited_1981",
        "name": "Brideshead Revisited",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gftbiloxi"
        },
        "dateCreated": "2005-05-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083390/"
        },
        "name": "Perhaps the Finest Miniseries Ever Made",
        "reviewBody": "Brilliantly adapted by John Mortimer from Evelyn Waugh's celebrated novel of England between the first and second World Wars, BRIDESHEAD REVISITED may be the best miniseries ever made. Smoothly and subtly directed by Charles Sturridge and Michael Lindsay-Hogg, the twelve hour program is beautiful to look at, the cast is remarkable, and the story has amazing impact.\n\nThe miniseries follows the novel closely, beginning near the end of World War II as Charles Ryder (Jeremy Irons) grows disdainful of military life, which he finds a study in futility--and then flashes back twenty years as Ryder recalls his relationship with the aristocratic Marchmain family, a relationship that begins when he becomes friendly with Marchmain son Sebastian Flyte (Anthony Andrews) while the two are students at Oxford.\n\nThe miniseries captures perfectly a golden moment of youth--and then the gradual disillusionment brought by the passage of time. Like all great works, BRIDESHEAD REVISITED--both book and film--touches on a great many themes, most specifically an innocent type of homoeroticism, loss of innocence, alcoholism, adultery, and changing society; ultimately, however, the story is about spiritual values and how they survive in even the most unlikely of circumstances--and how God works through individuals in the most unexpected ways.\n\nThe performances here are truly fine beyond description. Jeremy Irons has seldom surpassed his work here, and neither Anthony Andrews nor Dianna Quick (as Julia, Sebastian's sister) have ever bested their performances in this film. In addition to the three leads, the miniseries offers an incredible array of superior performances by John Gielgud, Claire Bloom, and Laurence Olivier; the cinematography and art design is flawless; and the score by Geoffrey Burgon is exquisite. Mortimer's script is remarkable in that it not only manages to recreate the novel, it also manages to capture the intangible, spiritual elements upon which the book plays but seldom directly references. A must-own work for any one who appreciates the best of the best; strongly, strongly recommended.\n\nGary F. Taylor, aka GFT, Amazon Reviewer",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Brideshead Revisited",
        "duration": "PT50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2192293145",
        "name": "Brideshead Revisited",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzc4NzMzNmQtZWI4Ny00NDI2LWI4MzMtYTkwOGExOGIyMzNjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzc4NzMzNmQtZWI4Ny00NDI2LWI4MzMtYTkwOGExOGIyMzNjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-16T19:39:07.662Z",
        "url": "https://www.imdb.com/video/vi2192293145/"
    },
    "url": "/title/tt0083390/"
}