{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sarah Wynter",
            "url": "/name/nm0944077/"
        },
        {
            "@type": "Person",
            "name": "Vincent Perez",
            "url": "/name/nm0001641/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Pryce",
            "url": "/name/nm0000596/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 672,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104047/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063447/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014422/"
        },
        {
            "@type": "Person",
            "name": "Marilyn Levy",
            "url": "/name/nm0506529/"
        }
    ],
    "datePublished": "2002-01-04",
    "description": "This movie is a biopic of Alma Mahler, the wife of composer Gustav Mahler (as well as Walter Gropius and Franz Werfel), and the mistress of Oskar Kokoschka.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Beresford",
            "url": "/name/nm0000915/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM2NjQ1NTkwMF5BMl5BanBnXkFtZTcwMTIzMjMyMQ@@._V1_.jpg",
    "keywords": "female full frontal nudity,mistress,spa,death,composer",
    "name": "Bride of the Wind",
    "original_info": {
        "id": "Bride of the Wind_2001",
        "name": "Bride of the Wind",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "coymoon"
        },
        "dateCreated": "2001-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0212827/"
        },
        "name": "So much potential but little radiance",
        "reviewBody": "Author Susanne Keegan devoted ten years of research in writing the biography of Alma Mahler called The Bride of the Wind. The biopic film of the same name, directed by Bruce Beresford and written by Marilyn Levy, never even comes close to capturing the real grandeur, brilliance and ambiguity of this femme fatale and gifted musician.\n\nAlma Schindler's life is highlighted during Vienna's golden age of artistic and musical achievement at the turn of the century. The first half of the film focuses primarily on her marriage to classical composer Gustav Mahler and her role as mother to daughters Maria and Anna. The film then moves on to the widowed Alma living in the shadow of Mahler as she develops relationships with architect Walter Gropius, expressionist painter Oskar Kokoschka and poet and novelist Franz Werfel. Attempting to be a sweeping historical and romantic drama, Bride of the Wind is thwarted ultimately by Ms. Levy's very superficial script. Her words fail to breathe any life into people and events. Most of the dialogue leans toward the absurd when you know that these artists were intellectuals with an abundance of creative talent.\n\nAs for the director, Bruce Beresford has done some fine work in previous films such as Tender Mercies and Driving Miss Daisy. Unfortunately, he manages to direct this entire film without any inspiration or passion, which the story cries out for.\n\nThe casting of Australian actress Sarah Wynter is a major flaw. Ms. Wynter fails to bring any spontaneity, sexuality or mystique to her character resulting in dreams of a Kate Winslet or Rachel Weisz giving us a much more vibrant Alma Mahler. As usual, Welch actor Jonathan Pryce gives a rich performance as Alma's self-absorbed husband, Gustav Mahler, with a striking resemblance to the real Gustav. A round of applause goes to Swiss actor Vincent Perez for evoking any emotional response to the film. Whether he's hot-tempered, passionate, pathetic or even tragic, he's absolutely captivating on screen.\n\nThere is, however, a sumptuous flavor to the film in its lush set designs, finely detailed drawing rooms, painting studios and the most gorgeous costumes. The soundtrack is spectacular with a seamless blend of music composed by both Gustav and Alma, as well as some original pieces by Stephen Endelman. Alas, so much potential but little radiance."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Classics",
        "duration": "PT2M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi482083097",
        "name": "Bride of the Wind",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDI4NjkzMDUtM2U4MC00NDk4LWJmMWUtZGEyODE2MWFmMmM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDI4NjkzMDUtM2U4MC00NDk4LWJmMWUtZGEyODE2MWFmMmM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:49:04Z",
        "url": "https://www.imdb.com/video/vi482083097/"
    },
    "url": "/title/tt0212827/"
}