{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tyrone Power",
            "url": "/name/nm0000061/"
        },
        {
            "@type": "Person",
            "name": "Linda Darnell",
            "url": "/name/nm0001105/"
        },
        {
            "@type": "Person",
            "name": "Dean Jagger",
            "url": "/name/nm0415591/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1095,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Louis Bromfield",
            "url": "/name/nm0111313/"
        },
        {
            "@type": "Person",
            "name": "Lamar Trotti",
            "url": "/name/nm0873707/"
        }
    ],
    "datePublished": "1940-09-27",
    "description": "In 1844, after the assassination of Mormon leader Joseph Smith by an angry mob in Illinois, the Mormons choose Brigham Young as their new leader and follow him to a new promised land in Utah.",
    "director": [
        {
            "@type": "Person",
            "name": "Henry Hathaway",
            "url": "/name/nm0368871/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Adventure",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2M0NmE3ZDYtNDBhNS00MjVmLWFiMzEtOWY4YzFkYzQ3ZWU2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "brigham young character,character name as title,two word title,psychotronic film,1840s",
    "name": "Brigham Young",
    "original_info": {
        "id": "Brigham Young_1940",
        "name": "Brigham Young",
        "year": "1940"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "alanjj-3"
        },
        "dateCreated": "2000-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0032281/"
        },
        "name": "Mormons: what do you think? I liked this picture.",
        "reviewBody": "I rented this film because of my interest in American history, and especially the somewhat weird story of the Mormons. This movie attempts to make some sense out of how Joseph Smith could turn his \"vision\" into a major world religion. It first focuses on the troubles the Mormons had in their settlement at Navuoo, Illinois. It portrays the trial of Joseph Smith. Within the course of that trial, Brigham Young stands up to tell of his conversion to Mormonism, and of his belief in the spiritual message of Smith. Then Smith is assassinated, and Young must deal with his own doubts about whether he has been chosen to lead the Mormons to a new land. Despite his grave doubts, he perseveres, and finally has a vision (that Utah is the place for his colony) that gives him confidence in the rightness of his leadership. Later, as crops are destroyed by crickets, he again doubts that he has truly been chosen--however, a miracle occurs, which cements his place in history.\n\nI found the performances to be moving, and the story to be convincing and interesting. I would love to know whether Mormons believe that this is an accurate portrayal. Polygamy is a part of the story, but the reasons why this is central to LDS are not raised. The issue is not emphasized.\n\nI'm sure people stay away from this movie because of its religious subject-matter, but it has a great cast and will hold your interest throughout.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0032281/"
}