{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Katharine Hepburn",
            "url": "/name/nm0000031/"
        },
        {
            "@type": "Person",
            "name": "Cary Grant",
            "url": "/name/nm0000026/"
        },
        {
            "@type": "Person",
            "name": "Charles Ruggles",
            "url": "/name/nm0749476/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 63216,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041421/"
        },
        {
            "@type": "Person",
            "name": "Dudley Nichols",
            "url": "/name/nm0629580/"
        },
        {
            "@type": "Person",
            "name": "Hagar Wilde",
            "url": "/name/nm0928444/"
        }
    ],
    "datePublished": "1938-02-18",
    "description": "While trying to secure a $1 million donation for his museum, a befuddled paleontologist is pursued by a flighty and often irritating heiress and her pet leopard, Baby.",
    "director": [
        {
            "@type": "Person",
            "name": "Howard Hawks",
            "url": "/name/nm0001328/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmVkOTRiYmItZjE4NS00MWNjLWE0ZmMtYzg5YzFjMjMyY2RkXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "leopard,museum,bone,psychiatrist,mistaken identity",
    "name": "Bringing Up Baby",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2005-12-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0029947/"
        },
        "name": "Baby, Oh Where Can You Be?",
        "reviewBody": "Casting Katharine Hepburn in the role she plays her would have been unthinkable years later when her image as a feminist icon was cast in bronze. But she's doing some serious poaching on a young version of the kind of roles Mary Boland or Billie Burke would play. Think of the parts these two women played and you can definitely see Hepburn in Bringing Up Baby if you imagine Boland and Burke years younger.\n\nBringing Up Baby is one of those beautiful films that really doesn't have a plot. Try to tell someone verbally the plot of this, it cannot be done. From the moment airheaded Kate gets into uptight Cary's car in that parking lot with him chasing her, it's just one madcap situation after another. Howard Hawks directs this film with the appropriate light touch the material requires.\n\nCary Grant is not the usual suave sophisticate you normally find him cast as either. He's an uptight paleontologist who's biggest thrill up to that point is the arrival of a brontosaurus vertebrae so that he can complete a skeleton. He's also getting married, but the woman he's engaged gives him hints that married life will not be any bed of roses for him. Whether he knows it or not he's ready for the romp Kate has in store for him.\n\nThirties audiences definitely loved seeing the rich at play. Bringing Up Baby is the definition of escapist entertainment. But one who hasn't the means shouldn't indulge it what Hepburn is doing. They've got a padded cell waiting for anyone who's not rich who indulges in this kind of behavior. Only the rich can afford to be eccentric.\n\nBaby by the way is a tame leopard who Kate's brother sends up from South America. That would be a jaguar by the way, but that's just mere details. Anyway Baby escapes at the same time another leopard from the circus escapes and he's dangerous. I won't go into the confusion there, I couldn't describe it in any event.\n\nMay Robson and Charlie Ruggles lend good support. Ruggles who was normally cast against Mary Boland teams up well with May Robson. And my favorite in the supporting cast is Walter Catlett as the small town constable who doesn't know quite what he has on his hands, but is determined to bluff the situation through.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1018954009",
        "name": "Bringing Up Baby",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDE4YmEyYTQtMGUwMC00MTU0LWI0MDgtNWZmOGJmYTRmNmJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDE4YmEyYTQtMGUwMC00MTU0LWI0MDgtNWZmOGJmYTRmNmJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:52:14Z",
        "url": "https://www.imdb.com/video/vi1018954009/"
    },
    "url": "/title/tt0029947/"
}