{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Warren Oates",
            "url": "/name/nm0643105/"
        },
        {
            "@type": "Person",
            "name": "Isela Vega",
            "url": "/name/nm0891835/"
        },
        {
            "@type": "Person",
            "name": "Robert Webber",
            "url": "/name/nm0916434/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20589,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009840/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091365/"
        },
        {
            "@type": "Person",
            "name": "Gordon T. Dawson",
            "url": "/name/nm0206137/"
        },
        {
            "@type": "Person",
            "name": "Sam Peckinpah",
            "url": "/name/nm0001603/"
        },
        {
            "@type": "Person",
            "name": "Frank Kowalski",
            "url": "/name/nm0468614/"
        }
    ],
    "datePublished": "1974-08-07",
    "description": "An American barroom pianist and his prostitute girlfriend go on a trip through the Mexican underworld to collect the bounty on the head of a dead gigolo.",
    "director": [
        {
            "@type": "Person",
            "name": "Sam Peckinpah",
            "url": "/name/nm0001603/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzExNTI5YzgtZDAzYi00Y2UxLTkzYWYtNWM5MDRiODlhMTM0XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "bounty hunter,anti hero,neo western,one man army,grave",
    "name": "Bring Me the Head of Alfredo Garcia",
    "original_info": {
        "id": "Bring Me the Head of Alfredo Garcia_1974",
        "name": "Bring Me the Head of Alfredo Garcia",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "norm1972_8"
        },
        "dateCreated": "2005-01-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071249/"
        },
        "name": "Peckinpah has come full circle",
        "reviewBody": "First, I'm sure everyone commenting on this film has seen the documentary on Peckinpah, and the comments made by the film critics regarding this film. If I may quote one of the critics, and I'm sure you all agree \"It's the one film of Peckinpah's that everyone tries to imitate\". Even Tarantino does to some degree. I have issues with Quentin Tarantino from a cinematic and artistic point of view, but that is another review. Warren Oates' performance was flawless, as he actually assumes the identity Of Sam Peckinpah as a gesture of appreciation for gracing him with his first starring vehicle.\n\nWarren Oates was taking Sam's journey for him, as Sam looked from behind the lens. This movie was Peckinpah at his best and his worst at the same time. The old Peckinpah themes are there; Mexico is the final frontier, where one can continue to be what he once was in a changing world, but eventually Mexico begins to change as well. As I said in my review of \"Junior Bonner\" (be sure to check it out, and get back to me)progress is the main antagonist in the lives of Peckinpah's characters.\n\nJunior Bonner and Bennie (Oates' Character) have a common foe, the twentieth century, which is why we find Bennie in Mexico. The chance to improve his situation, and establish a solid relationship with his hooker girlfriend (played with tough sincerity by Isela Vega) arrives at a time in Bennie's life when he least expects it, but it's not as easy as it is set out to be. All he has to do is bring this head to \"El Hefe\", and at the last minute BAM!! Bennie grows a conscience. Along the way he loses his woman, and then just goes nuts, thus revealing \"The Diseased Soul of Sam Peckinpah\".\n\nMy favorite scene is actually the picnic, where Elita and Bennie discuss their future. Elita begs Bennie to ask her to marry her, he does and she begins to weep. The simple fact that he says it is a tender moment, and shows how the slightest thing can arouse a woman's emotions. Jerry Fielding's musical score, which successfully created the mood and atmosphere for \"Straw Dogs\" (my all time favorite Peckinpah film) is present, but very muted. Still, this may be the best scene of the film.\n\nSam Peckinpah finally had complete control to dictate the direction of this film; Free from the money men, and left to his own devices in Mexico where he felt at home. A lot of people say that Pat Garret and Billy the Kid was the last Peckinpah masterpiece, but I think Alfredo Garcia was the last one. It throws you off at the beginning with the horses, then all of a sudden a Corvette screeches by; This is the paradox that really signifies that \"The West\" is over, bringing Sam Peckinpah and his love for the west full circle.\n\nThe critics literally hated this film, but 30 years later because of it we have a Martin Scorcese, a Robert Rodriguez, and a Quentin Tarantino (yeah) to name a few, as well as achieving underground cult status. I'm proud to call \"Bring Me the Head of Alfredo Garcia\" one of my favorite films."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An American barroom pianist and his prostitute girlfriend go on a trip through the Mexican underworld to collect the bounty on the head of a dead gigolo.",
        "duration": "PT1M59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi905954073",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTcyYjljNjEtZGE4Zi00MTMwLTljZDctOGRlNWFiMjgzOGExXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTcyYjljNjEtZGE4Zi00MTMwLTljZDctOGRlNWFiMjgzOGExXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-10T15:32:40.998Z",
        "url": "https://www.imdb.com/video/vi905954073/"
    },
    "url": "/title/tt0071249/"
}