{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve Martin",
            "url": "/name/nm0000188/"
        },
        {
            "@type": "Person",
            "name": "Queen Latifah",
            "url": "/name/nm0001451/"
        },
        {
            "@type": "Person",
            "name": "Eugene Levy",
            "url": "/name/nm0506405/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 38111,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0278170/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064942/"
        },
        {
            "@type": "Person",
            "name": "Jason Filardi",
            "url": "/name/nm0276821/"
        }
    ],
    "datePublished": "2003-03-07",
    "description": "When a lonely guy meets a woman on the internet who happens to be in prison, she breaks out to get him to prove her innocence, and proceeds to wreak havoc on his middle-class life.",
    "director": [
        {
            "@type": "Person",
            "name": "Adam Shankman",
            "url": "/name/nm0788202/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTUyMTM2MjMwOF5BMl5BanBnXkFtZTYwOTA0Mzk2._V1_.jpg",
    "keywords": "william shakespeare character,lawyer,divorce,villain arrested,spanking",
    "name": "Bringing Down the House",
    "original_info": {
        "id": "Bringing Down the House_2003",
        "name": "Bringing Down the House",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2003-05-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0305669/"
        },
        "name": "the stars steal the show",
        "reviewBody": "`Bringing Down the House' is the latest variation on that old comic chestnut in which a wisecracking, free-spirit type from `the lower social orders' invades the life of an uptight stuffed-shirt type - not only getting him to loosen up that collar and shed his inhibitions but also showing him a thing or two about what really matters in life. This is, basically, a primer for a Culture Clash Comedy 101 course, with a couple of veteran comic professors on hand to teach us all how it's done.\n\nIn this case, Steve Martin plays the uptight lawyer who is so obsessed with his career that he has already lost his wife over the issue and appears on the road to alienating his children as well. When Peter meets what he believes is a potential love interest in an internet chat room, he figures his life just might be turning around for the better. Peter is all set for a romantic evening  champagne, dim lights, `A Man and a Woman' playing softly in the background  when, at his door, who should appear but that Big Bad Mama, Queen Latifah, as Charlene Morton, an ex-convict who wants Peter to help her expunge from her record the crime she swears she did not commit. Peter is at first reluctant to accept this strange woman into his house and life, but Charlene is nothing if not persistent and she manages to horn her way in anyway.\n\nThe Jason Filardi screenplay pretty much plays it all by rote. We know, despite their tremendous differences in culture, background and personality, that these two comic titans will end up as great pals by the story's end. Nothing about `Bringing Down the House' surprises us, yet there is a certain amount of comfort to be derived from familiarity and predictability. It's an old formula but one that works fairly well here, thanks, primarily, to the assured, high-energy performances of Martin and Latifah in the starring roles. These two comic masters achieve a real chemistry working together, enough to compensate for the broad stereotyping that permeates the film. Filardi does achieve some moments of genuine hilarity by mixing slapstick and social satire in roughly equal measure. The satire isn't on a very high level of sophistication but it is good enough for a mass audience venture such as this one.\n\nDirector Adam Shankman is also blessed with a strong supporting cast that includes Eugene Levy as a nerdish - but `freaky' - business associate obsessed with wild black women like Charlene; Joan Plowright as a snooty, eccentric matron whose account Peter is determined to win for his firm; and Bette White as Peter's bigoted next door neighbor who is eyeing askance all the strange goings-on at the lawyer's house.\n\n`Bringing Down the House' is at its best when it simply lets itself go, forgets about the plot, and allows its performers to dazzle us with their sheer likeability, i.e., Martin and Latifah dancing up a storm at an L.A. bistro, Martin breaking out into a spontaneous break dance routine while infiltrating an all-black nightclub. It is at its worst in the final scenes when the heavy-handed plot mechanics threaten to torpedo the whole project. Luckily, we have Martin and Latifah to help keep the thing afloat. The vehicle itself may creak at times, but the stars never do."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Touchstone Pictures",
        "duration": "PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi985399577",
        "name": "Bringing Down the House",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmM3NGZjNzMtYWMzNS00MTkwLWJiMjEtMjhhNGEzODhjOTU1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmM3NGZjNzMtYWMzNS00MTkwLWJiMjEtMjhhNGEzODhjOTU1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:52:09Z",
        "url": "https://www.imdb.com/video/vi985399577/"
    },
    "url": "/title/tt0305669/"
}