{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Julie Andrews",
            "url": "/name/nm0000267/"
        },
        {
            "@type": "Person",
            "name": "Vivian Blaine",
            "url": "/name/nm0086176/"
        },
        {
            "@type": "Person",
            "name": "Yul Brynner",
            "url": "/name/nm0000989/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 117,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066897/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Person",
            "name": "Steven B. Hecht",
            "url": "/name/nm0372977/"
        },
        {
            "@type": "Person",
            "name": "Hildy Parks",
            "url": "/name/nm0662955/"
        }
    ],
    "datePublished": "2003-08-10",
    "description": "The golden age of the annual Tony Awards ceremony lasted from 1967 to 1986 -- the period during which Alexander H. Cohen and his wife, Hildy Parks, were the producers of the show. This film offers a compilation of performances fro...",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Cohen",
            "url": "/name/nm0169280/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0NjIwNzkwN15BMl5BanBnXkFtZTcwMjUyNzIzMQ@@._V1_.jpg",
    "name": "Broadway's Lost Treasures",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jdeitz"
        },
        "dateCreated": "2006-10-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0376525/"
        },
        "name": "Great little time capsules from the Tony Awards",
        "reviewBody": "I'm sure the other reviewer did not realize that these performance capsules were done as musical numbers during the Antoinette Perry Awards in the USA(The Tony Awards). Many of these were originally on ABC for the 25th Anniversary of the Tony Awards in 1971. I was in the audience, and it was a very special night. They gathered as many of the Best Musical winners from the beginning thru 1970, with the original casts, or at least the principle stars. So these are celebrations of the Silver Anniversary of the Tonys, not done just for television's sake to capture a performance. The staging might seem shoddy, but these were done during an awards show, and that explains the limited staging and props. Since many are from the 1971 show, they only had a glittering curtain and slide out platform sets...would like to know if Robert Morse is going to be in a future one, as I remember he almost went flying when his meager set slid out, only to save himself when he hooked his arm through the phony, mirror-less mirror to sing \"I Believe in You\" from How to Succeed in Business Without Really Trying.\n\nSo don't think of think of these performances as strictly for archives...all were moments of Tony Award history, and thank God for that. Some of these are the only glimpse we have of what it was like to see the original stars perform their original Broadway performances. I never thought I'd see them again...since I was there in 1971, and it was before VCR's, it's delightful to see how it looked on the TV screen, compared to being there in person. In person was indeed a little more special, but this comes close!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H50M",
    "url": "/title/tt0376525/"
}