{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Julie Andrews",
            "url": "/name/nm0000267/"
        },
        {
            "@type": "Person",
            "name": "Stephen Sondheim",
            "url": "/name/nm0814227/"
        },
        {
            "@type": "Person",
            "name": "John Lahr",
            "url": "/name/nm0481620/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 376,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0157894/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052417/"
        }
    ],
    "datePublished": "2004-10-19",
    "description": "A six-part documentary about the Broadway musical",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDgxNDE1OTA4MV5BMl5BanBnXkFtZTcwNTkwMjcyMQ@@._V1_.jpg",
    "keywords": "tv mini series,colon in title,four word title,new york city,manhattan new york city",
    "name": "Broadway: The American Musical",
    "original_info": {
        "id": "Broadway: The American Musical_2004",
        "name": "Broadway: The American Musical",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "F Gwynplaine MacIntyre"
        },
        "dateCreated": "2004-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0423623/"
        },
        "name": "A show-stopper! Bravo!",
        "reviewBody": "'Broadway: The American Musical' is a six-part series that's just what it claims to be: a documentary history of the American musical (although it doesn't start anywhere near the beginning: 'The Black Crook' in the 1860s). The basic structure is chronological, though there are a few odd deviations: 'Bye Bye Birdie' comes before 'My Fair Lady', 'The Pyjama Game' doesn't show up until the 1980s, and flamboyant showman David Merrick isn't mentioned until the 1990s.\n\nOf course, the real fun of a show like this is the chance to see rare clips of performers and obscure shows. Necessarily, documentarian Michael Kantor is limited by the fact that most stage performances were not preserved. We see silent-film footage of Bert Williams while the soundtrack plays one of his gramophone recordings; the image and soundtrack don't match, because Williams never made a talking movie. Yet, within the available material, Kantor makes some bizarre choices. We see silent footage (taken with a home-movie camera) of George M Cohan singing and dancing on Broadway in 'I'd Rather Be Right'. After a brief tantalising glimpse of this rare footage, Kantor cuts to a long excerpt of James Cagney in the movie 'Yankee Doodle Dandy', which we can get at any video shop. We see a brief clip of Bill 'Bojangles' Robinson doing his famous stair dance ... but after a few delightful seconds, the documentary cuts to footage of a generic jazz band. We see clips from a couple of MGM movie musicals (not film versions of stage musicals) containing songs ABOUT Broadway.\n\nI was delighted by one clever sequence: an audio recording of Fred and Adele Astaire singing 'Fascinating Rhythm' is played over animated cut-outs of the dancing Astaire siblings. Also delightful is new footage of former Ziegfeld chorus girl Doris Eaton, singing and dancing one of her old songs from memory, shortly before her 100th birthday! We also see rare kinescope footage of some major Broadway musical performances: Gertrude Lawrence from 'The King and I', Jill Haworth from the original Broadway cast of 'Cabaret', Alfred Drake and Patricia Morison from 'Kiss Me Kate'. What pleasures! One non-Broadway clip that I welcomed was a brief sequence of Michael Bennett and Donna McKechnie dancing on a 1964 TV show, long before they collaborated on 'A Chorus Line'. I was also pleased by home-movie footage of the original staging of 'Porgy and Bess', along with new interviews of the performers who played the title roles in that production.\n\nVarious talking heads weigh in with their opinions. Oddly, this documentary makes no attempt to offer the credentials of these people. John Lahr states that his mother was a Ziegfeld chorus girl, yet never mentions that his father was a major Broadway comedian. George C Wolfe comments on the 1944 production of 'On the Town' (which closed long before Wolfe was born), yet never mentions that he directed an acclaimed revival of this same show. Betty Comden and Adolph Green were in that original 1944 cast of 'On the Town' (in addition to writing the book and lyrics), so I was amused here when they sing one of that show's songs ... and get the words wrong! Other errors here are less happy. Cole Porter's Broadway musical for Fred Astaire was titled 'The Gay Divorce', NOT 'The Gay Divorcée' (that was the movie version). A narrator mispronounces the name of Cole Porter's home town. Mary Rodgers gets the title wrong for one of her father's songs. (Maybe because he only wrote the tune, not the words.)\n\nRegrettably, much of this documentary caters for what audiences will find familiar rather than trying to interest them in the unfamilar. We get a clip of the Marx Brothers in the movie version of 'Animal Crackers'. The Marxes were giants of film comedy, but their importance to Broadway's history is negligible. We are told absolutely nothing about Busby Berkeley's work on Broadway, but we get a clip from one of his Warner Brothers movies about a 'Broadway' musical that couldn't possibly be staged in a Broadway theatre. And did we need to be told for the 21,937th time that Mary Martin was from Weatherford, Texas?\n\nThis documentary intelligently reveals how the musical theatre was affected by the arrival of the subway in 1904, by Prohibition, by World War Two, by the 9/11 terrorist attacks, and by the arrival of Aids. The most moving sequence here is a tribute to Broadway figures who died of Aids ... not the obvious big names, but those whom one talking head calls 'the guys in the trenches': the talented minor figures who never got their chance at stardom. Less inspiring is a film clip of Gerald Schoenfeld of the Shubert Organisation: his two sound bites about the Times Square district seem to be addressed solely to its viability as real estate. A long tribute to the Disney corporation's efforts on Broadway seems to be intended more as corporate back-scratching than anything else. Fittingly, the series ends with an elaborate tribute to Al Hirschfeld, the caricaturist who documented Broadway's best for more than seven decades!\n\nDespite some nitpicks, I deeply enjoyed this documentary and I learnt quite a bit from it. Anyone who wants to learn about the Great White Way will get a solid grounding in the American theatre's history from these six episodes. And anyone who just wants a good time watching some enjoyable musical numbers will get plenty of that pleasure here. I rate 'Broadway: The American Musical' a full 10 out of 10. Bravo!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0423623/"
}