{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Alexander",
            "url": "/name/nm0004517/"
        },
        {
            "@type": "Person",
            "name": "Debbie Allen",
            "url": "/name/nm0000739/"
        },
        {
            "@type": "Person",
            "name": "Arthur Anderson",
            "url": "/name/nm0026379/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 106,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0931941/"
        },
        {
            "@type": "Person",
            "name": "Rick McKay",
            "url": "/name/nm1092221/"
        }
    ],
    "datePublished": "2021-08-14",
    "description": "\"Broadway: Beyond The Golden Age\" is the long awaited sequel to Rick McKay's \"Broadway: The Golden Age.\" It tells the history of Broadway from 1959 and ending in 1983 as told by over 100 Broadway legends as interviewed by Mr. McKay..",
    "director": [
        {
            "@type": "Person",
            "name": "Rick McKay",
            "url": "/name/nm1092221/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Documentary",
        "History",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTYwMDc3NjMtOTY3MS00YTk2LWI3OWYtM2RhYWE1ZTVmMzdiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDA2MzQxMw@@._V1_.jpg",
    "keywords": "broadway manhattan new york city,manhattan new york city,broadway musical as subject,theater,show business",
    "name": "Broadway: Beyond the Golden Age",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "HotToastyRag"
        },
        "dateCreated": "2022-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt2756046/"
        },
        "name": "So fascinating and well done",
        "reviewBody": "I loved the first Rick McKay documentary Broadway: The Golden Age, as did millions of others, and when he released a sequel titled Beyond the Golden Age, I was so excited to watch it. Just as in the first one, dozens and dozens of Broadway veterans were interviewed with interesting stories, funny remembrances, and unknown trivia about their time onstage and their relationships with others in front of and behind the curtain.\n\nThis segment picks up right where the first left off. Instead of the 1930s-1950s, Beyond the Golden Age showcases the 1950s-1980s. What a shift in the Broadway style of shows! Rodgers & Hammerstein are out, and Bob Fosse and Stephen Sondheim are in. There's such a different between Show Boat and Hair. Even if you prefer the \"good old days\", this documentary is still very entertaining.\n\nWhat I always find amusing is the superiority Broadway actors feel over Hollywood ones. Some people feel stage acting is infinitely more difficult and require more training, and others believe all the technical aspects, and the \"don't look in the camera\" factor, make Hollywood harder. The divide is great, but when you talk to theatre people, they almost have scorn for screen actors. Many movie stars are featured in this documentary, but they're all quick to mention that the legitimate theatre is their real love. Hollywood is an amusing diversion, claims Debbie Reynolds, Dick Van Dyke, Shirley Knight, Liza Minnelli, and others, but the stage is where they always long to be.\n\nProbably a great appeal to most audiences is the roster of participants. Stephen Sondheim, Angela Lansbury, Carol Burnett, Bernadette Peters, Carl Reiner, Harold Prince, Chita Rivera, Donna McKechnie, Patti LuPone, Elaine Stritch, Shirley MacLaine, Cloris Leachman, Glenn Close, Robert Morse, Barbara Cook, Ann Reinking, Rosemary Harris, Louis Gossett Jr., Estelle Parsons, Elliott Gould, Michael Crawford, Peter Gallagher, Joanna Gleason, Julie Harris, Frank Langella, Debbie Allen, Eli Wallach, Robert Redford and dozens more actors who were bitten by the theatre bug in New York all contribute to educating audiences everywhere on the mid-20th century Broadway \"wonder years\". Rick McKay, director and editor, was very talented to cut quickly between people's stories so that even though the interviews are one-on-one, it feels like we're watching a big group of friends reminisce about the same story. Very well done, and highly recommended!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt2756046/"
}