{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lillian Gish",
            "url": "/name/nm0001273/"
        },
        {
            "@type": "Person",
            "name": "Richard Barthelmess",
            "url": "/name/nm0001932/"
        },
        {
            "@type": "Person",
            "name": "Donald Crisp",
            "url": "/name/nm0187981/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10654,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "Broken Blossoms",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054813/"
        },
        {
            "@type": "Person",
            "name": "Thomas Burke",
            "url": "/name/nm0121885/"
        },
        {
            "@type": "Person",
            "name": "D.W. Griffith",
            "url": "/name/nm0000428/"
        }
    ],
    "datePublished": "1919-10-20",
    "description": "A frail waif, abused by her brutal boxer father in London's seedy Limehouse District, is befriended by a sensitive Chinese immigrant with tragic consequences.",
    "director": [
        {
            "@type": "Person",
            "name": "D.W. Griffith",
            "url": "/name/nm0000428/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTY0ODRmZDktMzM2MC00NThmLWEyMDMtODQzNWEyMjMxYTYzXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "boxer,waif,doomed love,battered child,interracial relationship",
    "name": "Broken Blossoms or The Yellow Man and the Girl",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "drpax"
        },
        "dateCreated": "2005-07-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0009968/"
        },
        "name": "The Introduction to Silent Movies for those who only know Chaplin",
        "reviewBody": "\"In this scarlet house of sin, does he ever hear the temple bells?\" Broken Blossoms is the movie I use to introduce people to silent film who only know it from Chaplin shorts or Birth of a Nation. It is one of the most sensitive movies ever made, in my opinion, and is usually overlooked in any top 100 movie listing. I fear the oversight is due to the listers not having actually seen it.\n\nThe version I have--which is now sadly out of print--is the Thames Video version with Lillian Gish's introduction. It is also the one with the original Louis Gotshalk score, pieces of which are sometimes heard on other versions, but the impact of the full orchestral Gotshalk score is overwhelming on an already exquisite film. If you have a chance to see this version, by all means do so.\n\nIn answer to a question in another posting, the movie WAS originally tinted--it was part of the \"epic poetry\" attempt and was quite common with a lot of Griffith work--even back to \"A Corner in Wheat\".\n\nWhile I am an immense Gish fan, a lot has already been said about Miss Lillian in the other comments, so I will concentrate on Dick Bartlemess as Chen Huan. The quote above accompanied by his sad look as he leans against the wall of his curio shop tell it all: wrecked youthful enthusiasm--his despair only temporarily abated by the \"pipe\" in the Limehouse opium dens. His dreams of youth, all packed away in his garret, are only brought out when the one thing that gives him hope that is goodness amidst all the squalor stumbles into his shop.\n\nOnly after Lucy arrives can Chen Huan allow himself to dream--to return to golden days of learning, beauty and goodness and ideals. He literally places his dreams of his lost youth on the trembling body of Lucy, but it such a pristine ideal he dare not \"defame\" it, or it too will disappear like all his other dreams. He must observe it from afar--almost ephemeral. He knows what Hell is like (even before he was shown the booklet by the Christian Brothers). His hell is his lost heart, his lost love. \"Bits and pieces of his shattered life.\" Almost invariably when I find someone to share the movie with me, they are amazed how well it is made and how well it's core story stands up to today. The particulars of Chinese, Cockney and London are not the point; it is a story of hope and despair, of lovers and dreamers. A mature story for a mature audience.\n\nI often wonder if it could be made today. As open as we think we are, I wonder if the basic story could be told again. No matter--it's been told--excellently",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0009968/"
}