{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Claire Danes",
            "url": "/name/nm0000132/"
        },
        {
            "@type": "Person",
            "name": "Kate Beckinsale",
            "url": "/name/nm0000295/"
        },
        {
            "@type": "Person",
            "name": "Bill Pullman",
            "url": "/name/nm0000597/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23304,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064962/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Adam Fields",
            "url": "/name/nm0276178/"
        },
        {
            "@type": "Person",
            "name": "David Arata",
            "url": "/name/nm0033153/"
        }
    ],
    "datePublished": "1999-08-13",
    "description": "Two women are arrested for smuggling while vacationing in Thailand.",
    "director": [
        {
            "@type": "Person",
            "name": "Jonathan Kaplan",
            "url": "/name/nm0438279/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWU4YjZmODktZDFmNC00MDU0LTliMTYtMDk1YjNmYjliMGZiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "bangkok thailand,vacation gone wrong,thailand,f rated,frame up",
    "name": "Brokedown Palace",
    "original_info": {
        "id": "Brokedown Palace_1999",
        "name": "Brokedown Palace",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "baumer"
        },
        "dateCreated": "1999-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120620/"
        },
        "name": "A film about the power of friendship.",
        "reviewBody": "We all have friends. Some of us have more than others but there really are only one or two people that you feel really close with, people that you can say are like your brother or sister. Alice ( Danes )and Darlene ( Beckinsale ) are like that. You can see that from the beginning. They graduated together, they go to parties together and they decide to go to Bangkok together when they were supposed to be going to Hawaii. They also get busted for attempting to smuggle drugs into a third world country and that spells disaster. The rest of the film is about survival and not giving up hope. It also has a strong message about the power of friendship and what it can mean to someone.\n\nBrokedown Palace is a very good film, it is not excellent and that is due to a few issues that I want to talk about. But first I want to say what is good about the film. And for starters the acting is top notch, and you can look no further than the two leads. Danes and Beckinsale are perfect in the roles that they have. Alice is always fiery and seems a little rough around the edges, but she seems more fun than Darlene. But sometimes that fun can get her into trouble. Darlene is always a little on the conservative side and although that can get irritating sometimes, it would have served the two girls better if her way was adhered to instead of Alice's. Bill Pullman is adequate as the American lawyer living in Thailand. The film is photographed very well also. The inside of the prison while not the same as Shawshank or Natural Born Killers or Return To Paradice, but it does show the necessary ( but underdone) hopelessness of the situation that they are in. Johnathin Kaplan's direction is quite good as well. We see the two girls struggling to make it through each day but you can see their spirit is being put out a little more each day. Brokedown Palace is excellent when it talks about friendship and it shows how they have to rely on each other to survive. The other thing that I had to comment on is the soundtrack for the film. It heightens and compliments the mood of the film to perfection. The song that you hear in the trailer is also played in the film and when it plays you feel the plight of the women in this prison. You can feel how alone they must feel and how desperate they are to get out and get back to the simple things in life. And it also makes you look at yourself and realize how lucky we are to live in the society that we do. We have it easy compared to some country's and believe it or not the music is a perfect catalyst for reflection on this subject. Some of the music is done by a group called Delirium ( I think ) but it is Sara McLaughlin( wrong spelling, but how do you spell her last name? ) that does the lyrics and her voice is beautiful and haunting and it adds so much to the film.\n\nWhat I didn't enjoy about the film was some of the stupidity that the girls exhibit. I won't say what it is that they do but when you see it for yourself you'll know what I am talking about. Also I didn't really feel that the prison they were in was all that bad. It looked more like a minimum security prison and that may be because when there are similar circumstances in other films that invlove men doing time in a foreign country, the prison scenes are always brutal and sadistic. But I didn't get that here.\n\nOverall this is a great film and it really does make you ask the question, \" How far would you go for a friend? \" That is a tough question and maybe one that none of us could honestly answer until put into the same situation. Let's just hope that it never comes down to that.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi918290713",
        "name": "Brokedown Palace",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTRjYWE3M2MtOWQzMy00ZmU0LTk3N2YtM2ViZWMzMDMxMmZlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTRjYWE3M2MtOWQzMy00ZmU0LTk3N2YtM2ViZWMzMDMxMmZlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:52:34Z",
        "url": "https://www.imdb.com/video/vi918290713/"
    },
    "url": "/title/tt0120620/"
}