{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sidney Poitier",
            "url": "/name/nm0001627/"
        },
        {
            "@type": "Person",
            "name": "Will Geer",
            "url": "/name/nm0002095/"
        },
        {
            "@type": "Person",
            "name": "Bradford Dillman",
            "url": "/name/nm0226947/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 801,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028952/"
        },
        {
            "@type": "Person",
            "name": "Ernest Kinoy",
            "url": "/name/nm0455852/"
        }
    ],
    "datePublished": "1971-08-15",
    "description": "A man who returns to his hometown for a funeral may have a much larger purpose in life than those around him can see.",
    "director": [
        {
            "@type": "Person",
            "name": "James Goldstone",
            "url": "/name/nm0326360/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjY2ODM2MjctZTU5ZC00MzBhLTkwYjYtNDc0ODZkNzIyZDBmXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "return to hometown,return home,funeral,angel,racial tension",
    "name": "Brother John",
    "original_info": {
        "id": "Brother John_1971",
        "name": "Brother John",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Uriah43"
        },
        "dateCreated": "2022-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068317/"
        },
        "name": "A Familiar Visitor at the Moment of Death",
        "reviewBody": "This film begins with a small-town doctor known simply as \"Doc Thomas\" (Will Geer) advising a young woman named \"Sarah\" (Lynn Hamilton) to check into the local hospital for some tests. Although he advises her not to worry, he fully realizes that she has a terminal case of cancer and as such she doesn't have long to live. Prior to her leaving, however, he asks whether she has spoken with her brother \"John Kane\" (Sidney Poitier) who left town years ago and seems to have completely disappeared. After replying that she doesn't even know where he lives, she then leaves the clinic and checks into a hospital. The scene then shifts to a demonstration being held outside of a local factory where some of the workers are trying to form a union. With tensions running high Doc Thomas' son--the conservative District Attorney \"Lloyd Thomas\" (Bradford Dillman)--advises his law enforcement officials to be on the lookout for suspicious strangers appearing hoping to further inflame the situation in the union's favor. Not long afterward, John Kane just happens to appear right before his sister dies. Even so, Lloyd and the county sheriff \"Ramon Bieri\" (Orly Ball) become convinced that he's also there to stir up trouble. Doc Thomas, however, is not convinced and marvels at the fact that John seems to have an uncanny knack for mysteriously showing up whenever one of his family members is dying. What he suspects-and nobody else seriously considers--is that there is more to John than meets the eye and death always seems to follow him wherever he goes. Now, rather than reveal any more, I will just say that I liked the performances of both Sidney Poitier and Will Geer along with those of Beverly Todd (as \"Louisa MacGill\") and the always underappreciated Paul Winfield (\"Henry Birkardt\"). I also liked the manner in which the overt racism endemic in the South was exposed for all to see. That said, however, I must admit that I would have preferred a more heightened sense of mystery combined with a bit more suspense than what was displayed. Be that as it may, I still enjoyed this film for the most part and I have rated it accordingly. Slightly above average.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi649855257",
        "name": "Brother John",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTk5MzlhZjctOGJmYS00OGQyLWEzMmMtYjM3YmU5OTY4NTFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTk5MzlhZjctOGJmYS00OGQyLWEzMmMtYjM3YmU5OTY4NTFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:53:09Z",
        "url": "https://www.imdb.com/video/vi649855257/"
    },
    "url": "/title/tt0068317/"
}