{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Rooker",
            "url": "/name/nm0740264/"
        },
        {
            "@type": "Person",
            "name": "Big Daddy Wayne",
            "url": "/name/nm0915518/"
        },
        {
            "@type": "Person",
            "name": "Jack Wallace",
            "url": "/name/nm0908685/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1007,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0252006/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0251976/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0251947/"
        },
        {
            "@type": "Person",
            "name": "Jason Freeland",
            "url": "/name/nm0293253/"
        },
        {
            "@type": "Person",
            "name": "James Ellroy",
            "url": "/name/nm0255278/"
        }
    ],
    "datePublished": "1999-06-03",
    "description": "Recovering alcoholic, ex-LAPD, private detective Fritz Brown, is hired by caddie \"Fat Dog\" to follow his kid sister, who is holed up with an old sugar daddy. The trail leads to his old police boss Cathcart, and the bodies start to...",
    "director": [
        {
            "@type": "Person",
            "name": "Jason Freeland",
            "url": "/name/nm0293253/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE0ODQ0NTA4M15BMl5BanBnXkFtZTcwOTk3MjUyMQ@@._V1_.jpg",
    "keywords": "pink panties,panties,escort service,pervert,father daughter incest",
    "name": "Brown's Requiem",
    "original_info": {
        "id": "Brown's Requiem_1999",
        "name": "Brown's Requiem",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lonturner"
        },
        "dateCreated": "2006-07-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0171135/"
        },
        "name": "Based on the novel by James Ellroy...",
        "reviewBody": "...Brown's Requiem tells the story of Fritz Brown, a private investigator and part time repo man who was at one time an officer in the LAPD -- and is currently an on-the-wagon alcoholic. Fritz is hired by an obese golf caddy who calls himself Fat Dog (MadTV's Will Sasso) to watch over his sister (Selma Blair) who is currently shacked up with a wealthy older man. Fritz soon finds himself involved in a complicated plot involving Fat Dog's murder, a former football player turned racketeer and the Internal Affairs chief who had Fritz thrown off the force (the late, great character actor Brion James).\n\nI've not read Ellroy's novel (it's one of the few Ellroy novels I haven't read) but I understand it was his first. If this film is a faithful adaptation, then it serves as the filmic representation of the birth of Ellroy's signature devices: flawed \"heroes,\" gruesome violence, perversions, sadism and a filthy Los Angeles underbelly, all of which are on display here. Star/producer Michael Rooker does a fantastic job conveying a character who strives for redemption and allows the possibility of it to pull him into a world of murder and depravity he was not ready for. The direction is tight, the mystery is intriguing and the film is littered with memorable bit roles by such character actors as the aforementioned Brion James, Brad Dourif, Lee Weaver and Tobin Bell.\n\nFans of film noir should give this one a go, as should fans of star Michael Rooker and author James Ellroy. It's not perfect but it surely deserved better than the direct-to-video release it received here in the U.S. \n\nA solid 7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0171135/"
}