{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Springsteen",
            "url": "/name/nm0819803/"
        },
        {
            "@type": "Person",
            "name": "Roy Bittan",
            "url": "/name/nm0084500/"
        },
        {
            "@type": "Person",
            "name": "Clarence Clemons",
            "url": "/name/nm0166317/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 695,
        "ratingValue": 9,
        "worstRating": 1
    },
    "contentRating": "G",
    "datePublished": "2001-04-07",
    "description": "Live From New York City is the chronicle of Bruce Springsteen's first tour with The E Street Band in over a decade. A full-on rock revival packed with hits and fan favorites, Live From New York is a triumphant reunion of one of ro...",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Hilson",
            "url": "/name/nm0385209/"
        }
    ],
    "duration": "PT3H10M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjEzNjE4ODA3MF5BMl5BanBnXkFtZTcwMzU1MDUyMQ@@._V1_.jpg",
    "keywords": "tv special,rock music,live performance,concert film,character name in title",
    "name": "Bruce Springsteen and the E Street Band: Live in New York City",
    "original_info": {
        "id": "Bruce Springsteen and the E Street Band: Live in New York City_2001",
        "name": "Bruce Springsteen and the E Street Band: Live in New York City",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cbulkin"
        },
        "dateCreated": "2003-05-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0291775/"
        },
        "name": "The next best thing to being there...",
        "reviewBody": "Recorded over the course of the final two nights of the New York City stand in 2000, this DVD set features the entire HBO broadcast and a bonus disc featuring another whole set of material. Taken collectively, the two discs are approximately the length of a typical concert during the 1999 - 2000 \"Reunion\" tour.\n\nCasual fans will enjoy straight-forward renditions of some of his most well known songs such as Born to Run, Thunder Road, and Badlands. To keep it interesting for fans and for the band, some of the classics are presented in vastly different arrangements. The River is slowed down and fleshed out in an arrangement that would not be out of place in a film noir soundtrack. Atlantic City and Mansion on the Hill (both from 1982's Nebraska) sound completely different as well. Atlantic City is delivered as a full throttled rocker and Mansion on the Hill sports a country feel. Born in the USA is stripped down to a stunning solo acoustic number (leaving no doubt as to the meaning of this widely misunderstood song).\n\nFans of Bruce's early work will be delighted by the inclusion of a spot-on Lost in the Flood (from 1973's Greetings from Asbury Park, his debut album) and The E Street Shuffle (from 1973's The Wild, the Innocent and the E Street Shuffle (played in it's entirety over the closing credits). Die-hard fans will appreciate the inclusion of several \"outtakes\" including the opening My Love Will Not Let You Down and Murder Incorporated (both recorded for 1984's Born in the USA), and Don't Look Back and The Promise (both recorded for 1978's Darkness on the Edge of Town).\n\nHighlights include stellar renditions of war horses such as Prove it All Night, Ramrod, Jungleland, Backstreets, and a blistering Light of Day.\n\n Also included is a 15 minute documentary featuring interview clips with the band as well as snippets of songs not included in the concert proper such as The Promised Land and Blood Brothers.\n\nHaving played together for over a year, the band was in peak form when this video was recorded. Highly recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0291775/"
}