{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Campbell",
            "url": "/name/nm0132257/"
        },
        {
            "@type": "Person",
            "name": "Ossie Davis",
            "url": "/name/nm0001115/"
        },
        {
            "@type": "Person",
            "name": "Bob Ivy",
            "url": "/name/nm0412370/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49840,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056742/"
        },
        {
            "@type": "Person",
            "name": "Joe R. Lansdale",
            "url": "/name/nm0487067/"
        },
        {
            "@type": "Person",
            "name": "Don Coscarelli",
            "url": "/name/nm0181741/"
        }
    ],
    "datePublished": "2003-10-10",
    "description": "Elvis Presley and a black \"JFK\" stay in a nursing home where nothing happens - until a wayward Egyptian mummy comes and sucks out the old people's souls thru their anuses. The two decide to fight back.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Coscarelli",
            "url": "/name/nm0181741/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODk2OGY3ZTItMDJiNi00MzU4LTkyY2EtODczZjE1MjVhYjY0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "motorized wheelchair,elvis impersonator,african american,black comedy,undead",
    "name": "Bubba Ho-Tep",
    "original_info": {
        "id": "Bubba Ho-Tep_2003",
        "name": "Bubba Ho-Tep",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mattbw74"
        },
        "dateCreated": "2002-08-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0281686/"
        },
        "name": "Fabulously original film",
        "reviewBody": "I recently had the wonderful opportunity to see this film at a horror and fantasy convention. Since it is not yet in distribution I jumped at the chance. Just to set the record straight, I didn't go into this film with normal expectations. The god that is known as Bruce Campbell stars in this film, and let's just say that any morsel of Bruce Campbell goodness I can get is going to make me absolutely love a movie.\n\nThe basic premise of this film is that Elvis Presley is alive and not too well. He lives in an East Texas nursing home. It seems that years before Elvis tired of his fame and switched places with an Elvis impersonator. The Elvis we see in this picture is a 68 year old man with a penchant for rings and large, jewel studded sunglasses. Whenever he claims to be Elvis, everyone just laughs at this crazy old Elvis impersonator obviously going senile in his old age. Elvis discovers that there's a mummy inhabiting his nursing home who is sucking the souls out of the residents through a rather disturbing bodily orifice. So Elvis teams up with an old African American man (Ossie Davis) claiming to be John Kennedy (his explanation for what happened to him has to be heard to be believed, and is one of the funnier jokes in the movie) to stop the mummy and save the souls of the residents of the nursing home.\n\nAs crazy and silly as this setup sounds, the film actually achieves depths that most \"serious\" movies can't even begin to touch. The film deals with what it's like to be an elderly person in this country when nobody cares about you. Elvis and Kennedy are both regretful about not being there for their children when they needed them. And a last chance for glory and leaving this world honorably is a recurring theme throughout the film (see Kemo Sabe's showdown with the mummy). All of these themes are handled with a deft hand, never hammering the point home, but intended to be taken seriously.\n\nOssie Davis gives a terrific comedic performance as \"Jack\" Kennedy. He delivers some rather eyebrow raising exposition with such a light touch, the audience is forced to except his explanation as fact and move on.\n\nAnd then of course, Bruce Campbell. Campbell plays Elvis as we've never seen him, a 68 year old man with a bad hip and a cancerous growth in a very uncomfortable place. Anyone who has seen any of Campbell's performances knows he can play the hero or the buffoon with equal skill. But here, he pushes the bounds of his talent like never before. Perhaps the highest praise I can give his performance is that 10 minutes into the film, I forgot it was him, and truly believed it was Elvis on the screen.\n\nThe film was written for the screen and directed by Don Coscarelli. Coscarelli has been in something of a rut since his breakthrough hit with \"Phantasm\" over 20 years earlier. This is truly his best film since that horror classic, it may even be better.\n\nThe film was based on a short story by Joe R. Lansdale, the gifted writer. Lansdale routinely puts different genres in a blender together and comes out with something better than a genre outing. This film played just like one of his novels: Horror, comedy, fantasy, and a little bit of western.\n\nBruce Campbell was on hand for the screening I saw and made some comments before the film. He said that he did the film because it was so weird and that we need more films that aren't in the cookie cutter format. I couldn't agree more and I can't recommend this film highly enough. It breaks all molds and expectations. Seek it out when it finds a distributor, you won't be disappointed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Elvis Presley and a black \"JFK\" stay in a nursing home where nothing happens - until a wayward Egyptian mummy comes and sucks out the old people's souls thru their a-holes. The two decide to fight back.",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3683631385",
        "name": "Blu-ray Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjdmNmQ5MGMtYzIzZS00MGVlLTlkZmMtMWNlOTkwYTQwYmVlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjdmNmQ5MGMtYzIzZS00MGVlLTlkZmMtMWNlOTkwYTQwYmVlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-13T13:16:05.671Z",
        "url": "https://www.imdb.com/video/vi3683631385/"
    },
    "url": "/title/tt0281686/"
}