{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Melanie Griffith",
            "url": "/name/nm0000429/"
        },
        {
            "@type": "Person",
            "name": "Anjelica Huston",
            "url": "/name/nm0001378/"
        },
        {
            "@type": "Person",
            "name": "Gabriel Byrne",
            "url": "/name/nm0000321/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 884,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040329/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063390/"
        }
    ],
    "datePublished": "1995-04-30",
    "description": "Wild. Untamed. Legendary. Buffalo Girls celebrates the bold escapades of tough-talking Calamity Jane Canary and her illustrious cohorts. It's the waning days of the Wild West and Jane, the rough 'n' rugged cowgirl, is searching no...",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxNjIzOTI4NF5BMl5BanBnXkFtZTcwOTY4MTkzMQ@@._V1_.jpg",
    "keywords": "horseback riding,american indian,american indian attack,american indian boy,reference to lewis and clark",
    "name": "Buffalo Girls",
    "original_info": {
        "id": "Buffalo Girls_1995",
        "name": "Buffalo Girls",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "beastwarsfan"
        },
        "dateCreated": "2006-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111903/"
        },
        "name": "Just watched Buffalo Girls",
        "reviewBody": "Here goes my passion for westerns :) I just watched \"Buffalo Girls\". To be honest, at the beginning I was reserved - western with women, huh... It's like prejudice. The one and only western with a woman main character I really love is \"Cat Ballou\" with Jane Fonda. Well, there are two such westerns now. You know, Buffalo Girls is one of those movies that come as a pleasant surprise. Anjelica Huston is Calamity Jane, Melanie Griffith is Dora DuFran. They both are doing very good job with their characters. And the support actors are just great. Jack Palance and Tracey Walter as two good old friends, simple people with simple naive dreams. Both actors I know since I was a kid and my dad took me to watch Tim Burton's \"Batman\". Jack Palance is one great actor, I enjoy his mere presence in movies. Tracey Walter's character is probably my favorite character in the movie. Peter Coyote, Keys from E.T. is also here. Charlayne Woodard makes a very good appearance. And of course Red Crow - this man just inspires. I've seen him in \"Dances with Wolves\", \"Dreamkeeper\" and \"Hidalgo\" (three great movies in my opinion), but I was really surprised to find out that he has done some voice acting for \"Captain Planet and the Planeteers\". \"Buffalo Girls\" is really good movie. After the end I felt that feeling that usually comes with western movies - pride, loneliness, nostalgia... Like I belong there in the praerie. Watching the sunset, listening to Willie Nelson and thinking \"Those were the days...\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0111903/"
}