{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sarah Michelle Gellar",
            "url": "/name/nm0001264/"
        },
        {
            "@type": "Person",
            "name": "Nicholas Brendon",
            "url": "/name/nm0107183/"
        },
        {
            "@type": "Person",
            "name": "Alyson Hannigan",
            "url": "/name/nm0004989/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 150893,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008576/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005334/"
        },
        {
            "@type": "Person",
            "name": "Joss Whedon",
            "url": "/name/nm0923736/"
        }
    ],
    "datePublished": "1997-03-10",
    "description": "A young woman, destined to slay vampires, demons and other infernal creatures, deals with her life fighting evil, with the help of her friends.",
    "genre": [
        "Action",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2MwOGIyZGYtNzgxZC00N2Q5LTllYjItM2U4MTkwMDBjYzUyXkEyXkFqcGdeQXVyNzA5NjUyNjM@._V1_.jpg",
    "keywords": "vampire,action heroine,high school,destiny,coming of age",
    "name": "Buffy the Vampire Slayer",
    "original_info": {
        "id": "Buffy the Vampire Slayer: Season 2_1997",
        "name": "Buffy the Vampire Slayer: Season 2",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AlsExGal"
        },
        "dateCreated": "2011-01-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118276/"
        },
        "name": "A fluffy title belies a rather serious show about the human condition",
        "reviewBody": "If seasons 6 and 7 of this seven season show had held up as well as the previous ones I'd give this show an enthusiastic ten. Don't watch the movie and believe you understand the dynamics of the TV show - you won't. This show is a deeply layered exploration of the human condition - man's ability to change for better and worse, the power of forgiveness, the human conscience and its meaning, and how revenge or a lust for power can turn a human into as bad a monster as any real demon. \n\nSeason one was a short one and a trial one for the show, thus don't expect that much depth here. These 12 episodes introduce the main characters for the duration of the series - Buffy - the one girl in all the world with the strength to do battle with demons, her friends Xander and Willow, and her \"watcher\" - or mentor - Giles, as well as at first reluctant ally Cordelia Chase and the initially mysterious Angel who both exit at the end of season three for the related show \"Angel\". The episodes are fun and in many ways a foreshadowing of what is to come, but each episode pretty much stands alone.\n\nSeasons two and three go together and are the last two years of Buffy's high school experience. She and her friends graduate at the end of the third season. These two seasons along with season five comprise the best three seasons of television you'll ever see. As for the season two finale - \"Becoming\" - about the best episode of TV ever with one of the most heartbreaking choices ever presented to a 17 year old girl who must save the world but is, after all, also a 17 year old girl. This is where Joss Whedon introduces his \"story arc\" pattern for seasons of Buffy. Each season has a \"Big Bad\" - a nemesis that Buffy and her friends must defeat to save a world unaware of the danger.\n\nSeason four was a rather weak one, mainly because creator Joss Whedon was distracted by the creation of his spin-off show \"Angel\", all about Buffy's love leaving Sunnydale and moving to LA. Of course, it would also be expected that moving the show from a high school to college setting would throw the show off balance for at least a few episodes. One stroke of brilliance in season 4 - adding the vampire Spike as a permanent member of the cast. One not so brilliant stroke - IMHO - adding Riley as Buffy's college boyfriend. He always seemed too self-righteous and imperious for his own good. Nobody wants to eat spinach at every meal if you get my drift.\n\nSeason five was a return to the brilliance of seasons two and three. Buffy has two real family crises - she suddenly has a sister that nobody seems to notice was not around previously and her mother becomes seriously ill. The Big Bad this year is an uber-strong woman-like creature - Glory - who has a penchant for high fashion and stealing the essence of what holds a person's mind together as nourishment. She's in search of a mysterious key that will unlock the door into her previous dimension from which she has been exiled. Unfortunately, if she succeeds, it will also unleash hell on earth.\n\nDuring season six, Joss Whedon was again working on another TV series - \"Firefly\". Thus after seven episodes he pretty much left the writing duties to Marti Noxon. Unfortunately, Marti tried to make this season all about an experience she had with a bad-boy college boyfriend and it made for some most cringeworthy episodes of Buffy. The writing suffered too as it became a bit stiff versus the crisp clever lines that just flowed off the cast's tongues previously. However two of my favorite episodes are in this season - \"Tabula Rasa\" and \"Once More With Feeling\". The first has the gang reacting to a spell that causes them to completely forget who they are and their relationship to one another. The second episode is a musical. Trust me, they both work exceedingly well.\n\nSeason seven has the theme \"Back to the Beginning\". This has more to do with the name of the Big Bad who is supposed to be the biggest bad of them all but mainly due to rather truncated writing seemed rather lacking in the evil department to the point of being boring. What probably does the most to break up the rhythm of Buffy this season is the arrival of a dozen or so \"Potential Slayers\" who arrive in Sunnydale with Giles. None of these girls are slayers yet. For that to happen the current slayer must die. However, all are potential slayers in the sense that the next slayer will come from their ranks.\n\nI'm sorry to be so vague about the details per season, but I don't want to spoil any of it for you. Watch season one to get a feel for the main characters and then watch season two for the beginning of a storyline that will suck you in for all of the other seasons.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A girl finds out her destiny is to be the slayer in this home video trailer",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2634745625",
        "name": "Buffy The Vampire Slayer: Season One",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzU2OTdiZTYtN2IwYi00M2VkLWE3OTgtM2RmZTdmNzFhYTJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzU2OTdiZTYtN2IwYi00M2VkLWE3OTgtM2RmZTdmNzFhYTJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T14:58:44Z",
        "url": "https://www.imdb.com/video/vi2634745625/"
    },
    "url": "/title/tt0118276/"
}