{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Francis Ng",
            "url": "/name/nm0628757/"
        },
        {
            "@type": "Person",
            "name": "Louis Koo",
            "url": "/name/nm0465503/"
        },
        {
            "@type": "Person",
            "name": "Lan Law",
            "url": "/name/nm0492352/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 756,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Bullets Over Summer",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020851/"
        },
        {
            "@type": "Person",
            "name": "Wen Chang",
            "url": "/name/nm11511606/"
        },
        {
            "@type": "Person",
            "name": "Matt Chow",
            "url": "/name/nm0159483/"
        },
        {
            "@type": "Person",
            "name": "Wilson Yip",
            "url": "/name/nm0948159/"
        }
    ],
    "datePublished": "1999-08-05",
    "description": "Policemen Brian and Mike use an elderly woman's apartment for surveillance, hoping to catch a fugitive gangster. They develop a warm relationship with their hostess. Meanwhile, each man develops a romantic relationship.",
    "director": [
        {
            "@type": "Person",
            "name": "Wilson Yip",
            "url": "/name/nm0948159/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDZhNDEzM2ItNmJkMC00N2JlLTk1NDEtNjJlNTM4OGZhZmM1XkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "gangster,surveillance,dry cleaning,undercover police,store robbery",
    "name": "Bau lit ying ging",
    "original_info": {
        "id": "Bullets Over Summer_1999",
        "name": "Bullets Over Summer",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "paul_haakonsen"
        },
        "dateCreated": "2019-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0214555/"
        },
        "name": "Quite entertaining...",
        "reviewBody": "I was given the opportunity to sit down and watch the 1999 action crime movie \"Bullets Over Summer\" (aka \"Bao lie xing jing\") from Wilson Yip in mid-2019. Needless to say that I jumped at the chance for two reasons.\n\nFirst of all, it is a Hong Kong action movie, and I do have a special admiration for Asian movie - especially those from the Hong Kong cinema. And secondly, the movie stars Francis Ng and Louis Koo, two of the major players in Hong Kong cinema.\n\nWhile the title, \"Bullets Over Summer\", doesn't really make much of any sense, it should be said that the movie is definitely quite entertaining. And there is a lot going on, so I dare say that there are elements of this 1999 movie that I find an appeal with just about anyone in the audience.\n\nThe characters in the movie were quite diverse and they were nicely given depths and characteristics by writers Ben Cheung, Matt Chow and Wilson Yip (whom also directed the movie).\n\nFrancis Ng was phenomenal in this movie, but then again he tends to be in the movies that he stars in. He really is a talented actor and is quite capable of portraying very different characters. Louis Koo also carried himself nicely and added a good element to the movie. And for long time fans of the Hong Kong cinema, then it is quite enjoyable to watch Lan Law in the role as the granny.\n\n\"Bullets Over Summer\" offers a hefty mixture of action, drama, romance and a bit of fun as well. A mixture that definitely worked out quite well in favor of the movie. If you haven't already seen \"Bullets Over Summer\", and you get the chance to do so, I would recommend that you take the time to sit down and watch it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0214555/"
}