{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Warren Beatty",
            "url": "/name/nm0000886/"
        },
        {
            "@type": "Person",
            "name": "Halle Berry",
            "url": "/name/nm0000932/"
        },
        {
            "@type": "Person",
            "name": "Kimberly Deauna Adams",
            "url": "/name/nm0011129/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26640,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Warren Beatty",
            "url": "/name/nm0000886/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Pikser",
            "url": "/name/nm0683282/"
        }
    ],
    "datePublished": "1998-05-22",
    "description": "A suicidally disillusioned liberal politician puts a contract out on himself and takes the opportunity to be bluntly honest with his voters by affecting the rhythms and speech of hip-hop music and culture.",
    "director": [
        {
            "@type": "Person",
            "name": "Warren Beatty",
            "url": "/name/nm0000886/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY2NTM5NjIyOV5BMl5BanBnXkFtZTgwMzUwNzc3NjE@._V1_.jpg",
    "keywords": "hitwoman,hip hop,senator,truth,politics",
    "name": "Bulworth",
    "original_info": {
        "id": "Bulworth_1998",
        "name": "Bulworth",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "drednm"
        },
        "dateCreated": "2006-01-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118798/"
        },
        "name": "Brilliant Warren Beatty Performance Overlooked by Oscar",
        "reviewBody": "In BULWORTH Warren Beatty gives one of his funniest and most outrageous performances. This sharp political satire is even more timely now than it was in 1998. This is a marvelously subversive movie on several fronts: politics, race, economics, Hollywood itself! Beatty stars as a fading senator from California who is so burned out he arranges for a large insurance policy and then hires a hit man. He's at the end of his rope personally and professionally. He's losing in a primary election to a young gun and has nothing left in his life. After days without sleep or eating he is dragged off to a rally at a Black church. He starts to read his \"usual\" speech but almost in a state of delirium he starts answering questions HONESTLY. He enrages the Black congregation with his brutal answers but somehow feels buoyant. Outside the church as the mobs surround him he runs into Halle Berry and her friends and they all take off in the limo.\n\nThis starts a voyage of discovery for Beatty. Of course at this point Beatty is also running from the hit man. His new honesty unleashes a desire to live. They arrive at a Black hip-hop club where Beatty drinks, smokes pot, and is transformed by the loud urban rap music. The dance scene with Beatty and Berry is remarkable.\n\nNext stop is a speech at a fancy Hollywood hotel filled with film executives. Beatty makes many comments of how Jews run Hollywood, becomes rich, but turn out a crappy product. Next comes a debate with his political opponent, and finally an interview. The new Beatty parrots back much of what he has heard from poor Blacks but of course he has always known the truth. His sense of freedom from the back-room politics of Washington is exhilarating and his new voice reaches the masses of disenfranchised voters. His comments about the media and how it is controlled by corporate America is more apt now (during the Bush administration) than ever before.\n\nBeatty is brilliant, and this ranks as one of his very best performances. Berry is actually good as well in her pre-movie star mode when she still bothered to act. Oliver Platt scores as the political aide. Paul Sorvino is a lobbyist for the insurance industry.\n\nJack Warden, Helen Martin, Don Cheadle, Christine Baranski, Florence Stanley, Laurie Metcalf, Sean Astin, Isaiah Washington, Nora Dunn, Joshua Malina, William Baldwin, Hart Bochner, Armelia McQueen, and Jackie Gayle co-star.\n\nFilled with humor, political insights, and top-notch performances. This acid look at politics in Amerca is more timely now than ever. Bravo to Warren Beatty!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from 20th Century Fox",
        "duration": "PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi417465113",
        "name": "Bulworth",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjMyMDcwZjAtMGVmMy00Njg4LTg5MzMtM2Q1OWM3NmQ1ZTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjMyMDcwZjAtMGVmMy00Njg4LTg5MzMtM2Q1OWM3NmQ1ZTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-12-25T06:40:16Z",
        "url": "https://www.imdb.com/video/vi417465113/"
    },
    "url": "/title/tt0118798/"
}