{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        },
        {
            "@type": "Person",
            "name": "Klaus Kinski",
            "url": "/name/nm0001428/"
        },
        {
            "@type": "Person",
            "name": "Claudia Cardinale",
            "url": "/name/nm0001012/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7565,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038439/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0703656/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022726/"
        },
        {
            "@type": "Person",
            "name": "Michael Goodwin",
            "url": "/name/nm0329519/"
        }
    ],
    "datePublished": "1982-09-24",
    "description": "A documentary following German auteur Werner Herzog as he deals with difficult actors, bad weather and getting a boat over a mountain, all in an effort to make his film Fitzcarraldo (1982).",
    "director": [
        {
            "@type": "Person",
            "name": "Les Blank",
            "url": "/name/nm0087511/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTcwNWU5YTktNzNjNi00MWUyLThkOWMtNzcwMDBiZmJhN2M3XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "boat,riverboat,breast feeding,entertainment documentary,troubled production",
    "name": "Burden of Dreams",
    "original_info": {
        "id": "Burden of Dreams_1982",
        "name": "Burden of Dreams",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tssnpc"
        },
        "dateCreated": "2005-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083702/"
        },
        "name": "More than a documentary",
        "reviewBody": "I originally wondered why the Criterion Collection would choose to release this documentary. I knew that Herzog was a cinematic titan, and that the filming of Fitzcarraldo was supposedly a journey of it's own, and I even believed that the filming of a 30 ton ship being hoisted over a mountain deserved a documentary, but why would a prestigious DVD house choose to release this among the likes of Rashomon, The 400 Blows, Band of Outsiders, etc. After watching this film, it becomes very evident as to why Burden of Dreams deserves the criterion treatment. Les Blank's film does a better job of portraying the insanity and spirit of Fitzcarraldo than the film itself. The similarities between the character Fitzcarraldo and Herzog himself are endless. Despite Blank's poetic filming of the amazon jungle, despite all of the conflicts the cast and natives encounter, and despite the brilliant documentary footage displayed, the heart of this film is the the essence of cinema. This movie is about film-making and the art of it; it's passion, it's plight, it's entirety. When Herzog closes the film by stating, \"It's not only my dreams, it's my belief that they are your's as well, and the only distinction between me and you is that I can articulate. and that is what poetry or literature or film-making is all about. it's as simple as that. I make films because I have not learned anything else. and I know I can do it to a certain degree. and it is my duty, because this might be the inner chronicle of what we are, and we have to articulate ourselves, otherwise we would be cows in the field.\" You truly begin to understand this man, and this film, and cinema itself. Strongly recommended!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0083702/"
}