{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nikita Mikhalkov",
            "url": "/name/nm0586482/"
        },
        {
            "@type": "Person",
            "name": "Ingeborga Dapkunaite",
            "url": "/name/nm0200848/"
        },
        {
            "@type": "Person",
            "name": "Oleg Menshikov",
            "url": "/name/nm0579823/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15790,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "Burnt by the Sun",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016156/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050287/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0020298/"
        },
        {
            "@type": "Person",
            "name": "Nikita Mikhalkov",
            "url": "/name/nm0586482/"
        },
        {
            "@type": "Person",
            "name": "Rustam Ibragimbekov",
            "url": "/name/nm0406534/"
        }
    ],
    "datePublished": "1995-04-21",
    "description": "In the Soviet Union in 1936, shadow of Stalin's repressions lie on a famous revolution hero. The accusations of being him a foreign spy are nonsense, and all known that, but a slow process of his life's downfall is already running.",
    "director": [
        {
            "@type": "Person",
            "name": "Nikita Mikhalkov",
            "url": "/name/nm0586482/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTdkZjI5ZTktZjk3ZS00NTAxLWFiYzMtMzM2ZWFiNTkwMmU5XkEyXkFqcGdeQXVyNjg3MTIwODI@._V1_.jpg",
    "keywords": "nkvd,soviet,1930s,stalinism,reference to joseph stalin",
    "name": "Utomlennye solntsem",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lolita-19"
        },
        "dateCreated": "2000-04-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111579/"
        },
        "name": "Not all the Russians think the same",
        "reviewBody": "You know, here, in Moscow, the critics do their best to show that Nikita Mikhalkov makes popular pictures which aren't to be considered serious. To hear that \"The Barber of Siberia\" is a stupid sentimental movie is quite common nowadays. \n\nBut the more time passes from his next in turn production, the more a \"strange\" effect seems to take place: his films at last are rated according to their true value and not to somebody's opinion about them. It is always hard to say that something new is really good, but some time later...\n\n\"Utoml'ennye Solntsem\" is not a very emotional movie. I don't suppose you'd cry when watching it. But my opinion is that it's a brilliant one. It is historically authentic (I've studied that period of time quite carefully so I think I have a right to say so). And no-one on this site seems to notice the love story in the film, which actually brought about the whole tragedy (remember, Kotov made Mitya work for NKVD). It was marvellously played by Oleg Men'shikov (my favourite actor) and Ingeborga Dapkunaite, a remarkable Lithuanian actress. And Mikhalkov himself, of course - \"Kot\" means \"cat\", by the way. Many people endow him with the characteristics of Kotov which only shows that he played his role well. A good actor is always attributed his character's traits.\n\nBut still, for me the main feature of the film is the world of Mitya's soul created by Men'shikov. A young, talented boy with brilliant prospects is what Mitya was. He gets involved in the war, goes through many ordeals, then comes home and falls in love with the girl he knew from her very birth, Marousya. But their happiness is too short. He is given a choice: to work for NKVD or...to commit suicide. He's only 24, and he wants to live. But hope for future slowly disappears as life goes on, cruel and senseless. When Mitya appears on the dacha of Marousya's parents, his soul is almost a wreck. But the last chance is killed when he sees that, after a suicide attempt, after months of despair, Marousya has married Kotov and doesn't want to go through everything again. Therefore Mitya begins to fulfill his revenge.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2428240153",
        "name": "Burnt By The Sun",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzBhMzA1ZTUtOWZkMi00YWEwLWFmOTItYTkwMWVlMTA1MzRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzBhMzA1ZTUtOWZkMi00YWEwLWFmOTItYTkwMWVlMTA1MzRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:57:13Z",
        "url": "https://www.imdb.com/video/vi2428240153/"
    },
    "url": "/title/tt0111579/"
}