{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Bradley Whitford",
            "url": "/name/nm0925966/"
        },
        {
            "@type": "Person",
            "name": "Neve Campbell",
            "url": "/name/nm0000117/"
        },
        {
            "@type": "Person",
            "name": "Rupert Penry-Jones",
            "url": "/name/nm0672303/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 551,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0242566/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0110977/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0202933/"
        }
    ],
    "datePublished": "2008-06-10",
    "description": "An oil industrialist, an environmental activist and a politician are in conflict in this drama set around a summit on climate change.",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGFkMzk4N2EtZmQ3ZS00ZTM3LTgyY2MtN2I3NDFlYjJlYzQ2XkEyXkFqcGdeQXVyNzQ5MzY0NjM@._V1_.jpg",
    "keywords": "climate change,greed,oil,evil corporation,yuppie",
    "name": "Burn Up",
    "original_info": {
        "id": "Burn Up!_2004",
        "name": "Burn Up!",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "timsmith37"
        },
        "dateCreated": "2008-08-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1105836/"
        },
        "name": "Strong message, weak characters",
        "reviewBody": "I can understand why a lot of viewers tuned out after the ponderous first episode, but it is a shame, as the second instalment ratcheted the tension up nicely. The drag on the story was not the the weight of polemic, so much as the human interest elements; these had some relevance in setting up character motivation and building plot, but it was impossible to care about Rupert Penry-Jones bland corporate man or Neve Campbell's simpering environmental do-gooder. Also the ending depended a lot on our accepting the relationship between Penry-Jones and Bradley Whitford, but the background to this was never explained.\n\nThe environmental scenarios in the storyline were certainly credible, the political aspects perhaps less so. The rival lobbyists played by Bradley Whitford and Marc Warren did not seem rooted in any recognisable political power structure, and it is to the credit of both actors that the characters came to life as more than two dimensional cyphers. The depiction of big oil was perhaps simplistic. Not all in the industry are opposed to Kyoto; outside of the US at least, it is seen as a commercial opportunity. The likes of BP and Shell do not particularly care what energy agenda Governments adopt so long as they send out clear signals and stand-by them, enabling investments to be planned with minimal risk. US intransigence on Kyoto is driven more by a lack of political will to tackle the average voter's seeming belief that it is their God-ordained right to consume a vastly disproportionate share of the planet's resources.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt1105836/"
}