{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chris Noth",
            "url": "/name/nm0636562/"
        },
        {
            "@type": "Person",
            "name": "Sherry Stringfield",
            "url": "/name/nm0834606/"
        },
        {
            "@type": "Person",
            "name": "James McCaffrey",
            "url": "/name/nm0564548/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 110,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051862/"
        },
        {
            "@type": "Person",
            "name": "Michael De Avila",
            "url": "/name/nm0207173/"
        },
        {
            "@type": "Person",
            "name": "George Gilmore",
            "url": "/name/nm0319526/"
        }
    ],
    "datePublished": "1995-02-01",
    "description": "A day in the life of a New York City dive bar and the denizens that inhabit it. Set in the waning days of the Eighties, an era marked by excess and self-invention, the film is like an R-rated version of the lighthearted series \"Ch...",
    "director": [
        {
            "@type": "Person",
            "name": "Michael De Avila",
            "url": "/name/nm0207173/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY2MjE4MzM1OF5BMl5BanBnXkFtZTcwMTkwMTUxMQ@@._V1_.jpg",
    "keywords": "gambler,drag queen,new york city,dive bar,beer",
    "name": "Burnzy's Last Call",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lubbertdas"
        },
        "dateCreated": "2022-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112600/"
        },
        "name": "It's ok...and...splunge",
        "reviewBody": "I'll be completely honest, I wanted to like this film a lot more than I did.\n\nI stumbled upon it in a search for something else, and it appealed to me: the style of filmmaking, the time period, the cast. When I saw Tony Todd in the trailer playing a role very much unlike his usual horror icon type, I thought it was definitely worth a view.\n\nTwo things before going in: despite the release date, the film was made in 94. This appealed to me more, to see the cast in earlier up-and-coming years than today, as well as the setting- at the time I was a staple in a seedy city bar, so I got that kind of feel watching the film too. Also, the original cut is a bit shy of 90 mins, and the cut I watched (streamed) was a little more than 45 mins. What happened here that they edited out half the film?\n\nThe film centers around a bar during a night in the late 80's (in which it's set), and a number of different characters come and go in little vignettes. People come and go and have interactions with the bartender ('Sal', who is genial enough in a 90's soul patch kind of way, but not enough to the point you really get invested in him), with Burnzy (who at first I thought was the owner but I believe is just a regular...he tells poignant tales and waxes poetic), and with each other.\n\nPROS: \n* it's not at all by any means a bad film. It's fun, interesting, and light hearted.\n\n\n\n* I'll admit it faked me out, I thought the title was indicative of the story's conclusion, but it really had a nice heart warming light hearted ending that I enjoyed a lot\n\n\n\n* Performances are pretty top end from some notable Talent, as much as you get anyway. They all really put their all into it.\n\n\n\n* If you're in it for nostalgic value, oh man, are you in for a treat. Between the style of filmmaking, the time period, the types, the clothes, the bar itself, it's a huge throwback to early 90's.\n\n\n\n* The soundtrack if really good..for what you get of it.\n\n\nCONS: \n* some of the dialogue feels a little contrived. It's stylistic of indies of that time (like the opening monologue of a loan shark over the still photo in the opening credits). Some of it feels a little hokey.\n\n\n\n* maybe it's just this cut, but it's very hard to get into the characters, mainly because most of them you don't really see so much.\n\n\n\n* again, maybe due to the cut, but it feels like the actual night in the bar is so short. Just when you feel settled and getting into it, it's closing time.\n\n\n\n* OK, so without spoiling...there's a wraparound making the analogy of the bar itself to a watering hole in the wild. As the film shows scenes it shows clips from said watering hole that relate to the upcoming vignette. I get it, really, and it's cute, but after a few times gets a bit trite. I don't think I would have minded as much if there was more story in between.\n\n\n\n* All in all, some of the storylines felt like they were cut short.\n\n\n\n* what happened to the soundtrack? If you go on\nyoutube you can find it- Deborah Harry, David Johansen, The Smithereens...it's really quite good, and you can catch it in bg as people talk, but it doesn't feel showcased, and I can't help but feel it should be.\n\nI honestly don't know what happened here. Is it a great film? It's ok. To be honest it feels really kind of too Tarantino/Kevin Smith -y, and I wanted to be a lot more invested in the characters and the atmosphere than I felt I was for most of it...and just when I did start to feel that way the film ended. It's not however, by any means, a bad film. At all. It's got a nice warm feel, a great cast, and it does a lot with what it has.\n\nWhat I don't understand is why it's being released in '22, when I can't help but think if this came out in a decent release when it was shot it could have been somewhat notable as an indy treasure and a cult classic. If you're into seeing a type of filmmaking that isn't really done these days, and get a nice feel for the time period, to get your nostalgia thing on, I'd say give it a view. It's definitely an indy film of it's time period (and I assure you, there's way way worse).\n\nI'd love to see it get a complete release one day, all hour plus run time, to really see what was intended. A nice blu ray with interviews and maybe an extra soundtrack disc bonus.\n\nSo, really...splunge (\"it's a great-idea-but-possibly-not-and-I'm-not-being-indecisive!\").",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A downtown Manhattan gin mill plays host to a series of comic vignettes.",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1769128729",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDQ1MTM3NDAtMDc1Yi00NDRlLTk1MWItODI0NzRkNjljYjY3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDQ1MTM3NDAtMDc1Yi00NDRlLTk1MWItODI0NzRkNjljYjY3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-02-12T21:48:51.926Z",
        "url": "https://www.imdb.com/video/vi1769128729/"
    },
    "url": "/title/tt0112600/"
}