{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dick Van Dyke",
            "url": "/name/nm0001813/"
        },
        {
            "@type": "Person",
            "name": "Ann-Margret",
            "url": "/name/nm0000268/"
        },
        {
            "@type": "Person",
            "name": "Janet Leigh",
            "url": "/name/nm0001463/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8722,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051864/"
        },
        {
            "@type": "Person",
            "name": "Michael Stewart",
            "url": "/name/nm0829661/"
        },
        {
            "@type": "Person",
            "name": "Irving Brecher",
            "url": "/name/nm0106505/"
        },
        {
            "@type": "Person",
            "name": "George Sidney",
            "url": "/name/nm0796645/"
        }
    ],
    "datePublished": "1963-05-27",
    "description": "A rock singer travels to a small Ohio town to make his \"farewell\" television performance and kiss his biggest fan before he is drafted.",
    "director": [
        {
            "@type": "Person",
            "name": "George Sidney",
            "url": "/name/nm0796645/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmFiMzUwNTctZWY0Ny00ZGIyLThhNzEtOWVhZWQyNjcwNjZjXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "picture in a newspaper,newspaper headline,sheet music,protest,on the scene reporter",
    "name": "Bye Bye Birdie",
    "original_info": {
        "id": "Bye Bye Birdie_1963",
        "name": "Bye Bye Birdie",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tjonasgreen"
        },
        "dateCreated": "2006-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056891/"
        },
        "name": "A Boomer Touchstone.",
        "reviewBody": "When 'Bye Bye Birdie' was the hit of the '59-'60 season on Broadway, it was as much for its satirical edge as for the talent on stage or the innovative direction by Gower Champion. By that time it was only too clear to savvy adults that Elvis Presley and rock'n'roll had been thoroughly co-opted and mainstreamed by Hollywood and Madison Avenue. For all its supposed danger and subversiveness in 1956, Rock was a pop culture commodity like any other by the end of the decade.\n\nAnd by the time BYE BYE BIRDIE hit the screen in 1963, that point was too obvious to have any edge. Presley had long since become a bland and unfashionable movie personality, and rock itself had devolved into the kind of inconsequential June/Moon tunes that in a slightly different form had been hit parade staples for decades.\n\nSo the point is, the teen world BYE BYE BIRDIE was parodying was largely gone by that time already. Just a year later, when the Beatles appeared on Ed Sullivan (ironically he was still a King Maker but not for much longer) that world began to dissolve and reform unforgettably. So BIRDIE is the swan song for an era and an expression of Baby Boom nostalgia for kids who were too young to have enjoyed the '50s in quite the same way their older brothers and sisters had. How many children in '63 thrilled to the vigorous twitching of Ann-Margret and Bobby Rydell, hoping that was the teen world that awaited them in the future, only to discover by '68 that alienation and anger were the currency of the day? Not that those emotions were misplaced -- the times themselves demanded them. But there was a sense of loss too, a sense that we had been cheated out of fun: silly, twitchy dances and full skirts and snug pastel pullovers. There's a reason this film made an indelible impression on children then, and perhaps most on girls and gay boys.\n\nIt was an old-fashioned musical in a movie era that was confused but evolving rapidly, and Ann-Margret was a transitional star of that moment. A throwback to another Hollywood, she gets the traditional star buildup here, and it works spectacularly. Like Rita Hayworth in GILDA, A-M was the good/bad girl -- fresh and sweet and direct enough to please any elder, but with a smoldering animal eroticism so potent the screen seemed barely able to contain it. She is hot in the runway opening and delicious thereafter but she doesn't really become a star until a pivotal moment in the 'Got A Lot Of Livin' To Do' number when her eyes narrow, she smiles and grits her teeth and her hands envelope the head of a chorus boy while she parses out the lyrics of female sexual emancipation -- Daddy won't know his daughter indeed.\n\nIt was a sexual call to action that kids understood and responded to. So THIS was what being a teenager would be like! In that moment and the few minutes that followed, even gay boys felt the tops of their heads come off. It's an excitement that doesn't return until the coda: once again A-M is on the runway, but this time any pretense that she is sweet, innocent Kim McAfee has gone -- this is Ann-Margret, and the sexual light and heat of a new star is palpable. Unfortunately, she was almost immediately to become outdated. Within a few years she was a joke in pictures, and had to wait until 1971 and CARNAL KNOWLEDGE to make a 'comeback' -- at the age of 30, no less. She had made the mistake of starting too late, and being too traditional a Hollywood star just when Hollywood decided to do away with stars, at least those that were provokingly lovely.\n\nSo BIRDIE trembled on the edge of a new, harsher era, and those of us who were caught on the cusp of that upheaval feel great affection for the fantasy of rock stars like Birdie, for Sweet Apple High, and for the bouncy, shiny, crisp teenagers we never were."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT4M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2226913561",
        "name": "Bye Bye Birdie",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmQwNjhmZmItOTJhMS00YjFhLWFjZWYtNGMxY2IwMmJkOWQ0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmQwNjhmZmItOTJhMS00YjFhLWFjZWYtNGMxY2IwMmJkOWQ0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T12:58:01Z",
        "url": "https://www.imdb.com/video/vi2226913561/"
    },
    "url": "/title/tt0056891/"
}