{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Heard",
            "url": "/name/nm0001334/"
        },
        {
            "@type": "Person",
            "name": "Daniel Stern",
            "url": "/name/nm0827663/"
        },
        {
            "@type": "Person",
            "name": "Christopher Curry",
            "url": "/name/nm0193061/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13145,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064409/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090685/"
        },
        {
            "@type": "Person",
            "name": "Parnell Hall",
            "url": "/name/nm0355973/"
        },
        {
            "@type": "Person",
            "name": "Shepard Abbott",
            "url": "/name/nm0008055/"
        },
        {
            "@type": "Person",
            "name": "Christopher Curry",
            "url": "/name/nm0193061/"
        }
    ],
    "datePublished": "1984-08-31",
    "description": "A bizarre series of sudden disappearances on the streets of New York City seems to point toward something unsavory living in the sewers.",
    "director": [
        {
            "@type": "Person",
            "name": "Douglas Cheek",
            "url": "/name/nm0154877/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzVlODkxY2YtNTliMC00MmQwLTkzNmQtYzM5ZGNiZDlmNTU4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "hobo,violence,toxic waste,pay phone,splatter comedy",
    "name": "C.H.U.D.",
    "original_info": {
        "id": "C.H.U.D._1984",
        "name": "C.H.U.D.",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RetroRoger"
        },
        "dateCreated": "2004-09-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087015/"
        },
        "name": "Good movie, GREAT commentary track.",
        "reviewBody": "Best exchange of the movie, between Daniel Stern's 'Reverend' character, and John Heard's 'Cooper', after Stern has just rescued Heard from a homeless couple who were transforming into cannibals:\n\nStern: \"You Cooper?\"\n\nHeard: \"Yeah ... who are you?\"\n\nStern: \"I run the soup kitchen ...\"\n\nHeard: \"On Kenman?\"\n\nStern: \"Right ...\"\n\nHeard: \"THANK GOD THEY DELIVER!\"\n\nYou have to see it to appreciate it. The fact that this dialogue was ad-libbed says a lot about the gonzo film-making that produced C.H.U.D.\n\nStory writer Shep Abbott came up with the word, \"CHUD\" during a party with actors Stern and Heard. The trio then brainstormed a movie idea around the word, Abbott wrote up an extreeemely rough draft (he'd never written a screenplay before), and it ended up on the slush pile of producer Andrew Bonime.\n\nBonime tried to get Abbott to polish the script, but was never satisfied with the rewrites (partially due to Abbott's inexperience), and took the screenplay away from Abbott, giving it to writer Parnell Hall.\n\nBonime had picked up the project partially because Abbott could get Daniel Stern and John Heard to star. (Heard and Stern have worked together in a number of movies over the years, including 'Home Alone I & II' and 'The Milagro Beanfield War'.)\n\nThe two actors agreed to work for scale plus a percentage of the profits, but insisted that Christoper Curry be hired to play the part of Police Detective Bosch, and that Douglas Cheek be hired as director. This didn't sit well with Bonime, but he agreed and the movie was produced.\n\nStern and Heard were not happy with what had been done to their friend's original script, and did their own page re-writes and ad-libs, which director Cheek left in the final cut. Bonime insisted that a shower scene with actress Kim Griest be written in, which Stern, Heard, and Cheek still complain about, 17 years later, on the DVD's audio commentary.\n\nHowever, the unedited version of the shower scene (with Griest's body double) appears as an easter egg on the DVD. (From the main menu, click on Extras. At the top of the Extras menu is 'Trailer'. Click the Up button on your remote, and the eyes of the C.H.U.D. in the background will be highlighted. Click Enter, and the 'Unabridged Scene' will play.)\n\nDespite, or perhaps because of, the civil war on the set, C.H.U.D. is a pretty decent horror relic from the 80's. Watch the movie first, then listen to Stern, Heard, Curry, Cheek, and Abbott do a hilarious commentary track. Stern boos and hisses when Parnell Hall's name comes on the screen. You'll find out that most of the cast are wives, sisters, or good friends with Stern and Heard. You'll learn how they wanted the monsters to look, and much more. And they really have fond, funny memories of the film, despite all the turmoil.\n\nAs a counterpoint to their comments, producer Andrew Bonime set up a website, telling his own side of the story.\n\nDon't miss sitcom stars John Goodman and Jay Thomas in bit parts as extremely unlucky cops, during the movie's last half hour. This scene was placed at the end of the movie during its theatrical release, but has been moved to its correct sequence for the DVD.\n\nI rate the movie, 'C.H.U.D.' a 6; with the commentary track running, it's easily an 8 or 9. Best cut-ups since the MST3K 'bots.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0087015/"
}