{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Italia Almirante-Manzini",
            "url": "/name/nm0021935/"
        },
        {
            "@type": "Person",
            "name": "Lidia Quaranta",
            "url": "/name/nm0702894/"
        },
        {
            "@type": "Person",
            "name": "Bartolomeo Pagano",
            "url": "/name/nm0656034/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3717,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054159/"
        },
        {
            "@type": "Person",
            "name": "Gabriele D'Annunzio",
            "url": "/name/nm0195339/"
        },
        {
            "@type": "Person",
            "name": "Titus Livius",
            "url": "/name/nm0515385/"
        },
        {
            "@type": "Person",
            "name": "Giovanni Pastrone",
            "url": "/name/nm0665163/"
        }
    ],
    "datePublished": "1914-05-09",
    "description": "Cabiria is a Roman child when her home is destroyed by a volcano. Sold in Carthage to be sacrificed in a temple, is saved by Fulvio, a Roman spy. But danger lurks, and hatred between Rome and Carthage can only lead to war.",
    "director": [
        {
            "@type": "Person",
            "name": "Giovanni Pastrone",
            "url": "/name/nm0665163/"
        }
    ],
    "duration": "PT2H28M",
    "genre": [
        "Adventure",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGYwZWU2MzMtZGU2My00NWQ1LTlkNDYtYmJjMTAwNWMxYzljXkEyXkFqcGdeQXVyNjg2NjExMzY@._V1_.jpg",
    "keywords": "carthage,slave,moloch,3rd century b.c.,character name as title",
    "name": "Cabiria",
    "original_info": {
        "id": "Cabiria_1914",
        "name": "Cabiria",
        "year": "1914"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "richardchatten"
        },
        "dateCreated": "2016-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0003740/"
        },
        "name": "The Template for the Historical Epic for the Next Half-Century",
        "reviewBody": "Without Gabriele D'Annunzio's florid commentary this film would have been substantially shorter, while the hammy \"silent film\" acting and melodramatic storytelling lags far behind Scandinavian cinema of this period. But technically this super-production from Italy otherwise blazes a colossal trail that plainly led the way for the silent spectacles of Griffith, DeMille and Lang; while the sense of fun of the action scenes (particularly a scene depicting the formation of a human pyramid to scale a wall) anticipates Fairbanks at his jauntiest. \n\nBeginning with the eruption of Mount Etna (and a lot of toppling pillars) the pace never lets up. Next comes a truly hair-raising scene depicting infants cast into the flaming maw of a statue of Moloch (whose Temple - with three round windows that make it's façade resemble the face of an enormous spider - is one of the many deliriously stylised designs that obviously later inspired Lang and others during the early twenties); while later we see Archimedes gleefully incinerating the Roman fleet with history's first death ray during the Siege of Syracuse. Throw in the boisterous crowd scenes and graceful tracking shots director Pastrone innovatively employs throughout (far more elegant than Griffith's work of the same period) and we have the template for the historical epic as it existed for the next half-century.\n\n'Cabiria' also displays a major advance in the use of special effects that marks a decisive break with the trick films of Georges Méliès. Skillful use is made throughout of double exposures to make the action and the locations look even grander in scale than they already are (such as Hannibal crossing the Alps). And there is an additional bonus in the form of an extraordinary dream sequence that anticipates by ten years Walter Ruttmann's 'Falkentraum' sequence in Lang's 'Die Nibelungen'.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0003740/"
}