{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Juanita Brown",
            "url": "/name/nm0113921/"
        },
        {
            "@type": "Person",
            "name": "Erica Gavin",
            "url": "/name/nm0310532/"
        },
        {
            "@type": "Person",
            "name": "Roberta Collins",
            "url": "/name/nm0172646/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2802,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0705279/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0705280/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064409/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Demme",
            "url": "/name/nm0001129/"
        }
    ],
    "datePublished": "1975-06-14",
    "description": "In a women's prison, a group of inmates band together to combat the repressive and abusive policies of the warden and the corrupt prison doctor.",
    "director": [
        {
            "@type": "Person",
            "name": "Jonathan Demme",
            "url": "/name/nm0001129/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Action",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGY2YzliN2ItYzM1MS00MjVlLWFhNDYtODE1NzI2ZjJmYjdjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "women's prison,women in prison,female rear nudity,female frontal nudity,prisoner",
    "name": "Caged Heat",
    "original_info": {
        "id": "Caged Heat_1974",
        "name": "Caged Heat",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bheyer"
        },
        "dateCreated": "2005-02-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071266/"
        },
        "name": "The Biggest Waste of Time Since My Last Blind Date (Harelip, Clubfoot)",
        "reviewBody": "I just purchased \"Caged Heat,\" partly as a result of \"reviews\" that I read, here. Are you people ON drugs, or something? Are YOU substance abusers? All I can say is, AFTER watching it, I GOT ROBBED!!! It cost me $13.24 to buy the DVD, I feel like using it as a frisbee, now! WHAT, you get the distinct impression I didn't like the movie? Let me put it like THIS: If Ed Wood's, \"Plan 9 From Outer Space,\" were pitted against Jonathan Demme's, \"Caged Heat,\" for Best Picture of the Year, Ed Wood would walk off with the statuette, with Bela Lugosi on one arm, and Tor Johnson on the other! I don't care IF Leonard Maltin gave \"Caged Heat\" two-and-a-half stars, in his Movie & Video Guide. In the Special Features portion of the DVD, Maltin interviews the legendary Roger Corman (he refused to finance \"Caged Heat,\" but he did distribute it), and Maltin kisses his posterior, up-one-side-and-down-the-other! Folks, I'm here to tell you that Leonard Maltin is a whore! IF you want to learn about BAD acting, BAD writing, BAD directing, BAD production values, BAD musical scoring, BAD sound, BAD cinematography, BAD costumes (WHAT costumes, the prison inmates ALL wear civilian clothes!) and BAD everything else, BUY or RENT (RENT is better!), \"Caged Heat.\" I absolutely LOVE (ADORE!!!) Barbara Steele (she plays Warden McQueen), but she embarrassed herself by appearing in this insane piece of crud! NO STARS!!!"
    },
    "url": "/title/tt0071266/"
}