{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michel Camilo",
            "url": "/name/nm0131830/"
        },
        {
            "@type": "Person",
            "name": "Tito Puente",
            "url": "/name/nm0005328/"
        },
        {
            "@type": "Person",
            "name": "Arturo O'Farrill",
            "url": "/name/nm1027176/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 804,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079103/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0081420/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0164028/"
        },
        {
            "@type": "Person",
            "name": "Fernando Trueba",
            "url": "/name/nm0874096/"
        }
    ],
    "datePublished": "2000-10-06",
    "description": "A film featuring performances of several stars of the Latin Jazz music scene.",
    "director": [
        {
            "@type": "Person",
            "name": "Fernando Trueba",
            "url": "/name/nm0874096/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIzMjUyNTQ5MF5BMl5BanBnXkFtZTcwNDE1NTAzMQ@@._V1_.jpg",
    "keywords": "jazz,performance,session,new jersey,latina",
    "name": "Calle 54",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "khatcher-2"
        },
        "dateCreated": "2002-01-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0260775/"
        },
        "name": "Enchanting, bewitching, enthralling, fascinating",
        "reviewBody": "I have not enjoyed a music film so much since `West Side Story'. Basically my musical preferences reside in classical music, but not at the cost of excluding other kinds. Such that in my collection of records and CDs I have music from Tomás Luis de Victoria to Vangelis. And a little jazz: not much, it is true, but the likes of Miles Davis or Dizzy Gillespie did not pass through this world unnoticed. Whereas I can sit through an opera or even 100 minutes of `Le Grande Messe des Morts' by Hector Berlioz, I tend to take certain kinds of music  such as jazz  in smaller doses, so that I do not get tired of it. Paco de Lucía, Janis Joplin, Dave Brubeck, John McLaughlin's Friday Night in San Francisco . Fine: but not more than about 30-40 minutes. \n\nSo I was a little worried about sitting through 100 minutes of `Calle 54'. On the one hand, I do not mind watching an opera, though preferably when listening to the great classics I am at home with my own equipment; but on the other, I love WATCHING jazz musicians! They seem to be having such a great time! You grunted along with Garner, thrilled at Armstrong when he got his trumpet going, and you felt the vibes the same as they did.\n\nFernando Trueba is a bit like me: you do not listen to music with your ears; you feel it with the whole of your body. At home I often get up and take a little stick and conduct the record I am listening to. Other people dance to music. I don't: I have to feel the music and make out I am directing the orchestra! \n\n`Calle 54' is a pure joy from start to finish. It's a feast for the eyes and ears and all the adrenalin and corpuscles, which race around up and down finger-fired keyboards and sensual saxes, and throbbing with batteries and pulsing double-bases. And then there is the camera-work: six of them always on the move, closing in, panning out, every kind of imaginable angle, focussing on fingers caressing chords or dancing over sax and piano keys or following the sticks up and down the xylophone and then the miraculous task of editing all that, piecing all six together. Carmen Frías has done a wonderful job, indeed. And she declares she was not even a knowledgeable person in the world of jazz! Virtually all of it was from first takes; practically nothing was later `doctored': thus it all came out hot, just as it should be heard, not nicely rehearsed and then sewn together such that afterwards that would be what it would sound like  rehearsed and sewn together. \n\nThis Latin version of Afro-American jazz is an impressive document; from Río and Cuba and Puerto Rico, from Cádiz and Sweden to New York, Fernando Trueba has pieced together this delicious, delightful `concert', a real treat, a once-and-forever: some of the musicians taking part, like Tito Puente, have since died. Am I glad Sr. Trueba got in there in time to bring us this invigorating gem!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Miramax",
        "duration": "PT49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3102645785",
        "name": "Calle 54",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTJiZTI3MDctM2VlYS00MmI0LTliZmMtMjMwODc4NmU4Yjg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTJiZTI3MDctM2VlYS00MmI0LTliZmMtMjMwODc4NmU4Yjg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:12:03Z",
        "url": "https://www.imdb.com/video/vi3102645785/"
    },
    "url": "/title/tt0260775/"
}