{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clark Gable",
            "url": "/name/nm0000022/"
        },
        {
            "@type": "Person",
            "name": "Loretta Young",
            "url": "/name/nm0949835/"
        },
        {
            "@type": "Person",
            "name": "Jack Oakie",
            "url": "/name/nm0642988/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2323,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "Call of the Wild",
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067247/"
        },
        {
            "@type": "Person",
            "name": "Jack London",
            "url": "/name/nm0518711/"
        },
        {
            "@type": "Person",
            "name": "Gene Fowler",
            "url": "/name/nm0288706/"
        },
        {
            "@type": "Person",
            "name": "Leonard Praskins",
            "url": "/name/nm0695292/"
        }
    ],
    "datePublished": "1935-08-09",
    "description": "During the Klondike Gold Rush, a traveler purchases a dog to lead the way toward the treasure, but reconsiders his journey when he finds a jilted married woman.",
    "director": [
        {
            "@type": "Person",
            "name": "William A. Wellman",
            "url": "/name/nm0920074/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk5MzI5MzE2NF5BMl5BanBnXkFtZTgwNzE5Njc0MjE@._V1_.jpg",
    "keywords": "held at gunpoint,dog,beans",
    "name": "The Call of the Wild",
    "original_info": {
        "id": "Call of the Wild_1972",
        "name": "Call of the Wild",
        "year": "1972"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "barnabyrudge"
        },
        "dateCreated": "2006-05-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0026164/"
        },
        "name": "Adaptation of a classic novel which rather ignores its source material. Still, an enjoyable and agreeable adventure.",
        "reviewBody": "Jack London's novel The Call Of The Wild is pretty much ignored in this 1935 adaptation. The title remains the same and there IS a dog named Buck involved in parts of the action, but apart from that the similarities are virtually non-existent. Far greater emphasis is placed on the human characters in the film than in the book. One has to assume that the film was written as a vehicle for Clark Gable, a big outdoor adventure yarn in which the star could get in to and out of a variety of hair-raising escapades in the frozen wilderness. The fact that London's novel is essentially an animal story with a few human characters passing through the narrative is of little significance to scripter Gene Fowler and director William Wellman. That's not to say The Call Of The Wild is a disposable film; the unusual and expensive decision to film on genuinely cold, mountainous locations (Washington state standing in for Yukon) shows that this was envisaged as a serious box office winner.\n\nStruggling gold prospector Jack Thornton (Gable) and his goofy sidekick Shorty Hooliham (Jack Oakie) travel around the Yukon in the 19th Century, searching for an elusive gold strike that will make them richer than rich. They are helped in their adventures by a St Bernard dog named Buck. Also busily scouring the land for gold is the sinister English-man Smith (Reginald Owen), a cruel rival who has a mysterious past and even a little history with Thornton's dog. During their wanderings, Jack and Shorty come across a woman called Claire Blake (Loretta Young) whose husband has gone missing in the snowfields and could be dead. Claire teams up with Jack, Shorty and Buck, but it isn't long before she finds herself falling for Thornton's roguish charm, even though she cannot be sure if her husband is dead or alive.\n\nThe movie is very enjoyable in its old-fashioned way. I'm a believer in the theory that films should try to be faithful to their source material, at least to a reasonable extent, so in some ways I felt dismayed at the lack of respect towards London's original story. However, once I'd got that small irritation out of my system I found The Call Of The Wild a perfectly likable star vehicle. Gable is solid in a role that asks little of him other than to appear rugged and fearless. Owen is very good as the villain of the piece, while Young shares a good chemistry with the hero (in real-life, she and Gable were lovers). Jack Oakie is the least impressive of the key actors, mugging rather embarrassingly as the inevitable comical sidekick. The location work in Washington state adds a sense of authenticity to the film that is very uncommon for a movie made in the studio-bound '30s. On the negative side, though, the film settles for a very convenient ending which ditches plausibility so that the course of true love and personal success can run smoothly (indeed, IMPROBABLY smoothly) for the main protagonists. Of its type and era, however, The Call Of The Wild is watchable and entertaining fare.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "During the Klondike Gold Rush, a traveler purchases a dog to lead the way toward the treasure, but reconsiders his journey when he finds a jilted married woman.",
        "duration": "PT1M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2603598617",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmZmOGFjZWItYmNiMy00NDNiLWI3MmEtZDBkZDczOGEyZTRmXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmZmOGFjZWItYmNiMy00NDNiLWI3MmEtZDBkZDczOGEyZTRmXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-19T20:08:55.315Z",
        "url": "https://www.imdb.com/video/vi2603598617/"
    },
    "url": "/title/tt0026164/"
}