{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ray Simpson",
            "url": "/name/nm0801163/"
        },
        {
            "@type": "Person",
            "name": "David Hodo",
            "url": "/name/nm0388317/"
        },
        {
            "@type": "Person",
            "name": "Felipe Rose",
            "url": "/name/nm0741377/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4245,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103338/"
        },
        {
            "@type": "Person",
            "name": "Bronte Woodard",
            "url": "/name/nm0940125/"
        },
        {
            "@type": "Person",
            "name": "Allan Carr",
            "url": "/name/nm0139591/"
        }
    ],
    "datePublished": "1980-06-20",
    "description": "A pseudo autobiography of disco's The Village People.",
    "director": [
        {
            "@type": "Person",
            "name": "Nancy Walker",
            "url": "/name/nm0908055/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Biography",
        "Comedy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjlhNzQ1NDItM2RlYy00NjNjLThhYjktYjU4MTQwYzg1OTkxL2ltYWdlXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "male full frontal nudity,disco,swimming pool,tax lawyer,dancer",
    "name": "Can't Stop the Music",
    "original_info": {
        "id": "Can't Stop the Music_1980",
        "name": "Can't Stop the Music",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2006-04-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080492/"
        },
        "name": "So horrible that it's GREAT",
        "reviewBody": "This movie is amazing!! Rarely in the history of mankind have we seen a movie so incredibly awful that it becomes a \"must-see film\". And, interestingly enough, this film is one of four from 1979-1980 that I have reviewed that all fall into this same category. To what do we owe this honor? Well, 1979-1980, for those of you who are blessed to be too young to remember it, was time of the last gasp of disco AND the short-lived roller-disco craze. And, all four horrible movies I strongly recommend are so bad, so stupid, so over-the-top bad that they are truly must-see films for bad movie fans. So here is my list of the unholy 4--XANADU, ROLLER BOOGIE, THE APPLE and CAN'T STOP THE MUSIC. All four are chock full of disco as well as crappy dialog and minimal production values. My vote for most awful of these is the sci-fi, disco, religious epic THE APPLE, but any of the four is strongly recommended for a good laugh! \n\nNow, for the specifics on CAN'T STOP THE MUSIC--which, when you watch it you may want to re-name \"CAN'T STOP THE RETCHING\". Back in 1980, the least well-kept secret in America was the fact that the Village People were gay. Believe it or not, many Americans who loved their music lived in complete denial that these were six gay men from Greenwich Village. Well, all doubt and ambiguity is erased in this film! While a few times in the movie, the ultra-horny character, Lulu, makes very clumsy passes at these guys, the long, over-the-top and strongly homo-erotic music videos within the movie make it obvious these men were quite gay--and this is especially true of their rendition of YMCA--which looks sort of like a gay version of Heaven. In fact, the campiness of the movie is sort of like a combination of Liberace with gay disco--with the most flamboyant and silly sets and costumes you'll see outside of a gay pride march. BUT, despite the singing being so incredibly overdone and campy, it actually works in some cases as you'll probably find yourself tapping your feet and getting into the songs--or at least some of them. They are BAD, yes, but still kinda fun at the same time. The final song, CAN'T STOP THE MUSIC, initially is very catchy as well, but goes on and on and on and on until you are nearly ready to go berserk! \n\nSo, if the music is strange but not THAT bad, why did I give the movie a 2? Well, that's because when they are not singing, the members of The Village People have very little to say and absolutely no charisma because they are not actors. So, they fill in this gap by having real actors(?) do almost all the dialog. And, for the most part, they assembled the absolute worst actors Hollywood had to offer!! So, the main problem with the movie rests not on the Village People but on everything else about the movie!! To help illustrate HOW bad the acting is, one of the big \"stars\" for the movie is a very young and obnoxious Steve Guttenburg! He is assisted by the pleasantly built but incredibly bland Valerie Perrine and the ultra-wooden Bruce Jenner!!! This movie, in fact, single-handedly ruined Jenner's bid to become a serious actor, as he had all the personality and chemistry of Mr. Potatohead.\n\nNow, so far this movie offers us one music video after another (many with very gay visuals that will make a few uncomfortable but most just laugh), horrible acting and dialog, a dopey story and wretched direction by Nancy Walker (yes, the Bounty commercial woman). And, when you put them all together you have a movie that is even worse than a sum of all its parts--so bad, that you'll most likely laugh yourself silly and have great time making fun of the ineptness of the film. Call some friends and make this the party film you all won't soon forget!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT3M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1689960217",
        "name": "Can't Stop the Music",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzA3NjFhYzgtMGFjZC00MzlmLWFhZmQtYmRmZGI1MDFmMDRkXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzA3NjFhYzgtMGFjZC00MzlmLWFhZmQtYmRmZGI1MDFmMDRkXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-30T17:10:50.083Z",
        "url": "https://www.imdb.com/video/vi1689960217/"
    },
    "url": "/title/tt0080492/"
}