{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ewa Aulin",
            "url": "/name/nm0042046/"
        },
        {
            "@type": "Person",
            "name": "Richard Burton",
            "url": "/name/nm0000009/"
        },
        {
            "@type": "Person",
            "name": "Charles Aznavour",
            "url": "/name/nm0002198/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3340,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021927/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042129/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002839/"
        },
        {
            "@type": "Person",
            "name": "Buck Henry",
            "url": "/name/nm0377750/"
        },
        {
            "@type": "Person",
            "name": "Terry Southern",
            "url": "/name/nm0816143/"
        },
        {
            "@type": "Person",
            "name": "Mason Hoffenberg",
            "url": "/name/nm1014991/"
        }
    ],
    "datePublished": "1968-12-17",
    "description": "Candy Christian, an innocent high-schooler, encounters numerous colorful characters and humorous sexual situations while attempting to find meaning in life.",
    "director": [
        {
            "@type": "Person",
            "name": "Christian Marquand",
            "url": "/name/nm0549650/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Adventure",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDUzYzYyNDYtNWQ3YS00YTAwLTliZGQtOGIxOWQ4MjA5ZDk3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "naive girl,seduction,sex on a pool table,voyeur,farce",
    "name": "Candy",
    "original_info": {
        "id": "Candy_1968",
        "name": "Candy",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "deheor"
        },
        "dateCreated": "2005-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062776/"
        },
        "name": "Good grief, why haven't you watched this yet?",
        "reviewBody": "There was a beautiful brief moment in cinema history when film makers freed themselves of the shackles of form and found fun, exciting ways to tell stories. Movies became groovy mind-blowing experiences that forced the viewer to follow the plot as it tripped all over the screen. Unfortunately Jaws came along and reminded the studios of how much money they could be making and the experiment was declared a failure. But during this brief period such wonderful and largely buried treasures as Beyond the Valley of the Dolls, Myra Breckenridge, Magic Christian and Vanishing Point (only Easy Rider seems to have survived the era with its reputation in tact) were created and have since been embraced by the odd as their own. But perhaps the most reviled of the lot has been the film Candy.\n\nCandy tells the simple tale of a sweet young thing that goes out into the world to grow but finds herself confronted at every turn by typical male stereotypes (played by some of the biggest stars of the day) who really only have one goal in mind. Along the way she meets up with the artist (Richard Burton), the soldier (Walter Matthau), the healer (James Coburn) and the guru (Marlon Brando) among others. Candy wants to free her mind but each man tries (and some succeed) to free her of her panties. Despite the premise Candy is more like a teasing Roger Vadim film (think Barbarella) and the nudity is kept to an absolute minimum. The biggest surprise is even with the big name cast, the films best performance belongs to John Astin as Candy's Father and also as her lecherous Uncle who has his own designs on her. The supporting cast is definitely one of the films high points along with the terrific score that features some trippy space tunes along with classic rock. Sadly there are some faults though.\n\nThe script by Buck Henry is very hit and miss with some excellent lines immediately followed by many that just produce cringes in the audience. The lead actress Ewa Aulin is lovely to look at but delivers all of her lines like she has just learned them phonetically and has no idea what she is saying and the directer allows the pace to drag at many points.\n\nStill if the films from this era interests you than this one should be required viewing. There is an excellent DVD available so there is no excuses for passing on this under-rated gem.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Candy Christian, an innocent high-schooler, encounters numerous colorful characters and humorous sexual situations while attempting to find meaning in life.",
        "duration": "PT2M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi227263257",
        "name": "Teaser Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODdiODcyNDUtM2YyYi00Y2M3LTgyNTctMjRiMGI5NGY3ZjMyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODdiODcyNDUtM2YyYi00Y2M3LTgyNTctMjRiMGI5NGY3ZjMyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-25T00:20:47.094Z",
        "url": "https://www.imdb.com/video/vi227263257/"
    },
    "url": "/title/tt0062776/"
}