{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Allen Funt",
            "url": "/name/nm0298793/"
        },
        {
            "@type": "Person",
            "name": "Peter Funt",
            "url": "/name/nm0298794/"
        },
        {
            "@type": "Person",
            "name": "Muhammad Ali",
            "url": "/name/nm0000738/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Allen Funt",
            "url": "/name/nm0298793/"
        }
    ],
    "datePublished": "2005-08-02",
    "description": "Ten disc collection of the long running grandfather of all reality shows. From Allen Funt's first show in 1948 to the latest shows hosted by his son Peter. Also includes a new collection of 'Greatest Moments'.",
    "duration": "PT23H",
    "genre": [
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmJjMjJhYjMtMDU5Yy00ODBlLWI2ZTctZDJhZmQwZWJmYzEwXkEyXkFqcGdeQXVyMTMxNTcwNzI@._V1_.jpg",
    "name": "Candid Camera: 5 Decades of Smiles",
    "original_info": {
        "id": "Candide_2005",
        "name": "Candide",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rochelle-rochelle"
        },
        "dateCreated": "2008-07-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0807708/"
        },
        "name": "Boring, predictable and a waste of time",
        "reviewBody": "This DVD is merely clips of candid camera moments over the years, but we don't see any full episodes. We see maybe one or two victims of the prank, but we don't see full footage. Nor do we hear the famous \"smile, you're on candid camera\" that we have come to love and enjoy seeing over the years. The move onto the next clip before pointing out the hidden camera to the victims.\n\nAllen Funt puts his \"favorites\" of the entire series on disc one and then the other discs are \"favorites\" from each decade. The discs for the 50's, 60's and 70's are quite boring and the \"celebrities\" they had participating may have been famous at the time, but anyone born after 1970 would not remember or know who they were so the prank means nothing.\n\nMost of the clips are so edited that we don't see the set up or downfall of the joke. We see the prank but we don't see the victim finding out it was a joke. That's the best part of the prank if you ask me - the victim's reaction to the prank - but most of these DVDs don't include that part.\n\nThis DVD set is not worth the money. I got my full set from my local library for FREE, which is good because I would have regretted paying money for it. If you want to see it, get it from your local library. Don't buy it or rent it from netflix or blockbuster. It's not worth it.\n\nI give it four stars out of 10.\n\n4/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0807708/"
}