{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Carradine",
            "url": "/name/nm0001016/"
        },
        {
            "@type": "Person",
            "name": "Bill McKinney",
            "url": "/name/nm0571853/"
        },
        {
            "@type": "Person",
            "name": "Veronica Hamel",
            "url": "/name/nm0357557/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4876,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0383812/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0128798/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029124/"
        },
        {
            "@type": "Person",
            "name": "Paul Bartel",
            "url": "/name/nm0000860/"
        },
        {
            "@type": "Person",
            "name": "Don Simpson",
            "url": "/name/nm0800971/"
        }
    ],
    "datePublished": "1976-09-08",
    "description": "Racing across the country from L.A. to New York, a plethora of exotic cars carry contestants hoping to win a very large sum.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Bartel",
            "url": "/name/nm0000860/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTY0ZDNiNzgtNGM3OS00NTI2LWEyYTYtOTU2MzJkYmE4MjJkXkEyXkFqcGdeQXVyMzEwMDM2NDE@._V1_.jpg",
    "keywords": "on the road,car racing,road movie,illegal grand prix race,character name as title",
    "name": "Cannonball",
    "original_info": {
        "id": "Cannonball_1976",
        "name": "Cannonball",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Craig JS"
        },
        "dateCreated": "1999-09-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074279/"
        },
        "name": "New meaning to the term \"Put your brain in Neutral\"",
        "reviewBody": "Cannonball.\n\nThe movie that broke the dam and started a flood of films revolving around illegal coast to coast car races, really isn't half bad. That is so long as you don't forget its a B grade film. There are moments during it's one and half hours of engine revving running time that you are could be duped into thinking that the film makers had something higher purpose in mind they fleshed out the script on an empty pizza box to this masterpiece. The opening scene (a dream scene no less) just oozes style and stinks and I mean that in a (it reeks like gym socks kind of a way) of finesse. It comes complete with a cryptic voice over and a heart beat soundtrack...enthralling.\n\nDavid Carradine plays the titular Cannonball. He's the strong silent type with a dodgy past, he's out to win the Trans American to get his life back on track, after spending some time in the slammer for a crime he didn't commit. In what 70's film didn't he play this guy? There's your token bad guy complete with a black Dodge Charger that is looking to do him (being titular Cannonball) in at any cost. Why? Because you can't have a movie like this with out a bad guy. Its like sex with out the wet patch, they come hand in hand.\n\nMade in that 70's dirty \"we couldn't afford to buy better film\" style that is normally reserved for Porn films and early sword and sorcery flicks the film makers have covered off all the stereotypes that we have come to know and love from these kinds of movies. We have a European with an exotic car, a couple of girls in a car going fast and wearing little, a ethnic minority character with little luck when it comes to cars or women. The a fore mentioned brooding anti-hero good guy type, the maniacal bad guy and a host of token others that matter little to the grand scheme of things, oh and of course more than its fair share of stupid cops. \n\nThe real stars of this movie however are the cars, let's be honest it's the only reason this movie was made. A showcase of some of the most popular American and a token European muscle car, ever to make their way on to the road. Let us review; Dodge Charger, Trans Am's (must be popular because there are two of them), a Corvette, Mustangs and all the hotted up customs you could ever want. They are all thrown though their paces but though the budget prevented any real fancy camera work really show off their moves. However there is some really decent action sequences here, that exceed the movie's standing as an the aforementioned 'we couldn't afford to buy better film' and make it memorable even by today's blockbuster standards. The highlights to look for, the massive car pile up on the interstate towards the end and the trashing of the Detomaso Pantera. So as you can imagine there's enough car carnage to make even the most Blues Brother hardened fan giddy with excitement. \n\nTo sum up, Cannonball is a bit of Tuesday night fun and to be enjoyed at its best, watched with a few friends and some strong liquor. Don't for get to look for Martin Scorsese and Sylvester Stallone in early cameo roles.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Racing across the country from L.A. to New York, a plethora of exotic cars carry contestants hoping to win a very large sum.",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3051012889",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzExOGYyMDMtOWE3Ni00NjczLWE0OWQtNzA0M2NmZWNjZjBkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzExOGYyMDMtOWE3Ni00NjczLWE0OWQtNzA0M2NmZWNjZjBkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-12-02T15:31:21.227Z",
        "url": "https://www.imdb.com/video/vi3051012889/"
    },
    "url": "/title/tt0074279/"
}