{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shannon Tweed",
            "url": "/name/nm0000238/"
        },
        {
            "@type": "Person",
            "name": "Bill Maher",
            "url": "/name/nm0005175/"
        },
        {
            "@type": "Person",
            "name": "Karen M. Waldron",
            "url": "/name/nm0592960/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3251,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056903/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022018/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070670/"
        },
        {
            "@type": "Person",
            "name": "J.F. Lawton",
            "url": "/name/nm0493369/"
        }
    ],
    "datePublished": "1989-03-15",
    "description": "The U.S. government, eager to protect the nation's avocado supplies, recruits feminist professor Margo Hunt to make contact with the Piranha Women, an all-female tribe who believe men are only good as a source of food.",
    "director": [
        {
            "@type": "Person",
            "name": "J.F. Lawton",
            "url": "/name/nm0493369/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzNjZThlZjItOGE2ZS00ZjZhLTlkOWYtMmExNzQ0ZjNkNzMyXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "female nudity,cannibal,voyeur,wedding dress,breasts",
    "name": "Cannibal Women in the Avocado Jungle of Death",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Hey_Sweden"
        },
        "dateCreated": "2016-08-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094834/"
        },
        "name": "\"Oh, my God, you're marinating me!\"",
        "reviewBody": "Provided that prospective viewers know what they're in for, \"Cannibal Women in the Avocado Jungle of Death\" can be a fun and reasonably intelligent movie. They should know up front that it goes for a campy approach, not a sleazy one, and it's lightly entertaining, even interesting. Don't expect any nudity (although there are plenty of sexily clad women and men) or on screen violence. Now, if you're still reading, you may actually find yourself laughing on more than one occasion at this fairly pointed script (by writer / director J.F. Lawton, who went on to write \"Pretty Woman\" and \"Under Siege\") and the lively, amiable performances.\n\nIt basically satirizes gender politics (while also parodying Joseph Conrads' \"Heart of Darkness\") in a yarn about feminist professor Margo Hunt (blonde bombshell Shannon Tweed), hired by the U.S. government to infiltrate a large section of California \"jungle\" and deal with a primitive tribe of females known as the Piranha women. These Amazonian type babes are in the habit of eating their male counterparts after having sex with them. Before making her trek into the jungle, Margo brings along an airhead student of hers, Bunny (Karen M. Waldron, \"Return of the Killer Tomatoes\") and hires a useless, Indiana Jones wannabe named Jim (comedian / political commentator Bill Maher), who it just so happens was a long ago one night stand of hers, as a guide.\n\nSome viewers will likely think that Lawton is simply too focused on making statements instead of making the movie fun, and in truth, the movie is, as I said, fairly light entertainment. But the jibes in the screenplay are regularly amusing, and Lawton makes sure to take shots at both sexes. Maher is very funny as an obnoxious chauvinist who is taken aback by a male tribe that behave in a very non-stereotypical manner for guys. He goes so far as to teach them about beer and hitting on women. Tweed is a very good straight woman here; if anybody is in any doubt about her having actual acting ability, they need only watch her here. Waldron is cute and adorable. Brett Stimely is likable as the studly Jean-Pierre, Barry Primus makes a guest appearance as the conniving Ford Maddox, and Adrienne Barbeau adds further value with her bright performance as the feminist author who's assumed command of the warrior women.\n\nThis is, overall, a nice diversion for an hour and a half.\n\nSeven out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4268539929",
        "name": "Trailer [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTMwN2EyZGEtYzEzNi00NmVmLTlmMzEtZjUyMjgyY2MyYzAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTMwN2EyZGEtYzEzNi00NmVmLTlmMzEtZjUyMjgyY2MyYzAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-08-09T22:57:42.669Z",
        "url": "https://www.imdb.com/video/vi4268539929/"
    },
    "url": "/title/tt0094834/"
}