{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gregory Peck",
            "url": "/name/nm0000060/"
        },
        {
            "@type": "Person",
            "name": "Robert Mitchum",
            "url": "/name/nm0000053/"
        },
        {
            "@type": "Person",
            "name": "Polly Bergen",
            "url": "/name/nm0000917/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 30167,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0536884/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018747/"
        },
        {
            "@type": "Person",
            "name": "John D. MacDonald",
            "url": "/name/nm0531792/"
        },
        {
            "@type": "Person",
            "name": "James R. Webb",
            "url": "/name/nm0916139/"
        }
    ],
    "datePublished": "1962-06-15",
    "description": "A lawyer's family is stalked by a man he once helped put in jail.",
    "director": [
        {
            "@type": "Person",
            "name": "J. Lee Thompson",
            "url": "/name/nm0496746/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWNlMTJmMWUtYjk0MC00M2U4LWI1ODItZDgxNDZiODFmNjc5XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "neo noir,family in jeopardy,small town,stalking,psychopath",
    "name": "Cape Fear",
    "original_info": {
        "id": "Cape Fear_1962",
        "name": "Cape Fear",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055824/"
        },
        "name": "Good drama made great by an excellent Mitchum",
        "reviewBody": "Sam Bowden is a lawyer who, eight years ago, acted as a witness against Max Cady to put him behind bars. Released from prison, Cady has studied the law and is set on terrorising the Bowdens without actually overstepping his legal rights. As Cady toes the line with increasingly worrying results, Browden begins to cross the line to deal with him and protect his family.\n\nHaving seen the remake first I wanted to go back and see it done originally. My first impression was that the remake had done some elements better than this. For example Nolte's lawyer is a lot less clean-cut than Pecks'. Also the sexual threat to the daughter is a lot more played out in the remake. Getting past this I saw how this was actually a better film in many ways. As a drama it moves along at a good pace  not jumping from one thrill to the next but not dragging either.\n\nThe film can only hint at the deeds of Cady because of the censors but it is clear even to the blind that Cady is a monster. This ups the tension as everything is slowly build to and we don't get a bloody or sexually shocking scene as a pay-off, no, here the tension is build on top of other tension. The direction is good, giving a dark feel to the look of the film as well as hinting constantly. Even if some of the thrills are signposted it still works well.\n\nHowever, without Mitchum's performance this would be a very different film. With the help of De Niro's sneer or menacing tattoos, he is still a better Cady. He is on top form  where De Niro wore his threat large, Mitchum hints at it under a veneer of casual disinterest, making the threat seem bigger when he acts. Peck is good even if his character is too clean-cut when he should have been pushed further over the line for my tastes. Bergen doesn't have much to do, but her final scene with Mitchum is powerful and she really lets rip. Martin is perfectly cast  she looks like a child but also is `developed' enough to be a sexual role for Mitchum to prey on. It is easy to watch her as Mitchum closes in on her, almost licking his lips, but that's the power of the film.\n\nOverall this manages to be powerful and thrilling despite the censors and is a really good drama. However it is totally carried by a monstrous yet subtle performance by Mitchum. De Niro was good in the role but once you've seen this you'll realise that menace can be acted subtly and not just by sneering and getting tonnes of tattoos."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3422731801",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjZkZWMxZTEtNzlkMi00M2M1LTk1MmItODE3ODlkZmRkMjFhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjZkZWMxZTEtNzlkMi00M2M1LTk1MmItODE3ODlkZmRkMjFhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-07T20:13:57.454Z",
        "url": "https://www.imdb.com/video/vi3422731801/"
    },
    "url": "/title/tt0055824/"
}