{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvia Anderson",
            "url": "/name/nm0027487/"
        },
        {
            "@type": "Person",
            "name": "Ed Bishop",
            "url": "/name/nm0084042/"
        },
        {
            "@type": "Person",
            "name": "Donald Gray",
            "url": "/name/nm0336579/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1754,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103353/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103220/"
        },
        {
            "@type": "Person",
            "name": "Gerry Anderson",
            "url": "/name/nm0026755/"
        },
        {
            "@type": "Person",
            "name": "Sylvia Anderson",
            "url": "/name/nm0027487/"
        }
    ],
    "datePublished": "1967-09-29",
    "description": "In 2068, the indestructible Captain Scarlet leads the agents of Spectrum in a war of nerves against the Mysterons from Mars.",
    "genre": [
        "Animation",
        "Action",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTk0NzU3MjUtNGEyZC00NDk4LWE2MTEtNmI4YzU1MmFkMmI3XkEyXkFqcGdeQXVyNDA3MDAwOQ@@._V1_.jpg",
    "keywords": "colonel,mars the planet,traitor,murder,extraterrestrial",
    "name": "Captain Scarlet and the Mysterons",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mikerichards"
        },
        "dateCreated": "2001-09-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059973/"
        },
        "name": "They don't make them like this any more",
        "reviewBody": "Perhaps an entire generation was scarred by the voices of the Mysterons - between them and the Daleks I spent a good part of my childhood hiding behind the sofa. It was certainly a golden age for children with the prodigious talents of Gerry Anderson ensuring a constant stream of spectacular programmes for after school entertainment.\n\n'Captain Scarlet' was a follow-on to the immensely successful 'Thunderbirds', and whilst technically superior it never achieved the same level of popularity. Why? I think the answer lies in 'Captain Scarlet' being a darker production, sometime after 'Thunderbirds' Gerry Anderson seems to have lost a lot of his faith in humanity. The Mysteron conflict is started by human stupidity. Technology goes horribly wrong - and this time people die as a consequence.\n\nOr maybe it's just unpopular because the theme music isn't anywhere as catchy.\n\nStorywise, well there is a common plot. The Mysterons kindly inform Earth of their latest plan by means of a cryptic clue, (obviously they are a race of frustrated Martian crossword compilers). Shortly afterwards they use their patented replication technology to make a copy of a person who then goes about fulfilling the Mysteron plans; think 'Invasion of the Bodysnatchers' remade for kids. The Mysteron chief agent on Earth was the creepy Captain Black who desperately needed a shave and somehow managed to escape every week. It's all up to Captain Scarlet and his colour-coordinated sidekicks to save the day in a nuclear-powered, high-rise, high-speed world.\n\nIt is clear that Gerry Anderson was just itching to move into live-action television (something he would achieve with the later 'UFO'), and was running into the limitations of puppets. Whilst technical advances between 'Thunderbirds' and 'Captain Scarlet' meant that it was possible to produce anatomically correctly proportioned puppets; string puppets could not be made to walk convincingly. So 'Captain Scarlet' is filled with shots of sitting people, moving walkways or head and shoulder shots. The use of much thinner strings on the puppets and insert shots for hands helps sell the illusion.\n\nIn the end the weaknesses don't matter. The Century 21 team had established the formula with 'Thunderbirds'. Mix some high speed chases, a perilous situation for the heroes and end it all with a satisfying explosion or two and you can ensure that 25 minutes whip past before anyone can nit-pick.\n\nLike any Anderson production, the story used a lavish number of models and sets (almost all of which ended up in ruins by the end of the programme). Many of them are now classics - the SPV tank and the futuristic Spectrum Patrol Car were lovingly moulded into die-cast toys and were repeatedly crashed in living rooms around the country. If anyone has mine, please let me know! As always the special effects were of the very highest standard (many of the people involved went on to work with Kubrick on '2001') and still look good today.\n\nRe-watching the programme, one thing I found particularly striking were the strong roles given to women characters people who weren't British or American. Spectrum agents are a mix of all nationalities and ethnicities, apparently Anderson wanted children of all races to have heroes and learn to play together - not a bad aim for the 1960s and something that more programmes could remember.\n\nLooking at it today, 'Captain Scarlet' has survived much better than most programming of the era. Produced on a lavish budget and shot on film, it has been digitally remastered for re-broadcast and DVD and positively glows. Somehow the colours look richer than modern productions and the storytelling doesn't appear to be designed for the very stupid. Even down to the classic retro-futuristic fonts and the wonderful Century 21 logo it still looks modern.\n\nIn short, I still love it.\n\nAs they used to say at the end of each show; Captain Scarlet is indestructible. You are not. Remember this, do not try to imitate him."
    },
    "url": "/title/tt0059973/"
}