{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Johansen",
            "url": "/name/nm0423774/"
        },
        {
            "@type": "Person",
            "name": "John C. McGinley",
            "url": "/name/nm0001525/"
        },
        {
            "@type": "Person",
            "name": "Fran Drescher",
            "url": "/name/nm0000376/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4497,
        "ratingValue": 2.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001995/"
        },
        {
            "@type": "Person",
            "name": "Nat Hiken",
            "url": "/name/nm0383733/"
        },
        {
            "@type": "Person",
            "name": "Erik Tarloff",
            "url": "/name/nm0850513/"
        },
        {
            "@type": "Person",
            "name": "Ebbe Roe Smith",
            "url": "/name/nm0808076/"
        }
    ],
    "datePublished": "1994-01-28",
    "description": "Brash NYC policeman Officer Gunther Toody is partnered with stiff, by-the-book Officer Francis Muldoon to protect an important mafia witness prior to testifying against orgainzed crime in Brooklyn, all the while dealing with their...",
    "director": [
        {
            "@type": "Person",
            "name": "Bill Fishman",
            "url": "/name/nm0279863/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmE1YzZmNzgtYjI2NC00MjI2LTk3MWItODMwZjBlOTU0YWY5XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
    "keywords": "slimehouse,law enforcer,question in title,police officer,police",
    "name": "Car 54, Where Are You?",
    "original_info": {
        "id": "Car 54_1994",
        "name": "Car 54",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Qanqor"
        },
        "dateCreated": "2006-03-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109376/"
        },
        "name": "Very likely the worst film I've ever seen",
        "reviewBody": "I've sat through some dreadful films in my time, but this one may well be the all-time winner. I watched the whole thing with my mouth hanging open in stunned disbelief that it could be as bad as it was.\n\nI was extremely interested in seeing the film around the time it came out. This was back when Nick@Nite was showing reruns of the old Car 54 TV show, and I was one of the many who was first exposed to it there and fell in love with it. My understanding was that it was this renaissance of cult interest in the show that motivated the making of a movie. So I was looking forward to seeing said movie.\n\nThe thing about this movie was, it seemed extremely evident that NOBODY associated with the making of this movie HAD EVER actually *seen* the original TV show upon which it is (supposedly) based. That the main characters are named Toody and Mulldoon seems almost a coincidence; they aren't even *remotely* like the original characters, except in so far as being cops. The original Car 54 TV show had a delightful, wacky sense of humor. This abomination of a film has NO sense of humor. I didn't not laugh once, not one single time. The original TV show had an amusing, catchy theme song. This thing had some monstrosity of a rap. What I will never, ever fathom is how *anybody* ever signed off on this thing at any stage in its development. I want to know who looked at the script for this and say \"Yeah! That's great!\" and what drugs they were on.\n\nI remain in everlasting awe that they were able to propose, write, film, edit, and release a Car 54 film that had absolutely NOTHING to do with the great old TV show, Car 54, Where Are You. When you factor in the disappointment factor over what it could have been, I think this could well be the worst ever. There was just *no good reason* for it to have been this bad.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Brash NYC policeman Officer Gunther Toody is partnered with stiff, by-the-book Officer Francis Muldoon to protect an important mafia witness prior to testifying against orgainzed crime in Brooklyn, all the while dealing with their personal lives, overbearing spouses, common criminals, arms dealers, and their officious boss Captain Anderson.",
        "duration": "PT1M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1224590105",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTY1MWI2ZWItYjVlOC00MDQ2LWIyN2MtOWI1YWVjYWNkZDljXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTY1MWI2ZWItYjVlOC00MDQ2LWIyN2MtOWI1YWVjYWNkZDljXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-09T14:26:08.378Z",
        "url": "https://www.imdb.com/video/vi1224590105/"
    },
    "url": "/title/tt0109376/"
}