{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Tracey Moore",
            "url": "/name/nm0601982/"
        },
        {
            "@type": "Person",
            "name": "Tabitha St. Germain",
            "url": "/name/nm0319308/"
        },
        {
            "@type": "Person",
            "name": "Ian James Corlett",
            "url": "/name/nm0003944/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 158,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "TV-Y",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018052/"
        },
        {
            "@type": "Person",
            "name": "Mike Roth",
            "url": "/name/nm1226489/"
        }
    ],
    "datePublished": "2007-09-15",
    "description": "CARE BEARS: ADVENTURES IN CARE-A-LOT focuses on the colorful bears' escapades and highlights how each one shares his or her unique way of caring with friends. Each Care Bear relies on his or her own special caring ability -- and t...",
    "genre": [
        "Animation",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjYyZjQyOWQtNmU3Mi00MzVmLWJhMjAtMzA3ZGNhMjRjZWIyXkEyXkFqcGdeQXVyMjM5NDQzNTk@._V1_.jpg",
    "keywords": "altruism,animal in title,anthropomorphic animal,anthropomorphism,apology",
    "name": "Care Bears: Adventures in Care-A-Lot",
    "original_info": {
        "id": "Care Bears: Magical Adventures_1988",
        "name": "Care Bears: Magical Adventures",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2012-05-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1156752/"
        },
        "name": "Not one of my favourites but a commendable series all the same",
        "reviewBody": "Although now I am not the biggest fan of the Care Bears, I was as a child and I do still enjoy the 80s incarnations, though I have been mixed on the recent ones. This series is quite good though. I don't think it quite captures the heart and charm of the 80s TV series or the original movies but there is still enough of that and it is one of the better overall Care Bears incarnations of recent times. I do confess though I always did find the dialogue a weak point in a lot of the Care Bears shows/movies/specials, and it is no exception here, with moments that do come across as too corny and saccharine for my tastes. Overall, I did like the quality of the animation. I do prefer the animation of the 80s incarnations, which wasn't as colourful but charming in its simplicity, but the the backgrounds simply burst with colour and vibrancy. The character designs though do take some getting used to, not as problematic as the terrible ones of Journey to Joke-a-Lot but jerky and somewhat inflated at times. On the other hand, the music is appropriately catchy and whimsical, the stories are cute and charming with some good morals that are conveyed without preaching, the Care Bears are generally the most likable they've been in the recent incarnations and not too bland, Grizzle is one of those villains that is fun and scary without being too much of the other and the voice acting consisting of some great voice talent is solid(plus unlike Journey to Joke-a-Lot for instance they don't sound as though they were recorded inside a helium balloon). Overall, commendable, I can understand why some may prefer the series and movies from the 80s(I do so myself) but not bad. 7/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt1156752/"
}