{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jay Hernandez",
            "url": "/name/nm0379596/"
        },
        {
            "@type": "Person",
            "name": "Mario Van Peebles",
            "url": "/name/nm0005522/"
        },
        {
            "@type": "Person",
            "name": "Luis Guzmán",
            "url": "/name/nm0350079/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4752,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0123433/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0131136/"
        },
        {
            "@type": "Person",
            "name": "Edwin Torres",
            "url": "/name/nm0868620/"
        },
        {
            "@type": "Person",
            "name": "Michael Bregman",
            "url": "/name/nm0106841/"
        }
    ],
    "datePublished": "2005-12-01",
    "description": "In the late 1960s, Carlito Brigante (Hernandez) emerges as the heroin czar of Harlem.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Bregman",
            "url": "/name/nm0106841/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ5MTU3Njk1MF5BMl5BanBnXkFtZTcwNTYxODEzMQ@@._V1_.jpg",
    "keywords": "sex in bed,panties,woman in jeopardy,leg spreading,lust",
    "name": "Carlito's Way: Rise to Power",
    "original_info": {
        "id": "Carlito's Way: Rise to Power_2005",
        "name": "Carlito's Way: Rise to Power",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Pat_Bateman"
        },
        "dateCreated": "2005-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0427038/"
        },
        "name": "A disgrace",
        "reviewBody": "Where can I begin. I heard this movie was coming out and I was very mad. I am a huge fan of the original Carlito's Way and when I heard about this, I thought it would be just like almost all the other sequels that come out in Hollywood. I thought it would be bad. Boy was I wrong, this movie was much worse than I expected. Not saying all sequels are bad, but thats the problem with Hollywood these days, they make too many sequels and remakes and rush them. This was not a theater release, it is a DVD release. Still, in my opinion, there was no reason at all for this to be made. After I heard about this film was in progress, I then later heard Pacino was not in it. That right away killed any chance this movie had of being good. Why did I check this movie out then some of you may ask? Well I had the opportunity to see it so I did. I don't only watch movies that I have high expectations of, I had low expectations on this one obviously. I just wanted to see if it would have anything relevant in it. Now, if any of you reading this are a Carlito's Way fan, you know a lot of the story in the first one has to do with him going to jail.\n\n*VERY MINOR SPOILER* I wont ruin anything, because this may actually make you not want to waste 2 hours watching this trash. All I will say is- in the end of Carlito's Way 2, we don't see Carlito go to jail. Now, I don't know about any of you, but I would have thought a prequel to Carlitos Way would show how he ended up in jail. I even had some interest in actually seeing what happened.\n\nNow, thats not my only problem with the film. The actor who played Carlito did not do too bad a job, but he could not have saved this film if he tried. There's not even all those little things that should be thrown in there that Carlito's Way fans would like. You don't see any appearance of Kleinfeld or other key characters in the first one, I would have liked to see something like that. What is even worse, is Luis Guzman is in this film, yet he doesn't play the same character he plays in the first film. Big mistake on their part, why cast the same actor for a different character, it made the movie worse than it already was.\n\nBottom line, I am a Carlito's Way fan, this new straight to DVD release is a disgrace. If you are a fan, don't watch this movie coming in with high expectations. This movie did basically nothing for me, and it is definitely one movie I wont be picking up on DVD, or watching ever again.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT2M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi448594201",
        "name": "Carlito's Way: Rise to Power",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODgyNTExZDItNjI1MC00MzZkLWJlMWItNjJjMjg1YTkwMWIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODgyNTExZDItNjI1MC00MzZkLWJlMWItNjJjMjg1YTkwMWIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:02:25Z",
        "url": "https://www.imdb.com/video/vi448594201/"
    },
    "url": "/title/tt0427038/"
}