{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Helena Solberg",
            "url": "/name/nm0812773/"
        },
        {
            "@type": "Person",
            "name": "Eric Barreto",
            "url": "/name/nm0056998/"
        },
        {
            "@type": "Person",
            "name": "Cynthia Adler",
            "url": "/name/nm0012128/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 299,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010564/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018507/"
        },
        {
            "@type": "Person",
            "name": "Helena Solberg",
            "url": "/name/nm0812773/"
        }
    ],
    "datePublished": "1995-04-13",
    "description": "A biography of the Portuguese-Brazilian singer Carmen Miranda, whose most distinctive feature was her tutti frutti hat. She came to the US as the \"Brazilian Bombshell\" and was a Broadway and Hollywood star in the 1940s.",
    "director": [
        {
            "@type": "Person",
            "name": "Helena Solberg",
            "url": "/name/nm0812773/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Documentary",
        "Biography",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM4ODQyMzM5MV5BMl5BanBnXkFtZTcwNDYzMjYxMQ@@._V1_.jpg",
    "keywords": "tutti frutti hat,brazilian,carmen miranda,singer,1940s",
    "name": "Carmen Miranda: Bananas Is My Business",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tbear_43"
        },
        "dateCreated": "2013-02-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109381/"
        },
        "name": "Unusual and sensitive",
        "reviewBody": "Contrary to the opinions expressed by some reviewers, this documentary, though with some odd moments and sequences, is much more sensitive and personal than their reviews would imply.\n\nMs Solberg presents a clear theme. Carmen Mianda was misunderstood by her own people. That she was actually portuguesa, makes little difference to the story, though it is important to know. The important point is that she was Brazilian to her core. Even her dear sister Aurora makes that point clear.\n\nThe main theme in the story is a subtle apology to the world for the way the upper class Brazilians treated Carmen. Yes, she was a popular singer who had the ear of Getulio Vargas at the right time, but she was never a part of the Brazilian highly detested \"elite,\" those who vilified her at her gala performance on her first return from the USA, the elite who own the news media and were able to manipulate public opinion in Brazil among people who \"mattered.\" Ms Solberg's mother appears to be among those to whom the film refers, since \"nice people\" never went out where the masses gathered. Ms Solberg also makes the point that these Brazilians did not form their world opinions in Brazil, but in Europe, where they also bought their clothes. Interesting juxtaposition of preferences.\n\nThus it is wrong to believe that because of her fame and favor with the president at the time, Carmen was socially well-connected. Ms Solberg tells us about those who \"always\" loved her. These were the people whom the world thinks of as \"real\" Brazilians, the samba singers, the bahianos, the black people of the northeast, whose culture permeates everything Brazilian. This is why America became obsessed with Carmen at the time that the Brazilin upper crust felt sold out by her.\n\nThus, the theme is clearly one of a clash of cultures, not so much between North and Soutn America, but rather among Brazilians themselves. And Ms Solberg comes down squarely, as does Carmen, on the side of the majority, those who love the rhythm of Brazil and who adore Carmen Miranda. This documentary was for them, not so much for us norte americanos.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0109381/"
}