{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Candace Hilligoss",
            "url": "/name/nm0385010/"
        },
        {
            "@type": "Person",
            "name": "Frances Feist",
            "url": "/name/nm0270766/"
        },
        {
            "@type": "Person",
            "name": "Sidney Berger",
            "url": "/name/nm0074367/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25830,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038749/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048865/"
        },
        {
            "@type": "Person",
            "name": "John Clifford",
            "url": "/name/nm0166647/"
        },
        {
            "@type": "Person",
            "name": "Herk Harvey",
            "url": "/name/nm0367547/"
        }
    ],
    "datePublished": "1962-11-02",
    "description": "After a traumatic accident, a woman becomes drawn to a mysterious abandoned carnival.",
    "director": [
        {
            "@type": "Person",
            "name": "Herk Harvey",
            "url": "/name/nm0367547/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjgxYjI1ODktNWYyNy00N2EyLWFhOWEtMmI1ZmU3ZmU5ZWFjXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "car accident,b movie,driving off a bridge,carnival,bridge",
    "name": "Carnival of Souls",
    "original_info": {
        "id": "Carnival of Souls_1962",
        "name": "Carnival of Souls",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rmax304823"
        },
        "dateCreated": "2003-08-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055830/"
        },
        "name": "Effective and Uneasy",
        "reviewBody": "This is something like a full-length episode of the Twilight Zone, popular at the time of the movie's release. It's cheaply made, the photography is grainy, the story basically simple, and the acting nothing to write home about -- but this is one effective film if you're into dread.\n\nCandace Hilligoss is a pretty blonde with a sharp nose and a vulnerable quality about her. (She might remind the viewer of that Twilight Zone episode that starred Inger Stevens continually running into a guy in black, \"The Hitch Hiker,\" maybe?) Candace Hilligoss is not a major actress but it's difficult to imagine a better fit between the individual and the role. She's pretty enough so that men might find it pleasant to stand next to her in the supermarket checkout line, but not too pretty. Her face is defined by its bone structure so that you can almost see the skull beneat the skin. Her slanted, over-sized blue eyes suggest some sort of startled prey animal. And her movements, her body language, are both clumsy and extremely feminine. She wobbles when she runs and minces when she walks. And she's the right age too -- thirtyish -- not a fledgling with a great big Future ahead of her. The successive loss of her friends, her home town, her job in Utah, her room in the boarding house, and eventually her car, is enough to leave anyone in a state of desperation -- especially someone whose sole marketable skill seems to be playing the organ. \n\nThe narrative has been gone over so I'll skip any description of it. What distinguishes this movie from others of its type is that, with the exception of the opening scenes of the accident at the bridge, there is no one at all who acts in a perfectly normal manner. (Unlike Inger Stevens, Hilligos has no ordinary sailor to pick up and talk to.) The pervading sense of disquiet is enhanced by the efficient use of locations -- a church, a vast ballroom, a decrepit and deserted amusement park at the end of a pier. And I think the performers contribute as well, their very amateurish awkwardness promoting in the viewer a feeling that \"something\" is not quite right about what we're witnessing. Even the scenes of quotidian life -- finding a job, fending off a neighbor's advances, trying to be polite to a polite landlady -- seem to be imbued with a kind of hard-to-define cockeyed quality, as in a De Chirico painting. Hilligoss is living in a universe in which nothing, and nobody, has an identity whose validity can be taken for granted. Not even her psychiatrist can be trusted to be what he seems. \n\nThere are no big shock moments. Nobody gets slaughtered in a shower. Nothing is \"evil\" in any ordinary sense. Everything is simply \"wrong.\" And the only music in the score is played on a church organ, mostly eerie chords that shimmer in the background. It's quietly done by director Herk Harvey.\n\nSidney Berger, who plays Hilligoss's odd neighbor, was in real life a speech instructor at the nearby University of Kansas. The leader of the dead is played by the director. This weird, subdued piece comes to us out of Lawrence, Kansas. It's pretty good for Lawrence, Kansas. But don't set your expectations too high. It's an old black-and-white horror movie, made by amateurs on a minescule budget. But within the limits set by those conditions, it's pretty good for anywhere, for that matter.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "After a traumatic accident, a woman becomes drawn to a mysterious abandoned carnival.",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3297624345",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGVhZjlmZjgtNTQ4Ni00N2FlLTk3NjUtNTJhYzg5ZmFiOTMyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGVhZjlmZjgtNTQ4Ni00N2FlLTk3NjUtNTJhYzg5ZmFiOTMyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-12T15:04:58.491Z",
        "url": "https://www.imdb.com/video/vi3297624345/"
    },
    "url": "/title/tt0055830/"
}