{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Louis Gossett Jr.",
            "url": "/name/nm0001283/"
        },
        {
            "@type": "Person",
            "name": "Bruce Dern",
            "url": "/name/nm0001136/"
        },
        {
            "@type": "Person",
            "name": "Melissa Leo",
            "url": "/name/nm0502425/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 434,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0450254/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025638/"
        },
        {
            "@type": "Person",
            "name": "David Stout",
            "url": "/name/nm0832860/"
        },
        {
            "@type": "Person",
            "name": "Tracy Keenan Wynn",
            "url": "/name/nm0944003/"
        }
    ],
    "datePublished": "1991-09-30",
    "description": "After a long time in the Army, an African-American soldier returns to his hometown, where, years ago, his brother was executed for the rape and murder of two white girls. The commando believes his brother to have been innocent, an...",
    "director": [
        {
            "@type": "Person",
            "name": "John Erman",
            "url": "/name/nm0259589/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODZlZjBjMjItNWEzOC00MDQ1LWFiYjItN2I2NDAwYjUyMzA1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "dumping a dead body in a lake,sheriff,soldier,murder,bite mark",
    "name": "Carolina Skeletons",
    "original_info": {
        "id": "Carolina Skeletons_1992",
        "name": "Carolina Skeletons",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "view_and_review"
        },
        "dateCreated": "2020-04-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101549/"
        },
        "name": "Justice for George Stinney",
        "reviewBody": "\"Carolina Skeletons\" is loosely based upon a book of the same title which was a loose interpretation of what may have happened to George Stinney.\n\nGeorge Stinney is the youngest person in American history to be legally executed. He was a 14-year-old black boy in South Carolina accused of killing two white girls. Much like the movie indicated, George Stinney was a very slight 14-year-old to the point he looked like he could not have been older than 12.\n\n\"Carolina Skeletons\" gives a plausible yet fictitious explanation as to what may have occurred to lead to Stinney being convicted and executed. So, because it's fictional the names are all different and even the actual location is different. The executed boy in \"Carolina Skeletons\" is Linus Bragg (Kenn Michael) instead of George Stinney.\n\nI am a little bit displeased with the movie because it did not follow the book strictly enough. The only reason I watched this movie was because I read the book, and I liked the book. There are a few big digressions from the book in this movie.\n\nBook: The murder was being investigated 44 years later.\n\nMovie: The murder was being investigated 30 years later.\n\nBook: James Willop, Linus's biracial nephew, comes back to investigate the crime.\n\nMovie: James Bragg (Louis Gossett Jr.), Linus's non-biracial younger brother, comes back to investigate the crime.\n\nBook: The murder is investigated in a sly manner so as to not hedge what he's working on.\n\nMovie: James Bragg was brash and almost militant in his investigation.\n\nIf you add up these three facts from the book then it would make it a lot easier for a person to investigate such a murder in the deep South. The 1980s are going to be a lot less hostile and a lot less racially unfriendly than the 1960s. A biracial man who can pass for white will have access to things that a darker black man will not have access to. And a forward Black man in the 1960's south ran a big risk of being lynched. But in this movie they made it seem like the main character was this brash, no nonsense, semi-militant black man who was going to get the truth almost with force when that would probably never happen. In the book he had to use cunning and finesse and never let on to who he was, which I thought was a better depiction of the truth and even a better way of getting at the truth.\n\nSo, I liked the movie, though I did not like it as much as I had hoped. I would've liked for them to follow the book a lot more, but the overall importance was never lost--and that is that an innocent young black boy was executed for a crime he could not possibly have committed while a tremendously guilty white man lived out the rest of his days unpunished.\n\nJust as a factual note: George Stinney's conviction was overturned in 2014, 70 years after his execution. Symbolically that is wonderful, but it's not like they brought him back to life and gave him his life back. That's something that they took from him that they can never restore no matter how many convictions they overturn.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0101549/"
}