{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Scott 'Carrot Top' Thompson",
            "url": "/name/nm0005488/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 88,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "datePublished": "2003-10-21",
    "description": "Carrot Top, the red-headed wunderkind with a trunk full of giggles, invades Vegas and this one you won't want to miss. Filmed live at the MGM Grand, Carrot Top Rocks Las Vegas is a rock & roll hyper-reality comedy explosion with s...",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Hanft",
            "url": "/name/nm0359840/"
        }
    ],
    "duration": "PT1H11M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE2MDcyMTMzMl5BMl5BanBnXkFtZTcwNTcwNjAwMQ@@._V1_.jpg",
    "name": "Carrot Top Rocks Las Vegas",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "StevePulaski"
        },
        "dateCreated": "2011-03-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0377596/"
        },
        "name": "Little less skit and a lot more props",
        "reviewBody": "Sometimes I don't like to admit it but I am a Carrot Top fan. I laugh at his prop comedy. I laugh at him himself. I laugh at the fact that he can make fun of himself. He is funny. He is one of my favorite comedians. He's up there with Carlin, Saget, Rock, Giraldo, and Schimmel on my list of favorites. He dares to be different, and often succeeds.\n\nCarrot Top Rocks Las Vegas isn't all that it could've been. It's a mere seventy-eight minute special (most consisting of behind the scenes footage). Playing it on a DVD, there are no chapter selections making it hard to pick up where you left off. The DVD states \"This DVD was authored with specific chapter stops to maintain the flow of the \"LIVE\" performance.\" That would be nice if the film wasn't already edited to look like crap.\n\nWacky filters, strange noises, and other random effects clearly not part of the \"live\" special are thrown in here at random. If you want to make this feel like a live special, don't add all this extra, unnecessary garbage. It almost completely ruins the special.\n\nCarrot Top does a good job sporadically offering hit or miss props one after another. I'd like to see a DVD of Carrot Top being himself, with a mic, ranting and raving on our world in his own perspective. Lets just hope that DVD isn't filled with the creative editing this one had.\n\nStarring: Carrot Top, Penn Jillette, and Teller.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0377596/"
}