{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Niven",
            "url": "/name/nm0000057/"
        },
        {
            "@type": "Person",
            "name": "Peter Sellers",
            "url": "/name/nm0000634/"
        },
        {
            "@type": "Person",
            "name": "Ursula Andress",
            "url": "/name/nm0000266/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 30938,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0077420/"
        },
        {
            "@type": "Person",
            "name": "Wolf Mankowitz",
            "url": "/name/nm0542554/"
        },
        {
            "@type": "Person",
            "name": "John Law",
            "url": "/name/nm0492339/"
        },
        {
            "@type": "Person",
            "name": "Michael Sayers",
            "url": "/name/nm0768476/"
        }
    ],
    "datePublished": "1967-04-28",
    "description": "In an early spy spoof, aging Sir James Bond comes out of retirement to take on SMERSH.",
    "director": [
        {
            "@type": "Person",
            "name": "Val Guest",
            "url": "/name/nm0346436/"
        },
        {
            "@type": "Person",
            "name": "Ken Hughes",
            "url": "/name/nm0400731/"
        },
        {
            "@type": "Person",
            "name": "John Huston",
            "url": "/name/nm0001379/"
        }
    ],
    "duration": "PT2H11M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjJlYzgyZTQtNDFiMy00ZGFjLTk2N2ItN2ViNzNhNzhhNGM1XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "spy spoof,parody,james bond spoof,spy,1960s",
    "name": "Casino Royale",
    "original_info": {
        "id": "Casino Royale_1967",
        "name": "Casino Royale",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bogmeister"
        },
        "dateCreated": "2007-05-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061452/"
        },
        "name": "Everyone is James Bond in Psychedelic Mishmash",
        "reviewBody": "This was the Bond title unable to be used by the filmmakers of the regular Bond film series, until the end of the century (they finally got to it for the restart in 2006). So, the intent here was a spoof of the then-wildly popular Bond/spy mania of the mid-sixties. Of course, this wasn't the first such effort; others already began the \"Our Man Flint\" duo film series and \"The Man From UNCLE\" on TV was in full swing, not to mention \"Get Smart.\" So, how to outdo them? Get five top notch directors. Get as many sixties stars as possible. Get everything but the kitchen sink (literally, in the over-the-top climax). The original intent was to have each director do their own little mini-movie spoof - an anthology; they ended up editing everything together into one so-called film. A heady brew and, predictably, largely incomprehensible. In addition, actor Sellers, the nominal star, left before completing all his scenes, so his personal trajectory is less than smooth - as if a scene is missing, naturally. If you pay very close attention, you might be able to follow about 50% of the plot, but do you really want to put so much effort into watching a comedy? \n\nSome of this editing is quite clumsy: the first pre-credits scene, a short one, features Sellers, as if the producers are pointing out to us that he is indeed in this movie (he doesn't show up again until 40 minutes later). Welles doesn't show up until the 80-minute mark. The first sequence concentrates on Niven, the real James Bond. He's in retirement but is forced back into a weird plot by the heads of all the world's spy agencies. This first half-hour, except for the scene with the lions, is slow and mostly stupid, not funny-stupid as intended, involving Kerr and a lot of dull fun at the expense of the Irish, for some reason, and painfully obvious joking about Bond's sexual magnetism. There's also one sly poke at the real Bond film series and its gadgetry; apparently, that Bond, of \"Goldfinger\" and \"Thunderball\" fame, is actually a replacement for the pure spy played by Niven, who looks down at the concept of gadgets. Things start to pick up a bit later, with the intro of several femme fatales, played by some of the most ravishing starlets of the sixties: Andress of \"Dr.No\" fame, Bouchet as the new Moneypenny, Lavi and Pettet as Bond's daughter, Mata (why Pettet did not become a major star is baffling to me). Much of the non-plot involves Niven taking over M's operations and naming a bunch of other agents James Bond to confuse the enemy - SMERSH (lifted straight from the books). We finally do see similar plot lines to Fleming's novel, involving villain heavy Le Chiffre (Welles) and one of the Bonds (Sellers) dueling at cards (Baccarat - dramatized differently in the 1954 TV version, yet eerily similar).\n\nCuriously, it's not Sellers who provides the more amusing scenes in this confusing fest, as we would expect. No, that honor falls to Woody Allen, as Bond's nephew, and Welles in his brief scenes conducting some off-the-cuff magic show. Allen's highlight is his very first scene, involving the firing squad. Allen, previously seen in \"What's New,Pussycat?,\" now proves to be one of the most natural comedians for the silver screen. His mannerisms and body movement recall some of the great comedians of the silent era, Chaplin & Keaton, especially evident in the scenes where he can't speak (a mental block whenever Uncle Bond is around). Famous starlet of the seventies Ms.Bisset pops up briefly in a small role as yet another femme fatale. There's also some mildly amusing commentary on the division of East and West Berlin - yes, this was the height of the Cold War - including some almost-clever use of color. But, all the psychedelic stuff, crammed into the tail end of this, is very outdated and useful only if the viewer has smoked a lot of weed. This movie also has one of the worst musical scores - almost like nails on chalkboard to me. If you're in a really good mood, you may be able to sit through this long movie comfortably; if not, you'll probably get pretty antsy as the last third begins - and that's where most of Woody's scenes are. Bonds:4 Villains:6 Femme Fatales:7 Henchmen:4 Fights:3 Stunts/Chases:5 Gadgets:4 Locations:8 Pace:4 overall:5-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi889568793",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDEyNzZlYzUtYzljMy00Y2M4LWEzZDMtMDY4YjY0YjZkMTI1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDEyNzZlYzUtYzljMy00Y2M4LWEzZDMtMDY4YjY0YjZkMTI1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-08T14:52:10.783Z",
        "url": "https://www.imdb.com/video/vi889568793/"
    },
    "url": "/title/tt0061452/"
}