{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Patrick O'Neal",
            "url": "/name/nm0641929/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Aumont",
            "url": "/name/nm0001922/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3281,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065715/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059675/"
        },
        {
            "@type": "Person",
            "name": "William Eastlake",
            "url": "/name/nm0247614/"
        },
        {
            "@type": "Person",
            "name": "Daniel Taradash",
            "url": "/name/nm0850168/"
        },
        {
            "@type": "Person",
            "name": "David Rayfiel",
            "url": "/name/nm0713128/"
        }
    ],
    "datePublished": "1969-09-20",
    "description": "During the Battle of the Bulge, an anachronistic count shelters a ragtag squad of Americans in his remote 10th Century castle hoping a battle there against the advancing Germans will not lead to its destruction and all the heritag...",
    "director": [
        {
            "@type": "Person",
            "name": "Sydney Pollack",
            "url": "/name/nm0001628/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzVjODM0OTUtMDI1MC00MWYyLTgzNGItY2JjMzJhZDVlYTM4XkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "u.s. soldier,castle,battle of the bulge,marriage between uncle and niece,german army",
    "name": "Castle Keep",
    "original_info": {
        "id": "Castle Keep_1969",
        "name": "Castle Keep",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bunuel1976"
        },
        "dateCreated": "2007-08-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064137/"
        },
        "name": "CASTLE KEEP (Sydney Pollack, 1969) ***",
        "reviewBody": "I had been wanting to check this one out for over 20 years (it used to be available as a VHS rental at the local outlet but I never got around to it) but especially after reading up on the film on the internet since its 2004 DVD release(s) where its unusual \"artiness\" a'-la Alain Resnais' LAST YEAR IN MARIENBAD (1961) was played up. Now that I've watched CASTLE KEEP for myself, all I can say is that it's arguably the strangest mainstream war movie ever and decidedly not for all tastes!\n\nThe relatively large cast (for what turns out to be an introspective film) is uniformly excellent and is well up to the requirements of the brilliantly surreal, funny and literate script; Burt Lancaster, wearing an eye-patch throughout, has an unsympathetic role as the formidable leader of a group of misfit soldiers taking over a Belgian castle against unseen invading German troops. He is skillfully abetted by Peter Falk (as a soldier who abandons his post to indulge in his vocation as a baker), Jean-Pierre Aumont (as the \"degenerate\" owner of the titular castle), Patrick O'Neal (as a celebrated art historian all at sea on the battleground but well in his element surrounded by the castle's objets d' art), Scott Wilson (as a soldier who gets into quite a unique relationship  more on this later), Tony Bill (as the most spiritual of the men) and, the other side of the coin, Bruce Dern as a Bible-thumping conscientious objector who walks the Belgian rubbles with his ragged band of revivalist deserters-followers. The terrific cinematography of the awesome European locations  courtesy of Henri Decae  is complimented by a fine Michel Legrand score and, when they finally come, spectacular battle sequences.\n\nBut it's the odd, surreal touches  including Scott Wilson falling in love with a Volkswagen, the same car rising from the sea after it has been drowned by his envious companions and floating ashore all by itself, the moving sequence between Tony Bill and an unseen German soldier (subsequently needlessly shot by Peter Falk) where the latter teaches the former how to play the flute correctly, the unusually realistic talk of fornication, sexual organs, impotence, the ambiguous (perhaps ghostly) nature of the characters involved and the events being enacted, etc.  which really make this show stand out from the crowd of WWII spectaculars and stick in one's memory  not to mention endear it to its legion of fans (who have famously decried online its original abominable pan-and-scan DVD incarnation, forcing Sony to re-release it in the correct Widescreen aspect ratio a mere four months later). The theme of the relevance of art in times of war brings forth comparisons to John Frankenheimer's THE TRAIN (1964), also starring Burt Lancaster, whose third (and final) collaboration with director Sydney Pollack  after the previous year's THE SCALPHUNTERS and THE SWIMMER (where Pollack replaced original director Frank Perry but goes uncredited)  this proved to beperhaps as a result of the critical beating the film received upon its original release!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT3M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2911551257",
        "name": "Castle Keep",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2IzY2Q0NzEtYzU3My00MTBiLTg0NWQtMWQ5NGZiYzYyZTA4XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2IzY2Q0NzEtYzU3My00MTBiLTg0NWQtMWQ5NGZiYzYyZTA4XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-10-06T18:05:05.478Z",
        "url": "https://www.imdb.com/video/vi2911551257/"
    },
    "url": "/title/tt0064137/"
}