{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leonardo DiCaprio",
            "url": "/name/nm0000138/"
        },
        {
            "@type": "Person",
            "name": "Tom Hanks",
            "url": "/name/nm0000158/"
        },
        {
            "@type": "Person",
            "name": "Christopher Walken",
            "url": "/name/nm0000686/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1008367,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0819670/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0084134/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0112912/"
        },
        {
            "@type": "Person",
            "name": "Jeff Nathanson",
            "url": "/name/nm0622288/"
        },
        {
            "@type": "Person",
            "name": "Frank Abagnale Jr.",
            "url": "/name/nm0007646/"
        },
        {
            "@type": "Person",
            "name": "Stan Redding",
            "url": "/name/nm1127221/"
        }
    ],
    "datePublished": "2002-12-25",
    "description": "Barely 21 yet, Frank is a skilled forger who has passed as a doctor, lawyer and pilot. FBI agent Carl becomes obsessed with tracking down the con man, who only revels in the pursuit.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Spielberg",
            "url": "/name/nm0000229/"
        }
    ],
    "duration": "PT2H21M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5MzYzNjc5NV5BMl5BanBnXkFtZTYwNTUyNTc2._V1_.jpg",
    "keywords": "impostor,deception,fraud,forgery,race against time",
    "name": "Catch Me If You Can",
    "original_info": {
        "id": "Catch Me If You Can_2002",
        "name": "Catch Me If You Can",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "camcmahon"
        },
        "dateCreated": "2005-03-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0264464/"
        },
        "name": "I haven't read the book just yet - I definitely will now!",
        "reviewBody": "This was an entertaining and fun piece of film making from the ever-reliable Steven Spielberg. It is a bit of a depart from his usual full-blown and hugely epic pictures, yet this does not detract at all from the fascinating story of Frank Abagnale Jr. I was interested in this man before I'd seen the movie, and it only served to increase my interest. Although it is important to remember (as with any such film) that this is only 'inspired' by a true story and not told word for word from one, the plot is fascinating and keeps you laughing, crying and wondering until the end.\n\nFrank Abagnale Jr. is an astounding and interesting character. The real life Abagnale originally said that he did not believe Dicaprio to be 'suave' enough to play the role, but he certainly does pull it off. Dicaprio's acting is superb, and totally believable as a man who could lie to, deceive, and con everyone he met without once losing any of his charisma or charm. Hanks is also excellent, he plays the role of the obsessed FBI agent well, and also with a likable quality. The interaction between these two characters was great, it was interesting to see a budding relationship slowly build between two characters who were actually positioned against one another.\n\nI loved the look of the film. It was a refreshing blast to see the 60s portrayed in such a vivid and colorful way. The whole setting and atmosphere of the film gave it a wonderful and almost (I hesitate to use the word) 'magical' sense. This tone appealed to me much more than a darker tone might have.\n\nHowever, the film is rife with moral ambiguity. As much fun as it is to watch Dicaprio jumping from one place (and identity) to the next, forging checks and spending inordinate amounts of money at a whim, the film never really focuses on the morally bankrupt side of the story. The portion of the film devoted to this at the end still seems to skim over the fact that this man has stolen millions of dollars. It ends on a high note for Frank Abagnale Jr., never fully spelling out the wrongs he committed. Still, this would probably bring the whole film down, and sometimes it's fun just to enjoy a bit of escapism without being told off for desiring such things. I mean, it's hard to be totally strict and upright - you have to love it when Dicaprio's character swindles Jennifer Garner's prostitute for $400! \n\nOverall, this is a fun film and really enjoyable. Not as much of an epic masterpiece as some of Spielberg's other movies, but still a great film!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Dreamworks",
        "duration": "PT2M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1220346137",
        "name": "Catch Me If You Can",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWQxM2UxZTUtMzFlZS00YTVjLWFkNzctZjQzZjMwN2ZlNTllXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWQxM2UxZTUtMzFlZS00YTVjLWFkNzctZjQzZjMwN2ZlNTllXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:05:05Z",
        "url": "https://www.imdb.com/video/vi1220346137/"
    },
    "url": "/title/tt0264464/"
}