{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Catherine Zeta-Jones",
            "url": "/name/nm0001876/"
        },
        {
            "@type": "Person",
            "name": "Paul McGann",
            "url": "/name/nm0001524/"
        },
        {
            "@type": "Person",
            "name": "Ian Richardson",
            "url": "/name/nm0007183/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1308,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000275/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074501/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003522/"
        },
        {
            "@type": "Person",
            "name": "John Goldsmith",
            "url": "/name/nm0326089/"
        },
        {
            "@type": "Person",
            "name": "Frank Tudisco",
            "url": "/name/nm0876100/"
        }
    ],
    "datePublished": "1996-04-28",
    "description": "Trapped in a loveless arranged marriage to the immature future Czar, a young German Princess proves a skillful political infighter and rises to become Catherine the Great.",
    "director": [
        {
            "@type": "Person",
            "name": "Marvin J. Chomsky",
            "url": "/name/nm0159007/"
        },
        {
            "@type": "Person",
            "name": "John Goldsmith",
            "url": "/name/nm0326089/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2Nzg4MTg4MF5BMl5BanBnXkFtZTcwNDc1NjkxMQ@@._V1_.jpg",
    "keywords": "rape,husband rapes wife,foreigner playing russian character,drinking contest,breasts",
    "name": "Catherine the Great",
    "original_info": {
        "id": "Catherine the Great_1995",
        "name": "Catherine the Great",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TWD_Cliff_Notes"
        },
        "dateCreated": "2001-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112031/"
        },
        "name": "Miscast and inaccurate",
        "reviewBody": "Although fairly interesting to watch, Katharina is very historically inaccurate and biased, which is partly due to the horrible miscasting. Just to name a few: 1. Catherine Zeta-Jones as Empress Catherine II: a actress who is young, beautiful, dark in complexion and extremely attractive is certainly a poor choice to play a pale, plain middle-aged nimphomaniac. No one would ever address the real Catherine II as \"you pretty thing\", as Pugachev did in the film! 2. Jeanne Moreau as Empress Elizabeth: a 70-year old playing a 40-year old (I think this is self-explanatory) 3. Omar Sharif as Count Razumovsky: a 65-year old with a typically mediterranean appearance as a 45-year-old Ukrainian... 4. Rhys-Meyers as Pugachev... Don't know where to start... Apart from the fact that the actor is once again much older that his character, Rhys-Meyers is a BAD choice to play a violent, charismatic, almost demonic, and at the same time very folkish, Emelian Pugachev. Rhys-Meyers just doesn't look like an escaped convict-mass-murdered-highway robber-impostor or any of what real-life Pugachev was. Apart from that, a particularly striking misportrayal is the execution of Pugachev. The filmmakers have it take place in the summer in front of a crowd of about 5, while in reality it took place in the middle of winter on the Red Square in Moscow in front of a crowd of perhaps a 100,000, and was an extremely dramatic event, one the biggest public spectacles in Russia's history. So much for the fillmakers... Also, the story of Catherine's marriage to Peter III is portarayed in a highly prejudiced manner, drawing an all-too-clear line between the supposedly \"good guys\" (namely Catherine, Orlov, and the bunch) an the \"horrible monster\" Peter III. The story was not nearly so black-and-white in reality. Apart from that, the film makes fairly decent viewing. Balancing the two, I give it a 6/10"
    },
    "url": "/title/tt0112031/"
}