{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Helen Mirren",
            "url": "/name/nm0000545/"
        },
        {
            "@type": "Person",
            "name": "Harry Andrews",
            "url": "/name/nm0028674/"
        },
        {
            "@type": "Person",
            "name": "David Suchet",
            "url": "/name/nm0837064/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 165,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103493/"
        },
        {
            "@type": "Person",
            "name": "Terence Rattigan",
            "url": "/name/nm0711905/"
        },
        {
            "@type": "Person",
            "name": "Ken Taylor",
            "url": "/name/nm0852706/"
        }
    ],
    "datePublished": "1987-08-23",
    "description": "When a woman's husband is murdered by her lover, both are tried for murder. The prosecution claims that she is the mastermind behind the crime, but she has an ace up her sleeve.",
    "director": [
        {
            "@type": "Person",
            "name": "John Gorrie",
            "url": "/name/nm0331290/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE3NjQzNzQ5MV5BMl5BanBnXkFtZTcwNTczNDYzMQ@@._V1_.jpg",
    "keywords": "female nudity,female topless nudity,murder,trial,affair",
    "name": "Cause célèbre",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "muteperiod"
        },
        "dateCreated": "2004-09-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092735/"
        },
        "name": "Rare treat of early Pre-Poirot Suchet & Pre-Prime Suspect Mirren",
        "reviewBody": "Mirren is excellent, Suchet in a minor role is excellent, and wait until you hear his spoken English for a terrific contrast with his Poirot...helps you appreciate his acting ability. This 1987 t.v. movie is presented in one part, but there is an obvious editing break right at the halfway mark for it to have perhaps been originally shown in two parts. It opens outdoors on a 1030's London street. One immediately notes, and appreciates, that it was filmed using video. The entire movie is filmed on video tape and it avoids the jarring effect so common in earlier t.v. mini-series and movies which were filmed on the set using video and the outdoor scenes were made on film. Production is quite satisfactory with details of the interior designs of the house, and of the house itself, all period correct. The house is very appropriate for a once-successful middle class architect. Decorative pieces through the house add interest and are very appropriate. However, filmed on video, one is always aware we are watching a set. Still the set has a most satisfying mix of arts and crafts with art deco. The acting is very good all around, as are the costumes, sets, and photography, all adding a texture to this drama based on a true story. Good direction does service to the fine script which does not present the story in a dry straight forward narrative. I do fault the script in being so lacking in details of the young man's home life. We know he lives 30 minutes away on a bicycle, needs a job at during hard times, is 18 and tall, making him look older than he is, few friends, can drive, and his father is very strict. That is about it. We never see a member of his family or any scene of him at his home. The script is rich with subtleties, and who actually did what is answered when Mirren is question during the trial, in a subtle way. If Poirot was there he would be repeating it at the end explaining who did the dastardly deed indeed! However, it is up to you, (as this is not an Agatha Christie formula story), to figure out who did what. You are never clearly told. The answer I assure you is there. If you like Prime Suspect for Mirren, or Poirot for either Suchet or just the period art deco apartment interior, or both, I highly recommend Cause Celebre. Video: 1:33, few minor smear defects from original use of video, otherwise, sound and image is fine. No English subtitles, which I found needing occasionally.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0092735/"
}