{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Melanie Griffith",
            "url": "/name/nm0000429/"
        },
        {
            "@type": "Person",
            "name": "Stephen Dorff",
            "url": "/name/nm0001151/"
        },
        {
            "@type": "Person",
            "name": "Alicia Witt",
            "url": "/name/nm0001860/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16130,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016321/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014903/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024879/"
        },
        {
            "@type": "Person",
            "name": "John Waters",
            "url": "/name/nm0000691/"
        }
    ],
    "datePublished": "2000-09-01",
    "description": "An insane independent film director and his renegade group of teenage filmmakers kidnap an A-list Hollywood actress and force her to star in their underground film.",
    "director": [
        {
            "@type": "Person",
            "name": "John Waters",
            "url": "/name/nm0000691/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Comedy",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWE2YzQ4MDMtZmQ5Yi00YjU5LTkyMzUtYzk5NzY3OTFiM2MwXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "film director,terrorism,low budget film,movie star,stockholm syndrome",
    "name": "Cecil B. Demented",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dfranzen70"
        },
        "dateCreated": "2001-02-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0173716/"
        },
        "name": "Unstill Waters",
        "reviewBody": "Many of you have probably never heard of this film, which stars Stephen Dorff as a rebel filmmaker who goes to some interesting extremes to get his movie made. The film is directed by noted underground director John Waters, and Waters tosses in scores of Hollywood in-jokes (check out the marquee during the opening credits!). The reason more people didn't see this in the theater is simply that it's so... so... different. It's highly unique, and therefore less likely to appeal to a mass audience.\n\nBut you do need to see it, really! Cecil B. Demented (Dorff) is the leader of a motley band of would-be film aficionados who kidnap a Hollywood actress (Melanie Griffith) at the premiere of her latest film. Demented's idea is to make a movie using guerrilla tactics, making the statement that studio films are Bad and independent films are Good. Waters' point is that the studio system is such that any movie coming out of it fits into a formula to make it more palatable to the masses - that is, that the movies you see in the multiplexes are dumbed down for your viewing pleasure.\n\n Demented tries to achieve his vision by staging protests of a sort at movie houses, film screenings, speeches, and even a drive-in. His entourage includes a Satanist, a former porn star, and many other social and sexual deviants. There's hardly a taboo subject Waters doesn't cover here! And to be sure, the character of Demented himself never changes, which is in itself a welcome respite. Had this been a Hollywood film, you might have seen the nefarious filmmaker suddenly see the error of his ways in the final three minutes. I won't give anything away to you, folks, but rest assured that the characters remain true to themselves, except for Griffith's character. She changes, but it's a subtle, honest change. \n\nThere are surprises everywhere you turn, but let me warn you: this is absolutely not a film for everyone. There is plenty here to offend even the most open of minds. It is at once a unique, refreshing, and exciting film. It never even rests to catch its breath - it doesn't want the audience to fall back into its Hollywoodized lull. \n\nMajor kudos for screenwriting go to Waters and to his amazing cast. If you're into offbeat films, please watch this.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2025652505",
        "name": "Cecil B. Demented",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTdkYTE1M2EtNmYxZC00MmE0LWJmMDUtNTY2NjJmMzg4OGViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTdkYTE1M2EtNmYxZC00MmE0LWJmMDUtNTY2NjJmMzg4OGViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:05:37Z",
        "url": "https://www.imdb.com/video/vi2025652505/"
    },
    "url": "/title/tt0173716/"
}