{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kim Basinger",
            "url": "/name/nm0000107/"
        },
        {
            "@type": "Person",
            "name": "Chris Evans",
            "url": "/name/nm0262635/"
        },
        {
            "@type": "Person",
            "name": "Jason Statham",
            "url": "/name/nm0005458/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 102644,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003899/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0152594/"
        },
        {
            "@type": "Person",
            "name": "Larry Cohen",
            "url": "/name/nm0169540/"
        },
        {
            "@type": "Person",
            "name": "Chris Morgan",
            "url": "/name/nm0604555/"
        }
    ],
    "datePublished": "2004-09-10",
    "description": "A young man receives an emergency phone call on his cell phone from an older woman. The catch? The woman claims to have been kidnapped, and the kidnappers have targeted her husband and child next.",
    "director": [
        {
            "@type": "Person",
            "name": "David R. Ellis",
            "url": "/name/nm0254786/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmRmODc1OGEtYzhjOC00Y2FiLWFhNWUtYTJiYjlhMGU0Njk4XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "cell phone,telephone terror,police,violence,home invasion",
    "name": "Cellular",
    "original_info": {
        "id": "Cellular_2004",
        "name": "Cellular",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Li-1"
        },
        "dateCreated": "2005-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0337921/"
        },
        "name": "A thriller worth watching for its exhilaratingly fast pace, situational humor, and Chris Evans' star-making performance.",
        "reviewBody": "Rating: *** out of **** \n\nGimmicky thriller premises are a dime a dozen. Fox's 24 essentially expounds on that idea every episode without any rhythm or consistency. The real trick is executing the idea with the right panache and skill to weave it all into a fun thriller. So is David R. Ellis' Cellular worthy of Phone Booth acclaim, or is it just another Nick of Time? You just might be surprised to see it's every bit as enjoyable as the former, with only occasional hints at the pure cheese of the latter.\n\nYoung beach bum Ryan (Chris Evans) is having just another typical day of sun and fun at the beach, but his girlfriend (Jessica Biel) sees his behavior as lazy and irresponsible. To try and patch things up, he promises to run a few errands for her, but on the way, he receives a call on his cell phone from a stranger named Jessica Martin (Kim Basinger), a woman who claims she's been kidnapped and is being held in the attic of an unfamiliar house. Her call to Ryan was completely random, but the catch is, she has to stay on the line or the signal may be lost for good.\n\nThough initially dubious of her outrageous claims, Ryan quickly comes to believe her after he overhears one of the kidnappers on the phone. Deciding to help out in any possible way he can, Ryan tries to locate her family before the kidnappers do. Unfortunately, obstacles to keeping the phone signal going present themselves at every turn, and Ryan finds he must go through some extreme measures to keep Jessica on the line.\n\nIt's these obstacles that make up at least half the fun of watching Cellular. Whether it's a dying battery, \"typical\" close call encounters with the villains, car chases that require driving backwards or on the wrong side of the road, director Ellis keeps the pace lightning fast by presenting every plausible hindrance there is to keeping a cell phone signal alive. That might not be as immediately catchy a premise as keeping a bus above 50 mph, but it's hard to care when the gimmick is delivered with this much fresh skill and energy. Ellis also directed the enjoyable Final Destination 2, proving he has what it takes to deliver straight-faced thrillers in spite of their naturally ridiculous premises.\n\nBut as terrific a job as Ellis does, it's the cast that keeps the momentum going even when the story starts to sag. As the everyman caught in this horrifying situation, Chris Evans is wholly convincing and immensely appealing as Ryan, playing out an otherwise simple role for all its worth. Most of the movie rests on his shoulders, so it's to no small amount of praise when I say that we eagerly want to follow him through every move of his day-long adventure. Kim Basinger is surprisingly just as good as the kidnapped woman, proving that much like her physical features, her acting skills are improving with age. The other major standout is Jason Statham as the head kidnapper; he's obviously affecting an American accent that's not all that believable, but he brings an intensity to the role that makes him fiercely menacing.\n\nThe plot boasts the expected coincidences and contrivances that are needed to fuel the story, and most of these are easy enough to accept, but there are admittedly a few nagging problems. While I could reasonably believe that the kidnappers wouldn't tie up Jessica and could also accept that she knows just enough about phones to fix one up well enough to make one call, I found it less easy to swallow that the kidnappers wouldn't at least keep a guard posted right outside or inside her room. No biggie, though.\n\nThe more bothersome bits involve a few unlikely coincidences that allow a cop (played by William H. Macy, who delivers another one of his requisite subtly funny performances) to conveniently piece together a number of the clues. Even more troublesome is the climax, which has the unfortunate task of resolving every introduced plot strand, and while the results are still highly entertaining, it comes across a bit messy (though ironically finishing things up on a nice and tidy final note).\n\nStill, the story makes a lot of right choices when a lesser movie would have simply veered off course for good. A plot twist involving the villains' identities and their motives is smart and surprising. The movie also satisfyingly chooses to reveal its surprise villain halfway through rather than saving it for a silly last-minute unveiling.\n\nThe film also boasts a good sense of humor, a lot of it coming from Evans, who handles the comic moments with natural ease (no real surprise, he was also very funny in Not Another Teen Movie). His best moment comes in one scene where he's in a private school searching for Jessica's kid, flabbergasted over his name (which is particularly funny) and how identical every student looks in the same brand of clothing. The laughs don't defuse the tension, though, and it's with this fun mixture of suspense and occasional comic ingenuity that makes this a highly recommended thriller."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3722492697",
        "name": "Cellular",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDg3YWMyNzgtMTQ5OC00ODliLTk4ODktZGVlYzUwMGQ4OTZmXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDg3YWMyNzgtMTQ5OC00ODliLTk4ODktZGVlYzUwMGQ4OTZmXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-06-27T17:04:00.581Z",
        "url": "https://www.imdb.com/video/vi3722492697/"
    },
    "url": "/title/tt0337921/"
}