{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fernanda Montenegro",
            "url": "/name/nm0005244/"
        },
        {
            "@type": "Person",
            "name": "Vinícius de Oliveira",
            "url": "/name/nm0646737/"
        },
        {
            "@type": "Person",
            "name": "Marília Pêra",
            "url": "/name/nm0702479/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 40603,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Central Station",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0312231/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0311990/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0312138/"
        },
        {
            "@type": "Person",
            "name": "Marcos Bernstein",
            "url": "/name/nm0077094/"
        },
        {
            "@type": "Person",
            "name": "João Emanuel Carneiro",
            "url": "/name/nm0138676/"
        },
        {
            "@type": "Person",
            "name": "Walter Salles",
            "url": "/name/nm0758574/"
        }
    ],
    "datePublished": "1998-11-20",
    "description": "The emotive journey of a former schoolteacher who writes letters for illiterate people, and a young boy whose mother has just died, as they search for the father he never knew.",
    "director": [
        {
            "@type": "Person",
            "name": "Walter Salles",
            "url": "/name/nm0758574/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmY4NTY2NGYtZTY1NS00NzZhLTg3ZjYtM2IwM2E5YmI0ZGNkXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "lie,truck,teacher,train,theft",
    "name": "Central do Brasil",
    "original_info": {
        "id": "Central Station_1998",
        "name": "Central Station",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "EUyeshima"
        },
        "dateCreated": "2008-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0140888/"
        },
        "name": "Masterful Montenegro Dominates Salles' Career-Defining Road Movie",
        "reviewBody": "Like Gena Rowlands in this country (who ironically did a similar film, 1996's \"Unhook the Stars\"), Brazil's Fernanda Montenegro is a masterful actress who inhabits her characters wholly with a minimum of fuss and a maximum of personal depth. In this beautifully filmed 1998 film directed by Walter Salles, she offers a superbly realistic portrayal of an aging, embittered spinster named Dora, who earns money by writing letters for illiterate passers-by at Rio de Janeiro's Central Station. At the outset, she is a petty thief who takes the letters and decides with her friend Irene which ones to post if at all. Her dull world changes when Josué, the nine year-old son of a woman for whom Dora has written a letter, suddenly becomes orphaned when the woman is killed by a speeding bus. The letter was to be sent to Josué's father to reunite the family. Now his plight gradually becomes Dora's concern, and over the course of the film, her destiny.\n\nWhat Salles does with great dexterity is show the gradual closeness between Dora and Josué without resorting to any obvious sentimental plot devices, as neither is particularly sympathetic at the beginning and use their surly, obstinate personalities as protective shells. Even though this story has an overly familiar structure, Salles and screenwriters João Emanuel Carneiro and Marcos Bernstein bring a heavy dose of neo-realism within the unfamiliar, non-tourist locales used. It's all reminiscent of Vittorio de Sica's and Roberto Rosellini's classic post-WWII work in Italy like \"The Bicycle Thief\" and \"Open City\". With his later film, 2004's wonderful \"The Motorcycle Diaries\" and now slated to film Jack Keroauc's seminal \"On the Road\", Salles is obviously becoming known as a master of the road movie, and it is easy to see why with this work. Helping considerably is the stunning cinematography of Walter Carvalho, who presents vividly inhabited tableaux with each new phase of the journey from the bustle of inner-city Rio to the open roads to the religious pilgrimage to the new shoebox-style settlement.\n\nBut it is Montenegro who dominates the proceedings as she gradually develops a character who earns our sympathy economically and honestly as she makes every moment count. For example, as she senses herself becoming attracted to Cesar, the religious truck driver, she applies a stranger's lipstick with a quivering hesitation that is almost as heartbreaking as the realization she faces moments later that he has left for good. A real shoeshine boy picked by Salles, Vinícius de Oliveira plays Josué with equal economy and responds to Dora's actions with realism that alternates between touching and frustrating. Smaller roles are filled expertly with Marília Pêra amusingly ebullient as Irene and Othon Bastos compellingly conflicted as Cesar. The climax comes a bit out of left field with the introduction of new characters that provide some amount of closure to Josué's fate and wrap up many of the open plot threads, but the somewhat pat turn does not undermine the genuine strength of the film.\n\nThe DVD provides a nice extra with Montenegro, Salles, and producer Arthur Cohn contributing invaluable audio commentary in English. Salles and Cohn talk about the sources of inspiration for the movie as well as the more technical aspects including the rigors of location shooting with masses of amateur actors and a minimum of art direction and constructed sets. Montenegro speaks less, but like her performance, makes all her comments resonate. It's interesting how variations of the film's basic plot have come up in recent years - for instance, Jan Sverák's 1996 \"Kolya\" from the Czech Republic and Takeshi Kitano's 2000 \"Kikujiro\" from Japan - and this one certainly holds up well as a prototype.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT1M53S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1924989209",
        "name": "Central Station",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjMxMTA1M2EtNjkxNS00MDUwLWI2MTAtYjM0YWFhNWIzZGFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjMxMTA1M2EtNjkxNS00MDUwLWI2MTAtYjM0YWFhNWIzZGFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:05:58Z",
        "url": "https://www.imdb.com/video/vi1924989209/"
    },
    "url": "/title/tt0140888/"
}