{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Ustinov",
            "url": "/name/nm0001811/"
        },
        {
            "@type": "Person",
            "name": "Lee Grant",
            "url": "/name/nm0335519/"
        },
        {
            "@type": "Person",
            "name": "Angie Dickinson",
            "url": "/name/nm0001141/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1328,
        "ratingValue": 4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043754/"
        },
        {
            "@type": "Person",
            "name": "Jerry Sherlock",
            "url": "/name/nm0792338/"
        },
        {
            "@type": "Person",
            "name": "Stan Burns",
            "url": "/name/nm0122875/"
        },
        {
            "@type": "Person",
            "name": "David Axlerod",
            "url": "/name/nm0043476/"
        }
    ],
    "datePublished": "1981-02-13",
    "description": "Detective Charlie Chan helps SFPD solve the many bizarre murders. His clumsy grandson Lee, who's getting married, \"helps\" him. Is the Dragon Queen behind this?",
    "director": [
        {
            "@type": "Person",
            "name": "Clive Donner",
            "url": "/name/nm0232795/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE5YzVmZGUtYTU1Ni00YWRhLThjNTQtYWYxZTM3ZDZkZDI0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "woman murders a woman,murderess,charlie chan character,nine word title,1980s",
    "name": "Charlie Chan and the Curse of the Dragon Queen",
    "original_info": {
        "id": "Charlie Chan and the Curse of the Dragon Queen_1981",
        "name": "Charlie Chan and the Curse of the Dragon Queen",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2007-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082159/"
        },
        "name": "True Parody",
        "reviewBody": "This thing is no fun whatever.\n\nToo bad, because it had a lot going for it.\n\nFirst, there is the Charlie Chan legacy. It was something that walked with the movie-going public during that decade when our current notions of visual narrative evolved. It wasn't particularly influential except for the early notion that our on-screen eye differed from those around him in matters of cognition encoded visually by race. The explicit irony was the Chineseness of the man was deliberately bogus.\n\nSecond there's the appearance of Peter Ustinov. For this bit, you have to know the absolute importance of the fictional Hercule Poirot in how film discovery evolved. Ustinov had just played Poirot in the to-then most high budget detective story filmed. So when we see him (or did when this was new) as a similarly portly, pretentious, internally cogitating detective, it matters.\n\nThird, someone involved was intelligent enough to set the thing properly. It begins with a faded black and white \"old-style\" Chan movie with our modern characters but a couple decades previously. The mystery shown bears on the one in our movie. Later, at the end of our movie, the action takes us to an old moviehouse in Chinatown where a Charlie Chan movie festival is being held. (No mention in our film that Chan has a film persona.) The trademarked end (copied from Poirot) where Chan gathers all the suspects and tells each one why they are the murderer, until revealing the real murderer (after a separately scripted false alarm)  this happens in the scenery loft of the theater where a Chan film is playing below.\n\nNaturally the chase to catch the murderer takes each character in front of the giant screen where the audience applauds them.\n\nBut its the truest of parodies. Usually parodies put new life into old form by adding a new layer of reference. Its a mistake to think that the \"new life\" would be funny, or more entertaining in any way. This is true parody: it took something that was dead and added enzymes to the decomposition.\n\nThere's one joke I appreciated. The Chan films are generally pretty vile in how they handle race. One trick is to set the bottom racially so that Chan can drift at the top in some cerebral racial advantage. That meant that the black driver was nearly subhuman. Stupid, ignoble. \n\nThe driver here is a black man also. Poised, attractive, articulate. We learn some noble things about him at the end.\n\nOh, another small matter of interest. It has a very young Michelle Pfeiffer, very pretty  before she had all that work done on her face.\n\nTed's Evaluation -- 1 of 3: You can find something better to do with this part of your life."
    },
    "url": "/title/tt0082159/"
}