{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlotte Church",
            "url": "/name/nm0161355/"
        },
        {
            "@type": "Person",
            "name": "King Charles III",
            "url": "/name/nm0697608/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 105,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "director": [
        {
            "@type": "Person",
            "name": "David Mallet",
            "url": "/name/nm0539950/"
        }
    ],
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMxNTYxMjk0M15BMl5BanBnXkFtZTcwMTM5NDgxMQ@@._V1_.jpg",
    "keywords": "concert film,classical",
    "name": "Charlotte Church: Voice of an Angel in Concert",
    "original_info": {
        "id": "Charlotte Church: Voice of an Angel in Concert_1999",
        "name": "Charlotte Church: Voice of an Angel in Concert",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2003-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0231342/"
        },
        "name": "Great DVD of Charlotte Church, if you like her kind of singing.",
        "reviewBody": "I was able to borrow this DVD from my library. It is an account of her first concert in a theater before a live audience. The concert footage is only about 35 minutes long, the rest is devoted to showing Charlotte and her family, friends, school, vocal lessons, and all the little things that sudden fame has brought her. As remarkable as her singing is for a 12 or 13 year old girl, to me even more remarkable is her composure and how well she handles herself. She was obviously still a little girl here, and she does not try to downplay that at all. In fact, she opens the concert by bringing her stuffed animal onstage with her.\n\nCharlotte Church is not the best soprano. She is nowhere near it. Sarah Brightman, who sings many of the same songs, is better in every way, as are many others. But Church may well be the best young soprano singing today. And one quality she has, which is essential, the ability to hit her notes right on pitch. Right on pitch! Too many young singers simply don't understand the importance of that. Charlotte Church is the real deal.\n\nI believe as she continues to develop, she will become one of the very best sopranos alive. At age 12 or 13, her voice was still fragile and bell-like, not yet taking on the timbre of a more mature soprano like Brightman. My guess is that she will achieve the prime of her sound in her mid-20s. But right now she is a delight to see and to listen to. Bravo to this young singer, and this DVD is a great one."
    },
    "url": "/title/tt0231342/"
}