{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Casper Van Dien",
            "url": "/name/nm0000680/"
        },
        {
            "@type": "Person",
            "name": "Lauren Graham",
            "url": "/name/nm0334179/"
        },
        {
            "@type": "Person",
            "name": "Christopher Lloyd",
            "url": "/name/nm0000502/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 277,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018039/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015207/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077692/"
        },
        {
            "@type": "Person",
            "name": "Guy Thomas",
            "url": "/name/nm0858895/"
        }
    ],
    "datePublished": "2001-02-14",
    "description": "A repossession agent falls in love with a woman whose rock star father is high on his list of priority accounts.",
    "director": [
        {
            "@type": "Person",
            "name": "Tim Boxell",
            "url": "/name/nm0101521/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Romance",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTczNTYwMTI3OF5BMl5BanBnXkFtZTcwNDM5OTgxMQ@@._V1_.jpg",
    "keywords": "nudity,kitchen,love,wheelchair,wake",
    "name": "Chasing Destiny",
    "original_info": {
        "id": "Chasing Destiny_2000",
        "name": "Chasing Destiny",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "groucho3710"
        },
        "dateCreated": "2004-08-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0156976/"
        },
        "name": "'A charming and funny love story where fate takes surprising turns.'",
        "reviewBody": "Anyone who has rented more than two videos knows that you can't always rely on the words on the back of the box to give you an accurate description of the movie within. So this time you'll get a nice surprise. This is not a big splashy movie. There is one short, funny chase, but no car chases, and although there are a few guns in evidence, no one comes anywhere near getting shot. This is what you might call a relationship movie, moved along by scenes involving lovers who may (or may not) be separated by deception, a parent and child trying to patch up a, well, patchy relationship before it's too late, and old friends just trying to survive in a world they've almost outlived. The cast works well together and makes you hope that everything will turn out well for all of these characters. Casper Van Dien as the writer turned repo man turns in a performance that is smooth, funny, sexy, charming, and even subtle. Johnny Rico a romantic quoting Swinburne? Tarzan writing poetry? Well, yes. It works. Bobby Moritz may have a slick side, but you believe that he can be redeemed by love. Back To The Future's wild-eyed crazy man as a cranky but toned-down and ultimately lovable retired rock star? Well, yes again. After all, he's dying, he's not supposed to have the nutty professor's manic energy and purpose, and Christopher Lloyd shows that he has more gears than over-the-top. Roger Daltrey is almost unrecognizable, but still likable, as a seventies leftover who has neither cut his hair nor lost his talent-or stopped drinking-and Lauren Graham as the woman Bobby may (or may not) be destined to love forever plays sassy but vulnerable very well. The only scenes that are funny are the ones that are supposed to be, everything moves right along, you can actually care about the fate of the characters, and the ending jam session is a blast. A charming and funny love story-just like the box says.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0156976/"
}