{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tamie Sheffield",
            "url": "/name/nm0790814/"
        },
        {
            "@type": "Person",
            "name": "Charity Rahmer",
            "url": "/name/nm0706747/"
        },
        {
            "@type": "Person",
            "name": "Erin Byron",
            "url": "/name/nm1229857/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1387,
        "ratingValue": 3.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024502/"
        },
        {
            "@type": "Person",
            "name": "Lenny Juliano",
            "url": "/name/nm0432240/"
        },
        {
            "@type": "Person",
            "name": "Jim Wynorski",
            "url": "/name/nm0691061/"
        },
        {
            "@type": "Person",
            "name": "William Langlois",
            "url": "/name/nm0486610/"
        }
    ],
    "datePublished": "2003-03-25",
    "description": "Five high school cheerleaders, their coach and a couple of adolescent sex-crazed guys travel to a cabin in the woods for a weekend getaway only to be killed off one by one by an unseen maniac.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Wynorski",
            "url": "/name/nm0691061/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMzMjkwNTIwMF5BMl5BanBnXkFtZTcwMDg3MDAwMQ@@._V1_.jpg",
    "keywords": "female nudity,cheerleader,shower,erotica,bathtub",
    "name": "Cheerleader Massacre",
    "original_info": {
        "id": "Cheerleader Massacre_2003",
        "name": "Cheerleader Massacre",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Katatonia"
        },
        "dateCreated": "2003-04-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328945/"
        },
        "name": "Average slasher",
        "reviewBody": "I'm a huge fan of the Slumber Party Massacre and Sorority House Massacre films, so i was expecting a little more from Cheerleader Massacre. It's not a bad film, but not a great one either. The first 10 minutes i was thinking \"this bites\" but it did get progressively better. There was a horror/slasher movie released back in 1987 called \"Cheerleader Camp\" which is still the better of the two.\n\nMy main complaint with Cheerleader Massacre is the acting, most of the performances are hollow and seem really fake. I really expected better acting quality from a Jim Wynorski project. I also think that this was shot on Digital Video, it just does not have that \"Film\" look. And i could have done without the erroneous flashback to a scene from Slumber Party Massacre...it obviously looks like it really is from an older movie, and most of us have seen it before anyways. Brinke Stevens was only in the film for a minute or so and i don't really understand why it was included. It did nothing for the story, never followed through with it and simply didn't make much sense in the long run.\n\nI haven't yet viewed the film with the commentary track on the DVD, so perhaps it will shed some light on some of those above problems. There is a deleted scene in the DVD which is worth the price alone, i guess it was cut from the actual film (major frontal nudity) so they could get an R rating.\n\nAll in all, Cheerleader Massacre is worth it for fans to see it once. Some people will like it more than others."
    },
    "url": "/title/tt0328945/"
}