{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kira Reed Lorsch",
            "url": "/name/nm0715529/"
        },
        {
            "@type": "Person",
            "name": "Angela Brubaker",
            "url": "/name/nm0115375/"
        },
        {
            "@type": "Person",
            "name": "Jeff Nicholson",
            "url": "/name/nm0629844/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1119,
        "ratingValue": 2.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029237/"
        },
        {
            "@type": "Person",
            "name": "Kevin Campbell",
            "url": "/name/nm0132646/"
        }
    ],
    "datePublished": "2003-11-25",
    "description": "Four perky, clueless cheerleaders from the Happy Valley High Hamsters are mistakenly blamed by the meddling Church Ladies for the invasion of the \"Internet smut\" into their children's bedrooms. The Church Ladies hire Stephen, a se...",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Campbell",
            "url": "/name/nm0132646/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA3MTQ1Nzk4NF5BMl5BanBnXkFtZTcwNjg3NTc0MQ@@._V1_.jpg",
    "keywords": "sex,female removes her dress,female removes her clothes,shaved vagina,cheerleader",
    "name": "Cheerleader Ninjas",
    "original_info": {
        "id": "Cheerleader Ninjas_2003",
        "name": "Cheerleader Ninjas",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dr-worm"
        },
        "dateCreated": "2004-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0235280/"
        },
        "name": "Wow...Just wow",
        "reviewBody": "I have suffered through \"Orgy of the Dead\", \"Rock n'Roll Nightmare\", and the entire \"Slumber Party Massacre\" Trilogy...but nothing, I mean nothing, can compare to the steaming pile of monkey crap that is \"Cheerleader Ninjas.\"\n\nI finished watching this no more than an hour ago and am still reeling from the horror. Let me say first and foremost, that I love bad movies; I think they are hilarious and cannot get enough of them but this...this made me hurt.\n\nAll you have to know is there are good cheerleaders (snobby, bitchy, condescending, all you could ask for) and then there are the bad cheerleaders (snobbier, bitchier, and really quite gross) led by the extremely gay Evil Stephan (you know he is gay because they mention it during the credits at least twice. Seriously). Then there are these nerds decked out in Star Trek apparel that do an awful lot of masturbating (with condiments no less) and more farting than all of the Farrelly brothers movies combined.\n\nSounds like good, IL' tasteless fun, right? Wrong.\n\nThe problem is the movie tries waaaaay too hard to be funny; this type of humor works great in films like \"Porky's\", hell even \"American Pie\" but these guys can't get the jokes, or anything else to work. Granted there is some, not much but some gratuitous nudity, including a quick beaver shot but it's hardly worth sitting through all 110 minutes of this crap. That's right, it's almost two hours long. Further proof than the best bad movies are 90 minutes or less.\n\nRent at your own risk."
    },
    "url": "/title/tt0235280/"
}