{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Renée Zellweger",
            "url": "/name/nm0000250/"
        },
        {
            "@type": "Person",
            "name": "Catherine Zeta-Jones",
            "url": "/name/nm0001876/"
        },
        {
            "@type": "Person",
            "name": "Richard Gere",
            "url": "/name/nm0000152/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 234507,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043341/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091980/"
        },
        {
            "@type": "Person",
            "name": "Bill Condon",
            "url": "/name/nm0174374/"
        },
        {
            "@type": "Person",
            "name": "Bob Fosse",
            "url": "/name/nm0002080/"
        },
        {
            "@type": "Person",
            "name": "Fred Ebb",
            "url": "/name/nm0247939/"
        }
    ],
    "datePublished": "2003-01-24",
    "description": "Two death-row murderesses develop a fierce rivalry while competing for publicity, celebrity, and a sleazy lawyer's attention.",
    "director": [
        {
            "@type": "Person",
            "name": "Rob Marshall",
            "url": "/name/nm0551128/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Comedy",
        "Crime",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2E3NDU1ZTktNzZjNy00MWU3LWI4YmMtMjdjNTIzMDU0MDdiXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
    "keywords": "1920s,prison,newspaper,bad girl,based on stage musical",
    "name": "Chicago",
    "original_info": {
        "id": "Chicago_2002",
        "name": "Chicago",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "uglykidmatt"
        },
        "dateCreated": "2003-01-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0299658/"
        },
        "name": "Tuneful entertainment with a message",
        "reviewBody": "\"Chicago\" represents the latest salvo in a mini-revival of one of Hollywood's most venerated genres: the live-action musical. Since the end of the golden age of big-budget studio song and dance extravaganzas, musicals have appeared only at irregular intervals, and most have met with mixed critical response and equally indifferent gross figures (the most recent example: Alan Parker's box-office also-ran \"Evita\"). But the holiday-season success of the Coen brothers' music-filled Depression comedy \"O Brother, Where Art Thou?\" (2000) indicated a new song filling the Hollywood air, a notion confirmed last May with the release of \"Moulin Rouge\". Baz Luhrmann's phantasmagorical tale of 19th-century Parisian decadence, memorably scored with contemporary pop tunes, may not have set the summer box office on fire, but it was heaped with critical raves, won an enthusiastic cult following, and became the first musical in decades to receive a Best Picture Oscar nomination.\n\n\"Chicago\", the feature-film debut of veteran stage director / choreographer Rob Marshall, is not as radical or experimental as Luhrmann's picture. Like \"Evita\", it is a cinematic adaptation of a hit Broadway show, namely Bob Fosse's tale of two 1920s murderesses who milk their crimes for headline-grabbing glory. And, like Parker's film, it doesn't attempt to re-invent the musical; it's content to be a solid, well-crafted genre product that knows what audiences expect from a musical and delivers in spades.\n\nIndeed, the story (adapted from the original musical by \"Gods and Monsters\" scribe Bill Condon) is the most radical thing here, following as it does the exhilarating up-and-down fame rollercoaster of two cold-blooded killers. Roxie Hart (Renee Zellweger) is a wannabe, a small-time song-and-dance girl who looks at the bright lights of the Chicago clubs and longs for her night in the spotlight. She gets it in a rather unexpected way after she kills her lover (Dominic West), a sleazy furniture salesman who'd filled her heads with lies about showbiz connections. Sent to prison, Roxie finds that the public's thirst for scandalous headlines has turned her into a celebrity, and the scared, confused young murderess transforms into a media monster, playing the people like an orchestra and turning her crime into an act of self-sacrifice. Roxie's rise to fame incurs the wrath of her one-time showbiz idol, Velma Kelly (Catherine Zeta-Jones), a Louise-Brooks-bobbed former chorine who's doing time for killing her sister and philandering hubby...and who was the number-one star of Murderess Row until Roxie sauntered in. Caught between these two vixens is Billy Flynn (Richard Gere), Chi-town's biggest celebrity lawyer, who's representing them both...and who has a few \"razzle-dazzle\" tricks of his own up his sleeve.\n\nAs anyone who ever saw Bob Fosse's films (\"Cabaret\", \"STAR80\") can attest, the man had a cynical streak a mile wide, so it's not hard to see why the tawdry material of \"Chicago\" (based on a real 1920s murder case) was attractive to him. Condon, fortunately, does not file down the story's rough edges, and his script scores some trenchant observations on the curious nature of modern celebrity. Velma and Roxie are just like Lorena Bobbitt, Kato Kaelin, and all those other small-timers who, through one stupid action or simply by being in the wrong place at the right time, become famous beyond any right they actually have to achieve such heights. And who lets such undeserved accolades come their way? Us, of course. The film's howling chorus of reporters and courtroom gawkers eagerly sucking up the latest sensational story are the on-screen stand-ins for the audience, whose appetite for scandal and thrills has become so insatiable that the unremarkable are remarked upon, the unworthy celebrated, the evil elevated.\n\n It's a deep message for what is essentially a song-and-dance comedy, but Condon allows himself to engage its darker implications without cramming \"message\" down our throats. We are, after all, mainly here to see the numbers, and Marshall's expertise with choreography and music makes sure the songs (composed by \"Cabaret's\" John Kander and Fred Ebb) pack a satisfying punch. \"Roxie\" is our little killer's exhilarating ode to her impending fame, complete with her name in big red lights. \"Cell Block Tango\" finds Velma and a gaggle of murderesses singing about how their victims all \"had it comin'\", complete with some admirably sleazy choreography. Marshall's imaginative staging of \"We Both Reached For The Gun\", a musical press conference, has Roxie as Billy's wooden ventriloquist's dummy and the reporters as marionettes under his control. And, of course, there's a knockout closing duet for Velma and Roxie, the biting, excitingly filmed \"Nowadays\". I've never seen \"Chicago\" onstage, but if this movie captures the energy of the show, it must be one showstopper after another.\n\nMarshall's direction is not always as assured as his staging of the musical numbers. Oddly, the film almost feels like it was shot in sequence, as Marshall's initially choppy editing and scene-pacing grows progressively more seamless as the picture goes along. This is crucial, as the numbers all take place in a sort of fantasy nightclub cut off from the main action. Still, Marshall generally gets high marks for his debut, and he is ably abetted by a top-notch technical crew. In addition to the aforementioned editing (by Martin Walsh), strong work is put forward by costume designer Colleen Atwood (who nicely recreates the sometimes anachronistically revealing dance outfits of the stage show), cinematographer Dion Beebe, and the set design crew, led by production designer John Myrhe, who are able to make their squalor a little more authentic than what one would see on a stage.\n\nOf course, as with any musical, the lion's share of the picture's success rests on the shoulders of its performers, and while Astaire and Garland aren't losing any sleep, \"Chicago\"'s cast members acquit themselves surprisingly well as song-and-dance artists. Gere, slick with oily charm, displays a witty way with a lyric and a nice relaxed tap-dance style. Zeta-Jones, a dancer in London before she hit the silver screen, shows off the flashiest moves of anyone here, all the while oozing fearsome sexuality. Also turning in fine work are Queen Latifah as the corrupt warden of the women's prison and John C. Reilly as Roxie's hapless cuckold of a husband, whose \"Mr. Cellophane\" poignantly sums up his nowhere-man status.\n\nAs far as I'm concerned, though, this is Renee Zellweger's show all the way. For me, Zellweger's onscreen work has been wildly uneven, ranging from the agreeable \"Jerry Maguire\" to \"Me Myself & Irene\", where she seemed stunned to find herself in front of a movie camera. Here, however, her confidence is exhilarating, and as Roxie transforms from a timid criminal to a vampish media super-vixen, Zellweger projects sex, sarcasm, and sweetness (often insincerely) like nothing I've seen from her before. Her dancing is not as polished as Zeta-Jones's, but she more than holds her own, and her numbers are easily the most memorable of the film. Roxie may not be a star, but Zellweger certainly is here; I'm rooting for her to take home a Best Actress Oscar for this.\n\n\"Chicago\" is not quite the masterpiece some of the early reviews have suggested. The lack of a more experienced director keeps it from being more than a top-notch screen transfer of a venerated stage work. Nevertheless, the film is funny and exciting, with plenty of memorable numbers, and it proves for sure that the success of \"Moulin Rouge\" wasn't a fluke.\n\n Now...how about that Sweeney Todd movie finally?"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #1 Post Miramax Collector's Edition",
        "duration": "PT1M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2867764761",
        "name": "Chicago",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDQ4OWQ1MzctMTQzMC00MDQ0LWIzYWQtZjM4NTJhNTE2NDhmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDQ4OWQ1MzctMTQzMC00MDQ0LWIzYWQtZjM4NTJhNTE2NDhmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:13:12Z",
        "url": "https://www.imdb.com/video/vi2867764761/"
    },
    "url": "/title/tt0299658/"
}