{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Alec Newman",
            "url": "/name/nm0627995/"
        },
        {
            "@type": "Person",
            "name": "Julie Cox",
            "url": "/name/nm0185107/"
        },
        {
            "@type": "Person",
            "name": "Ian McNeice",
            "url": "/name/nm0573862/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14176,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0382790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049334/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069955/"
        }
    ],
    "datePublished": "2003-03-16",
    "description": "The twins of Paul \"Muad'dib\" Atreides become embroiled in the political landscape of Arrakis (\"Dune\") and the rest of the universe.",
    "genre": [
        "Adventure",
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3ODIwMTQ5OF5BMl5BanBnXkFtZTYwNTkwNDk5._V1_.jpg",
    "keywords": "planetary romance,psychotronic series,dystopian sci fi,timeframe after 2050,space opera sci fi",
    "name": "Children of Dune",
    "original_info": {
        "id": "Children of Dune_2003",
        "name": "Children of Dune",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ZMAN738"
        },
        "dateCreated": "2004-05-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0287839/"
        },
        "name": "Magnificent Production",
        "reviewBody": "Personally I really enjoyed *Children of Dune*. First the major issue about the faithfulness to the books. To quote director Greg Yaitanes; \"Try not to get hung up on such details as whether the twins are too old or too young, the eyes are too blue or not blue enough, or that the book says this and we did that. You'll end up robbing yourself of a great experience. The Dune universe is so wonderful because of how human and real its characters are. To not respect that would be the worst offense any of us could make.\" He's got that straight. This is an adaptation not a re-creation. The screenplay by John Harrison managed to fit in enough of Frank Herbert's vision to remain true to the spirit of the epic Dune saga.\n\nThe entire cast, Alec Newman [Paul Muad'Dib], Daniela Amavia [Alia Atreides], Julie Cox [Princess Irulan], Barbaroa Kodetova [Chani], James McAvoy [Leto II], Jessica Brooks [Ghanima], Susan Sarandon [Wensicia Corrino], Alice Krige [Reverend Mother Jessica Atreides], Edward Atterton [Duncan Idaho], Ian McNeice [Baron Harkonnen], Steven Berkoff [Stilgar], P.H. Moriarty [Gurney] and Johathan Bruun [Farad'n Corrino] gave me characters I could relate to as well as care about over the course of the miniseries. I especially enjoyed watching Alice Krige because her ability to convey depth of emotion with facial expressions is a well developed art.\n\nThe CGI effects were fantastic. Sharp & crisp. The best I've seen done on television and the use of computer generated 3-D backgrounds added so much stature to the sets. CoD was far superior to *Dune* which used mat backgrounds in terms of it's visuals. The movement of CGI objects like Thopters around CG backgrounds and the use of shadow rendering to add realism were absolutely first rate. As an example the shots of the Thopter landing at the Royal Palace in Arrakeem where the ships shadow moves across buildings then follows it down to the landing pad brought a big smile and a sigh...wow! CoD won an Emmy Award in 2003 (Special Visual Effects for a Miniseries, Movie or Special). \n\nThe costumes by Academy Award winner Theodor Pistek and his son Jan were outstanding. A visual feast for the eyes & the heart. The wedding scene at the Royal Palace was as worthy as any major motion picture costume drama and should have earned another Emmy in the costuming category.\n\nThe cinematography by Arthur Reinhart was stunning. The use of High Definition digital cameras instead of standard 35mm film and being shot in 16:9 true LBX format also made it look like a feature film rather that a TV miniseries (the DVD looks great as well). The use of lighting during camera pans over actors faces or on shots as characters moved across sets was again vary well used.\n\nThe music score by Brian Tyler was at times dark and moody, then majestic, adding to the grandeur of many of the key scenes where the score helped lift one's feelings to the level of emotion being presented by the actors as the story unfolded on the screen. The background soundtrack as the camera followed characters though the zocalo's of Arrakeem or the desert sietche's added a mystical quality where one could almost smell the food cooking or the incense like fragrance of the Spice Melange.\n\nOverall *Children of Dune* has to rate with the best mini-series' that have ever been produced over the years and may even set a new standard for work being done for television with it's quality production. A 9 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Frank Herbert's Children Of Dune",
        "duration": "PT59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3593518361",
        "name": "Frank Herbert's Children Of Dune",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzk2OTA1ZDAtM2QxNy00YzNjLTk4NjYtMDllZGZhNzYzMGJmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzk2OTA1ZDAtM2QxNy00YzNjLTk4NjYtMDllZGZhNzYzMGJmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-07T00:48:29.477Z",
        "url": "https://www.imdb.com/video/vi3593518361/"
    },
    "url": "/title/tt0287839/"
}