{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cristina Ionescu",
            "url": "/name/nm1558332/"
        },
        {
            "@type": "Person",
            "name": "Mihai Alexandre Tudose",
            "url": "/name/nm1559984/"
        },
        {
            "@type": "Person",
            "name": "Violeta 'Macarena' Rosu",
            "url": "/name/nm1560606/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2398,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050767/"
        }
    ],
    "datePublished": "2003-10-05",
    "description": "A profile of homeless Romanian children who were born victims of the nation's reckless population growth policy during its communist era.",
    "director": [
        {
            "@type": "Person",
            "name": "Edet Belzberg",
            "url": "/name/nm0069797/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc5MjQxNjAxMV5BMl5BanBnXkFtZTcwMjk3NTEyMQ@@._V1_.jpg",
    "keywords": "starvation,title directed by female,subway,romania,starving child",
    "name": "Children Underground",
    "original_info": {
        "id": "Children Underground_2001",
        "name": "Children Underground",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vertigo_14"
        },
        "dateCreated": "2006-05-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0264476/"
        },
        "name": "Heartbreaking. (spoilers)",
        "reviewBody": "I had often wondered why, in the documentary portrayal's of street kids, 'Streetwise' was the one to garner all of the attention. Granted, it too, was a heartbreaking look at some kids affected by some pretty tumultuous times in this country thanks to many idiot policymakers euphemistic ideas about trickle-down economies. Sad as it is to say, I think the appeal comes from 80s nostalgia, and particularly nostalgia for the 80s American teenager. 'Children Underground,' which follows five children living in a subway station in Romania is much more disturbing and stark portrayal than Streetwise. As the prologue explains, many children found themselves on the street because, after the fall of Communism in Romania, the economy and state facilities in particular were effected and became ill-equipped to deal with hardships. Although, some of the kids portrayed in this documentary left home as a result of family problems.\n\nOf the five children are Cristina Ionescu (16) is the oldest and I suppose the protectorate of the group of subway children. Although, she never seems to be too sincere in this role, beating the younger ones herself sometimes. Her background involves shifts between state custody in an orphanage and later an asylum because, as she said, she refused to let herself be beaten or taken advantage of and fought back.\n\nMihai Tudose was probably the most interesting among the street children; a 12 year-old boy who ran away from home because, as he explains, his father beat him. He always seemed to be in search of something better than the street life, but it just didn't seem that many were able to help him out. For example, we see him attending the school for street children, but when the social workers went home to get the papers that would enable his attendance, his parents wouldn't give them up. He was, just as the synopsis for the film says, a particularly intelligent boy. He just seemed to want to give up life in the subway in exchange even for the company of a pseudo-family (the homeless mother and the baby living in the abandoned building).\n\nMacarena Rosu (14) was perhaps the saddest case because she basically spends the entire film huffing paint with other street kids. And, to the point that by the end, it seems that she has become either schizophrenic or manic depressant as a result, rationalizing her existence with the imaginary mother and father living outside of Bucharest and the twin sister by the same name attending private school, even though we know her to have arrived on the streets straight from an orphanage.\n\nAna and Marian Turturica are the youngest of the group. They never really get the full story as to why Ana (10) kept running away from home or why she eventually got her brother, Marian (8) to come with her. I would suspect, based on the stepfather's conversation, that it was because she at least did not get along with him. Or, that they felt incapable of living with their mother while she and the stepfather were unemployed and barely surviving themselves.\n\nThere doesn't seem to be much that could be done through the state to help these children. The hospital for street kids, for example, had no place to house the children. There were other facilities that were so limited on beds that the children first had to be deemed capable of rehabilitation, which basically meant that, since these children were hoooked on huffing paint, it wasn't likely that they would be admitted. And the older ones, it seemed, stood no chance of consideration at all.\n\nI think in part that this movie was more stark than Streetwise is because so many of the children weren't yet even teenagers when the movie was filmed. And few of them seem to be living in any sort of euphoric sense of freedom. The situation is bad and they appear to well aware that for many of them, they're trapped in it. (Although, that is not to make light of the situations faced by the kids in Streetwise). It is, as other said, a hard to film to take in. There are scenes in the film where you wish the filmmakers, if no one else, would intervene. Especially in the moments where the youngest are beat up, where Mihai inflicts mutilation upon himself, of the kids who spend all day with their face in bag full of Aurolac paint, of the underfunded facilitaties that couldn't provide enough assistance, and also of the families who seem just as hopeless as the children. It is indeed an incredible piece of film-making.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0264476/"
}