{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Connie Britton",
            "url": "/name/nm0110168/"
        },
        {
            "@type": "Person",
            "name": "Colin Friels",
            "url": "/name/nm0295506/"
        },
        {
            "@type": "Person",
            "name": "Hinton Battle",
            "url": "/name/nm0061507/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 478,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035722/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013021/"
        },
        {
            "@type": "Person",
            "name": "Shirley Temple",
            "url": "/name/nm0000073/"
        },
        {
            "@type": "Person",
            "name": "Joe Wiesenfeld",
            "url": "/name/nm0927618/"
        }
    ],
    "datePublished": "2001-05-13",
    "description": "The life, laughters, and luck of one of the most famous and beloved child stars, Shirley Temple.",
    "director": [
        {
            "@type": "Person",
            "name": "Nadia Tass",
            "url": "/name/nm0850958/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUzOTg4NjQ1NF5BMl5BanBnXkFtZTcwODgzOTIyMQ@@._V1_.jpg",
    "keywords": "amelia earhart character,grauman's chinese theatre los angeles,oscar statuette,shirley temple character,john ford character",
    "name": "Child Star: The Shirley Temple Story",
    "original_info": {
        "id": "Child Star: The Shirley Temple Story_2001",
        "name": "Child Star: The Shirley Temple Story",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sandiego-4"
        },
        "dateCreated": "2001-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0233274/"
        },
        "name": "Child Star misses what makes Shirley Temple a phenomena.",
        "reviewBody": "Child Star is appropriately produced by someone who knows something about the subject...Paula Hart, mother of Melissa Joan Hart (\"Sabrina the Teenage Witch\"). Paula Hart has with varying success parlayed her famous daughter's success into careers for herself as producer and her other children. And though the Family Hart has shown to have talent in each of their endeavors, this particular film was just too much for them to handle. Melissa Joan is also listed as a producer (the name that set the deal in motion), and Melissa's sister Emily (the voice of the animated version of Sabrina) stars as teenager Shirley Temple. Emily is cute, as is Ashley Rose Orr who portrays the younger Shirley, and both are good actresses, but neither capture the essence of the child star that created a phenomena during the depression. Ashley Rose Orr has talent as the younger Shirley but not the button-nose or the frail body of the moppet that danced on table tops and under the legs of such human scarecrows as Buddy Ebsen. Shirley Temple was a \"glass doll\" who acted tough. That's what made us laugh. The fact that her character THOUGHT she could lick the world with her fists, and in reality could by melting the hearts of her opponents with her optimism. Without her personality, she was dead meat. Ashley Rose Orr looks like she could handle herself quite well in a fight, and probably would have to given her personality. I think she will make a fine actress, she just wasn't up to this particular role beyond the song-and-dance routines. And I am afraid her nose was just too big to make a convincing Shirley Temple. Emily Hart is slightly more convincing probably because the image of an older Shirley Temple is not as embedded into our senses. Finally, this was an authorized film based on Shirley Temple Black's fine autobiography. Great biographical films present a story researched from different points of view. Child Star leaves us with a film based on Mrs. Black's perspective and doesn't delve into the effects she left on her millions of fans, and the world. What separates Shirley Temple from the countless \"true Hollywood stories\" is the sense of hope she brought to a depression stricken America. It is this phenomena that the producers failed to capture, thus making Shirley Temple just a Melissa Hart of the 30's and 40's. Sorry Paula Hart, Shirley Temple was...and is...much more than a Child Star."
    },
    "timeRequired": "PT1H35M",
    "url": "/title/tt0233274/"
}