{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elena Kampouris",
            "url": "/name/nm4502102/"
        },
        {
            "@type": "Person",
            "name": "Kate Moyer",
            "url": "/name/nm4280291/"
        },
        {
            "@type": "Person",
            "name": "Callan Mulvey",
            "url": "/name/nm0612534/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1352,
        "ratingValue": 3.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0800001/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0733689/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0544208/"
        },
        {
            "@type": "Person",
            "name": "Kurt Wimmer",
            "url": "/name/nm0934483/"
        },
        {
            "@type": "Person",
            "name": "Stephen King",
            "url": "/name/nm0000175/"
        }
    ],
    "datePublished": "2023-03-21",
    "description": "The film describes the events leading up to, and including, the massacre of the adults of a small town in Nebraska by their children, after the adults' irresponsibility ruins the crop and the children's future.",
    "director": [
        {
            "@type": "Person",
            "name": "Kurt Wimmer",
            "url": "/name/nm0934483/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGZiY2FlNzgtYWNkMS00NjMxLWE5YmEtYjg4ODY1OGM3ZDY3XkEyXkFqcGdeQXVyMzQwMTY2Nzk@._V1_.jpg",
    "keywords": "cult,based on short story,prequel,supernatural horror,slasher horror",
    "name": "Children of the Corn",
    "original_info": {
        "id": "Children of the Century_1999",
        "name": "Children of the Century",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "punisherversion1"
        },
        "dateCreated": "2023-03-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt12311866/"
        },
        "name": "Interesting failure of a flick",
        "reviewBody": "Children of the Corn Directed by Kurt Wimmer. Written by Kurt Wimmer\n\nChildren of the Corn has been remade twice now and had a buttload of sequels of all quality. This little bitty short story has inspired film after film after film. What about this story draws people back? It's about a small Nebraska town where possessed children murder all the adults in their town to appease He Who Walks behind the rows. A couple stumble upon an escapee and when seeking help, they run into the crazed children and this diminutive preacher leading the way. Now it sounds interesting in theory but the problem that has remained throughout is that kids are not scary. They are not scary in the slightest.\n\nThis kind of rectifies that a little bit. Now this is not a retelling of the original film and the short story. It is telling the story of what happened to the town originally. The town is dying. The corn is dying. The children are watching as the adults are making decisions to change the fundamental structure of the town they grew up in and they have no say in what happens. This is very much an allegory for climate change. They're trying to change it up from a more religious angle. If you're going to remake it, bring something different to the party. It works sort of. That's what this movie does. There are snippets of interesting story ideas trying desperately to claw out.\n\nI know the behind the scenes turmoil with production shutting down due to Covid and many scenes being piecemeal. They actually did a fairly good job considering the limitations. I try not to grade on a curve but sometimes you have to. What would this movie be like with no limitations and made exactly as Kurt Wimmer wanted?\n\nThis movie doesn't work without its two leads. They're child actors and that's astonishing when you think about it. Kate Moyer plays Eden, the leader of the children. She has a way with her words that shows she has that dichotomy in her demeanor. She is finally speaking up and has no qualm about killing to get her way. She has convinced all of the children except for a few to change this town. She is dangerous and unpredictable. You never really know what she is going to do. I think she has a bright future ahead. She rides a horse and just commands the screen. It was incredibly impressive.\n\nThe other performer that Eden plays off of is Bo played by Elena Kampouris. She is 17 trying to survive with her brother watching her parents' marriage fall apart. She speaks up for the town and wants to enact change. She is carrying the weight of her family on her shoulders so when things get grim and dark really quick, her vulnerability she wears on her sleeves.\n\nYou want her to succeed. You want her to save the town and save the adults. You're cheering for her even though the plot hits predictability and you need those taped pieces of story to smooth it over. It wants to throw you into a monster flick as it progresses to its conclusion. It wants to crank you into a thrill ride but I'm not sure that was the best way to go. Ambiguity could have made more things more terrifying. This movie is not scary. I'm not sure it is trying to even go down that road. I was intrigued by the design of He Who Walks. It feels more like an environmental horror flick in the style of Prophecy with its ManBearPig.\n\nI have to say this was an interesting failure of a flick. I also think we're done with Children of the Corn. The story has been told in all the ways it can be told.\n\nI give this movie a C.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Describes the events leading up to, and including, the massacre of the adults of a small town in Nebraska by their children, after the adults' irresponsibility ruins the crop and the children's future.",
        "duration": "PT1M53S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1549387033",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDQ1MGJkYzgtZDcyMC00YjBmLTg3MTAtMWU3NjMyOTliNWRlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDQ1MGJkYzgtZDcyMC00YjBmLTg3MTAtMWU3NjMyOTliNWRlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2023-02-13T22:07:21.486Z",
        "url": "https://www.imdb.com/video/vi1549387033/"
    },
    "url": "/title/tt12311866/"
}