{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anna Karina",
            "url": "/name/nm0439344/"
        },
        {
            "@type": "Person",
            "name": "Margit Carstensen",
            "url": "/name/nm0141380/"
        },
        {
            "@type": "Person",
            "name": "Brigitte Mira",
            "url": "/name/nm0591930/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4452,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "Chinese Roulette",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0089865/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052216/"
        },
        {
            "@type": "Person",
            "name": "Rainer Werner Fassbinder",
            "url": "/name/nm0001202/"
        }
    ],
    "datePublished": "1977-03-30",
    "description": "Both parents of a young teen who walks with crutches secretly meet their lovers, who both surprise each other at the family's country home. The daughter arrives and initiates a guessing game of \"Chinese roulette.\"",
    "director": [
        {
            "@type": "Person",
            "name": "Rainer Werner Fassbinder",
            "url": "/name/nm0001202/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjIxZjVkMDQtMTczNy00MDEzLWFmMzItNDNhMWUxYWU2YTE3XkEyXkFqcGdeQXVyNTcwNjUwNzk@._V1_.jpg",
    "keywords": "guessing game,extramarital affair,mother daughter estrangement,teenage girl with a disability,husband and wife cheating on each other",
    "name": "Chinesisches Roulette",
    "original_info": {
        "id": "Chinese Roulette_1977",
        "name": "Chinese Roulette",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbill-74877"
        },
        "dateCreated": "2022-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074312/"
        },
        "name": "Left me cold",
        "reviewBody": "The setup to this film is straightforward: a married couple cheating on each other are tricked into showing up at their mansion in the country with their lovers at the same time, a maneuver orchestrated by their daughter and her nanny, who show up to watch what happens. Initially the two sets of lovers laugh it off and appear to take what's going on in a very mature way, but gradually we begin to see repressed discomfort and fractured relationships. The housekeeper and her adult son at the mansion play an active role as well, including in the titular parlor game which reveals the cruel way in which one of the people is perceived.\n\nDespite the simple premise, a lot of the history and relationships between these characters remains frustratingly vague and out of reach. It's clear the girl harbors a lot of bitterness towards her parents, seeing the connection of her disability to her parents' infidelities. It's clear that the husband and wife have the most in common at the dinner table, where they do all the talking, but when it comes to an emotional connection and the power of touch afterwards, it's with their lovers. And, I have to say, between the liars, those who are vindictive, and the pseudo-intellectuals, it's pretty damn clear that all of these characters are pretty unlikeable. Beyond that, it's open to interpretation for what Fassbinder was trying to say here.\n\nThere are references to Katowice, fascism, and the question of what role a person from today would play during the Third Reich, which along with the cinematography of Michael Ballhaus centering on reflections and mirrors we see made me wonder if a part of this was dealing with Germans of the 1970's coming to terms with their country's Nazi past. There are also aspects that are simply unexplained, such as the line the husband says to the housekeeper, \"Ali Ben Basset was murdered in Paris last week. We're the last two left now,\" the housekeeper inexplicably calling for assistance at the Traunitz manor (which is the nanny's name), and that final gunshot. I liked how it wasn't clear-cut and made me think, but these felt too vague and therefore lost a good portion of their power, at least to me. I also hated the morality tale like ending, with the narration of the traditional marriage vows.\n\nI liked the setup, the visuals, and how the film was constrained to 86 minutes, but I didn't care for these characters, the cold way they were treated, or the script. It just felt like the film was more pretense than substance, which left me disappointed by the time it ended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Both the parents of a young teen who walks with crutches, goes on each their secret meeting with lovers, both surprising each other at the family's county home. The daughter arrives and initiates a guessing game of \"Chinese roulette\".",
        "duration": "PT2M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi78430745",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjgzOGFjMDUtYzY1OC00Y2RlLWE0NjgtNDAyMzI1NjEzYTY2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjgzOGFjMDUtYzY1OC00Y2RlLWE0NjgtNDAyMzI1NjEzYTY2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-04-20T18:33:42.866Z",
        "url": "https://www.imdb.com/video/vi78430745/"
    },
    "url": "/title/tt0074312/"
}