{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yan Cui",
            "url": "/name/nm0191285/"
        },
        {
            "@type": "Person",
            "name": "Diana Pang",
            "url": "/name/nm0659381/"
        },
        {
            "@type": "Person",
            "name": "James Purcell",
            "url": "/name/nm0700725/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 126,
        "ratingValue": 5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Qi Chang",
            "url": "/name/nm0151795/"
        },
        {
            "@type": "Person",
            "name": "Yan Cui",
            "url": "/name/nm0191285/"
        }
    ],
    "datePublished": "1998-07-10",
    "description": "Searching for love abroad, two very different Chinese women, a dancer and a doctor, follow their dreams and journey west to Canada. They quickly learn that the paths of heart are rocky as the men in their lives reveal dark, unsett...",
    "director": [
        {
            "@type": "Person",
            "name": "Yan Cui",
            "url": "/name/nm0191285/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzMDYzMDAzMF5BMl5BanBnXkFtZTcwNDU2MzAwMQ@@._V1_.jpg",
    "keywords": "female rear nudity,love,chinese,f rated,nudity",
    "name": "Chinese Chocolate",
    "original_info": {
        "id": "Chinese Chocolate_1996",
        "name": "Chinese Chocolate",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2007-08-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115887/"
        },
        "name": "Nice production values, but STILL a rather awful film",
        "reviewBody": "Ugghhh!!! Did I ever hate this dull little film. The reason I chose to see Chinese CHOCOLATE is because it was a film about Chinese immigrants living in Canada and some of my favorite films have this, or a similar plot (such as DOUBLE HAPPINESS and BOLLYWOOD/Hollywood). However, instead of having the wonderful and endearing characters like these two other films, the overwhelming messages were \"men suck\" and \"women are idiots\"--not exactly messages you want to hear if you want to like anyone in the film! This black & white view of people seemed really immature and silly, yet every single man in the film turned out to be scum by the end of the film--either by cheating on their partners repeatedly, using their women or whoring them out in order to make a buck!! And these were meant to be mostly middle-income people--not inmates or members of a Chinese gang--just \"regular\" folks!!! And as for the women, they were apparently supposed to be seen as victims of these men, BUT considering that the women blindly walked into these sick relationships and acted rather amorally, it was really tough to feel sorry for anyone. One woman was angered to find that her husband was cheating on her and yet later she had an affair with another woman's husband!! And this same woman moved to America and left her child with her parents!! How can the audience give a darn about anyone so self-involved and awful?! I sure couldn't and I give this movie a 3 simply for production values--the story itself doesn't even merit a 1! Truly this is an ugly and pointless film about ugly and pointless people--what the heck were the writers and director trying to say?! This is a man-hating film that has a lot of sexual content. Because of this (and especially because the film is so morally ambiguous), I strongly recommend you don't let children see it...let alone yourself!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0115887/"
}