{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shirley Chisholm",
            "url": "/name/nm1596930/"
        },
        {
            "@type": "Person",
            "name": "Walter Cronkite",
            "url": "/name/nm0004847/"
        },
        {
            "@type": "Person",
            "name": "George Wallace",
            "url": "/name/nm0908650/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 314,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0151922/"
        }
    ],
    "datePublished": "2004-01-18",
    "description": "A documentary on Brooklyn-based Congresswoman Shirley's Chisholm's 1972 presidential bid.",
    "director": [
        {
            "@type": "Person",
            "name": "Shola Lynch",
            "url": "/name/nm0528454/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk5MTczMTYyNV5BMl5BanBnXkFtZTcwOTUxNzcyMQ@@._V1_.jpg",
    "keywords": "f rated,triple f rated,politics documentary,character name in title",
    "name": "Chisholm '72: Unbought & Unbossed",
    "original_info": {
        "id": "Chisholm '72: Unbought and Unbossed_2004",
        "name": "Chisholm '72: Unbought and Unbossed",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pswift"
        },
        "dateCreated": "2004-06-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0388835/"
        },
        "name": "Winning Combination: Underdogged, but Not Darkhorsed",
        "reviewBody": "Shirley Chisholm's run for the 1972 Democratic Presidential ticket will never be a textbook case on how to run and win an election. But it does demonstrate how far determination, in overcoming insurmountable obstacles, can go in striving towards a goal. These alone are noteworthy lessons that can be uncovered in this historical and informative documentary.\n\nBecause of the fact that she was a woman (and black at that), this in no way prevented Shirley Chisholm from seeking the Presidency in 1972. In fact, that she managed to stay in the race as long as she did, with at least a dozen other Democractic candidates, including front runners Muskie, Wallace, and McGovern, meant that she stayed true not only to her constituents, but also to herself. \n\nWith her lippy and bold, Martin Luther King-like, impassioned vocal deliveries, Chisholm gradually won-over voters to her candidacy, and likewise scores several political talking points with its movie-viewing audience. Without the use of a narrator, it is through selective interviews with the key campaigners, strategists, politicians, and commentators of the era, that we get an undiluted, behind-the-scenes viewpoint into the financial, racial, sexual fireworks and political machinations of the era, that can taint even today's politics. \n\nHowever, it is the film's vibrant colors and really bouncy and funky soundtrack that really transports you into the heart and soul of this historic 1972 election that, at the same time, helps keep you genuinely interested in the dynamic politics examined by this special, unique documentary. Overall grade: B+.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0388835/"
}