{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sarah Hauser",
            "url": "/name/nm4439760/"
        },
        {
            "@type": "Person",
            "name": "Rie Tanaka",
            "url": "/name/nm0849050/"
        },
        {
            "@type": "Person",
            "name": "Crispin Freeman",
            "url": "/name/nm0293342/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4546,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0069722/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022946/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031068/"
        }
    ],
    "datePublished": "2002-04-02",
    "description": "Hideki finds the discarded and malfunctioning Persocom Chi, a personal computer that looks like a girl. While trying to fix and care for Chi, Hideki discovers that she might be a Chobits, a robot of urban legend that has free will.",
    "genre": [
        "Animation",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkxYWQ1NzctNDE0Ni00YzQxLTkyODUtMWRlYzNjYzAyNDNhXkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "robot,robot sci fi,nudity,big breasts,tokyo",
    "name": "Chobits",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Boris-57"
        },
        "dateCreated": "2005-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0326672/"
        },
        "name": "Superb anime series, gets a bit uneven at times but delivers 100%",
        "reviewBody": "So, your classic story - man vs machine. More particularly - man falls in love with found machine and, behold, it's vice versa.\n\nI stumbled upon these series by accident on the french MCM channel; the french dubs are perfect (Chii is exquisitely dubbed), but after a few episodes I got me the subbed originals - and found out that MCM messed up the episode sequencing. Content-wise this isn't problematic since the first two thirds of the episodes are quite stand-alone. Still it's exactly this that makes the series dip after a while, and you get the idea that they were just making it up as they went along. The underlying storyline (who/what is Chii, what will happen between Hideki & Chii) gets hinted at once in a while, but all in all the first half of the series focuses on the problems that arise when Hideki tries to educate his persocon Chii and the embarrassing situations Chii gets her prude master in, all in your typical \"harem\" anime setting.\n\nThe main thing is: it's so well-done! The first say 8 episodes are often hilarious observations of masculine fears and obsessions as we get to know Hideki's thoughts every step of the way. Through the parts of the comic-in-comic (Chii reads a favorite comic that seems to be especially designed for her and is a key element the overarching story) you occasionally get the idea that more is about to come.\n\nOf course, you can't keep Hideki as constipated throughout and as the often sexual jokes wear out, the series drifts towards fan-servicing with unfortunately pretty sexist undertones (not that I care). At that point, despite the fact the the manga script lay there waiting to be developed, the series seems a bit lost, and the build-up of tension between Chii and Hideki comes to a halt, as do the other plot lines (Hideki and Yumi...), culminating in the low (plotwise) or high (imagewise *grin*) of #14, where all characters spend a day at the beach. Apart from seeing all babes in bathing suits (yeah I know they're drawn figures, but cut the imagination some slack), you're left wondering when they'll get on with it. This wondering is only augmented by the following two episodes where Chii is hardly seen and the plot focuses on Shimbo and the Sensei...\n\n***Spoiler-laden paragraphs below***\n\nBut in fact (though you only find out later) this is where they (finally) start developing the actual story about relationships between man and machine, and what machine is/can be, what it means to be human. These eps. 15-16 are the first part of this topic, where it's seen from the (negative) human side only. The story-telling is raised to a significantly higher level. It's a bit of a mystery why the next 2 episodes again seem to fall to the earlier level, and nothing much is added, except for a hint at what the plot will turn out to be.\n\nBut, in episodes 20-26 suddenly the stakes are raised and we get an entirely different anime, with all the depth and beauty that we've come to expect from this Japanese art form. What makes a machine a machine, a human human, what is love, what is the function of memory... you get it all. The density of each episode is a zillion times higher than that of the first ones, and suspense is gradually built up. And then of course there's the final two episodes where a lot of questions are answered and the series DELIVERS. Home run! Considering the end credit song had changed midway to the very melancholic Ningyo Hime, I expected the worst, and indeed initially it does end up the way 99% of man-machine-love films end up: it cannot be (I think this has its roots in the ancient beliefs that relationships are merely there for procreation). But, lo and behold people! it does not end this way. Love DOES conquer all and after a series of emotional lefts and rights in the final episode, you get positively uppercutted by the rare 1% solution: the relationship between man and machine is a fact. Relationships without procreation are allowed. Bingo this is heaven.\n\n***SPOILER ENDS - but don't look an inch upward from this line***\n\nSo, despite the fact that the series seems a bit lost in the middle, the absolutely charming and hilarious first third plus the final third with its deep issues, superb plot and magnificent denouement make this series a solid 9 for me. I would have given it a 10, but it is a fact that the whole could have been better 1) had they from the start opted for a continuous story (like the final eps) with the story lines more mixed like in the manga, rather than more or less separate episodes focusing on one topic or even gimmick, 2) had made a better mix of humor & drama and developed the Chii character a bit better (like in the manga). Though this might be easier to achieve in a full-length feature, in which the story would benefit from being chopped from 8 to 2 hours. Obviously, this would leave Chii-o-files gasping for more, but still:\n\nPeople from TBS: make this into a full-length feature!! Presto!!!\n\nO, and don't forget to have a box of Kleenex within reach once you start on the final episode...\n\nPS: if you buy the DVD's (6+1 bonus), disc 1 and 2 are really worthwhile (though 2 has quite a bit of sexual/sexist fan-servicing), while disc 3 may be the least interesting. Disc 4 is where you get a first glimpse of how good the series will get, and discs 5 & 6 are simply must-haves. Beware that the 7th disc contains just 3 summaries (eps 9, 18 and 27), plus a 5-minute extra called Chibits."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Chobits: The Complete Series",
        "duration": "PT1M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3886324249",
        "name": "Chobits: The Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTQ0YmRjNGItNTIzYi00NmJhLWIxMTEtNzA2MGRiYmMwYmViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTQ0YmRjNGItNTIzYi00NmJhLWIxMTEtNzA2MGRiYmMwYmViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-01-25T06:10:26Z",
        "url": "https://www.imdb.com/video/vi3886324249/"
    },
    "url": "/title/tt0326672/"
}