{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christina Aguilera",
            "url": "/name/nm0004694/"
        },
        {
            "@type": "Person",
            "name": "Nick Aragon",
            "url": "/name/nm0032752/"
        },
        {
            "@type": "Person",
            "name": "Jermaine Browne",
            "url": "/name/nm0115015/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 99,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0184590/"
        }
    ],
    "datePublished": "2001-02-21",
    "description": "You know the hits--\"Genie In A Bottle,\" \"What A Girl Wants,\" \"I Turn To You\"--but on Genie Gets Her Wish, you'll see Christina Aguilera like never before, in studio, in concert and some exclusive looks backstage!",
    "director": [
        {
            "@type": "Person",
            "name": "Clare Grace Davies",
            "url": "/name/nm2336417/"
        }
    ],
    "duration": "PT1H14M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2OTI5NzIwOF5BMl5BanBnXkFtZTYwMTM4NDk4._V1_.jpg",
    "keywords": "concert,pop music,non fiction",
    "name": "Christina Aguilera: Genie Gets Her Wish",
    "original_info": {
        "id": "Christina Aguilera: Genie Gets Her Wish_2000",
        "name": "Christina Aguilera: Genie Gets Her Wish",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rooprect"
        },
        "dateCreated": "2012-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0241304/"
        },
        "name": "Thumbs up from a Black Sabbath fan",
        "reviewBody": "I'm not sure how I ended up with this DVD, considering I couldn't name a single Christina Aguilera song before I saw this. But I popped it in the DVD player and enjoyed it from start to finish.\n\nIn other words, you don't have to be a hardcore CA fan to see this. Especially since it depicts her early years (age 18), it presents the universally-appealing story of a young singer getting her first big taste of fame & fortune. Whether you're a fan of pop, rock, metal, jazz or polka, it's always fun to catch a glimpse of this kind of thing.\n\nChristina is shown to be down-to-earth, very appreciative of her fans, and a cute, wholesome person. There's nothing trashy or risqué about this video, which is a refreshing throwback to the days when pop singers could be appreciated by all ages. There are no references to sex, drugs or alcohol, and when asked if she has a boyfriend she replies that she doesn't have time for that; her career is her boyfriend. This is a very clean video which you can feel safe showing to either young kids or puritanical parents, without fear of any awkward moments like you might get while watching, say, \"Ozzy Osbourne Live & Loud\". Definitely do NOT watch that one with your mom.\n\n\"Genie Gets Her Wish\" is NOT a video compilation. While it includes 2 music videos (\"Genie in a Bottle\" and \"What a Girl Wants\"), it's more of a documentary but with extended musical footage. We get some nice shots of her in the studio, on tour, at rehearsal, and my favourite: an INCREDIBLE performance of her singing the old jazz number \"At Last\" with just a piano for accompaniment. That's when you realize this girl really has some pipes.\n\nAnother memorable number is her singing \"The Christmas Song\" (\"Chestnuts Roasting on an Open Fire\") with a piano. The other songs (\"So Emotional\", \"Come On Over\", \"I Turn to You\" and \"When You Put Your Hands On Me\") are mostly video montages while the music plays underneath.\n\nInteresting moments include some candid shots while on tour. For example: running through the airport to catch a flight (who would've guessed that famous pop divas have to schlep thru the lines like the rest of us), and some shots of her with her family & playing ping pong with friends. Like I said, it's a very down-to-earth presentation... something you don't often get these days. While other documentaries spend too much time trying to convince you what a superstar the person/band is (example: Martin Scorcese's \"Shine A Light\" about the Rolling Stones) this video does the opposite and shows you the ordinary human side.\n\nIf you enjoy documentaries about musicians, regardless of genre, this is a fun watch. It doesn't get too deep about anything but that is its charm. Other musical documentaries I recommend are \"Abba: Super Troopers\" and my fave... the unintentionally hilarious \"Anvil! the Story of Anvil\"."
    },
    "url": "/title/tt0241304/"
}