{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chris Botti",
            "url": "/name/nm0098660/"
        },
        {
            "@type": "Person",
            "name": "Josh Groban",
            "url": "/name/nm1169011/"
        },
        {
            "@type": "Person",
            "name": "Keith Lockhart",
            "url": "/name/nm0516885/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 64,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0119128/"
        }
    ],
    "description": "Chart-topping jazz trumpeter Chris Botti performed two star-studded concerts at the historic Boston Symphony Hall with The Boston Pops in September 2008. Special guests include Josh Groban, Yo-Yo Ma, John Mayer, Sting and Steven T...",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Gable",
            "url": "/name/nm0300093/"
        }
    ],
    "duration": "PT2H40M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg0NzExOTgwMF5BMl5BanBnXkFtZTcwMDk0ODcwMw@@._V1_.jpg",
    "name": "Chris Botti in Boston",
    "original_info": {
        "id": "Chris Botti & Friends: Night Sessions: Live in Concert_2002",
        "name": "Chris Botti & Friends: Night Sessions: Live in Concert",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KyleLicht"
        },
        "dateCreated": "2018-07-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1388331/"
        },
        "name": "Excellent Film",
        "reviewBody": "Incredible performances by Chris Botti and the Boston Pops Orchestra. I was blown away by the pianist, being one myself, and looked him up to find he is Billy Childs, a five-time Grammy winner. There was a wonderful surprise by Sting and then by Josh Groban too. Then, a great cover of Miles Davis' \"Flamenco Sketches\" from Kind of Blue in black and white to add effect. There was a wonderful version of \"Hallelujah\" and Botti is humorous in introducing it as Shrek's love theme. Katherine McPhee then delivers a hypnotic cover of Sinatra's \"I've Got You Under My Skin\" and her coy smiles and interchanges between her and Botti are absolutely adorable. It's also very funny to watch Botti and guitarist Mark Whitfield bicker over McPhee and try to impress her with their trumpet or guitar, respectively. Then, there's a great surprise from cellist legend Yo-Yo Ma playing Ennio Morricone's music from Cinema Paradiso, a movie I absolutely adore. \n\nWhat Botti does here is takes a performance of great songs by great musicians, then brings in a bunch of guest stars and musicians to perform. He also adds more depth to the show with his humor, anecdotes, and array of different types of songs. I loved watching this film and I would've been ecstatic to be at the show.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt1388331/"
}