{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chris Rock",
            "url": "/name/nm0001674/"
        },
        {
            "@type": "Person",
            "name": "Jim Breuer",
            "url": "/name/nm0108028/"
        },
        {
            "@type": "Person",
            "name": "Mario Joyner",
            "url": "/name/nm0431660/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4071,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093160/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137915/"
        },
        {
            "@type": "Person",
            "name": "Chris Rock",
            "url": "/name/nm0001674/"
        }
    ],
    "datePublished": "1996-06-01",
    "description": "The second HBO stand-up special by Chris Rock.",
    "director": [
        {
            "@type": "Person",
            "name": "Keith Truesdell",
            "url": "/name/nm0874133/"
        }
    ],
    "duration": "PT58M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU0ODk2MzYyM15BMl5BanBnXkFtZTcwMTUxMzYxMQ@@._V1_.jpg",
    "keywords": "stand up,n word,satire comedy,parody comedy,stand up special",
    "name": "Chris Rock: Bring the Pain",
    "original_info": {
        "id": "Chris Rock: Bring the Pain_1996",
        "name": "Chris Rock: Bring the Pain",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2006-01-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0200529/"
        },
        "name": "Switch Hitter",
        "reviewBody": "Rock repels me when he tries to be in a \"real\" film. But I have to admit that he is a terrific standup guy.\n\nI assume that's true of him as a person, but what I mean is as a comic. I dive into these things from time to time and am frequently disappointed. Oh, sometimes I laugh but its only a half a laugh until you realize what's happening.\n\nMost standup is insult comedy, usually associated with identity comedy. I'm sure there is an immigrant, Vaudeville history there. But most black comics today do the identity thing.\n\nRock is sort of a genius in what he does, and since it is so finely tuned it must be conscious.\n\nHere's what he does: he'll take the black community to task for some characteristic or behavior that is taboo to mention in the US. He'll hammer on it until it threatens to catch fire. Then in apparent seamlessness, he'll switch from being outside the group to inside and the switch itself will be funny.\n\nFor instance, he'll riff on OJ and violent blacks and how OJ's wife deserved to be killed. People will howl with nervous laughter. Then without missing a beat or change tone, he'll make fun of such an attitude. Poking fun at stupid blacks who think this way. The laughter will not start anew but continue from the old, building layer upon layer. Then he'll switch back, talking about slapping a bitch around, Then another switch about how that's not acceptable. People still laughing. Oh, he'd never, never (many nevers) hit a woman....\n\nBut he'd shake the bleep out her, and he caps it off by acting out this violence. Weeping, hurting laughter.\n\nIts because the man knows the precise point at which the boundary can be pushed. When he gets just to that point, just barely there, he pirouettes to the other side and pushes back until the boundary is dangerously close to breaking the other way.\n\nIt's brilliant, because no one at all talks about that boundary in the US. Not seriously. So we get a couple things. We get to see a dancing concept master do his stuff. We get to confront something we avoid at all costs. We get to see risk in him and it makes us free to take some risks. Oh, we laugh. \n\nBut we love the guy too.\n\nI've seen a few other shows. I think this is the best.\n\nTed's Evaluation -- 3 of 3: Worth watching."
    },
    "url": "/title/tt0200529/"
}