{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gian Maria Volontè",
            "url": "/name/nm0002231/"
        },
        {
            "@type": "Person",
            "name": "Paolo Bonacelli",
            "url": "/name/nm0093678/"
        },
        {
            "@type": "Person",
            "name": "Alain Cuny",
            "url": "/name/nm0192490/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2556,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "Christ Stopped at Eboli",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163343/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033761/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006387/"
        },
        {
            "@type": "Person",
            "name": "Francesco Rosi",
            "url": "/name/nm0742940/"
        },
        {
            "@type": "Person",
            "name": "Tonino Guerra",
            "url": "/name/nm0346096/"
        },
        {
            "@type": "Person",
            "name": "Raffaele La Capria",
            "url": "/name/nm0478431/"
        }
    ],
    "datePublished": "1979-02-23",
    "description": "A doctor in Fascist Italy is exiled to a remote village for his political views.",
    "director": [
        {
            "@type": "Person",
            "name": "Francesco Rosi",
            "url": "/name/nm0742940/"
        }
    ],
    "duration": "PT2H30M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDc1YzM5NjAtMDcxNS00ZmVjLWFhZWItYmQ2ZDA2NDJjN2VmXkEyXkFqcGdeQXVyNTA1NjYyMDk@._V1_.jpg",
    "keywords": "interwar period,kingdom of italy,fascist italy,campania,lucania italy",
    "name": "Cristo si è fermato a Eboli",
    "original_info": {
        "id": "Christ Stopped at Eboli_1979",
        "name": "Christ Stopped at Eboli",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "brogmiller"
        },
        "dateCreated": "2021-06-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079010/"
        },
        "name": "Story of a year.",
        "reviewBody": "This is a story that had to be told. It might not have been had not Carlo Levi been exiled in 1935 for his anti-fascist activities to a town in the remote, impoverished Southern province of Lucania. His non-ideological, unsentimentalised, beautifully observed memoir of the year he spent there has been vividly realised by Francesco Rosi whose films are noted for their depiction of inequalities and injustices. The political activism of Gian Maria Volonté has been well-documented so this film could be seen as a distillation of the beliefs of both actor and director. The author himself had passed away four years earlier but this adaptation would surely have met with his approval.\n\nVolonté's mellow, nuanced and understated portrayal of Levi, sadly overlooked in terms of awards, is indisputably one of his finest. It was the performance of Lea Massari in a comparatively small role as his wife that was recognised and very good she is too. Also appearing are the glorious Irene Papas and the always enigmatic Alain Cuny. Rosi of course was renowned for his skill with actors.\n\nThis is about a region that time has forgotten and for which its nation does not care. Looked down upon by the rich, industrialised North, economically depressed, lacking the basics of life and with no facilities, its residents have succumbed to superstition and mysticism. As for Religion \"Christ stopped short of here\" and its sole representative is a drunken, discredited priest. The pro-fascist mayor, played by Paolo Bonacelli, tries to get the inhabitants interested in the radio broadcasts of Mussolini but they are totally indifferent and simply do not care that Addis Abbaba has fallen! Ironically it was the young men of this region who supplied so much of the cannon fodder in the trenches of WW1 which was the subject of Rosi's earlier 'Uomini Contro'.\n\nOriginally made for television this slightly truncated version certainly belies its length and epitomises Rosi's aim to make his audience more than just 'passive spectators'. Piero Piccioni has composed a haunting score and the cinematography of Pasqualino de Santis is breathtaking. Unlike so many Italian films it is not marred by the booming voices of post-synchronisation and the dubbing of the gallery of characters is expertly done.\n\nCarlo Levi wrote that \"the whole of life is a tragedy without a stage\" but here Rosi does not lay it on with a trowel and this magnificent film becomes, despite the hardships it depicts, an affirmation of life.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2270870553",
        "name": "Christ Stopped at Eboli",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWIyNjM1NDMtNDA5MC00NmNkLWI5ZDMtNzhhZjRjNmY5ZTdiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWIyNjM1NDMtNDA5MC00NmNkLWI5ZDMtNzhhZjRjNmY5ZTdiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-06T17:19:18.704Z",
        "url": "https://www.imdb.com/video/vi2270870553/"
    },
    "url": "/title/tt0079010/"
}