{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edie Sedgwick",
            "url": "/name/nm0781291/"
        },
        {
            "@type": "Person",
            "name": "Wesley Hayes",
            "url": "/name/nm0371281/"
        },
        {
            "@type": "Person",
            "name": "Isabel Jewell",
            "url": "/name/nm0422436/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1146,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0255127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005291/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0020464/"
        },
        {
            "@type": "Person",
            "name": "John Palmer",
            "url": "/name/nm0658299/"
        },
        {
            "@type": "Person",
            "name": "David Weisman",
            "url": "/name/nm0918844/"
        },
        {
            "@type": "Person",
            "name": "Genevieve Charbin Cerf",
            "url": "/name/nm0152752/"
        }
    ],
    "datePublished": "1974-07-18",
    "description": "CIAO! MANHATTAN parallels Andy Warhol Factory star Edie Sedgwick's glory days in the late 1960s through her inevitable downfall and the tragic addiction that would take her life only weeks after filming wrapped in 1971.",
    "director": [
        {
            "@type": "Person",
            "name": "John Palmer",
            "url": "/name/nm0658299/"
        },
        {
            "@type": "Person",
            "name": "David Weisman",
            "url": "/name/nm0918844/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4MTExNDUzNl5BMl5BanBnXkFtZTcwOTk1NzcxMQ@@._V1_.jpg",
    "keywords": "female nudity,drug addiction,drug,sex scene,young woman",
    "name": "Ciao Manhattan",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Infofreak"
        },
        "dateCreated": "2003-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068379/"
        },
        "name": "A fascinating 1960s document that anybody interested in the Warhol Factory scene should watch.",
        "reviewBody": "The thing I really love about the D.V.D. revolution of the last few years is that some of the strangest and most obscure movies are now readily available. No longer do you have to spend hours searching through the racks in out of the way video stores or resort to fourth generation bootleg copies. 'Ciao Manhattan' is a case in point. I'd been curious about this movie ever since reading Jean Stein's brilliant Edie Sedgwick bio 'Edie' back in the 1980s, and now here it is! The 30th Anniversary edition, with excellent picture commentary and deleted footage. The only people who seem more excited about seeing it again than me are the directors (John Palmer and David Weisman) themselves going by the chatty and informative commentary track they have made with 'Ciao Manhattan' co-star Wesley Hayes. For those who don't know Edie was \"The Face of 1965\", a beautiful socialite turned model and Warhol \"superstar\". At one point in the 1960s quite possible the coolest girl in the world. Very shortly thereafter she was almost forgotten, and died aged 28 after a drug overdose. 'Ciao Manhattan' is made up of black and white footage shot in 1967 originally intended for a never finished movie that almost accidentally starred Edie, and later colour footage filmed in an attempt to salvage the project. In the final version Edie plays a character called Susan, a former model and underground film star who has retreated to her mother's home for \"treatment\". She's a mess - has permanent brain damage and a drinking problem. Hayes plays Butch a young Texan drifter who picks Susan up while she is hitchhiking half naked down the highway. He returns her home and Susan's mother (Isabel Jewell) hires him to babysit her troubled daughter. The movie cuts between \"now\" and then, colour and black and white, documentary footage and paranoid sci fi fantasy. It's quite a trip! Anybody interested in Andy Warhol or The Velvet Underground will want to see this very strange, but watchable mess. Neither Warhol or The Velvets actually appear mind you, but Warhol scenesters like Paul America, Baby Jane Holzer, Brigid Berlin (Brigid Polk) and Viva do, as do Beat legend Allen Ginsberg (as himself, mostly naked) and 'Barbarella' director Roger Vadim (clothed, as Susan's doctor). If you watch the outtakes you also get to see Robert and Nena Thurman. Yes, Uma's folks. 'Ciao Manhattan' may not thrill everyone but for me it's essential viewing for anyone interested in 1960s pop culture, especially Warhol's Factory, which subsequently influenced almost every underground pop movement thereafter from punk on down."
    },
    "url": "/title/tt0068379/"
}