{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Angstreich",
            "url": "/name/nm1201807/"
        },
        {
            "@type": "Person",
            "name": "Eric Chadbourne",
            "url": "/name/nm1202234/"
        },
        {
            "@type": "Person",
            "name": "Bill Heidbreder",
            "url": "/name/nm1202887/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2338,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051615/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077618/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051278/"
        },
        {
            "@type": "Person",
            "name": "Angela Christlieb",
            "url": "/name/nm0160429/"
        }
    ],
    "datePublished": "2003-04-10",
    "description": "This documentary about the culture of intense cinephilia in New York City reveals the impassioned world of five obsessed movie buffs. The filmmakers expose this delightfully deranged cult by capturing the daily lives of its member...",
    "director": [
        {
            "@type": "Person",
            "name": "Angela Christlieb",
            "url": "/name/nm0160429/"
        },
        {
            "@type": "Person",
            "name": "Stephen Kijak",
            "url": "/name/nm0452772/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDA1MWQyYmItODcxNi00NTJhLTkyYmItMzU1MjI2ZjI0NTU0XkEyXkFqcGdeQXVyNjY0NDIwMzY@._V1_.jpg",
    "keywords": "cinephilia,cinema,loneliness,obsessive compulsive,obsession",
    "name": "Cinemania",
    "original_info": {
        "id": "Cinemania_2002",
        "name": "Cinemania",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "surendeur"
        },
        "dateCreated": "2002-06-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0281724/"
        },
        "name": "Tragic misunderstanding?",
        "reviewBody": "This film was a favorite at the Seattle Film Festival. I went to a screening last night with rather high expectations, some of which were met and others, which well... were not.\n\nWe follow six oddballs from the big apple whose lives center around thick film festival guides and meticulous prints of \"La Dolce Vita\". The beginning is a clever montage in which we are introduced to each one and are allowed to laugh at their idiosyncracies. One individual's eccentric voiceover is played while he's spreading half a jar of peanut butter onto a slice of wonderbread. All are extraordinarily unattractive and the nightmare of any suburban mother who's afraid that they're kid is watching too much television. I am beginning to the think the term \"film buff\" should be given a new meaning. They ride on a subways crowded with anxious people catching the train to work. They sit at the sides of the train, hearts pounding at the pure thought of someone may \"stealing their special seat\" at the 3:00 showing at MoMA. One even collects thousands of film records. The revelation? He doesn't even own a record player.\n\nThe film stays a quirky, safe experience in the first half-hour. Then it becomes repetitive, disturbing, and not necessarily in a poignant matter. We step into their apartments and it's not surprising that they're all packrats (to say the VERY least). Many live with books (mostly related to film) stacked up to the ceilings, struggling daily to find their way out the door. Their social lives are exclusive to their `film society', which consists of spitting out film titles and waiting for ten second criticisms. Only one person is employed. The rest either live off someone else or a dead relatives royalties. The film became progressively more uncomfortable for me upon realizing that this, was, indeed a documentary and that the hypocrisy of sitting in a theatre, laughing at an extreme version of myself became too much for me. Had the filmmakers not been there, I probably might have walked out. As playwright Edward Albee said: `The best art holds a mirror in front of your face and says, THIS IS WHO YOU ARE. NOW CHANGE.' I wish it could have applied to this movie the same way. It never strayed from being a caricature-driven freak show and very much resisted giving us a thorough investigation of who the psychology of these people. What the hell they get out of saving every ticket stub and soda cup from their childhood. Tell me why? Tell me how? Give me answers before the film comes to an end\n\nAnd of course, as most films do `Cinemania' came to end and left this viewer extremely irritated. Usually, I resist walking out of the theatre commenting on the film's quality. This time, when asked the question, I answered: `Self-conscious. But I'm sure they're thrilled that they're on screen. It's just too bad they don't understand how sad they are' Which, I will admit is a matter of opinion and surely mine will be battered.\n\nFor me, it was a montage of social loners and obsessive-compulsives in the Big Apple. A friend of mine was touched, humored and said it reminded him of well, himself. What I failed to tell him was that it affected me the same way too. He just has a better sense of humor.\n\nRecommended for fans of `Trekkies', `The Cruise' and `Crumb'.\n\nRATING: 6/10"
    },
    "url": "/title/tt0281724/"
}