{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jonathan Wade-Drahos",
            "url": "/name/nm0905531/"
        },
        {
            "@type": "Person",
            "name": "Andre Khabbazi",
            "url": "/name/nm0450974/"
        },
        {
            "@type": "Person",
            "name": "Brian Lane Green",
            "url": "/name/nm0337665/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1150,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0061839/"
        },
        {
            "@type": "Person",
            "name": "Gregory Hinton",
            "url": "/name/nm0385987/"
        },
        {
            "@type": "Person",
            "name": "Dirk Shafer",
            "url": "/name/nm0787257/"
        }
    ],
    "datePublished": "2002-05-08",
    "description": "John, a gay Illinois small town cop moves to Los Angeles, hoping to fit into a place more welcoming of his sexuality. He soon discovers the \"circuit,\" where he meets an insecure hustler, who draws John into drug abuse and illicit ...",
    "director": [
        {
            "@type": "Person",
            "name": "Dirk Shafer",
            "url": "/name/nm0787257/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzMTAyMzI1MF5BMl5BanBnXkFtZTcwNTEzMTAwMQ@@._V1_.jpg",
    "keywords": "ex police officer,gay male police officer,police,gay policeman,party",
    "name": "Circuit",
    "original_info": {
        "id": "Circuit_2001",
        "name": "Circuit",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "khaktus"
        },
        "dateCreated": "2006-10-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0218107/"
        },
        "name": "Party boys and Hangover",
        "reviewBody": "I saw this movie with a title \"Party Boys\". For me, it was NOT about some circuit in L.A., or wherever. It reminded me of the feelings I had - in my party times - every weekend - in the middle of Europe - far away of the gay paradises of the west. This is why I dare to call this portrait more general. Forget about drugs, forget about time and place... the thing that remains is that next-day's \"why?\" and \"nothing more?\". All that love-is-in-the-air (that is just the text of the song, not what is present in the atmosphere), all that boys-good-in-bed (that are so bad actually in their imitating of the porn, thinking that THIS IS a sex), all that care-about-your-body that disguises the lack of purpose of the void corpse, all that rainbow-colourfulness (that is the dictate of one color actually - even if different every weekend).\n\nBeing myself...??? Come on! I loved and still love the parties, music, dancing, nice guys, feeling of something happening - but I don't wanna see just ones side, to get drunk by this \"pure happiness\"... After one gets drunk, the hangover comes... I like gay culture (subculture, pseudo-culture, whatever), the ideas of colours, unconstrained love, freedom, enjoying of life - but what there really is - is far from this ideal. Uniformity, sex as a sport (who experienced nothing else, will not understand), vogue, must-have-fun must-smile must-laugh for any price... Maybe this is what the director wanted to say.\n\nMaybe it's not true about your L.A. circuit - but there's more to feel than to see.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0218107/"
}