{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Carradine",
            "url": "/name/nm0001016/"
        },
        {
            "@type": "Person",
            "name": "Jeff Cooper",
            "url": "/name/nm0178139/"
        },
        {
            "@type": "Person",
            "name": "Christopher Lee",
            "url": "/name/nm0000489/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2435,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028564/"
        },
        {
            "@type": "Person",
            "name": "Stirling Silliphant",
            "url": "/name/nm0798103/"
        },
        {
            "@type": "Person",
            "name": "Stanley Mann",
            "url": "/name/nm0542970/"
        },
        {
            "@type": "Person",
            "name": "Bruce Lee",
            "url": "/name/nm0000045/"
        }
    ],
    "datePublished": "1978-07-25",
    "description": "A young martial artist embarks on an adventure, encountering other martial artists in battle until one day he meets an aging blind man who will show him the true meaning of martial arts and life.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Moore",
            "url": "/name/nm0601785/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Adventure",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDM3Mzk3NDgtYzc4ZC00NzNiLWJhYmMtNjA4MWJmMDc3ZDUwXkEyXkFqcGdeQXVyMzU4Nzk4MDI@._V1_.jpg",
    "keywords": "martial arts action,psychotronic film,female topless nudity,female rear nudity,martial artist",
    "name": "Circle of Iron",
    "original_info": {
        "id": "Circle of Iron_1978",
        "name": "Circle of Iron",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bunuel1976"
        },
        "dateCreated": "2007-12-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078975/"
        },
        "name": "THE SILENT FLUTE (Richard Moore, 1978) **1/2",
        "reviewBody": "I'd been intrigued by this one for some time due its being based on a story concocted by Bruce Lee and James Coburn; when it emerged as a \"Special Edition\" via the Blue Underground label, I had considered purchasing the DVD but somehow never got around to it. Eventually, CIRCLE OF IRON (as it's better-known) was even expanded into a fully-loaded 2-Disc Setbut, then, I happened upon the original disc at a local rental outlet and finally decided to check it out.\n\nAs it happened, I was somewhat let down by the film: I'm all for exotic action/adventure stuff  a genre which got something of a revival during this era  but, despite the various trimmings (martial arts, mystical overtones, plus a number of rather superfluous cameo appearances by the likes of Roddy MacDowall, Eli Wallach and Christopher Lee), THE SILENT FLUTE came across as invincibly low-brow! Besides, while David Carradine is ostensibly the star (and even gets to play four different parts for no discernible reason!), the hero proper of the narrative was played a beefy protégé of his  Jeff Cooper  whose wooden performance here really drowned the film for me!! \n\nThe plot  the winner of a martial arts tournament is assigned the task of seeking the whereabouts of a famous wizard (played by horror legend Lee) who is in possession of an all-powerful book  sounds intriguing on paper but, to be honest, the way this plays out on screen it's not terribly compelling; worse still, the denouement is a real cop-out! That said, the numerous action sequences and Carradine's characterization of a blind shepherd (himself a martial arts champion) who guides Cooper on his danger-fraught journey make the film palatable for the most part.\n\nDespite the obvious low-budget at his disposal, too, one-time-only director Moore (his more typical credit is as a cinematographer) lends the film reasonable visual style  accentuated by the expansive Israeli locations (which constitutes the film's main asset along with Australian composer Bruce Smeaton's beautiful score). As a matter of fact, Moore admits in the disc's Audio Commentary that the main reason that seemed to have gotten him the assignment in the first place was because his background as a cameraman assured (in the eyes of the producers, at least) outstanding visuals! \n\nTHE SILENT FLUTE is, ultimately, a hodgepodge of disparate ideas (with its most bizarre element being Wallach's masochistic \"Man In Oil\" and his diatribe on the virtues of a life without one's own genitalia!) which don't really jell and, consequently, it works only in fits and starts...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A young martial artist embarks on an adventure, encountering other martial artists in battle until one day he meets an aging blind man who will show him the true meaning of martial arts and life.",
        "duration": "PT3M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi194036249",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTg5YzE3NTMtMWQ2ZC00ZGFjLWJkZmQtYjFkNTVjODliMDc3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTg5YzE3NTMtMWQ2ZC00ZGFjLWJkZmQtYjFkNTVjODliMDc3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-04-23T17:26:22.263Z",
        "url": "https://www.imdb.com/video/vi194036249/"
    },
    "url": "/title/tt0078975/"
}