{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Oleg Ouchakov",
            "url": "/name/nm0882294/"
        },
        {
            "@type": "Person",
            "name": "Stella Umeh",
            "url": "/name/nm1329100/"
        },
        {
            "@type": "Person",
            "name": "Olga Pikhienko",
            "url": "/name/nm1233902/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 137,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0146172/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012357/"
        }
    ],
    "datePublished": "2002-09-16",
    "genre": [
        "Documentary",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYwODA2NzY0NV5BMl5BanBnXkFtZTcwMDY3ODYyMQ@@._V1_.jpg",
    "keywords": "cirque du soleil",
    "name": "Cirque du Soleil: Fire Within",
    "original_info": {
        "id": "Cirque Du Soleil: Fire Within_2004",
        "name": "Cirque Du Soleil: Fire Within",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Caibaan"
        },
        "dateCreated": "2003-07-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0354279/"
        },
        "name": "A Reality Show That's Stellar",
        "reviewBody": "Sexual tensions, sex, duplicitous people, anger, passion, competition, bitterness...all for the world to see, and the world loves to see it, even more when the characters involve are themselves, and the life they portray are their very own. Reality shows have spread like the common cold, proliferating on nearly every channel and appealing intrigued masses with its multiple but often homogeneous forms. Do you want to be a millionaire? How about marry one or get chosen by a fake one, or maybe not even a rich guy at all, just a hot bachelor. No? Be famous then? Be an idol...an American idol or a diva, partake in Fame, be the IT factor, or better yet, be yourself living with five others under the same roof for four months. Whatever one chooses to see, the sight seems to be another carbon copy of the other, with some changes, of course. -Fortunately, there are exceptions, and out there, there are \"reality shows\" that arguably break the mold and what better mold-breaker than Cirque Du Soleil's Fire Within. Fire Within is typical of a reality show in that it focuses on the lives of people. In this show, it follows the lives of eight artists involved in the creation process of a new production called Varekai. Moreover, it's typical that this focus group are from all walks of life, each bringing their unique story to tell and allowing viewers to see completely different viewpoints, experiences, and how they cope with the transitions that creating a new show brings. Episode after episode, one sees the physical and emotional struggles, heart-wrenching disappointments, life-long dreams and ambitions, deeply-rooted family bonds, as well as complicated romantic relationships that these performers undergo in their new life with the Cirque's new production. More importantly, we follow their commitment and artistic journey, from auditions to the premiere of Varekai. Granted, we do see some of these experiences with other shows but that's not why Fire Within is different. What makes Fire Within so darn close to being its own category is because it captures more depth and is more humanize than any reality shows out there. It doesn't fixate on something basic as sexual desire or complex as human demoralization and the satisfaction of seeing misery and downfall of someone other than oneself. It also doesn't appeal because it's so far fetch and unbelievable and shocking, though it helps. In the end, it looks to the audience, not to awe, but simply to share the experience of something incredibly unique and not just for the sake of sensationalism. It shows human vulnerability and can often times be touching and sweet. Furthermore, it embraces disparate individuals to unite and collaborate on something that will be awe-inspiring. Fire Within is real, authentic, genuine as they come. And it's an interesting fact that the film crew had to go by what the performers allowed them to film. If the person didn't want to be filmed at a certain moment, they were respected and given privacy and space, and what \"reality show\" would do that?"
    },
    "url": "/title/tt0354279/"
}