{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Erica Linz",
            "url": "/name/nm5000971/"
        },
        {
            "@type": "Person",
            "name": "Igor Zaripov",
            "url": "/name/nm5001551/"
        },
        {
            "@type": "Person",
            "name": "Lutz Halbhubner",
            "url": "/name/nm1492924/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8131,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0384130/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051162/"
        },
        {
            "@type": "Person",
            "name": "Andrew Adamson",
            "url": "/name/nm0011470/"
        }
    ],
    "datePublished": "2012-12-21",
    "description": "A young woman is entranced by an Aerialist. When they fall into the dreamlike world of Cirque du Soleil and are separated, they travel through the different tent worlds trying to find each other.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Adamson",
            "url": "/name/nm0011470/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxMjY0MzgzMl5BMl5BanBnXkFtZTcwNjc0NjQ2OA@@._V1_.jpg",
    "keywords": "woman wears a bikini,underwater scene,3d,3 dimensional,cirque du soleil",
    "name": "Cirque du Soleil: Worlds Away",
    "original_info": {
        "id": "Cirque du Soleil: Cirque Reinvented_1987",
        "name": "Cirque du Soleil: Cirque Reinvented",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rgkarim"
        },
        "dateCreated": "2012-12-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1792647/"
        },
        "name": "Visually Beautiful, with a Soundtrack to match",
        "reviewBody": "The art of circus performing is a tradition that continues to defy the test of time. One circus that continues to remain popular with the public is Cirque du Soleil, the show that combines acrobatics with artistic imagination. Cirque du Soleil has taken on a number of themes over the years from dragon celebrations to Michael Jackson tributes, yet many have missed the opportunity to see these shows come to life. This weekend people around the country/world have the opportunity to see a show for themselves as Cirque Du Soleil: World's Away 3D released. So sit back and relax as I dive into the artistic into James Cameron latest production. \n\nLet's start this review off with the biggest strength of the movie, the visuals. Worlds Away is a breath taking experience of mind blowing sequences that show off the imagination of the performance theater. Audience members will be excited to see the performers pull off aerial ace performances as they flip and soar through the air amidst brilliant settings. What makes this movie even more entertaining is that the stunts are not just people showing off their training, but are actually being used to tell a story and describe the emotions of the act. Some performances are elegant displays of finesse, combining ballet and interpretive dancing to wow and amaze. Others are all about power and gravity challenging stunts that build suspense at whether or not the person will fall to the constantly moving environment. My favorite in particular involved a Japanese anime like act, where performers \"fought\" on a gyroscopic platform that involved them adapting to the environment, which kept it interesting. Amidst these entertaining performances are some performances that are more strange than entertaining. These skits involve oddly designed characters whose purpose was unknown to me. I'm sure there is some symbolic nature to these scenes, but unfortunately I was unable to decipher the meaning behind these interludes, or at least understand what each character represented. Regardless these scenes can still be entertaining, but don't expect them to be as flashy as those shown in the trailer. \n\nAnother factor that adds entertainment to this movie was the musical score. Those who have seen the show before, will be familiar with the beautiful harmonies the orchestra creates. Each scene has its own song accompanying it, designed to mirror the feelings the performers were trying to act out. Performances that were softer and more elegant, used a slower track where flutes, violins, and vocals dominated. Scenes that were more aggressive, darker, and more suspenseful took on the entire orchestra relying on the drums and strings to paint the challenging nightmare the world had to offer. If you don't care about the music matching the scenes, it doesn't matter because the orchestra work is still ear pleasing on so many levels. Fans of the series may recognize some of the tracks, but for newbies like me, you may just find yourself bobbing to the beat. \n\nSo we have the stunts and the accompanying music, but is there anything else that will impress the audience. I believe the visuals might also be another aspect that will grab your attention . The costumes are indeed artistic and interesting to see, but usually fit the scene well. Unfortunately my lack of artistic understanding denied me the full appreciation of their design, and might confuse other audience members as well. Despite the confusion though, the setting itself is beautiful. The artificial rivers and ponds, the misty trees of the forbidden jungle, and the industrial wasteland of a steam punk nightmare are polished in every detail. Some of the scenes also included some artificial creatures that were even more impressive to watch. My favorite was the giant snake that coiled itself around the forest as the two protagonists dance their way through the air. This beast moves as it was an animatronic reptile, but one can see the strings as the puppeteers work their magic to make it move. I feel though that many people will enjoy the world the designers have created for the audience. \n\nSo what should I warn you about this movie? One thing is that the story is rather basic and very straightforward. It's a romance story that involves travelling through multiple worlds, with each having a tale of their own that provides an obstacle for the main plot. Unfortunately the deeper elements of the story require a little more thought than I was able to understand, but those who can interpret symbolism will be just fine. Another thing I noticed is the constant amount of flashing lights in this movie. These lights add more life and excitement to the scenes, however those with seizure disorders are going to need to stray from this movie. Perhaps the other thing to warn you about is that this movie seems to be only available in 3-D so it could be a more expensive purchase depending on your theater. Was it worth the 3-D? Frankly I could have done without it, but it added a smidge of detail that can be appreciated. \n\nWas Cirque De Soleil worth a trip to the theater? It really depends on if you have already seen a show. If you have, then not really as I discovered some of the details were cut from the movie. Plus at the show you get a little more involved than you do in the theater. However, if you've never been to a show, then totally go see this one, as the visuals and sound are made for the theater. What are my scores for this movie? Check them out below: Fantasy: 7.0 Movie Overall: 6.5",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Two young people journey through the dreamlike worlds of Cirque du Soleil to find each other.",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi379234073",
        "name": "U.S. Version #2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTM5OTY2OTU0M15BMl5BanBnXkFtZTcwNjQzNjA4OA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTM5OTY2OTU0M15BMl5BanBnXkFtZTcwNjQzNjA4OA@@._V1_.jpg",
        "uploadDate": "2012-12-04T14:11:33Z",
        "url": "https://www.imdb.com/video/vi379234073/"
    },
    "url": "/title/tt1792647/"
}