{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Akira Kamiya",
            "url": "/name/nm0436776/"
        },
        {
            "@type": "Person",
            "name": "Kazue Ikura",
            "url": "/name/nm0407557/"
        },
        {
            "@type": "Person",
            "name": "Y么ko Asagami",
            "url": "/name/nm0038290/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 474,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "City Hunter: .357 Magnum",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0006858/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080694/"
        },
        {
            "@type": "Person",
            "name": "Akinori End么",
            "url": "/name/nm0256852/"
        },
        {
            "@type": "Person",
            "name": "Gray G. Haddock",
            "url": "/name/nm1076728/"
        },
        {
            "@type": "Person",
            "name": "Tsukasa H么j么",
            "url": "/name/nm0405783/"
        }
    ],
    "datePublished": "2003-04-08",
    "description": "If Shinjuku's the place, then City Hunter is on the case! In this exciting adventure, Ryo and Kaori find themselves on a 'missing persons' case that could somehow be related to the national security of the global world when a love...",
    "director": [
        {
            "@type": "Person",
            "name": "Kenji Kodama",
            "url": "/name/nm1829961/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Animation",
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWVkZWFiYzktNGY3OS00YzM0LWFjZTgtYTAyODFiYjk5YzcwXkEyXkFqcGdeQXVyMzkzODQwMA@@._V1_.jpg",
    "keywords": "anime animation,microchip,spy,missing person,mercenary",
    "name": "City Hunter: Ai to shukumei no Magnum",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The Shadow Sweeper"
        },
        "dateCreated": "2001-06-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0097067/"
        },
        "name": "Greatest Anime Movie Ever",
        "reviewBody": "City Hunter: \"A Magnum of Love and Destiny\" is without a doubt the greatest City Hunter movie as well as the greatest anime movie of all time. Although City Hunter has that stereotype as a comedy anime of many sorts and it is, there are often many deeper issues presented that are not often seen. In this movie, Ryo Saeba is hired by Nina Steinberg, a genius pianist who has come to Japan to look for her father because her mother who died many years before told her that he was in fact still alive before she passed away. Now enter Nina's Grandfather who for some reason is trying to convince Nina that her father is dead. Add to that mix the search for an information spy's hidden microchip and you have a tightly wound story. In the movie we can understand Ryos relationships with his clients as well as his partner Kaori Makimura whom he loves but shows opposite feelings for her safety because of the business he is in as a \"sweeper\", not necessarily a private eye as most are lead to believe.\n\nThe soundtrack is first-rate with an excellent piano score that is very moving during the climax of the movie. The animation is also top-notch dating back to 1988 and came out between City Hunter's 2nd and 3rd TV seasons (4 is all, 140 episodes total). I wont reveal any more of the plot, but be aware that this is NOT just a comedy and with most City Hunter movies shows some kind of deeper meaning to our relationships as people. A must see. 10 out of 10!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0097067/"
}