{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chow Yun-Fat",
            "url": "/name/nm0000334/"
        },
        {
            "@type": "Person",
            "name": "Yueh Sun",
            "url": "/name/nm0839003/"
        },
        {
            "@type": "Person",
            "name": "Danny Lee",
            "url": "/name/nm0497097/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6902,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "City on Fire",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0157157/"
        },
        {
            "@type": "Person",
            "name": "Ringo Lam",
            "url": "/name/nm0482681/"
        },
        {
            "@type": "Person",
            "name": "Sai-Shing Shum",
            "url": "/name/nm0787810/"
        }
    ],
    "datePublished": "1987-02-13",
    "description": "An undercover cop infiltrates a gang of thieves who plan to rob a jewelry store.",
    "director": [
        {
            "@type": "Person",
            "name": "Ringo Lam",
            "url": "/name/nm0482681/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Action",
        "Adventure",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2RlOGZiYjEtNGY4Zi00MTI3LWIyMmYtZjU5MTFhNzY3YTkyXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "undercover cop,robbery,gangster,organized crime,police officer",
    "name": "Lung foo fung wan",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "b00st"
        },
        "dateCreated": "2002-07-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0093435/"
        },
        "name": "City On Fire & Tarantino",
        "reviewBody": "I'm gonna try to keep my comments relatively brief, this is a huge point I'm trying to come across with) and direct them at the issue of Quentin Tarantino's (with Avary) Reservoir Dogs, not at my opinion that City on Fire stands as great film of noteable orginality.\n\nThis is about a relationship which exists, between two films by different directors from different backgrounds, solely because Tarantino 'borrowed' ideas from Ringo Lam.\n\nAfter seeing Reservoir Dogs for the first time many years ago, I was blown away. You have to give it to Tarantino, he was in the right place at the right time and Reservoir Dogs blew everything that was going on in American cinema, at the time, out of the water. There is no denying that through film enthusiasts who saw Pulp Fiction and then later sought out Dogs, that a whole new generation of directors and writers came out of the wood work, inspired by his work and tried to imitate what they came to praise as an icon of cinematic originality in what would be come a pop culture of new wave gangster films.\n\nHowever, that is where, in my opinion, praise of Tarantino should stop. Sometimes I think people get confused between two things. Those two things are being a obsessive film enthusiast and being an original artist. I think that one problem, in my opinion (although many may not agree), with the general film watching public and many producers, is that they have not been exposed to much of foreign cinema, let alone most of the independent films which gain huge followings but go unnoticed by the general public, and therefore someone who markets an idea properly, be it original or not, can get away with taking someone else's idea which was truly original, but not immensly popular, and turning that into success, or even in some cases, a cult film. The latter evokes some laughter on my part, because having a cult film being based on the original work of another cult film, really says something about the audience who follows such an unoriginal film without trying to truly discover its roots.\n\nNow, does this take anything away from Reservoir Dogs or City on Fire for that matter? No. I believe that generally most who will see either film will, and should for that matter, go on to enjoy both films to the extent that they are impressioned by them for their originality and substance without caring about these 'minor details'.\n\nHowever, after seeing both films and actually taking them for their worth, I believe that it is clear in what classes, either enthusiast or artist, to put Lam and Tarantino in."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An undercover cop infiltrates a gang of thieves who plan to rob a jewelry store.",
        "duration": "PT3M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi422560537",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGJlZjU2NDQtNjY3Zi00YWRlLTk2ZmQtNGI1ZTk0NTA0MDRhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGJlZjU2NDQtNjY3Zi00YWRlLTk2ZmQtNGI1ZTk0NTA0MDRhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-19T16:39:17.072Z",
        "url": "https://www.imdb.com/video/vi422560537/"
    },
    "url": "/title/tt0093435/"
}