{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Al Pacino",
            "url": "/name/nm0000199/"
        },
        {
            "@type": "Person",
            "name": "John Cusack",
            "url": "/name/nm0000131/"
        },
        {
            "@type": "Person",
            "name": "Bridget Fonda",
            "url": "/name/nm0000403/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21428,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040620/"
        },
        {
            "@type": "Person",
            "name": "Ken Lipper",
            "url": "/name/nm0513601/"
        },
        {
            "@type": "Person",
            "name": "Paul Schrader",
            "url": "/name/nm0001707/"
        },
        {
            "@type": "Person",
            "name": "Nicholas Pileggi",
            "url": "/name/nm0683380/"
        }
    ],
    "datePublished": "1996-02-16",
    "description": "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.",
    "director": [
        {
            "@type": "Person",
            "name": "Harold Becker",
            "url": "/name/nm0000887/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmMxMGEwNDAtZGVjYS00NWIyLWI4NGQtZGYzMjA0YzIzZGM4XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "columbia tristar,trailer,tv spot,columbia tristar home video,final scene",
    "name": "City Hall",
    "original_info": {
        "id": "City Hall_1996",
        "name": "City Hall",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "inspectors71"
        },
        "dateCreated": "2005-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115907/"
        },
        "name": "A Nice Little Nothing",
        "reviewBody": "I saw City Hall on NBC about four years ago and thought that this movie was perfect for TV. With a couple of judicious language cuts and some clumsy edits for violence, the movie came to the little screen essentially intact. Unfortunately, City Hall is such a pleasant and vacant little \"thriller,\" you probably will have forgotten it by the time you get up from in front of the TV to stretch.\n\nThere's almost nothing here in this pedestrian story of city hall corruption! Al Pacino is just fine as the mayor of New York, a man who keeps hammering home to his staff, headed by the Pillsbury Doughboy incarnate, John Cusack, that if it's good for the city, it's good. Cusack looks as if he needs to be put back in the oven for another ten minutes. Bridget Fonda is all pretty hair and nice legs and freshly scrubbed cardboard. Danny Aiello plays, well, Danny Aiello. The other person of interest in the movie, Tony Franciosa, has been around a long, long time (and he is just so interesting to watch, even though he doesn't have much to do).\n\nThere's an interesting sub-plot wherein Pacino is working very hard to bring the 1996 Democratic National Convention to town. Senator Ernest Hollings makes a nice appearance with Pacino and other bigwigs at a dinner party, and his cameo adds a bit of gravitas to this fluffy little Harold Becker film.\n\nPacino is just plain fun to watch as he chews the scenery, and makes it look very much like good governance. Cusack doesn't fare so well. He has a great voice (and the sound recording of the actors is crisp and melodious), but at one point or another, you have to wonder how, really, this Louisiana transplant, Kevin Calhoun, got to be the Deputy Mayor of New York City. He tells Fonda something about politics being in all Louisianans' blood streams. Then he goes back to fighting corruption.\n\nDoes anyone see the irony here? \n\nOh, well. The movie is over, the dead cop's wife has got his pension, the baddies are locked up or have moved on, Cusack is chunkily cheerful (and has Fonda, with those spiffy gams and happy face), Pacino has apparently retired to practice law, and you can't remember what you did for the last two hours."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2680029465",
        "name": "City Hall",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDgxMzY0ZTUtNzkxOC00ZjY0LTg2NDAtMjQ0YjFjNGYwMjBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDgxMzY0ZTUtNzkxOC00ZjY0LTg2NDAtMjQ0YjFjNGYwMjBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:24:53Z",
        "url": "https://www.imdb.com/video/vi2680029465/"
    },
    "url": "/title/tt0115907/"
}