{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Janelle Brady",
            "url": "/name/nm0103642/"
        },
        {
            "@type": "Person",
            "name": "Gil Brenton",
            "url": "/name/nm0107621/"
        },
        {
            "@type": "Person",
            "name": "Robert Prichard",
            "url": "/name/nm0697214/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8894,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019150/"
        },
        {
            "@type": "Person",
            "name": "Richard W. Haines",
            "url": "/name/nm0354286/"
        },
        {
            "@type": "Person",
            "name": "Mark Rudnitsky",
            "url": "/name/nm0748892/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Kaufman",
            "url": "/name/nm0442207/"
        }
    ],
    "datePublished": "1986-12-12",
    "description": "The pupils at a high school next to a nuclear power plant start acting and looking strange after buying contaminated drugs from a plant worker.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard W. Haines",
            "url": "/name/nm0354286/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Kaufman",
            "url": "/name/nm0442207/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2QyYTQ1NzktMzc3NC00ZTcwLTgwZjAtYmU0NjQ1MDFmNDQ2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "high school,nuclear power plant,splatter,female nudity,nuclear waste",
    "name": "Class of Nuke 'Em High",
    "original_info": {
        "id": "Class of Nuke 'Em High_1986",
        "name": "Class of Nuke 'Em High",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Crap_Connoisseur"
        },
        "dateCreated": "2006-04-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090849/"
        },
        "name": "Seminal Troma",
        "reviewBody": "Class of Nuke 'Em High is one of Troma's best loved and most seen films. This film helped to define the Troma formula that crap addicts the world over would grow to love - gory violence, gratuitous nudity and black humour, all mixed with a large dose of irony and an incredible lack of taste.\n\nClass of Nuke 'Em High was released just after \"The Toxic Avenger\" and it shares a similar nuclear theme. In this case, a nuclear waste facility is leaking toxic goo into the local high school with some rather unfortunate consequences for the student body. Unlike the poor nerd in the film's brilliant opening sequence, our heroes are not directly exposed to the toxic waste. Rather, Warren and Chrissy smoke marijuana grown on the grounds of the nuclear power plant. This ultra-potent pot not only makes Chrissy incredibly horny, but mutates her unborn child and imbues Warren with super-human strength.\n\nThe film then focuses on Warren's rivalry with the Cretins (former honours students who have turned into freaks after smoking one too many toxic joints) and Chrissy's rampaging miscarried foetus (which lives in the toilet and hides out in a vat of toxic waste). These situations provide the filmmakers with plenty of opportunities for hilarious sight gags, gory violence and camp action - and they deliver.\n\nAs with much of Troma's early output, this film has been crafted with considerable care and attention to detail, despite budgetary restrictions. The plot has its own ludicrous sense of logic and the direction is captivating - Kaufman, Herz and Richard W. Haines all share a directorial credit but the action sequences reek of Kaufman's mercurial style. I love the scene where Warren literally punches one of the cretins through the mouth, down into his chest. The special effects also deserve a mention. The creature effects used for Chrissy's mutant foetus are hilarious.\n\nThe Class of Nuke 'Em High does not quite match \"The Toxic Avenger\" for originality or style, but it is a great example of what Troma does better than any other studio and why they are still around 20 years later."
    },
    "url": "/title/tt0090849/"
}