{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbara Stanwyck",
            "url": "/name/nm0001766/"
        },
        {
            "@type": "Person",
            "name": "Robert Ryan",
            "url": "/name/nm0752813/"
        },
        {
            "@type": "Person",
            "name": "Paul Douglas",
            "url": "/name/nm0007222/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6700,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0077090/"
        },
        {
            "@type": "Person",
            "name": "Alfred Hayes",
            "url": "/name/nm0370883/"
        },
        {
            "@type": "Person",
            "name": "Clifford Odets",
            "url": "/name/nm0644048/"
        }
    ],
    "datePublished": "1952-06-06",
    "description": "Mae Doyle comes back to her hometown a cynical woman. Her brother Joe fears that his love, fish cannery worker Peggy, may wind up like Mae. Mae marries Jerry and has a baby; she is happy but restless, drawn to Jerry's friend Earl.",
    "director": [
        {
            "@type": "Person",
            "name": "Fritz Lang",
            "url": "/name/nm0000485/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama",
        "Film-Noir",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjc3NGY2MjQtMzY0Zi00YTUxLTk2NTItN2FjNzUzNTE3OGI5XkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "loveless marriage,anger,rumor,gossip,pier",
    "name": "Clash by Night",
    "original_info": {
        "id": "Clash by Night_1952",
        "name": "Clash by Night",
        "year": "1952"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dougdoepke"
        },
        "dateCreated": "2012-08-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0044502/"
        },
        "name": "Heavy-Handed",
        "reviewBody": "A hardened woman returns home to a fishing village only to be caught between two men.\n\nAt least the movie has Andes and Monroe whose characters come across as refreshingly natural, along with revealing stock footage of the fishing industry. However, the rest of the film is pitched about ten decibels over the top, with all the subtlety of a hammer blow. Douglas's Jerry is not just a nice guy, he's a rub-your-nose-in-it Nice Guy. Similarly for Ryan's cynical Earl and Stanwyck's hard case Mae. Not even such first-rate performers as these can overcome the relentlessly overblown dialog or stagy sets. Nor does it appear the three were allowed to shade their performances beyond one-dimensional caricature. At the same time, the symbolism of roiling seas and surging tide is about as necessary as gravy on soup. In short, the movie amounts to a textbook exercise of heavy-handed histrionics and too much talk, Fritz Lang or no Fritz Lang.\n\nI expect other reviewers are right about the material being shaped for 1950's audiences. In those days, one way of getting people away from TV was to promise them titillation since there was none on TV. But then producers faced the problem of Production Code limits on what could be shown or said on screen, especially in the way of sex. Thus, the emphasis in the film is on the atmospherics of desire instead of anything more literal. This results in a movie that, unfortunately, drowns in an overlay of heavy breathing, standard innuendo, and redundant symbolism. Such may have titillated audiences then; now there's just a dreary sameness in the repetition. At the same time, that turnaround ending shouldn't be overlooked. Unhappily, it's of the same Code-compromised sort that damaged more 50's movies than just this one.\n\nI guess my biggest regret is how the movie takes three of Hollywood's most capable actors and reduces them to near-caricature of their usual screen persona, Douglas and Ryan, especially. Here's hoping they were at least well paid."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this film-noir directed by Fritz Lang",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi861733401",
        "name": "Clash By Night",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWM1OGU1YzktMzIwZS00ZGZjLThlODItZWZiNGMyNjMxZmQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWM1OGU1YzktMzIwZS00ZGZjLThlODItZWZiNGMyNjMxZmQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-09T11:50:20Z",
        "url": "https://www.imdb.com/video/vi861733401/"
    },
    "url": "/title/tt0044502/"
}