{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Janelle Brady",
            "url": "/name/nm0103642/"
        },
        {
            "@type": "Person",
            "name": "Gil Brenton",
            "url": "/name/nm0107621/"
        },
        {
            "@type": "Person",
            "name": "Robert Prichard",
            "url": "/name/nm0697214/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8892,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019150/"
        },
        {
            "@type": "Person",
            "name": "Richard W. Haines",
            "url": "/name/nm0354286/"
        },
        {
            "@type": "Person",
            "name": "Mark Rudnitsky",
            "url": "/name/nm0748892/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Kaufman",
            "url": "/name/nm0442207/"
        }
    ],
    "datePublished": "1986-12-12",
    "description": "The pupils at a high school next to a nuclear power plant start acting and looking strange after buying contaminated drugs from a plant worker.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard W. Haines",
            "url": "/name/nm0354286/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Kaufman",
            "url": "/name/nm0442207/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2QyYTQ1NzktMzc3NC00ZTcwLTgwZjAtYmU0NjQ1MDFmNDQ2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "high school,nuclear power plant,splatter,female nudity,nuclear waste",
    "name": "Class of Nuke 'Em High",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Void"
        },
        "dateCreated": "2006-10-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090849/"
        },
        "name": "Hilarious trash flick!",
        "reviewBody": "When it comes to stupid trash films, Troma have no equal; and while the vast majority of their output is absolute rubbish, now and again you'll find a few gems in the rough; and unlikely as it may seem, Class of Nuke 'Em High is one such gem. The film presents a post-apocalyptic style similar to that seen in films such as The Warriors and Escape From New York, and blends it with the idea of a school being run by several students; which is reminiscent of the hit thriller Class of 1984. This is all then mixed in with stoner culture; as its toxic weed that causes all the problems, and you have a recipe for a successful trash flick. The film opens with a 'routine nuclear evacuation drill' at Tromaville High; a school situated next to a nuclear power plant. One kid goes mental, and it's not long before we see that a local gang are buying weed from a nuclear plant worker and selling it to the kids at school. The weed grows faster than normal; and there's a reason for that, as toxic waste has contaminated it and pretty soon the kids of Tromaville High start acting rather strangely...\n\nIf this film was made by any other production company; I'd probably say it has a point to make about the advent of nuclear power, but since this is Troma it's clear that they've simply lifted a common fear and turned it into a schlock film. There's absolutely no point to it; but seeing all the general carnage is a lot of fun, and director Richard W. Haines isn't afraid to go completely over the top, despite the obvious limitations of his special effects budget. The film plays out something like a zombie movie; although there are influences from other sources, and not all the afflicted characters turn into mindless beings. The gang at the centre of the film is an interesting troupe, and their style fits the jokey tone of the film very well. It's good to see a film like this that has a sense of humour, and absolutely nothing in the film is to be taken seriously; shown best by the fact that the central location is 'Tromaville', and is the 'toxic chemical capital of the world'! The special effects towards the end get a little silly, but it's all in good fun; and while this movie won't be to everyone's tastes, if you enjoy schlock horror - you'll love this!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0090849/"
}