{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Keaton",
            "url": "/name/nm0000474/"
        },
        {
            "@type": "Person",
            "name": "Kathy Baker",
            "url": "/name/nm0000834/"
        },
        {
            "@type": "Person",
            "name": "Morgan Freeman",
            "url": "/name/nm0000151/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6683,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0310123/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Tod Carroll",
            "url": "/name/nm0141012/"
        }
    ],
    "datePublished": "1988-08-10",
    "description": "A hustling drug addict checks himself into rehabilitation to escape trouble with the law and realizes that it's exactly what he needs.",
    "director": [
        {
            "@type": "Person",
            "name": "Glenn Gordon Caron",
            "url": "/name/nm0139111/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmQzYmY2ZmEtYWE1Mi00NjZmLThkNjYtNjNmYWUyOTNhMjRlXkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1_.jpg",
    "keywords": "alcoholic,anti hero,recovering alcoholic,recovering drug addict,embezzlement",
    "name": "Clean and Sober",
    "original_info": {
        "id": "Clean and Sober_1988",
        "name": "Clean and Sober",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ijonesiii"
        },
        "dateCreated": "2005-12-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094884/"
        },
        "name": "Superb movie, anchored by a powerhouse starring performance...",
        "reviewBody": "Michael Keaton turned in the performance of his career in CLEAN AND SOBER, a somber, yet riveting 1988 drama which starred Keaton as Daryl Poynter, a go-getter real estate agent who is in complete denial about a serious problem he has with drugs and alcohol. A serious night of partying goes deadly wrong for Daryl and he finds himself a fugitive from the law and decides to hide out at a drug and alcohol rehabilitation center, aware of their rules regarding confidentiality. Daryl resists the program initially, still in denial, but eventually comes to realize that he is really an alcoholic and a drug addict and that he must deal with this realization if he ever wants to look at himself in the mirror again. This movie is gritty and uncompromising in its realistic depiction of drug and alcohol addiction and where the addiction can take you. Daryl is depicted breaking into his office looking for money as well as calling his parents asking them them to apply for a second mortgage on their house so that they can lend him the money. These scenes are frighteningly realistic for those who have dealt with addiction or have a loved one caught in the grips of addiction. Michael Keaton delivers a powerhouse performance, the best of his career, as Daryl, the big shot who sees his world crumbling around him and continues to deny what the root of the problem really is. Morgan Freeman gives his usual solid performance as the head counselor at the rehab center. Kathy Baker, Tate Donavan, and Claudia Christian also offer solid support as fellow rehab clients and M. Emmett Walsh plays Daryl's sponsor, a relationship Daryl accidentally stumbles into. If you have ever had a problem with drugs or alcohol or care about someone who does, CLEAN AND SOBER is an important film to see and ponder. The film doesn't answer all the questions that may come to mind about the disease of addiction, but it clearly shows where denial can take someone suffering from the disease A riveting and powerful film that should not be missed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3015573785",
        "name": "Clean And Sober",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjM4M2QwOTUtZjdkNS00ZWM2LWIzMmQtZGMwNzA0NDZhNTE3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjM4M2QwOTUtZjdkNS00ZWM2LWIzMmQtZGMwNzA0NDZhNTE3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:26:07Z",
        "url": "https://www.imdb.com/video/vi3015573785/"
    },
    "url": "/title/tt0094884/"
}