{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brian O'Halloran",
            "url": "/name/nm0641168/"
        },
        {
            "@type": "Person",
            "name": "Jeff Anderson",
            "url": "/name/nm0026879/"
        },
        {
            "@type": "Person",
            "name": "Marilyn Ghigliotti",
            "url": "/name/nm0003870/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 226346,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007545/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Kevin Smith",
            "url": "/name/nm0003620/"
        }
    ],
    "datePublished": "1994-11-09",
    "description": "A day in the lives of two convenience clerks named Dante and Randal as they annoy customers, discuss movies, and play hockey on the store roof.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Smith",
            "url": "/name/nm0003620/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzE1Njk0NmItNDhlMC00ZmFlLWI4ZTUtYTY4ZjgzNjkyMTU1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "friendship,low budget film,female full frontal nudity,friend,convenience store",
    "name": "Clerks",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "movieguy1021"
        },
        "dateCreated": "2004-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109445/"
        },
        "name": "Clerks.: 8/10",
        "reviewBody": "Everyone has to start somewhere. Kevin Smith started his popular Jay and Silent Bob series with Clerks., a $50,000 film whose soundtrack cost more than the actual movie cost to make. It's poorly done, it's monochromatic (which actually works to its advantage), it's cheap, but it's funny, and that's all that really counts. The story is more than I thought it would be, and it's continuously funny throughout the whole short runtime. Many of the crude adventures of Dante and Randal are now legendary.\n\nDante (Brian O'Halloran) works at the Quick Stop convenience store. He's called in on a day off. His friend Randal (Jeff Anderson) works next door at a video store, but sporadically closes it to hang out at the Quick Stop. Throughout the day, various things occur, such as a gum representative trying to get people to stop smoking and chew his gum, a rabbi using the employee's bathroom (with an unexpected twist at the end), disrupting a wake, and the now-classic scene at the video store with \"Happy Scrappy Hero Pup\".\n\nThis movie has non-stop humor going for it. Whether it's Dante's or Randal's confrontations with the unruly customers (who seem over-the-top yet regular), their conversations about nothing (especially Star Wars), or their departures from their respective stores to play hockey or whatnot. I can see that Clerks. is to minimum wage earners as Office Space is to office workers. Dante's always a little timid when it comes to dealing with the unruly customers, but when Randal takes the stage, it's a lot funnier.\n\nAlthough the parts about Veronica (Marilyn Ghigliotti) and Cairlin (Lisa Spoonhauer) weren't that interesting (except for the 36...make that 37 people), they were necessary, and seemed to create a plot out of this, basically, sketch comedy. It succeeded, and turned it into a great all around film. Most of these people had never acted before, and although it does seem like they're just reciting their lines (there's almost no break in between the dialogue), they do a good job at it. Sometimes it seems a little too scripted (for voice and diction, etc.), but for a bunch of first-timers, it's not bad at all.\n\nConsidering the rest of the series (besides Mallrats, which I haven't seen), I'd say Clerks. is close with Jay and Silent Bob Strike Back for the funniest Kevin Smith movie. They're also the two crudest, and the first and last in the series, respectively. But Clerks. will always stay as it was when it was released 10 years ago-revolutionary. It showed that money and action aren't important to make a movie funny.\n\nMy rating: 8/10\n\nRated R for extensive use of extremely explicit sex-related dialogue.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A day in the lives of two convenience clerks named Dante and Randal as they annoy customers, discuss movies, and play hockey on the store roof. ",
        "duration": "PT1M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3706625561",
        "name": "Clerks",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzc2ODIwZTAtYzBiMC00YjI4LWIxOTUtNzFmMjYwNzM0M2UzXkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzc2ODIwZTAtYzBiMC00YjI4LWIxOTUtNzFmMjYwNzM0M2UzXkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg",
        "uploadDate": "2011-10-26T03:14:15Z",
        "url": "https://www.imdb.com/video/vi3706625561/"
    },
    "url": "/title/tt0109445/"
}