{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yaniss Lespert",
            "url": "/name/nm1293391/"
        },
        {
            "@type": "Person",
            "name": "Pierre Mignard",
            "url": "/name/nm0585988/"
        },
        {
            "@type": "Person",
            "name": "Marie Bunel",
            "url": "/name/nm0120431/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1096,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Close to Leo",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0088600/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037417/"
        },
        {
            "@type": "Person",
            "name": "Diastème",
            "url": "/name/nm1291916/"
        },
        {
            "@type": "Person",
            "name": "Christophe Honoré",
            "url": "/name/nm0393394/"
        }
    ],
    "datePublished": "2003-10-18",
    "description": "When 21-year-old Leo, the oldest of four brothers, announces to his rural French family that he's HIV+ family bonds are tested. The family decides that 11-year-old Marcel, the youngest, is too young to understand, and the family a...",
    "director": [
        {
            "@type": "Person",
            "name": "Christophe Honoré",
            "url": "/name/nm0393394/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWQyNWFkZjQtZGYyMi00NGY1LWFmYjQtODEwNTBmODMxZGVmL2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "pubic hair,male pubic hair,boy bath scene,boy rear nudity,night swimming",
    "name": "Tout contre Léo",
    "original_info": {
        "id": "Close to Leo_2002",
        "name": "Close to Leo",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thomasdosborneii"
        },
        "dateCreated": "2011-10-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0346039/"
        },
        "name": "How Would WE?",
        "reviewBody": "How DOES a person react to the news that they have HIV and how does their family act? In fact, how do we think WE would act? Well, regarding that second question, I honestly don't have the slightest idea and fortunately, haven't had to find out. But I am guessing that it would involve a vast variety of conflicting and changeable emotions and behaviors, both rational and irrational, as was expressed here in this, what I can only believe is a very realistic film...because each individual and family may have their own responses. I think all emotional responses and behaviors are realistic and justified under the circumstances, even some that might generate distaste among some viewers of this film. A family, with its shock, fear, grief, and shame, if they feel those emotions, may decide to protect whom they believe is a more vulnerable member of the family. Then they may decide that that was the wrong tack to follow. Or maybe not. Who knows WHAT to do, really? Sometimes paralysis is bound to take over to the extent of collapsing into semi-catatonia, or maybe the opposite, such as running wildly toward a futile sense of escape. Any and everything may happen, and all are valid.\n\nIsn't it realistic that one so stricken might want to reach out to people who had held meaning in the past, but not really have any idea how to go about that in a prudent way? Or maybe there will be feelings of hatred or envy of those who are able to peacefully go through the normalcy of their lives, because they do not have this issue to suddenly contend with. Maybe one might for a moment become utterly irresponsible and uncaring, or self-destructive, for in the face of death, or certain pain and anguish, what of any shreds of a former morality may seem to truly matter?\n\nI believe that this film accurately explores the potential universe of reactions in a powerfully communicative way. This maybe made the \"narrative story\" jerky or uncomfortable to watch or understand, but if so, welcome to THEIR world.\n\nI don't believe that the makers of this film believe that this film, or any other, shows the definitive way things will happen under these circumstances. I think they know more than that...that they know that we all DON'T know and all bets are off, but in their work, here, they are going to explore and have the viewer live some of the possibilities. And I felt that as a viewer, they were very successful. I couldn't help but feel throughout this movie, things maybe I didn't want to feel, but I then I shouldn't watch a movie like this if I wanted to be protected. We all knew going into it what the subject matter was.\n\nOne thing that I thoroughly appreciated about the film was the physical affection and body contact among the various family members that seemed to disturb the sensibilities of some reviewers, when it is so clear to me that one valid reaction might be the family's desire (either being satisfied in actuality or else communicated metaphorically via the visual language of film) to utterly ABSORB every precious square inch of not only the body of the loved one that is soon to be falling apart, possibly into nothingness, but also those suddenly even-more- precious-than-ever-before who will remain after the one so stricken has gone, all of whom will have to live with this shared loss for the rest of their lives. And for the one stricken, to connect with the sweet human flesh of those whom he loves while he still can effect such a connection, I submit that the most fundamental and reliable communication of all may be through touch and the body, for the emotions and the intellect would be too much in a typhoon to be constant.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0346039/"
}