{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Pam Grier",
            "url": "/name/nm0000427/"
        },
        {
            "@type": "Person",
            "name": "Booker Bradshaw",
            "url": "/name/nm0103468/"
        },
        {
            "@type": "Person",
            "name": "Robert DoQui",
            "url": "/name/nm0233306/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11947,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022781/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035216/"
        },
        {
            "@type": "Person",
            "name": "Jack Hill",
            "url": "/name/nm0384335/"
        }
    ],
    "datePublished": "1973-05-11",
    "description": "A sexy Black nurse takes vigilante justice against inner-city drug dealers after her sister becomes their latest victim.",
    "director": [
        {
            "@type": "Person",
            "name": "Jack Hill",
            "url": "/name/nm0384335/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5MDI4Njc1OF5BMl5BanBnXkFtZTcwNjY4OTEzNA@@._V1_.jpg",
    "keywords": "blaxploitation,vigilante justice,social decay,female vigilante,organized crime",
    "name": "Coffy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "batzu"
        },
        "dateCreated": "2002-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069897/"
        },
        "name": "the best Pam Grier movie!",
        "reviewBody": "if you've always wondered what was so great about Pam Grier, and haven't seen any of her movies from the seventies, look no further than Coffy. Coffy has it all, violence, pimps, drugs, nudity, sex, and it's served up with some severe camp and crazy dialogue. what sets this movie apart from other blaxploitaion movies is the excellent story and powerful performance of Miss Grier. I don't think anyone else could have pulled it off, and despite the low budget ambiance and feeling the movie took about a couple of weeks to make, Grier gives a performance worthy of her cult reverence.\n\nthe movie is a typical revenge story, with a not so typical hero-a black woman. Coffy's sister is hooked on smack and Coffy vows to herself to destroy the people responsible. Coffy works as a nurse by day, and prowls the clubs by night looking for the pusher who destroyed her sister's mind with drugs. Her search leads her to a pimp, a mobster, the cops, and a politician. In the end, she takes care of them all using her brains as well as her body, and damn do she have a body! Pam Grier makes this movie believable despite the obvious flaws of the low budget production. Her character never shows the weak side of femininity and fall into the ethos that women are at some point weaker than men. Coffy never breaks down to cry for help, waiting for a man or anyone else to help her-she does it all on her own. she kicks ass all over, and no other movie has done that with a female character, at least not anything credible. Coffy makes Thelma and Louise look like Laverne and Shirley.\n\nPam went on to make more movies of this ilk, but none were as popular nor as good as Coffy. what about Foxy Brown you ask? despite a better title, it doesn't compare to Coffy in either performance or content. Coffy served to bring Pam Grier into the main stream, as much as any black actress could be, and make her a star. all i can say is, thank you Quentin Tarentino for making Jackie Brown and proving her power and presence as an actress. See this movie, then see Jackie Brown, you'll see why Tarentino made it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "On this IMDbrief we recognize cinematic representations of black power that leapt off the screens in the 1970s and milestone movies that you should add to your Watchlist.",
        "duration": "PT4M51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1652539673",
        "name": "Blaxploitation Movies & Black Power in the 1970s",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTVmNTg1NTItNTIwMi00MzBjLWEwOTEtZjU1NWY1OWY2NjkzXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTVmNTg1NTItNTIwMi00MzBjLWEwOTEtZjU1NWY1OWY2NjkzXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg",
        "uploadDate": "2021-01-21T21:07:23.770Z",
        "url": "https://www.imdb.com/video/vi1652539673/"
    },
    "url": "/title/tt0069897/"
}