{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eileen Atkins",
            "url": "/name/nm0040586/"
        },
        {
            "@type": "Person",
            "name": "Kate Beckinsale",
            "url": "/name/nm0000295/"
        },
        {
            "@type": "Person",
            "name": "Sheila Burrell",
            "url": "/name/nm0123090/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7200,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103745/"
        },
        {
            "@type": "Person",
            "name": "Malcolm Bradbury",
            "url": "/name/nm0102903/"
        },
        {
            "@type": "Person",
            "name": "Stella Gibbons",
            "url": "/name/nm0316599/"
        }
    ],
    "datePublished": "1996-05-10",
    "description": "A recently orphaned young woman goes to live with eccentric relatives in Sussex, where she sets about improving their gloomy lives.",
    "director": [
        {
            "@type": "Person",
            "name": "John Schlesinger",
            "url": "/name/nm0772259/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWI3MTA3NGEtYTg4ZC00MzgwLTliMGQtMjU2MWM5MmVmYThhXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "female protagonist,female led relationship,f rated,women wearing leather helmet and goggles,farm",
    "name": "Cold Comfort Farm",
    "original_info": {
        "id": "Cold Comfort Farm_1995",
        "name": "Cold Comfort Farm",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aimless-46"
        },
        "dateCreated": "2006-07-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112701/"
        },
        "name": "Something Nasty in the Woodshed",
        "reviewBody": "If you are searching for comparisons to help you decide whether to watch \"Cold Comfort Farm\" imagine a slightly older \"Pollyanna\" going to live on a rundown version of \"Babe's\" English farm with a strange and bleak collection of her country cousins. \n\nThis is an excellent and very earthy adaptation of Stella Gibbon's 1932 satirical novel (which itself is an odd marriage of Hardy and Wodehouse). Where the village pub is named \"The Condemned Man\" and the cows are named Aimless, Feckless, Graceless, and Pointless. Both the novel and its adaptation are joyfully depressing and packed with literary eccentricity and subtle humor. If you like \"Faulty Towers\" then you can expect to get off on the humor. But if you prefer \"Hot Shots! Part Deux\", you should probably pass on \"Cold Comfort Farm\". \n\nThere are three possible viewer reactions: It's not funny. I didn't figure out it was a comedy until halfway through but then I found it hilarious. I couldn't stop laughing. \n\nKate Beckinsale plays Flora Poste (always referred to by her relatives as Robert Poste's daughter), a recently orphaned 19 year old who chooses to live with relatives (the Starkadders) she has never met, at gloomy Cold Comfort Farm in Sussex. Beckinsale, even more radiant than usual, pulls off a nice characterization of the resourceful yet snobbish heroine. Like Pollyanna, she is a catalyst for positive change, but they are calculated changes. Her instinctive snobbishness (Beckinsale has a real talent for this) is played for laughs since everyone would feel a bit superior and distanced from this eccentric collection of misfits.\n\nThe adaptation nicely incorporates Gibbons's subtle parody of Jane Austen romantic clichés, from the controlling madwoman in the attic to wood nymph poetess, to the quivering parishioners. Even the production design is a funny send-up of the standard BBC mini-series look. \n\nThis is really a terrific production, doubly so for Beckinsale fans.\n\nThen again, what do I know? I'm only a child.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0112701/"
}