{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kathryn Morris",
            "url": "/name/nm0606700/"
        },
        {
            "@type": "Person",
            "name": "Danny Pino",
            "url": "/name/nm0992694/"
        },
        {
            "@type": "Person",
            "name": "John Finn",
            "url": "/name/nm0278125/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28894,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039979/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005035/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048735/"
        },
        {
            "@type": "Person",
            "name": "Meredith Stiehm",
            "url": "/name/nm0825284/"
        }
    ],
    "datePublished": "2003-09-28",
    "description": "The Philadelphia homicide squad's lone female detective finds her calling when she's assigned \"cold cases,\" older crimes that have never been solved.",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDVmYTk3NzUtYzhhMi00ODY5LWFjYWYtMjc4ZWJiMzdhMzYzXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "female protagonist,strong female,female detective,series title spoken by character,police protagonist",
    "name": "Cold Case",
    "original_info": {
        "id": "Cold & Dark_2005",
        "name": "Cold & Dark",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ma-cortes"
        },
        "dateCreated": "2019-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368479/"
        },
        "name": "Nostalgic and sensitive series about a Philadelphia investigation squad assigned to investigate cold cases committed many years ago",
        "reviewBody": "Good show, nice series formed by 156 episodes, 7 seasons ,about an expert force at law, a professional squad of homicides, Philadelphia set, taking on cold cases, bringing them to life . Being starred by lone female detective Lilly, Kathryn Morris, who finds her calling when is assigned by her superior boss John Stilman : John Finn, to investigate criminal \"Cold Cases\" , older crimes that have ever been solved and working for Philadelphia Department . They must attempt to re-think the killing scenes and interview other people involved with the victims to find out a link to solve the criminal cases executed many years earlier. At their hard work they suffer risked incidents, at times, and dangerous situations that from time to time put them on the verge of nervous breakdown. It is well paced by using flashbacks, including nostalgic songs from the 60, 70s, 80s, 90s... Homicide is timeless but detection methods change. Hope lives, because the evidence never dies. Better late than never.\n\nThis active team is formed by following members : Lily : Kathryn Morris, she is only investigator woman , she suffered a sad past when was assaulted by a nasty attacker as a little girl. John Stillman : John Finn, he is Lily's chief, and at times her surrogate daddy figure, and the one who was there for her after being attacked by a stranger assailtant as child. Detective Scotty Valens : Danny Pino, he is a street-smart guy and Lilly's best friend, who tells her his problems, he fought with the real guilt and grief when his fiancee suffered schizofrenic visions , seeing imaginary old friends and she subsequently committed suicide. Detective Will Jeffries : Thom Barry, he is a previous Vietnam war veteran, he lost his spouse at a hit-and-run truck crash and he feels really affected still, he is a good friend to the other Inspectors. Detective Nick Vera : Jeremy Ratchford, he is an overweight inspector who was left by his wife, but he really wishes to have an ordinary family , he was eventually missed after unintentionally having detained an innocent man and accusing him as a killer . Kat Miller : Tracie Thoms, she previously worked in narcotics, she knows well the delinquency area of Philadelphia, she has a little girl daughter whose father is an ex-mobster, that is why she has family problems. Louie : Doug Spinazza, he is an specialist at the science of explosives and fire, using his weapons skills to help solve criminal cases . Frankie : Tania Raymonde, she is expert in photography at the Philadelphia police department, her skills are really necessary to discover crimes, she had a brief love relationship with Scotty. And Susan Chuang as an expertise forensic . Furthermore, Raymond J Barry, as Lily father, he was out her life throughout his infancy, however, appearing many years later when Lily was seriously injured. And Nicky Aycox as Lily's troublesome sister, she is a promiscuous girl who cheated her, the reason for Lily often resents her entire family, including her drunk mother. Adding a good plethora of guest stars showing up through the 156 episodes, such as : Michael Pare, Barbara Niven, Daniel Baldwin, Jesse Plemons, Susanna Thomson, Maggie Grace, Kevin Chapman, Silas Mitchell, DW Moffet, Jessica Tuck, Thine, Meredith Salenger, Diane Ladd, Jeffrey Nordling, John Diehl, Stacey Edwards and many others\n\nThe series was originally created by Meredith Stiehm supported by Veena Sud, Liz Garcia, Mark Pellington and produced by Jerry Bruckheimer. Being directed by notorious directors as Deran Sarafian, Marcus Siega, Tim Hunter, Bryan Spicer, Kevin Hooks, James Withmore Jr, Nelson MacCormick, Rachel Talalay, Jeffrey Hunt, Jeannot Szwarc, Andy Garcia and John Finn himself.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Cold Case: Season 6",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2115943705",
        "name": "Cold Case: Season 6",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2VmMTdlM2ItMjIyMy00MGM4LWE3MmUtMGYyYWJhMWVhYjA3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2VmMTdlM2ItMjIyMy00MGM4LWE3MmUtMGYyYWJhMWVhYjA3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-11T21:18:27.259Z",
        "url": "https://www.imdb.com/video/vi2115943705/"
    },
    "url": "/title/tt0368479/"
}