{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Buster Keaton",
            "url": "/name/nm0000036/"
        },
        {
            "@type": "Person",
            "name": "Anne Cornwall",
            "url": "/name/nm0180465/"
        },
        {
            "@type": "Person",
            "name": "Flora Bramley",
            "url": "/name/nm0104238/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5080,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000357/"
        },
        {
            "@type": "Person",
            "name": "Carl Harbaugh",
            "url": "/name/nm0361882/"
        },
        {
            "@type": "Person",
            "name": "Bryan Foy",
            "url": "/name/nm0289381/"
        }
    ],
    "description": "Ronald's high-school valedictory address praises books and condemns sports. His girlfriend Mary condemns his attitude. Fearing to lose her to rival Jeff, he decides to go to college and pay more attentions to sports.",
    "director": [
        {
            "@type": "Person",
            "name": "James W. Horne",
            "url": "/name/nm0395023/"
        },
        {
            "@type": "Person",
            "name": "Buster Keaton",
            "url": "/name/nm0000036/"
        }
    ],
    "duration": "PT1H6M",
    "genre": [
        "Comedy",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTY3NGUyYzgtMWNjNi00ZWZhLTk5NDEtMWI0ZDcwMTRiMGY2XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "blackface,college,student,athlete,college student",
    "name": "College",
    "original_info": {
        "id": "College_1927",
        "name": "College",
        "year": "1927"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ackstasis"
        },
        "dateCreated": "2007-11-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0017765/"
        },
        "name": "Athletics provides Keaton with a goldmine of great gags",
        "reviewBody": "While this may seem a rather lightweight effort considering it came in the same year that produced 'The General (1927),' 'College' is an excellent little film in which Buster Keaton exploits the endless slapstick possibilities offered by sporting activities. Keaton plays Ronald, an unpopular bookworm whose public condemnation of athletics leads his girlfriend (Anne Cornwall) to dump him in favour of a more physically-capable jock (Harold Goodwin). In an attempt to win back the love of his life, Ronald enrolls himself in college and tries his hands at every sport in sight, with hilarious consequences. The two preceding sentences pretty much summarise the entire film. However, this inkling of a narrative is more than enough to open up a vast range of entertaining gags, and Keaton snatches a laugh at every opportunity.\n\nHow do I begin to list my favourite moments from 'College?' Though some have complained of the repetitiveness of the sequence in which Keaton tries every athletics activity in the book, I thought it was the highlight of the film. The scenes follow a very strict comedic routine: first we see how it is supposed to be done, then we see Ronald's absurdly inept attempt. Wash, rinse, repeat; this time with a completely different sport. Of course the routine becomes somewhat predictable, but Buster Keaton is always the uncertain variable. We don't know how his next effort is going to fail, but we know it is, and that it's going to be a spectacular failure. Ronald is a hopeless case, but you can't deny that he's got heart. Whether he is being out-sprinted by a pair of young children, falling short of the long-jump sandpit, snapping a pole-vaulting stick in half or planting his face two feet underground after clearing the high-jump bar, he is always courageous enough to get up, brush himself off and try again.\n\nI've read that Harold Lloyd explored similar territory two years earlier with 'The Freshman (1925),' a film I haven't seen yet, so that one's probably a good film to look up if you, like me, enjoyed this one. It is also believed that there was originally a sequence showing Ronald's attempts to play American football, though this was ulimately cut to avoid comparisons with Lloyd's movie. Additionally, I was interested to read that Ronald's pole-vault through the window was one of the few times in Keaton's career that he didn't perform his own stunts. I'm certain that the danger-level was definitely not the problem {anybody who's seen 'Steamboat Bill, Jr. (1928)' will attest to that}, but pole-vaulting must have been one activity that he simply couldn't pull off. I don't blame him.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0017765/"
}