{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kathryn Walker",
            "url": "/name/nm0907923/"
        },
        {
            "@type": "Person",
            "name": "Don Wood",
            "url": "/name/nm1332521/"
        },
        {
            "@type": "Person",
            "name": "Clare Samuels",
            "url": "/name/nm1651483/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 232,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0068191/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075509/"
        }
    ],
    "datePublished": "2004-05-17",
    "description": "A group of ordinary people arrive on a boat to 1628 and have to build a functioning colony, using only time appropriate resources. Their goal: survive for 4 months and pass the final evaluation.",
    "genre": [
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTExMjE0NTM3OTVeQTJeQWpwZ15BbWU3MDMxNTg5MjE@._V1_.jpg",
    "keywords": "boat,tv mini series,non fiction",
    "name": "Colonial House",
    "original_info": {
        "id": "Colonial House_2004",
        "name": "Colonial House",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "curtis-8"
        },
        "dateCreated": "2004-05-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0403745/"
        },
        "name": "Easily the Crappiest of its kind",
        "reviewBody": "The latest in an increasingly long line of public television \"reality\" programs featuring modern day people trying to live according to the rules and limitations of a more primitive past, \"Colonial House\" is by far the worst produced and least successful. In previous incarnations like \"Frontier House\" and \"Victorian House\" (or something like that) the participants at least seemed willing to try to live up to the obligations they took on when signing up. In \"Frontier\" for instance, they went in knowing that they were going to have to build their own dwellings and grow their own food. They were surprised by how hard it was, tensions flared, etc. But they never acted like they didn't know what the whole point was--to live like pioneers.\n\nThe people in \"Colonial House\" act as though they had been kidnapped and forced to participate against their will. I mean, the whole point was to live the 16th century early-colonial life and we have one woman who bitches without end about how women are treated as second class citizens and about how she shouldn't have to go to church services because she's an atheist. Commendable sentiments in the 21st century, but crap like that would have gotten her burned as a witch back in the old days. So, if she's not willing to play along with the concept, why did she sign up to be on the TV show? And what's with all the indentured servants complaining about having to do what they're told? They're supposed to be SLAVES for God's sake! They signed up to be just that! Didn't any of them look up the term \"indentured servitude\" before they went to the show's auditions?\n\nI suspect that the producers of this new show have purposely set it up to be an only half-real \"Real World\" ripoff instead of the usual documentary experiment, complete with pre-set conflicts and phony drama. For instance, one colonist has a dramatic moment when he \"comes out\" to the rest of he colony and announces that he is gay. I mean, come on--like it matters? Did anyone ask? It's not like anyone expected that he was going to marry one of the wenches or anything, right? A totally fake moment of drama. And not the only one. The show is rife with obviously staged moments and impossibly perfect camera placements. And on top of that, almost every single one of the Colonist is annoying as hell (except for the bearded guy who says f*ck all the time and the governor's hot daughter). \n\nI have firm suspicions that the almost entirely inept \"Colonial House\" is really a brilliant new mocumentary by Christopher \"Waiting for Guffman\" Guest."
    },
    "url": "/title/tt0403745/"
}