{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Penn",
            "url": "/name/nm0000576/"
        },
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        },
        {
            "@type": "Person",
            "name": "Maria Conchita Alonso",
            "url": "/name/nm0000744/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 27844,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001995/"
        },
        {
            "@type": "Person",
            "name": "Michael Schiffer",
            "url": "/name/nm0771512/"
        },
        {
            "@type": "Person",
            "name": "Richard Di Lello",
            "url": "/name/nm0223960/"
        }
    ],
    "datePublished": "1988-04-29",
    "description": "An experienced cop and his rookie partner patrol the streets of East Los Angeles while trying to keep the gang violence under control.",
    "director": [
        {
            "@type": "Person",
            "name": "Dennis Hopper",
            "url": "/name/nm0000454/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2U4YTE3ZTctNGMwZi00Y2QyLWFkNTYtNmU0ZTRmMzNkY2ViXkEyXkFqcGdeQXVyMTA5ODk3NA@@._V1_.jpg",
    "keywords": "gang,violence,police shootout,female frontal nudity,pubic hair",
    "name": "Colors",
    "original_info": {
        "id": "Colors_1988",
        "name": "Colors",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dee.reid"
        },
        "dateCreated": "2017-07-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094894/"
        },
        "name": "\"Colors, Colors, Colors, Colors, Colors...\"",
        "reviewBody": "And so goes the chorus for rapper Ice-T's hit gang warfare anthem \"Colors,\" which also happened to be the name of the 1988 gang warfare action film \"Colors,\" which was directed by the late actor/director Dennis Hopper, who does not appear at all in the film.\n\n\"Colors\" was one of the earliest films to deal with the bloody gang violence that by 1988 when the film was released, close to 400 gang-related murders had occurred in the greater Los Angeles area. The police were overworked and unable to effectively deal with the increasing gang violence, communities were forced to live in fear, and the L.A. streets were a virtual war zone.\n\n\"Colors\" was also different from previous films dealing with gangs in the fact that although it was told largely from the point-of-view of the dedicated police officers out there on the streets trying to curb the rising gang violence and ease community fears, it also showed us some of the inner-workings of gangs and why some people, mostly teenagers and young adults, join them and find such a dangerous lifestyle so rewarding. For once, gang members are given a human face so that we understand why they may do what they do as gangs.\n\nThe film focuses on the L.A. Police Department's anti-gang C.R.A.S.H. (Community Resources Against Street Hoodlums) unit. At the beginning of the film, and using a set-up familiar to the many buddy-cop action films produced during the time, veteran C.R.A.S.H. officer Bob Hodges (Robert Duvall) is partnered up with the brash, young Danny McGavin (Sean Penn). Hodges knows the streets and has an informal rapport with many of the local L.A. gangs, and many of them know him; there's a sense of mutual respect between Hodges and the gang members. Danny also knows the streets, but knows nothing of how to fight the gangs terrorizing them and he just wants to bust heads and make arrests.\n\n\"Colors\" is almost episodic as Hodges and Danny go from one anti-gang operation to another, but a plot of sorts forms at the scene of the latest gang homicide. A young \"Blood\" gang member is gunned down in his backyard by a rival \"Crips\" crew, led by Rocket (Don Cheadle, in an early role playing a character with much restrained malevolence). Hodges and McGavin are put on the case, and as their investigation goes on, it brings them into contact with many of the other local L.A. gangs fighting for \"turf\" in the streets - eventually culminating in a bloody turf war with the cops and surrounding communities caught in the middle.\n\n\"Colors\" does have its weaknesses in an occasionally spotty script and weak dialogue. But the film keeps you watching and engaged to what's going on on the screen. Fault can be found, of course, with the buddy-cop formula of pairing a veteran like Robert Duvall with an unseasoned rookie in Sean Penn. But their pairing works, as the two constantly clash with one another over their differing approaches to the job - but gradually build a grudging respect for the other man and his perspective on how to best handle their situation.\n\n\"Colors\" was also remarkable, as I mentioned earlier, in that the gang members themselves are not nameless, faceless entities occupying your typical us-vs.-them war flick. No. Hopper actually took the opportunity to go inside the gangs so that we get to know some of them as characters. We don't condone anything they do, but we get to know them and understand why gang-banging is so appealing - family, belonging, lack of ambition and/or opportunity, power/status, the overall lifestyle, etc. It was a brave and revealing, and unflinching, insight, and a departure, since not having this could have made \"Colors\" seem like your run-of-the-mill late-'80s cop movie.\n\nA great action-crime film that comes highly recommended from this viewer.\n\n8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1706737433",
        "name": "Colors",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWU4ODYwMjQtYjU3OC00ZjhmLTkyODYtODVjMTkzM2ZkOTA3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWU4ODYwMjQtYjU3OC00ZjhmLTkyODYtODVjMTkzM2ZkOTA3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-30T17:11:21.590Z",
        "url": "https://www.imdb.com/video/vi1706737433/"
    },
    "url": "/title/tt0094894/"
}