{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aleksey Kravchenko",
            "url": "/name/nm0470385/"
        },
        {
            "@type": "Person",
            "name": "Olga Mironova",
            "url": "/name/nm0592500/"
        },
        {
            "@type": "Person",
            "name": "Liubomiras Laucevicius",
            "url": "/name/nm0490708/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 83933,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "alternateName": "Come and See",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0114140/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0917448/"
        },
        {
            "@type": "Person",
            "name": "Ales Adamovich",
            "url": "/name/nm0010696/"
        },
        {
            "@type": "Person",
            "name": "Elem Klimov",
            "url": "/name/nm0459552/"
        }
    ],
    "datePublished": "1985-09-03",
    "description": "After finding an old rifle, a young boy joins the Soviet resistance movement against ruthless German forces and experiences the horrors of World War II.",
    "director": [
        {
            "@type": "Person",
            "name": "Elem Klimov",
            "url": "/name/nm0459552/"
        }
    ],
    "duration": "PT2H22M",
    "genre": [
        "Drama",
        "Thriller",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODM4Njg0NTAtYjI5Ny00ZjAxLTkwNmItZTMxMWU5M2U3M2RjXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "mass murder,nazi occupied soviet union,extermination,nazi occupation,year 1943",
    "name": "Idi i smotri",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmFlaneur"
        },
        "dateCreated": "2004-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091251/"
        },
        "name": "One of the greatest wars films ever made",
        "reviewBody": "One of the greatest of all war films, Klimov's stunning work stands amongst such works in which the horror and sorrow of conflict are made fresh over again for the viewer, left to stumble numb from the cinema thereafter. Produced for the 40th anniversary of Russia's triumph over the German invaders in WW2, based upon a novella by a writer who was a teenage partisan during the war, the propagandist use to which it was later put - when the GDR was still in the Eastern Bloc, citizens were forced to watch this to warn them of another rise of fascism - does not impair its effect today at all. It echoes intensity found in another masterpiece by the director. Klimov's shorter Larissa (1980) is a remorseful elegy to his late wife. Poetic and very personal, its sense of shock anticipates the heightened anguish that ultimately reverberates through Come And See. Through his images, the director stares uncomprehendingly at a world where lives are removed cruelly and without reason, if on this occasion not just one, but thousands.\n\nAt the heart of the narrative is Floyra, both viewer and victim of the appalling events making up the film's narrative, his history a horrendous coming-of-age story. It begins with him laboriously digging out a weapon to use and much changed at the end, he finally uses one. As he travels from initial innocence, through devastating experience, on to stunned hatred, in a remarkable process he ages before our eyes, both inside and out. His fresh face grows perceptibly more haggard as the film progresses, frequently staring straight back at the camera, as if challenging the viewer to keep watching; or while holding his numbed head, apparently close to mental collapse. Often shot directly at the boy or from his point of view, the formal quality of Klimov's film owes something to Tarkovsky's use of the camera in Ivan's Childhood, although the context is entirely different.\n\nThe film's title is from the Book of Revelations, referring to the summoning of witnesses to the devastation brought by the Four Horsemen of the Apocalypse. 'Come and See' is an invitation for its youthful protagonist to arm up and investigate the war, but also one for the audience to tread a similarly terrible path, witnessing with vivid immediacy the Belorussion holocaust at close hand. Here, the intensity of what is on offer justifies amplification by the use of a travelling camera, point-of-view shots, and some startlingly surreal effects pointing up unnatural events: the small animal clinging nervously to the German commander's arm for instance, soundtrack distortions, or the mock Hitler sculpted out of clay and skull.\n\nMain character Floyra is the director's witness to events, a horrified visitor forced, like us to 'see' - even if full comprehension understandably follows more slowly. For instance during their return to the village, there is some doubt as to if Floyra is yet, or will be ever, able to fully acknowledge the nature of surrounding events. In one of the most disturbing scenes out of a film full of them, Glasha's reaction to off-screen smells and sights is profoundly blithe and unsettling. So much so, we wonder for a brief while if the youngsters really know what is going on. Its a watershed of innocence: one look back as the two leave and the reality of the situation would surely overwhelm Floyra - just as later, more explicit horrors do the viewer.\n\nCome And See was not an easy shoot. It lasted over nine months and during the course of the action the young cast were called upon to perform some unpleasant tasks including, at one point, wading up to their necks through a freezing swamp. Kravchenko's face is unforgettable during this and other experiences, and there are claims that he was hypnotised in order to simulate the proper degree of shell shock during one of the major early sequences. The sonic distortion created on the soundtrack at this point later appeared to a lesser extent in Spielberg's Saving Private Ryan, as did elements of a much-commented scene where a cow is caught in murderous crossfire. Klimov's camera ranges through and around the atrocities, although one doubts that a steady cam was available. By the end Florya is isolated from humanity, technically as well as mentally, by a striking shot that excludes the middle foreground. Disturbingly expressionistic though these scenes are, others such as the scene where Florya and the partisan girl Rose visit the forest after the bombing, achieve an eerie lyricism that are however entirely missing from the Hollywood production. And whereas Spielberg's work concludes with a dramatic irony that's perhaps a little too neat, contrived for different audience tastes, Klimov's less accommodating epic finishes on a unique, cathartic moment - no doubt partly chosen to avoid any bathos after events just witnessed, but one which sends real blame back generations.\n\nHallucinatory, heartrending, traumatic and uncompromising, such a movie will not to be all tastes. It certainly does not make for relaxing viewing, although those who see it often say it remains with them for years after. This was Klimov's last film for, as he said afterwards \"I lost interest in making films. Everything that was possible I felt had already been done,\" no doubt referring to the emotional intensity of his masterpiece, which would be hard to top. By the end of their own viewing, any audience ought to be shocked enough to pick up a rifle themselves and vengefully join the home army setting out to fight the Great Patriotic War - a necessarily stalwart response without limit of participation, symbolised by the director who tracks a camera through the dense forest before finally rejoining a column of soldiers heading to the front. If you feel, like I do, that any real war film should succeed in conveying the power and pity of it all, then Come And See is an absolute go and watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Kino International",
        "duration": "PT2M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi129958169",
        "name": "Come and See",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzk2ZTJiYTUtYTA0My00ZTQzLWI3ZDUtYWI1OTVjNjU4OTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzk2ZTJiYTUtYTA0My00ZTQzLWI3ZDUtYWI1OTVjNjU4OTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:30:09Z",
        "url": "https://www.imdb.com/video/vi129958169/"
    },
    "url": "/title/tt0091251/"
}