{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rip Torn",
            "url": "/name/nm0001800/"
        },
        {
            "@type": "Person",
            "name": "Sally Kirkland",
            "url": "/name/nm0000476/"
        },
        {
            "@type": "Person",
            "name": "Robert Blankshine",
            "url": "/name/nm0087599/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 505,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066806/"
        },
        {
            "@type": "Person",
            "name": "Milton Moses Ginsberg",
            "url": "/name/nm0320113/"
        }
    ],
    "datePublished": "2004-07-14",
    "description": "Psychiatrist installs a concealed movie camera in his apartment to record the screwed-up lives of the women who visit him.",
    "director": [
        {
            "@type": "Person",
            "name": "Milton Moses Ginsberg",
            "url": "/name/nm0320113/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUyNzg1MDc3OF5BMl5BanBnXkFtZTcwODEzOTEyMQ@@._V1_.jpg",
    "keywords": "found footage,mockumentary,transgender,docudrama,psychiatrist",
    "name": "Coming Apart",
    "original_info": {
        "id": "Coming Apart_1969",
        "name": "Coming Apart",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FoundFootageFanatic"
        },
        "dateCreated": "2023-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064180/"
        },
        "name": "Coming Apart (1969)",
        "reviewBody": "A man hides a camera in his apartment which records his sexual experiences and mental breakdown.\n\nI saw this one on Wikipedia on a list of FF movies sorted by date recently. I like watching oldies so why not? What's especially interesting is that it's from 1969 and only the 2nd FF film on the list.\n\nSo, this one really blurs the lines between \"a film of a man having a mental breakdown\" and \"a porno with a plot\". At least I thought so. There was a real lot of sex and nudity. At one point, the man reveals how he disguises the camera behind a mirror by showing it to another mirror. I appreciated that, it makes it plausible. Towards the end, he sits in front of the camera and talks at which point it's apparent that he's having a mental break. Then it's a bunch of arguing with I think an ex-wife. Other than that, it's just a bunch of sex scenes.\n\nThis movie really didn't hold my attention at all. Found myself hitting the fifteen second button a lot. It just wasn't good. Also, I didn't exactly think the hidden camera he made was believable. Nobody wondered why there's a thick box with a mirror pointing exactly at them like 6 feet away? I guess not.\n\nThis definitely checks the \"found footage\" box for me although it wasn't clear how the footage was obtained or edited, more of implied that he had a breakdown. It just wasn't very good. It's interesting to see some elements of modern FF movies in this one, and I did enjoy that. I just doubt I would watch it again.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0064180/"
}