{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sam Elliott",
            "url": "/name/nm0000385/"
        },
        {
            "@type": "Person",
            "name": "Katharine Ross",
            "url": "/name/nm0001684/"
        },
        {
            "@type": "Person",
            "name": "Barry Corbin",
            "url": "/name/nm0179224/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1967,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003687/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009512/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045447/"
        },
        {
            "@type": "Person",
            "name": "Louis L'Amour",
            "url": "/name/nm0478263/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey M. Meyer",
            "url": "/name/nm0583191/"
        },
        {
            "@type": "Person",
            "name": "Sam Elliott",
            "url": "/name/nm0000385/"
        }
    ],
    "datePublished": "1991-07-01",
    "description": "A tough cowboy facing some trouble crosses paths with a lonely woman living in the middle of nowhere.",
    "director": [
        {
            "@type": "Person",
            "name": "Reynaldo Villalobos",
            "url": "/name/nm0897794/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Drama",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcwODkxODA5NV5BMl5BanBnXkFtZTgwNDY1MjEwODE@._V1_.jpg",
    "keywords": "holed up in shack,cow,tonto apache,character name as title,surname as title",
    "name": "Conagher",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "PrairieCal"
        },
        "dateCreated": "2004-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101609/"
        },
        "name": "Perfect",
        "reviewBody": "What can you say when something's perfect?\n\nThis movie is a love song to the west and to the man who made us love it too, Louis L'Amour. They got it all RIGHT in this one ... the script, the breathtaking cinematography, the casting, the acting, the costumes, the sets, the scenery, the direction, and the overall feel of the piece. And the frosting on the cake is that the book comes alive here, respectfully and faithfully transfered to film.\n\nWe see the tough and solitary life of a cowpuncher as it was, the dirt, the sweat, the never ending dust, the loneliness, no punches pulled. It exudes values and ethics while never preaching, and it shows the courage of one woman alone with children in the west. It's a tribute, a slice of history, a love story, and a lesson in standing up for what's right. Mostly it's just plain beautiful.\n\nI think the thing that impresses me most about this movie is the casting ... not only the leads and supporting players, but the casting right down to the smallest bit part. And none of the roles are more perfectly cast than those of the children who manage to transcend time from now to then. The rest of the supporting cast reads like a Who's Who of American Westerns ... Barry Corbin, Ken Curtis, Buck Taylor, Dub Taylor ... and the newcomers here hold their own well in this distinguished bunch.\n\nI try not to watch this movie more than once a year. That's difficult for me because I miss it between viewings like I miss an old friend. And every time I rewatch it my heart yearns to return to the west. This film is easily in a class with \"Will Penny,\" and can stand proudly with any western ever made. Watch it.\n\nPS: Yeah, it's got plenty of action too.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0101609/"
}