{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joe Brown",
            "url": "/name/nm0113865/"
        },
        {
            "@type": "Person",
            "name": "Eric Clapton",
            "url": "/name/nm0002008/"
        },
        {
            "@type": "Person",
            "name": "Jools Holland",
            "url": "/name/nm0390735/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2055,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0110984/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029540/"
        }
    ],
    "datePublished": "2004-03-03",
    "description": "George Harrison's friends, family, and bandmates unite for a tribute concert on the one-year anniversary of his death.",
    "director": [
        {
            "@type": "Person",
            "name": "David Leland",
            "url": "/name/nm0500896/"
        }
    ],
    "duration": "PT2H26M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGJiNDE2MWUtMDA3MS00ZjFkLTllY2ItMzQ2YTYxNTJhNjJiXkEyXkFqcGdeQXVyMzIzNDU1NTY@._V1_.jpg",
    "keywords": "hare krishna,tribute,reference to the beatles,concert film,reunion",
    "name": "Concert for George",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "johno-21"
        },
        "dateCreated": "2006-05-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0380275/"
        },
        "name": "The love didn't sleep George",
        "reviewBody": "I saw this delightful tribute concert to the music and life of George Harrison in the theater when it first came out. This is a good film with a great soundtrack that won a Grammy Award but it only saw a limited run in art house theaters and quickly disappeared from the big screen for DVD release. If it ever comes back around on a big screen somewhere someday see it in it's theatrical glory. Excellent camera work in this film directed by David Leland who was one of the eight directors of the award winning 10 part HBO mini series Band of Brothers and as a screenwriter wrote such films as Mona Lisa. This was filmed as a special tribute concert for George Harrison at the Royal Albert Hall in London on the first year anniversary of his death. Long time inner circle Beatle musician friends led by Eric Clapton take the stage in an evening of music from the career George Harrison. Surviving Beatles Paul McCartney and Ringo Starr are here as well as musicians who recorded with the Beatles, Billy Preston and Klaus Voorman. Ravi Shankar and his daughter do a set. Harrison's Traveling Wilbury band mates Jeff Lynne and Tom Petty are here as well as long time Harrison musician pals Gary Brooker from Procol Harum and Jim Capaldi from Traffic. Jools Holland from Squeeze and touring and recording utility ax man Albert Lee are here too. Terry Gilliam, Terry Jones, Eric Idle and Michael Palin from Monty Python and Pyton players Carol Cleveland and Neil Innes are joined by actor Tom Hanks for a classic Python sketch song. Longtime Harrison friend and fellow ukulele affection ado Joe Brown closes out the show. George Harrison's son Dhani, looking like a young George Harrison plays guitar among the band on several numbers. There is one moment when Paul Mccartney looks at Dhani and you tell he notices the resemblance to his father from the Beatles days and he tries for a second to get his attention during the song so they can share a microphone like Paul and George would often do as Beatles but Dhani is concentrating so hard on his fingerboard that he doesn't quite get what Paul is implying and the song rolls on and the moment is lost. Jeff Lynne produced the concert audio. Eric Clapton is the musical director.\n\nIn his role as musical director it reminded me of when Eric Clapton married George Harrison's ex-wife Patti Boyd. At the wedding reception there was a stage set up with amps and instruments and Harrison asked Clapton who the band was. Clapton said, you are. Harrison laughed and said I am? Clapton just said, yeah, look around there are nothing but musicians here so I'm sure you can find enough to make a band out of. Harrison was hesitant but he went up to Paul Mccartney and told him what Clapton instructed him to do. McCartney put down his plate of food and said, lets do it. Harrison must have looked down from beyond at the Concert for George and smiled as to how Clapton was now in charge of putting together the musicians. I would give this a 9.0 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2093531417",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTkyNDMwYWUtYzU2Yi00Zjg3LTg1NTktOGI0MzYxNmNlMmQwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTkyNDMwYWUtYzU2Yi00Zjg3LTg1NTktOGI0MzYxNmNlMmQwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-18T13:21:01.958Z",
        "url": "https://www.imdb.com/video/vi2093531417/"
    },
    "url": "/title/tt0380275/"
}