{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tilda Swinton",
            "url": "/name/nm0842770/"
        },
        {
            "@type": "Person",
            "name": "Francesca Faridany",
            "url": "/name/nm0267432/"
        },
        {
            "@type": "Person",
            "name": "Timothy Leary",
            "url": "/name/nm0495276/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 513,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0268574/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034235/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0196972/"
        },
        {
            "@type": "Person",
            "name": "Lynn Hershman-Leeson",
            "url": "/name/nm0380961/"
        },
        {
            "@type": "Person",
            "name": "Eileen Jones",
            "url": "/name/nm0428017/"
        },
        {
            "@type": "Person",
            "name": "Sadie Plant",
            "url": "/name/nm0686622/"
        }
    ],
    "datePublished": "1999-02-19",
    "description": "Emmy Coer, a computer genius, devises a method of communicating with the past by tapping into undying information waves. She manages to reach the world of Ada Lovelace, founder of the idea of a computer language and proponent of t...",
    "director": [
        {
            "@type": "Person",
            "name": "Lynn Hershman-Leeson",
            "url": "/name/nm0380961/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Drama",
        "Fantasy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjI4NzQzMDM2NV5BMl5BanBnXkFtZTcwOTE5OTQyMQ@@._V1_.jpg",
    "keywords": "candlelit bath,crying,implanted memory,scene during opening credits,timeframe 19th century",
    "name": "Conceiving Ada",
    "original_info": {
        "id": "Conceiving Ada_1997",
        "name": "Conceiving Ada",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Foopy-2"
        },
        "dateCreated": "2000-07-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118882/"
        },
        "name": "Interesting and novel, yet flawed",
        "reviewBody": "The approach this film takes to storytelling is interesting, but somewhat confusing. I've never seen a cross between a science fiction film and a period film set in the Victorian era, so this was a refreshing change of pace; but many aspects of it were not handled well.\n\nThe way that a person in the present can communicate with someone in the past isn't outlined very well, although I've only seen this movie once and maybe I need to see it again. Communicating with someone in the past has something to do with something called \"DNA memory\" which I don't quite understand. I consider myself to be fairly well-informed about the general concepts of computer science but the way that Emmy explained her interfacing with individuals and memories from the past seemed quite cryptic and unintuitive... I don't really mind the fact that this isn't explained well--plenty of unexplained, far-fetched science fiction premises can still yield a viewer's suspension of disbelief--but the contact between present and past seems to be taken in stride rather than as something utterly magnificent. If I suddenly found out how to talk to my favorite historical figure and see his or her memories on a screen, I would be quite a bit more excited than Emmy, her husband, or her strange mentor. This is one of the film's biggest incongruencies, and it destroyed my suspension of disbelief.\n\nAlthough I do appreciate the fact that the director attempted to integrate the digital technology (the uses of which Ada Byron predicted) into the film, it didn't seem to work that well at all. The backgrounds looked very two-dimensional (partially because no characters ever travelled much within a shot, and very little tracking and panning was done to give the environment a three dimensional feel, though such camera movements must be nearly impossible when the digital environments are two-dimensional to begin with). The fire effect in particular looked incredibly fake as the rest of the digital environment didn't respond properly to the flickering of the flames, so altogether the cinematography in the Victorian era was horrendous and reminded me of something from old CD-ROM adventure games like Phantasmagoria or Gabriel Knight II.\n\nThe portrayal of Ada's character was very well-done, however, effectively displaying both Ada's desires and modern ideas as well as her imprisonment by social standards and the people around her. In particular, her final speech near the end of the film is very well done.\n\nOne of my complaints about the film, however, is that none of the male characters really seem to be fleshed out at all; they're all very two-dimensional, without too much depth or personality, which really makes the film seem very gender biased.\n\nAlthough I did enjoy the film overall and I thought the blend of science fiction and period filmmaking was a novel idea, I really think that this could've been a much better experience if the science fiction premise had been dropped entirely and the movie had just been a period film. I actually like science fiction very much and I'm generally not interested in period films dealing with repression and social mores, but Ada's character is particularly interesting because her interests are so modern--they have so much application to today's world and today's ideas.\n\nI think that by adding the sci-fi premise to the film weakened it overall; with the ubiquitousness of the Internet, today's audiences generally know the ways in which computers can be used and this film's hasty, fleeting vision of someone in the present communicating with someone in the past only adds confusion to the film, not a sense of wonder about Ada's conceptions and the potential of virtual reality and artificial intelligence. I rather would've spent more time learning about the different kinds of ideas that Ada had from her point of view. As it is, the film spends so much time divided between the present world and Ada's world that it doesn't really have enough time to fully develop either of them."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Microcinema",
        "duration": "PT2M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3893036825",
        "name": "Conceiving Ada",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2UwNDQzNDEtYzBlNi00NGVhLWJmOGYtYWIyZDMyYjFiOWZlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2UwNDQzNDEtYzBlNi00NGVhLWJmOGYtYWIyZDMyYjFiOWZlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:02:44Z",
        "url": "https://www.imdb.com/video/vi3893036825/"
    },
    "url": "/title/tt0118882/"
}