{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Seung-beom Ryu",
            "url": "/name/nm0753486/"
        },
        {
            "@type": "Person",
            "name": "Kong Hyo-Jin",
            "url": "/name/nm1045839/"
        },
        {
            "@type": "Person",
            "name": "Eun-kyeong Lim",
            "url": "/name/nm1213381/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 462,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Conduct Zero",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0107051/"
        },
        {
            "@type": "Person",
            "name": "Lee Ji-Hyung",
            "url": "/name/nm9551644/"
        },
        {
            "@type": "Person",
            "name": "Jin-wan Jeong",
            "url": "/name/nm0421820/"
        },
        {
            "@type": "Person",
            "name": "Lee Hae-jun",
            "url": "/name/nm1409622/"
        }
    ],
    "datePublished": "2004-08-10",
    "description": "Joon-pil is the toughest guy in school, but also a idiot. So when the innocent, yet delightfully feisty, Min-he throws him a hormonal curve-ball, he is ill-prepared to face life's nastiest test question of all - For love or lunch ...",
    "director": [
        {
            "@type": "Person",
            "name": "Geun-shik Jo",
            "url": "/name/nm1279817/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWZmMmUwODctNmVlNy00YTk1LTkzMTQtZmZjMTJiOTMwOWUzXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "korean,south korea,crush on girl,hairdresser,korean girl",
    "name": "Poom-haeong-je-ro",
    "original_info": {
        "id": "Conduct Zero_2002",
        "name": "Conduct Zero",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "refresh_daemon"
        },
        "dateCreated": "2008-11-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0341535/"
        },
        "name": "Surprisingly entertaining Corean high school period comedy.",
        "reviewBody": "Conduct Zero is a Corean high school period comedy. When you stick \"high school\" with \"Corean\" and focus on boys, you're very likely going to see a lot of violence, due to the rather violent masculine culture prevalent in Corean boys' high schools in the past. It's important to understand this, as the social hierarchy in Corean boys' high schools in the past was largely built around fighting prowess, with the best fighter being a sort of \"king\" at the high school. In Conduct Zero, Joong Pil is the king of his high school. He's also vain, slovenly and perhaps a bit stupid, played to excellence by Ryu Seung Wan. Fortunately, rather than being all fighting and drama like the 70's set Once Upon a Time in High School, Conduct Zero is a comedy and a surprisingly entertaining one.\n\nAs king of his school, Joong Pil spends much of his time bullying the other students (more annoyingly then maliciously) and extorting money out of them via his and his buddy's \"porn drawings\" business. The plot begins as Joong Pil encounters the nerdy, but confident, good girl Choi Min Hee and finds himself instantly smitten. Of course, the local tough guy falling for a nice girl only leads to trouble amongst the wolf pack that is high school.\n\nOne thing that Conduct Zero does surprisingly well is balance its comedy and drama elements. The comedy veers from totally wacky (especially in the hyperbolic storytelling of the badassery of Joong Pil and, later, his rival) to amusing character-based comedy, primarily centered on Joong Pil's shenanigans and awkward attempts of courtship. The more dramatic elements appear more towards the climax and while the tone is different, the transition is quite smooth. The rest of the well paced running time is filled with enjoyable side characters. In addition to Joong Pil's scheming buddy, the cast includes rather good-natured by guileless nerd as well as the infatuated \"queen\" of the girl's school and her posse.\n\nThe story moves well from one point to the next, thanks to a good script. The period elements, setting in 1980's Corea aren't obtrusive, but they add a certain charm to the film and the art, sets and costumes are solid. The acting is very good and the direction manages to keep its focus well, appropriately and almost invisibly shifting mood and tone to fit the comic or dramatic aspects of the plot. Not every joke works well, though, and there is some culturally specific comedy involved (including a very amusing music reference to the popular animation \"Robot Taekwon V\"). Speaking of which, the soundtrack is a blend of period music and a surprisingly catchy sampling of 90's era Corean hip-pop. It was largely successful although the score wasn't as memorable.\n\nAll in all, Conduct Zero is actually an excellent teen/high school comedy and while it's rougher and dirtier than the average American entry into the genre, its charms are notable and flaws are limited enough to make watching it a surprising treat. Conduct Zero is by no means an end all and be all to the high school comedy, but it's a rather solid entry that deserves to be seen. 8/10.\n\nDVD Note: I watched the US release, distributed by ADV Films, which primarily does anime releases (as you can tell by the long advertisement when you pop in the DVD). The video transfer is fine, but the dubbing, like much of the dubbing by companies in this business is not exactly inspiring. Unfortunately, the Corean language soundtrack only gets a Dolby 2.0 mix, instead of the 5.1 and DTS mixes that are available in its native DVD release. I recommend steering away from the wooden (and poorly mixed) dubbed track and watching it in its original Corean with subtitles.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0341535/"
}