{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brigitte Bardot",
            "url": "/name/nm0000003/"
        },
        {
            "@type": "Person",
            "name": "Jack Palance",
            "url": "/name/nm0001588/"
        },
        {
            "@type": "Person",
            "name": "Michel Piccoli",
            "url": "/name/nm0681566/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33471,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Contempt",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025521/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008438/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037641/"
        },
        {
            "@type": "Person",
            "name": "Alberto Moravia",
            "url": "/name/nm0603179/"
        },
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        }
    ],
    "datePublished": "1964-12-18",
    "description": "Screenwriter Paul Javal's marriage to his wife Camille disintegrates during movie production as she spends time with the producer. Layered conflicts between art and business ensue.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGNhNjYxYmUtMGI5Zi00N2MxLTkzYTctYjEyNWQ1YTk4MTc0XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "capri italy,screenwriter,film producer,filmmaking,female nudity",
    "name": "Le mépris",
    "original_info": {
        "id": "Contempt_1963",
        "name": "Contempt",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Lechuguilla"
        },
        "dateCreated": "2009-06-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057345/"
        },
        "name": "Deeply Thematic",
        "reviewBody": "French New Wave Director Jean-Luc Godard's apparent intent here is to portray film-making as a grubby, degrading commercial enterprise that taints everything it touches. Given this contemptuous premise, film producers are pimps; film directors are prostitutes. Thus, film-making is essentially artistic prostitution.\n\nThat's the major theme among a maze of interlocking themes, most of which are so subtle that trying to figure them out requires multiple viewings and/or college coursework.\n\nThe plot is undeniably slow. There are many single-shot sequences, and the entire film contains only about 150 shots. The result is that scenes are very lengthy. Further, the story is amazing in its almost total absence of melodrama. The result of slow pace and lack of melodrama, for many viewers, is abject boredom.\n\nBut I think that effect was intentional. My impression is that Godard expects viewers to work, to be part of the film process. In one scene Fritz Lang, the director character, says \"One must suffer\", in the context of film-making, of which the viewer is included.\n\n\"Contempt\" has only five main characters. Prokosch (Jack Palance) is the archetype Hollywood producer: crass, stupid, money hungry, uninterested in culture or poetry. He's domineering and dictatorial. In one scene, he mutters: \"When I hear the word culture, I grab my checkbook\". Fritz Lang, as the film's moral center, counters by saying that in Nazi Germany, the word \"checkbook\" equated to \"revolver\", a veiled reference to an edict of Joseph Goebbels, Nazi propaganda czar under Hitler. Equating a Hollywood film producer (Prokosch) to Goebbels is about as contemptuous as one can be toward Hollywood.\n\nBut the plot in \"Contempt\" also features a writer named Paul (Michel Piccoli) and his pouty, sultry, rarely smiling wife, Camille (Brigitte Bardot). Prokosch wants Paul to write the script for \"The Odyssey\", the film within \"Contempt\". \"The Odyssey\" is supposed to be a story about ancient Greek gods. And the main characters in \"Contempt\" mirror to some extent the characters in \"The Odyssey\".\n\nThe plot of \"Contempt\" is segmented into three main parts. The first and third parts focus explicitly on film production, relative to \"The Odyssey\". The middle section focuses on the discordant relationship between Paul and Camille. Here, most of the plot takes place inside their apartment. The critique of film-making continues, but in a more subtle form, via \"mis en scene\" staging and framing. And it's presented almost in real time, the effect of which is to amplify boredom for viewers.\n\n\"Contempt\" is shot in color and in French Cinema-Scope. I did not care for the widescreen projection. Godard uses lots of point-of-view shots. And the entire film is saturated with tracking shots. The use of camera filters symbolizes technical devices that \"filter\" reality, the implication being that films can never be like real life. Red, white, and blue are the film's main colors, a cinematographic reference to American film-making. Outdoor scenes, especially on the Mediterranean, are beautiful. Georges Delerue's haunting score sets the tone for the whole film, and can be described as tragic, mournful, and majestic, in keeping with epic Greek tragedy.\n\nActing is acceptable, if unremarkable. Jack Palance, however, is not terribly convincing as a corporate suit. The film's budget was roughly 5 million-franc. And interestingly, almost half of that went to pay the salary of actress Brigitte Bardot, whose presence in this film reeks of personal vanity.\n\nClearly lacking in entertainment value, the story in \"Contempt\" will be a pain for many viewers, as it was for me. However, the beautiful score and the gorgeous scenery at Capri help offset the film's script. Taken as a whole this film is important, historically. And what I most admire is that its thematic contempt for Hollywood film-making was courageous in 1963. Unfortunately, that theme is still valid, 46 years later.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Contempt: 50th Anniversary Restoration",
        "duration": "PT2M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3206330393",
        "name": "Contempt: 50th Anniversary Restoration",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWUzMDZkY2UtZDY4Yy00ZTdkLWJlZmEtYmY4MWVmZjY1OWQwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWUzMDZkY2UtZDY4Yy00ZTdkLWJlZmEtYmY4MWVmZjY1OWQwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2018-03-21T17:22:12Z",
        "url": "https://www.imdb.com/video/vi3206330393/"
    },
    "url": "/title/tt0057345/"
}