{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Mendelsohn",
            "url": "/name/nm0578853/"
        },
        {
            "@type": "Person",
            "name": "Barry Otto",
            "url": "/name/nm0653222/"
        },
        {
            "@type": "Person",
            "name": "Toni Collette",
            "url": "/name/nm0001057/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2154,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021638/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Louis Nowra",
            "url": "/name/nm0637491/"
        }
    ],
    "datePublished": "1997-04-11",
    "description": "Lewis is a young Sydney amateur theater director at his first experience: he is offered a job with a Governmental program for the rehabilitation of mentally ill patients in a Sydney institution for mentally ill. His project is ove...",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Joffe",
            "url": "/name/nm0423623/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTdhZDAzMDctNmU1MS00NzAzLTk4ZTYtNjc3ZGYwNDM2YzMwXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "electrician,storytelling,stutter,drug rehabilitation,drug",
    "name": "Cosi",
    "original_info": {
        "id": "Cosi_1996",
        "name": "Cosi",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "isabelle1955"
        },
        "dateCreated": "2006-02-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115951/"
        },
        "name": "Entertaining diversion",
        "reviewBody": "I caught up with this movie ten years late because I'm working my way slowly through the seminal works of David Wenham, but I'm sorry I didn't catch it sooner, as it's a very entertaining means of whiling away a couple of hours when you have the 'flu (as I did when I watched it). Quite cheered me up. Australian films often seem to be able to do that, offering as they do a slightly skewed and non-PC perspective on life. California sunshine with a British sense of humour? Sounds like paradise to me.\n\nThe story is, of course, quite ridiculous, but the performances from a good ensemble cast are so engaging that the unlikely plot can be excused, especially if you have taken enough 'flu meds to knock out a cart-horse. Lewis  rather blandly played perhaps by Ben Mendlesohn  is drifting between jobs and college and obviously irritating his highly focused and perky girlfriend, Lucy (gorgeous, leggy, Rachel Griffiths) He accepts a job at the local psychiatric hospital to provide drama therapy to a group of inmates, led by opera fan Roy (the marvelous Barry Otto). Now what the hospital authorities and Lewis are envisioning is an unambitious variety show. But what Roy has in mind is no less than a production of Mozart's Cosi Fan Tutte, and he's nothing if not determined. No one can sing a note or speak Italian, but by a combination of bravado and insult, Roy talks Lewis into it and the patients start auditioning. Badly. Really badly.\n\nFor those of you not familiar with Cosi Fan Tutte, basically it's Mozart's take on the perceived perverseness of the female character (it translates as \"It's like that\" or \"Woman are like that\" or something similar. You get the idea?) and it explores the idea that when let off the leash of fidelity by the absence of their lovers, women are straight after the nearest thing in trousers like a rat up the proverbial drainpipe. Alongside the main story of Mozart's opera, and the inmates' \"let's put the show on in the barn\" attitude, there runs a sub plot of whether or not Lucy can be faithful to Lewis, which is not terribly subtle, and given that the temptation on offer is the total plonker Nick (Aden Young - don't take it personally Aden), the outcome is not a complete surprise.\n\nThe movie explores the themes you might expect from a film centered around a psychiatric institution; are the inmates any madder than the people outside, how do we deal with people who don't fit into our neat patterns of what is and isn't normal, how much liberty can you allow people who might be a danger too themselves as well as to others etc ? But the reason to watch this movie is to see the characterization of the patients. I'm not going to get into the ethics of whether it's moral to use psychiatric patients as fodder for humour in a movie, let's just accept that it is, and take it from there. Pamela Rabe is utterly moving as depressive Ruth, Jacki Weaver is wonderful as Cherry, a very anorexic and yobbish looking David Wenham is priceless as the pyromaniac cat burner Doug, and Paul Chubb grabbed my attention as mild mannered Henry. But the total stand out for my money was Toni Collette. I had no idea she could sing like that! She gives a marvelous performance as Julie, who is almost, but not quite, ready to leave the institution and face life and its temptations outside. Every performance I see of Toni Collette just reinforces how wonderful she is. I thoroughly enjoyed this movie. Not great, but well worth a couple of hours of anyone's time. Especially if you have 'flu."
    },
    "url": "/title/tt0115951/"
}