{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Morgan Freeman",
            "url": "/name/nm0000151/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 750,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0130406/"
        },
        {
            "@type": "Person",
            "name": "Bayley Silleck",
            "url": "/name/nm0798078/"
        },
        {
            "@type": "Person",
            "name": "Michael Miner",
            "url": "/name/nm0591160/"
        },
        {
            "@type": "Person",
            "name": "Kees Boeke",
            "url": "/name/nm0091244/"
        }
    ],
    "datePublished": "1996-08-09",
    "description": "Where do we fit in with the universe? This film seeks to explore our place among the ever-expanding universe.",
    "director": [
        {
            "@type": "Person",
            "name": "Bayley Silleck",
            "url": "/name/nm0798078/"
        }
    ],
    "duration": "PT36M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc3MDg1OTM4Ml5BMl5BanBnXkFtZTcwMjE5MTkxMQ@@._V1_.jpg",
    "keywords": "outer space,venice italy,microscopic,illusion,educational",
    "name": "Cosmic Voyage",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2003-01-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115952/"
        },
        "name": "Superb, educational IMAX film on DVD.",
        "reviewBody": "The IMAX \"Cosmic Voyage\" film was made as a public service with sponsorship by the Smithsonian Air and Space museum. On DVD, borrowed from my local public library, it plays at just over 30 minutes with Morgan Freeman supplying a pleasing narrative. As one would expect from an IMAX film, the image quality is superb and the Dolby 5.1 sound track is very well done. Simulated cosmic explosions shake your walls! That is, if you have a good powered subwoofer in your system.\n\nThe film takes a very useful approach to examining the size of the universe, from tiny sub-atomic particles to the vastness of the whole universe. (Fortunately, when God created the Universe he had dispatched a few angels with video cameras at different vantage points so we get to see actual footage from several billion years ago.) The film starts in Venice, where the discovery of the telescope originated, and uses a one-meter hoop as a reference point, then gradually goes larger by powers of 10, e.g. 10 meters, 100, 1000, etc until we can see the whole universe. Then it takes the opposite journey, going smaller by powers of 10 until be see inside sub-atomic particles.\n\nThe story is well-woven with beautiful effects created especially for this film. It is entertaining and educational at the same time. All of \"oldsters\" can enjoy it for the scientific history we are already familiar with, and all the \"youngsters\" can enjoy it for the educational supplement it provides. Overall a masterful film.\n\nAny numerical \"rating\" of \"Cosmic Voyage\" is meaningless. If one is looking for a superb film about our universe and modern theories of its formation, this one is hard to beat. Kudos to IMAX and to the Air and Space Museum."
    },
    "url": "/title/tt0115952/"
}