{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rita Hayworth",
            "url": "/name/nm0000028/"
        },
        {
            "@type": "Person",
            "name": "Gene Kelly",
            "url": "/name/nm0000037/"
        },
        {
            "@type": "Person",
            "name": "Lee Bowman",
            "url": "/name/nm0101350/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5672,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Virginia Van Upp",
            "url": "/name/nm0888144/"
        },
        {
            "@type": "Person",
            "name": "Marion Parsonnet",
            "url": "/name/nm0663763/"
        },
        {
            "@type": "Person",
            "name": "Paul Gangelin",
            "url": "/name/nm0304321/"
        }
    ],
    "datePublished": "1944-04-06",
    "description": "Rusty Parker wins a contest and becomes a celebrated cover girl; this endangers her romance with dancing mentor Danny.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Vidor",
            "url": "/name/nm0896533/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Comedy",
        "Music",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGFjMTUzN2MtZWIwMC00ZTk5LThkMDktNzU2NDNmYjdmNzhlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDQzMDg4Nzk@._V1_.jpg",
    "keywords": "stage show,alter ego,fashion magazine,pearl in an oyster,dancer",
    "name": "Cover Girl",
    "original_info": {
        "id": "Cover Girl_1944",
        "name": "Cover Girl",
        "year": "1944"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secondtake"
        },
        "dateCreated": "2011-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0036723/"
        },
        "name": "Ignore the cheesy first dance--this one is vivid and classic in many ways",
        "reviewBody": "Cover Girl (1944)\n\nThe war is on, and this musical covered two fronts--escapist entertainment, and good old leggy girls for the guys in uniform (those who got to see it). Betty Grable may have been the unofficial pin up actress in wartime, but Rita Hayworth was one of the real hotties of the 1940s, and another G.I. staple, and she is the visible star of this very colorful musical.\n\nThe other star, secondary except in name, is Gene Kelly, who is actually a relief in his scenes, adding some stability to a sometimes frivolous and girly musical. Hayworth is great as a presence, too, for sure, and she does do her own dancing, but her singing voice is dubbed by another vocalist. Third in importance is Eve Arden (for me) playing her usual world-weary wit, in this case in the center of the cover girl search. \n\nAn interesting if minor trick to the plot early on is the way they create two plots in two time periods, the present (1944) and forty years earlier. So the musical numbers (and lavish costumes) vary from one period to the other, with Hayworth providing the link. Most of the time, thought, it's the early 1940s with the usual competing romances, and a striving for glory takes off. This was Hayworth's biggest success to date, and she was married to Orson Welles at the time. The movie was a hit, both with audiences and with critics. It even won an Oscar (for the music).\n\nHow does it compare to other musicals? Well, for one thing it has totally vivid color, I mean vivid, true three-strip Technicolor (the ultimate), and it helps. The dance numbers are on obvious sets, carefully and beautifully designed. Kelly was instrumental in making the dance numbers work, even dominating the director (Charles Vidor) on this score. You might even see hints of his later more famous musicals (a street scene has echoes of \"Singing in the Rain\" in set design, without the rain--a cop even ends the scene in both cases). The dancing is something of an evolution from the 1930s Astaire-Rogers dancing which was heavily tap and ballroom kinds of couple numbers. Here we see more choreographed integration with the plot and the scenes. \n\nThe story, as the title suggests, has a great theme. Rita's character, Rusty Parker (she has reddish hair, which is common in these Technicolor affairs) is trying to be a cover girl for a magazine contest. Of course, so is everyone else in the country. And they bring it to an amazing climax by presenting \"covers\" designed for all the major magazines, the real thing from Cosmopolitan to Look. The actual magazines around the country got on board with the movie while it was being made and had their own contests for their covers. One dance number features each of the winning covers, seen through a giant camera lens, and each of the winning girls--so the cover models got a small dose of Hollywood stardom, too. It's fun, and clever, and it sold the film big time.\n\nThere is an odd mistake in the movie--when the original Variety cover with Rusty Parker on it is pinned up by her dance friends and rivals, it shows a picture of her looking at the camera. When the camera pulls back for a wider view, it shows a different cover! Parker is looking to one side. Pretty ridiculous boo-boo.\n\nI can't over emphasize how much the production values of the film support it. The color, the photography, the set design, and the editing are all really fabulous. There are two photographers listed, and one is Rudolph Mate who has a number of great Hollywood films to his name (as well as a true legend, the German/Danish \"Vampyr\" from 1932). Technicolor consultant Natalie Kalmus is in top form (she insisted on certain colors and color pairings that worked best with the film stock).\n\n Kelly was loaned from MGM (to Columbia) for the movie, and he was given liberties in production, making his career jump two notches. The choreography is his, and MGM began to pay attention to him at this point. The great number where he plays against his ghost on the streets is inventive and fun. The production is high here, with true Technicolor, but it lacks the high standards of MGM (see \"Singin' in the Rain\" for some better echoes). There are lots Broadway based visuals, with sets and contrivances. It only goes so far, and it's so infected by the \"cover girl\" mentality it drives any normal person not to boredom but to disappointment. I know if I say it's sexist many people think I'm just not getting it, or I'm applying a 21st Century filter to a normal situation back then. But it's an objectifying movie with all the worst stereotyping clichés you can write into a script. And the fact remains that neither Kelly nor Hayworth are what you would call great actors. Likable (and pretty) but limited in their range. It's a musical, yes, and it gets around to real music eventually, and it's no less than Kern and Gershwin. The great song is a quiet number between them, Long Ago and Far Away. Some of the other songs are formula stuff, and you have to hang in there. In fact, you start to realize you are being patient a lot, waiting for the movie to rise up.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Cover Girl",
        "duration": "PT2M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2027928089",
        "name": "Cover Girl",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTk0NGIzNmMtODFhYy00NWNjLTgwMTAtYTUwZGIxZWVmNDhjXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTk0NGIzNmMtODFhYy00NWNjLTgwMTAtYTUwZGIxZWVmNDhjXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-12-05T17:08:44.399Z",
        "url": "https://www.imdb.com/video/vi2027928089/"
    },
    "url": "/title/tt0036723/"
}