{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dani Filth",
            "url": "/name/nm1029417/"
        },
        {
            "@type": "Person",
            "name": "Emily Booth",
            "url": "/name/nm0095696/"
        },
        {
            "@type": "Person",
            "name": "Stuart Laing",
            "url": "/name/nm0481931/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3603,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104318/"
        },
        {
            "@type": "Person",
            "name": "Alex Chandon",
            "url": "/name/nm0151492/"
        }
    ],
    "datePublished": "2001-07-04",
    "description": "A gruesome homage to the cult Amicus anthology Asylum, Cradle of Fear unfolds four screamplays all linked by the unspeakable need of an incarcerated child killer to wreak vengeance on those responsible for his imprisonment. Helped...",
    "director": [
        {
            "@type": "Person",
            "name": "Alex Chandon",
            "url": "/name/nm0151492/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc1NjY5NjI3N15BMl5BanBnXkFtZTcwOTEyMDkxMQ@@._V1_.jpg",
    "keywords": "exploitation,splatter,slasher,supernatural horror,supernatural serial killer",
    "name": "Cradle of Fear",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Wyrmm"
        },
        "dateCreated": "2005-03-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0291833/"
        },
        "name": "What a way to go...",
        "reviewBody": "Having been a fan of the band Cradle of Filth for many years, I was inclined to watch this movie. Alex Chandon had previously done a video for the band (From the Cradle to Enslave) which is one of the most visually original music videos of all time. With this background information out of the way, here is a checklist to see if you will like this movie. 1. Can you tolerate bad special effects? The effects in this movie are about one step above crappy because it had a limited budget. It does take some work to get past the poor effects and get into the story, but it can be done. 2. Do you have ADD? One thing I did enjoy about the movie was that it weaves together 4 story lines which really helps to keep your focus during the movie. It's far from stagnant. 3. Are you offended by anything? Anything at all? If so, you will hate this movie and possibly feed the need to speak to a pastor after viewing it. The effects, as previously stated are poor, but the material the movie deals with is very intense and often satanic with references to Crowley. If you answered yes to 1 and 2 and no to number 3, you will probably enjoy this movie. In my opinion, it's worth at least one watch if you enjoy horror movies. One last time though, the special effects are weak and this movie is not for the faint of heart.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0291833/"
}