{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Beach",
            "url": "/name/nm0004729/"
        },
        {
            "@type": "Person",
            "name": "Ronny Cox",
            "url": "/name/nm0001074/"
        },
        {
            "@type": "Person",
            "name": "Sinbad",
            "url": "/name/nm0005435/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1088,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036474/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065022/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Leven",
            "url": "/name/nm0505230/"
        },
        {
            "@type": "Person",
            "name": "Erik Jendresen",
            "url": "/name/nm0420701/"
        }
    ],
    "datePublished": "2002-02-06",
    "description": "Psychiatrist Ty Adams doesn't believe in using drugs, but the head of Sedah State Hospital does, then 'Satan' arrives ~ walk-in patient extraordinaire... From there it's a full-on freaky ride.",
    "director": [
        {
            "@type": "Person",
            "name": "Eriq La Salle",
            "url": "/name/nm0005113/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwNTMzMzk5MV5BMl5BanBnXkFtZTYwMzk0Njk2._V1_.jpg",
    "keywords": "female nudity,female topless nudity,female rear nudity,psychiatrist,video surveillance",
    "name": "Crazy as Hell",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol-kay"
        },
        "dateCreated": "2005-02-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0285487/"
        },
        "name": "Crazy Man.. Crazy!",
        "reviewBody": "***SPOILERS*** Early in \"Crazy as Hell\" the head nurse of the Sedah State Mental Hospital where the movie takes place Nurse Danza, Jane Carr, is asked by the head doctor there Dr. Ty Adams, Michael Beach, what she would ask \"The Devil\" if she ever had the chance to talk to him. Nurse Danza said the following statement that was absolutely stunning: \"I'd ask him why he spends his time punishing those that he's supposed to adore to make a point to a God that he's supposed to despise?\". The same statement, word for word, is later said by non other the \"The Man\" or \"The Devil\" himself to Dr. Adams. This started to make me feel that I wasn't watching some light comedy, about \"The Devil\", but a very serious and penetrating movie about a subject that has been on the minds of great thinkers since the dawn of recored history.\n\n\"Crazy as Hell\" comes full-circle when it reaches it's climax. By that time I wasn't at all disappointed in what I saw in the film. Even though at first I didn't at all expect to see it when the movie started. Dr. Adams is invited to be the head psychiatrist, where there's to be made a documentary on his work on curing mental illness, at the Sedah State Mental Hospitle for a month. This is to use his ground breaking theories of curing those that are mentally ill without the use of mind-altering drugs or strong medication, like shock treatment.\n\nAt first Dr. Adams' methods work as he seems to cure one of the most psychotic patients at the hospital Cheryl, Tracy Pettit,from her self-destructive actions with out the use of drugs, which up to that time had little effect on her. As Dr. Adams starts to settle down and get into the swing of things in the hospital all of a sudden a person appears there as a new patient calling himself \"The Man\" or what he's better known as to us \"The Devil\" Eriq La Salle. From then on it's all down hill for the good doctor. \n\nDr. Adams is told by \"The Devil\" that he's really upset because of all the bad press that he's been receiving over the last thousands of years. He wants to set the record straight about himself and wants Dr. Adams to help him in that endeavor. At first Dr. Adams thinks that \"The Man\" is just a harmless eccentric. Later he sees that he knows a lot more about his past and background that he'll willing to talk about with \"The Man\" or anyone else.\n\n\"The Man\" gets so under Dr.Adams skin that one afternoon at a picnic in the park with the other patients he loses it and almost comes to blows with him. Slowly Dr. Adams starts to lose his grip on reality to the point where he talks to his both deceased wife and daughter Veda & Brianna,Shelly Robertson & Khylan Jones. This strange conversation by Dr. Adams is picked up on video tape and, after seeing it, makes the administrator of the hospital Dr. Delazo, Ronny Cox, think that Dr. Adams needs to be treated for mental and psychological trauma himself.\n\nFeeling very hostile toward his patient, which is very unprofessional for a doctor, Dr. Adams now drops his non-orthodox methods in regard to \"The Man\" and has him put on strong drugs and put in a padded cell and in a straight-jacker for 24 hours. Unknown to him \"the Man\" has a big surprise for Dr.Adams. When it finally comes it's going to shock him back to where the movie started when his troubles with \"The Man\" was just beginning.\n\nDifferent yet vastly superior movie about \"The Devil\" and how he operates here on earth and in his underground kingdom. Michael Beach is very sympathetic in his role as the troubled Dr.Adams who's sparring with \"The Devil\" during the movie brings the best out of \"The Devil\" and the worst out of him which was \"The Devil's\" plan all along. The end of the movie was both sad and shocking when we, as well as Dr. Adams, see the \"Grand Plan\" that \"The Devil\" set into motion for Dr. Adams. It reveled the most darkest secrets that Dr. Adams was hiding from himself, and everyone else, that he kept hidden deep in his sad and troubled soul.\n\nEriq La Salle was both fascinating and scary as the sharp and witty Devil and played his part as the \"Man from Hell\" to the hilt. The scene at the picnic with the confrontation between \"The Man\" and Dr. Adams showed for the first time the other side of the coin of Dr. Adams cool clam and collective personality. As he lost his cool and ended up as crazy, if not more so, then the patients that he was treating.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from DEJ",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2747203865",
        "name": "Crazy as Hell",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjYzMzQ4ZDQtZWNmYS00MDY5LTljNTUtMzAxNTQyZmM2NTYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjYzMzQ4ZDQtZWNmYS00MDY5LTljNTUtMzAxNTQyZmM2NTYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:36:56Z",
        "url": "https://www.imdb.com/video/vi2747203865/"
    },
    "url": "/title/tt0285487/"
}