{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ginger Baker",
            "url": "/name/nm0048486/"
        },
        {
            "@type": "Person",
            "name": "Jack Bruce",
            "url": "/name/nm0115499/"
        },
        {
            "@type": "Person",
            "name": "Eric Clapton",
            "url": "/name/nm0002008/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 43,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "datePublished": "1991-09-17",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Justman",
            "url": "/name/nm0433225/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Music"
    ],
    "name": "Cream: Strange Brew",
    "original_info": {
        "id": "Cream: Strange Brew_1991",
        "name": "Cream: Strange Brew",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2005-08-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0449887/"
        },
        "name": "could've been a lot better, still has a lot to value",
        "reviewBody": "This one hour documentary/live concert about the legendary rock trio, Cream (one of my favorites of the era) gives some good interviews with the three- Eric Clapton (guitar), Jack Bruce (bass), and Ginger Baker (drums)- as well as some live footage from 1968. The interviews themselves are informative for history reasons (one learns about what they did before they joined together in 66), as well as learning about how they rose to success and how their music works together. What is slightly disappointing is the quality of the film-making in the performances. One need not ask for too much when it comes to filming a band, especially of the likes of Cream, just to get it down simply and professionally. I sometimes like or at least admire the avant garde styling of the technical side (like with Gimme Shelter or Year of the Horse, or even some of the live footage of Hendrix), but it does get in the way when there is good stuff to hear and see. This is a document of its time, and as such it's filmed with a crazy hippie style, and it does detract from totally enjoying the \"golden oldies\" of the time (it doesn't help either that the sound is a little off for a live performance, and the video quality is not in a remastered state if can find and watch this on DVD). Criticisms aside, the performances aren't totally compromised, and the power and practical bravery behind songs like 'Crossroads', 'Spoonful', 'I'm So Glad', and 'Toad' still manages to come through fine- and for the fans it will be of infinite value to see Clapton and Baker in their prime. Also, this is far better when compared to the shoddy 'Cream's Farwell Concert' concert video...one other plus: there is an (all too brief) clip of Hendrix playing Sunshine of Your Love.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0449887/"
}