{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Filberto Ascencio",
            "url": "/name/nm0038456/"
        },
        {
            "@type": "Person",
            "name": "Butch Dean",
            "url": "/name/nm1563325/"
        },
        {
            "@type": "Person",
            "name": "Dusty Dean",
            "url": "/name/nm1564083/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 108,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "datePublished": "1999-06-03",
    "description": "Kyle Dean was a misfit in her North Carolina school. She was called \"Creature\" because she was a boy who knew she was a girl in part of the country where such things were not understood or tolerated. As soon as she could she left ...",
    "director": [
        {
            "@type": "Person",
            "name": "Parris Patton",
            "url": "/name/nm0666610/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzA3ZTcwM2YtMzQxNS00MDM5LWI0ZmYtOWVmOTA2NjQ0ZTI1XkEyXkFqcGdeQXVyMTM5NTU2MzE1._V1_.jpg",
    "keywords": "transgender,transgender woman,independent film",
    "name": "Creature",
    "original_info": {
        "id": "Creature_1999",
        "name": "Creature",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ashleystus"
        },
        "dateCreated": "2005-12-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0198385/"
        },
        "name": "Amazing transformation!",
        "reviewBody": "This documentary tracks Kyle Dean in his amazing transformation from male to female, although we don't get much of the specifics of her transition, like HRT regimen and if and when she had a sex change. The transition seems to take about 4 years from the time he started hormones at age 23 (he started at 18 as a cross dresser at Arena in LA), although we see \"Stacy\" being passable around 6 months into HRT. Simply amazing! The progesterone I couldn't find information on, so I'm guessing it came from Mexico (Tijuana), a common source of hormones for young girls in the Southern California area, which is where I transitioned. But nowadays, people get their hormones over the net, so this probably isn't the case anymore.\n\nFor someone in their teens or 20's, and wanting to see what hormones can do, I recommend this film. For the transitioning, I felt this was a great motivation. Particularly the voice, where we see Kyle already getting it down prior to starting HRT. \n\nThe time line I compiled from watching this film numerous times is:\n\nStacy \"Hollywood\" Dean DOB: July'71\n\n· 1989: First time dressing up; away from home in LA; started at Arena with Barbarella; started developing voice · Dec 1994 Start of Documentary; Stacy has been working at Arena for 5 years as well as prostitution · Jun 1995 Start of Hormones · Dec 1995 Boobs; tennis outfit on couch · Dec 1996 No more Kyle; Bathroom door crack; dog on bed · Dec 1997 7-Eleven; going home · Dec 1999 Boob enhancement; Pose on bed; Dominatrix · Jun 2000 Register for classes at LA City College",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0198385/"
}