{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hal Holbrook",
            "url": "/name/nm0001358/"
        },
        {
            "@type": "Person",
            "name": "Leslie Nielsen",
            "url": "/name/nm0000558/"
        },
        {
            "@type": "Person",
            "name": "Adrienne Barbeau",
            "url": "/name/nm0000105/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49937,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163936/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099640/"
        },
        {
            "@type": "Person",
            "name": "Stephen King",
            "url": "/name/nm0000175/"
        }
    ],
    "datePublished": "1982-11-10",
    "description": "Five grisly tales from a kid's comic book about a murdered father rising from his grave, a bizarre meteor, a vengeful husband, a mysterious crate's occupant, and a plague of cockroaches.",
    "director": [
        {
            "@type": "Person",
            "name": "George A. Romero",
            "url": "/name/nm0001681/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Comedy",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTU3NGIyZTctOWEyMS00MGIyLWFkZWMtMTg0ODE2MjExNGZlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "anthology,dark comedy,death,crate,meteorite",
    "name": "Creepshow",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jamhorner"
        },
        "dateCreated": "2007-10-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083767/"
        },
        "name": "Creepshow, Sold Out!",
        "reviewBody": "This was after Tales from the Crypt, however, Romero and King both where heavily influenced by these comics that they developed a movie that was sort of a satire/parody of Tales but in the same time a tribute to that comic book. In this movie there are four scary stories being told some written by Stephen King from his short stories and some written by Romero and SK. These stores, for that time, were pretty scary and freaked me out when they came in theaters. There are many great things about this movie that I enjoyed but there was, however, one huge things that I did not like about this movie. Regardless, it's about time for two horror geniuses to team up and do something good for a change.\n\nFirst off, the movie itself is about a comic book similar to Tails and the four stories in the movie come directly from the Creepshow comic books. The reason why that this idea works in not only the principle of bringing a comic book to life but the way it was shot, edited and lit. The camera angles had very defined and geometrical angels, similar to those that you would see in a comic book. The lighting when something horrible happens turns red, or if somebody is screaming the background turns to a shattered red background, thereby giving each scene a more comic book-like feel to visual picture. It had choppy edits and quick cuts, which we all know that comic books have. So we have a visual perspective of a comic, the overall pattern and texture of a comic and now we have the quick stimulus of a comic.\n\nBetween each story there is a sub-story dealing with a young boy who finds the Creepshow comic book and how little by little he becomes more possessed by it. These intermissions also incorporate The Creep or our host for the evening. This character is by far the Crypt Keeper or the Vault Keeper to our mockup of Tales. Like the Crypt Keeper in the actual comic, he begins each segment with a scene setup and a conclusion, however he does not talk, he just blows around in the wind. With the beginning of each new story it starts out with a still scene of that story with heavy rotoscoping to make it look as if it is a comic book page, then fades out to a real-life still image and then begins. The same could be said about the ending. The clever technique gives the viewer a further illustration that this is a comic book come to life.\n\nThough this movie strikes it rich on my scare-o-meter there is just one thing that took me out of the movie just a little. I know what they where going at when they decided this concept and I understand it was a good idea but it doesn't work when it gets put on film. The campy one-liners, the cheesy sub-story and the lame screams. Of course its predecessor did the same thing, I don't think that it works as well on film as it does on paper. I think it was a nice try though.\n\nOverall I do believe that this is a horror/parody classic and that many horror fans, if not cult horror fans, would like this movie for what it is. I certainly enjoyed it, even now; I recommend this movie to anybody who loves the zombie king and the horror king. A movie worth buying a ticket for.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An anthology which tells five terrifying tales inspired by the E.C. horror comic books of the 1950s.",
        "duration": "PT1M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1937948953",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzM3YmRkMzctZmRkYS00OWFiLWE0OWUtNDhkYTFhMzlmNzg5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzM3YmRkMzctZmRkYS00OWFiLWE0OWUtNDhkYTFhMzlmNzg5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-05T14:20:09.928Z",
        "url": "https://www.imdb.com/video/vi1937948953/"
    },
    "url": "/title/tt0083767/"
}