{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Kennedy",
            "url": "/name/nm0001421/"
        },
        {
            "@type": "Person",
            "name": "Lois Chiles",
            "url": "/name/nm0001042/"
        },
        {
            "@type": "Person",
            "name": "Domenick John",
            "url": "/name/nm0424155/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26772,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064409/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099636/"
        },
        {
            "@type": "Person",
            "name": "Stephen King",
            "url": "/name/nm0000175/"
        },
        {
            "@type": "Person",
            "name": "George A. Romero",
            "url": "/name/nm0001681/"
        },
        {
            "@type": "Person",
            "name": "Lucille Fletcher",
            "url": "/name/nm0282061/"
        }
    ],
    "datePublished": "1987-05-01",
    "description": "Three macabre tales from the latest issue of a boy's favorite comic book, dealing with a vengeful wooden Native American, a monstrous blob in a lake, and an undying hitchhiker.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Gornick",
            "url": "/name/nm0331193/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2NiMWM2YzctNDRiNi00NmUxLTk3NWItMjA4OTY5NzhlYjQyXkEyXkFqcGdeQXVyMTAxODYyODI@._V1_.jpg",
    "keywords": "based on the works of stephen king,black comedy,anthology,raft,swimming",
    "name": "Creepshow 2",
    "original_info": {
        "id": "Creepshow 2_1987",
        "name": "Creepshow 2",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "liveronastick"
        },
        "dateCreated": "2007-06-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092796/"
        },
        "name": "A worthy but flawed sequel",
        "reviewBody": "Creepshow 2 was released in 1987 and was directed by George Romero's regular cinematographer Michael Gornick. Gornick, who was a late replacement for the original director FX maestro Tiom Savini, cut his directorial teeth on several episodes of Laurel's Tales From The Darkside and was a natural choice to make the film. He does a commendable job with what is clearly a modest budget and three stories that are not as engaging, gripping and frightening as those available to Romero in his original 1982 film.\n\nOnly one of the three stories has been previously published, the other two being originals devised for the film by Stephen King and scripted by Romero. The first story is called Old Chief Woodenhead and stars Hollywood veterans George Kennedy and Dorothy Lamour. It concerns a wooden storefront statue of an old Indian chief that comes to life to avenge the death of two elderly people by a gang of youths. It is the least impressive of the three tales but retains a certain ghoulish charm.\n\nThe second story is The Raft. Originally published in King's 1985 short story collection Skeleton Crew (with a slightly different ending). The segment is about four scantily-clad teenagers who arrive at a deserted lake, late one summer, for an afternoon swim but find that something thoroughly unpleasant is waiting for them. The special effects are well below par with King himself commenting that the monster in the lake looks something like \"a dirty old man's raincoat\". However, this episodes's grim punchline would make The Cryptkeeper himself chuckle with approval.\n\nThe third and probably best story is The Hitchhiker and stars Louis (Moonraker) Chiles as a bored, rich housewife who regularly enjoys the services of a handsome gigolo. On her way home from such an encounter she accidentally runs over a young Hitchhiker (played by stuntman Tom Wright) killing him instantly. Terrrified by the consequences of her actions she quickly leaves the scene of the accident. However, a few miles down the road she sees the Hitchhiker, bloodied and amazingly returned to life, limping towards her. To reveal any more would be to dampen this segment's sick delights but I will say that it features a neat cameo by King himself as a foul-mouthed truck driver.\n\nA fourth story called Pinfall was planned for the movie but later dropped due to the faltering budget. It concerned an overweight band of beer-chugging bowlers that are murdered by a rival bowling team and come back from the dead for revenge in true EC style. Its a shame we will never get to see this story but it is very close in theme and structure to both Oldf Chief Woodenhead and The Hitchhiker.\n\nAll in all, Creepshow 2 is worth a look and remains a guilty pleasure of mine that I have enjoyed with alarming regularity over the years. It may not be up to the standards set by the first Creepshow but there are more painful ways to spend an evening. Ask The Hitchhiker..."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Anchor Bay Entertainment",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3720282393",
        "name": "Creepshow 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTI2M2M1NWUtNjIwYi00MWNmLWE3Y2QtOTEzYmRkZWE1NDk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTI2M2M1NWUtNjIwYi00MWNmLWE3Y2QtOTEzYmRkZWE1NDk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:37:18Z",
        "url": "https://www.imdb.com/video/vi3720282393/"
    },
    "url": "/title/tt0092796/"
}