{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark McLachlan",
            "url": "/name/nm0572386/"
        },
        {
            "@type": "Person",
            "name": "Caitlin Martin",
            "url": "/name/nm0552025/"
        },
        {
            "@type": "Person",
            "name": "Chris Solari",
            "url": "/name/nm4897832/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4556,
        "ratingValue": 3.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042240/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002572/"
        },
        {
            "@type": "Person",
            "name": "Jace Anderson",
            "url": "/name/nm0026829/"
        },
        {
            "@type": "Person",
            "name": "Boaz Davidson",
            "url": "/name/nm0203246/"
        },
        {
            "@type": "Person",
            "name": "Adam Gierasch",
            "url": "/name/nm0317368/"
        }
    ],
    "datePublished": "2000-11-13",
    "description": "A group of college friends are attacked by a giant man-eating crocodile while on spring break.",
    "director": [
        {
            "@type": "Person",
            "name": "Tobe Hooper",
            "url": "/name/nm0001361/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGMzODlhNGMtNWNjZS00ZTU1LTgwYjEtMDA1MzAyOGYxMmU0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "bitten by a crocodile,psychotronic film,natural horror,female rear nudity,boat",
    "name": "Crocodile",
    "original_info": {
        "id": "Crocodile_2000",
        "name": "Crocodile",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "billybrown41"
        },
        "dateCreated": "2002-03-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0203425/"
        },
        "name": "Go into this one at your own risk.",
        "reviewBody": "Hmmm. This movie is kind of a double-edged sword. It's like this, I saw the box and grabbed it up because I wanted something to make fun of. Much like I did with Alligator (which turned out being really good). But here, Tobe Hooper was directing, so I figured it may be worth a shot. Back to what I was saying earlier. There is a lot to be made fun of in this movie, if you're not used to this sort of thing. Those weird people (like myself) who spend much of their free time bashing other people's work will be right at home here. Whether it be some of the characters' ill-executed dialouge or the even iller-executed Croc effects, which sometimes work and sometimes don't. Or it could just be the fact that this is the dumbest bunch of college-agers ever put on film (with the exception of Urban Legend: Final Cut). \n\nLet me say what I like about this movie before I go any further and tell you what passes for the plot. A bunch of beer-swilling college kids (they look like their around that age, but I don't think any of them are smart enough to get in college. No, I'm not being funny) are on a Spring Break and have rented a house boat for what promises to be a fun trip on the lake. They've got all the goods. Beer, beer, and more beer. There's every characters cliche that you would come to expect, featuring the smartass, the whiner who's having trouble with his girlfriend, the loudmouth, the one who's just a little bit louder than the rest, the prude, the slut (I liked her), you get the idea. Everyone has seen this all before...Anyway, one of the girls happens to be unknowingly carrying a crocodile egg in her bag that the prankster put in there as a joke...I don't get it. But, that's the set-up for the whole damn movie. Understandably, the croc is none too happy about her egg being stolen and she's going to try everything in her power to get it back. and maybe have a little fun along the way. You can figure out the rest. The ultimate beer-bash on water, turns into a fight for survival. \n\n Now, even though I've seen this done a thousand times, I still enjoyed Crocodile and rarely got bored. Their were a couple of moments that spent too much time meandering, but the characters are fun to be around and even the Crocodile has a certain charm. Like many other horror flicks out right now, this one has the punk/pop soundtrack and it just makes the whole thing that much more fun. Even though it's predictable, Crocodile is still worth a rental. I would've expected more from the guy who brought us the Texas Chainsaw Massacre, though. Anyhow, give it a run. It's great for some laughs."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Trimark",
        "duration": "PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3267297561",
        "name": "Crocodile",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjcyNTgyNzYtOTNhZS00NGU5LTkxMzMtZWZhODZjM2ExODM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjcyNTgyNzYtOTNhZS00NGU5LTkxMzMtZWZhODZjM2ExODM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:38:16Z",
        "url": "https://www.imdb.com/video/vi3267297561/"
    },
    "url": "/title/tt0203425/"
}