{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Karen Alexander",
            "url": "/name/nm5692544/"
        },
        {
            "@type": "Person",
            "name": "Steve Alexander",
            "url": "/name/nm5115862/"
        },
        {
            "@type": "Person",
            "name": "Colin Andrews",
            "url": "/name/nm0028614/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 235,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013656/"
        }
    ],
    "datePublished": "2002-08-23",
    "description": "Signs indicate that some form of non-human intelligence is communication with us ... What's the message? Academy Award nominated documentary filmmaker William Gazecki offers a compelling and provocative look at the mysterious phen...",
    "director": [
        {
            "@type": "Person",
            "name": "William Gazecki",
            "url": "/name/nm0311086/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcyMDExNDc1OF5BMl5BanBnXkFtZTcwNDg5NTQyMQ@@._V1_.jpg",
    "keywords": "paranormal phenomenon,psychotronic film,crop circle,intelligence,universe",
    "name": "Crop Circles: Quest for Truth",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "quantumpeep"
        },
        "dateCreated": "2004-11-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0331225/"
        },
        "name": "Beautiful pictures and dubious science",
        "reviewBody": "I was disappointed with this movie. Despite the tagline 'Quest for Truth,' William Gazecki focuses primarily on a number of 'author/researchers' (as many of the descriptions seem to say) who all very much believe they are supernatural or extraterrestrial without much discussion of them as possible hoaxes. The science was dubious at best, but unfortunately, many of the statements were framed as scientific. Discussion of geometry and magnetic anomalies sound convincing without saying too much. Patterns do appear in nature, but they are also based on physical law, and didn't I see some humanoid forms in these geometrical crop circles? In one frustrating example, a researcher shows a linear plot consistent with the Beer-Lambert law (which she does not state accurately) and says that the cause is therefore radiation. The plot, with its compressed y axis and fairly low R-squared value, is not clearly linear, and even if it were, no true scientist would then conclude that it *must* therefore be a radiation effect. There are many examples of jargon thrown around a little too loosely. Although the science is shaky, there are many beautiful crop circles shown  amazing even as works of art -- and some interesting discussion about their origin. Unfortunately, it was discussion amongst people who essentially agree with each other.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The largest collection of crop circles ever captured on film, 'Crop Circles: Quest for Truth' is a compelling and provocative feature-length documentary film offering a comprehensive look at the crop circle phenomenon. Director William Gazecki takes the exploration from fiction to fact, drawing some shocking conclusions as he offers a rare glimpse into the inner sanctum of scientists studying crop circle formations. Visually stunning cinematography shot on location in the fields of Southern England enhances this documentary which includes rare footage and interviews with leading researchers.",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi824772377",
        "name": "Crop Circles: Quest for Truth",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTI4OTg5OTYyNl5BMl5BanBnXkFtZTcwMjY1MzI0Mw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTI4OTg5OTYyNl5BMl5BanBnXkFtZTcwMjY1MzI0Mw@@._V1_.jpg",
        "uploadDate": "2010-04-28T16:33:06Z",
        "url": "https://www.imdb.com/video/vi824772377/"
    },
    "url": "/title/tt0331225/"
}