{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Selleck",
            "url": "/name/nm0000633/"
        },
        {
            "@type": "Person",
            "name": "Virginia Madsen",
            "url": "/name/nm0000515/"
        },
        {
            "@type": "Person",
            "name": "Wilford Brimley",
            "url": "/name/nm0000979/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3416,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009512/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0082006/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091403/"
        },
        {
            "@type": "Person",
            "name": "Louis L'Amour",
            "url": "/name/nm0478263/"
        },
        {
            "@type": "Person",
            "name": "Charles Robert Carner",
            "url": "/name/nm0138706/"
        }
    ],
    "datePublished": "2001-01-21",
    "description": "Rafe promises a dying friend to look after his wife and 40,000 acre ranch in Wyoming. A powerful businessman wants the ranch and widow by whatever means necessary.",
    "director": [
        {
            "@type": "Person",
            "name": "Simon Wincer",
            "url": "/name/nm0934578/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Action",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmVkMzJlNjQtNzZkYS00OGYwLWJjMmUtOTU3NGFjYWQ2ZGY3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "shoulder holster,woman with a gun,lakota indian,native american chief,long hair",
    "name": "Crossfire Trail",
    "original_info": {
        "id": "Crossfire Trail_2001",
        "name": "Crossfire Trail",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "marcd30319"
        },
        "dateCreated": "2001-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0218127/"
        },
        "name": "Solid adaptation of the Homer of the American Western, Louis L'Amour",
        "reviewBody": "That Homer of the American Western, Louis L'Amour, has always been good to actor-producer Tom Selleck. CROSSFIRE TRAIL is a well produced motion picture that in another era would have been a well-received theatrical motion picture release. Regrettably, the climate at movie box office doesn't support westerners of such classic pedigree, and it is to TNT Original Productions credit that they have allowed this film to find its venue and audience.\n\nThe production is impeccable, as is the cast, with special attention given to the lead actor Tom Selleck. While success on the silver screen eluded him, Selleck still shows why he continues to be the best actor working in traditional Westerners and the natural successor to such screen legends as Joel McCrea, Randolph Scott, Gary Cooper, and John Wayne. Any of those actors would have felt quite at home with the hero of this film, Rafael Covington, a man of few word and an unbending code of honor.\n\nSupporting Selleck are the vibrant Virginia Masden, Mark Harmon, Brad Johnson, David O'Hara, Patrick Kilpatrick as well as the always welcomed presence of those two ever-reliable veteran actors, Wilford Brimley and Barry Corben.\n\nFor Australian director Simon Wincer and star Tom Selleck, CROSSFIRE TRAIL is a re-union since they collaborated in the highly entertaining and grossly neglected QUIGLEY DOWN UNDER. Wincer brings his typically excellent eye to period detail and visual meise en scene that he used so successfully in his groundbreaking epic LONESOME DOVE.\n\nAgain, if you haven't seen this film, then by all means, do so. If you have, then go back a savor of well-done effort. You will be well rewarded in either case.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0218127/"
}