{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mary Steenburgen",
            "url": "/name/nm0005460/"
        },
        {
            "@type": "Person",
            "name": "Rip Torn",
            "url": "/name/nm0001800/"
        },
        {
            "@type": "Person",
            "name": "Peter Coyote",
            "url": "/name/nm0001075/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1929,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103551/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Marjorie Kinnan Rawlings",
            "url": "/name/nm0712617/"
        },
        {
            "@type": "Person",
            "name": "Dalene Young",
            "url": "/name/nm0949430/"
        }
    ],
    "datePublished": "1983-10-27",
    "description": "In the 1930s, Marjorie Kinnan Rawlings moves to Florida's backwaters to write in peace. She feels bothered by affectionate men, editor and confused neighbors, but soon she connects and writes The Yearling, a classic of American li...",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Ritt",
            "url": "/name/nm0728688/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzZhZGEwYjEtOGVjMi00MmE0LTlmZWUtYzFjOWNiM2JkZTlmXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "florida,swamp,writer,year 1928,backwoods",
    "name": "Cross Creek",
    "original_info": {
        "id": "Cross Creek_1983",
        "name": "Cross Creek",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2008-10-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085380/"
        },
        "name": "Rawlings, The Early Years",
        "reviewBody": "Film fans best know the work of Marjorie Kiniston Rawlings through the adaption of her best known work The Yearling and the later filming of an original story for the screen in The Sun Comes Up. Cross Creek is our opportunity to look inside the mind and character of the woman who was the creator of these classics.\n\nAs played beautifully by Mary Steenburgen, we meet Rawlings during the Twenties as a woman with a passion to go to the land and a burning desire to write. She's been submitting potboiler romance novels to publishers who keep telling her to reach for her soul in her writings.\n\nSteenburgen divorces her husband and moves to some Florida swamp land which she by dint of her own hard work and the help of neighbors, she turns into a decent patch for an orange grove. One of them, storekeeper Peter Coyote, evinces more than a neighborly interest.\n\nIt's her letters from her town of Cross Creek that excite Steenburgen's potential publisher, Malcolm McDowell, the simple lives and dignity of her neighbors with all their flaws. Especially neighbor Rip Torn and his family, they become the models for the characters in The Yearling.\n\nCross Creek earned Academy Award nominations for Rip Torn as Best Supporting Actor and Alfre Woodard playing a black woman who Steenburgen takes in and works for her. Cross Creek also got nominations for Best Music Score and Costume Design. Why Mary Steenburgen wasn't nominated for Best Actress is a mystery.\n\nOne really ought to see Cross Creek back to back with The Sun Comes Up which was Rawlings original work for the screen and was Jeanette MacDonald's last film. Seeing Cross Creek puts a lot of The Sun Comes Up in context with MacDonald's character and with how Rawlings is interpreted by Steenburgen. Both films will take on a new dimension if anyone has not seen the other.\n\nCross Creek is one excellent piece of film making about the genesis of a great American writer.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In 1930's Marjorie Kinnan Rawlings moves to Florida's backwaters to write in peace. She feels bothered by affectionate men, editor and confused neighbors, but soon she connects and writes The Yearling, a classic of American literature.",
        "duration": "PT2M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3288187673",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjFiZmM2NTUtYzdmMC00MGU5LWE3YzMtYzg3MTM5MzQwMTU1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjFiZmM2NTUtYzdmMC00MGU5LWE3YzMtYzg3MTM5MzQwMTU1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-09T19:37:42.453Z",
        "url": "https://www.imdb.com/video/vi3288187673/"
    },
    "url": "/title/tt0085380/"
}