{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ralph Macchio",
            "url": "/name/nm0001494/"
        },
        {
            "@type": "Person",
            "name": "Joe Seneca",
            "url": "/name/nm0784171/"
        },
        {
            "@type": "Person",
            "name": "Jami Gertz",
            "url": "/name/nm0000415/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16738,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "John Fusco",
            "url": "/name/nm0299301/"
        }
    ],
    "datePublished": "1986-03-14",
    "description": "A wannabe blues-guitar virtuoso seeks a long-lost song by legendary musician Roberto Johnson.",
    "director": [
        {
            "@type": "Person",
            "name": "Walter Hill",
            "url": "/name/nm0001353/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama",
        "Music",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDg3MmVmNmUtMzI4NC00NDY1LTg5YTAtMDJiODJlNmM0MTAwXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "deal with the devil,blues music,guitar duel,musical duel,harmonica",
    "name": "Crossroads",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "billybrown41"
        },
        "dateCreated": "2002-12-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090888/"
        },
        "name": "Great movie. NOT the one with Brittany",
        "reviewBody": "Walter Hill is the director of some of my all time favorite movies. His films tend to be more action oriented, rather than character-driven, which is surprising since I normally don't like action films. He tends to establish the characters just enough for you to care about them before throwing them headfirst into the fireworks. Movies like \"The Warriors\", \"48 Hours\", \"Southern Comfort\", and \"The Long Riders\" all left their mark and set standards for their genre. It's a little strange that he would sign on to do a movie like this, but he somehow pulls it off. \n\nThis kid Eugene (Ralph Macchio) is a classical guitar student with an obsession with the blues. Despite the disapproval of his teacher, he longs to be a bluesman just like his heros of the 30s and 40s. When he gets word of a lost song by the late, great Robert Johnson, he hunts down Johnson's still-living harp player, Willie Brown (Joe Seneca). Willie is a cantankerous old man who spends his days rotting away down at the nursing home. It doesn't take the kid long to track down the old man and make a little deal: If he helps the geezer bust out of the old-folks home, then the geezer will in turn, teach the kid the long lost song. You see, they're in New York and the old man has to get home to the delta to settle an old score. Thus, the road trip begins...hobo-style. \n\nTo give much more away would be a crime, but the kid and the geezer are well matched and this gives the movie a lot of laughs and LOADS of memorable quotes from the old man. Joe Seneca was a great actor and I believe this was one of his best performances. Ralph Macchio is perfect as the kid and we really do believe that he is obsessed with the blues. Jami Gertz also gives a credible performance as the temporary love interest. She's perfect for the part. \n\nI really can't praise this movie enough. The music alone, is enough to reccommend it (Ry Cooder rocks as always) and if you're into the blues, chances are you've already seen it. If you can find this one, it's well worth a rental. I guarantee that you won't watch it just once. I can't wait for the dvd. 10/10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2054603033",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTc5NTVmYzItMTBhNS00OWVjLTk0MTktNmNiNjhiNzk5OTY0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTc5NTVmYzItMTBhNS00OWVjLTk0MTktNmNiNjhiNzk5OTY0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-01-15T19:57:14.671Z",
        "url": "https://www.imdb.com/video/vi2054603033/"
    },
    "url": "/title/tt0090888/"
}