{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clive Owen",
            "url": "/name/nm0654110/"
        },
        {
            "@type": "Person",
            "name": "Nick Reding",
            "url": "/name/nm0714919/"
        },
        {
            "@type": "Person",
            "name": "Nicholas Ball",
            "url": "/name/nm0050437/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22591,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014456/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021676/"
        },
        {
            "@type": "Person",
            "name": "Paul Mayersberg",
            "url": "/name/nm0562577/"
        }
    ],
    "datePublished": "2000-07-28",
    "description": "An aspiring writer is hired as a croupier at a casino, where he realizes that his life as a croupier would make a great novel.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Hodges",
            "url": "/name/nm0388198/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmMwNDE5YmYtNzdmYy00ZTlmLWJkOWYtMDY5NDBiMGQyNTFmXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "casino,croupier,casino dealer,writing a novel,blackjack dealer",
    "name": "Croupier",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FlickJunkie-2"
        },
        "dateCreated": "2001-01-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0159382/"
        },
        "name": "Engrossing, high quality film-noir drama",
        "reviewBody": "This film-noir crime drama gets my vote for sleeper of the year. It is an expertly written story that is subtly directed and superbly acted. It makes up for the dozens of dreadful independent films one has to mine to find such a gem. \n\nJack Manfred (Clive Owen) is a struggling writer, who on the advice of his father takes a job as a croupier at a local casino, a job he previously held when he lived in South Africa. He takes the job to make some extra money, but soon he realizes that it would be an excellent setting for a novel. He becomes an impassive observer of the gambling culture on both sides of the table, taking mental notes that are later incorporated into his book. However, as time goes on he is seduced from observer to participant, gradually breaking all his own rules and justifying his decadence by convincing himself that he has become the character in his book. His feeling of control is delusional as he is being manipulated by unseen forces that are beyond his comprehension.\n\nThere is a wonderful multi-layered texture to the story. It examines the psychological aspects of the gambling casino from the inside out, allowing us to look at the trade from the casino's perspective. It also weaves in love, sex, deceit and betrayal along with robbery and murder. A few plot gaps leave the viewer with some unanswered questions, but they are minor. The ingenious weave of plot elements culminating in a clever ending more than makes up for the flaws. Director Mike Hodges did an outstanding job of creating realistic casino environment without a lush budget. Hodges got the feeling just right as well, portraying various types of gamblers from the high rollers to the addicts.\n\nThe acting was superlative. Clive Owen emerges from the shadow of his television resume to deliver a complex and brilliant performance as the cunning but stolid croupier. If anyone with clout ever sees this film, his agent will certainly be getting some calls. Alex Kingston also does a fine job as the enigmatic Jani, who lures him into a nefarious scheme that sends his life spinning dangerously out of control.\n\nThis intelligent film keeps the viewer engrossed throughout. I rated it a 9/10. It presents a fine alternative to mindless big budget films that are more form than substance.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An aspiring writer is hired as a croupier at a casino, where he realizes that his life as a croupier would make a great novel.",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2233843993",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWY5ZmY3NmMtMTMyYS00N2FiLTk2NjctNmQ4YjYxNjFiYTI1XkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWY5ZmY3NmMtMTMyYS00N2FiLTk2NjctNmQ4YjYxNjFiYTI1XkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg",
        "uploadDate": "2020-12-09T13:32:45.989Z",
        "url": "https://www.imdb.com/video/vi2233843993/"
    },
    "url": "/title/tt0159382/"
}