{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eben Gordon",
            "url": "/name/nm1700727/"
        },
        {
            "@type": "Person",
            "name": "Rob Moretti",
            "url": "/name/nm0604344/"
        },
        {
            "@type": "Person",
            "name": "Juanita Walsh",
            "url": "/name/nm0909717/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 708,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132368/"
        },
        {
            "@type": "Person",
            "name": "Paul Jacks",
            "url": "/name/nm1706565/"
        },
        {
            "@type": "Person",
            "name": "Rob Moretti",
            "url": "/name/nm0604344/"
        }
    ],
    "datePublished": "2004-09-17",
    "description": "An autobiographical film taken from the experiences of writer-director Rob Moretti, CRUTCH is a coming-of-age tale about a young man's struggle with family problems and substance abuse. Behind a facade of suburban middle class per...",
    "director": [
        {
            "@type": "Person",
            "name": "Rob Moretti",
            "url": "/name/nm0604344/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA1Nzg0MjgyOF5BMl5BanBnXkFtZTcwOTQyNjgyMQ@@._V1_.jpg",
    "keywords": "thirty something,seduction,drinking,autobiographical,actor",
    "name": "Crutch",
    "original_info": {
        "id": "Crutch_2004",
        "name": "Crutch",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CinemaSerf"
        },
        "dateCreated": "2023-02-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0422029/"
        },
        "name": "Crutch",
        "reviewBody": "It's hard to be too critical of something quite this viscerally autobiographical. It was his life and this is the way auteur Rob Moretti wants to relate it. It tells of his late youth as he comes to terms with his sexuality, his family's reaction to that, and to addiction. It's largely played through the eyes of \"David\" (Eben Gordon) who has to balance his own needs with those of those around him. Might he be able to find happiness with \"Kenny\" (Moretti)? Well that's what the next ninety minutes explore, and although this is clearly a labour of love for the director, it is certainly not for the viewer. The production is basic, at best. The dialogue resorts all to often to expletive-ridden rants that, though they do convey to an extent the frustration of this young man - actually served to lower the already struggling standards of the film. Sure, tell your story - but if you cannot connect with the audience then it becomes and remains little better than a vanity project. The acting here is mediocre, the pacing slow and it is all just a bit too self-indulgent to really engage. It's always a danger when one person controls the entire creative process of a film, and when it is about that person's life experiences too it can - and this one certainly does - lose any sense of objectivity. This is poor, sorry.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0422029/"
}