{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Zachary Bennett",
            "url": "/name/nm0072124/"
        },
        {
            "@type": "Person",
            "name": "Stephanie Moore",
            "url": "/name/nm0601890/"
        },
        {
            "@type": "Person",
            "name": "Martin Roach",
            "url": "/name/nm0730045/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 41266,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0109435/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086772/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0016889/"
        },
        {
            "@type": "Person",
            "name": "Ernie Barbarash",
            "url": "/name/nm0053228/"
        }
    ],
    "datePublished": "2005-02-22",
    "description": "A young programmer whose job is to watch over the reality-warping Cube defies orders to rescue an innocent mother trapped in one of its rooms.",
    "director": [
        {
            "@type": "Person",
            "name": "Ernie Barbarash",
            "url": "/name/nm0053228/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjA3ZmQ3YWQtM2ViNS00Mzk4LTk1ZWQtMWIyZTdkYzA5NjJkXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
    "keywords": "cyberpunk,part of trilogy,third part,underwater scene,countdown",
    "name": "Cube Zero",
    "original_info": {
        "id": "Cube Zero_2004",
        "name": "Cube Zero",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "morphion2"
        },
        "dateCreated": "2005-11-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0377713/"
        },
        "name": "Not Awful, but Unnecessary",
        "reviewBody": "Following the release of Cube 2: Hypercube (2003), and playing off the alleged success of the original Cube (1998), Director Ernie Barbarash takes the liberty of bringing us the third installment in the trilogy, the prequel Cube Zero.\n\nDeep in the bowels of a giant and faceless institution, time and place unknown, two low-ranking operators, Wynn (Zachary Bennett) and Dodd (David Huband) sit and observe on monitors the behavior of people that have been placed in a giant network of cubic chambers, some of which are rigged with death traps. Told that the people they are observing are convicted felons who chose this horrific and deadly ordeal over a lethal injection, these observers have had no problem with their jobs until Wynn, a mathematical genius, discovers that one of the prisoners, a woman named Cassandra (Stephanie Moore) never agreed to be put inside the Cube. Suddenly it's realized that perhaps their \"jobs\" are not what they seem, and that they may be part of something deeply sick and twisted...\n\nFor people that have seen and enjoyed the original Cube, this prequel will probably not be to your liking. It's not that the story does not have potential; it's simply that the first Cube film never needed to be expanded on. Standing alone, it is a neat little psychological thriller with very interesting concepts and a certainty about its own message. It was also nicely self-contained. The problem with Cube Zero is that it destroys some of the mystique of the original, attempting to answer questions with more questions but only really resulting in making a mess of what never needed fixing.\n\nWhat this new film has to offer, which is questions about the psychological nature of authoritarianism and the banality of evil, certainly are good questions to be raised, but probably should have been done so on their own merits, rather than as a continuation of a film that had no such aspirations.\n\nHaving said this, the other traits of the film, such as acting and direction and writing, are not awful. There is a bleak, dark look to the film akin to such film noir as 'The Matrix' and 'Dark City', and they have certainly managed to recapture the claustrophobic feeling of the first Cube. Unfortunately for Barbarash, these are not enough positive qualities to save it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0377713/"
}