{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Moshe Ivgy",
            "url": "/name/nm0412405/"
        },
        {
            "@type": "Person",
            "name": "Mohammad Bakri",
            "url": "/name/nm0049235/"
        },
        {
            "@type": "Person",
            "name": "Salim Daw",
            "url": "/name/nm0202207/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 202,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Cup Final",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055846/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015988/"
        },
        {
            "@type": "Person",
            "name": "Eyal Halfon",
            "url": "/name/nm0355145/"
        }
    ],
    "description": "An Israeli soldier is taken hostage by a small PLO squad in lebanon. The soldier planned to go on vacation and to fly to the world final soccer cup (mondial), he and his capturers share the love to soccer and toward the (not so ha...",
    "director": [
        {
            "@type": "Person",
            "name": "Eran Riklis",
            "url": "/name/nm0726954/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjc3NzE1NjE1NF5BMl5BanBnXkFtZTcwMzE2OTAyMQ@@._V1_.jpg",
    "keywords": "soccer,israel lebanon war,lebanon war,male nudity,actual animal killed",
    "name": "Gmar Gavi'a",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "eldino33"
        },
        "dateCreated": "2009-11-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101959/"
        },
        "name": "The Left Elbow Index",
        "reviewBody": "The Left Elbow Index considers film in terms of seven variables--acting, production sets, plot, character development, artistry, character development, and film continuity--on a scale from a high of 10 to a low of 1, with a 5 for an average film. Films like CUP FINAL draw all types of commentary related to the continual struggles in the Middle East, and agenda based evaluations are avoided by the Index. The first of the considerations of the index is acting, which in this film rates a 3, mostly because the level of acting seems to be somewhere between television mini-series quality and spaghetti western. This appears to result from the nature of the film and not on the ability of the cast. The production sets rate a 4 with too many outdoor scenes to merit much developmental opportunities. The plot merits a 2 based on the episodic nature of the film and a seeming lack of development. The characters appear mostly stereotypical, therefore a 3. One gets the feeling one has met them all before. The seems to be little artistry, except for some interesting camera angles--therefore, a 1. The dialogue is adequate, if sometimes a little quirky--a 5. It might be better if the characters said less, avoiding the seemingly forced dialogue in places. The film continuity seems puzzling. Is the film about the war, the World Cup, the soldiers, the terrorist, or all of the above. And why the wedding scene? It appears that the film wobbles too much from one idea to another--a 3 seems an appropriate ranking. The index average is 3.14, raised to a 5 when equated to the IMDb ratings,low but not hopeless. If one wants to see a movie of Middle East conflict and bathe in ideological elements of those many years of struggle, it is worth seeing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0101959/"
}