{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Larry David",
            "url": "/name/nm0202970/"
        },
        {
            "@type": "Person",
            "name": "Cheryl Hines",
            "url": "/name/nm0385644/"
        },
        {
            "@type": "Person",
            "name": "Jeff Garlin",
            "url": "/name/nm0307531/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 132788,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137915/"
        },
        {
            "@type": "Person",
            "name": "Larry David",
            "url": "/name/nm0202970/"
        }
    ],
    "datePublished": "2000-10-15",
    "description": "The life and times of Larry David and the predicaments he gets himself into with his friends and complete strangers.",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzE3ZDA4OWItOGY2ZC00MzVmLTk0Y2QtNzEzMjc5YWI5ZWFiXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg",
    "keywords": "actor playing himself,misperception,misconception,misunderstanding,husband wife relationship",
    "name": "Curb Your Enthusiasm",
    "original_info": {
        "id": "Curb Your Enthusiasm: Season 1_2000",
        "name": "Curb Your Enthusiasm: Season 1",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "glgioia"
        },
        "dateCreated": "2003-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0264235/"
        },
        "name": "Seinfeld Rated R",
        "reviewBody": "So what does Larry David do for an encore after the incredibly successful sitcom that detailed his experiences as a stand up in NY, he creates a new sitcom about his experiences as a very succesful creator of said show, post cancellation, living the good life with a ton of dough out in Malibu. Sounds pretty boring, and even snotty right? Its not at all. Like the rest of us, I loved Seinfeld, and still love the reruns. But I gotta say, this show is better. It's the same basic premise, which I guess is to turn a standup monologue into a situation comedy. In other words, instead of having a guy on stage telling jokes about the amusing and annoying happenstances of every day life, you create a format comedy, and use these anecdotes to weave together a plot. What made Seinfeld memorable was the clever way in which everything all in the end tied up in a nice little package. If you notice, that's a common laugh getter for stand-ups, to inject a joke they made earlier in their set and put it into practical anecdotal demonstration. You are right if you are thinking this is complete hogwash and hyper-analyzation of something not meant to be studied as such, but there it is. Having said all of that, I think CYE is the logical next step for fans of the Seinfeld show. It's the advanced course if you will of the more remedial network show. The freedom of HBO allows for obviously more adult material and language, but also for pure artistic expression. A lot of what goes on is definitely not palatable to the mainstream, and I could honestly see people hating it. Not me. I think its a rare chance to see genius, unfettered and uncensored. Yes Larry David was George Costanza or vice versa, but through this series, you also see he was Kramer, Elaine and Jerry. For some reason I totally relate to his inability to relate to everyone else, including his wife. Its often way too contrived, but I love it. If you were a fan of Seinfeld for the reasons I've mentioned, and not just for the run of the mill laugh track jokes, you will be missing something special if you don't give these a shot."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The life and times of Larry David and the predicaments he gets himself into with his friends and complete strangers.",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3919430425",
        "name": "Season 11 Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjBjY2Y0MzYtZjgyZS00NGUyLWIwOTItNmMxNWM0M2Y1MzQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjBjY2Y0MzYtZjgyZS00NGUyLWIwOTItNmMxNWM0M2Y1MzQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-13T17:09:08.496Z",
        "url": "https://www.imdb.com/video/vi3919430425/"
    },
    "url": "/title/tt0264235/"
}