{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Masato Hagiwara",
            "url": "/name/nm0353717/"
        },
        {
            "@type": "Person",
            "name": "Kôji Yakusho",
            "url": "/name/nm0945131/"
        },
        {
            "@type": "Person",
            "name": "Tsuyoshi Ujiki",
            "url": "/name/nm0880299/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17659,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067278/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050423/"
        },
        {
            "@type": "Person",
            "name": "Kiyoshi Kurosawa",
            "url": "/name/nm0475905/"
        }
    ],
    "datePublished": "2001-07-08",
    "description": "A frustrated detective deals with the case of several gruesome murders committed by people who have no recollection of what they've done.",
    "director": [
        {
            "@type": "Person",
            "name": "Kiyoshi Kurosawa",
            "url": "/name/nm0475905/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Crime",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2IzODExNDgtMzViNC00ZDk5LWJlOGYtM2VjZjQ4MzllN2RiXkEyXkFqcGdeQXVyNTY4ODAxODI@._V1_.jpg",
    "keywords": "monkey,hypnotism,investigation,japan,amnesia",
    "name": "Cure",
    "original_info": {
        "id": "Cure_1997",
        "name": "Cure",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "poikkeus"
        },
        "dateCreated": "2011-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0123948/"
        },
        "name": "Cure - a great movie, but with qualification",
        "reviewBody": "I saw CURE at the San Francisco Film Festival in around 1998, and like many, I found the concept and craftsmanship arresting. A number of audience members stayed around afterwards to discuss it - it's a psychologically complex tale of hypnotism and the seductions of altered consciousness. Koji Yakusho (DORA HEITA, 13 ASSSASSINS, etc.) is at his acting peak as a detective who tries to solve a series of murders that don't seem to relate to common logic.\n\nRecently, I saw the DVD version of the film - and it's clear that the film had been cut severely. Most viewers have only seen the US DVD version, so they're not even aware of the problem. A few of the more graphic sequences were cut, important portions of the narrative set in an old sanatorium were excised, and the violent finish was excised entirely. (The US DVD concludes with the suggestion of a further killing; the theatrical Japanese version is more powerful and unambiguous.) In some cases, a later, recut version may be better than the original; however, that's not the case here. \n\nThere's scant online text relating to the differences between the two versions. \n\nIt speaks well for director Kiyoshi Kurosawa that he took a low-budget police procedural and made an innovative thriller out of it. Most of the scenes are under-edited and shot at a distance, to extract the most from the hypnotic storyline; the longer, hypnotic sequences are several minutes long, with no edits. Because the film uses medium-distance shots to give a sense of hypnotic disassociation, viewers with larger screens will gain an advantage.\n\nI strongly recommend seeing it - but would suggest you seek out the original, uncut theatrical print if you can. The differences are striking. I'd rate the original print as 10/10; the cut/domestic DVD is maybe 7/10. This film would profit from a Criterion reissue, but that doesn't seem to be in the works."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A mesmerising and hypnotic psychological thriller from Kiyoshi Kurosawa...\n\nReleased to critical acclaim in both the East and the West, CURE was a breakthrough film for director Kiyoshi Kurosawa, a nerve shredding thriller about the hunt for a serial killer in a bleak and decaying Tokyo.\n\nA series of murders have been committed by ordinary people who claim to have had no control over their horrifying actions. Following the only link - a mysterious stranger who had brief contact with each perpetrator and their victim - detective Kenichi Takabe (Kôji Yakusho, 13 ASSASSINS, TOKYO SONATA) places his own sanity on the line as he tries to end the wave of inexplicable terror. \n\nDescribed as one of the greatest films of all time by Bong Joon-ho (THE HOST, SNOWPIERCER), CURE is a deeply unsettling masterpiece of its genre, and has shockingly been unavailable on home video in the UK until now. The Masters of Cinema Series is proud to present Cure in a special Dual Format edition. \n\nCURE [Kyua], Kiyoshi Kurosawa's mesmerising and hypnotic psychological thriller, is released on home video for the first time in the UK as part of The Masters of Cinemas Series in a Dual Format edition on 23 April 2018.",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2631055385",
        "name": "Kiyoshi Kurosawa's CURE [Kyua] (Masters of Cinema) New & Exclusive UK HD Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjdlYmU3YTktZTQzNi00YWE5LTgzZjQtYmI3OTRkNTQyYTkxXkEyXkFqcGdeQXVyMTg2NTc4MzA@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjdlYmU3YTktZTQzNi00YWE5LTgzZjQtYmI3OTRkNTQyYTkxXkEyXkFqcGdeQXVyMTg2NTc4MzA@._V1_.jpg",
        "uploadDate": "2018-02-01T15:32:27Z",
        "url": "https://www.imdb.com/video/vi2631055385/"
    },
    "url": "/title/tt0123948/"
}