{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shirley Temple",
            "url": "/name/nm0000073/"
        },
        {
            "@type": "Person",
            "name": "John Boles",
            "url": "/name/nm0092900/"
        },
        {
            "@type": "Person",
            "name": "Rochelle Hudson",
            "url": "/name/nm0399955/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2000,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028775/"
        },
        {
            "@type": "Person",
            "name": "Patterson McNutt",
            "url": "/name/nm0574110/"
        },
        {
            "@type": "Person",
            "name": "Arthur J. Beckhard",
            "url": "/name/nm0065753/"
        },
        {
            "@type": "Person",
            "name": "William M. Conselman",
            "url": "/name/nm0175902/"
        }
    ],
    "datePublished": "1935-07-26",
    "description": "Wealthy Edward Morgan becomes charmed with a curly-haired orphan and her pretty older sister Mary and arranges to adopt both under the alias of \"Mr. Jones.\" As he spends more time with them, he soon finds himself falling in love w...",
    "director": [
        {
            "@type": "Person",
            "name": "Irving Cummings",
            "url": "/name/nm0191899/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Family",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIwNjY3MDQ3NV5BMl5BanBnXkFtZTgwOTI1ODg0MjE@._V1_.jpg",
    "keywords": "remake,ukulele,buttocks,female buttocks,orphan",
    "name": "Curly Top",
    "original_info": {
        "id": "Curly Top_1935",
        "name": "Curly Top",
        "year": "1935"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lugonian"
        },
        "dateCreated": "2008-01-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0026252/"
        },
        "name": "The Right to Be Happy",
        "reviewBody": "CURLY TOP (Fox, 1935), directed by Irving Cummings, stars popular child star Shirley Temple and her most distinctive features of all, the curls of her hair seen flashing on camera during the opening credits before her smiling face fills up the screen. This is followed by the faces and listed names of her co-stars John Boles and Rochelle Hudson who are equally matched in the story that revolves around Temple's character. Reportedly an unofficial remake to the Jane Webster story \"Daddy Long Legs\" most recently filmed in 1931 with Janet Gaynor and Warner Baxter, this version remains one of the most beloved movies in Temple's early career.\n\nIn an fade-in reminiscent to a Charles Dickens novel that opens during a cold, dark, rainy night at the Lakeside Orphanage where a group of little girls are seen marching upstairs in perfect order, escorted by the stern Mrs. Higgins (Rafaela Ottiano) and the very nice Henrietta Denham (Jane Darwell). Other members of the orphanage are the Blair sisters, Mary (Rochelle Hudson) and Elizabeth (Shirley Temple), whose parents, stage performers, were killed in an automobile accident. Mary, the eldest, not only earns her keep helping with the chores from morning till night, but looks after Elizabeth, who playful manner always lands her in trouble. Aside from acquiring a pony named Spunky and a duck as her pets, Elizabeth, better known as \"Curly,\" entertains the orphans by singing the songs written by Mary. Her entertainment is witnessed by the visiting members of the board of trustees headed by Mr. Wyckoff (Etienne Girardot), and Edward Morgan (John Boles), a bachelor heir to millions whose fortune may be the means of financial support for the orphanage. So impressed by this little girl, Morgan decides to sponsor the girls in secret, acting as a lawyer to his millionaire friend, \"Hiram Jones\" who wants to adopt them. Morgan fulfills his act of human kindness by having the girls (pony and duck, too) stay with him for the summer at his beach house, accompanied by his Aunt Genevieve (Esther Dale), Reynolds (Arthur Treacher), the butler, and a chef (Billy Gilbert), giving them every happiness money can buy. While Elizabeth is having the time of her life, ranging from water skiing with \"Uncle Edward\" and entertaining guests by doing a hula dance at the beach, Mary, who has attracted the attention of Jimmy Rogers (Maurice Murphy), a young pilot, becomes disillusioned when she overhears the reason why she and \"Curly\" were actually taken in by Morgan in the first place.\n\nA light-hearted story with doses of fine tunes thrown in, compliments of composers Ted Koehler, Edward Heyman, Irving Caesar and Ray Henderson, including \"Animal Crackers in My Soup\" (sung by Shirley Temple); \"It's All So New to Me\" (sung by John Boles as he envisions wall paintings of Curly coming to life); \"The Simple Things in Life\" (sung by Rochelle Hudson); \"When I Grow Up\" (sung by Temple enacting the part of a little girl, young adult and grandmother in a wheelchair); and \"Curly Top\" (sung by Boles, danced by Temple on top of piano). Boles and Hudson each provide solos to best advantage while \"Animal Crackers in My Soup\" became as synonymous to Temple's \"On the Good Ship Lollipop.\"\n\nAlthough Hudson never appeared opposite Temple again, John Boles would enact the role as her father in THE LITTLEST REBEL (Fox, 1935). Next to James Dunn, Boles works extremely well with Temple. Such a likable actor, Boles, through his good graces captured on screen, demonstrates how much he enjoys working with Temple, particularly with his sincere hug. Arthur Treacher, whose butler characters has become his trademark, is teamed with Temple for the first time. With his catch phrase \"My word!\" taking precedence over Temple's constant \"Oh, my goodness,\" they make a wonderful pair. One of their key scenes together finds Treacher teaching Temple table etiquette. \"My word!\" Another notable moment finds Temple doing a Hawaiian dance on the beach, a scene that was used for Temple's latter movie, YOUNG PEOPLE (1940), and a segment for the 1970s documentary about the movies, \"That's Hollywood\" narrated by Tom Bosley. In an episode dedicated to deleted scenes from the final movie print, the writers of that series mislabeled the hula dance number edited from CURLY TOP because of Temple being topless, sporting only a hula dress and a lei over her neck, while in reality this scene has always existed in the finished product. \n\nFormerly presented on many local TV channels since the 1960s on its Shirley Temple festivals, by which many stations eliminated the opening ten minutes, having the movie begin instead in the morning where Mrs. Denham (Jane Darwell) is seen raising the window shades and finding Curly's horse sleeping on the bed next to her. CURLY TOP, along with other Temple favorites, were later shown on various cable channels, ranging from The Disney Channel (1990s); American Movie Classics (1996-2000, sporadic revivals after-wards), Fox Movie Channel and Turner Classic Movies (TCM premiere: July 6, 2015). Available in both VHS and DVD in black and white or \"colorized\" formats, the most complete copy for CURLY TOP (77 minutes) happens to be from its 1988 VHS copy distributed by Playhouse Video that even goes as far as including the exit music to the title song in blank screen following the closing casting credits.\n\nCURLY TOP may not be reality, but it sure serves its purpose as a happy kind of movie for everyone and anyone to enjoy, thanks to those who've made it all possible, the staff, supporting players, and most of all, \"Curly Top\" herself. (***)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Clip: Animal crackers in my soup",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi27263257",
        "name": "Curly Top",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTAxNjQ4NzktNTc3MC00MTZhLWIxZGItMWZkNTIyNDQ0OGRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTAxNjQ4NzktNTc3MC00MTZhLWIxZGItMWZkNTIyNDQ0OGRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:42:59Z",
        "url": "https://www.imdb.com/video/vi27263257/"
    },
    "url": "/title/tt0026252/"
}