{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Berenger",
            "url": "/name/nm0000297/"
        },
        {
            "@type": "Person",
            "name": "Stephen Baldwin",
            "url": "/name/nm0000286/"
        },
        {
            "@type": "Person",
            "name": "Dennis Rodman",
            "url": "/name/nm0005379/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1712,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021910/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012937/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0258286/"
        },
        {
            "@type": "Person",
            "name": "Tony Griffin",
            "url": "/name/nm0341389/"
        },
        {
            "@type": "Person",
            "name": "Greg Manos",
            "url": "/name/nm0543618/"
        },
        {
            "@type": "Person",
            "name": "Guy Manos",
            "url": "/name/nm0543619/"
        }
    ],
    "datePublished": "2000-10-03",
    "description": "A Drug Enforcement Agent (Baldwin) goes undercover on a sky diving team to track down illegal drugs.",
    "director": [
        {
            "@type": "Person",
            "name": "Guy Manos",
            "url": "/name/nm0543619/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Action",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTgxZWVkZmUtM2ZhNC00OGZlLWEyNmQtZjQ3MWJkOTI2Njk2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "female rear nudity,die hard scenario,airplane,parachute,skydiving",
    "name": "Cutaway",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pquade"
        },
        "dateCreated": "2001-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0211792/"
        },
        "name": "Guy Manos' \"Director's Comments\" about \"Cutaway\" on DVD.",
        "reviewBody": "Manos walks an interesting line between hype and facts all through the commentary. He stresses that Stephen Baldwin (Agent Vic Cooper) and Tom Berenger (Red Line) did their own stunts and without actually saying \"all their own stunts\", certainly implies it. Clearly that's not the case. He also implies that Dennis Rodman (Turbo) does his own stunts as well, but from what I understand from other sources, Rodman never even got near a plane in flight.\n\nManos does admit that he did -some- of the stunts for Red Line when Berenger was \"unavailable.\" Manos' wife, Pam, does the skydiving for Maxine Bahns (Star), the female lead. Manos never fesses up as to who does the more advanced skydiving scenes (head down, swoop pond, ect.) for Baldwin. With the exception of Casper Van Dien (Delmira), those really are the Golden Knights and that's the wind tunnel at Fort Bragg, SC.\n\nThere are a couple of interesting factoids sprinkled throughout the commentary such as how so and so shot was done, how some of the action sequences were performed and that Marcos A. Ferraez (Ground Rush) was actually a skydiving buddy of Baldwin's before production was even given the green light. However, the really interesting stuff to me was how the script was developed and how some of the scenes and events were based upon Manos' true life experiences. I got the feeling that maybe at some point Manos actually had considered the tandem drug running scheme and he does mention that it had been done a couple of times maybe ten or so years ago to actually help finance a Nationals team.\n\nI'm not sure where fact and hype merge here.\n\nManos does explain things about keeping the story, costumes and sport simple enough for the audience to understand yet \"real\", but he never explains his choice of the \"8-way speed star\" event. I'm thinking just 2 more people would have made that a lot more \"real\", but there was probably a budget consideration (23 shooting days x 2 people, costumes, hotel rooms, catering, pack jobs, ect.).\n\nTo my surprise, there are ALSO comments on yet another audio track from Baldwin and Bahns. I haven't yet fully listened to those, but it's clear from the sample I did listen to that they must have been having a -really- good time, maybe even a little tipsy (maybe a LOT tipsy), when they recorded them. I'll have to fully listen to those in the near future.\n\nPaul"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT2M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi664797465",
        "name": "Cutaway",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjJmNTE0ZjAtNWYxOC00MjY2LTliMzgtMzZmYjk3MWNlODY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjJmNTE0ZjAtNWYxOC00MjY2LTliMzgtMzZmYjk3MWNlODY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:43:37Z",
        "url": "https://www.imdb.com/video/vi664797465/"
    },
    "url": "/title/tt0211792/"
}