{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Damian Chapa",
            "url": "/name/nm0152082/"
        },
        {
            "@type": "Person",
            "name": "Ashley Laurence",
            "url": "/name/nm0491090/"
        },
        {
            "@type": "Person",
            "name": "Rod Steiger",
            "url": "/name/nm0001768/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 168,
        "ratingValue": 3.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028899/"
        },
        {
            "@type": "Person",
            "name": "Serge Rodnunsky",
            "url": "/name/nm0271084/"
        }
    ],
    "datePublished": "2001-06-19",
    "description": "Reeling from the news of his sister's suicide, Beau McCammon returns home to his family after a long absence. His father, who has just barely won another term as senator, doesn't take things well when Beau approaches him with the ...",
    "director": [
        {
            "@type": "Person",
            "name": "Serge Rodnunsky",
            "url": "/name/nm0271084/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODk5ZDkxMmMtZDg2Ny00MDFlLWIzYzgtMzEzODM4N2I1NDg2XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "fbi federal bureau of investigation,senator,murder,inflatable boat,wheelchair",
    "name": "Cypress Edge",
    "original_info": {
        "id": "Cypress Edge_1999",
        "name": "Cypress Edge",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Jennel2"
        },
        "dateCreated": "2002-08-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0186014/"
        },
        "name": "Hack Work",
        "reviewBody": "I'm glad to see this wasn't Rod Steiger's last film, as this piece of dreck would be a horrible memorial for anyone. Steiger is the only reason I rented it. I should have known better, as I've seen writer/director Serge Rodnunsky's name on numerous B movie video sleeves, all of which (you can tell just by looking at them) are junk. Besides Steiger this alleged thriller wastes the talents of Brad Dourif and Charles Napier, both capable character actors. Rodnunsky's half-baked script does them all in, as does the poor continuity and shaky camera work. It's a shame, as the story, while trite, could have been given a fresh treatment by a writer with some real talent. Instead we get disjointed scenes of street revelers randomly intercut with supposed action scenes (generally bad chase scenes, by boat, car and on foot). The New Orleans locations look great (when the cameraman isn't attempting to imitate an episode of the old \"Homicide: Life on the Streets\" TV series). But the endless, boring conversations between the protagonist, Bo, and his girlfriend (whom he left waiting at the altar after his mom committed suicide) are excruciating. Steiger seems to have been either given no direction or ignored it, as his scenes consist of trite speeches about being innocent, interrupted by senseless screaming. Brad Dourif is generally reliable as a villain, but his part here is so underwritten there's nothing he can do except try to look menacing. And, although there are a number of awful \"performances\" in this piece of tripe, the award for worst acting has to go Ashley Lawrence as the protagonist's girlfriend (an assistant DA in one of the most crime ridden cities in America, who, nonetheless, doesn't seem to have a single case to work on). Lawrence's performance reminded me of those obligatory \"serious scenes\" in porn movies between the sex acts."
    },
    "url": "/title/tt0186014/"
}