{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alec Guinness",
            "url": "/name/nm0000027/"
        },
        {
            "@type": "Person",
            "name": "Dirk Bogarde",
            "url": "/name/nm0001958/"
        },
        {
            "@type": "Person",
            "name": "Maurice Denham",
            "url": "/name/nm0219062/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2721,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Damn the Defiant!",
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142272/"
        },
        {
            "@type": "Person",
            "name": "Nigel Kneale",
            "url": "/name/nm0460600/"
        },
        {
            "@type": "Person",
            "name": "Edmund H. North",
            "url": "/name/nm0636002/"
        },
        {
            "@type": "Person",
            "name": "Frank Tilsley",
            "url": "/name/nm0863478/"
        }
    ],
    "datePublished": "1962-04-15",
    "description": "On the H.M.S. Defiant, during the French Revolutionary War, fair Captain Crawford is locked in a battle of wills against his cruel second-in-command Lieutenant Scott-Padget, whose heavy-handed command style pushes the crew to mutiny.",
    "director": [
        {
            "@type": "Person",
            "name": "Lewis Gilbert",
            "url": "/name/nm0318150/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Action",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY0Y2ZmMTgtODFhMi00ZmRhLTkwZGMtMzI1ZDA1OTAxMjg5L2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "napoleonic wars,navy,mutiny,press gang,british navy",
    "name": "H.M.S. Defiant",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2005-10-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055884/"
        },
        "name": "\"A Future Drake or Hawkins, hmmmmm?\"",
        "reviewBody": "I remember seeing H.M.S. Defiant in the theater when it came out back in 1962. It's too bad my VHS copy is formatted. One really needs the wide screen to appreciate the vast sweep of this wonderful sea adventure.\n\nThe Defiant sets sail from the naval harbor at Spithead just before the ships of the Channel Fleet are ready to start an organized mutiny. So with no contact between them and the ships at Spithead or in the Mediterranean, the men of the Defiant have to work out their own course of action. That action is the basis for what happens.\n\nThey've got an unwitting ally in the ship's executive officer, Scott- Padget played by Dirk Bogarde. A future Drake or Hawkins with influence and a taste for sadism. He looks to usurp the authority of Captain Crawford who is played by Alec Guinness. The conflict between them plays into the hands of the mutineers.\n\nIn that other famous story of the sea, Mutiny on the Bounty, Fletcher Christian points out to Captain Bligh that the men drafted into the Royal Navy from the press gangs aren't king and country volunteers. Neither are these people in the foc'sle of the Defiant.\n\nBogarde plays against type and does it well. He's usually not a villain in film although he had essayed villainous roles before in his career. But Guinness is a wonder. His Captain Crawford, calm, detached, and inspiring in his own way in his patriotism was a role Alec Guinness could be proud of. Totally different than the characters he played in those Ealing studio comedies. This falls more in line with Colonel Nicholson in The Bridge on the River Kwai or Colonel Sinclair in Tunes of Glory without the bad character features the other two had. \n\nGreat Britain eventually stopped using press gangs, but at the time it was the way the Royal Navy got a crew together. In fact later on during the Napoleonic Wars, the British took to stopping American ships and impressing members of those crews in the Royal Navy. It was one of the causes of the War of 1812.\n\nTwo other performances in H.M.S. Defiant are worthy of note. Anthony Quayle as the mutiny leader on the Defiant and Tom Bell one of the mutineers whose rashness nearly blows it all for the seamen and their cause.\n\nHovering over all of this is the French and to me the highlight of the film is Alec Guinness reminding the men of their duty to prevent a French invasion of their island home. It's a superb piece of drama.\n\nA little Mutiny on the Bounty, a little Horatio Hornblower go into the plot of H.M.S. Defiant. It's a good mix with a superb group of players serving it up for the audience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT3M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3808083737",
        "name": "Damn the Defiant!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjNjYTViNzktNWI2Ny00OWNkLWExNmQtNWIzZmYzOTg0MTk4XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjNjYTViNzktNWI2Ny00OWNkLWExNmQtNWIzZmYzOTg0MTk4XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-10-17T17:05:42.093Z",
        "url": "https://www.imdb.com/video/vi3808083737/"
    },
    "url": "/title/tt0055884/"
}