{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Meryl Streep",
            "url": "/name/nm0000658/"
        },
        {
            "@type": "Person",
            "name": "Michael Gambon",
            "url": "/name/nm0002091/"
        },
        {
            "@type": "Person",
            "name": "Gerard McSorley",
            "url": "/name/nm0574561/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3875,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018776/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060324/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Person",
            "name": "Brian Friel",
            "url": "/name/nm0295486/"
        },
        {
            "@type": "Person",
            "name": "Frank McGuinness",
            "url": "/name/nm0570128/"
        },
        {
            "@type": "Person",
            "name": "William Butler Yeats",
            "url": "/name/nm0947102/"
        }
    ],
    "datePublished": "1998-11-13",
    "description": "Five unmarried sisters make the most of their simple existence in rural Ireland in the 1930s.",
    "director": [
        {
            "@type": "Person",
            "name": "Pat O'Connor",
            "url": "/name/nm0640466/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODM3MTU4ZjYtMGI4Zi00MWFmLTg4MWUtN2FiMjRjNDFjMTEyXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "timeframe 1930s,boy,1930s,ireland,time",
    "name": "Dancing at Lughnasa",
    "original_info": {
        "id": "Dancing at Lughnasa_1998",
        "name": "Dancing at Lughnasa",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Harvey"
        },
        "dateCreated": "1998-09-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120643/"
        },
        "name": "Irish Stage, Irish Screen: An unhappy marriage",
        "reviewBody": "Watchable but instantly forgettable film of Brian Friel's award-winning play which provides its greatest pleasures through the strong performances of its ensemble cast. Five independent-minded sisters living in Donegal in the mid 1930s face the possibility of change when economic and emotional circumstances conspire against them. The return of their brother from religious missions in Africa signals the beginning, and as the pagan festival of Lughnasa, which celebrates the harvest and forebodes the coming of winter, is celebrated around them, they must come to terms with changes in their own relatively comfortable middle class world. The ten year old son of one of them views events with a nostalgic eye which nonetheless sees the hardship and heartbreak which occurs around him.\n\nDespite director Pat O'Connor's valiant attempts to open out' the play, the film is still extremely theatrical. The inclusion of landscape shots and the restaging of certain scenes in outdoor locations unavailable in the theatre does not really make the film cinematic. It merely adds visuals to what is still a complex series of linguistic exchanges which delineate and explore character. Authentic production design and costuming and the persistent presence of a traditional-themed score by Bill Whelan contribute to the feeling of the film, and with the help of good accent work by the cast, it manages to successfully evoke a feeling of time and place. However it remains an extremely well produced stage play on film, and is still bound by blocking and staging conventions which allow the actors to meet and greet one another to exchange their thoughts and feelings. The closest the film comes to a visual symbolic system is the use of dance and ritual to underscore the social and emotional tensions. The undercurrent of paganism which defines the relationships between people and their sense of the cosmos is constantly evoked (as it was in the play), and the film begins with a credit sequence featuring images of African tribes people in traditional costumes. But other than the climactic dance scene where the sisters celebrate their sisterhood to the strains of ceili music, the film rarely manages to escape the enclosed and cerebral world of the stage version.\n\nBut paradoxically, the reliance on actors plying their trade on well written words (rather than visuals) is the thing which saves the film from itself. Meryl Streep gives a convincing performance (and manages a creditable accent) as the repressed, authoritarian schoolteacher who heads the female clan, and she is more than matched by Michael Gambon's endearing performance as the slightly baffled priest whose exposure to the customs and rituals of Africa have coloured his perceptions of home. The rest of the cast (the non-stars, so to speak) are equally good, particularly Sophie Thompson as the simple minded Rose and Kathy Burke as the chain smoking Maggie. Catherine McCormack and Brid Brennan (the latter a veteran of the Abbey Theatre production) have less showy roles, but work distinctive characterisations in with those of the others with ease and skill. Supporting male performances from Rhys Ifans and young Darrell Johnston are also good, and the film also comes with a rich voice over provided by Gerard McSorley (who played the part of the the child at an adult remembering in the stage version).\n\nThis aspect of the film alone is probably worth the time and attention required to view it, but on the whole it is a less rewarding experience than the play itself. While an unfair basis upon which to criticise a work of adaptation, the material was perhaps fundamentally unsuited to cinematic treatment. Though Frank McGuinness has done his best to translate the themes and character issues, and has successfully done so insofar as it applies to theme and character, this is not so much a film version as a film of the play with some additional settings and scenes which prevent it from becoming completely unwatchable. What power it has comes from the power of the play, and it is mostly evinced at the level of verbal discourse. Theatrical adaptation is a minefield for film makers and has produced varying results in the past. Dancing at Lughnasa does not distinguish itself in the annals of this sub-section of film history, but for those patient enough with its lack of genuine cinematic interest, it offers certain pleasures which should pass the time painlessly enough."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1721762073",
        "name": "Dancing At Lughnasa",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzQ0NzcwMDYtNzY0NS00NjRjLTkyZTQtOGIwNjRlMDViZmExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzQ0NzcwMDYtNzY0NS00NjRjLTkyZTQtOGIwNjRlMDViZmExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:44:35Z",
        "url": "https://www.imdb.com/video/vi1721762073/"
    },
    "url": "/title/tt0120643/"
}