{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlotte Ayanna",
            "url": "/name/nm0043662/"
        },
        {
            "@type": "Person",
            "name": "Daryl Hannah",
            "url": "/name/nm0000435/"
        },
        {
            "@type": "Person",
            "name": "Kristin Bauer van Straten",
            "url": "/name/nm0061877/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4031,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023327/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077650/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130502/"
        },
        {
            "@type": "Person",
            "name": "Michael Radford",
            "url": "/name/nm0705535/"
        },
        {
            "@type": "Person",
            "name": "David Linter",
            "url": "/name/nm0513197/"
        }
    ],
    "datePublished": "2001-10-11",
    "description": "A non-glamorous portrayal of the lives of people who make their living at a strip club.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Radford",
            "url": "/name/nm0705535/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTU4NWUzYzktNzAzNi00YjIxLTkzNmEtN2RlNDQ2OTRhMmEzXkEyXkFqcGdeQXVyMTQ4NDY5OTc@._V1_.jpg",
    "keywords": "incest,pregnancy,strip club,panties,brother sister incest",
    "name": "Dancing at the Blue Iguana",
    "original_info": {
        "id": "Dancing at the Blue Iguana_2001",
        "name": "Dancing at the Blue Iguana",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lambiepie-2"
        },
        "dateCreated": "2002-12-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0217355/"
        },
        "name": "Improv at its best!",
        "reviewBody": "It is my understanding that the most of this project was done via improvisation which would explain for its peaks and drops. I would imagine that filming a project based on improv is difficult but at times this cast of actors make it look scripted. At best, Jennifer Tilly shows one how its done, at worse, you wish Darryl Hannah had a script.\n\nHere you are presented a few days in the lives of your regular ordinary everyday working strippers/dance gals at a club that is..where else but the Los Angeles San Fernando Valley. You get it all, the drugs, the cat fights, the sex and the overall portrayal that its just a job, a job that is like any other with all the same problems. The five main characters do it well. Jennifer Tilly is the best, Sandra Oh runs a very close second. I was a tad disappointed in Shelia Kelley's character, but Shelia did great with what she had to work with, and I felt the same with little Charolotte Ayanna's character portrayal as well. But Darryl Hannah, who's character was pretty developed more than all the others was pretty sad to watch under this method of outlined improv. The owners of the club were good as well with what they were handed, I just wish I could have known more about them and what made them tick to be at this club. One of the best scenes that makes this kind of dramatic acting inprov filming/work come together is the end with the stripper/writer character played by Sandra Oh and the overglorified porno star who danced for the evening played by Kristin Bauer.\n\nThis film had a few small holes here and there to me, but I really enjoyed watching the actresses and actors work with this kind of project on this kind of level..and if you watch some scenes real close, you can see that a few of the actresses and actors were surprised at the lines coming out of other actresses mouths which is what I believe this project was all about. Only on that level, I grant this film of a peek into the lives of these women -- as an overall success and I hope that other film makers explore the genre. It's brings alot of realism in a fictional background.\n\nA must see for anyone studying acting, a rare kinda find for us the regular film viewer, and for those who want to turn in to their cable sets in the middle of the night and watch a bunch of girls strip and dance -- well, that's there too, but Michael Radford lets you know, that is not what is important.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A non-glamorous portrayal of the lives of people who make their living at a strip club.",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi983286553",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDZiZTIyYzAtZTU3YS00ZTMxLWEyNzYtZDI0ZDc0YzZlMmFlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDZiZTIyYzAtZTU3YS00ZTMxLWEyNzYtZDI0ZDc0YzZlMmFlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-11T19:52:10.373Z",
        "url": "https://www.imdb.com/video/vi983286553/"
    },
    "url": "/title/tt0217355/"
}