{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Björk",
            "url": "/name/nm0001951/"
        },
        {
            "@type": "Person",
            "name": "Catherine Deneuve",
            "url": "/name/nm0000366/"
        },
        {
            "@type": "Person",
            "name": "David Morse",
            "url": "/name/nm0001556/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 112263,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136662/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035409/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001935/"
        },
        {
            "@type": "Person",
            "name": "Lars von Trier",
            "url": "/name/nm0001885/"
        },
        {
            "@type": "Person",
            "name": "Sjón",
            "url": "/name/nm0797604/"
        }
    ],
    "datePublished": "2000-10-06",
    "description": "An Eastern European US immigrant with a love for musicals has to cope with the gradual loss of her vision.",
    "director": [
        {
            "@type": "Person",
            "name": "Lars von Trier",
            "url": "/name/nm0001885/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Crime",
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDVkYWMxNWEtNjc2MC00OGI5LWI3NmUtYWUwNDQyOTc3YmY5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "singing,factory,czech immigrant,tragedy,blindness",
    "name": "Dancer in the Dark",
    "original_info": {
        "id": "Dancer in the Dark_2000",
        "name": "Dancer in the Dark",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbrumburgh"
        },
        "dateCreated": "2001-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0168629/"
        },
        "name": "Odd, bleak, but ultimately transfixing musical drama, pop singer Björk immerses herself completely in this tailor-made role.",
        "reviewBody": "The reviews were extremely black and white for this art-house film. People were either enthralled or bored to tears by the whole experience. There seemed to be no middle ground. Now, that's my kind of movie. Any picture that can reap awards (Cannes Film Festival) and get lambasted by the general public at the same time will always pique my interest. In respect, it was a rich, rewarding odyssey, much easier to get through than, let's say, even half of \"8½.\" \n\nMy initial respect for the unique, uncompromising style of Danish director Lars von Trier goes back to his compelling work in \"Zentropa\" and \"Breaking the Waves,\" both bleak, surrealistic studies of man vs. reality. His pieces usually center around some innocent, simple-minded, self-sacrificing soul who inevitably succumbs to the cruelties of life.\n\nI found the central role of Selma (as played by the extraordinary Björk) to be very much the emotional equivalent of Emily Watson's touchingly childlike, near-sociopath Bess in \"Breaking the Waves\" -- blessed and cursed with a naive, soulful purity. Selma represents one of God's little quirks of nature. A bespectacled, pathetically infantile little ragamuffin completely out of touch, Selma has somehow survived like the runt of a litter would - through luck, will power, and the extreme kindness of those around her. An impoverished Czech-born emigré living in a small Northwestern U.S. industrial town during the mid-60s, this luckless creature manages to eek out a meager Airstream-like existence as a factory worker, despite the fact she is legally blind.\n\nSelma is, amazingly enough, a mother. Seemingly ill-equipped to care for a child much less herself, she has nevertheless managed to provide for the 12-year-old boy, while nurturing the child as a young girl would her rag doll. The fairly adjusted boy suffers, however, from the same optic disease as the mother, while the crux of the story revolves around her attempts to save up money for his inevitable operation. \n\nThe fascination of \"Dancer in the Dark\" lies in Selma's musical world. With her eyesight failing, her ears become the only sense of joy, falling periodically into bouts of fantasy anytime she grabs onto a rhythm or beat (like machine sounds, train engines, etc.), wherein she becomes the star of her own working-class musical production. These compelling sequences become mere extensions of her real-life circumstances, i.e., the musical interludes at work will include the factory itself as a set piece and the other workers as her ensemble. A strange mix of Fellini neo-realism and Busby Berkeley illusion, these daydreams (sparked by Vincent Paterson's inventive choreography and von Trier's purposely puerile lyrics) become her only escape. Björk's odd musical talent and vocal style may be an acquired taste, but she is so mesmerizing here it becomes a non-issue. In addition, there are brief moments of levity as a hopelessly inept community theater production of \"The Sound of Music\" goes into rehearsals with the very awkward Selma playing Maria.\n\nThe subordinate cast is equally in tune. The wonderful, beguiling French star Catherine Deneuve downplays her ethereal beauty as Kathy, Selma's co-worker and trusted friend. And a strange, maternalistic friendship it is indeed, for this woman seems to have no other purpose in life than to be this girl's eyes and hands, looking out for her practically day and night. Peter (\"Fargo\") Stormare shies away from his ruthless killer image with this touching portrayal of a sensitive, almost pitiable boor who only has eyes for the ungainly Selma. David Morse is gripping as a seemingly compassionate but despairing policeman whose one desperate act involving neighbor Selma results in tragedy. Joel Grey has a brief, telling moment near the film's end as a faded musical star idolized by Selma.\n\nAs in his other featured works, von Trier's gritty, hand-held camera work may be dizzying to the point of distraction at first but its overall impact to the stark proceedings is unquestionable. Moreover, the grueling paces he puts his actresses through to achieve absolute truth borders on misogyny but the rewards are tenfold. As in the case of Emily Watson, Björk has never shined brighter as an artist.\n\nA harrowing, refreshingly original piece of filmmaking that should be experienced by anybody who dares to be different.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3164602649",
        "name": "Dancer in the Dark",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGY4YWVjZTEtMWU4Ny00ZGI2LThjNmYtMTA0YTc1OWNjMDhkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGY4YWVjZTEtMWU4Ny00ZGI2LThjNmYtMTA0YTc1OWNjMDhkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:45:07Z",
        "url": "https://www.imdb.com/video/vi3164602649/"
    },
    "url": "/title/tt0168629/"
}