{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Anthony Andrews",
            "url": "/name/nm0000762/"
        },
        {
            "@type": "Person",
            "name": "Maurice Roëves",
            "url": "/name/nm0747687/"
        },
        {
            "@type": "Person",
            "name": "George Innes",
            "url": "/name/nm0409171/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 992,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103398/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103342/"
        },
        {
            "@type": "Person",
            "name": "John Hawkesworth",
            "url": "/name/nm0370058/"
        },
        {
            "@type": "Person",
            "name": "John Whitney",
            "url": "/name/nm0926315/"
        }
    ],
    "datePublished": "1981-01-04",
    "description": "The series chronicles the exploits of the fictional Royal Engineer Tunnelling Company 97, which has been made a bomb disposal unit to deal with the thousands of unexploded bombs (\"UXBs\") in London during the Battle of Britain.",
    "genre": [
        "Action",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWUyNmY5ZTUtYzE1NC00ZGE2LWI5ZjYtZDc3ZjQ3YzI0MjJjXkEyXkFqcGdeQXVyNjg1NzcwODE@._V1_.jpg",
    "keywords": "world war two,bomb disposal,bomb disposal unit,tv series,british history",
    "name": "Danger UXB",
    "original_info": {
        "id": "Danger UXB_1979",
        "name": "Danger UXB",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dixie-8"
        },
        "dateCreated": "1999-02-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078593/"
        },
        "name": "Realistic & human and will keep you on the edge of your seat",
        "reviewBody": "This is an outstanding story of a British EOD (Explosive Ordnance Disposal) Detachment during World War II. The ordnance depicted along with the fusing used was actually used by the Germans during WWII. The methods used in the show are the actual (in some cases, trial and error) procedures used to defeat the ordnance during WWII.\n\nThe RSP (render safe procedures) used today for foreign ordnance is usually classified. The main reason for this is so the enemy doesn't know that you can defeat his weapons. The British, during WWII, initially published that they defeated certain German ordnance and the RSP used as a morale booster for the citizens. The Germans, reading these accounts, then designed some of the fuses with booby traps specifically designed to kill the British EOD soldiers while they were working on the UXBs if they followed the published procedures.\n\nDuring WWII, the US Army EOD was modeled after the British detachments. Initially, the US turned to the British for training and help in getting our own EOD units established.\n\nOne of my greatest joys from this series was the fact that I had taped it the first time I watched and then got to watch it over again with a close friend. The significance of this was: 1) I was US Army EOD, and 2) the close friend was a British EOD tech who had been awarded the George's Medal for his EOD work in Northern Ireland. To show what a tight knit group EOD personnel are - we still stay in touch with one another via the Internet after 26 years (we watched the show together in 1983)."
    },
    "url": "/title/tt0078593/"
}