{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Phillip Law",
            "url": "/name/nm0492342/"
        },
        {
            "@type": "Person",
            "name": "Marisa Mell",
            "url": "/name/nm0577867/"
        },
        {
            "@type": "Person",
            "name": "Michel Piccoli",
            "url": "/name/nm0681566/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6856,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Danger: Diabolik",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032861/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012478/"
        },
        {
            "@type": "Person",
            "name": "Angela Giussani",
            "url": "/name/nm0321380/"
        },
        {
            "@type": "Person",
            "name": "Luciana Giussani",
            "url": "/name/nm0321383/"
        },
        {
            "@type": "Person",
            "name": "Dino Maiuri",
            "url": "/name/nm0537985/"
        }
    ],
    "description": "A master thief and his sensual lover pull off heist after heist, all while envious cops and gangsters are gunning for them.",
    "director": [
        {
            "@type": "Person",
            "name": "Mario Bava",
            "url": "/name/nm0000878/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzA1ZjRlMGYtYmM4ZS00YWVjLThhODMtMmZlZjFjYWYxOWRiXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "female nudity,death penalty,underground base,jaguar e type,crime syndicate",
    "name": "Diabolik",
    "original_info": {
        "id": "Danger: Diabolik_1968",
        "name": "Danger: Diabolik",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Infofreak"
        },
        "dateCreated": "2004-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062861/"
        },
        "name": "If you enjoy 60s pop culture, comic books, Pop Art, psychedelia, trash and the Bond and Flint movies then don't miss 'Diabolik'!",
        "reviewBody": "A quick glance at the user comments for 'Diabolik' will show that it is a movie which divides people to say the least. Some misguided fools and the asinine Mystery Science Theatre 3000 gang (who actually screened an edited version of the movie when they parodied it in their last episode) think it is one of the worst movies ever made. I pity them. The rest of us (including Mike Myers and The Beastie Boys - see their \"Body Movin'\" video for an affectionate homage) love it as one of the best examples of 1960s Pop Art kitsch. 'Modesty Blaise' was I think the first of the 60s European comic book adaptations in this style, followed closely by 'Barbarella' and then 'Diabolik'. Later in the early 70s there was 'Baba Yaga', the last gasp for this short lived genre. Too bad, because I just can't get enough of this stuff! 'Diabolik's director Mario Bava is a horror legend largely because of brilliant movies like 'Black Sunday' and 'Kill, Baby... Kill!' but he was in fact very versatile, not just making Gothic horror classics, but also science fiction, westerns, Hercules movies and hard boiled crime thrillers. And then there's 'Diabolik', something else again. John Phillip Law, who played the blind angel Pygar in 'Barbarella', as well as appearing in cult favourites like 'Death Rides A Horse' and 'Open Season', is perfectly cast as Diabolik. Many criticize Law's performance, which is admittedly pretty wooden, but I didn't have a problem with it. He suits the material, which let's face it, isn't exactly Shakespeare. Marisa Mell ('Mad Dog') plays Diabolik's beautiful partner in crime Eva Kant, Bunuel regular Michel Piccoli ('Belle De Jour', 'La Grande Bouffe') is Diabolik's nemesis Inspector Ginko, Adolfo Celi ('Thunderball', 'That Man From Rio') plays Valmont, a rival criminal mastermind, and Terry-Thomas ('I'm All Right Jack', The Abominable Dr Phibes') is the Minister Of Finance. Bava was working with quite a small budget (less than half a million US dollars - for comparison 'You Only Live Twice' cost nine MILLION more!) but achieved wonders, a testament to his skill and creativity. It's a very stylish movie with some wonderfully inventive visuals, especially Diabolik's cave which is very impressive considering the lack of money you'd generally expect for this kind of movie. Added to that a fantastic score from Morricone, which many fans believe is one of his very best, if not THE best. If you want to see one of the inspirations for the Austin Powers series, especially if you enjoy 60s pop culture, comic books, Pop Art, psychedelia, trash and the Bond and Flint movies then don't miss 'Diabolik'. The rest of you can wait until 'Bad Boys 3' or whatever drivel you think is a good, fun popcorn movie. In my opinion, anyone who slams this movie is beyond redemption!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3786457369",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjk3NDM2MTMtNGQ3Yy00MTNiLWI2OTctNzRhMDg1MzQzNGRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjk3NDM2MTMtNGQ3Yy00MTNiLWI2OTctNzRhMDg1MzQzNGRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-31T18:24:12.686Z",
        "url": "https://www.imdb.com/video/vi3786457369/"
    },
    "url": "/title/tt0062861/"
}