{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michel Piccoli",
            "url": "/name/nm0681566/"
        },
        {
            "@type": "Person",
            "name": "Alexandre Arbatt",
            "url": "/name/nm0033329/"
        },
        {
            "@type": "Person",
            "name": "Liv Ullmann",
            "url": "/name/nm0880521/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1371,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Dangerous Moves",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042440/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0125465/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0247664/"
        },
        {
            "@type": "Person",
            "name": "Richard Dembo",
            "url": "/name/nm0218252/"
        }
    ],
    "datePublished": "1985-05-24",
    "description": "During the Cold War, the World Chess Championship clashed complete opposites - personal and political.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Dembo",
            "url": "/name/nm0218252/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Sport",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgwMDU4Nzg4Ml5BMl5BanBnXkFtZTcwMzc0MDAwMQ@@._V1_.jpg",
    "keywords": "chess,jew,escape,communism,communist",
    "name": "La diagonale du fou",
    "original_info": {
        "id": "Dangerous Moves_1984",
        "name": "Dangerous Moves",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AndrePhilidor"
        },
        "dateCreated": "2003-08-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087144/"
        },
        "name": "A major disappointment!",
        "reviewBody": "A well filmed movie of the tense contest for the World Championship between Soviet player Akiva Liebeskind (undoubtedly modeled after International Grandmaster Akiba Rubenstein, a magnificent master of the endgame, originally a rabbinical student in Poland who never quite made it to the World Championship level and declined into mental illness), and Liebeskind's challenger, Grandmaster Pavius Fromm (almost certainly named after \"From\" of the From's Gambit in chess). Fromm, a Lithuanian political exile from behind the Iron Curtain, is an arrogant dislikeable pawn of the Soviets who have kept his wife prisoner. Virtually unrecognizable are their wives, the once lovely Leslie Caron and Swedish star Liv Ullman who have little more than bit parts.\n\nPersonally, as a chessplayer who has been struggling to find the secret of chess for almost 30 years, it was made clear that Grandmasters of chess see farther than us ordinary mortals when Liebeskind analyzes his strategy to win the next game with the final coup by moving a Rook to the square G10! (The chessboard has only 8x8 squares.) Many incidents from the real history of chess are keyed into the script. When analyzing a game with his team, he objects to a player putting a cigarette to his mouth. \"But it is not lit!\" his friend replies. \"Yes,\" says Liebeskind, \"but it is well known that in chess the threat is greater than the execution\". A quote right from Emmanuel Lasker, World Champion for 27 years. And this actualy occurred in a top level chess match when a player put an unlit cigar in his mouth, and his opponent protested.\n\nWhen each player's team brings in a parapsychologist to stare down or even hypnotize his the opponent, there are vigorous protests. Exactly what happened in a match in Baguio City, the Phillipines when World Champion Anatoly Karpov's team brought parapsychologist Dr. Zharkov from Moscow to stare down the challenger, dissident and escapee from the Soviet Union, Viktor Korchnoi. (Korchnoi lost the match.)\n\nIn the end, I found the script of this move poorly written, disappointing in the ending, well acted and portraying the world of chess and a World Championship contest reasonably well. One jarring note was the large number and rows of empty seats in the auditorium where the World Championship was being played. In the real world, every seat would have been taken and overflow audiences would have been in auxiliary rooms watching on TV with commentary from other GM's unheard by the players. Did the producers just try to save a few pennies but not hiring enough extras to fill the seats? Hard to understand when clearly this was an expensive and lavish film portrayal of a World Chess Championship.\n\nAlmost a good movie. As a long time chessplayer, I am glad I watched it. I cannot recommend it as worthwhile for general audiences."
    },
    "url": "/title/tt0087144/"
}