{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harvey Keitel",
            "url": "/name/nm0000172/"
        },
        {
            "@type": "Person",
            "name": "Madonna",
            "url": "/name/nm0000187/"
        },
        {
            "@type": "Person",
            "name": "James Russo",
            "url": "/name/nm0751638/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3996,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "Dangerous Game",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016102/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003832/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037724/"
        },
        {
            "@type": "Person",
            "name": "Nicholas St. John",
            "url": "/name/nm0820669/"
        }
    ],
    "datePublished": "1993-11-19",
    "description": "A New York City film director working on his latest movie in Los Angeles begins to reflect the actions in his movie and real life, especially when he begins an affair with the lead actress.",
    "director": [
        {
            "@type": "Person",
            "name": "Abel Ferrara",
            "url": "/name/nm0001206/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzg1ZjgxNDAtNmVmZC00ODM2LWEyY2EtMzk2ODU2MThhMDgxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "film director,filmmaker,actor,actress,psychological abuse",
    "name": "Snake Eyes",
    "original_info": {
        "id": "Dangerous Game_1993",
        "name": "Dangerous Game",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2007-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106660/"
        },
        "name": "it's a difficult and flawed film, but it has some very strong merits in the Ferrara vein",
        "reviewBody": "As a follow-up to Bad Lieutenant, which could be a possibility for director Abel Ferrara's best work to date (or at least most thought provoking), Dangerous Game aims for lower targets while trying for a similar approach to the dregs of a character's soul. Once again Harvey Keitel is the doomed figure, a man with such a self-destructive impulse that it'll lead him to nowhere decent. But this time he's not a cop on completely the edge of society and self, but a movie director who is making a film with such high-intensity, raw emotional drama that it would make John Cassavetes wince. The main actors in Eddie's movie (Keitel) are Sara (Madonna) and Francis (James Russo) become victim to that old tune of art imitating life, or vice versa (as the chicken came from the egg and back again sort of thing) that starts to make the film within Dangerous Game a very volatile situation. All the while Eddie's demands on his actors involve spiritual death via drugs and alcohol and mutual decay towards one another, an abusive relationship where the sexual games have gone sour and all that's left is remorse and contempt depending on the beat. Soon this seeps out for real, as Francis can't distinguish from acting or reality, and a rape scene within the movie becomes all too real on the set. And, of course, this leads further for Eddie's own path of horror.\n\nUnlike Ferrara's previous film, this time Keitel's character doesn't have that possibility for redemption- in Hollywood, in search of the most brutally honest picture, Eddie Israel won't stop until he practically gets what he's got bottled up inside right onto screen, no matter what it does to his actors whom he professes to enjoy and be friendly with (and with Sara more-so). He indulges in drink and more importantly women via the movie business, while still keeping up appearances with his wife (Nancy Ferrara) and little boy. So with this lack of Eddie meeting towards any kind of possible sign of hope- and keep in mind the Herzog clip from Burden of Dreams- it's almost despair for despair's sake. And watching the scenes being filmed by the actors(The Mother of the Mirrors), though not totally awful, I'm reminded of the old Gene Siskel line about the actors eating lunch being more interesting than the movie itself. Still with these flaws noticed, not to mention a very strange ending that leaves off the character's in some kind of demise either real or filmic (maybe it's the point), it's still a good film, or rather a film that defies its own experimental boundaries to be always fascinating, if only to a film buff like myself.\n\nI liked individual scenes very much, like one where Keitel's character directs Madonna's Sara into delivering lines to the camera believably by insulting her as a 'commercial whore', to which she finally gives him what he wants (it's something that is sometimes mentioned among directors or other actors trying to get believable turns by the other actor), or in seeing the a very understated scene where Keitel and Madonna do a slow dance out by a pool and he sings a soft tune. I also loved the scene involving Keitel and Ferrara (how she's related to the director I don't know) when he reveals to her his major transgressions as she has returned home for her father's funeral (just casting her, too, is wise in showing someone very believable as a person in Hollywood's good & normal side). What helps too is the willingness of the principle actors to just give it their all, as if they'd kill to get what they're doing right for the director, murky script and all. Truth be told, I found this to be a real high point for Madonna as an actress, not playing some easier part to play like in Desperately Seeking Susan or League of Their Own, but having to actually tap into her more decadent side that she loved (at the time) to make as a part of her media image. Russo, too, is good here, if maybe almost dangerously one-note as a man so intense and \"method\" that he threatens the whole production.\n\nFinally, there's Keitel, who never ceases to amaze me with what he can do even in moments when the material gives him little to do but to look off in a scene with a stare or expression of inner-hell. Actually, that's one of the things he's probably perfected since the 1970s. He has moments where he bends his demanding exterior, and there's tenderness to be found within the self-destructiveness in Eddie. The only problem then lies with Keitel lacking a means to really channel this into something leading somewhere- by the end his character doesn't know what he'll do with the film, or how to finish it, and this sort of abrupt ending leaves the actors as well as the film in the cold. But as a film about film-making, I've seen worse, and I might even like it more if I catch it late one night on cable (definitely *that* kind of movie).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A New York City film director working on his latest movie in Los Angeles begins to reflect the actions in his movie and real life, especially when he begins an affair with the lead actress.",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi231981849",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2U3N2ZkNmYtOTEyMi00MWE1LTgxYTEtZGI2YWVjZDJhYzhkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2U3N2ZkNmYtOTEyMi00MWE1LTgxYTEtZGI2YWVjZDJhYzhkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-11-24T20:28:32.578Z",
        "url": "https://www.imdb.com/video/vi231981849/"
    },
    "url": "/title/tt0106660/"
}