{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Janeane Garofalo",
            "url": "/name/nm0000413/"
        },
        {
            "@type": "Person",
            "name": "Maher Sabry",
            "url": "/name/nm3223977/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 158,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0633276/"
        }
    ],
    "datePublished": "2003-06-07",
    "description": "Documentary presenting the realities of coming out in lesser developed countries.",
    "director": [
        {
            "@type": "Person",
            "name": "John Scagliotti",
            "url": "/name/nm0768715/"
        }
    ],
    "duration": "PT1H2M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0ODU2MDkxMl5BMl5BanBnXkFtZTcwMjk5NDgyMQ@@._V1_.jpg",
    "keywords": "caribbean sea,human immunodeficiency virus acquired immune deficiency syndrome,transphobia,coming out,singing",
    "name": "Dangerous Living: Coming Out in the Developing World",
    "original_info": {
        "id": "Dangerous Living_2003",
        "name": "Dangerous Living",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "davidals"
        },
        "dateCreated": "2005-07-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0379752/"
        },
        "name": "An extraordinary documentary that I encourage others to seek out",
        "reviewBody": "After two viewings, I've concluded that DANGEROUS LIVING is one of the finest documentaries focusing upon the global LGBT human rights struggle that I've seen; it's lone major flaw is that it left me wanting more.\n\nThe film is structured around the well-publicized and much-protested persecutions and torture of a number of gay men arrested in what was presumed to be a comparatively safe environment in Cairo, and the incident is used as a touchstone to explore what gay, lesbian and trans-gender activists in a number of other countries have had to endure. Activists from Brazil, Honduras, Namibia, Uganda, Egypt, Pakistan, India, Malaysia, Vietnam, Fiji and The Philippines are interviewed, and in every instance I wanted less voice-over, and more 'in their own words' discussion. I also would have liked to hear more about where conditions have improved, and how those improvements were obtained. DANGEROUS LIVING does also manage to hint at the link between the LGBT rights struggle, and the broader fight for human rights around the globe, and likewise suggests (an opinion I share) that state-sponsored homophobia has been heavily shaped by Western influences. Both of these issues still await further cinematic exploration.\n\nI'm of the opinion that the fight for LGBT rights is global, and that we are overdue a documentary that would make that plainly clear to Western LGBT communities who may take certain freedoms for granted, and - in relying so heavily upon voice overs, I'm not certain that this film does that effectively in its' comparatively brief running time. Still, this is both a moving and an infuriating film, and it does work as an inspiration to further research; to paraphrase the late writer and activist Paul Monette, a difficult life can take you to the core of your being; teaching you what has to be fought for and how - DANGEROUS LIVING does this often, with moving reality.\n\nAt the risk of cheer leading, I would strongly encourage others to seek this film out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0379752/"
}