{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jodhi May",
            "url": "/name/nm0562003/"
        },
        {
            "@type": "Person",
            "name": "Edward Fox",
            "url": "/name/nm0002081/"
        },
        {
            "@type": "Person",
            "name": "Amanda Root",
            "url": "/name/nm0740500/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4977,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        }
    ],
    "datePublished": "2002-11-23",
    "description": "Set in Victorian London, Gwendolen Harleth is drawn to Daniel Deronda, a selfless and intelligent gentleman of unknown parentage, but her own desperate need for financial security may destroy her chance at happiness.",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxOTcwNTcxNF5BMl5BanBnXkFtZTYwNjEyNDk5._V1_.jpg",
    "keywords": "character name as series title,period drama,victorian era,london england,british historical setting",
    "name": "Daniel Deronda",
    "original_info": {
        "id": "Daniel Deronda_2002",
        "name": "Daniel Deronda",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ingemann2000"
        },
        "dateCreated": "2004-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0321897/"
        },
        "name": "Villainy pays off",
        "reviewBody": "I'm watching the British series Daniel Deronda every week on Swedish tv, and I will recommned it to everyone who fancies quality literary adaptations. The production values are impeccable, and the acting list very impressive. The one to catch your attention, though, is without a doubt Hugh Bonneville as the supervillain Grandcourt. He's everything a good oldfashioned villain from the 19.th century ought to be: suave, cool, arrogant, manipulative, morally corrupt, and with a razor sharp wit. In fact, he totally overshadows the meek and handsome, but oh so noble and earnest hero, poor Daniel Deronda! Hugh Dancy does his best, but it's hard work to make Deronda as interesting as Grandcourt! Likewise with the heroine. Romola Garai is beautiful to look at, but it's difficult to really care about Gwendolyn. She's such a silly, whiny, and cold person who would rather marry a man she dislikes than stoop to be a governess! It made me long to give her a good whipping! All in all, I think she and Deronda deserve each other, for being so awfully colourless and boring. I'd much rather spend the time watching the villain smirk, or wonder about miss Lapidoth's strange fate, among the Jews. As usual, being the villain pays off! Hugh Bonneville and David Bamber as Lush are the characters you remember! They really are perfectly selfish and dastardly mean!"
    },
    "url": "/title/tt0321897/"
}