{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Geoffrey Arend",
            "url": "/name/nm0034309/"
        },
        {
            "@type": "Person",
            "name": "Rand Bridges",
            "url": "/name/nm0108782/"
        },
        {
            "@type": "Person",
            "name": "Lisa Collins",
            "url": "/name/nm0581631/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3844,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054176/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066916/"
        },
        {
            "@type": "Person",
            "name": "Glenn Eichler",
            "url": "/name/nm0251550/"
        },
        {
            "@type": "Person",
            "name": "Peggy Nicoll",
            "url": "/name/nm0630437/"
        }
    ],
    "datePublished": "2002-01-21",
    "description": "Daria, Jane, and the rest of the Lawndale High seniors face graduation and college in this series finale TV-movie from MTV's \"Daria.\"",
    "director": [
        {
            "@type": "Person",
            "name": "Karen Disher",
            "url": "/name/nm0228327/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Animation",
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWJiYThmNjgtMjVmZC00ZGIxLWFlN2QtNWQ3YzBkZWJlMjM4XkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "title directed by female,girl wears eyeglasses,teen movie,daria morgendorffer character,for grown ups animation",
    "name": "Daria in 'Is It College Yet?'",
    "original_info": {
        "id": "Daria: Is it College Yet?_2002",
        "name": "Daria: Is it College Yet?",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ddey65"
        },
        "dateCreated": "2004-04-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0285627/"
        },
        "name": "A lot like most sequels--Not as good as the original(***SPOILERS***)",
        "reviewBody": "But unlike most sequels that doesn't make it bad. The series-ending TV Movie is still up to the standards that made Daria the great show that it was. You don't need Daria's I.Q. to realize no TV show lasts forever, but the fact that a sixth season couldn't come before the obviously rushed series finale is still disappointing enough. In any case I'm going to weight the pros and cons now. \n\nThe case against \"Is It College Yet?\"\n\n1)The Fate of Daria and Tom: It was abrupt and disappointing, but fortunately not over-dramatic. Despite the fact that Tom and the Sloanes made every effort to help Daria join him at Bromwell, she ends up having to settle for Raft, and ends her relationship with Tom permanently. What's also disappointing is that she finds out after calling it quits with Tom that he looks up to her. And this after she made comments about feeling like she's too unworthy of the Sloanes and their inner circle. Boy, if she only knew this earlier. \n\n2)Upchuck no longer went out with Stacy: Ever since the episode \"Life in the Past Lane\" we all were surprised that Stacy would be willing to spend any time with Upchuck. I know he'd have to have a reputation for being an annoying flirt that lasts beyond his magic show, but to still be looking for love after finding someone earlier? Frankly, I expected something better of him.\n\n3)The Quinn-Lindy Subplot: A little too much like an ABC Afterschool Special for many.\n\n4)Too many unanswered questions: The main reason Daria was such a great show was her snide remarks at the people around her. But with a lot of these people, there's more to them than meets the eye. Lots of fans, including myself were looking for more insight into what makes the supporting cast tick. Why is Stacy such an emotional cripple? Why don't we see Jodie's little Sister anywhere else but \"The Daria Database?\" Is Mack's father really as sports-crazy as Kevin's? And so on, and so forth.\n\nThe Case for \"Is It College Yet?\"\n\n1)Daria and Jane graduate easily. Brittany and the rest of the cheerleaders do to, but I wouldn't let that worry me.\n\n2)Andrew and Michele Landon are finally vindicated as good parents: I could see this already in the episode \"Prize Fighters,\" when some web-fans were still debating the notion that the Landon parents might be abusive to their kids. They actually give in to Jodie's feelings and allow her to go to Turner College. \n\n3)Kevin doesn't graduate: The only bad thing about it is that Mr. DeMartino is going to have to deal with him for at least another year. If he thinks seeing Mrs. Barch and Mr. O'Neill together gave him a good reason to bang his head on the goalposts, a few more senior years with Kevin Thompson will make him take a one-way trip to Chicago so he can jump off the Sears Tower.\n\n4)Daria's graduation speech: Those of us who have been fans of Daria since the days of Beavis and Butt-head know very little could prevent Daria from graduating from High School, but the surprise chance for a speech at her graduation transcends beyond Daria fandom. It rings true for anybody who hated their life in high school. Years ago in my user comment on the regular series I said that the legacy of Daria should last even if the show doesn't, and that speech gives me some confidence that it will. Overall, we'll have no more or less reason to dread the future than we did before.\n\n5)It's Daria -- How can anyone resist?\n\nGlenn Eichler said in an interview that many fans have mistaken Daria for a super-girl, and as we've learned since Season Four, she's anything but perfect and this fact is emphasized here. Still, she says what many if not most fans want to say to their elders and superiors, and that's one of the reasons why we like her. It may not seem socially acceptable to think that a two-dimensional teenage girl could be an outlet for our frustration at the world, but none of us should forget that decades ago a Minnesota man named Charles Schulz proved it was possible with a little boy named Charlie Brown.\n\nWe'll miss you, Daria, and all your jabs at the stupidity around you...and around us. Hopefully we won't miss as many of the cast and crew that made your show as good as it was.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0285627/"
}