{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lorenzo Lamas",
            "url": "/name/nm0001444/"
        },
        {
            "@type": "Person",
            "name": "Simmone Mackinnon",
            "url": "/name/nm0533576/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Gorman",
            "url": "/name/nm1200451/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 828,
        "ratingValue": 3.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057336/"
        },
        {
            "@type": "Person",
            "name": "Brett Orr",
            "url": "/name/nm0650532/"
        },
        {
            "@type": "Person",
            "name": "Phillip J. Roth",
            "url": "/name/nm0744985/"
        }
    ],
    "datePublished": "2003-12-09",
    "description": "Moneyless, ocean-exploring gigolo and his worldly lady-friend are forced to take part in looking into the possibility that aggression - utilizing marine life - is being planned.",
    "director": [
        {
            "@type": "Person",
            "name": "Phillip J. Roth",
            "url": "/name/nm0744985/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxNDI0NzA2N15BMl5BanBnXkFtZTgwMDgxMDA2MDE@._V1_.jpg",
    "keywords": "gulf of mexico,man versus animal,eco horror,submarine,navy",
    "name": "Dark Waters",
    "original_info": {
        "id": "Dark Waters_2003",
        "name": "Dark Waters",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cchase"
        },
        "dateCreated": "2004-01-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0391908/"
        },
        "name": "\"Deep Blue Rip-off!\"",
        "reviewBody": "Sci-Fi Channel's \"Original Pictures\" arm is fast becoming the AIP-clone for the New Millennium, and it's movies just like this one that prove it. You only have to see the credit \"Starring Lorenzo Lamas\" to know exactly what you're in for. And no matter how low your expectations, I don't think the hardiest bad-movie fan is ready for this 'deep-star-sixed' turkey.\n\nLorenzo and made-for-gratuitous-breast-shots-hottie Simone MacKinnon play--what else?--a failed marine biologist/oceanographer and his cohort. Once legit scientists who actually ran a real exploratory institute, specializing in environmental studies and research, (yeah, right), they have become mere scam artists, bilking rich idiots out of tens of thousands of dollars for a new, non-existent \"project\": the discovery and eventual exploration of \"ATLANTIS.\"\n\nAt the film's opening, stolen right from the script pages of another howler, DEEP BLUE SEA, (which was twice as bad, but also two times more entertaining than this), a private deep-core drilling station is trashed by a school of animated marauding sharks (yes, you DID read that correctly), who also make its inhabitants into fast fish food.\n\nCut to the aforementioned pseudo-soiree. LL and Simone have just finished fleecing a bevy of bountiful society boobies, but then the \"hunters get captured by the game.\" Next thing they know, they find themselves waking from unconsciousness and headed for the dilapidated headquarters where the institute was founded by LL's late dad. There to greet them is the man who may have been responsible for Papa's demise, played with the usual workmanlike dependability by Canadian staple Bruce Gray, (and you already know how much you should trust characters played by Canadian actors with the first name \"Bruce.\") Bruce offers the sci-cons a sweetheart of a deal: investigate the shark attack on his drilling station, and he'll make all their legal and monetary problems disappear. (Haven't people learned about deals like this YET???)\n\nI could bore you with the rest of the details, but why bother? You already know it by-the-numbers: super-brainy sharks, genetic experimentation gone awry, government/military conspiracy and cover-ups, lots of bullets flying, soldiers and scenery chewed, yadayadayada. Just keep in mind: the credits in this movie list both a director of visual effects AND a director of animation, so you know that the majority of the budget was spent on hair care products for the two \"stars.\"\n\nWhich reminds me...that's about what this movie is worth. And that's because I happen to like Bruce Gray. The sharks are a bonus. Now if they only could've snacked on the screenwriters..."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from DEJ",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2329084697",
        "name": "Dark Waters",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjQ0MGE3MDktNDRmMS00OTE3LTljM2YtYzBiYTg1YWUyYTc2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjQ0MGE3MDktNDRmMS00OTE3LTljM2YtYzBiYTg1YWUyYTc2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-12-31T06:23:01Z",
        "url": "https://www.imdb.com/video/vi2329084697/"
    },
    "url": "/title/tt0391908/"
}