{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hitomi Kuroki",
            "url": "/name/nm0475878/"
        },
        {
            "@type": "Person",
            "name": "Rio Kanno",
            "url": "/name/nm1287602/"
        },
        {
            "@type": "Person",
            "name": "Mirei Oguchi",
            "url": "/name/nm1290029/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33390,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Dark Water",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060607/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003850/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011066/"
        },
        {
            "@type": "Person",
            "name": "Kôji Suzuki",
            "url": "/name/nm0840626/"
        },
        {
            "@type": "Person",
            "name": "Takashige Ichise",
            "url": "/name/nm0406772/"
        },
        {
            "@type": "Person",
            "name": "Hideo Nakata",
            "url": "/name/nm0620378/"
        }
    ],
    "datePublished": "2002-01-19",
    "description": "A mother and her 6 year old daughter move into a creepy apartment whose every surface is permeated by water.",
    "director": [
        {
            "@type": "Person",
            "name": "Hideo Nakata",
            "url": "/name/nm0620378/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTRmYzUxMWYtM2Q3Ni00ODQ0LTk4YmYtNDE4MDgzYzg4YWNlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "2000s,dead body in a water tank,slow motion scene,talking to oneself,child",
    "name": "Honogurai mizu no soko kara",
    "original_info": {
        "id": "Dark Water_2002",
        "name": "Dark Water",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2003-06-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0308379/"
        },
        "name": "A very effective ghost story that actually delivers chills in place of gore",
        "reviewBody": "In the middle of a difficult custody battle over her 6 year old daughter with her ex husband, Yoshimi Matsubara takes a flat in an old building in order to get some stability in their lives. However the problems start with a constant and spreading leak in the ceiling of their flat and the sense of someone else being around the building. Yoshimi becomes increasingly on edge when Ikuko appears to be effected.\n\nSetting out my stall from the start I really liked Ringu and was happy to see this film from the same director. I knew nothing about it when I sat in the cinema and I think that is the best way to see it (although my plot synopsis about will have spoilt nothing). Dark Water continues Nakata's ability of unsettling audiences with little devices. Here he stays with the child theme from Ringu and it works very well despite being a much simpler plot that isn't anywhere near as clever as the other film. However in terms of delivering scares Nakata builds with shadowy images and creeping effects  the spread of the leak across the ceiling is creepy and the reoccurring image of a child's pink bag becomes increasingly unnerving as the film progresses.\n\nThe direction is strong throughout with the camera preferring to turn to see what the characters see rather than having something leap into view or simply be cut to  this turning movement can take seconds where our tension is build by being kept waiting. Again the use of shadowy figures and fleeting glimpses of things is very creepy and it really worked for me much better than all the gore in the world. It is a little ironic that one of the biggest jumps from the audience came from the film's one use of CGI effects, but this worked well simply due to the build up of suspense all the way through.\n\nTo compliment this the film uses music and sound very well. On the odd occasional it does the tradition thing where the music builds to up the tension, this works but is not unusual. What works better is the use of music WHEN the creeps arrive! Whenever Yoshimi looks at the leak the music gives it an unnerving quality that may not have existed with the shot alone. The simple plot makes for an effective little ghost story  there is an element of mystery here but it is more about the suspense than the history. This is OK but the ending is a little more predictable than I would have liked (at first glance) and the epilogue didn't really work for me and I felt it needed a stronger close (not necessarily a jump though). I say `at first glance' because it appears predictable but really it changes where I thought the film was going and the whole basis for the creepy scenes  ie I had assumed that the girl was taking Ikuko for play etc  I'll say no more but you'll understand when you see it.\n\nThe cast were good. My friend said that Kuroki's Yoshimi was so sappy she wanted to slap her but I actually thought she played it well. She convinced me she was a woman going through an emotionally challenging time and was being pushed. There was an element of her overplaying (maybe? It could be taken as realism) the fear in order to heighten the audience's but really this was benefical to the film as a whole. Kanno's Ikuko is excellent  I can't imagine a child I know being able to cope with that sort of filming but she does it very well and is a million miles from the annoying brats that Western films seem to dig up when required. These two are excellent and have reasonable support characters but the real star is a character you only really glimpse and the creepy atmosphere created by Nakata.\n\nOverall anyone who saw the remake of Ringu (and it was No1 for a while) should ignore the subtitles and go and see this. It lacks the depth of Ringu and the epilogue's search for a greater significance is a little plodding and out of place, but it is still an effective ghost story that is a painfully slow at times but only serves to make it genuinely unnerving and creepy throughout."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A mother and her 6 year old daughter move into a creepy apartment whose every surface is permeated by water.",
        "duration": "PT1M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1872216857",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTIwYzFhMWItMzQxNy00NjE0LWJkZGQtMjhmMjRhOWRhZTFlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTIwYzFhMWItMzQxNy00NjE0LWJkZGQtMjhmMjRhOWRhZTFlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-08T00:07:58.737Z",
        "url": "https://www.imdb.com/video/vi1872216857/"
    },
    "url": "/title/tt0308379/"
}