{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Austin Burke",
            "url": "/name/nm11977962/"
        }
    ],
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0202446/"
        },
        {
            "@type": "Person",
            "name": "Austin Burke",
            "url": "/name/nm11977962/"
        }
    ],
    "datePublished": "2019-06-21",
    "director": [
        {
            "@type": "Person",
            "name": "Austin Burke",
            "url": "/name/nm11977962/"
        }
    ],
    "genre": [
        "Short",
        "Sci-Fi"
    ],
    "name": "Dark Season 2 Netflix Review",
    "original_info": {
        "id": "Dark Angel: Season 2_2001",
        "name": "Dark Angel: Season 2",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cocoabooklover"
        },
        "dateCreated": "2022-05-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt15474182/"
        },
        "name": "The end is the beginning is the end",
        "reviewBody": "I love a story about time travel and all the possibilities and implications of it. The German language show DARk had my interest right away. Starting off with a wonderful mystery event and beautifully built characters with woven storylines like real life people, families have. Cinematography that is just so perfect, I do not even have words for it. Its truly atmospheric and pulls you into the sceen. Making you part of the moment. Even though I watched the English dubbed version the actors had me hanging on their lips. I wept along with most of them as well. The soundtrack is made for the scenery. Like the end scences in Walking Dead, DARk also has a kind of \"montage\" scene at the end of every episode that I enjoyed. Not everything needs to be said. Some things can just be shown. The young actor who plays Jonas, I have absolutely fallen in love with him. I wish I could understand German so I could hear him speak the actual words. His eyes are so emotive. He is brilliant. That was the great part.\n\nThe bad part. The \"typical\" time travel rules don't quite apply here, which is not a bad thing. It makes for an interesting twist and very philosophical look at life. The first issue is one, of the biggest plot questions don't get answered at the end of season 1. But rather only kinda to the end of season 2. It feels like the ending of season 1 is for a completely different show. Its a bit of a letdown because so much time was spent on giving that really interesting plot idea its buildup. The second big problem I have is that by mid season 2 there are so many people in so many places that it is sometimes difficult to actually remember who is who or why they are there. I got the feeling that the writers didnt want anyone to feel left out so they *beamed me up Scotty. There are multiple characters in multiple spaces and times at various ages. Its sad because all the characters are so well written, developed and played. By season 3 (midway), I think I might have a little heart attack if one more stranger says. The beginning is the end is the beginning. Or something to that effect. I've kept on watching because of all the pros I mentioned first. Unfortunately by season 3 there are even more charachters , times, places, historied and actions added.\n\nI guess I'll quote all time travellers. IfI go back one last time, it will all change. I really hope it ends on a bang and not a black hole.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt15474182/"
}