{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Samaire Armstrong",
            "url": "/name/nm1027847/"
        },
        {
            "@type": "Person",
            "name": "Ryan Alosio",
            "url": "/name/nm0022323/"
        },
        {
            "@type": "Person",
            "name": "Andrea Bogart",
            "url": "/name/nm0091553/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1699,
        "ratingValue": 2.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058237/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey Alan Holliday",
            "url": "/name/nm1215157/"
        },
        {
            "@type": "Person",
            "name": "Chuck Scholl",
            "url": "/name/nm1261493/"
        }
    ],
    "datePublished": "2003-04-15",
    "description": "An LAPD cop, whose partner was murdered by a werewolf, must protect a woman called Josie, who's a hybrid, after he realizes that the werewolf wants to mate with her.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Friedman",
            "url": "/name/nm0295345/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE1MzcxMzU5NF5BMl5BanBnXkFtZTcwNjUxNDA0MQ@@._V1_.jpg",
    "keywords": "werewolf horror,female nudity,titillation,cool,lesbian interest",
    "name": "DarkWolf",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jaywolfenstien"
        },
        "dateCreated": "2003-08-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0326820/"
        },
        "name": "Hedren meets Hodder?",
        "reviewBody": "The opening titles took me by surprise. I knew Kane was in this film, but Tippi? The Tippi Hedren from Alfred Hitchcock's classic the Birds and underrated Marnie? Huh. Well, that is the highlight of the film, and the only pleasant surprise the film has up its sleeve.\n\nWhat's kind of sad is the general premise of Dark Wolf could work well were it not written on the level of forth grade flunkies. The usage of color, lighting and camera work are above your typical bad-horror flick, and with a complete narrative overhaul and redistribution of the budget (cutting out the CG) it could go somewhere.\n\nThe two biggest weaknesses in this film are its CG usage and the low-level intelligence of the script. On the commentary track for Exorcist: Beginning, Renny Harlin observes that a horror film's effectiveness thrives upon the reality of its world  a reality that CG shatters. Dark Wolf proves him correct  watch the werewolf transformations in this movie. Transformation that look like a video game cut scene integrated into a live action film. Watch it and try not to laugh. Just try.\n\nCG, done correctly, carries a pretty steep price tag, especially if the said scene involves a computer generated character. The reality of such effects rests within dozens upon dozens upon dozens of subtle details that the casual viewer cannot consciously identify, but even Joe-nobody off the street knows when its lacking. When the effect is artificial. I have a hard enough time suspending my disbelief for the likes of Star Wars II and Matrix: Reloaded whose team of CG artists outnumber Dark Wolf's cast and crew combined. Low budget horror shouldn't even screw with it.\n\nThe second biggest weakness, again, is the script's intelligence level. And yes, I'm aware of the genre's average film IQ. This film scored in the double digits on the specialized dumbed down horror SATs. If you marveled at the moron who drove miles out of his way to accidentally dig up and revive Jason in F13pt6, prepare to meet his mentor, grasshopper. \"What's with the shiny guns?\" asks a cop to an FBI agent, and I expected her to finish with \"They're pretty!\" Movies like this make me re-evaluate my expectations for horror, but I find myself asking \"how can my expectations get any lower?\" I absolutely loved a film as narratively retarded featuring shallow throwaway characters  and that movie's name? Freddy Versus Jason. I'm not looking for strong character convictions here, but convince me your cop has at least heard of Miranda for Christ's sake. Convince me the photographer knows something about photography. Convince me that the werewolves are actually a threat  a werewolf attacks and we can read a book then just plop the wolf up and carry it around like a bag of groceries? Sounds like a SNL skit.\n\nBefore too long, I found it more entertaining challenging the logic and questioning the events of the film than accepting the film's reality. For example, how do you lose the one relic that will ultimately explain everything and save the world? How does someone stand there and watch the heroine escape and lose her when his sole purpose in life is to locate her? Why did the wolf look eerily like an ape? Why is a naked Kane Hodder laughably unintimidating as he demands \"Where is she?\" Why does he go to wolf form before every kill? and why is he mysteriously naked for one scene in the middle of the film? I know better than asking these questions, but I couldn't help myself. Dark Wolf was askingnay, beggingfor it.\n\nWinding down, the film shows Kane Hodder on a morgue table, and that's where I switched off the film. Anyone who's seen even one horror movie knows exactly what will happen, and as I ejected the DVD and returned it to its case I quietly noted how much of Dark Wolf I could have skipped and still know precisely the events that take place. In fact, the only thing I would have missed was the below average stupidity and the six minute MTVesque photo-shoot of some girls made up as werewolves.\n\nOn the plus side the film does have Tippi Hedren. It also has better than average camera work, a very colorful (though frequently inappropriate) atmosphere, and a few cool effects like the flash of red to wolf's perspective . . . before it became redundant . . . which was before it became obnoxious. Overall, though, the only way I can recommend Dark Wolf is to demonstrate why low budget horror should stay away from computer generated imagery."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4171235609",
        "name": "Darkwolf",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTdkN2E5MzktNjVkOS00ZjQxLTlhMzAtYzZmZWE4MThiZGQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTdkN2E5MzktNjVkOS00ZjQxLTlhMzAtYzZmZWE4MThiZGQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:46:07Z",
        "url": "https://www.imdb.com/video/vi4171235609/"
    },
    "url": "/title/tt0326820/"
}