{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Delphine Seyrig",
            "url": "/name/nm0786891/"
        },
        {
            "@type": "Person",
            "name": "John Karlen",
            "url": "/name/nm0439482/"
        },
        {
            "@type": "Person",
            "name": "Danielle Ouimet",
            "url": "/name/nm0653540/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6434,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Daughters of Darkness",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043463/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072338/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076073/"
        },
        {
            "@type": "Person",
            "name": "Pierre Drouot",
            "url": "/name/nm0238385/"
        },
        {
            "@type": "Person",
            "name": "Jean Ferry",
            "url": "/name/nm0275081/"
        },
        {
            "@type": "Person",
            "name": "Harry Kümel",
            "url": "/name/nm0478176/"
        }
    ],
    "datePublished": "1971-10-22",
    "description": "While passing through a vacation resort, a newlywed couple encounters a mysterious, strikingly beautiful countess and her aide.",
    "director": [
        {
            "@type": "Person",
            "name": "Harry Kümel",
            "url": "/name/nm0478176/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmZjYzQ1YjMtY2Q3Ny00MDU3LTgyMmYtODg5MWFlY2FlOWViXkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_.jpg",
    "keywords": "vampire,naive young woman,reference to elizabeth bathory,disposing of a dead body,newlywed couple",
    "name": "Les lèvres rouges",
    "original_info": {
        "id": "Daughters of Darkness_1971",
        "name": "Daughters of Darkness",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Witchfinder-General-666"
        },
        "dateCreated": "2008-01-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067690/"
        },
        "name": "Mesmerizing Lesbian Vampire Classic",
        "reviewBody": "Lesbian Vampire films had their heyday in the early 70s, and Belgian cult director Harry Kümmel's \"Les Lèvres Rouges\" aka. \"Daughters Of Darkness\" of 1971 is the most artistically made, mesmerizing and atmospheric film this particular sub-genre has put forth. The film maintains an exceptionally eerie and surreal atmosphere throughout its 100 minutes, the score is one of the most beautiful and ingenious horror film soundtracks I've ever heard, and Delphine Seyring is wonderfully eerie and seductive at the same time in the role of Countess Bathory. The film, of course, has nothing to do with the real Elisabeth Bathory, who terrorized medieval Hungary by murdering countless innocent girls. The real, terrible story of this sadistic countess, who is often referred to as the \"Bloody Lady\", however, is an immensely popular topic in Horror literature and film, and the Erzsébet Bathory story also provided a basis (as well as a villain) for this particular film.\n\nNewlyweds Stefan (John Karlen) and Valerie (Danielle Ouimet) are staying at a Belgian hotel in the middle of nowhere, when two more guests arrive - A mysterious and tempting countess (Delphine Seyring) who is accompanied by a pretty young girl (Andrea Rau)...\n\n\"Les Lèvres Rouges\" is a film as beautiful as it is eerie, mysterious and surreal. The greatest performance is delivered by Delphine Seyring, who is brilliant as the countess. Sexy Danielle Ourimet and Andrea Rau deliver enough female eye-candy to make this a classic of the erotic Horror film. I couldn't say I liked John Karlen's performance particularly, but he sure isn't bad either. Great supporting performances are delivered by Paul Esser as a hotel clerk and Georges Jamin as a retired police officer. The greatest quality of the movie, however is the mesmerizing atmosphere which is even fortified by the beautiful and hypnotic score.\n\nAll said, \"Les Lèvres Rouges\" is an excellent, immensely eerie, beautiful and atmospheric Horror film, and THE classic of the Lesbian Vampire sub-genre that Horror lovers can not afford to miss!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0067690/"
}