{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mai Thi Kim",
            "url": "/name/nm1597151/"
        },
        {
            "@type": "Person",
            "name": "Heidi Neville-Bub",
            "url": "/name/nm1597287/"
        },
        {
            "@type": "Person",
            "name": "Gerald Ford",
            "url": "/name/nm0004934/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 603,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "datePublished": "2002-01-11",
    "description": "Separated at the end of the Vietnam war, an \"Americanized\" woman and her Vietnamese mother are reunited after 22 years.",
    "director": [
        {
            "@type": "Person",
            "name": "Gail Dolgin",
            "url": "/name/nm0231000/"
        },
        {
            "@type": "Person",
            "name": "Vicente Franco",
            "url": "/name/nm0290657/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Documentary",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA1MTg4MzYwMl5BMl5BanBnXkFtZTcwODY0MTQyMQ@@._V1_.jpg",
    "keywords": "vietnam,vietnam war,tennessee,vietnamese,reunion",
    "name": "Daughter from Danang",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "joyco7"
        },
        "dateCreated": "2004-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0303281/"
        },
        "name": "The Shocking Reunion",
        "reviewBody": "I watched this movie by accident. I was reading a material and had left the TV on when the title came up ..... \" Daughter From Danang\" .... I did not know what it was, but my instinct told me it was a drama movie/documentary film. I am all for dramas and more so with true to life story documentaries. Without hesitance, I dropped what I was reading and soon became engrossed as the story was unfolding. True, I was expecting a happy ending. Instead, the movie ended in a sad tone with a subtle hint of possibly another tragedy in the making. I was deeply saddened and felt the pang of pain for Heidi that her visit turned out like a nightmare. I myself is a mixture of Chinese and of Southeast Asian background (not Vietnamese). Most of my relatives from both sides of my parents are very poor. They hardly have any food on the table, let alone a decent house or education. I grew up seeing my parents helped their relatives in every way they can in terms of food, shelter, clothes, education and employment. A lot of times, we the children had to sacrifice our wants and likes such as fun outfits, nice toys and holiday trips because my parents could no longer afford those. With all gratitude, my parents provided all of us seven (7) children, the education that was inexistent in our family tree. Helping family and relatives is like a tradition in my family. It is also like a legacy and it will be passed on to the next generation, especially to the ones who are in a position to help. Growing up in this type of environment .... I totally understand and sympathize with the Vietnamese's predicament and the need for help. I am almost sure that when they knew Heidi was coming to see them, they probably thought she will bring them the much needed salvation. The Vietnamese Family may have expected this to happen, more than just hoped for it to happen. This was demonstrated by their aggressiveness in asking for financial help, of which Heidi took it as rude and offensive. Heidi's reaction was also understandable because she was brought up by her adoptive parent the \"Americn Way\". Very strong minded and independent, amongst many other qualities. I am just curious as to why Heidi was not prepared for all of this? I am aware that the lady who escorted her to Vietnam have told her that life is very different there. But somehow, Heidi should have gone a little further or at least, she should have been encouraged by the filming group to do a little research on the cultural background of her estranged family. Her awareness and familiarization of the social culture could have helped her interact with her family in a more positive way, and may have avoided the unnecessary feeling of shock, anger and resentment that caused her so much anguish, it broke my heart. It's been 2 years now since her emotional visit to Vietnam. She may have taken some time to think things over and have created a plan to reconsider her brother's plea for help. At the end of the interview, Heidi said something to this effect: \"I guess I closed the door on them (paused and thinking). Yes, I may have closed the door, but I did not lock the door (gave a smile\"): This gave me a strong sense of hope. It tells me that she's taking a step back in order to make two steps forward. Heidi's American upbringing ..... the morals, virtues and principles that she was shaped into by her adoptive family may play a big role in her recognizing and exercising humanitarian gestures towards her Vietnamese family. I hope that this act of good deed will serve as a vehicle for her to learn to accept her real family and to love them unconditionally, as they did for her. According to Heidi, she lives for the present and for the future. The she does not live for the past....... my comment to this is that for Heidi to accept and acknowledge the fact that there was a huge void in her life that needs filling up. In my opinion, she needs to find a way to connect the past to the present, so that she may able to proceed with her journey to the future. I think, if she's able to do this, she would feel whole, strong and liberated. This is then a call for PART TWO of the drama ...... ah! what should be the title? HHHmmm, I'll leave that to you. This movie has been inspiring to me, and no doubt .... should be inspiring for those children like Heidi. This presentation, could help thousands of those children ease their silent suffering, and may help aide them in their healing process. That ultimately, the tragedy in Vietnam War will yield a happy ending. At least, for those innocent children like Heidi who will successfully come to terms with her past, present and future life as a person. To the people who created this film, thank you and more power to you. To Heidi and her family .... be patient for \"LOVE WILL CONQUER ALL\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0303281/"
}