{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "James Van Der Beek",
            "url": "/name/nm0004735/"
        },
        {
            "@type": "Person",
            "name": "Katie Holmes",
            "url": "/name/nm0005017/"
        },
        {
            "@type": "Person",
            "name": "Michelle Williams",
            "url": "/name/nm0931329/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 42520,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048032/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074221/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009297/"
        },
        {
            "@type": "Person",
            "name": "Kevin Williamson",
            "url": "/name/nm0932078/"
        }
    ],
    "datePublished": "1998-01-20",
    "description": "Four friends in a small coastal town help each other cope with adolescence.",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjhjNzBiNGMtZGI0ZC00NjEyLTgxM2EtYzU3OWYwOTdhOTE3XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "older person playing teen,friendship,character name in series title,forename as series title,teensploitation",
    "name": "Dawson's Creek",
    "original_info": {
        "id": "Dawson's Creek: Season 1_1998",
        "name": "Dawson's Creek: Season 1",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Covey-3"
        },
        "dateCreated": "2000-05-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118300/"
        },
        "name": "What TV should be.",
        "reviewBody": "Dawson's Creek is by no means a realistic portrayal of teenage angst. I'll admit this. The power of the series and what, in my view, makes it far and away the best thing to happen to TV in a long, long time, is that is it a realistic portrayal of teenage emotions...\n\nThe characters in Dawson's Creek may only be 16, yet as Eve said to Dawson (early Season 3) they are all 'old souls'. The emotions in the series are real, the emotions felt by the characters are real, yet, the fact that Kevin Williamson has allowed the characters a vocal outlet for these emotions is the genius of the show. My So Called Life was a brave attempt to do this, but fell short through its pretensions of grandeur. Dawson's Creek embraces the fact that the vocabulary spoken is fake and because of this, is entirely forgiven. This is why we watch television, to feel and see emotions that we cannot or do not feel in our own lives.\n\nAs Dawson once said, \"Movies (And TV) by definition are escapism, if you want reality look out of the window.\" Dawson's Creek knows what it is. A fictional television show about high school kids and the emotions they deal with. By admitting its falseness, yet retaining its warmth, humanity and heart, we are able to witness characters that we know aren't real, that we know in real life wouldn't have the vocabulary that these kids possess, but who we believe in and we root for.\n\nNot only emotionally is Dawson's Creek superb, but technically, the series is faultless. Musically, artists like Sarah Mclachlan and Jewel fit snugly into the feel of the series, while artists like New Radicals and Semisonic serve to enhance emotions. The choice of song in Dawson's Creek is rarely wrong and often perfect. The music does not lead the scene into the direction of the song, but serves to reinforce and enhance the emotion that the scene portrays and requires.\n\nVisually, the gorgeous backdrop of Wilmington, North Carolina is fitting as the small American village that is Capeside. The scenic beauty of the Creek, the coast, the woodland, the foliage. Everything visually about the show is in keeping with the emotional context of the show.\n\nCamera work is also faultless. When presented with a difficult emotional scene, we usually pull away from the action at the end of the scene, not judging the characters for their mistakes and allowing them the right to deal with it on their own, without our interference. Only rarely do we judge the characters and when we do, the characters themselves have already beat us to it. (Dawson and Andie getting drunk)\n\nI'd like to thank Kevin Williamson for allowing me the chance to fall in love with the town, the people and the life. These emotions are real. The vocabulary, is just a way of allowing the emotions to have a voice."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home video trailer for this drama about four friends in a small coastal town",
        "duration": "PT2M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2951152665",
        "name": "Dawson's Creek: The Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2VmNDdiMDItYmU4OS00ZWVmLThiNWMtZmIxZThmZGQ3ZDQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2VmNDdiMDItYmU4OS00ZWVmLThiNWMtZmIxZThmZGQ3ZDQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T14:50:34Z",
        "url": "https://www.imdb.com/video/vi2951152665/"
    },
    "url": "/title/tt0118300/"
}