{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jacqueline Bisset",
            "url": "/name/nm0000302/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Léaud",
            "url": "/name/nm0529543/"
        },
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23672,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Day for Night",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106723/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063388/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009993/"
        },
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        },
        {
            "@type": "Person",
            "name": "Jean-Louis Richard",
            "url": "/name/nm0723827/"
        },
        {
            "@type": "Person",
            "name": "Suzanne Schiffman",
            "url": "/name/nm0771535/"
        }
    ],
    "datePublished": "1973-09-07",
    "description": "A committed film director struggles to complete his movie while coping with a myriad of crises, personal and professional, among the cast and crew.",
    "director": [
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWFiZmI1MzQtYmIyMy00OGU0LWFkMTItMjQxODI4NDE0MTA4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "film within a film,film industry,film crew,behind the scenes,filmmaking",
    "name": "La nuit américaine",
    "original_info": {
        "id": "Day for Night_1973",
        "name": "Day for Night",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slokes"
        },
        "dateCreated": "2007-12-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070460/"
        },
        "name": "Cinema Reine!",
        "reviewBody": "\"No sentimentality - just play notes!\" is the instruction we hear over the credits that open \"Day For Night\". About three seconds later, we see silent film stars Dorothy and Lillian Gish striking highly theatrical poses, with a signed inscription by director Francois Truffaut saying the film has been dedicated to them.\n\nSo is sentimentality a good thing or a bad thing? Truffaut may be playing it both ways, yet \"Day For Night\" makes a great argument in both directions. You need to feel something to pour so much heart and soul into movie-making, but you also need to be hard-hearted, say for example if an actor dies before a film is wrapped or a cat won't drink milk on cue. \"Day For Night\" strikes an amazing balance between hard and soft, happy and sad, comedy and tragedy, and in the end offers a unique take not only on movies but on life itself.\n\n\"What a funny life we lead,\" says the aging starlet Severine (Valentina Cortese), summing up \"Day For Night's\" take on the ephemerality of both departments. \"We meet, we work together, we love each other, and then, as soon as we grasp something - pfft - it's gone. See?\" But if there is some consolation in Truffaut's view, it is the companionship life offers, especially on a film set, where families of intense passion and strength can sprout up in an instant.\n\nCortese is a treat, with both her sweetness and her lighter moments. Severine tries to make a dramatic exit in one scene but keeps opening a closet door. Everyone in this film shines in some way, selling you utterly on the idea you are not watching a movie but eavesdropping on a real set, even as Truffaut constantly makes references to the fact \"Day For Night\" is a movie. Jacqueline Bisset plays an actress known for being in \"that movie with the car chase\" while Jean-Pierre Léaud's character's girlfriend complains \"he wants the whole world to pay for his unhappy childhood.\"\n\nTruffaut was responsible for Léaud's unhappy childhood, of course, but, avoiding sentimentality, makes his young actor protégé more of a heavy and comic foil this time out, playing not Antoine this time but another fellow named Alphonse. Léaud rewards his director with a genuinely funny take-off on his intensity from other Truffaut films.\n\nI also love Bisset, who as Julie gives the film a bit of real heart as the one character who has something of a life beyond movies, with a middle-aged lover she cares for almost sheepishly. Yet it is she who exemplifies \"the show must go on\" by risking her life outside the picture in order to save the picture itself.\n\nEven Truffaut does a good turn as a major character, playing a film director. Truffaut always worked best as a slightly ruffled authority figure, here urging a tipsy Severine not to go through her difficult scene reciting numbers: \"In France, we have to say the lines!\"\n\nThere's very little I would want to change in this film, not even the garish 1970s clothes which give this film an appropriate aura of informality. It's soapy, yes, but so's life at times, and like life, it really makes you want to stick around for the moments it gets right. Sentiment may be dangerous to performance, but it seems worth having around in the end.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Day for Night",
        "duration": "PT2M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2699494425",
        "name": "Day for Night",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGMxOTQwN2UtNzAzNy00YTY3LTlmYmYtMjhmMGUzMjFiOGYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGMxOTQwN2UtNzAzNy00YTY3LTlmYmYtMjhmMGUzMjFiOGYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T14:50:36Z",
        "url": "https://www.imdb.com/video/vi2699494425/"
    },
    "url": "/title/tt0070460/"
}