{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lori Cardille",
            "url": "/name/nm0136440/"
        },
        {
            "@type": "Person",
            "name": "Terry Alexander",
            "url": "/name/nm0018777/"
        },
        {
            "@type": "Person",
            "name": "Joseph Pilato",
            "url": "/name/nm0683334/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 71115,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163936/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099636/"
        },
        {
            "@type": "Person",
            "name": "George A. Romero",
            "url": "/name/nm0001681/"
        }
    ],
    "datePublished": "1985-07-19",
    "description": "As the world is overrun by zombies, a group of scientists and military personnel sheltering in an underground bunker in Florida must determine how they should deal with the undead horde.",
    "director": [
        {
            "@type": "Person",
            "name": "George A. Romero",
            "url": "/name/nm0001681/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWVmMzlhZGYtMWRiOS00MGIwLTk5YTAtZGE4OTcyYjU3YzZmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "bully,bully comeuppance,questioning authority,scientist,military",
    "name": "Day of the Dead",
    "original_info": {
        "id": "Day of the Dead_1985",
        "name": "Day of the Dead",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Robin-97"
        },
        "dateCreated": "1999-09-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0088993/"
        },
        "name": "A long-time sufferer of the \"Alien 3 Syndrome\"",
        "reviewBody": "\"Day of the Dead\" is a film that is an unfortunate sufferer of the \"Alien 3 Syndrome\". And, no, I don't classify those that are affected by the syndrome to be disappointing final entries in a trilogy. To suffer from \"Alien 3 Syndrome\", you must follow two exceptional films, and the entry that has preceded you must be so exciting and action-packed that when you dare take a grimmer, more deliberately paced approach to your material, you will become universally reviled, with many people failing to notice that you have more than your fair share of merits on your own. In fact, \"Day of the Dead\" has a LOT of merits - even more than the film that its syndrome is based on. While it doesn't quite approach the greatness of \"Dawn of the Dead\", it is still an intelligent, first-rate horror effort and stands as one of the best genre films of the 80s.\n\nIn this final entry of George Romero's \"Living Dead\" trilogy, the walking dead supposedly outnumber the humans by a ratio of 400,000 to 1. Twelve people who have devoted themselves to studying and wiping out the zombies hole up together in an underground missile silo, and for all we know, these could be the last twelve living humans on the face of the planet. Most of these people don't capture our sympathy like the foursome who holed up in the shopping mall in \"Dawn\". Half of them are gung-ho soldiers who seem to take great pleasure in threatening the scientific team, and Romero spends much of the first half focusing on the bickering and intense conflicts between these people. In fact, for over an hour, the hordes of living dead get very little screen time, as the story focuses on the tension between the characters, and the efforts of an off-the-wall scientist to train a captured zombie named Bub to act human. Compared to its predecessors, this long section of the film may seem slow and talky, but it is always interesting and, for the most part, effectively performed by its unknown cast. Besides, it all eventually leads up to a corker of finale when the zombies finally invade the compound, and most of the humans become showcases for the brilliance of Tom Savini, who outdoes even himself in the gore F/X department.\n\nWhile most of this material is very grim, \"Day\" ironically has the most hopeful, upbeat conclusion in the trilogy - which, alas, is its only major shortcoming. The quick transition to the final scene is so abrupt and unexpected that the audience feels cheated, leaving the impression that the production ran out of money before the whole climax could be filmed. Indeed, Romero has often expressed his unhappiness about being underfunded for this project, which prevented him from creating a truly definitive final chapter for the trilogy. But while \"Day of the Dead\" may not quite be the ultimate finish to one of the greatest trilogies of all time, it is still a very satisfying conclusion (at least until Romero gets funding for his long-rumoured \"Twilight of the Dead\"). It may not be popular among everyone, due to many unfair comparisons to its superior predecessors, but on its own, it is about as good as horror films get."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Day Of The Dead",
        "duration": "PT1M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3336177177",
        "name": "Day of the Dead (1985)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2JlMGU2OWItM2ZjZi00NzNjLThhYzMtZTVjZWVhOTYzOGFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2JlMGU2OWItM2ZjZi00NzNjLThhYzMtZTVjZWVhOTYzOGFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-08-19T03:11:50Z",
        "url": "https://www.imdb.com/video/vi3336177177/"
    },
    "url": "/title/tt0088993/"
}