{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Stanchev",
            "url": "/name/nm0821984/"
        },
        {
            "@type": "Person",
            "name": "L.B. Fisher",
            "url": "/name/nm0279635/"
        },
        {
            "@type": "Person",
            "name": "Jeff Geddis",
            "url": "/name/nm0311473/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 950,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "alternateName": "Daydream Believers: The Monkees Story",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0169188/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0016350/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014769/"
        },
        {
            "@type": "Person",
            "name": "Ron McGee",
            "url": "/name/nm0569130/"
        },
        {
            "@type": "Person",
            "name": "Harold Bronson",
            "url": "/name/nm0111514/"
        }
    ],
    "datePublished": "2000-06-28",
    "description": "The story of the Pre-Fab Four and their fight to be taken seriously as musicians.",
    "director": [
        {
            "@type": "Person",
            "name": "Neill Fearnley",
            "url": "/name/nm0269899/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWUyYjcxMmMtNTFjYy00MGMxLWI1N2ItNGZjNGEyYjNiYjI1XkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1_.jpg",
    "keywords": "the monkees,musician,music industry,television,television network",
    "name": "Daydream Believers: The Monkees' Story",
    "original_info": {
        "id": "Daydream Believers: The Monkees Story_2000",
        "name": "Daydream Believers: The Monkees Story",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kevinolzak"
        },
        "dateCreated": "2014-01-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0241357/"
        },
        "name": "Touches on just about everything on a low budget",
        "reviewBody": "Being a true Monkees buff, I'd have to say that, after one gets over the inaccuracies in the script, the filmmakers couldn't have done a better job. Unmentioned in previous reviews is the all-consuming egomania displayed by Colgems music president Don Kirshner, who made so much money during his 9-10 months in charge that his casual dismissal of the four individual Monkees is nothing less than petty (to the end of his life, he always insisted on total credit for their success). The script manages to incorporate just about all the most famous names associated with the group: songwriters (Neil Sedaka, Neil Diamond, Carole King, Tommy Boyce and Bobby Hart), and performers (The Beatles, Jimi Hendrix, Jack Nicholson). The four actors were all praiseworthy, particularly L. B. Fisher's Tork, who conveys that inner essence the show rarely allowed. The three others basically played extensions of themselves, but Peter had to play a kind of 'Harpo Marx/Stan Laurel' composite, not so much 'the dummy,' as he himself described it, but simply the trusting, naïve innocent, which of course he definitely was not. George Stanchev really nails Davy's moves, and probably bears the strongest physical resemblance to his namesake (amazingly, neither of these two actors worked beyond 2003). Jeff Geddis gets the full portrait of Nesmith, who wasn't as volatile as this suggests, nor apologetic, simply an ambitious young man who saw the TV series as a means to an end. Of course, he had the most experience in the studio (both as a writer and producer), and did encourage the others to compose their own songs. Aaron Lohr's Micky isn't as good as the others, but to be fair it appears he had less to work with, scriptwise; Micky Dolenz was such an enormous talent in front and behind the camera, that to this day his remains one of the most recognized voices of the 1960s. Rather than carp on what's missing, consider how the existence of this modest little biopic shot in Canada is not just a boon for The Monkees themselves, but a nice introduction for younger viewers unfamiliar with the phenomenon (forget 1987's The New Monkees). Actual Monkees recordings used: \"(Theme from) The Monkees,\" \"Last Train to Clarksville,\" \"I'm a Believer,\" \"Daydream Believer,\" \"I Wanna Be Free,\" and \"(I'm Not Your) Steppin' Stone,\" the latter two actual live performances from the band's 1967 summer tour (heck, the only essential one missing really is \"Pleasant Valley Sunday\"). \"All of Your Toys\" was a Bill Martin composition that earned the distinction of being their very first studio recording as a band (Jan 16 1967), but due to it not being a Screen Gems copyright remained in the can until 1987's MISSING LINKS release. As an added bonus, used during their meeting with The Beatles, is \"(All in the) All in All,\" from the 1998 disc RE-ZOOM by The Knack, a group that was ballyhooed in 1979 (\"My Sharona,\" \"Good Girls Don't\") as being 'Beatlesque,' and once you hear it you'll understand why.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0241357/"
}