{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason London",
            "url": "/name/nm0518715/"
        },
        {
            "@type": "Person",
            "name": "Wiley Wiggins",
            "url": "/name/nm0927812/"
        },
        {
            "@type": "Person",
            "name": "Matthew McConaughey",
            "url": "/name/nm0000190/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 189117,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018555/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049706/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0123642/"
        },
        {
            "@type": "Person",
            "name": "Richard Linklater",
            "url": "/name/nm0000500/"
        }
    ],
    "datePublished": "1993-09-24",
    "description": "The adventures of high school and junior high students on the last day of school in May 1976.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Linklater",
            "url": "/name/nm0000500/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM5MDY5MDQyOV5BMl5BanBnXkFtZTgwMzM3NzMxMDE@._V1_.jpg",
    "keywords": "hazing,high school,last day of school,student,texas",
    "name": "Dazed and Confused",
    "original_info": {
        "id": "Dazed and Confused_1993",
        "name": "Dazed and Confused",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "barrwell"
        },
        "dateCreated": "2010-10-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106677/"
        },
        "name": "If you like \"Fast Times at Ridgemont High\", you'll like this film!",
        "reviewBody": "Dazed and Confused has a lot in common with Fast Times at Ridgemont High; both movies contain a lot of future stars playing teenagers, both have lots of terrific Rock tunes on the soundtrack, and both derive laughs from their characters and situations and not through jokes, pratfalls and other typical Hollywood clichés. One difference between the two films is that Dazed and Confused is a period-piece, filmed in 1993 it takes place in 1976, and directer Richard Linklater does a marvelous job capturing the habits, the styles and the attitudes of the era. In that regard maybe this movie is more inspired by \"American Graffiti\" than Fast Times at Ridgemont. But it doesn't matter because to me D&C is the best of them all.\n\nThis movie seems to be as personal to Linklater as it is to me, and its not so much about plot or big scenes as it is about realism and the overall flow...and it flows beautifully. The movie follows a group of high school juniors and another group of 8th graders (next years seniors and freshmen)through the events surrounding the last day of school in Austin, Texas in 1976 (the whole film takes place in approximately 24 hours). We observe the hazing, the partying, some introspective banter and many familiar rituals as the characters prepare not just for the summer, but for the next school year and beyond. This was the same general time period I was in high school, so this movie had a special impact on me. \n\nAt this point I need to mention Wooderson (McConaughey,in his film debut), a key character, he's that 20-something dude that still hangs with the high school crowd. Did every town in America have a guy like this or what? Wood, Dawson, Slater, Pickford; these guys all remind me of guys I grew up with in my hometown. \n\nThe greatness of this film is that it rings so true...the way the \"jocks\" party with the \"freaks\" (or \"grits' as they were also called where I grew up), the way they just aimlessly cruise around in muscle cars until they find out where the party's at, or the mailbox bashing (here it was beer bottles thrown at signs), or even the bottle cap flipping...we did that all the time! The only thing i didn't see was a bong. (besides the one Slater was making in shop class..HEY, we did that too!) Yeah thats right -joints are better for cruising anyway.\n\nThis is the kind of movie to rent on one of those Friday nights where you have to work early the next day. I first rented this movie on one of those very nights. Its a great Friday night movie and why not? No heavy handed plot, lots of partying and good music, and it makes you feel good. Speaking of the soundtrack...Linklater makes great use of period music; We get the gamut of 70s pop/rock including Aerosmith, Ted Nugent, ZZ Top, War, Dylan and even Black oak Arkansas (remember them?)....Jim dandy to the rescue! This movie really took me back.\n\nDazed and Confused is also a bit of a curio because of all the young actors (who were all unknown at the time) who went on to star in other movies. You will see Matthew McConaughey (his best performance ever), Ben Affleck, Parker Posey (she's a riot), Adam Goldberg, Joey Lauren Adams and Milla Jovavich (ok,i'm reaching now), among others. My only complaint involving the cast is that Wiley Wiggins' (as Mitch Kramer) mannerisms are a bit irritating, but other than that everyone does a tremendous job. \n\nThis movie has become like a fascinating time capsule about that post-revolutionary decade of the 70s, a decade filled with great music, movies and television (seriously, what the heck has happened to entertainment in this country?)... so its worth viewing for historical and social aspects as well as its entertainment value.\n\nBut anyway, I hope you enjoy one of my personal favorites...a really cool, funny and realistic look at what teenage life was like in so many towns in America in the mid-70s.\n\nIt may be set in Texas, but it could just as easily be Ohio.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3349152025",
        "name": "Dazed and Confused",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2ZiYzY0OWUtYzZkMS00MTFkLWEwNDUtZWNlMmQxMGUxZTcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2ZiYzY0OWUtYzZkMS00MTFkLWEwNDUtZWNlMmQxMGUxZTcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:46:05Z",
        "url": "https://www.imdb.com/video/vi3349152025/"
    },
    "url": "/title/tt0106677/"
}