{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Timothy Bottoms",
            "url": "/name/nm0000961/"
        },
        {
            "@type": "Person",
            "name": "John Cunningham",
            "url": "/name/nm0192351/"
        },
        {
            "@type": "Person",
            "name": "David Fonteno",
            "url": "/name/nm0285046/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 933,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052980/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019459/"
        },
        {
            "@type": "Person",
            "name": "Lionel Chetwynd",
            "url": "/name/nm0156417/"
        }
    ],
    "datePublished": "2003-09-07",
    "description": "This is the story of the days directly after 9/11, and the president's whereabouts.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Trenchard-Smith",
            "url": "/name/nm0872062/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0MDM2Mzk0NV5BMl5BanBnXkFtZTcwMzA4ODYyMQ@@._V1_.jpg",
    "keywords": "the white house washington d.c.,president,world trade center manhattan new york city,tragic event,new york city",
    "name": "DC 9/11: Time of Crisis",
    "original_info": {
        "id": "DC 9|11: Time of Crisis_2003",
        "name": "DC 9/11: Time of Crisis",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "royh-2"
        },
        "dateCreated": "2004-09-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0353042/"
        },
        "name": "Powerful, moving.",
        "reviewBody": "This movie does its best to be accurate, and it does a pretty good job. If you're looking for fuel for a conspiracy theory, it isn't here. The film captures the essence of the man who now sits in the Oval Office, and how he and his team worked to deal with the tragedies of the WTC, the plane hijackings, and the Pentagon.\n\nIt is a powerful film. Be prepared to be moved.\n\nThe film serves to remind the viewers of the combined tragedies, and the impact on our national psyche. If you have somehow dozed off to the implications of 9/11, this film might serve to wake you up.\n\nBy the end of the film, if you don't feel the surge of love for your country and the compassion and pride that goes with it, perhaps you need to check your partisanship at the door. When we were attacked on Sept. 11, 2001, the terrorists didn't target just Democrats, or just Republicans. They weren't even targeting just Americans. The World Trade Center was a financial icon for the world, and was as multi-ethnic and multi-national as any single building besides the U.N. headquarters can be. No, the WTC attack on 9/11 was an indication that the attacks previously focused on the United States had just been expanded against all Western nations, and by extension - on Christians, Jews, Muslims who do business with them, and on all non-Muslims. It was a renewed declaration of war, and this film portrays the leaders who helped us through the tragedy as a nation, and as a result - it focuses around the one man who did the most to comfort a grieving nation."
    },
    "url": "/title/tt0353042/"
}