{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin Kline",
            "url": "/name/nm0000177/"
        },
        {
            "@type": "Person",
            "name": "Ashley Judd",
            "url": "/name/nm0000171/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Pryce",
            "url": "/name/nm0000596/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11550,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0098170/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049390/"
        },
        {
            "@type": "Person",
            "name": "Jay Cocks",
            "url": "/name/nm0168379/"
        }
    ],
    "datePublished": "2004-08-06",
    "description": "Inspecting a magical biographical stage musical, composer Cole Porter reviews his life and career with his wife, Linda.",
    "director": [
        {
            "@type": "Person",
            "name": "Irwin Winkler",
            "url": "/name/nm0005563/"
        }
    ],
    "duration": "PT2H5M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIyODgwODIyNF5BMl5BanBnXkFtZTcwMTkzMTczMw@@._V1_.jpg",
    "keywords": "jukebox musical,horseback riding,cole porter character,monty woolley character,louis b. mayer character",
    "name": "De-Lovely",
    "original_info": {
        "id": "De-Lovely_2004",
        "name": "De-Lovely",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "finemot"
        },
        "dateCreated": "2004-08-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0352277/"
        },
        "name": "De-Lovely: De-Railed!",
        "reviewBody": "As a child of the '30s, I was immersed in Hollywood musicals I bit more than I appreciated. I loved [still do] good music, a clever lyric, a moving melody, with a good degree of tolerance for experimentation with the off-beat and planned discord of a Stan Kenton. Cole Porter always symbolized meticulous word-play wed to impeccable melodic phrasing.\n\n From the opening scenes, the vehicle of \"De-Lovely\"'s presentation was both an annoyance and a distraction. Was this a bio trying to become a musical; or was it a musical trying to be a bio? While this last observation may be my own singular and subjective problem, I squirmed mentally as I tried to figure out whether the makeup artists wanted to make Kevin Kline look like an aging Jeff Daniels, or a real-time Carl Reiner?\n\nIt would be nearly impossible to destroy Porter's music; the quality is there regardless of the interpretation. However, the matching of score selection to fragments of Porter's life, professional development and composing venues is a tawdry hodge-podge, put together like a 1940s 7th grader who scores 37% on an American History matching-columns exam. Some of the costumes, stagings and vocals are ludicrous: the costuming and set design for the Venetian duet, two people who appear not to like each other or the fit of their costumes; and the feeble-voiced crooning of a \"Mountie\" [Nelson Eddy - sound alike]: NOT!\n\nThen there is the presentation of Porter, the man [Kline] and his long-suffering wife [Ashley Judd, excellent with the role she's given]. We can accept the idiosyncratic behavior of genius; we can appreciate a reasonable degree of self-absorption; we can empathize with a free spirit, suddenly crippled and dependent on others. Mrs. Porter knew exactly what she was getting when she entered the marriage; and while we can empathize with her fraying patience, we might expect a bit more fire from a woman whose husband is presented as sexual and social gadabout concerned only with his own gratification, except when the deeper muse is upon him. Finally, there is the staged number with Louis B. Mayer, which itself, would make the MGM lion dyspeptic. Porter may have been an intellectual snob; and Mayer may have been a boorish bully, but Mayer wasn't stupid.\n\nEven in its presentation of Cole's homosexuality, we are introduced to a trite parade of pretty boys; and, within this shallow presentation, we are expected to see deep, caring relationships. It's been years since I've read a Porter biography, but the viewer might better have been served by suggestion: a lone Porter, for example, headed for the city tenderloin, or a seedy bar down by the waterfront, with the camera fading without further graphic explanation. Porter's encounters weren't all that \"pretty.\"\n\nAhhh, the music. For me there were three show-stoppers, among them Elvis Costello's \"Let's Misbehave.\" My wife and I, both 21+ X 3 + a bunch. thoroughly enjoyed Sheryl Crowe's minor key and roving \"Begin the Beguine.\" It was a refreshing treatment of a Porter standard, which, although cleverly composed and worded, had become cliché in its title and too rigidly fixed in its arrangements. Crowe tosses out her usually fragile vocalizing; shows her musicianship in her rendering, and best of all, sings and phrases as a mature woman, not a whining little girl. Whether the precise Porter would have approved, I can't say; but Crowe gives the song a well-deserved rebirth. \n\nBest of all is the top-notch performance of \"Let's Do It,\" by Alanis Morissette: her vibratto; her full-of-fun, carefree delivery; her meticulously clear enunciation of the fast-flowing words are superb. The lady nails it!\n\nThe movie is a terrible disappointment; but it's not the music that brings it down. It is the trivializing of a privileged, yet tragic life. Its sole salvation is the wedding of gifted contemporary vocalists, with priceless old standards; and it may bring about performance revitalization and longevity enhancement for both."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4233871641",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2RmYmVjNjctM2Y4Ni00NmM1LTg2ZGYtOTg3OTQ2MzQ2Njc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2RmYmVjNjctM2Y4Ni00NmM1LTg2ZGYtOTg3OTQ2MzQ2Njc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-09T23:16:58.138Z",
        "url": "https://www.imdb.com/video/vi4233871641/"
    },
    "url": "/title/tt0352277/"
}