{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Johnny Depp",
            "url": "/name/nm0000136/"
        },
        {
            "@type": "Person",
            "name": "Gary Farmer",
            "url": "/name/nm0001200/"
        },
        {
            "@type": "Person",
            "name": "Crispin Glover",
            "url": "/name/nm0000417/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 99262,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052813/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002923/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0082027/"
        },
        {
            "@type": "Person",
            "name": "Jim Jarmusch",
            "url": "/name/nm0000464/"
        }
    ],
    "datePublished": "1996-05-10",
    "description": "On the run after murdering a man, accountant William Blake encounters a strange aboriginal American man named Nobody who prepares him for his journey into the spiritual world.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Jarmusch",
            "url": "/name/nm0000464/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Adventure",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjZiMDUyYmEtNzAwYy00YjNiLWEyODItNTJmMjZjOWQ3MThlXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "revisionist western,1870s,native american,neo noir,wanted poster",
    "name": "Dead Man",
    "original_info": {
        "id": "Dead Man_1995",
        "name": "Dead Man",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jluis1984"
        },
        "dateCreated": "2006-09-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112817/"
        },
        "name": "A wonderful journey through life and death...",
        "reviewBody": "The Western genre has always been misunderstood as a simplistic, racist (and misogynistic) traditional genre due to the many mediocre Westerns of the 40s and 50s. However, real good Westerns have delighted us with complex stories that take advantage of the setting themes: the conflict between honor & law, wilderness & civilization, and life & death. Director Jim Jarmusch, who has achieved fame and recognition in the independent film community, uses the elements of the Western genre to create his very own poetical meditation on these themes, giving the genre his personal touch crafting a powerful and original gem.\n\nYoung accountant William Blake (Johnny Depp) seems to have lost everything as his parents have died and his fianceé left him without a reason; so he decides to take a job in Machine, a town located at the end of \"civilization\" in the Wild Wild West. To his misfortune, the job he applied to has already been taken and now he finds himself really without nothing. However, his life will change forever after by a series of circumstances he ends up murdering a man, becoming an outlaw, although getting badly wounded in the process. Now, traveling along an outcast native who calls himself \"Nobody\" (Gary Farmer), he'll begin a strange and surreal trip that'll prepare him for the next stage.\n\nWritten by Jarmusch himself, the film's story details Blake's trip guided by Nobody in a similar way to Dante's journey in \"The Divine Comedy\", where a series of \"episodes\" are used to explore different ideas and themes across the trip. Jarmusch subtlety mixes drama and comedy to deliver his philosophical meditation making the film an entertaining experience, never becoming boring or tiresome. The Western setting is used effectively to tell this story and \"Dead Man\" toys with the Western elements in a subtle, respectful and quite entertaining way that neither parodies it nor makes fun of it in any way.\n\nShot entirely in black and white, the cinematography (by Jarmusch regular, Robby Müller) captures that feeling of loneliness and emptiness that William Blake's life has, as well as his collision with the wilderness of the wild west. Jarmusch camera-work together with Neil Young's excellent soundtrack give the film a beautiful surreal look that echoes Blake's equally surreal journey across the darkness searching for light. Finally, another interesting point is Jarmusch extensive care for detail in his portrayal of the American west, as well as his respect for the Native American cultures that play an important role in his film; making \"Dead Man\" one of the most realist Westerns ever made.\n\nJohnny Depp's performance is remarkable, and probably one of the best in his career. Blake's complete transformation across the film is a real challenge and Depp makes the most of it. Gary Farmer is equally excellent and he is as effective in the comedy scenes as he is in the drama scenes, showing his flexibility and talent. The supporting roles present an assortment of cameos where actors such as Crispin Glover, Lance Henriksen, John Hurt and Robert Mitchum (in his last role) appear giving outstanding performances despite the limited screen time they receive. Henriksen certainly delivers his best performance in years.\n\nJarmusch's film is a brilliant poetical meditation of life and death, but its episodic nature make it feel even more slow than it is, as every vignette is separated by fade outs that break the mood created. This really damages the film's atmosphere, as it feels as a forced wake up after a pleasant dream. Another problem, is that fans expecting an action-filled Western may end up disappointed, so bear in mind that this film is more about feelings rather than actions. Despite his minor problems, the film is still a very enjoyable experience and a whole new way to experience Westerns, so even non-fans of the genre will appreciate it.\n\nTo summarize, \"Dead Man\" is an atypical look at Westerns that presents Jarmusch's interesting views on life and death in an entertaining, attractive way. Among the revisionist westerns, \"Dead Man\" is a valuable gem that is worth a watch. Even non-fans of the genre will find something interesting in it. 9/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3303972377",
        "name": "Dead Man",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWYyYWZiZmMtMmUzZS00NDkzLTk1OGEtMzI5Y2RiNWQ3ZGE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWYyYWZiZmMtMmUzZS00NDkzLTk1OGEtMzI5Y2RiNWQ3ZGE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:16:11Z",
        "url": "https://www.imdb.com/video/vi3303972377/"
    },
    "url": "/title/tt0112817/"
}