{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Corbin Bernsen",
            "url": "/name/nm0000929/"
        },
        {
            "@type": "Person",
            "name": "Stephen J. Cannell",
            "url": "/name/nm0004798/"
        },
        {
            "@type": "Person",
            "name": "Robert Conrad",
            "url": "/name/nm0001066/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 408,
        "ratingValue": 3.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Stephen J. Cannell",
            "url": "/name/nm0004798/"
        }
    ],
    "datePublished": "2002-09-08",
    "description": "Students and teachers begin dying the same way as a video depicts.",
    "director": [
        {
            "@type": "Person",
            "name": "Chuck Bowman",
            "url": "/name/nm0101304/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIzMzU0NjA4NF5BMl5BanBnXkFtZTcwNzUxNTYyMQ@@._V1_.jpg",
    "keywords": "teen slasher,stalker,axe in the chest,slasher,neck breaking",
    "name": "Dead Above Ground",
    "original_info": {
        "id": "Dead Above Ground_2002",
        "name": "Dead Above Ground",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bezenby"
        },
        "dateCreated": "2013-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0284045/"
        },
        "name": "Dead Above Neck",
        "reviewBody": "I wanted to take an axe to my own face when it became apparent, after the scene where Corbin Benson was killed (offscreen), that I would watching yet another slasher film based around teenagers at a school. It's like the film wants you to hate everyone immediately - you've got the jock, his fashion conscious girlfriend, her blonde pal, the wisecracking computer geek (who, it turns out later, can hack the police database), two token black folks who talk awful, cringeworthy hip talk, and two way over the top goth people, one of whom spouts the most insane babble about astral planes and netherworlds.\n\nSo that's your stereotypes right there, and don't be thinking this film is going to play against convention, because it's not. Our goth guy makes a horror film, gets ridiculed, and ends up driving over a cliff. A year later, another guy turns up (now living at the goth's house) and says he's been dreaming about the goth guy and bad things are going to happen. We all know that's slasher speak for 'everyone's going to get killed' right?\n\nHowever, in order to get to the kills we've got to got through teen drama fluff (the jock and his girlfriend and her parents), an adult love quadrangle (the school shrink, the old teacher, the gym teacher, and the cop), the goth chick mourning for her pal, and not a whole lot less. I'm sure half the cast had died of old age before the killings started, and that's when the film truly enter the realm of \"Pure Crap\".\n\nThere's hardly any gore here at all! I think one or two killing happened on screen, with the rest being after the fact. Here's a warning to put you off buying this thing - by the end of the film most of the cast are still standing. There's also a sex scene that's about as erotic as jabbing at a jellyfish on a lonely beach in winter, a heavy metal soundtrack, and more psychobabble about Pagan spirits that you'll be able to stand.\n\nNot a good film at all. Where's the beef?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0284045/"
}