{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Ellen Muth",
            "url": "/name/nm0616091/"
        },
        {
            "@type": "Person",
            "name": "Callum Blue",
            "url": "/name/nm0089485/"
        },
        {
            "@type": "Person",
            "name": "Jasmine Guy",
            "url": "/name/nm0004982/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 42775,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0100002/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041991/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071026/"
        },
        {
            "@type": "Person",
            "name": "Bryan Fuller",
            "url": "/name/nm0298188/"
        }
    ],
    "datePublished": "2003-06-27",
    "description": "After being hit on the head by a toilet seat fell from Mir space station, a young temp clerk becomes a grim reaper in death.",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTE5OTM0NTIzN15BMl5BanBnXkFtZTcwOTQ4MTAwMQ@@._V1_.jpg",
    "keywords": "death,grim reaper,undead,black comedy,soul",
    "name": "Dead Like Me",
    "original_info": {
        "id": "Dead Like Me: Season 1_2003",
        "name": "Dead Like Me: Season 1",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "23skidoo-4"
        },
        "dateCreated": "2004-06-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0348913/"
        },
        "name": "Sheer brilliance",
        "reviewBody": "Dead Like Me is one of those unique TV series that will be remembered long after \"flavors of the day\" shows like The Sopranos are forgotten. It is bright and dark, hilarious and sad, awe-inspiring and introspective -- all at the same time. It is a wonderful piece of television.\n\nI recently saw the season one DVD set and I must say this show is a marvel. Although it took me a few episodes to warm up to Ellen Muth as George the slacker grim reaper, the show was easily carried by old pro Mandy Patinkin as food-loving reaper Rube and his co-stars, including the gorgeous Rebecca Gayheart who makes a welcome - though all to brief - return to TV after coming off her own real-life tragedy which rivals anything seen on Dead Like Me. I won't rehash the details or the debate -- go look up her IMDb biography if you need more information.\n\nThe rest of the cast is outstanding, including Jasmine Guy - much older and wiser than her Different World days - Callum Blue and latecomer Laura Harris as George's fellow grim reapers. Harris, as wannabe actress Daisy, starts out annoying but very quickly develops layers that make her among the show's most interesting characters.\n\nThe format of the show is fascinating as there are two arcs going at the same time: George adjusting to the afterlife, and her family slowly falling apart because of her death. Central to this is George's kid sister Reggie, played by newcomer Britt McKillip. It probably isn't considered kosher to refer to an 11-year-old as beautiful unless you're a parent, but keep an eye on this one as she is going to develop into a spectacular talent.\n\nOf course, a supporting cast means nothing without a strong lead, and Ellen Muth more than delivers. As I said above, she took a little getting used to, with her unconventional looks and a performance that gives \"quirky\" a whole new twist. It wasn't long before Muth truly owned the show and the character, and her narration is hilarious and touching throughout.\n\nThere were a few minor missteps in the show's first year. For some reason it was decided to do a flashback/clips episode at the 3/4 mark of the season. I will admit that the episode is fantastic and actually one of my favorites, but it might have been stronger without the flashbacks. Such things might be necessary when you're trying to create a jumping on point for an arc, but this isn't the case with Dead Like Me -- and the first season was only 14 episodes long; too short to need a recap.\n\nThe other problem I have with the show is the apparent use of the \"Reset button\" between most episodes. The events of one episode do not necessarily carry over into the next. This is very apparent as George appears to forget certain lessons learned in the previous episode on occasion. This is probably a minor quibble as this might not be so apparent if you watch the show in weekly chunks rather than all at once.\n\nOn the other hand, Dead Like Me is the first made-for-cable series I have seen that integrates adult language and sex (though the latter is relatively minor) in a way that is not jarring. This is not a kid's show, but I wouldn't have a problem letting a teenager see it.\n\nDead Like Me is easily the best series of the 2003-2004 television season, with Wonderfalls -- created by the same man -- in a very close 2nd place though it only aired 4 episodes. Dead Like Me deserves all the Emmys it can get."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Dead Like Me: Season 1",
        "duration": "PT56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi59292953",
        "name": "Dead Like Me: Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGQ3YmYwNzktNTA1NC00ZGZjLWExMjUtYjdlNjY5ZjM3ZmQ2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGQ3YmYwNzktNTA1NC00ZGZjLWExMjUtYjdlNjY5ZjM3ZmQ2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-18T06:36:28.180Z",
        "url": "https://www.imdb.com/video/vi59292953/"
    },
    "url": "/title/tt0348913/"
}