{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marian Araujo",
            "url": "/name/nm1399703/"
        },
        {
            "@type": "Person",
            "name": "David Muyllaert",
            "url": "/name/nm2045505/"
        },
        {
            "@type": "Person",
            "name": "Eoin Whelan",
            "url": "/name/nm1120021/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2306,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0101383/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018776/"
        },
        {
            "@type": "Person",
            "name": "Conor McMahon",
            "url": "/name/nm1114700/"
        }
    ],
    "description": "An infection spreads from slaughtered animals to humans, which causes the dead to rise and feed on the living.",
    "director": [
        {
            "@type": "Person",
            "name": "Conor McMahon",
            "url": "/name/nm1114700/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Action",
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGUxZTQ0YjYtNDVlNy00OTA2LTg5YmMtNWRhYmRlMDgwMzkyXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_.jpg",
    "keywords": "cow,stabbed in the eye,blood splatter,hit with a shovel,hit by a car",
    "name": "Dead Meat",
    "original_info": {
        "id": "Dead Meat_2004",
        "name": "Dead Meat",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2018-12-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0369359/"
        },
        "name": "Simple zombie carnage.",
        "reviewBody": "Do you like your zombie films without the constant melodrama, but with a primal narrative stripped to the bone, overly familiar in pattern (with lots of driving, stomping, running, fighting and hiding) and choked with practical gore effects? Then the low-budget Irish zombie horror DEAD MEAT might be right up your alley.\n\nThe plot is of no real importance, no topical message (unless you count its abrupt, non-resolution ending), and no flesh (thematically speaking), other than to set-up people surviving a mad cow disease outbreak infecting the populace of an Irish countryside, turning them into devouring flesh-eating zombies. There's a quick exposition dump of what's happening when a car radio is turned on, but these characters mainly learn it the hard way. Each arising situation seems to finish on zombie carnage in what starts off as a couple, eventually becomes hordes upon hordes of living dead; you even a get mad cow or two joining in on the mauling action. Some neat zombie kills involving a vacuum cleaner, high heels and screwdriver too. You got to remember though, this is really low-budget and for majority it shows in all aspects. It was actually more limited than I was expecting, but the gushing effects and cadaverous make-up while varied (even using some raw leftovers from the butchers) are competently executed.\n\nThe opening moments of the couple driving in the countryside feels like a head nod towards the intro of \"Night of the Living Dead\", and the filming style with its swirling, lively camera-work had me thinking of \"The Evil Dead\", but without the kinetic flair. Actually the way it was filmed, felt a little maverick and experimental in its constant disorienting changes in cinematography and editing. Set-pieces can get repetitive and lighting during the night time scenes is simply a flashlight, but it never lingers and the vast rural backdrop serves its purpose in creating a real unnerving sense of hopelessness and isolation from the real world. The characters are paper thin, but sometimes it was hard to understand what was being said, especially when they mumble or bicker, due to a couple of thick accents. In a way it wasn't easy to connect with these characters, but there was a believable quality to the performances. Actually come to think of it, maybe there were a few moments of character insight, but it just went over my head because I kept finding myself going in and out due to the heavy accents?\n\n\"DEAD MEAT\" won't blow you away. It doesn't add anything new to the sub-genre, or pretend to be anything other than homage, but I did enjoy the simplicity and abundance of low-grade gore.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0369359/"
}