{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Beverley Wilson",
            "url": "/name/nm2073323/"
        },
        {
            "@type": "Person",
            "name": "Antonia Beamish",
            "url": "/name/nm1028030/"
        },
        {
            "@type": "Person",
            "name": "Brendan Gregory",
            "url": "/name/nm1092067/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 347,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0201218/"
        },
        {
            "@type": "Person",
            "name": "Andrew Parkinson",
            "url": "/name/nm0662820/"
        }
    ],
    "datePublished": "2001-09-25",
    "description": "A group of women afflicted with a horrible disease (which forces them to cannibalism) try to support one another.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Parkinson",
            "url": "/name/nm0662820/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA5OTg0MDk4ODZeQTJeQWpwZ15BbWU3MDMzMTUwMzE@._V1_.jpg",
    "keywords": "disease,cannibalism,vampire,torture,squatter",
    "name": "Dead Creatures",
    "original_info": {
        "id": "Dead Creatures_2000",
        "name": "Dead Creatures",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BA_Harrison"
        },
        "dateCreated": "2014-11-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0301163/"
        },
        "name": "Decaying flesh and urban decay.",
        "reviewBody": "The blurb on the back of my DVD for Dead Creatures describes the film as a cross between the work of Mike Leigh, Ken Loach and George Romero. I'm a big fan of Romero's movies, but cannot abide the dull and depressing social realism of the first two directors; consequently, I found Dead Creatures a tough watch, far removed from Romero's zombieverse despite some pretty nasty and fairly well executed gore effects (given the low budget).\n\nDescribing Dead Creatures as a zombie movie is actually extremely misleading: the women in this film are not dead, but rather suffer from a degenerative disease that rots the skin and gives them a craving for human flesh. What we have here are cannibals! Sadly, they're boring and rather unlikeable cannibals, a skanky group of women who spend far too much of their time engaging in dreary conversation, smoking, swigging beer, and, in the case of Anne (Antonia Beamish), shagging total strangers for cash, when they should be munching guts.\n\nThankfully, when they do get around to feeding between chin-wagging, the film is suitably yucky: appendages are lopped off and passed around like chicken wings, and there is one delightfully revolting scene where the girls tuck into a headless torso in graphic detail, slicing off succulent morsels with a carving knife. Meanwhile, a crazed father is desperately searching for his missing daughter, abducting those he believes might be able to tell him where she is; when they fail to help, he shoots them through the head with a bolt-gun and chops them up.\n\nI rate Dead Creatures 5/10 for the gore, but only 2/10 for the actual storytelling and acting, averaging out at 3.5/10 overall, which I'll round up to 4 for big-breasted slapper Anne simply because she has cool taste in T-shirts (she sports designs for Russ Meyer's Super Vixens, cult '50s sci-fi Attack of the 50ft Woman, and '70s TV series Charlie's Angels).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0301163/"
}