{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Pete Penuel",
            "url": "/name/nm0672420/"
        },
        {
            "@type": "Person",
            "name": "Allison Adams",
            "url": "/name/nm1336802/"
        },
        {
            "@type": "Person",
            "name": "Brian Minyard",
            "url": "/name/nm1336605/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 446,
        "ratingValue": 3.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0208521/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093520/"
        },
        {
            "@type": "Person",
            "name": "Rory Penland",
            "url": "/name/nm1335286/"
        },
        {
            "@type": "Person",
            "name": "Bill Suchy",
            "url": "/name/nm0837087/"
        }
    ],
    "datePublished": "2003-04-22",
    "description": "A wealthy big game hunter leads a team of expert archaeologists into the jungle on what appears to be a fact-finding expedition. However, when they discover a deserted campsite and gory human remains, curiosity quickly turns to te...",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel Springen",
            "url": "/name/nm1214055/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzFhN2YwNWMtNjc0Mi00NzVjLWI3MmEtMjQ2N2ZkYmJlYWY4XkEyXkFqcGdeQXVyOTczNDEzMTU@._V1_.jpg",
    "keywords": "jungle,jungle adventure,female nudity,female topless nudity,female rear nudity",
    "name": "Deadly Species",
    "original_info": {
        "id": "Deadly Species_2002",
        "name": "Deadly Species",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "I_Ailurophile"
        },
        "dateCreated": "2022-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0355364/"
        },
        "name": "Somehow, it's not The Worst. But that's not saying a lot.",
        "reviewBody": "To say that 'Deadly species' struggles with authenticity is a critical understatement. The actor in the major role of the wealthy \"big game hunter\" looks and acts like a junior computer technology major at a state college who was begrudgingly convinced to participate in the class project of some friends. While his is the most dire portrayal, he is crudely joined in that ham-handedness by all others on hand. The outfits of the expeditionary team are assembled with at best a partial sense of attentiveness and realism. Why, in kindness I'll assume that most aspects of the feature were deeply constrained by a low budget - there's nothing here that doesn't suffer from a terrible lack of genuineness: wardrobe, props, makeup, production design, camerawork and editing, sound design, acting; I assume even the screenplay was chopped into mincemeat by the limited resources available to realize the concept.\n\nI will generously assume that everyone contributing to the feature did what they could with what they had to work with, including not least of all the FX crew behind the creature design. Moreover, in fairness, it seems that literally everyone involved have few if any additional credits to their name, or that this is generally a film very early in their careers. (As a minor example - probably the most recognizable name of all in attendance, this is only the second listed credit of Amber Midthunder, who was then only 5 years old at the time and has less than a bit part.) Still - I can operate on all the presuppositions I like, yet that does not fundamentally change the fact that 'Deadly species' is a bit of a chore to watch.\n\nI've never seen nudity this plainly gratuitous. Dialogue is contrived beyond all belief, and characters are so thin they're little more than set pieces. Scene writing is as unbothered (and sometimes downright unintelligent) as Daniel Springen's direction (including guidance of his cast), and the overall narrative as it presents is perhaps best described as functional. Jon Greathouse's score sounds like a collection of rough sketches that were never developed further, and effects including blood and gore break suspension of disbelief. Meanwhile, the actors' delivery, expressions, body language, and basic movement and actions in each scene feel forced and unnatural on the most basic level. Can their inadequacy be chalked up simply to a lack of ability? To the utmost fruitlessness of the material, and the direction? Both?\n\nTrue, I can't say I expected anything different. And 'Deadly species' certainly doesn't pretend to be anything it's not - it works, as well as it could, on its level. Unfortunately, that level requires astounding magnanimity as a viewer to refrain from holding it in utter contempt. Though I may be disappointed, I'd be keen on reading a history of this production - just how, exactly, did it come into being? Even the best ideas herein are rendered with incredible gracelessness - and there are not many good ideas in the first place. Amazingly, there are still worse movies out there (and I've definitely seen some of them), but that doesn't say much. Frankly, there's no real reason to watch this, except perhaps for extreme curiosity or desperate boredom - and even at that, your time would be better spent doing something else.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi178323737",
        "name": "Deadly Species",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDRhOGM0ZWMtZWYzMS00ZjkwLThiNGQtZTJmODUyMWE0MjIxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDRhOGM0ZWMtZWYzMS00ZjkwLThiNGQtZTJmODUyMWE0MjIxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:47:01Z",
        "url": "https://www.imdb.com/video/vi178323737/"
    },
    "url": "/title/tt0355364/"
}