{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "F. Murray Abraham",
            "url": "/name/nm0000719/"
        },
        {
            "@type": "Person",
            "name": "Keith Carradine",
            "url": "/name/nm0001018/"
        },
        {
            "@type": "Person",
            "name": "Patricia Childress",
            "url": "/name/nm0157540/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1804,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063390/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069955/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045255/"
        }
    ],
    "datePublished": "1996-05-12",
    "description": "In this prequel to \"Lonesome Dove\", two young men join the Texas Rangers unit that's on a mission to annex Santa Fe.",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmYyY2UzM2QtNjVjMC00NWUwLTkwYTgtMzhkYzZlNDUxMWE0XkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "year 1842,new mexico desert,new mexico territory,territory,arrow",
    "name": "Dead Man's Walk",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tron-12"
        },
        "dateCreated": "2001-06-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115238/"
        },
        "name": "TRUE Texas History, compressed for drama",
        "reviewBody": "While the previous comments praise the actors' style and likeness in terms of their forebears (Jones and Duvall), this movie is a pleasure to watch by way of the incredible scenery and the presence of several veteran character actors like Harry Dean Stanton, Keith Carradine, and the always awesome, Edward James Olmos. Fans of \"O Brother Where Art Thou\" will be pleased to see Ray McKinnon and Tim Blake Nelson featured prominently. I also noticed all of the previous comments were written by Yankees, so I might point out that the landscapes are a bit flawed (albeit beautiful) in terms of Texas-New Mexico geography. I've been to all of the places described in the book... believe me, most of West Texas is flatter than they let on! The sunsets are accurate, as are the rocky buttes, but they're using the Davis Mountains of the Big Bend region as the backdrop for most of the film, and that's a bit of a stretch. If you ever want to see some of the most beautiful scenery in West Texas, visit there sometime. The real places they traveled weren't always so pretty. I found that the actors didn't seem to be struggling for food and water as much as the characters in the book. Survival (man vs. nature) is a big part of the novel, and doesn't feature too prominently here. I kept getting hungry and thirsty while reading it! McMurtry mixes in a lot of real events with the narrative. You might think this stuff is fiction... it's not! Bigfoot Wallace was a real character and was known to have done many of the things this character experiences. The real Bigfoot survived to tell the tales as a seasoned old fart. The Santa Fe expedition is real.. and what happens to them is real. The Comanches as the lords of the plains? You bet! The were the kings of the Llano Estacado for 200 years. Buffalo Hump was real Comanche chief... his real name, Hard Penis, was too much for 19th century Texans so they gave him the new moniker. The descriptions of torture? McMurtry uses real sources.. he doesn't have to make this stuff up to be shocking... it really happened! The timeline is a bit compressed for drama, but the Texans of the 1840's lived this stuff. The Black Bean drawing is also real, but it happened in Saltillo Mexico and 17 guys drew black.\n\nFor a dose of Texas History, you can't beat Dead Man's Walk. Read the book! But don't be afraid to read James Haley's \"Texas: From Frontier to Spindletop\". It's the real deal and includes just as much gore, drama, and adventure."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT2M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2984117017",
        "name": "Dead Man's Walk",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQ4NDZjNmEtMDU4ZC00ZDM1LTgxMzYtNWZiYzU4NjgyZjc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQ4NDZjNmEtMDU4ZC00ZDM1LTgxMzYtNWZiYzU4NjgyZjc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-01-09T06:24:38Z",
        "url": "https://www.imdb.com/video/vi2984117017/"
    },
    "url": "/title/tt0115238/"
}