{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shô Aikawa",
            "url": "/name/nm0014558/"
        },
        {
            "@type": "Person",
            "name": "Maria Chen",
            "url": "/name/nm1131117/"
        },
        {
            "@type": "Person",
            "name": "Richard Chen",
            "url": "/name/nm1129364/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2686,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045027/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058338/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066530/"
        },
        {
            "@type": "Person",
            "name": "Hitoshi Ishikawa",
            "url": "/name/nm0411056/"
        },
        {
            "@type": "Person",
            "name": "Yoshinobu Kamo",
            "url": "/name/nm1130094/"
        },
        {
            "@type": "Person",
            "name": "Toshiki Kimura",
            "url": "/name/nm0454124/"
        }
    ],
    "datePublished": "2002-01-12",
    "description": "The ace cop of a totalitarian police force and a drifting android play their parts in a post-apocalyptic society. They are destined to fight. Their encounter will change them forever.",
    "director": [
        {
            "@type": "Person",
            "name": "Takashi Miike",
            "url": "/name/nm0586281/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWJjMzdkMzAtNzgxNC00NzIyLTljNGQtOTQwNjI4M2Y0ZDc4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "female police officer,japanese cyberpunk,totalitarian,son,rebel",
    "name": "Dead or Alive: Final",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fitchalex"
        },
        "dateCreated": "2002-11-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0301167/"
        },
        "name": "Lackluster finale to the controversial trilogy",
        "reviewBody": "Dead or Alive - Finale\n\n.and it starts so well: a dirigible with neon signs beneath floats over a desolate city street, the sky is yellow (from pollution?) and the underclass run from the reproduction police in Yokohama 2364. However, the image of Blade Runner meets 1984, set for a change during the day, is quickly dispelled by the obvious lack of budget and thin plot that would be hard pressed to fill half an hour, let alone three times that length. I haven't seen either of the preceding Dead or Alive films, but the flashbacks in this (the same good guy & bad guy fighting epic Street Fighter style battles throughout history) make you feel that this is probably the least of the trilogy. Having not seen the previous two, but encouraged that the finale could stand on its own, I went purely as a fan of the director. Miike Takeshi is best known for his sublime thriller Audition, a Japanese (and far better) counterpoint to Basic Instinct that would put any straight man off blind dates for life. Also, his stylistically experimental but totally gripping Triad trilogy makes for diverting viewing. However this film only comes alive (no pun intended) when there are special effects on screen or blistering kung fu. These aren't even terribly imaginative, but at least the bullet time shoot outs are often played tongue in cheek, and are done with considerable gusto and flair. Also, the bizarre technique of varying film speeds throughout the movie (perhaps because old films were shot at 16fps?) is irritating rather than an innovative device. Having beautifully depicted the relationship between an old gangster and a young boy in Rainy Dog, Miike covers much the same ground again in this film. However, anyone who's seen Robocop 3 or Soldier (we're thinking of starting a bad sci-fi support group) knows cyborg / kid relationships normally come across like a lead balloon. Here, this boy and his robot make an amusing double act, but not one that can sustain audience attention for any great period of time. Even the nice liet-motif of old celluloid doesn't really go anywhere; it just seems like the director had recently seen Cinema Paradiso and so poached an idea from it. Also the undercurrent of homophobia throughout the film is somewhat disturbing - why can't we have a heroic male lead with an attractive boyfriend, rather than the slimy mayor who deserves to die. A charity comic published in the eighties featured a ludicrous parody of Robocop by Frank Miller (ironically) as a homophobic robotic penis who fought crime. Astonishingly, this movie ends exactly the same way (honestly!) but not in a manner that is played entirely for laughs or satire, but rather in a way that leaves a nasty taste in the mouth (I can't believe I just wrote that). Occasionally entertaining then, it does make me intrigued to see the prequels, but this film is one to file under 'must try harder' rather than 'must see'. (For a far more entertaining and coincidentally, gay-positive, over the top Japanese sci-fi kung-fu film check out the amazing Wild Zero, if it ever gets released on video / in the cinema in this country)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0301167/"
}