{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred Dryer",
            "url": "/name/nm0004885/"
        },
        {
            "@type": "Person",
            "name": "Brian Keith",
            "url": "/name/nm0001417/"
        },
        {
            "@type": "Person",
            "name": "Joseph Gian",
            "url": "/name/nm0316129/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1034,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011752/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019538/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006990/"
        },
        {
            "@type": "Person",
            "name": "John Gatliff",
            "url": "/name/nm0309699/"
        }
    ],
    "datePublished": "1987-02-20",
    "description": "Gunnery Sergeant Burns reports for duty to an American Embassy in the Middle East. However due to the 'enlightened' views of the Ambassador, the marine security detachment he is in charge of is severely restricted in their functio...",
    "director": [
        {
            "@type": "Person",
            "name": "Terry Leonard",
            "url": "/name/nm0502777/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWUwOTVjODAtYzU0NC00YzZjLWFjMjMtZmYyYmVlMmVhNjllXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "ambassador,marine,embassy,terrorist,middle east",
    "name": "Death Before Dishonor",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "janus-20"
        },
        "dateCreated": "2011-04-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092854/"
        },
        "name": "Peace through superior Dryer power.",
        "reviewBody": "Cardinal Richelieu said: \"War is one of the scourges with which it has pleased God to afflict men.\"\n\nThe scourge who afflicts men in this wheeze is Gunnery Sgt. Burns (Fred Dryer). Burns is a career soldier, battle hardened and grizzled. He has his own interpretation of American foreign military policy, all foreigners are suspect by default and therefore subject to his military policy.\n\nArmed only with this simple misunderstanding (and highly powered automatic weaponry), Burns' ire is aroused when his superior and friend, Col. Halloran (Brian Keith) is bushwacked and spirited away by babbling, machine gun toting \"types\". Burns' initial bafflement with his superiors reluctance to blame and incacerate every non-American in a hundred mile radius soon gives way to righteous indignation. \n\nBullets are soon being chambered, grenades are attached to bandoliers and rocket launchers hefted. Before you can say \"United Nations peacekeeping envoy\" Gunnery Sgt. Burns is (with the help of a few other people who don't stand on ceremony when there are asses to be kicked) laying siege to the desert fortress of a large man who looks like the product of an unholy union between Chewbacca and Dave Lee Travis (sorry, not funny if your not from the UK). After the smoke clears (and we have learnt that any combatant who has received a knife to the chest still has to be punched in the face really hard and fall from a terrace to ensure neutralisation), everyone who deserved to be (except the writers) is riddled with bullets, blown up and in one case has had a jeep dropped on them.\n\nPossibly you may think I don't care much for this film, based on the above, but you'd be wrong. This is a slightly above average actioner, decently edited action scenes and pushes all the politically wrong buttons to get any red blooded blockhead like me baying for blood. \n\nIts a shame Fred Dryer couldn't bring the same understated, laconic charm to this effort that he did to seven years of the excellent cop show Hunter, but he does make a pretty good action hero. Not a bad action pot boiler and I didn't even know it was Islamophobic until I looked it up on wiki.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0092854/"
}