{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Carradine",
            "url": "/name/nm0001016/"
        },
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        },
        {
            "@type": "Person",
            "name": "Simone Griffeth",
            "url": "/name/nm0341097/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28975,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064409/"
        },
        {
            "@type": "Person",
            "name": "Robert Thom",
            "url": "/name/nm0858379/"
        },
        {
            "@type": "Person",
            "name": "Charles B. Griffith",
            "url": "/name/nm0341458/"
        },
        {
            "@type": "Person",
            "name": "Ib Melchior",
            "url": "/name/nm0577477/"
        }
    ],
    "datePublished": "1975-11-28",
    "description": "In a dystopian future, a cross country automobile race requires contestants to run down innocent pedestrians to gain points that are tallied based on each kill's brutality.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Bartel",
            "url": "/name/nm0000860/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Action",
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTRhMjM1YWItMzI4Zi00MDVkLTk0YjgtNWRjZThjM2I3MDE0XkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1_.jpg",
    "keywords": "tyranny,dystopia,road racing,car racing,carsploitation",
    "name": "Death Race 2000",
    "original_info": {
        "id": "Death Race 2000_1975",
        "name": "Death Race 2000",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mstomaso"
        },
        "dateCreated": "2005-03-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0072856/"
        },
        "name": "Action, dark comedy, political satire, SciFi, romance .... racing ... it's all here",
        "reviewBody": "David Carradine stars in this classic cult creation. Deathrace 2000 is the 20th anniversary of the murderous trans-continental road race, or, in the words of the US president \"what you all want\". \n\nYou could lose this film in the repertoire of John Carpenter. If you're a Carpenter fan, you really need to see this. Much is made of Corman's production of this film, but this is really not a Corman film in any sense - except for its very obviously low budget. Paul Bartel (of Eating Raoul fame) deserves the directorial credit here, and he really did well given the mediocrity of the material he had to work with. \n\nOstensibly, the film is about a race involving five participants - Frankenstein (Carradine), Machine Gun Joe Viterbo (Stallone), Calamity Jane (Woronov), Mathilda the Hunn, and Nero the Hero - all of comic book stature. They are joined by navigators who double as concubines, which, I suppose, illustrates the trust and intimacy a driver must have with any partner involved in a high speed transcontinental race where the goal is to kill as many pedestrians as possible along the way. About a quarter of the way through the film, it becomes clear that the real story is about the connection between the US government, religion, mass-produced violence and a resistance movement, all focused on either promoting or ending the race once and for all. As despicable as the empowered elite may be in this film, the critique of the media is even more scathing.\n\nCarradine is race hero Frankenstein. Sly Stallone plays his arch-rival Machine Gun Joe Viterbo, and an ensemble cast of fellow racers, media mavens, politicos, and willing and unwilling victims of \"the great race\" lend strong support. The acting is predictably campy and sometimes just a little too B grade. But the occasional pacing disaster just enhances the humor-value of the film. Stallone is particularly amusing, and gets great support from his sidekick. Carradine is typically bizarre, and even parodies himself with a few poorly choreographed kung fu techniques during his absurd fight scene with Stallone. As short as he is, Stallone is still a much larger and more fit man than Carradine, but gets handily whooped. The cinematographer makes no effort to hide the absurdity of this scene.\n\nThe script for this film is a series of well-delivered clichés strung together with cleverly choreographed racing action sequences. As such, it parodies tough-guy talk in films and in real life. The photography is excellent, and on par with John Carpenter's straightforward visual subtlety.\n\nThis film appears, at first blush, as a comedic celebration of violence. But it's really a very campy comment on the use of violence in sport and entertainment, as a way to distract and desensitize the public from serious issues such as economic stress, collectivist totalitarianism, the enshrinement of mediocrity, and \"minority privilege\" (a euphemism for rule by an entrenched powerful elite). The film is dated and does not need to be seen ten times to get it (though I just completed about my 12th viewing).\n\nThe political messages are worth hearing, the humor is worth paying attention to, and, if it's your first time, you will likely find this movie quite entertaining.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "French Air Force",
        "duration": "PT1M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1021182233",
        "name": "Death Race 2000",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTlkZTY0NDYtNjAwZi00MjhhLWJjODUtZjZlMWFlMGIzNjg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTlkZTY0NDYtNjAwZi00MjhhLWJjODUtZjZlMWFlMGIzNjg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-08-04T03:13:48Z",
        "url": "https://www.imdb.com/video/vi1021182233/"
    },
    "url": "/title/tt0072856/"
}