{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charles Bronson",
            "url": "/name/nm0000314/"
        },
        {
            "@type": "Person",
            "name": "Lesley-Anne Down",
            "url": "/name/nm0001153/"
        },
        {
            "@type": "Person",
            "name": "Michael Parks",
            "url": "/name/nm0662981/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8186,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "alternateName": "Death Wish: The Face of Death",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0530564/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0777031/"
        },
        {
            "@type": "Person",
            "name": "Brian Garfield",
            "url": "/name/nm0307257/"
        },
        {
            "@type": "Person",
            "name": "Michael Colleary",
            "url": "/name/nm0171718/"
        },
        {
            "@type": "Person",
            "name": "Allan A. Goldstein",
            "url": "/name/nm0326161/"
        }
    ],
    "datePublished": "1994-01-14",
    "description": "Paul Kersey is back at working vigilante justice when his fiancée, Olivia, has her business threatened by mobsters.",
    "director": [
        {
            "@type": "Person",
            "name": "Allan A. Goldstein",
            "url": "/name/nm0326161/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTViYzMxMGItYzJlNC00MTc3LWI0MTAtNGM5NTJlMjUzODQ2L2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "female frontal nudity,voyeur,voyeurism,woman in jeopardy,red dress",
    "name": "Death Wish V: The Face of Death",
    "original_info": {
        "id": "Death Wish 5: The Face of Death_1994",
        "name": "Death Wish 5: The Face of Death",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2007-01-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109578/"
        },
        "name": "No matter who you are don't mess with Paul Kersey.",
        "reviewBody": "After years in L.A., Paul Kersey is back in New York with his new fashion-based designer fiancée Olivia Regent and along with her young daughter Chelsea. Kersey has put away his old habits, until Olivia's ex-husband Tommy O'Shea (who happens to be mob figure) uses her business to run an illegal money laundry scheme and tries at every optometry of scary her from testifying against him in court. They go one step to far when they disfigure and then later on kill Olivia. By law Chelsea is to live with her father. This tips Kersey's world up side down and vengeance mode comes kicking back in.\n\nWhat a crying shame. I'm shocked to see the user rating for this \"Death Wish\" instalment to be so low. Making it by far the weakest of the series. I don't agree, but hey you can't have it all your own way, right. Anyhow, this was the filth and final \"Death Wish\" to date and it was actually the first one I ever saw. Maybe that's why I seem to cut it a bit more slack then say number four.\n\nSo, it's been going on for twenty years and Charles Bronson (who was around 70 at time) is still around looking to quite fit and rather animated. Definitely more so than his two previous efforts. Back to form with his dry, ice-cool persona and showing some feeling along the way. What I like about this outing (other than being a improvement over \"Death Wish 4\") is that it seems to go back to the dark underbelly and cruel vibe (maybe more so) that worked in the earlier forays. Kersey is up against more upper-class foes, than the usual street pests. At heart is goes back to the basic, heavy-handed revenge yarn, where the detailed situations are harrowing and the violence is simply cold-blooded. He might not want to return the favour (as firstly he lets the cop do their job), but his finally forced back into his beloved side-trade, as it's in the blood and the loved ones are taken away from him again. Once you start, there is no going back even when the police know his secret. The way he subtly toys around with the guilty criminals to get them rather anxious, waiting for their turn to be mowed down. Only adds to that ominously nasty touch that waits and the dark humour has real snappiness to it here. The deaths scenes are at times wickedly inventive (well it beats going up to someone and just shooting them) and rapid stunt work is exceptionally pulled off with such thrilling poise. Oh and how can I forget about the gratuitous slow motion? Some times it works and other times your thinking \"Oh why?\". Anyhow you gotta love it on this occasion! \n\nAs director (and writer) Allan Goldstein stylishly tailored it on a much larger scale that seemed to pay dividends with its competently showy set pieces and crisp pacing. There's always something there to hold your interest. In all, there's no denying it's by the numbers and the predictable plot has a fair share of clichés grounding it. Although it goes out there to delve a little deeper into the material (a highly witty and concise script: \"Idiots with guns, make me nervous\".) and truly making you feel for the characters. The hammy bad guys are typically portrayed as slimy, ruthless tyrants that deserve what they get. You'll sure be cheering on Kersey here, after you cop a taste of the lively performances of Michael Parks (who's tremendously scummy as Tommy O'Shea) and Robert Joy (makes light work as the paranoid nutter Freddie 'Flakes'). Lesley-Anne Down's presence simply glows and is credibly good as Olivia Regent. Giving able support are Saul Rubinek, Kenneth Welsh and Miguel Sandoval. The technical side of the production is soundly staged. The special effects are put to good use and come off well. What is nailed down is a traditionally sounding music score that likes too flutter about with loud echoing cues and the standard camera-work sufficiently frames every shot with nice scope.\n\nBy me saying it shares some common ground with the original films. I guess you'll be hoping for something rough around the edges and some exploitation to fit right in. Too bad, as that isn't going to happen. Those looking for the obligatory rape scene too (which appears in basically all four), forget it. This one is going for the mainstream pool. Even the ending has that cop-out feel about it with what has gone all before it.\n\nFor all your troubles it's nothing more than a glossed up, blunt action/crime vehicle for Bronson, which manages to mix the good and not-so-good aspects of the series. Only fans should bother.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Paul Kersey is back at working vigilante justice when his fiancée, Olivia, has her business threatened by mobsters.",
        "duration": "PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3103638297",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmI3ZGNmOTctZmM2OC00NjdmLThiODMtY2ViM2EzNGJiYjYyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmI3ZGNmOTctZmM2OC00NjdmLThiODMtY2ViM2EzNGJiYjYyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-09T17:30:50.147Z",
        "url": "https://www.imdb.com/video/vi3103638297/"
    },
    "url": "/title/tt0109578/"
}