{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sigourney Weaver",
            "url": "/name/nm0000244/"
        },
        {
            "@type": "Person",
            "name": "Ben Kingsley",
            "url": "/name/nm0001426/"
        },
        {
            "@type": "Person",
            "name": "Stuart Wilson",
            "url": "/name/nm0934179/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25624,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043853/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060324/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Person",
            "name": "Ariel Dorfman",
            "url": "/name/nm0233557/"
        },
        {
            "@type": "Person",
            "name": "Rafael Yglesias",
            "url": "/name/nm0947913/"
        }
    ],
    "datePublished": "1995-01-27",
    "description": "A political activist is convinced that her guest is a man who once tortured her for the government.",
    "director": [
        {
            "@type": "Person",
            "name": "Roman Polanski",
            "url": "/name/nm0000591/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTgzZTcwNDItYjhhMy00NmViLWFjZjEtZGQ5YWQxYzk0OWU4XkEyXkFqcGdeQXVyMjgxMzgyNjI@._V1_.jpg",
    "keywords": "suspense,minimal cast,single set production,revenge,rape and revenge",
    "name": "Death and the Maiden",
    "original_info": {
        "id": "Death and the Maiden_1994",
        "name": "Death and the Maiden",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Void"
        },
        "dateCreated": "2005-06-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109579/"
        },
        "name": "Brilliant dark character study",
        "reviewBody": "When it comes to dark and morbid thrillers, there's no one around that can handle them like Roman Polanski does. It is with that in mind, therefore, that I say Polanski is the best man for the job of adapting Ariel Dorfman's stage play; 'Death and the Maiden'. He proves this with the resulting movie, which is a thrill ride, combined with a character study all wrapped up in a layer of morbidity; needless to say, the film really hits home. Polanski handles this story, and his actors with the utmost precision and I have no qualms with labelling this movie as one of the man's masterpieces. I have no idea quite why it hasn't been better received, as although it's not up there with the likes of Knife in the Water, Chinatown and Rosemary's Baby; this is Polanski doing what Polanski does best, and when he's at his best; the man is brilliant. The story follows a chance encounter between a political lawyer and his neighbour, whom the man's wife is certain, is the same man who brutally beat and raped her while blindfolded under the reign of a fascist regime. What follows is a three-way character study between the victim, the man she thinks is her oppressor, and her husband; who is caught in the middle.\n\nThe themes of truth and justice are rampant in this tale and as we watch to see if the villain of the piece really is the man who oversaw torture in the oppression, we are always reminded of the idea of the difference between a right and just punishment, and otherwise. As this is based on a stage play, it is the actors that are very much the star of the show. The three-pronged cast makes for a great ensemble, and every single one of them impresses. Sigourney Weaver gives determination and anger to her victim, and it is easy to believe that this woman really was tortured and beaten. Stuart Wilson is great also as the man caught in the middle of a horrible situation, but it is Ben Kingsley that provides the real standout performance. He manages to skilfully tread a line between an evil madman and a pathetic innocent victim brilliantly, and he ensures that at all times we are asking the question \"did he?\". Polanski's direction is superb, and the thing that most impressed me is the way that he firmly positions the tale in the middle of nowhere. This ensures no distraction, and makes sure that we are put firmly within our character's plight.\n\nOn the whole, this is one of the best films that Polanski ever made. Considering his prowess as a filmmaker; that is really saying something and I wouldn't hesitate to recommend this film to anyone who enjoys movies.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Home Entertainment",
        "duration": "PT1M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi799080729",
        "name": "Death and the Maiden",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjU4OWNlOWYtYWM4My00ODQ3LWIzZTgtZWViNmQwMDVmZmQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjU4OWNlOWYtYWM4My00ODQ3LWIzZTgtZWViNmQwMDVmZmQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:48:08Z",
        "url": "https://www.imdb.com/video/vi799080729/"
    },
    "url": "/title/tt0109579/"
}