{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean-Claude Van Damme",
            "url": "/name/nm0000241/"
        },
        {
            "@type": "Person",
            "name": "Robert Guillaume",
            "url": "/name/nm0347039/"
        },
        {
            "@type": "Person",
            "name": "Cynthia Gibb",
            "url": "/name/nm0001269/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19612,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080240/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108804/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044937/"
        },
        {
            "@type": "Person",
            "name": "David S. Goyer",
            "url": "/name/nm0275286/"
        }
    ],
    "datePublished": "1990-09-14",
    "description": "In a violent and corrupt prison, decorated cop Louis Burke must infiltrate the jail to find answers to a number of inside murders. What he finds is a struggle of life and death tied in to his own past.",
    "director": [
        {
            "@type": "Person",
            "name": "Deran Sarafian",
            "url": "/name/nm0764776/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Crime",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjM5OTVkMDEtZWU1ZS00ODExLWE0MjktNDE4MTQ5NDk2NmMwXkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1_.jpg",
    "keywords": "prisoner,murder,jail,solitary confinement,prison guard",
    "name": "Death Warrant",
    "original_info": {
        "id": "Death Warrant_1990",
        "name": "Death Warrant",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol1218"
        },
        "dateCreated": "2005-03-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099385/"
        },
        "name": "Mister Sandman Give Me A Dream",
        "reviewBody": "**SPOILERS** One of Jean-Claud Van Damme's better movies in which he plays a Royal Canadian Mountie who goes undercover in a California prison to find out why a number of prisoners have been murdered at the Harrison State Prison over the last year. \n\nBeing that officer Louis Burke, Jean-Claud Van Damme, is from out of the country and has worked with the LAPD before, he lost he partner while tracking down a serial-killer known as \"The Sandman\" (Patrick Klipatrick) it's felt by the prison authorities and the DA's office that no one will recognize him in the pen.\n\nWorking with DA attorney Amanda Beckett, Cynthia Gibbs, who's posing as his wife on the outside Burke keeps in touch with her on whatever information he can come up with on the dead prisoners. With the help of some local convicts that he befriended in the prison including Hawkins, Robert Guillaume,Burke begins to find out that whats happening is being conducted by the very people who placed him there, DA Tom Vogler and head of prisons Ben Keane, George Dickerson & Jack Bannon. Voler & Keane are working together with the head of the prison guards and the prison doctor Sgt. DeGraf & Dr. Gottesman, Art Laflevr & Arimin Shierman, in killing healthy and non-addicted, to either drugs or alcohol, prisoners. These murders are being done in order to take out their vital organs and then sell them on the open market to the highest bidder! In fact DA Voglar has gotten Dr. Gottesman to get him a healthy liver, from one of the murdered prisoners, for his sick wife Helen, Dorothy Dells, without even her knowing about it. \n\nBurke had been set up by the corrupt state administrators to show the higher ups in the government that they were doing all that they could to find out about the murders there. When Burke started to find out the real reason for them, the dead prisoners, he was to be terminated before he could expose Volgar & Co. and their illegal human organ racket.\n\nThe action in the film was as good and as exciting as you could ever want in a movie like \"Death Warrent\" with Van Damme in top form taking out the bad guys with his fists and feet in a number of gut crunching fight sequences. Being a marked man with his identity, as an undercover policeman, exposed by the prison officials themselves it's a wonder why those in authority, not involved in this organ racket, didn't come to Bruke's rescue earlier then they did. Bruke's outside contact Amanda was doing everything to alert them but they seemed to be either out to lunch or on vacation. \n\nThrilling final with Burke having it out with the almost indestructible \"Sandman\" giving him a hot foot as well as a one way trip to Blazeville with the prisoners, forgetting about Burke's police identity, giving him a standing ovation at the end of the film. \n\nP.S Despite two major inconsistence. #1.Why the non-corrupt government authorities were so late in sending state troopers and national guardsmen to Harrison State Prison in order to rescue fellow police officer Louis Burke from hundreds angry and homicidal convicts. #2. The fact that \"The Sandman\" seemed to have come back to life at the end movie after he was obviously killed by Burke, with a hail of bullets, when the movie started. The film hold together pretty well and gives you the kind of non-stop action that you would expect from it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In a violent and corrupt prison, decorated cop Louis Burke must infiltrate the jail to find answers to a number of inside murders. What he finds is a struggle of life and death tied in to his own past.",
        "duration": "PT1M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4219716377",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGI0NDRkNTYtYWM3Yi00ZDY3LTk1NTAtNGE2MGVhNGRkYjEzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGI0NDRkNTYtYWM3Yi00ZDY3LTk1NTAtNGE2MGVhNGRkYjEzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-19T00:25:55.075Z",
        "url": "https://www.imdb.com/video/vi4219716377/"
    },
    "url": "/title/tt0099385/"
}