{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Judy Davis",
            "url": "/name/nm0001114/"
        },
        {
            "@type": "Person",
            "name": "Julia Louis-Dreyfus",
            "url": "/name/nm0000506/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 46133,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046148/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028809/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "datePublished": "1998-01-02",
    "description": "Suffering from writer's block and eagerly awaiting his writing award, Harry Block remembers events from his past and scenes from his best-selling books as characters, real and fictional, come back to haunt him.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDVjZWJiYzAtMWJkOS00ZDQzLTlkYTItYmMwMGE3YmY1MjQ3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "lucifer morningstar character,death character,whoremonger,man wears eyeglasses,sex comedy",
    "name": "Deconstructing Harry",
    "original_info": {
        "id": "Deconstructing Harry_1997",
        "name": "Deconstructing Harry",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118954/"
        },
        "name": "Really funny, but also really bitter and full of apparent self-loathing",
        "reviewBody": "Harry Block is a writer who tends to thinly veil his won life in his art. His tendency to mock his friends and family through similar characters in his work has left him with three ex-wives and a huge number of people who hate him. He lives a lonely life and has a penchant for pills and whore (prostitution being pure and totally free of BS). When his college plans to honour him he finds he has no-one who wants to go with him, so he kidnaps' his son, a black whore and an old friend with him. As the characters from his work come and go around him, he finds that he struggles to make amends with those around him and decides than he can only be happy in his work.\n\nThis is a fantastic Woody Allen film, and his only film to be rated 18 in the UK. The story seems to be a very clear, very personal attack on himself. It's like Allen is using a fictional story (going to be honoured by his college) to lay himself bare. Certainly Block's habit for using his own life in his work seems to echo accusations towards Allen in real life. At times this makes the film really hard to watch, some scenes are so full of apparent self-loathing and bile that it's hard to laugh. Happily the film is hilarious all the way through - this is not one of Allen's arty, serious films. It should be said that Allen denies that this is as personal as it appears but it is easy to see why it is seen as a personal attack on himself.\n\nThe film's main story is littered with scenes from Block's work that demonstrate how he has used his characters to mock others and to portray himself - Robin Williams is the best as the artist that literally lacks focus and Crystal is hellishly good. The story's moral about art and life is not as clear or as clever as it thinks it is, but it's very, very funny and the level of bile Allen appears to be spitting at himself is very interesting to observe.\n\nAllen is great in the central role, but you do occasionally feel like you should look away at times because he appears to be giving himself a real kicking. The rest of the cast is really good and is full of famous faces ranging from big stars (Moore, Crystal, Alley, Williams) to familiar faces (Maguire, Bogosian, Louis-Dreyfus, Shue, Tucci). As a director Allen does some new tricks to make this feel even more different from his other films, but the jump cuts etc are a little tiresome. The most important character to me is Cookie. She is significant because Allen has not really ever created a good black character (even if she is a prostitute).\n\nOverall this is a really funny film. The degree of vitriol that Allen appears to aim towards himself makes this a little less enjoyable but overall it is a great film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1101070617",
        "name": "Deconstructing Harry",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGM4MzRlYWYtMDhmNC00MWNmLWI3N2ItMDViZTZlY2Q0MjRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGM4MzRlYWYtMDhmNC00MWNmLWI3N2ItMDViZTZlY2Q0MjRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:49:00Z",
        "url": "https://www.imdb.com/video/vi1101070617/"
    },
    "url": "/title/tt0118954/"
}