{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Thomas Jane",
            "url": "/name/nm0005048/"
        },
        {
            "@type": "Person",
            "name": "Saffron Burrows",
            "url": "/name/nm0004787/"
        },
        {
            "@type": "Person",
            "name": "Samuel L. Jackson",
            "url": "/name/nm0000168/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 136561,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108864/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025142/"
        },
        {
            "@type": "Person",
            "name": "Duncan Kennedy",
            "url": "/name/nm0003300/"
        },
        {
            "@type": "Person",
            "name": "Donna Powers",
            "url": "/name/nm0694526/"
        },
        {
            "@type": "Person",
            "name": "Wayne Powers",
            "url": "/name/nm0694638/"
        }
    ],
    "datePublished": "1999-07-28",
    "description": "Searching for a cure to Alzheimer's disease, a group of scientists on an isolated research facility become the prey, as a trio of intelligent sharks fight back.",
    "director": [
        {
            "@type": "Person",
            "name": "Renny Harlin",
            "url": "/name/nm0001317/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWM0NjVkOGYtMjk5Mi00NGVmLWE3NDMtMDQ3ZjdjMDcwYzdlL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "research,experiment,shark,alzheimer's disease,scientist",
    "name": "Deep Blue Sea",
    "original_info": {
        "id": "Deep Blue Sea_1999",
        "name": "Deep Blue Sea",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "EdRooney"
        },
        "dateCreated": "1999-07-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0149261/"
        },
        "name": "Not that \"Deep\", Just fun",
        "reviewBody": "\"Deep Blue Sea\"\n\nWith \"Die Hard 2\", \"Cliffhanger\", the misunderstood \"Cutthroat Island\", the underrated \"Long Kiss Goodnight\" and guilty pleasure (but pretty damn good) \"Adventures Of Ford Fairlane\", Renny Harlin has proven himself time and again as one of the most visually competent action directors around. I've always stood behind his work, I sincerely love most of his movies. With \"Deep Blue Sea\", Harlin is in the midst of trying to keep his career going due to the low box office take of his previous films. The result is a movie that's on autopilot. An attempt to reclaim the respect of the studios and the audience with a slam-bang summer film that gets the job done easily, you just won't respect it in the morning.\n\nMaybe the largest problem in \"Deep Blue\" is the casting. Saffron Burrows and Thomas Jane lead the cast that also includes Samuel L. Jackson, LL Cool J, and Michael Rapaport. Both Burrows and Jane give what can only be described as seriously lacking performances. As the members of a science and research team in a state-of-the-art ocean facility off the coast of Baja, Mexico, the crew is in the midst of a study on sharks. The sharks hold the key to a possible cure for Alzheimer's disease and other brain dysfunctions(explained more thoroughly in the trailer for the film than in the actual film). The scientists have enlarged the brain of the beasts, making them smarter and faster. When a corporate executive (Jackson) arrives for a tour of the facility, the sharks begin an uprising that threatens the crew's very existence. Out in the middle of nowhere, the team tries to survive both the sharks and the sinking structure. \n\nSaffron Burrows is just the wrong choice for the lead scientist role. Her British monotone ruined a bad film (\"Wing Commander\") and brought down a good one (\"The Loss Of Sexual Innocence\"). I don't believe she has that much talent besides her beauty, and her lethargic presence here directly conflicts with the high-octane action that surrounds her. Thomas Jane on the other hand, was good in the role of Dirk Diggler's drug-dealing friend in \"Boogie Nights\". He seemed more alive in 30 minutes of screen time in that film than all 95 minutes of \"Deep Blue Sea\". I'm a bit surprised that nobody mentioned the lack of enthusiasm during filming. For the lead role, the film needed someone who can burst off the screen with fury and charm. Jane has neither. He leaves the film all wet.\n\nSaying that \"Deep Blue Sea\" needed better acting might be stretching it a bit. This is a action film with plenty of thrills and many explosions. You cannot expect Shakespeare when you buy a ticket to this. Still, the script credited to three writers is very weak(I assume large parts of the story were cut for time) and the score by Trevor Rabin is the blandest, most perfunctory music to hit the ears in a long time. Hopes were really high for this, but all the bad parts add up quickly.\n\nHarlin's specialty is the action sequence. He's one of the few directors left who knows how to squeeze the audience just right. \"Deep Blue\" is filled with wonderful suspense sequences and a genuine amount of anxiety. The computer-generated sharks move with alarming speed and dexterity. They keep the patrons on their toes. I cannot remember the last time I heard an audience scream with fear. Harlin milks every moment for the most thrills. I was very tense throughout the film. Rare for a guy as jaded as me.\n\nThe comparison to \"Jaws\" is very unfortunate. Just because the film features sharks doesn't immediately suggest a \"Jaws\" ripoff. We have had about 10 high school films with interchangeable plots and identical climaxes, yet nobody bats an eye over that. \"Deep Blue Sea\" stands alone with it's rousing thrills and deeply undernourished script. \"Jaws\" it ain't.\n\nIt's hot and the summer is about 3/4 of the way through. Escapism with \"Eyes Wide Shut\" or \"Blair Witch Project\" is impossible. \"Deep Blue Sea\" feeds the good old need of action, action, and more action. It's summer entertainment in the highest order, and damn it, the thing works. Hopefully Harlin can rebound in the future with better material. For now, this is the best source of thrills for the summer. ---------- 7"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 2 for Deep Blue Sea",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2098111513",
        "name": "Deep Blue Sea",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTcwZTViYTMtZjA2Zi00NGMwLWFmNTgtYWVmNTc4ZTc0MzExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTcwZTViYTMtZjA2Zi00NGMwLWFmNTgtYWVmNTc4ZTc0MzExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-10-22T03:09:33Z",
        "url": "https://www.imdb.com/video/vi2098111513/"
    },
    "url": "/title/tt0149261/"
}