{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Edwin Knight",
            "url": "/name/nm0460867/"
        },
        {
            "@type": "Person",
            "name": "Nancy Brilli",
            "url": "/name/nm0109386/"
        },
        {
            "@type": "Person",
            "name": "Coralina Cataldi-Tassoni",
            "url": "/name/nm0851016/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11155,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "alternateName": "Demons 2",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005863/"
        },
        {
            "@type": "Person",
            "name": "Dario Argento",
            "url": "/name/nm0000783/"
        },
        {
            "@type": "Person",
            "name": "Lamberto Bava",
            "url": "/name/nm0000877/"
        },
        {
            "@type": "Person",
            "name": "Franco Ferrini",
            "url": "/name/nm0274853/"
        }
    ],
    "datePublished": "1987-02-13",
    "description": "A group of tenants and visitors are trapped in a 10-story high-rise apartment building infested with demons who proceed to hunt the dwindling humans down.",
    "director": [
        {
            "@type": "Person",
            "name": "Lamberto Bava",
            "url": "/name/nm0000877/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjExNjA2NTktZWViYS00NTQyLWExM2UtZjZkNjhhZWM1ZGRlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "grindhouse film,classic horror,child in jeopardy,psychotronic film,acid for blood",
    "name": "Dèmoni 2... l'incubo ritorna",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "udar55"
        },
        "dateCreated": "2005-08-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090930/"
        },
        "name": "Uneventful retread of the first film",
        "reviewBody": "Director Lamberto Bava and producer Dario Argento quickly responded to the international success of DEMONS (1985) with this sequel. Abandoning the downbeat open ending of the original film, this follow-up merely repeats the scenario rather than continuing it. Sadly, the end result is a film that one would expect from sequel/money hungry producers rather than the original film's creators.\n\nThe biggest flaw with DEMONS 2 is the complete lack of logic. I know it sounds crazy to say that about a film featuring slime spewing demons, but hear me out here. A television program featuring young kids searching for demons (not the same film featured in the first one) is merely on and then a demon jumps out of the TV. While you can see the filmmakers trying to replay the original design with a different medium, they ultimately fail. The original, despite its loony scenario, at least presented a more reasonable explanation. The demon plague is spread by a movie theater customer being scratched by a mysterious mask and not by some demon merely popping out of the screen. Not only that, but this sequel never thoroughly addresses what happened in the original film. The voice over on the television show hints that demons appeared in the world for a few days but no one in the film addresses it. It is as if the events from the first film never happened.\n\nThe script also alters the demon mythos to cut plot corners. For example, the demons now apparently spurt acidic blood (shades of ALIEN) that burns through the floors and conveniently kills the power in the apartment complex. If this lazy script writing weren't enough, the entire situation is taken from David Cronenberg's superior SHIVERS (aka THEY CAME FROM WITHIN).\n\nThe filmmakers also make the huge mistake of teetering towards the laughable by including a demon child and demon dog, which wins the award for least convincing transformation of the 1980s. It is truly embarrassing. These inclusions, coupled with a phony pint sized demon straight out of a GREMLIN rip off, really push the film into the bounds of ridiculousness. Sergio Stivaletti reprises his role as F/X coordinator and provides the requisite demons transformation highlights such as teeth falling out and talons popping out under fingernails. The film also features the world phoniest barbell.\n\nA few familiar faces pop up from the first film. Pasqualino Salemme, who was one of the punks in the first film, pops up briefly as a security guard. And Bobby Rhodes, memorable as Tony the Pimp in the original, appears here as gym instructor Hank, a different but equally managerial character. As with the first film, he gets all of the film's best lines. Also of note is Coralina Cataldi Tassoni as the bratty birthday girl turned lead demon Sally. She maintains a steady energy, despite being covered by layers of make up and slime. And in a bit of trivia, the film also marks the theatrical debut of Argento's daughter Asia. No doubt this exposure to horror at an early age prepared her for working with Vin Diesel.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Anchor Bay Entertainment",
        "duration": "PT2M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2460025113",
        "name": "Demons 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWYxNjExOGEtMTRjNy00Y2Q0LWFkYzMtMzkzODYxNmNlMTlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWYxNjExOGEtMTRjNy00Y2Q0LWFkYzMtMzkzODYxNmNlMTlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:49:35Z",
        "url": "https://www.imdb.com/video/vi2460025113/"
    },
    "url": "/title/tt0090930/"
}