{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Connie Nielsen",
            "url": "/name/nm0001567/"
        },
        {
            "@type": "Person",
            "name": "Gina Gershon",
            "url": "/name/nm0000153/"
        },
        {
            "@type": "Person",
            "name": "Chloë Sevigny",
            "url": "/name/nm0001721/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5721,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067722/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066973/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076469/"
        },
        {
            "@type": "Person",
            "name": "Olivier Assayas",
            "url": "/name/nm0000801/"
        }
    ],
    "datePublished": "2002-11-06",
    "description": "A French corporation goes head-to-head with an American web media company for the rights to a 3-D manga pornography studio, resulting in a power struggle that culminates in violence and espionage.",
    "director": [
        {
            "@type": "Person",
            "name": "Olivier Assayas",
            "url": "/name/nm0000801/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2EyYTJkYmItNzYyYy00ZDc0LTgzYWItMDVjYTQ0NDRjZjBiXkEyXkFqcGdeQXVyMTQzODg2ODc3._V1_.jpg",
    "keywords": "pornography,female rear nudity,voyeurism,voyeur,coitus",
    "name": "Demonlover",
    "original_info": {
        "id": "Demonlover_2002",
        "name": "Demonlover",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "arturobandini"
        },
        "dateCreated": "2004-04-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0284034/"
        },
        "name": "Criminally Underrated",
        "reviewBody": "Admittedly, DEMONLOVER makes a sharp left narrative turn at the halfway point that's going to confound viewers who are intrigued by the straightforward (and extremely absorbing) high-stakes opening. But that's no reason to dismiss the many, many things that writer/director Olivier Assayas gets absolutely right. In the end, DEMONLOVER is a fascinating mirror-world reflection (as William Gibson would call it) of where our global society might be just five minutes from now: the fittest who survive will be multilingual, career-consumed and ridiculously chic, but also soulless, as if missing the gene that supplies a sense of loyalty and ethics. The movie is a cautionary, though entirely plausible, tale of humans debased by their own lust for ungoverned capitalism. Every line of dialogue is about the business merger at hand; in the rare instances where feelings are discussed, they're usually about how *work* affects those emotions. The big wink here is that the characters don't even discuss business honestly, because each has duplicitous motives.\n\nTechnically, DEMONLOVER is a feast. Denis Lenoir's widescreen photography constantly dazzles -- many of the tracking shots are sustained in close-up (creating paranoia), and the color spectrum appears as if filtered through corporate fluorescence. (The neon-drenched Tokyo sequence is particularly hypnotic.) Jump cuts keep the narrative one step ahead of the audience. Sonic Youth's atonal guitar score creates the same mutant environment that Howard Shore pulled off in CRASH. Most significantly, Connie Nielsen's face (and hair and wardrobe) mesmerizes more than any CGI I've ever seen. Considering the labyrinthine motives of her character, Nielsen's exquisite subtlety may be lost on first-time viewers; on second look, her emotionless gaze speaks volumes.\n\nAudiences (and critics) have unanimously attacked the `problematic' second half as an example of directorial self-indulgence. While I agree that it's not as satisfying as the first half, I don't think it's a total crash-and-burn (pardon the pun). Clearly, the ending is open to thematic interpretation, but I think Assayas is just saying that if our species isn't more careful, we'll end up like one-dimensional characters in a video game of our own devising - sure, winner takes all, but the rest of us suffer enormously.\n\nNarrative ambiguity aside, DEMONLOVER is the great Hitchcockian/Cronenbergian espionage fantasia I've been waiting for. It makes sense that it would come from Europe, since Hollywood forgot long ago how to make their assembly-line genre exercises intellectually stimulating. (Like the animé porn within the story, Hollywood movies today represent no more than a calculated corporate commodity.) More than any other film from the last 2½ years, DEMONLOVER seems a product of the post-9/11 world - a not-so-distant future where overwhelming paranoia goads us to preemptively eliminate any form of potential competition before it can do the same to us. And how in doing so, we devour our own tail.\n\nI expect this movie's reputation will grow by leaps and bounds in the coming years.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Lionsgate Home Entertainment",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2929787161",
        "name": "Demonlover",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjhiOWU1NmItNzA3ZC00NWRjLWIxMTUtMDgyZWYwMjA2YTNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjhiOWU1NmItNzA3ZC00NWRjLWIxMTUtMDgyZWYwMjA2YTNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:50:07Z",
        "url": "https://www.imdb.com/video/vi2929787161/"
    },
    "url": "/title/tt0284034/"
}