{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gregory Peck",
            "url": "/name/nm0000060/"
        },
        {
            "@type": "Person",
            "name": "Lauren Bacall",
            "url": "/name/nm0000002/"
        },
        {
            "@type": "Person",
            "name": "Dolores Gray",
            "url": "/name/nm0336576/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5101,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "George Wells",
            "url": "/name/nm0920216/"
        },
        {
            "@type": "Person",
            "name": "Helen Rose",
            "url": "/name/nm0741423/"
        }
    ],
    "datePublished": "1957-05-16",
    "description": "A sportswriter and a fashion-designer marry after a whirlwind romance, and discover they have little in common.",
    "director": [
        {
            "@type": "Person",
            "name": "Vincente Minnelli",
            "url": "/name/nm0591486/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDAxZjIwZmUtMjhiYi00NmQ0LWE1YmItNTNiODBkYWZiZjgxXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "boxing match,ex boyfriend ex girlfriend relationship,singer,husband wife relationship,alley brawl",
    "name": "Designing Woman",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "silverscreen888"
        },
        "dateCreated": "2005-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050306/"
        },
        "name": "Bright, Well-Written and Adult Romantic Comedy; Peck and Bacall in Top Form",
        "reviewBody": "\"Designing Woman\", a title which is a word-play on a female's desire to obtain a worthwhile husband and on the profession followed by the female lead, is what used to be known as an engaging comedy. A 'designing woman' is exactly what she is not; nor is the sportswriter she falls in love with in any way naturally conniving. But circumstances in this undeniably charming, situationally humorous and dialogue-rich film force her to become (naturally) suspicious and him to mislead her. The couple are portrayed by Lauren Bacall and Gregory Peck who have said they had and appear to have had great fun in making this New York-based comedy of manners. There were a number of male-versus-female films made in Hollywood between 1939 and 1973, the Golden Age of physical production there; while most of the writers took a reactionary anti-feminist position, the author of this film, George Wells, instead, here championed a mutually-desired and mutually-agreed equality between the two protagonists. Peck is the central character; but Bacall is the focus of much of the plot. In fact the opening sequences of the film take place on the West coast; Peck awakens to find himself befriended and his story filed by Bacall, after he had had a bit too much to drink. They begin an affair and swiftly decide to wed. But going back home to New York, they discover that \"happily ever after\" is harder than \"I do\". Abandoning his smaller bachelor digs for her luxurious apartment, they discover that their lifestyles, acquaintances and pursuits hardly match. One famous scene involves his rough-hewn card buddies trying to hold their regular game in her apartment. Also, Peck had been dating a pretty model , played by Dolores Gray, and has to hide the relationship, explain it away and generally engage in fancy footwork on several occasions; having her creative friends do their work while his card game buddies are present, pretending he does not know Gray, on whose musical designer Bacall is working when they meet at a fashion show; this is only the beginning of the story. Because Peck is also under a death threat from gamblers, he has to pretend to be away covering road baseball games while he's really holed up with a punchy ex-prizefighter bodyguard played by Mickey Shaughnessy. Of course, when Bacall discovers his old girl friend was Gray and that Peck has been lying about where he is, she assumes he has been cheating on her. The gangsters after Peck is played by Ed Platt and Chuck Connors, while Peck's helpful editor is Sam Levene. Under Vincente Minnelli's solid direction, the pace of this fast-moving comedy that only sometimes slows down for smart dialogue never flags. The fine cinematography was done by Gene Alton, set decorations by Edwin B. Willis and Henry Grace. Costumes were the work of veteran Helen Rose, with original music by Andre Previn. The bright art direction was by E. Preston Ames and William A. Horning, In the cast supporting the principals are Tom Helmore, Alvy Moore, Jesse White, Carol Veazie and Jack Cole. Bacall shows intelligence and toughness as the designer while Peck is more nuanced. This is a well-remembered and critically favored comedic effort, with a surprisingly satisfying ending. The screenplay won an award in 1957. Catch it when you can.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4217159961",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzAwOGYzMzktYzI4YS00ZmQ2LWE4MjItNmQ1OTJjOTNlNzI3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzAwOGYzMzktYzI4YS00ZmQ2LWE4MjItNmQ1OTJjOTNlNzI3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-10T14:16:58.909Z",
        "url": "https://www.imdb.com/video/vi4217159961/"
    },
    "url": "/title/tt0050306/"
}