{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rosanna Arquette",
            "url": "/name/nm0000275/"
        },
        {
            "@type": "Person",
            "name": "Madonna",
            "url": "/name/nm0000187/"
        },
        {
            "@type": "Person",
            "name": "Aidan Quinn",
            "url": "/name/nm0001644/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 24401,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001995/"
        },
        {
            "@type": "Person",
            "name": "Leora Barish",
            "url": "/name/nm0054713/"
        }
    ],
    "datePublished": "1985-04-12",
    "description": "A bored New Jersey suburban housewife's fascination with a free-spirited woman she has read about in the personal columns leads to her being mistaken for the woman herself.",
    "director": [
        {
            "@type": "Person",
            "name": "Susan Seidelman",
            "url": "/name/nm0782384/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTViMzE5MmQtNWUwNC00NWNkLWIxMWUtYzM5NWRmOTk5MDQ2XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "personal ad,new york city,farce,fish out of water,adultery",
    "name": "Desperately Seeking Susan",
    "original_info": {
        "id": "Desperately Seeking Susan_1985",
        "name": "Desperately Seeking Susan",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blakiepeterson"
        },
        "dateCreated": "2015-07-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089017/"
        },
        "name": "An Amusing Product of the Times",
        "reviewBody": "\"Desperately Seeking Susan\" isn't so much a homage to the screwball comedy as it is a homage to the screwball situation. It doesn't try to be riotous or anything remotely Ernst Lubitsch — instead, it flutters by with half-smile as it discombobulates the at-first congenial attitude of the atmosphere. Never did I find myself laughing hysterically, but here, that's not the point. It wants to be an amuser in the same mindset as \"Pretty in Pink\", no knee- slappers to be found but charm spread aplenty. Because that's exactly what \"Desperately Seeking Susan\" is: a charming comedy of errors that likes to get its characters into as much trouble as possible for satisfactory diversion. \n\nRosanna Arquette portrays Roberta Glass, a bored housewife who spends her afternoons watching cooking shows and living vicariously through the lonely hearts in the classified ads. Most interesting to her is the recurring 'Desperately Seeking Susan' ad, which follows the romance between Jim (Robert Joy) and his sexy girlfriend, Susan (Madonna), both of whom are young, bohemian, and fiercely independent. As she twiddles her thumbs for the umpteenth time one afternoon, Roberta decides to act as onlooker, tracking the twosome down and watching their public encounter from afar. She becomes infatuated with the street stylish Susan and, after a series of complicated events I won't bother to explain, she bumps her head, gets amnesia, and falls under the impression that, she is, in fact, Susan.\n\nMost housewives would want to be like the free-spirited woman, but Susan, as it so happens, is in a lot of trouble. Her boyfriend has just stolen valuable Egyptian jewelry, jewelry she enjoys wearing, and a gaggle of thugs are thirsty to get their paws on the collection. So as Roberta wanders around the city bearing Susan's name and wearing her clothes, the criminals begin to chase her, while the real Susan causes a ruckus elsewhere — eventually leading to Roberta's confused husband (Mark Blum). \n\n\"Desperately Seeking Susan\" is the best kind of amusing: pleasant but not so much so that we become immersed in the fact that things aren't as zany as they could be. The film is smartly amusing, after all, with the comic scenario bettering as it grows increasingly convoluted. The screenplay sizzles in its ability to entice us into Susan's world of bohemian style, and the actors are all winning: Arquette, in particular, carries the movie with her sincerely warm characterization. But the best thing about \"Desperately Seeking Susan\" is Susan Seidelman's great eye for street life: I've never been one to figure a movie is better simply because of the decade it sits in, but Seidelman, intentional or not, finds all the best things about the 1980s and seems to cram them into one excitingly snazzy picture. The ghettos are effectively hip, the suburbs slightly tongue-in-cheek, like \"Wild At Heart\" if it wasn't crazy. Seidelman's vision is best reflected in Madonna, in her earliest incarnation and her most kitschily well-dressed. \n\n\"Desperately Seeking Susan\" is slight when it comes to comedy but hugely successful when it comes to pure enjoyment. A product of the times, it has aged gloriously as a nostalgic piece snug in all the right places. And nothing's better than the boho sensuous Madonna (providing the soundtrack with guilty pleasure \"Into the Groove\") before she got all blond ambitious and stopped looking like the chic spunk who stole records as a pastime."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2882519321",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjY4ZTY2M2YtYmQ1OS00MWU1LTgxYjAtMTYyYzQ2ODA2NmMyXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjY4ZTY2M2YtYmQ1OS00MWU1LTgxYjAtMTYyYzQ2ODA2NmMyXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg",
        "uploadDate": "2020-11-24T01:51:05.381Z",
        "url": "https://www.imdb.com/video/vi2882519321/"
    },
    "url": "/title/tt0089017/"
}