{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liz Renay",
            "url": "/name/nm0719294/"
        },
        {
            "@type": "Person",
            "name": "Mink Stole",
            "url": "/name/nm0831467/"
        },
        {
            "@type": "Person",
            "name": "Susan Lowe",
            "url": "/name/nm0523056/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5618,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "X",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025862/"
        },
        {
            "@type": "Person",
            "name": "John Waters",
            "url": "/name/nm0000691/"
        }
    ],
    "datePublished": "1980-11-02",
    "description": "A neurotic society woman murders her husband with her maid's help; on the lam, they escape to Mortville, a homeless community ruled by a fascist queen.",
    "director": [
        {
            "@type": "Person",
            "name": "John Waters",
            "url": "/name/nm0000691/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Crime",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTdjNWYyMGUtNzQ4Yy00Mzg1LWI1MmUtMWZiYTAyYThiYTlmL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "male nudity,male frontal nudity,self castration,black comedy,absurd violence",
    "name": "Desperate Living",
    "original_info": {
        "id": "Desperate Living_1977",
        "name": "Desperate Living",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fowler1"
        },
        "dateCreated": "2001-09-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075936/"
        },
        "name": "I Honor You, Queen Carlotta!",
        "reviewBody": "It's hard for me to believe that there could be John Waters fans who know only his mainstream films. They're pretty good movies, don't get me wrong; but they walk meekly in the shadow cast by his amazing Trash Trio (this, FEMALE TROUBLE & PINK FLAMINGOS). This one is his all-time best, partly because of Divine's absence. Had he been available, he would not only have nabbed the Queen Carlotta role, but become the focus of every viewer's attention as he usually did. (Well, nobody cites FEMALE TROUBLE for the Donald Dasher character, right?) The way DESPERATE LIVING worked out, you finally get a chance to see how good Waters' other Dreamland divas really were; and they're very, very good. Fact, DESPERATE features some of the most inspired, OTT female acting ever featured in a movie, \"trash\" or otherwise.\n\n Mink Stole is unbeLIEVABLE as Peggy Gravel; she seethes with constant neurotic dementia throughout. Her portrayal of misery to the power of ten is less overacting than it is finding the perfect pitch for the role, and making camp on the very spot. The movie-opening running tantrum she spews is one of the funniest things I've ever seen - every third or fourth word is shouted for maniacal emphasis (\"The CHILDREN are having SEX!! Beth is PREGNANT!! And I NARROWLY escaped an ASSASSINATION attempt!!\") Brilliant. But she's matched, step for weaving step, by Susan Lowe's unforgettable diesel-dyke Mole and the nonpareil Edith Massey as the evil Queen of the criminal shanty-kingdom, Mortville. (If you've never experienced Edith Massey, nothing I can say could possibly prepare you for her....unique...greatness. Let's just leave it at that, okay?) And that's not to discount the typically outre work by Mary Vivian Pearce - who plays her character as if she'd gotten lost on her way to the set of a Julie Andrews musical - or the CGI effect that is Miss Jean Hill. This assembly of female firepower results in one incredible movie that STILL has the power to make you squirt liquid out your nose in helpless laughter, Farrelly Brothers or no Farrelly Brothers. As a matter of fact, the more Waters' early assaults on good taste have become absorbed into mainstream entertainment, the better and more shocking his films look for it. When DESPERATE LIVING stood alone, one hardly knew what to make of it. Now that every lesser talent in show-biz is trying to finance a swimming pool by imitating the Waters touch, it's easy to see, and appreciate, who the innovator and true original is. When Waters made this movie, he was a pariah with nothing to lose...he knew better, but still didn't care. Thus, there's an intoxicating power and thrift-shop integrity to DESPERATE LIVING that none of the Johnny-come-latelies can approach, now that \"bad taste\" is boxoffice, and safe as milk. If you're gonna wallow in slime, then accept no substitutes, folks: demand DESPERATE LIVING."
    },
    "url": "/title/tt0075936/"
}