{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cary Grant",
            "url": "/name/nm0000026/"
        },
        {
            "@type": "Person",
            "name": "John Garfield",
            "url": "/name/nm0002092/"
        },
        {
            "@type": "Person",
            "name": "Alan Hale",
            "url": "/name/nm0002118/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5385,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Steve Fisher",
            "url": "/name/nm0279795/"
        },
        {
            "@type": "Person",
            "name": "Delmer Daves",
            "url": "/name/nm0202681/"
        },
        {
            "@type": "Person",
            "name": "Albert Maltz",
            "url": "/name/nm0540816/"
        }
    ],
    "datePublished": "1943-12-31",
    "description": "In order to provide information for the first air raid over Tokyo, a U.S. submarine sneaks into Tokyo Bay and places a spy team ashore.",
    "director": [
        {
            "@type": "Person",
            "name": "Delmer Daves",
            "url": "/name/nm0202681/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Adventure",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDJiYzY1ZWYtYzJhYi00YjQzLThkZjktNjUzMTIyOTE5MjY3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_.jpg",
    "keywords": "male bonding,world war two,behind enemy lines,destroyer,submarine",
    "name": "Destination Tokyo",
    "original_info": {
        "id": "Destination Tokyo_1943",
        "name": "Destination Tokyo",
        "year": "1943"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secondtake"
        },
        "dateCreated": "2014-04-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0035799/"
        },
        "name": "Solid but also better seen from its original context",
        "reviewBody": "Destination Tokyo (1943)\n\nWhile not officially a propaganda film (it's not endorsed or paid for by the government), this is one of many films the studios put out to basically join the effort, putting their shoulder to the wheel. It's not a great film for our times mostly because it's overflowing with lessons, with the propagandistic style of persuading us the Japanese were bad and the U.S. soldiers, with all their wonderful flaws, were out to save us.\n\nI say this first because it's a lot of baggage to wade through. The other side to this coin is an adventure war movie where Cary Grant is in charge of a submarine out for a special mission. It's well paced, generally well acted (the cast is filled with lesser actors along with the main three). John Garfield is an average sailor with a big role, and big ego that grates on some of the other sailors. But he tells ribald stories that they can't help listening to. The one older actor is the cook played by character actor Alan Hale, who is appropriately comic.\n\nSo, what you get is some very talented people explaining the current events, including lots of anti-Japanese chat. The interior shots in the sub are fairly realistic (though from what I read, an actual sub is far more cramped). The outside stuff varies a lot in quality. The shots of the sub underwater are painfully crude models in water tanks. Some of the landscapes are also invented in the studio and you can tell.\n\nWhat carries it at all is a sense of danger and necessity. These men have to succeed to defeat evil. Remember (of course) the audience at the time had a very black and white view of the war, and of the enemies. They were anxious for confirmation that we were capable of such things, and that the enemy (Japan, but also Germany is discussed) is fundamentally wrong—they lack freedoms, the woman are simply alive to bear children, no free press, etc.\n\nWhy did I watch it? Cary Grant. I'm curious about his range, and his being corralled into this kind of vehicle. I'm guessing he was partly interested in helping the war effort, and partly under contract. And you know what? He's great. He plays it straight, and he's smart, confident, warm, complex. If you like Grant, you might like this movie just for that reason.\n\nAnother thing to say overall: it gets better as it goes. The set up in the first half is a bit obvious and sometimes stiff or slow. But there is a medical emergency which is pretty great, and then there is the general operation in Tokyo Harbor. It's all dramatic and well done by first-time director Delmar Daves. Yeah, it's got a lot of dated script to wade through, but the best of it is great war stuff best remembered for its context.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In order to provide information for the first air raid over Tokyo, a U.S. submarine sneaks into Tokyo Bay and places a spy team ashore.",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2646065177",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2YyZmQ4NzQtNGU4OC00MGFlLThkOGUtOWQ3MzY1MjAwNzdhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2YyZmQ4NzQtNGU4OC00MGFlLThkOGUtOWQ3MzY1MjAwNzdhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-26T12:09:45.601Z",
        "url": "https://www.imdb.com/video/vi2646065177/"
    },
    "url": "/title/tt0035799/"
}