{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kwok-Pong Chan",
            "url": "/name/nm0150987/"
        },
        {
            "@type": "Person",
            "name": "Farini Cheung",
            "url": "/name/nm0156472/"
        },
        {
            "@type": "Person",
            "name": "Ka-Kui Ho",
            "url": "/name/nm0387322/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 160,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "Diary of a Serial Killer",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043991/"
        },
        {
            "@type": "Person",
            "name": "Philip Cheng",
            "url": "/name/nm0155610/"
        }
    ],
    "datePublished": "1995-06-02",
    "description": "Unable to satisfy his sexual desires with his wife, Biu regularly visits prostitutes, ties up and tortures them in various ways before killing them.",
    "director": [
        {
            "@type": "Person",
            "name": "Otto Chan",
            "url": "/name/nm0151060/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzdkZDFkZjgtMWZmOS00ZGFkLThiMmItY2QwMjRjZTJmYjc5XkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "killing,prostitute,murder,torture,female nudity",
    "name": "Gwong Chow sat yan wong: Yan pei yat gei",
    "original_info": {
        "id": "Diary of a Serial Killer_1997",
        "name": "Diary of a Serial Killer",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rmax304823"
        },
        "dateCreated": "2014-02-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113230/"
        },
        "name": "Chinese Junk.",
        "reviewBody": "This is the second time I've tapped into one of these Hong Kong slasher movies and I thought I was watching the first one all over again. The murderer is always leaping and rolling around, babbling loudly to himself, shouting the narration, waving his arms, blowing out his cheeks, rolling eyes, and killing women and then manhandling their bodies in the most disgusting ways.\n\nNo one has ever called me a bluenose. Psychopath, thief, neurotic -- yes -- but never bluenose. And thank heaven for that, because Bluenose is the name of the ferry between Maine and Nova Scotia. \n\nYet I thought the chief appeal of the film was to the most base impulses of humankind. A raving maniac inserts a stick of dynamite into the vagina of a beautiful young girl and blows her up. What is that -- funny? And there's no particular reason for it all. There's not even the cartoon simplicity of the explanation behind Tony Perkins in \"Psycho.\" And \"subtlety\"? Maybe there is no such word in Chinese.\n\nThe colors are lurid and drawn mostly from the red end of the visible spectrum, and the English subtitles of the Cantonese dialog flash across the bottom of the screen like lightning bolts. Fortunately for me, but of no consequence for your fortunes, I spent several agonizing months learning Chinese. I remember only two words. \"I\" and \"you\". Providentially, these two words were used frequently.\n\nWhat's most worrisome is not that this movie -- and evidently others much like it -- exist. It's that there's an audience for them. Sex, yes. Torture porn -- why?. \n\nIf you missed it the first time around, this is your golden opportunity to miss it again. Watch it if you must but be sure to tell your shrink about the experience and what it meant to you.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0113230/"
}