{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kimberly Elise",
            "url": "/name/nm0253708/"
        },
        {
            "@type": "Person",
            "name": "Steve Harris",
            "url": "/name/nm0004996/"
        },
        {
            "@type": "Person",
            "name": "Tyler Perry",
            "url": "/name/nm1347153/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15153,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013812/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0133417/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0132379/"
        },
        {
            "@type": "Person",
            "name": "Tyler Perry",
            "url": "/name/nm1347153/"
        }
    ],
    "datePublished": "2005-02-25",
    "description": "A couple's seemingly solid marriage begins to crumble when the wife discovers that her husband intends to divorce her.",
    "director": [
        {
            "@type": "Person",
            "name": "Darren Grant",
            "url": "/name/nm0335337/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIyOTA1NTg0NV5BMl5BanBnXkFtZTcwMzE2MzgyMQ@@._V1_.jpg",
    "keywords": "2000s,mabel 'madea' simmons character,timeframe 2000s,diary,f rated",
    "name": "Diary of a Mad Black Woman",
    "original_info": {
        "id": "Diary of a Mad Black Woman_2005",
        "name": "Diary of a Mad Black Woman",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "benier"
        },
        "dateCreated": "2005-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0422093/"
        },
        "name": "How Darren Grant Sold The Most Unlikely Film To The Masses",
        "reviewBody": "Darren grant is a cool cucumber. After over 120 Music videos and commercials in just 8 years, the youngish helmer has delivered with \"Diary of A Mad Black Woman\". This debut director has entered the Hollywood fray on par with any big shooter. As a former Madison Avenue, ad agency creative director, I will admit I am biased because he directed an award- winning commercial for me 2 years ago. \n\nStill, Mr. Grant pulled off the same trick he did with our controversial cinema/TV commercials (which featured a cigarette executive as a lethal \"Hitman\"): he took a complex, ethnically esoteric subject and simplified it, making it digestible for the masses. Slap me around a little, but I think that's what a good Director should do. The playwright, Tyler Perry has had things cooking for years on the Chittlin' Circuit, bringing his own unique brand of urban theatre to working-class, black America. Mr. Perry came to Hollywood as a pre-packaged star. And Hollywood has acknowledged his presence in grand fashion.\n\nThe rather surreal Madea character is more than just a man-in-drag; it is Perry's vessel of choice. Via Madea, he can impart a spiritual gospel that reflects his experience growing up in the black church. He can also channel his insights on politics and perhaps give a few pointers to wayward minorities who feel they are up against it. The rest of the characters in DIARY OF A MAD BLACK WOMAN: Helen, Charles, Orlando, Debrah, Brenda, Tiffany and Myrtle  not to mention, Brian, Madea and Joe  all played by Tyler Perry, serve to hone Mr. Perry's particular brand of cultural propaganda. To wit, love it or hate it, there is a well- defined black American subculture that cannot be ignored.\n\nDIARY OF A MAD BLACK WOMAN is indeed complex. Whereas Robin Williams in \"Mrs. Doubtfire\" was, deliberately in drag as a scheming septuagenarian and as was Martin Lawrence in the \"Big Momma's House\"  Tyler Perry's Madea is a REAL woman! He's also Madea's dirty-old-man of a brother and takes off the makeup to play handsome young attorney. Tyler is almost on par with Eddie Murphy as he bandies about in multiple roles. Again, credit Darren Grant's deft understanding of the characters' interaction. The only criticism here is that Tyler Perry is actually a more convincing actor when he is talking to himself(s)!\n\nKimberly Elise is a true A-list acting talent. If Madea is comic relief, Elise's Helen fulfills the dramaturgy aspect of the film. She admirably holds her own with screen legend, Cicely Tyson as her mother. Steve Harris is menacingly effective as an Ike Turner-esque, booji Atlanta attorney who emotionally terrorizes his wife and associates. Shemar Moore gives a breakout performance that is sure to take him to the next level in Hollywood. Watch as he is next transformed into a mainstream matinée idol \n\nWhat's most important about this film is how it OWNS the right to speak of an ethnic genre. Darren Grant and Tyler Perry have cleverly positioned themselves as experts on American black culture. And how there are thousands of similar stories yet untold. Look for this director to, perhaps, do what Spike Lee intended; what Carl Franklin suggested; and what the Van Peebles' aspired to do: become the definitive, fresh, new voice in Black American film.\n\n###"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Lionsgate Home Entertainment",
        "duration": "PT1M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi597819673",
        "name": "Diary of a Mad Black Woman: 2-Disc Special Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmI3MjgyOTgtOTVmZi00ZTRlLThiZTItMTZiZWQ2NmNlNTNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmI3MjgyOTgtOTVmZi00ZTRlLThiZTItMTZiZWQ2NmNlNTNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:51:36Z",
        "url": "https://www.imdb.com/video/vi597819673/"
    },
    "url": "/title/tt0422093/"
}