{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dido",
            "url": "/name/nm0225824/"
        },
        {
            "@type": "Person",
            "name": "Alex Alexander",
            "url": "/name/nm1722120/"
        },
        {
            "@type": "Person",
            "name": "John Deley",
            "url": "/name/nm2102174/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 73,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0123167/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104245/"
        }
    ],
    "datePublished": "2005-06-07",
    "description": "English pop singer, Dido, performs live in London, England during her 2004 'Life for Rent' UK tour.",
    "director": [
        {
            "@type": "Person",
            "name": "David Barnard",
            "url": "/name/nm0055385/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGYzNDU0Y2MtYzg1Yy00ZTdhLWE3OTItNDgzNTQ3N2M2YTA3XkEyXkFqcGdeQXVyNzI1ODgyNDA@._V1_.jpg",
    "keywords": "london england,pop star,pop singer,english music,female singer",
    "name": "Dido: Live at Brixton Academy",
    "original_info": {
        "id": "Dido: Live at Brixton Academy_2004",
        "name": "Dido: Live at Brixton Academy",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fedor8"
        },
        "dateCreated": "2008-08-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0772226/"
        },
        "name": "The VD to end all VDs: \"Live Dildo\".",
        "reviewBody": "Norah Jones, that ultra-mellow, coma-inducing, brunette sleeping pill, has only one real threat in the world of audio apathy: Dido. Should whisper-singing done by a semi-cute bimbo appeal to you, do not limit yourself to Ms.Jones. Dido Florian Cloud de Bounevialle O'Malley Armstrong (named after a rare type of hamster) is not someone whose music you'd want to ignore.\n\nDido is blonde, and so is her music; brilliant texts that will have your eyes gushing with tears, dealing with a wide range of topics, such as lost love, failed relationships, very sad break-ups, and unrequited love. But unlike Norah, Dido colours her hair blonde. Oh, I mentioned that already Well, ehm, I can't think of anything else, which is exactly why fans of either star should check out the other. Perhaps it should be added that Dido wears high heels occasionally, whereas Norah puts on sneakers mostly. And Oh, yes: Dido is a little older.\n\nJust as all her brilliant albums, this live VD features Dido showing off her entire vocal range, and what an enviable, wide range it is! In some songs she talks and in others she whispers (wow!), with a sort of quasi-nasal pitch that only birds, some dogs, and the tone-deaf can hear. They are all spectacular (not the birds and the dogs, the songs). My favourite must be \"I Loved You, Too\", in which Dido whisper-sings about a guy with whom she had a failed romance, telling us how he loved her and how she loved him, too. Another excellent highlight is \"Missed You So Much\", where she digs very deep into her innermost feelings to find out that she indeed does miss her boyfriend so very much. No less wonderful is \"Fallen Out Of Love Again\", in which she shares with the listener how she fell out of love with a man she used to date once. Unique stuff. Though maybe not quite as sublime as the opener, \"How Lovely Is Your Love\", which has to be my all-time Dido favourite ever: so un-cliché, so perfectly original in every single imaginable way, so utterly fresh.\n\nSo if you enjoy blond tarts who whisper into the microphone while standing on the stage like a wooden Indian (doing absolutely nothing except trying to reduce the number of off-key notes they hit), then you must not fail to buy this VD, making both and Dido and her powerful music company and various sponsors just that little bit more rich.\n\nAnd remember: if you start feeling drowsy as you watch this powerful, moving live performance, remove the \"Dildo Live\" VD out of your DVD machine. Experiencing Dido's ART for longer than 15 minutes may cause permanent damage to most of your senses.\n\nDido is so talented that she even manages to hit 388 off-key notes during this one gig alone. She is also famous for playing the piano, the guitar, the violin and the cello. Alas, she can only play \"Gingle Bells\" on all these instruments...\n\nFor more of my music-world rants, go to: http://rateyourmusic.com/collection/Fedor8/1"
    },
    "url": "/title/tt0772226/"
}