{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Willis",
            "url": "/name/nm0000246/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Irons",
            "url": "/name/nm0000460/"
        },
        {
            "@type": "Person",
            "name": "Samuel L. Jackson",
            "url": "/name/nm0000168/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 394103,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094483/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Hensleigh",
            "url": "/name/nm0378144/"
        },
        {
            "@type": "Person",
            "name": "Roderick Thorp",
            "url": "/name/nm0861636/"
        }
    ],
    "datePublished": "1995-05-19",
    "description": "John McClane and a Harlem store owner are targeted by German terrorist Simon in New York City, where he plans to rob the Federal Reserve Building.",
    "director": [
        {
            "@type": "Person",
            "name": "John McTiernan",
            "url": "/name/nm0001532/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjI0ZWFiMmQtMjRlZi00ZmFhLWI4NmYtMjQ5YmY0MzIyMzRiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "diversionary tactic,grudge,telephone booth,tough cop,bomb",
    "name": "Die Hard with a Vengeance",
    "original_info": {
        "id": "Die Hard: With a Vengeance: Bonus Material_1995",
        "name": "Die Hard: With a Vengeance: Bonus Material",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2001-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112864/"
        },
        "name": "Great entry into a great series",
        "reviewBody": "Someone calling himself Simon detonates several bombs in the centre of New York City. He then sets a series of dangerous tasks for Officer John McClane to achieve or he will detonate more. McClane sets out to meet the demands of the terrorists with bystander Zeus Carver in tow.\n\nThis is the third in the Die Hard series and it makes an immediate improvement on the second by bringing back the original director John McTiernan. Here the film doesn't try to repeat the formula of the first film (terrorists/wife/rescue) but instead takes on a whole new plot while still tying it into the first film. The second movie tried to repeat the first film's plot but set in an airport, here the different angle makes this feel a lot fresher and feel like a movie in itself. The tie-in to the first film is clever and not too much of a stretch of the imagination - happily this is not the reason for the action itself - instead the terrorist's main aim is the gold held in vaults in the Federal Reserve on Wall Street, but the game with McClane is a special treat.\n\nMcTiernan was great in the first film, making everything feel tense and claustrophobic. Here he has the whole of NYC to run across and the camera shows this new found freedom. In action scenes the camera swings wildly round and zooms into focus on the action. During scenes set in offices etc containing a lot of dialogue the camera slowly prowls round like it's dieing to rush off to the next action scene. It's the opposite to the style in the first film and again makes this feels different enough to be a film in it's own right.\n\nUsually film series can get a lot of baggage (watch Lethal Weapon 4 for proof), but here all the repeat characters are dropped, even McClane's wife only features as a voice on the phone. And that works well here and the only characters that are brought back here are McClane (of course) and Hans Gruber (in a flashback). This frees the film up to basically go where it wants without having to squeeze in old characters the way the second film did. However it links the films by having Simon Gruber taking supposed revenge for the death of his brother. The fresh active feel to this movie really gives it life and lifts the series out of the hole that the second film had threatened to put it.\n\nThe chemistry between Willis and Jackson is great and lends a lot of comedy to the film, there's lot of racial humour between the two and Jackson is more than the \"black sidekick\" that exists in many films. Irons continues the fine tradition of English actors playing Hollywood villains and is good for the most. His ticks and stutters stop him being anywhere near as good as Rickman was in the original role but he's still good. Willis gets good support from the likes of Graham Greene, Larry Bryggman and Colleen Camp as fellow cops but really him and Jackson carry the show.\n\nSome of the scenes are a little forced and the plot doesn't always join together easily (a scene where Willis is fired out of a water pipe just as Jackson happens to drive by is a little too convenient) but many iffy bits can be overlooked if you focus on the action. The most effective thing that returns from the first film is the musical score. In the first film the score used variations on Christmas music to dramatic effect, here the score uses music well to add tension and comedy in a different way. It's difficult to put into words but this effect was missing from the second film.\n\nThe film has a hatful of nice twists towards the end and the only problem is that the conclusion in Canada doesn't feel like it fits in (the original ending was changed following the Okalahoma bombing) but this is a minor problem in a film that is a great addition to the action packed Die Hard series."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Die Hard: With a Vengeance",
        "duration": "PT2M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2434245657",
        "name": "Die Hard: With a Vengeance",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmEzZTc2ZmEtMDQwYy00M2RiLThmYzItNmE2Y2RiZDJmMTFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmEzZTc2ZmEtMDQwYy00M2RiLThmYzItNmE2Y2RiZDJmMTFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-10-11T03:13:24Z",
        "url": "https://www.imdb.com/video/vi2434245657/"
    },
    "url": "/title/tt0112864/"
}