{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tallulah Bankhead",
            "url": "/name/nm0000845/"
        },
        {
            "@type": "Person",
            "name": "Stefanie Powers",
            "url": "/name/nm0694619/"
        },
        {
            "@type": "Person",
            "name": "Peter Vaughan",
            "url": "/name/nm0891092/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2734,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "Die! Die! My Darling!",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060069/"
        },
        {
            "@type": "Person",
            "name": "Richard Matheson",
            "url": "/name/nm0558577/"
        },
        {
            "@type": "Person",
            "name": "Anne Blaisdell",
            "url": "/name/nm0086419/"
        }
    ],
    "datePublished": "1965-03-21",
    "description": "A young woman is terrorized by her deceased fiancé's demented mother who blames her for her son's death.",
    "director": [
        {
            "@type": "Person",
            "name": "Silvio Narizzano",
            "url": "/name/nm0621469/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGQ1ODU4MjktN2M5NC00OTc1LTk4MWQtNTUzNTY2YTZhMjM3XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_.jpg",
    "keywords": "religious fanatic,insanity,female protagonist,woman in jeopardy,mental illness",
    "name": "Fanatic",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2008-12-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059106/"
        },
        "name": "Tallulah Bankhead: the world's most dreaded mother-in-law!",
        "reviewBody": "It's most unfortunate that all the smaller-scaled psychological thrillers Hammer produced during the mid 60's remain somewhat in the shadows of their more grotesque and Grand Guignol featuring horror & Sci-Fi productions (like the Dracula and Frankenstein franchises or the Quatermass trilogy), because there are quite a few of genuine treasures to discover! \"Fanatic\" a.k.a. \"Die! Die! My Darling\" is such a wondrous example of an original and highly atmospheric but sadly underrated Hammer thriller. Richard Matheson's screenplay  adapted from a novel by Anne Blaisdell  is terrifically tight & uncomfortably credible, the atmosphere is uncanny throughout and Tallulah Bankhead's performance as the insane religious freak truly stands as one of the greatest in the history of horror cinema. Whilst visiting England with her new lover, all-American girl Pat Carroll plans to pay a visit to Mrs. Trefoile; the mother of her ex-fiancée who died in a car accident before they ever had the chance of getting married. Mrs. Trefoile acts a bit whiny and exaggeratedly religious at first, but still fairly harmless since the visit is meant to be brief and formal. However, Mrs. Trefoile turns into a totally religion-obsessed fruitcake when she learns Pat isn't a virgin anymore and never actually intended to marry her son in the first place! She gets more fanatic than Jesus himself and locks Pat away in the secluded mansion's attic with the intention to cleanse her soul and prepare her to reunite with the son in the afterlife. The concept of this film is simply stupendous, if you ask me, and veteran writer Richard Matheson makes sure that every tiniest possible detail in the script gets covered. There are also some very intriguing sub plots, like the awkward relationships between Mrs. Trefoile's servants and the gradual unfolding of what exactly happened between Pat and Mrs. Trefoile departed son. There are a few clearly noticeable similarities between this film and Alfred Hitchcock's \"Psycho\", which leads to some obvious twists and a fairly predictable finale. But then again, you can't blame the film for this since pretty much every horror movie made after 1960 is influenced by \"Psycho\" in one way or another. Tallulah (I even love typing her name) Bankhead obviously steals the show in every scene she's in, but the rest of fine cast deserves a word of respect as well, including a young Donald Sutherland as the mentally disabled gardener. Next time you set up a list of favorite Hammer films, make sure you watch \"Fanatic\" first and I guarantee it will be in there somewhere.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3520380697",
        "name": "Die! Die! My Darling!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDU0OGI4YTItNmRlZC00MzlkLTk3NDMtMTBkMDA3NGVjNjI5XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDU0OGI4YTItNmRlZC00MzlkLTk3NDMtMTBkMDA3NGVjNjI5XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-11-05T17:07:10.444Z",
        "url": "https://www.imdb.com/video/vi3520380697/"
    },
    "url": "/title/tt0059106/"
}