{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anton Newcombe",
            "url": "/name/nm1500043/"
        },
        {
            "@type": "Person",
            "name": "Courtney Taylor-Taylor",
            "url": "/name/nm1214127/"
        },
        {
            "@type": "Person",
            "name": "Joel Gion",
            "url": "/name/nm1501171/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6460,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0101529/"
        },
        {
            "@type": "Person",
            "name": "Ondi Timoner",
            "url": "/name/nm0863756/"
        }
    ],
    "datePublished": "2005-04-13",
    "description": "A documentary on the once-promising American rock bands The Brian Jonestown Massacre and The Dandy Warhols, and the friendship/rivalry between their respective founders, Anton Newcombe and Courtney Taylor.",
    "director": [
        {
            "@type": "Person",
            "name": "Ondi Timoner",
            "url": "/name/nm0863756/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUwOTAwMjE1M15BMl5BanBnXkFtZTgwNjMzNTc5MzE@._V1_.jpg",
    "keywords": "title directed by female,female nudity,female topless nudity,rock band,music industry",
    "name": "Dig!",
    "original_info": {
        "id": "DiG!_2004",
        "name": "DiG!",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "UncleBobMartin"
        },
        "dateCreated": "2005-11-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0388888/"
        },
        "name": "A few words mostly about the DVD commentaries",
        "reviewBody": "The movie is about Anton Newcombe. The music and careers of the two bands are simply backdrop. It's only fair that Newcombe have the last word about the film, which at this writing you can find in the \"news\" section at the brianjonestownmassacre website. I'd link it here but IMDb won't permit it.\n\nDocumentarians are limited by what the camera captures, as well as by the need to assemble a cohesive narrative from the somewhat-random occasions when chance has put the camera lens on a sight-line with relevant happenstance. In Dig!, fortune smiled on the Dandy Warhols, capturing their rise to the status of pop-idol candidates, as they formed slickly-produced pop confections for mass consumption, most notably \"Bohemian Like You,\" a song that made them global darlings thanks to a Euro cell phone ad. \n\nNo such luck for Brian Jonestown Massacre. The film captures little of what made the original BJM lineup great, with the sole exception of a single montage, lasting a minute or so, showing Newcombe creating/recording a number of brief instrumental parts, unremarkable in themselves, and concluding the sequence with a playback of the lush, shimmering sounds that had to have been in Newcombe's mind and soul before they could enter the world.\n\nThree commentaries accompany the film; one by the filmmakers, and two by the members of the bands (the BJM track is solely former members, and without Newcombe). Both the Warhols and BJM alumni point up this montage sequence as the \"best\" bit in the film, and I'd agree that, given the film's focus on Anton Newcombe, it is the only part of the film that sheds proper light on his gift, and seems too brief to lend proper balance to this attempted portrait of the \"tortured artist.\"\n\nInteresting thing about commentaries is that, unlike film, they are recorded in real time -- one long take -- which can be more honestly revelatory than a documentary that takes shape primarily through editing.\n\nThe Dandies do not come off well in their comments. If the rock and roll world extends the experience of high school life for its denizens -- as I believe it does -- the Dandies are the popularity-obsessed preppy types, the ones who listen to rock because it's what their peers do, while the BJM crew come off as the half-rejected, half-self-exiled outsiders (to insiders like the Dandies, \"losers\") that are the real rock spirit. BJM's Joel Gion, who talks a LOT, nails the film's message for me when he says (paraphrasing): \"You can't forget that Anton has been able to do the only thing he ever said he wanted to do. Make a lot of great music.\"\n\nThe Dandies, meanwhile, laugh too easily at every outrageous display in the course of Newcombe's meltdown (all the BJM footage here ends at 1997, before Newcombe quit heroin). Courtney Taylor-Taylor's discounting of Newcombe's commitment to his vision is summed up as follows: \"He's 37 and still living in his car. You can download all his work at his website. He was so tired of being ripped off by everyone else, he's giving it all away. He could be making a mint.\" You can practically hear him shaking his head in disbelief.\n\nThe film's shortcomings can't be blamed on the filmmakers; rather it's the difficulties of the documentary form, and the loss of cooperation by the film's subject, that makes this portrait of Newcombe so fragmentary. But it's likely the best we will get, outside of his music.\n\nI only rented disc one, which has the feature. Most of the extras are on disc two. Not renting that, as I've put in my order to buy the set.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Palm Pictures",
        "duration": "PT2M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi664928537",
        "name": "Dig!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDJiMTZmMzUtZjljMy00NDIwLTlmODctZDJjYmQ2YzlkZGNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDJiMTZmMzUtZjljMy00NDIwLTlmODctZDJjYmQ2YzlkZGNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:51:39Z",
        "url": "https://www.imdb.com/video/vi664928537/"
    },
    "url": "/title/tt0388888/"
}