{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Woods",
            "url": "/name/nm0000249/"
        },
        {
            "@type": "Person",
            "name": "Louis Gossett Jr.",
            "url": "/name/nm0001283/"
        },
        {
            "@type": "Person",
            "name": "Bruce Dern",
            "url": "/name/nm0001136/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7693,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051731/"
        },
        {
            "@type": "Person",
            "name": "Leonard Wise",
            "url": "/name/nm0936377/"
        },
        {
            "@type": "Person",
            "name": "Steven McKay",
            "url": "/name/nm0571072/"
        }
    ],
    "datePublished": "1992-08-14",
    "description": "Gabriel's released from prison. His con man friend makes a foolish bet with Diggstown's owner on who'd win the boxing matches - their man against ten Diggstown men.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Ritchie",
            "url": "/name/nm0006916/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTg1M2UxMDYtYzA1Yy00Y2ZjLTlhNTUtYTEwNmUyYjQ4MzA5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "scene during opening credits,prison,bare chested man,georgia usa,f word",
    "name": "Diggstown",
    "original_info": {
        "id": "Diggstown_1992",
        "name": "Diggstown",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2011-11-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104107/"
        },
        "name": "Deserves to Find a Bigger Fan Base",
        "reviewBody": "Diggstown (1992) \n\n*** 1/2 (out of 4) \n\nIf you're wanting an art-house picture then this here won't be for you but if you want non-stop entertainment then DIGGSTOWN really delivers the goods. Con man Gabriel Caine (James Woods) gets released from prison and is looking for the next big score and finds it in a hick town ran by John Gillon (Bruce Dern). Caine makes a bet that his boxer (Louis Gossett, Jr.) can take ten men in a 24-hour period. DIGGSTOWN pretty much went unattended in theaters when it was first released due to a really bad campaign and that's a real shame because there's so much to enjoy here. Not only do you have some great performances, a wonderful setting and some terrific fight scenes but you've also got a pretty good little drama mixed in. The movie is a prime example of something that isn't dumbed down for mainstream audiences yet at the same time it doesn't try to be some high class art film. What it is is a straight-forward, tough, mean and downright fun little gem that manages to be entertaining from start to finish. The film is certainly very manipulative because there are some moments that go over-the-top but you still can't help but be entertained. Woods is masterful playing the fast-talking con man and you really can't think of an actor who could have done a better job. The way that smirk just shows how conning he is is just perfect for the part. Gossett is an easy figure to cheer for and he really makes you care about the character. It's easy to say that this was the actors best part since AN OFFICER AND A GENTLEMAN and he certainly delivers the goods. Oliver Platt is fun as one of the assistant con men and we get Heather Graham in a nice supporting role. Randall 'Tex' Cobb has a fun stint in the film as does character actor Marshall Bell. Dern also does a wonderful job in the role of the bad guy and just when you think you can't hate him any more the screenplay and actor make you reach a boiling point. Every film like this needs a great villain and Dern certainly delivers the goods. The ten boxing scenes are all extremely well-filmed and I'd argue that they're some of the most entertaining ever put on film. There's certainly not RAGING BULL quality but they didn't need to be. The film has enough twists and turns to keep a smile on your face and in the end DIGGSTOWN is just a flat out charmer."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Gabriel's released from prison. His con man friend makes a foolish bet with Diggstown's owner on who'd win the boxing matches - their man against ten Diggstown men.",
        "duration": "PT2M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2124071705",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjg5MGZkNTgtYjgwZS00MDE4LWJkY2UtZTBlOTdlZGFhZDJkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjg5MGZkNTgtYjgwZS00MDE4LWJkY2UtZTBlOTdlZGFhZDJkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-11T00:55:04.291Z",
        "url": "https://www.imdb.com/video/vi2124071705/"
    },
    "url": "/title/tt0104107/"
}