{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rekha",
            "url": "/name/nm0004334/"
        },
        {
            "@type": "Person",
            "name": "Preity G Zinta",
            "url": "/name/nm0006689/"
        },
        {
            "@type": "Person",
            "name": "Arjun Rampal",
            "url": "/name/nm0992000/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2002,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0258317/"
        },
        {
            "@type": "Person",
            "name": "Rajkumar Santoshi",
            "url": "/name/nm0764316/"
        },
        {
            "@type": "Person",
            "name": "Kundan Shah",
            "url": "/name/nm0787453/"
        },
        {
            "@type": "Person",
            "name": "Subrat Sinha",
            "url": "/name/nm1242272/"
        }
    ],
    "datePublished": "2002-09-06",
    "description": "Raising her two daughters, Saritaji \"Rekha\" fears that history might repeat itself when both of them fall for the same guy.",
    "director": [
        {
            "@type": "Person",
            "name": "Kundan Shah",
            "url": "/name/nm0787453/"
        }
    ],
    "duration": "PT3H5M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg2NDY3NDA2M15BMl5BanBnXkFtZTcwODEzOTQyMQ@@._V1_.jpg",
    "keywords": "love,fair,three word title,title appears in song,love triangle",
    "name": "Dil Hai Tumhaara",
    "original_info": {
        "id": "Dil Hai Tumhaara_2002",
        "name": "Dil Hai Tumhaara",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "meydiana-65242"
        },
        "dateCreated": "2020-11-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328998/"
        },
        "name": "Preity Zinta's fabulous performance...",
        "reviewBody": "After having a successful turn with Kya Kehna, Kundan Shah and Preity Zinta reunite for another picture that revolves entirely around her. This is a film that has it all: comedy, drama, emotions, romance and values. It is portrayed quite well all through, but it certainly wouldn't have worked if not for Preity Zinta. Don't know what it is about her. Watching her on-screen is a refreshing, encouraging experience. Her bright smile, her easy charm, her strong and natural screen presence, and her real-life happiness that translates so naturally onto the screen, all make you believe that life is beautiful. Even when she's sad and you see tears in her expressive eyes which naturally sadden you as well, you cannot but feel optimistic. She switches sorrow with happiness quickly yet convincingly. This is not just the beautiful character she's got, it's Preity herself. Not once has she been called a bubbly and vivacious actress. Her ability to inject even the saddest of characters with her natural zest is unique and commendable. Not many actors can do it, but Preity can.\n\nPreity plays Shalu, a girl who is the product of her father's extramarital affair, and who was adapted by her father's wife (Rekha) after his death. Unaware of her identity, she often wonders why her mother does not show even remote affection for her while clearly doing so towards her sister Nimmi (Mahima). Yet, her love for both her mother and her beloved sister is immense and unconditional. As a matter of fact, the bonding and camaraderie between Shalu and Nimmi is one of the most beautifully portrayed sibling relationships and rarely done so convincingly in mainstream films. Shalu never for one moment begrudges her sister for being their mother's preferred child. On the contrary, she is presented as that happy-go-lucky girl who is full of life no matter what. While troubled by her mother's cold and aloof attitude, she does not spend time crying for all ill fate; she fights for her happiness and makes her best to prove her worth. Later in the film, her ability to sacrifice her own happiness for her sister and family brings a new dimension to her, and while it could have made any other actress look cheap and pretentious, Preity is compelling and moving.\n\nShalu is a very simple yet extremely memorable role, and she's unlike any leading lady you've seen in Hindi movies. She is very much a real person, who wears regular everyday clothes (western but not in the glamorous or vulgar sense, as one would imagine), rides a bicycle, slides down the staircase banister, confronts her mother's political rivals, has absolutely no qualms about lying when applying for a new job or trying to get what she wants, and sometimes even likes to play pranks on strangers. Indeed, a character archetype that would be considered too racy or even unseemly for leading ladies just a few years back. But here there's no contradiction between Shalu's independent nature and her commitment to her family. Shalu, if you like, is your girl-next-door, but not the naive one; she is a young, strong woman who knows her mind but has her values intact. Preity integrates her boyish charm into Shalu's mini-negative shades, providing some moments of light, comic relief, as in the scene where she misleads Arjun Rampal's character on his way to the company, or the ones where she mistreats him (\"Hey Driver! Ksh! Ksh!\"). Even the early sequence where she feeds her mother's political rivals a peppered pastry (by the way, the instance when they have smoke coming out of their ears is redundant and annoyingly embarrassing) is entertaining.\n\nRekha is known as one of the greatest actresses, no doubt, and she is restrained and dignified here, but like the beautiful and talented Mahima Chaudhary, she suffers from quite an underwritten role. Amazingly beautiful Mahima is lovely and radiant in her part as the kind Nimmi who totally matches her sister's selfless love. Both Rekha and Mahima do really well with whatever little the script gives them, and even the guys-Arjun Rampal and Jimmy Shergill-are competent, but at the end of the day all four of them are merely the background for Miss Preity Zinta. Preity may not be as beautiful as the other ladies; she is neither as dramatically accomplished as Rekha nor as attractive as Mahima, but it's her film all the way, and it never feels wrong that she is the centre of attention. She makes the best of this author-backed role, playing it with spontaneity, energy, depth and sincerity, and, in turn, making Shalu authentic, charming and very easy to relate to. Actually it just never feels like acting, this performance is just real and completely unaffected throughout, and towards the end she really outdoes herself in a couple of hard-hitting scenes. It's hard to imagine anyone else playing the role of Shalu, and while sadly it never got the amount of notice it deserves to begin with, I have no doubt it has won many hearts and will continue to do so.\n\nDil Hai Tumhaara is not a great film but it is a heartwarming family drama which was made in the most traditional way. Fans of mainstream Hindi films will love it. The last few scenes become increasingly and typically emotional, but they are moving enough and effectively bring to a positive ending. You just feel its profound, unrestrained Hindi film style all over, but it works. All the songs, without exception, are melodious and beautiful. Among my favourites, \"Mohabbat\" is catchy and exhilarating, \"Chayya Hai Jo Dil\" is beautifully sensuous, \"O Sahiba\" is poignant, but it is \"Dil Laga Liya\" which provides the best and most moving moments of the film. The songs are actually very well pictured on-screen, some of them even carry the narrative forward, and all of them are consistently used to showcase Zinta's star quality and her different states throughout the story. Indeed, Zinta is the main and perhaps only reason to watch this film, and if you ask me, it is reason enough.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0328998/"
}