{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aamir Khan",
            "url": "/name/nm0451148/"
        },
        {
            "@type": "Person",
            "name": "Saif Ali Khan",
            "url": "/name/nm0451307/"
        },
        {
            "@type": "Person",
            "name": "Akshaye Khanna",
            "url": "/name/nm0451379/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 73466,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019447/"
        },
        {
            "@type": "Person",
            "name": "Kassim Jagmagia",
            "url": "/name/nm1539594/"
        },
        {
            "@type": "Person",
            "name": "Farhan Akhtar",
            "url": "/name/nm1027719/"
        },
        {
            "@type": "Person",
            "name": "Karan Vishwanath Kashyap",
            "url": "/name/nm10689808/"
        }
    ],
    "datePublished": "2001-08-10",
    "description": "Three inseparable childhood friends are just out of college. Nothing comes between them - until they each fall in love, and their wildly different approaches to relationships creates tension.",
    "director": [
        {
            "@type": "Person",
            "name": "Farhan Akhtar",
            "url": "/name/nm1027719/"
        }
    ],
    "duration": "PT3H3M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjRjMTYwMTYtMmRkNi00MmVkLWE0MjQtNmM3YjI0NWFhZDNmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "youth,told in flashback,love,goa india,nostalgia",
    "name": "Dil Chahta Hai",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "moviebuff81"
        },
        "dateCreated": "2001-08-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0292490/"
        },
        "name": "Beginning of a new generation of Bollywood films",
        "reviewBody": "Before getting into the details, I must admit that this is certainly one of the best and most entertaining films I have ever seen!\n\nRATING: ****1/2 out of *****\n\nPlot ---- The story is about three very good friends and their relationships with each other. Aamir Khan plays a sociable and mischievous Akash, Saif Ali Khan plays a confused, often 'love-struck' Sameer and Akshaye Khanna plays a mature, confident Siddharth or Sid. Preity Zinta plays Shalini - Akash's love interest, though throughout the film Akash claims that he does not believe in love. Sonali Kulkarni plays Pooja with whom Sameer finally (really) falls in love and Dimple Kapadia is Tara Jaiswal, a divorced middle-aged alcholic. Thats all one needs to know about the film because right from the first reel the viewer is absorbed into the story and learns about each character.\n\nReview ------ Full credit must go to the director Farhan Akhtar who has broken many of the Bollywood production norms in order to make a technically perfect and enjoyable film. It would be unfair to call Aamir Khan the life of the DCH though his popularity in India and abroad would have drawn a substantial part of the film's audience. He gives a brilliant performance as usual as Akash. His scenes with Akshaye Khanna and some scenes shot in Australia (Opera, phone call to Sid, etc) are mind-blowing! SAif Ali Khan is the surprise packet of Dil Chahta Hai and there is a lot of untapped talent in him especially where comedy roles are concerned. But I felt that the best performance came from Akshaye Khanna who plays the character of Sid to perfection. His mannerisms, thinking, behaviour is very authentic and makes us all identify with his character closely. Preity Zinta looks gorgeous and is her usual chirpy self. Sonali Kulkarni could have certainly looked better without all that makeup. Dimple Kapadia shows how a good role can bring out an elegant performance from a seasoned actress.\n\nThe best aspect of Dil Chahta Hai other than the actors' performances was the music. This is hopefully the start of more non-run of the mill compositions in Bollywood. Ofcourse, I hope for a lot more compositions like these from the music directors Shankar-Eshaan-Loy. The title song was the best and gels really well with this trndy film. Other good songs are 'Jaane Kyon', 'Kaise HAi yeh Rut' and 'Tanhayee'. 'Woh ladki hai kahan' - a parody of old Hindi songs is simply hillarious. The lyrics provided by the director's father, veteran Javed Akhtar are simply amazing and complement the story of the film to perfection!\n\nOverall, a very entertaining feature and I hope to see more films like these in the near future. Three cheers to Farhan Akhtar and his team!!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three inseparable childhood friends are just out of college. Nothing comes between them - until they each fall in love, and their wildly different approaches to relationships creates tension.",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3770923801",
        "name": "Dil Chahta Hai trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjk1MTZkY2EtMzhkNi00MWMwLThlOWEtMjJjMDVmYmY0ZmU4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjk1MTZkY2EtMzhkNi00MWMwLThlOWEtMjJjMDVmYmY0ZmU4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-07-19T04:25:40.511Z",
        "url": "https://www.imdb.com/video/vi3770923801/"
    },
    "url": "/title/tt0292490/"
}