{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Warren Oates",
            "url": "/name/nm0643105/"
        },
        {
            "@type": "Person",
            "name": "Ben Johnson",
            "url": "/name/nm0424565/"
        },
        {
            "@type": "Person",
            "name": "Michelle Phillips",
            "url": "/name/nm0680645/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5533,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022781/"
        },
        {
            "@type": "Person",
            "name": "John Milius",
            "url": "/name/nm0587518/"
        }
    ],
    "datePublished": "1973-11-08",
    "description": "John Dillinger and his gang go on a bank robbing spree across the midwest, but one G-Man is determined to bring him down.",
    "director": [
        {
            "@type": "Person",
            "name": "John Milius",
            "url": "/name/nm0587518/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Biography",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcyMTEyNjE4M15BMl5BanBnXkFtZTcwMDg4NTczNA@@._V1_.jpg",
    "keywords": "reference to arizona,public enemy number one,panties,upskirt,year 1933",
    "name": "Dillinger",
    "original_info": {
        "id": "Dillinger_1973",
        "name": "Dillinger",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "winner55"
        },
        "dateCreated": "2009-10-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069976/"
        },
        "name": "Definitive Dillinger",
        "reviewBody": "This is still the definitive biography of John Dillinger on film. I just saw Mann's Public Enemies - this film blows that one away. Forgive me for quoting my own review of Mann's film: \n\n\"Milius, taking his cue from \"Bonnie And Clyde,\" from the earlier Lawrence Tierney film \"Dillinger,\" and from the gaudy gangster films of Roger Corman, fashioned a film that was both flashy yet homespun, part unabashed B-movie, part evocation of American Gothic. Even his occasional tinkering with historical accuracy could be forgiven, since it was clear he had a firm grasp on what the Dillinger phenomenon was really all about - 'farm boy makes good by turning bad' is an undeniable folk-theme of American life. And the brilliance of Warren Oates' performance in the Milius film is that Oates plays Dillinger like a runaway farm-boy with a sense of humor and a quick temper, who just happened to rob banks for a living. That's as much as you can give any professional criminal without lying about the nature of crime namely, it's about stealing other peoples' money and hurting many of them in the process.\" \n\nOther reviewers have remarked this as a B-movie - but it is intentionally so, it never makes any pretense otherwise; and that's important: having decided to make a B-movie leaves Milius with considerable leeway as to how far he wants to push any aspect of the material. So while it's hard to think of any particular dramatic high-point of the film (perhaps the scene where Dillinger and Purvis go to the same restaurant, or the death of Pretty Boy Floyd?), it's much harder to find any moment that really drags the film down - the pacing of the film is that of a B-movie, it moves! There's nothing exceptional about the cinematography or music, or production design; what we're left with are memorable performances by some of the greatest character actors in cinema at the time, and an exciting story with enough savvy to trigger our emotions.\n\nMilius watched the Lawrence Tierney \"Dillinger\" and learned from it before starting this film; Mann should have watched Milius' film over and over before starting \"Public Enemies.\" In any event, this is still THE Dillinger story, and and an entertaining action film as well.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "John Dillinger and his gang go on a bank robbing spree across the Midwest, but one G-Man is determined to bring him down.",
        "duration": "PT2M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3482043161",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzkzNDIwNDYtMDcwOS00N2UyLWFjZmMtOTYwZTRjZjIyODJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzkzNDIwNDYtMDcwOS00N2UyLWFjZmMtOTYwZTRjZjIyODJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-25T19:27:15.252Z",
        "url": "https://www.imdb.com/video/vi3482043161/"
    },
    "url": "/title/tt0069976/"
}