{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dolph Lundgren",
            "url": "/name/nm0000185/"
        },
        {
            "@type": "Person",
            "name": "Polly Shannon",
            "url": "/name/nm0788351/"
        },
        {
            "@type": "Person",
            "name": "Donald Burda",
            "url": "/name/nm0120905/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1663,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0125545/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102280/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100447/"
        },
        {
            "@type": "Person",
            "name": "Greg Mellott",
            "url": "/name/nm0578128/"
        },
        {
            "@type": "Person",
            "name": "Sidney J. Furie",
            "url": "/name/nm0002089/"
        }
    ],
    "datePublished": "2005-05-25",
    "description": "Frank Gannon, a veteran cop, is being hunted by his fellow police officers after they learned he has betrayed the brotherhood and exposed to the feds wide scale corruption of the LAPD. He has one day left to prove his case and sur...",
    "director": [
        {
            "@type": "Person",
            "name": "Sidney J. Furie",
            "url": "/name/nm0002089/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGFhN2RjNTctODYzZi00NmQwLWJiY2MtYzU5NzEwMTAzYmU2XkEyXkFqcGdeQXVyMDI4NjM1MQ@@._V1_.jpg",
    "keywords": "fbi federal bureau of investigation,female police officer,low budget,child in jeopardy,one day timespan",
    "name": "Direct Action",
    "original_info": {
        "id": "Direct Action_2005",
        "name": "Direct Action",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aloep"
        },
        "dateCreated": "2005-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368688/"
        },
        "name": "It's okay. I expected more.",
        "reviewBody": "Given that I had read several positive reviews on this movie and that it comes from the hands of Sidney J Furie, a veteran for over 40 years responsible for 1960's spy thrillers like The Ipcress File and The Naked Runner and has also delivered some very slick direct to video action movies such as Top Of The World, The Rage and Hollow Point as well as the largely underrated 1991 theatrical release The Taking Of Beverly Hills. Furthermore, he also did Detention with Dolph Lundgren which was by no means great but I enjoyed it a lot more than many others did. Given that the general opinion of this was \"a step up from Detention\", I couldn't wait. Well, having seen the finished product it doesn't really surprise me it's been shelved for so long. It isn't bad, but it could be so much better.\n\nNone of this can be blamed on Lundgren or any of the cast really for that matter, as much of them deliver acceptable to good performances. Lundgren especially deserves credit as he is in excellent shape and does very well in the action scenes. The film has a good sense of pacing, never letting up enough for the action to stop and plot itself is fine for the type of movie.\n\nWhat really lets this down is the very poor production values - it looks extremely cheap. No better than a Roger Corman produced Bloodfist film for example. Automatic weapons are fired at cars in the line of fire and they don't receive one bullet hole and no glass breaks. We just get a couple of very simple CGI sparks. This happens way too often, and becomes very hard to ignore. There is also some incredibly bad editing. Weather will change from clear Sunny skies to rain and back in seconds. And there's no interesting locations. All you'll get is residential areas and some abandoned factories. The budget of apparently 5-8 million certainly hasn't been well spent. Of course none of this really makes the movie any less watchable, but it's all those little touches that make a movie all that more enjoyable to watch.\n\nOverall, this is a decent, entertaining action picture with all the visual flair of a TV drama but it's worth a watch once and for Dolph Lundgren fans it will be a must. I would probably have enjoyed it more with lower expectations, but the overall low quality of the movie is something I just couldn't ignore. Sorry."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from DEJ",
        "duration": "PT1M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1319239961",
        "name": "Direct Action",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTcxOWJhNDItYTVkYS00ZGE0LWFmN2YtZjZlMzZmM2ExOTYyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTcxOWJhNDItYTVkYS00ZGE0LWFmN2YtZjZlMzZmM2ExOTYyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:51:55Z",
        "url": "https://www.imdb.com/video/vi1319239961/"
    },
    "url": "/title/tt0368688/"
}