{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gavin Abbott",
            "url": "/name/nm0007971/"
        },
        {
            "@type": "Person",
            "name": "Joanne Adams",
            "url": "/name/nm0011068/"
        },
        {
            "@type": "Person",
            "name": "Shamshad Akhtar",
            "url": "/name/nm1566336/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1546,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005861/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Person",
            "name": "Lizzie Mickery",
            "url": "/name/nm0585319/"
        },
        {
            "@type": "Person",
            "name": "Daniel Percival",
            "url": "/name/nm0672873/"
        }
    ],
    "datePublished": "2005-01-24",
    "description": "A terrorist group detonates a radiological dispersal device (RDD) in Central London. Due to a lack of preparation, training, and resources, chaos ensues.",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel Percival",
            "url": "/name/nm0672873/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Thriller",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWQ3M2M0YTAtNzg1NS00ZDFlLWEzMWEtMTg5OTJiY2I2NWU1XkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "terrorist,die hard scenario,propaganda,terrorist plot,terrorist bombing",
    "name": "Dirty War",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rmax304823"
        },
        "dateCreated": "2005-03-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0427157/"
        },
        "name": "Inexpensive lesson in first response",
        "reviewBody": "It's hard to imagine an American movie like this. The dirty bomb is not seen to explode. We only know it's gone off because London trembles. Even if we had seen it detonate, a dirty bomb is not a patch on a thermonuclear device. Only a few shots are fired and nobody's head disintegrates. There are no sneering greaseball villains, only devout men and women and their children. There is full frontal nudity during decontamination but it is handled so matter of factly, and the bodies themselves are so ordinary, that one feels only embarrassment for the characters.\n\nI won't go into the plot in any detail. Basically its about a group of radical Muslims who detonate a dirty bomb in London, and the attempt of British control agents to prevent it and then to contain it. That's about it.\n\nThe movie is not sensationalistic in any way and is sometimes a bit hard to follow. One of the principals is an attractive Muslim police officer who has to explain to her colleagues (and to us groundlings) that only a tiny fraction of Muslims are fanatics and so forth, as if we needed it. (We didn't need the speech because the film illustrates the point.) It makes a few cogent points. One police officer observes that they know 90 percent of what the IRA are up to, and yet a few attacks still get through. How can they effectively prevent attacks by radical Muslims about whom they know practically nothing? Well -- they can't, of course, and neither can anyone else. All it takes to pull off such an event is a little organization, a knowledge of chemistry, and a willingness to die. It's like murdering a President or a monarch. If you want to do it badly enough, it can be done.\n\nThe British police are seen playing roughhouse with the captured organizer of the plot -- dunking his head in a bath tub to make him talk about the next target, and so forth. During his interrogation the organizer mentions atrocity against Muslims in Kabul and Bagdhad as an explanation for the attack. The police remind him that he has a wife and child and that they are now in custody, but the organizer isn't perturbed. \"What will this accomplish?\" they ask him. \"You know there will be retaliation.\" And he says placidly, comfortable in his skin, \"We expect your retaliation. It is what unites us and divides you.\" Once social organizations get into these kinds of conflicts, they seem to turn into schoolyard fist fights. Push-Pull machines. One side says we're doing this because you hit us first. The other side says, maybe, but I was just hitting you because you hit me yesterday. Oh, yeah? What about last week when you knocked the books out of my hand? Well I only did that because your father insulted my grandfather one thousand years ago.\n\nI realize the movie deals with a real subject and that the subject is serious, and I realize my example is silly. Yet there does seem to be something in human nature that drives us into conflict with one another, and of course it's always the other party's fault, not ours. I wonder if some day, given the survival of our species, we may find that the same primitive subcortical structures are involved in a schoolyard fight and a global war.\n\nHomo \"sapiens\", my foot."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from HBO Home Video",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1755447577",
        "name": "Dirty War",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDFkMTBlZDItMTAwOC00YTgzLWE3MGQtYTI2MTQwZjA0NmY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDFkMTBlZDItMTAwOC00YTgzLWE3MGQtYTI2MTQwZjA0NmY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:52:23Z",
        "url": "https://www.imdb.com/video/vi1755447577/"
    },
    "url": "/title/tt0427157/"
}