{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harry Hamlin",
            "url": "/name/nm0002122/"
        },
        {
            "@type": "Person",
            "name": "Susan Dey",
            "url": "/name/nm0001138/"
        },
        {
            "@type": "Person",
            "name": "Jer Adrianne Lelliott",
            "url": "/name/nm0500969/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1452,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0183474/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0040305/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078343/"
        },
        {
            "@type": "Person",
            "name": "Walter Klenhard",
            "url": "/name/nm0459268/"
        }
    ],
    "datePublished": "2002-04-21",
    "description": "A family driving through Nevada decides to take some snapshots at an out-of-the-way ghost town named Weaver, and horrible things start happening.",
    "director": [
        {
            "@type": "Person",
            "name": "Walter Klenhard",
            "url": "/name/nm0459268/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Mystery",
        "Thriller",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY3Mzk5NDIzMF5BMl5BanBnXkFtZTcwMjE3ODUyMQ@@._V1_.jpg",
    "keywords": "ghost town,overalls,ground zero,neutron bomb,nevada test site",
    "name": "Disappearance",
    "original_info": {
        "id": "Disappearance_2002",
        "name": "Disappearance",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SkreenMemReez"
        },
        "dateCreated": "2005-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0311018/"
        },
        "name": "Duped! You will invest a lot of brainpower only to have the movie end with a huge cliffhanger",
        "reviewBody": "Disappearance is about a couple who take their family on vacation in New Mexico and find themselves in deep trouble after taking a detour off the main highway to visit a town that was seemingly abandoned in 1948 for unknown reasons. The town of Weaver seems harmless at first and has tourist appeal until the family is stranded there overnight and they begin to have good reason to suspect that others have experienced their same predicament with fatal outcomes. The Henleys watch a Blair-Witch-Project-esquire video diary left by the town's last victim, which ironically demonstrates the best performance of anyone in this movie. Although Hamlin and Dey's performances are much better than the supporting casts', their emotional affect seems \"flat\" to me throughout the movie. \n\nDisappearance has appeal for most of the movie as there is much suspense and good direction. However, the plot takes unexpected and implausible turns that seemingly make no sense. Worse yet it that there really is no understanding of what exactly is going on in the movie, which makes the bizarre ending less tolerable. It appeared to me that the movie makers were so focused on making a stream of suspenseful scenes, that they threw away all the elements of good story making: plot development, gradual explanation of themes and symbols that lead to a cohesive solution/outcome. \n\nThe most difficult aspect of the movie for me was that the first three-quarter of it was spent building up tension and curiosity about certain aspects of the plot that were then suddenly disposed of as if we didn't deserve an explanation: \n\nWhat was the significance of the Indian symbols on the walls? What happened to the original people of Weaver? What was the connection with the people at the dinner? What did the Sheriff know? What did the missing boy discover if anything?\n\nThis was, I believe, a bad move, since it engendered some resentment. I had invested quite a bit of brainpower into hypothesizing some plausible explanations for some of these plot turns and strange events, only to have the movie makers simply end it without giving an answer to any of these things. These are some nice cliffhangers for the ending of a miniseries that is about to pickup again next week, but a totally frustrating and inappropriate ending for a stand-alone movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0311018/"
}