{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rudy Ray Moore",
            "url": "/name/nm0601834/"
        },
        {
            "@type": "Person",
            "name": "Carol Speed",
            "url": "/name/nm0817511/"
        },
        {
            "@type": "Person",
            "name": "Jimmy Lynch",
            "url": "/name/nm0528345/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1676,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0156170/"
        },
        {
            "@type": "Person",
            "name": "J. Robert Wagoner",
            "url": "/name/nm0906177/"
        },
        {
            "@type": "Person",
            "name": "Cliff Roquemore",
            "url": "/name/nm0740673/"
        }
    ],
    "description": "Rudy Ray Moore's fourth in a series of cult favorites finds him playing an ex-cop called back into action to stop an angel dust producer. The angel dust hallucinations alone are well worth the price of admission!",
    "director": [
        {
            "@type": "Person",
            "name": "J. Robert Wagoner",
            "url": "/name/nm0906177/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5MzAyMTY1Ml5BMl5BanBnXkFtZTgwNzA2MjI4MzE@._V1_.jpg",
    "keywords": "disco,blaxploitation film,reference to angel dust,black cop,dance floor",
    "name": "Disco Godfather",
    "original_info": {
        "id": "Disco Godfather_1979",
        "name": "Disco Godfather",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "utgard14"
        },
        "dateCreated": "2013-11-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074412/"
        },
        "name": "Bucky what has you done to yoself?",
        "reviewBody": "Another blaxploitation home run from Rudy Ray Moore, star of Petey Wheatstraw and the Dolemite films. Cheap, amateurish, often unintentionally hilarious film about one man's crusade to rid of the streets of \"the whack\" -- aka angel dust or PCP -- after his nephew Bucky freaks out on the drug. If you've seen a Rudy Ray Moore film before, you know what kind of craziness to expect. If you haven't, you're in for a treat.\n\nFirst, take whatever you know about movies and throw it out the window. There is no professional filmmaking going on here. It's all crudely staged, badly acted, and poorly written. Well, assuming it's actually written at all. I get the feeling with Moore's films a large amount of the dialogue is made up on the spot. Now this sounds fairly terrible and on an artistic and technical level it is. But you don't watch these movies because they're actually good films. You watch them because they are so bad they're funny.\n\nThe action scenes are a farce. Grown men pretending to use kung-fu on one another, emulating what they saw in Bruce Lee movies. Hands and feet supposedly striking but not coming within a foot of their target. There's a hilariously bad sex scene between Moore and a woman that should come as a surprise to no one, given Moore's somewhat effeminate mannerisms.\n\nOne of my favorite scenes is where the frustrated doctor cries out to God: \"Where are you Mister? Are you with us or just in our minds?\" Who would have thought you would find religious metaphysics in a movie called Disco Godfather? But the highlights of the movie for most people would be the PCP hallucination scenes, as well as just about any line Moore delivers in his trademark amateur style. \n\nIf you enjoy blaxploitation films or if you enjoy poorly made films that are good for unintended laughs, then give Disco Godfather a shot. While you're at it, try out some of Moore's other movies. Especially Petey Wheatsraw, the Devil's Son-in-Law.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT3M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3514941209",
        "name": "Disco Godfather",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzk1MTY4NmEtMjc0Yi00NTQwLWI5MDgtM2VhMmY5Yzc2NzkzXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzk1MTY4NmEtMjc0Yi00NTQwLWI5MDgtM2VhMmY5Yzc2NzkzXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-09-28T17:05:26.696Z",
        "url": "https://www.imdb.com/video/vi3514941209/"
    },
    "url": "/title/tt0074412/"
}