{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Muzaffer Özdemir",
            "url": "/name/nm0960230/"
        },
        {
            "@type": "Person",
            "name": "Mehmet Emin Toprak",
            "url": "/name/nm0867780/"
        },
        {
            "@type": "Person",
            "name": "Zuhal Gencer",
            "url": "/name/nm0312648/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21453,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Distant",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0109140/"
        },
        {
            "@type": "Person",
            "name": "Nuri Bilge Ceylan",
            "url": "/name/nm0149196/"
        }
    ],
    "datePublished": "2002-12-20",
    "description": "After his wife leaves him, a photographer has an existential crisis and tries to cope with his cousin's visit.",
    "director": [
        {
            "@type": "Person",
            "name": "Nuri Bilge Ceylan",
            "url": "/name/nm0149196/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWI0YmRjODctNDU4My00OWUzLWIzODEtMDVmYWIwNzk0ZjA5XkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
    "keywords": "reference to andrei tarkovsky,reference to sezen aksu,reference to johann sebastian bach,photographer,ship",
    "name": "Uzak",
    "original_info": {
        "id": "Distant_2002",
        "name": "Distant",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RJBurke1942"
        },
        "dateCreated": "2007-06-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0346094/"
        },
        "name": "The loneliness of long-distance runners from relationships",
        "reviewBody": "This is a film about loneliness and how the distance  physical and emotional -- between people tends to stultify relationships.\n\nThe narrative is simple to the point of banality: a young man Yusuf (Emin Toprak), from a rural village, arrives in Istanbul to stay with his older and successful cousin Mahmut (Muzaffer Ozdemir); Yusuf wants work in the big city. After trying for a few weeks to find work without any success, the strain of having Yusuf living with him is too much for Mahmut. They quarrel  nothing physical, just verbal. Eventually, Yusuf goes, leaving Mahmut alone again. End of story...\n\nExcept for the fact that the performance of the two men as relatives is one of the best on film. Much is said visually; dialog is used to bring out disagreement, distrust, hostility, and insecurity that exist within and between the two men.\n\nThere are many visual gems in this film. For example, while searching for work, young Yusuf, needing a relationship, tries in vain to gain the attention of various young women around the city. The look on his face, as he is thwarted every time, says it all.\n\nOr, wanting a cigarette, Yusuf opens the door to the balcony of Mahmut's apartment and lights up in the frigid December air, leaving the door open; Mahmut, eventually gets up from his work desk, walks to the door (all glass) and the cousins just look at each other for what seems way too long a time. Then Mahmut closes the door, leaving Yusuf out in the cold. The metaphor is complete.\n\nOr, Mahmut cleaning up after Yusuf, grudgingly and with increasing anger; and all the while, Yusuf wastes his time chasing skirts instead of looking seriously for work, and spends Mahmut's money on a toy for a nephew Yusuf is emotional, untidy, impulsive, and vulnerable. Mahmut is rational, logical, self-confident and a demanding control freak: the right-brain, left-brain dichotomy beautifully played out by two actors who say more with a look, a gesture, a frown than any words can convey.\n\nBut, Mahmut is not completely emotionless: he still loves his ex-wife who tells him that she's off to Canada with her husband-to-be. Mahmut affects a distant and confident friendship with his ex, and makes sure that she is okay about going. He wishes her well. He says goodbye. He leaves the coffee shop where they were talking. Later when she calls to say a last goodbye, on the way to the airport, Mahmut goes there and secretly watches as she leaves. The poignancy of the emotion on his face, as she disappears through a door, is worth the wait.\n\nAll in all, this is a standout piece of work by the two main actors and the director, Nuri Ceylan. Some might argue that the pace is too slow; but life goes slowly for much of the time, especially for those who are alone. The camera work is relatively simple also: choose the scene, set up the camera and lighting, and let the actors move across the scene, enter the scene and leave the scene, all the while keeping the camera still. There were a few panning shots, some high-angle tracking shots, a few rural scenes  but much of the film is shown as though on a stage with a fixed camera and a wide angle lens. Except for TV and radio music within the story, there is no music sound track. And, there are those many long silences as the two men sit and watch TV together and/or engage in very limited conversation.\n\nI saw this movie on TV so I was amused to see that, on a few occasions, I was watching TV as they were watching TV also. The silence in the movie matched the silence in my house (I was awake, all others in bed); my chair and position matched that of Mahmut's as he watched TV. Quite eerie, giving me a sense of almost 'being there' with him And, I guess I was, in a sense.\n\nI'll say no more, because I want you to savor the other scenes that I haven't described. It's not a movie for everybody, for sure. More than any movie I've seen, it shows just how much we die when we are all alone  just as we are all alone when we die. Mahmut's face, as it fades to black in the final scene, will stay with me for a long, long time...\n\nHighly recommended for serious movie buffs.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3470311961",
        "name": "DISTANT (Uzak) - Official U.S. trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGU0YjY5YzgtNGY4YS00MjIyLWIzMTUtZjBjODM0YjJkYzc5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGU0YjY5YzgtNGY4YS00MjIyLWIzMTUtZjBjODM0YjJkYzc5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-06-17T16:33:30.392Z",
        "url": "https://www.imdb.com/video/vi3470311961/"
    },
    "url": "/title/tt0346094/"
}