{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yoo Ji-tae",
            "url": "/name/nm0949167/"
        },
        {
            "@type": "Person",
            "name": "Ha-neul Kim",
            "url": "/name/nm6327190/"
        },
        {
            "@type": "Person",
            "name": "Ha Ji-Won",
            "url": "/name/nm0351710/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2149,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Ditto",
    "creator": [
        {
            "@type": "Person",
            "name": "Jin Jang",
            "url": "/name/nm0151733/"
        }
    ],
    "datePublished": "2000-05-27",
    "description": "Two students, separated in time, are somehow able to talk to each other using amateur radio, one in 1979 and the other in 2000.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeong-kwon Kim",
            "url": "/name/nm0453559/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Romance",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTU0Mzk3YTEtNTFiZS00ZGJhLWI1MDItNDFlZjY4YzdhZTk1XkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "amateur",
    "name": "Donggam",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aerslife"
        },
        "dateCreated": "2007-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0270919/"
        },
        "name": "wonderful",
        "reviewBody": "from what you have already heard about this film it may remind you of a movie released in 2006 called 'Lake House' a cheesy love story between Keaun Reeves and Sandra Bullock mainly based around them communicating a year apart from each other and realizing they're 'meant to be' love for each other.\n\nDitto (the English name of the movie) has only a basic connection to 'Lake house' It's main difference is the two characters are 21 years apart in their communication to the past or future. This allows the story to be handled less of a love story between the characters but as an exploration of how their 'long distance' relationship affects the two characters lives and in unexpected ways. \n\nIn my opinion we have to many clichéd, formula love stories. Moving away from that, and dealing with the portrayal of relationships in a mature, realistic way pushes the film from being just an ordinary love story, to being a wonderful film.\n\nMoments of the film however seemed rather strange. The mannerisms of the characters and some of the ways of doing things seemed foreign and stereotypical to Korean culture. Begging the question of whether or not Korean cinema is as accurate of Korean life style as Hollywood is of western lifestyle.\n\nIt also seemed that bits of the movie were 'lost in translation' with background details like signs not being translated to English , or not having translation for what characters are writing down. As well some of the language is awkward and unfitting for the situation when translated, however this is only a mild complaint because the general message was portrayed beautifully.\n\nIn conclusion, Ditto was a wonderful film, handled with maturity and elegance. It is well worth the read, and will leave you feeling satisfied.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0270919/"
}