{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elia Suleiman",
            "url": "/name/nm0837839/"
        },
        {
            "@type": "Person",
            "name": "Manal Khader",
            "url": "/name/nm1159365/"
        },
        {
            "@type": "Person",
            "name": "George Ibrahim",
            "url": "/name/nm1159275/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3746,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Divine Intervention",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063732/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066028/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050506/"
        },
        {
            "@type": "Person",
            "name": "Elia Suleiman",
            "url": "/name/nm0837839/"
        }
    ],
    "datePublished": "2002-10-02",
    "description": "Separated by a checkpoint, Palestinian lovers from Jerusalem and Ramallah arrange clandestine meetings.",
    "director": [
        {
            "@type": "Person",
            "name": "Elia Suleiman",
            "url": "/name/nm0837839/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0Mzc0MDQxN15BMl5BanBnXkFtZTcwMjc2ODkyMQ@@._V1_.jpg",
    "keywords": "satire comedy,checkpoint,jerusalem,santa claus,mail",
    "name": "Yadon ilaheyya",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0274428/"
        },
        "name": "You need to be ready to work hard at it - but even then it is dull and flawed",
        "reviewBody": "Set in the segregated world of checkpoints and bombings of the Middle East, two lovers are separated - one living in Jerusalem, the other in Ramallah. Despite the threats posed by bombings and shootings, and the deterrents of the checkpoints, the two arrange secret meetings.\n\nI have done it too, so I won't make too big a deal out of it; but too many of us doff our caps at the sight of a foreign film, too many reviews are very forgiving of flaws foreign films that we would go to town on in a western film. That appears to be the case here, reviewers seem to have sat down looking for `a deep film that will touch them' and that is what they have found - and in doing so they fall for much of the film's forced pretension. The plot is very difficult to describe and it is not easily forgotten - I found it very difficult to get into it simply because it was episodic and lacking a flow to it; it is more interested in delivering metaphors and symbolism that don't necessarily work that well.\n\nI, like many, do not and cannot ever hope to fully understand what life is like in this part of the world; therefore I was not able to get the meaning or, if there were any, the jokes. I have lived the vast majority of my life in a world of terrorism and check points - but this film is more specific than that general experience. However, for me the film was still too shrouded in mystery and `deep' scenes - long scenes pass without dialogue; the camera stares at a road for minute after minute and so on - it smacks of a film trying too hard to be arty and pretentious. This wouldn't be too bad if it had worked - but, for me, it simply didn't do anything. Some of it I'm sure is daring, and I wanted to find the Power Rangers style moment funny - but the tone of the film stopped it working.\n\nAs far as characters, the film barely tries - the focus being `meaningful' swipes and jokes. Five minutes after the film ended I could barely recall character names - and there wasn't really an attempt to develop people within this smugly smart piece.\n\nOverall, if you know the area and are willing to work past all this film's flaws then you may get something from this. However, the curious audience looking to be helped through the film or just looking for something interesting will likely be left as cold, disinterested and poorly served as I was."
    },
    "url": "/title/tt0274428/"
}