{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Julie Kavner",
            "url": "/name/nm0001413/"
        },
        {
            "@type": "Person",
            "name": "Ed Herlihy",
            "url": "/name/nm0379051/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3657,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028809/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093403/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046148/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "datePublished": "1994-12-18",
    "description": "An ordinary American family goes on vacation to Europe. Because of the Cold War they are stuck in the U.S. Embassy surrounding by the Soviet forces.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDk2NjcyOGUtNzQzMy00Mjk2LWFmMTYtNzU1NGQ2MmZjZmQyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "teleplay adapted by author,cold war,1960s,ugly american,written and directed by cast member",
    "name": "Don't Drink the Water",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FlickJunkie-2"
        },
        "dateCreated": "2000-12-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109644/"
        },
        "name": "Woody Allen for the masses",
        "reviewBody": "This 1994 TV movie released to video in late 2000 tells an inane tale of a Jewish American family that, while vacationing in Russia, is mistaken for a ring of spies during the height of the cold war in the 1960's. This is the story of their exploits as they are holed up in the American Embassy waiting for their chance to return to the U.S.\n\nThe story was written and directed by Woody Allen, who is one of the most accomplished auteurs in the history of film. It is clear that Allen purposely dumbed this screenplay down for TV. Instead of his trademark cerebral humor that cuts like a scalpel, he uses a machine gun approach, hitting the viewer with a fusillade of lowbrow jokes and slapstick gags. The humor ranges from insipid silliness to standard sitcom fare with occasional intellectual ironies thrown in for his devoted fans. Though most of it is infantile, the sheer volume of material (literally five to ten jokes and gags a minute) insures that something will tickle you every couple of minutes.\n\nThe cast is rich with accomplished comedic talent. Michael J. Fox plays the son of an ambassador who is a hapless diplomat in training. His frenetic and tortured style of comedy is perfect for this role. Dom DeLuise adds his wacky brand of humor as a priest who has been in hiding in the embassy for six years and is trying to learn to be an amateur magician. For him, the extra inhabitants of the embassy represent a captive audience on whom he can inflict one botched magic trick after another. Julie Kavner brings her whiny New York accent and her wonderful sense of sarcastic timing to play off Woody Allen's inimitably overwrought caricature of himself. Kavner is a refreshing change for Allen. We are used to seeing him across from flaky wimps played by Diane Keaton and Mia Farrow. The use of the bluntly badgering Kavner added significant energy to his performance. The cast is rounded out by Mayim Bialik (TV's, Blossom) who was decent, but not great as the Jewish American Princess in captivity.\n\nOverall, this was a good comedy that was significantly below Woody Allen's standard. There are plenty of funny lines, but it is a much too farcical. I rated it a 6/10. If you enjoy Woody Allen's normal introspective and intellectual humor, this might be a disappointment.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0109644/"
}