{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dan Grimaldi",
            "url": "/name/nm0342106/"
        },
        {
            "@type": "Person",
            "name": "Charles Bonet",
            "url": "/name/nm0094312/"
        },
        {
            "@type": "Person",
            "name": "Bill Ricci",
            "url": "/name/nm0723196/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4835,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0075523/"
        },
        {
            "@type": "Person",
            "name": "Joe Masefield",
            "url": "/name/nm0556240/"
        },
        {
            "@type": "Person",
            "name": "Joseph Ellison",
            "url": "/name/nm0255208/"
        },
        {
            "@type": "Person",
            "name": "Ellen Hammill",
            "url": "/name/nm0358614/"
        }
    ],
    "datePublished": "1980-03-28",
    "description": "A disturbed young man who was burned as a child by his sadistic mother stalks women with a flamethrower.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Ellison",
            "url": "/name/nm0255208/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2NiNWI0ZGYtMWFhNS00Njg2LWE0YjItYTI5NmFlYThlZmUzXkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_.jpg",
    "keywords": "child abuse,emotionally disturbed person,trauma,deeply disturbed person,female victim",
    "name": "Don't Go in the House",
    "original_info": {
        "id": "Don't Go in the House_1980",
        "name": "Don't Go in the House",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LavaHound_76"
        },
        "dateCreated": "2006-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080646/"
        },
        "name": "Not a Just a Quick Cheesy Silly Low Budget 80's B-Movie",
        "reviewBody": "I first heard about Don't Go In The House when Quentin Tarantino mentioned that it was one of the most disturbing films he had ever seen. That's a bit hard to ignore, especially when it is coming from someone who directed/wrote one of the most brutal \"ear-slashing\" torture scenes in cinematic history. I still didn't bother renting it until the film left the \"new releases\" section of the video store I frequent. Even Tarantino's quote didn't grab me THAT much as I thought the title of the movie was a bit goofy, and I read elsewhere that it was really dated. I was just not in the mood for some silly cheesy 80's ultra-low budget exploitation film reminiscent of Last House on Dead End Street. Thankfully, I got more than that...way more.\n\nDon't Go in The House was no doubt influenced by the very true story of Ed Gein which basically means that comparisons to Deranged and Psycho are inevitable. Throw in a bit of Maniac (which opened the same year) with a new weapon of choice and you've basically got Don't Go In The House. What is it about you say? It's about Donny Kohler who lives with his mother and comes home one day from work to find her dead. A normal person who made such a discovery would automatically call 911, but of course Donny isn't normal - that would just be boring. No, Donny instead turns up the stereo, smokes, jumps on a chair like a kid, and burns his cigarette out on a statuette. He is free!! Free from his oppressive and abusive mother. That's until he hears her voice calling out to him. But mother's voice is soon washed away by voices of women luring him on, beckoning him to go against her mothers stern demands and \"sin\". So, this means that Donny must go out, lure women back to his house, and....the rest is a spoiler.\n\nWhile Don't Go In The House does have exploitative qualities about it, what sets it aside from typical \"graphic\" blood-spurting slashers like Maniac and The Prowler is its concentration and attention it gives to the inner turmoil of the lead character rather than focusing on his brutal actions. For this reason the film comes closer to being a character study like Henry: Portrait of a Serial Killer rather than a simple slasher like The Prowler. Granted, there are certain moments that are a bit hokey, but most of the movie is brilliantly embedded in reality due to solid convincing dialogue, the non-disappearance of daily routine like that pesky thing called \"work\", and actions that are perfectly in sync with intense situations that the victims find themselves in (especially the first one).\n\nDon't Go In The House doesn't have too much fat either - every scene serves a clear purpose and doesn't seem to be drawn out to meet its feature length running time. The camera work is very good and inventive like an early Sam Raimi film. One instance that stands out is very brief. It involves Donny slapping a corpse across the face that is seated on a rocking chair. We see this from the corpses point of view - meaning that Donny slaps the camera, it shakes, and then it begins to rock back and forth. Brilliant! And completely unexpected in such a movie. The special effects are not bad for a low budget B movie from the 80's minus Savini - the least it can do is not make you laugh.\n\nOverall, this was a solid film that didn't disturb me as much as it did Tarantino, but it did catch me by surprise.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A disturbed young man who was burned as a child by his sadistic mother stalks women with a flamethrower.",
        "duration": "PT1M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1888404249",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDI1Yzk1MDktMWFlZi00NmEzLTg5ODItODY1NTA0ZjgxM2I3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDI1Yzk1MDktMWFlZi00NmEzLTg5ODItODY1NTA0ZjgxM2I3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-27T19:15:14.966Z",
        "url": "https://www.imdb.com/video/vi1888404249/"
    },
    "url": "/title/tt0080646/"
}