{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Marinker",
            "url": "/name/nm0547603/"
        },
        {
            "@type": "Person",
            "name": "Milton James",
            "url": "/name/nm0055742/"
        },
        {
            "@type": "Person",
            "name": "Yôko Asagami",
            "url": "/name/nm0038290/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 317,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "alternateName": "Doomed Megalopolis",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022946/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062107/"
        }
    ],
    "datePublished": "1991-09-27",
    "description": "The plot concerns a spiritual battle being waged within the capital of Tokyo during the turn of the 20th century. In 1908, Japan is undergoing an enormous process of industrial renovation due the influence of radical western ideal...",
    "genre": [
        "Animation",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUxMzk1NzQ4NF5BMl5BanBnXkFtZTYwMjg1OTc5._V1_.jpg",
    "keywords": "anime remake of live action,ova,anime animation,multiple english dubs,tv mini series",
    "name": "Teito Monogatari",
    "original_info": {
        "id": "Doomed Megalopolis_1988",
        "name": "Doomed Megalopolis",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aaron1375"
        },
        "dateCreated": "2012-01-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0337283/"
        },
        "name": "Anime that incorporates actual events that occurred and has a great villain",
        "reviewBody": "I watched this anime short series and have to say it was rather good. It spans four episodes and while there are some things I did not really understand, overall I was able to follow it. It is based off a book that goes on even longer than the four episodes here, but for some reason they concluded this series short of the actual source material. I would like to read this book, but I could not even find it on amazon so I do not like my chances of finding an English translation of this novel. The stories incorporate different characters here and there, but for the most part this one family is present in every episode. Also present, is the villain of the piece named Katu, who has to be one of the best villains I have seen in a anime that is not a more longer running series. I was disappointed by his change of appearance in the fourth episode as he looked very cool in the first three episodes. We are introduced to this character, whose main goal seems to be to destroy Tokyo as he tries to awaken a spirit who also has a hatred for the city. For some reason this deity does not wish to join Katu so in the last two episodes the villain tries different tactics to destroy the city he seems to loath. He is contested by this old man in the first episode, and the first episode is the best of the bunch. The second part is by far the weakest, mainly due to the time passage and so much stuff they try to squeeze into it and there also really is not a very good counter for the evil Katu. The third one is really good as it introduces a feng shu expert and a female that has strange powers of her own. Then the story concludes in rather good fashion, but it leaves so many questions I had unanswered...answers I can apparently get if I could actually find the book. I wanted to know more about the brother and sister and what happened, shown in a glance, but nothing is really explained. Also, Katu's reasons for what he is doing are never really exposed, this is in the book from what I gather which is why I want to read it. Still, it was a good anime and I enjoyed it for the most part. They really should have done a better job with the second part as it just is so much weaker than the other episodes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from ADV Films",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1554186521",
        "name": "Doomed Megalopolis",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGMzZDQzOGMtODg2OC00N2FhLWFhYjgtNmMwZDIzYWJkYzQ0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGMzZDQzOGMtODg2OC00N2FhLWFhYjgtNmMwZDIzYWJkYzQ0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:54:59Z",
        "url": "https://www.imdb.com/video/vi1554186521/"
    },
    "url": "/title/tt0337283/"
}