{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leslie Cheung",
            "url": "/name/nm0002000/"
        },
        {
            "@type": "Person",
            "name": "Alex Fong",
            "url": "/name/nm0284533/"
        },
        {
            "@type": "Person",
            "name": "Ruby Wong",
            "url": "/name/nm0939315/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1026,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Double Tap",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0033915/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035542/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079020/"
        },
        {
            "@type": "Person",
            "name": "Tung-Shing Yee",
            "url": "/name/nm0232504/"
        },
        {
            "@type": "Person",
            "name": "Joe Man Kwong Cheung",
            "url": "/name/nm2679650/"
        },
        {
            "@type": "Person",
            "name": "Chi-Leung Law",
            "url": "/name/nm0492305/"
        }
    ],
    "datePublished": "2000-05-27",
    "description": "What begins as an innocuous entry into a gun competition eventually steers Rick towards a path of fatal rivalry. With extensive training, Rick emerges as one of the finest shooters in town. Three years down the line, four members ...",
    "director": [
        {
            "@type": "Person",
            "name": "Chi-Leung Law",
            "url": "/name/nm0492305/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGNhZDU4MDYtYWM1Yy00MmEzLTk4M2UtODZmMTk1NWZlZmI0XkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_.jpg",
    "name": "Cheung wong",
    "original_info": {
        "id": "Double Tap_2000",
        "name": "Double Tap",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2011-07-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0258489/"
        },
        "name": "Has a good idea at its core but doesn't build on it",
        "reviewBody": "Rick is a professional marksman, excelling at moving through the competitive target ranges hitting targets twice in very quick succession with extreme accuracy. His main rival is a police officer (Miu Chi-shun) who goads him back into competition. However, a tragedy at the competition sees Rick disappear for several years with blood on his hands. It is only after several years that he comes to mind as Chi-shun is put in charge of an investigation into a federal witness and his four police guards killed in a fast and ruthless manner – most with double hits to the head rather than the easier target of the core body. Rick is called in along with the handful of others known to be capable of such a feat.\n\nThe idea behind Double Tap is a good one and it is one that will be familiar to those that watch many Hong Kong action movies. Essentially what the entire plot boils down to is one man versus another with lots of fast gun play and shootouts on the cards; those that have watched more than one John Woo film will recognise not only the dynamic but also the potential that it holds as a core idea in an action movie. At times it comes off in this film but mostly it doesn't. Indeed, at times it seems so desperate to just \"have\" the idea of these two marksmen going head to head that it forgets to really build a relationship between them, or fully develop the ideas that get us to the action.\n\nIt starts out in the range with fast movement and skills shown for the first 20 minutes or so, then heads into an unlikely and sudden event that sparks the rest of the film (well, sparks it – after several years!). The next action again doesn't ring true and it escalates far too fast and lacks sufficient tension and excitement. The shoot-outs are noisy and bloody but they lack the sense of ballet and exhilaration that better films managed to do. In this the action happens but it seems to do so regardless of what else is going on. Occasionally we will have suggested depth in the characters but it is fleeting.\n\nNone of this makes the film bad though, it only serves to limit it from what it could have been and instead of being a thrilling character-driven action movie with real tension and set-pieces, it only manages to come in as an OK film that aspires to be that. Leslie Cheung tries to make his character more and, in very brief moments, you can see he is tortured, but they are brief moments and mostly he is just ruthless. He communicates with his opposite number but neither he nor Alex Fong really spark off one another; they have scenes but the script doesn't reproduce that respectful rivalry or \"opposite side of same coin\" thing that similar better films have done. Fong is OK individually and both do well, but just the script doesn't give them as much as it could have done."
    },
    "url": "/title/tt0258489/"
}