{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Callie Thorne",
            "url": "/name/nm0861361/"
        },
        {
            "@type": "Person",
            "name": "Bill Sage",
            "url": "/name/nm0756083/"
        },
        {
            "@type": "Person",
            "name": "Noah Fleiss",
            "url": "/name/nm0281575/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 190,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037099/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051619/"
        },
        {
            "@type": "Person",
            "name": "Stephen Kinsella",
            "url": "/name/nm0455873/"
        },
        {
            "@type": "Person",
            "name": "Paul Solberg",
            "url": "/name/nm0812783/"
        }
    ],
    "datePublished": "2000-01-26",
    "description": "A resourceful and high-spirited woman deals with financial distress and her asthmatic thirteen-year-old son when his life is gravely complicated by a new friendship with the son of her former drunken and abusive husband.",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Kinsella",
            "url": "/name/nm0455873/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTU2MDg1OTg4Nl5BMl5BanBnXkFtZTcwMTQxMTAyMQ@@._V1_.jpg",
    "keywords": "teenager,teenage boy,parking meter,mother son relationship,middle school",
    "name": "Double Parked",
    "original_info": {
        "id": "Double Parked_2000",
        "name": "Double Parked",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrettErikJohnson"
        },
        "dateCreated": "2002-05-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0202856/"
        },
        "name": "Surprisingly good.",
        "reviewBody": "I've always liked the idea of independent filmmaking. So many of the mega-corporate blockbusters constantly filling movie screens are such junk. The only problem is that a lot of independent movies are quite poor. They may have their heart in the right place but something always seems to ruin the movie. Inexperienced actors, poor direction, too tight of a budget.\n\nWell, \"Double Parked\" is a wonderful surprise. It grabs you with characters who you really care about. Callie Thorne (Next Stop Wonderland) plays Rita, a single mother of one. Her son, Matt, is played by Rufus Read (Happiness). Matt's a good kid who is befriended by another student named Bret, played by Noah Fleiss (Joe The King).\n\nTen years ago, Rita escaped a violent relationship with Matt's father. Life's currently a bit of a struggle but things are going along okay. As it turns out, Matt's new friend Bret is actually also the son of Matt's father. They're half brothers. Matt is unaware of this and spends a lot of time at Bret's house. Bret is a petty criminal and drug user and he ends up slowly dragging Matt into his life on the edge. If it sounds like this might turn out to be a boring melodrama, it isn't.\n\nI was amazed at how well the script was written. It's so painful watching a film where teens say things that they would never say in a million years. Stephen Kinsella doesn't encounter that problem. He presents to us a rather realistic world that some kids live in. It's chilling to see how abused kids such as Bret have very little morality. By the same token, however, the viewer never has any distaste for his character. Bret is believably presented to us as someone who is still good on a certain level and is only engaged in destructive behavior as a way of lashing out in anger.\n\nThe casting of this film is flawless. In addition to the three main actors, we are also treated to a couple of wonderful supporting performances. Eileen Gonzalez is priceless as Dolores, a co-worker of Rita's. She is given all of the funny lines in the film and she delivers them with style. Bret's girlfriend, DiDonna, is played by Cassandra Morris. I am saddened to see that this is her only acting credit. Cassandra makes her role as a teenaged criminal mastermind and drug pusher look effortless. She's so casual that it doesn't even look as if she is acting.\n\nIf you like a good independent film, or any good film for that matter, than check out \"Double Parked\". This is the type of movie that Hollywood should be producing more of. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0202856/"
}