{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Freddie Prinze Jr.",
            "url": "/name/nm0005327/"
        },
        {
            "@type": "Person",
            "name": "Julia Stiles",
            "url": "/name/nm0005466/"
        },
        {
            "@type": "Person",
            "name": "Selma Blair",
            "url": "/name/nm0004757/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15377,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0091401/"
        },
        {
            "@type": "Person",
            "name": "Kris Isacsson",
            "url": "/name/nm0410640/"
        }
    ],
    "datePublished": "2000-01-21",
    "description": "A young man wins and loses the first serious love of his life. Al Connelly falls in love with the girl of his dreams. After the summer she breaks up with him. As he tries to recover Al goes to desperate measures.",
    "director": [
        {
            "@type": "Person",
            "name": "Kris Isacsson",
            "url": "/name/nm0410640/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3NDIxMTIwMF5BMl5BanBnXkFtZTcwNTQ3MTIyMQ@@._V1_.jpg",
    "keywords": "chef,painter,love,attempted suicide,depression",
    "name": "Down to You",
    "original_info": {
        "id": "Down to You_2000",
        "name": "Down to You",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MichaelOates"
        },
        "dateCreated": "2004-03-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0186975/"
        },
        "name": "Great romance",
        "reviewBody": "\"Down to You\" is one of the brightest and refreshing romances I've seen. With two of Hollywood young and hottest stars, \"Down To You\" has become one of my favorite romantic films. I enjoyed this film for several reasons from the presentation to the performances.\n\nI will argue with anyone who says \"Down To You\" is one of the worst films ever made. The material is new, the dialogue is fresh and the performances are superb. I concede their are cliche's in this film; however, it should not detract from the other assets of \"Down to You.\" In order to accomplish the mission of convincing the audience the script works, the casting director must find just the right chemistry in two highly skilled and talented stars. \n\nIn this case, Freddie Prinze Jr. and Julia Stiles have the best chemistry anybody could ask for. It was such an awesome sight to witness a the director bring two of the hottest stars together to produce one of the year's best romantic comedies in \"Down To You.\"\n\nI knew Julia Stiles could act but what I didn't realize is that Stiles beauty radiated off the screen. I was very impressed with her ability to capture the audience's attention with her smile. Stiles is a rising star and she has nowhere to go but up in Hollywood; I can't wait see her next film.\n\nFor those who don't like this film, I ask you: How could you not appreciate this romantic comedy? It deals with so many different things and is done to perfection. I have always enjoyed a script that has depth to it as this one does because it tells the story of two people and their struggles to hold their relationship together and keep their romance alive.\n\n The best aspect of \"Down To You\" is it allows everyone the opportunity to see the ups and downs in a relationship. I feel this film would make for a great example in studying films revolving around relationships.\n\n\"Down To You\" was very enjoyable to watch and I wish everyone could feel the same enjoyment I felt watching this film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #3",
        "duration": "PT1M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4025392665",
        "name": "Down to You",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTU2MWM4MWYtOTMxOS00ODYwLTkxMzgtNzEwZjA3MTNlNmRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTU2MWM4MWYtOTMxOS00ODYwLTkxMzgtNzEwZjA3MTNlNmRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:18:20Z",
        "url": "https://www.imdb.com/video/vi4025392665/"
    },
    "url": "/title/tt0186975/"
}