{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruno Ganz",
            "url": "/name/nm0004486/"
        },
        {
            "@type": "Person",
            "name": "Alexandra Maria Lara",
            "url": "/name/nm0487884/"
        },
        {
            "@type": "Person",
            "name": "Ulrich Matthes",
            "url": "/name/nm0559890/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 360358,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "alternateName": "Downfall",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002257/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028284/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075650/"
        },
        {
            "@type": "Person",
            "name": "Bernd Eichinger",
            "url": "/name/nm0251536/"
        },
        {
            "@type": "Person",
            "name": "Joachim Fest",
            "url": "/name/nm0275264/"
        },
        {
            "@type": "Person",
            "name": "Traudl Junge",
            "url": "/name/nm0432622/"
        }
    ],
    "datePublished": "2005-04-08",
    "description": "Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII.",
    "director": [
        {
            "@type": "Person",
            "name": "Oliver Hirschbiegel",
            "url": "/name/nm0386570/"
        }
    ],
    "duration": "PT2H36M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU0NTU5NTAyMl5BMl5BanBnXkFtZTYwNzYwMDg2._V1_.jpg",
    "keywords": "bunker,world war two,nazi,fall of berlin,suicide",
    "name": "Der Untergang",
    "original_info": {
        "id": "Downfall_2004",
        "name": "Downfall",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2006-01-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0363163/"
        },
        "name": "The Most Impressive, Depressive and Realistic Dramatic Movie about the World War II",
        "reviewBody": "\"Der Untergang\" is certainly the most impressive, depressive and realistic dramatic movie about the World War II ever made. I have never seen a film picturing the insanity of Hitler in his very last days in a bunker in Berlin with his high command, and how the German people were hypnotized by him like in this film. Last year, I saw the deceptive, boring, pretentious and overrated \"Molokh\", showing a caricature of Hitler and Eva Braun in Bavaria. But \"Der Untergang\" is awesome and comparable to \"Apocalypse Now!\", my favorite movie of war.\n\nTwo years ago, I saw the powerful \"Das Experiment\" and I was impressed with the work of Oliver Hirschbiegel. With \"Der Untergang\", this director is certainly included in my list of favorite directors. It is difficult to highlight one actor or actress in this constellation of stars, but I was impressed with the performance of Bruno Ganz and his \"human\" Hitler, totally different from the stereotypes usual in other movies. The cinematography and the battles are stunning, and the scenario of Berlin completely destroyed recalled the neo-realistic movie of Roberto Rossellini \"Germania Anno Zero\".\n\nFor those who know Germany and German people, it is amazing to see how this wonderful country survived to the chaos, destruction and lack of command, arrived from the ashes like Phoenix and sixty years later is again one of the greatest nations. For those who might have believed in Hitler and his Nazi Party, it is impressive to see how people is forgotten and treated without compassion by their leader in his last hours. And for those who love war, I really recommend to watch this magnificent anti-war movie, and see the behavior of the leaders and population when a war is lost. My vote is ten.\n\nTitle (Brazil): \"A Queda! As Últimas Horas de Hitler\" (\"The Fall! The Last Hours of Hitler\")",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0363163/"
}