{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Ursula Andress",
            "url": "/name/nm0000266/"
        },
        {
            "@type": "Person",
            "name": "Bernard Lee",
            "url": "/name/nm0496866/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 171452,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054040/"
        },
        {
            "@type": "Person",
            "name": "Richard Maibaum",
            "url": "/name/nm0537363/"
        },
        {
            "@type": "Person",
            "name": "Johanna Harwood",
            "url": "/name/nm0367820/"
        },
        {
            "@type": "Person",
            "name": "Berkely Mather",
            "url": "/name/nm0558435/"
        }
    ],
    "datePublished": "1962-10-10",
    "description": "A resourceful British government agent seeks answers in a case involving the disappearance of a colleague and the disruption of the American space program.",
    "director": [
        {
            "@type": "Person",
            "name": "Terence Young",
            "url": "/name/nm0950109/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWNjNGU5ZjUtMzc0MC00MWY5LTkxMGUtMjcxZmM2MDYzYzQ4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "british secret service,official bond film,official james bond series,007,jamaica",
    "name": "Dr. No",
    "original_info": {
        "id": "Dr. No_1962",
        "name": "Dr. No",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rneil95"
        },
        "dateCreated": "2013-10-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055928/"
        },
        "name": "The Film That Started It All",
        "reviewBody": "Bond. James Bond. One of the most well-known cinematic icons of all time, Agent 007 has lit up the silver screen and wowed audiences for over 50 years, and this franchise shows no signs of slowing down. The character first appeared in author Ian Fleming's 1953 novel \"Casino Royale,\" but he's best known for the long-lived film franchise by Eon Productions. James Bond has since been ingrained as a major component of popular culture, redefining the film industry upon the release of the early films. Audiences hadn't seen anything like it at the time, and they couldn't get enough of it. Bond has since blown up on a global scale, and it all ties back to this first film, \"Dr. No.\"\n\nDespite being the first film in the series, \"Dr. No\" is actually based on Fleming's sixth novel in the series. As the inaugural Bond film, director Terence Young had a blank slate to work with. The clichés and archetypes that are instantly connected with the franchise today had not yet been established. Fleming wanted David Niven to play Bond, but the studio ultimately went with Sean Connery, who played a major role in defining what the popular view of Bond would become. He simply exudes confidence through his voice, appearance, and attitude. From that genre- defining first moment where we're introduced to Bond, he instantly slips right into the character. It's no wonder people often cite Connery as the definitive Bond, because his performance laid a lot of that groundwork for future incarnations. He's easily one of the best aspects of the film.\n\nThe film sends agent 007 on a mission to Jamaica to investigate the disappearance of a fellow MI6 agent, Strangways. While there, he teams up with CIA agent Felix Leiter (Jack Lord), a native fisherman named Quarrel (John Kitzmiller), and eventually, a woman named Honey Ryder (Ursula Andress) to investigate the goings-on at a mysterious island called Crab Key, owned by the sinister Dr. No, played with an eerie calmness by Joseph Wiseman. The plot itself is relatively standard Bond fare by now, but Dr. No makes for a satisfying villain, his plan is suitably evil (\"World domination. Same old dream\"), and his affiliation with the criminal organization SPECTRE leads to their recurring involvement in subsequent installments.\n\n\"Dr. No\" has a unique, naive quality about it. There's no tongue-in-cheek self-awareness here, this is the first glimpse that audiences had to all the different tropes that would develop in the series, and they're done supremely well. I've already gushed enough about how perfect Connery is as Bond, but his supporting cast is also suitably talented. Ursula Andress sets the bar high for all subsequent \"Bond girls\" that would follow suit, and to this day, she's still one of the best. The production design by Ken Adam, while not yet achieving the grandeur of later films, is still brilliant, establishing the iconic island lair that has since become a staple of the series. Dr. No himself, while underused, is a suitably formidable foe, and Joseph Wiseman makes the most of his limited screen time.\n\nThe film is incredibly dated, and in many respects, it doesn't hold up well. However, I don't necessarily fault the film for that. It's definitely a product of its time, and if looked at through the proper context, it functions as a brilliant time capsule film, giving audiences a unique look into the cultural and geopolitical beliefs of the time. I would have loved to see audience reactions to this movie back when it first came out. It's a really revolutionary film, and at the very least, it's worth checking out if only to see where it all started.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A resourceful British government agent seeks answers in a case involving the disappearance of a colleague and the disruption of the American space program.",
        "duration": "PT3M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2536031001",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzkwY2E2YzktMGI1NC00ZmY0LWIzMDctZGM3MDE4NzlhNDNiXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzkwY2E2YzktMGI1NC00ZmY0LWIzMDctZGM3MDE4NzlhNDNiXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-15T16:19:04.642Z",
        "url": "https://www.imdb.com/video/vi2536031001/"
    },
    "url": "/title/tt0055928/"
}