{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eddie Murphy",
            "url": "/name/nm0000552/"
        },
        {
            "@type": "Person",
            "name": "Cedric the Entertainer",
            "url": "/name/nm0147825/"
        },
        {
            "@type": "Person",
            "name": "Kristen Wilson",
            "url": "/name/nm0933723/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 46048,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022730/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062608/"
        },
        {
            "@type": "Person",
            "name": "Hugh Lofting",
            "url": "/name/nm0517452/"
        },
        {
            "@type": "Person",
            "name": "Larry Levin",
            "url": "/name/nm0505648/"
        }
    ],
    "datePublished": "2001-06-22",
    "description": "Dolittle must save a forest and a bear's life.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Carr",
            "url": "/name/nm0139867/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Comedy",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTZhMWZkYjgtNjE5MS00OWY4LWFmMWQtMDc4M2RlMjg4Y2NhXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_.jpg",
    "keywords": "second part,california,sequel,veterinarian,sequel to remake",
    "name": "Dr. Dolittle 2",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mattymatt4ever"
        },
        "dateCreated": "2001-08-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0240462/"
        },
        "name": "Innocuous and mildly entertaining, but overall forgettable",
        "reviewBody": "\"Dr. Dolittle 2\" is pretty much what you would expect out of a family comedy, only a tad more crude. We could've done with maybe one less gag about animal urination. The plot is a pious, predictable one involving the preservation of an endangered species of bears. You know, one of those storylines that's supposed to deliver a \"message\" to all the young ones out there.\n\nLike usual, we have the talking animals voiced by a variety of celebrities. Steve Zahn lends his voice to one of the lead animal characters. He's actually quite funny at times, as a bear/circus performer who's overcome by stardom, and now that he found out he's part of an endangered species he has to learn how to live like a normal bear: start hibernating, eating fish, etc. Lisa Kudrow is the voice of his love interest. Michael Rapaport is funny as a racoon who's the henchman of an alleged animal Mafia.\n\nSince the Dolittle's daughter (Raven-Symone) is all grown-up, we have to expect the obvious romantic subplot in which she hits puberty and engages in an active dating life. Her father, naturally, has doubts about her new supposedly rebellious boyfriend (Lil' Zane). So we're dragged through that unnecessary subplot, which pretty much serves as filler to complete a running time of 100 minutes.\n\nLately, Eddie Murphy has been tackling PG projects like this and \"Shrek.\" A few years back, he took a try at cleaning his act when doing a voice-over for Disney's \"Mulan.\" Then again, in the flop \"Holy Man.\" I have to admire him for showing his more sanitized approach to comedy. Despite his inability to use the \"f\" word, he proves he's still a multi-talented comedian and not a talented comedian whose act is totally watered-down and dull because of being forced to clean up his mouth. Though he pretty much plays the straight man (I also have to admire him for his discipline, in remaining subdued and in character rather than viewing the movie as no more than a showcase for his comedy), he still belts out some witty one-liners and proves to be just as funny as his animal companions.\n\n I don't really have any strong opinions about this movie. It's harmless, but it could've used a major rewrite. It's funny at times, but could've been a lot funnier (and less crude). Don't worry, you won't be seeing any gags involving birds crapping into people's mouths or a thermometer getting stuck into a dog's behind. The film has just enough crudeness to achieve the PG rating, but we still could've done without it. Your kids will be rolling in the aisles, while the adults may want to take a few popcorn and bathroom breaks. Not bad (especially for a sequel), but forgettable and even somewhat dull. You're better off catching this one on video.\n\n My score: 6 (out of 10)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1491403033",
        "name": "Dr. Dolittle 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTRhODg3MzQtODVhNi00ODJiLTgxNDgtNWU2Y2FiZjk0N2E5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTRhODg3MzQtODVhNi00ODJiLTgxNDgtNWU2Y2FiZjk0N2E5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-05-29T18:23:01Z",
        "url": "https://www.imdb.com/video/vi1491403033/"
    },
    "url": "/title/tt0240462/"
}