{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Lee",
            "url": "/name/nm0000489/"
        },
        {
            "@type": "Person",
            "name": "Peter Cushing",
            "url": "/name/nm0001088/"
        },
        {
            "@type": "Person",
            "name": "Stephanie Beacham",
            "url": "/name/nm0000883/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7001,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060069/"
        },
        {
            "@type": "Person",
            "name": "Don Houghton",
            "url": "/name/nm0396449/"
        },
        {
            "@type": "Person",
            "name": "Bram Stoker",
            "url": "/name/nm0831290/"
        }
    ],
    "datePublished": "1972-11-17",
    "description": "Johnny Alucard raises Count Dracula from the dead in London in 1972. The Count goes after the descendants of Van Helsing.",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Gibson",
            "url": "/name/nm0316830/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmYxMGY3ZTktODNlMS00MDlkLWEwNjEtZTdjMzQyNjQzYWExXkEyXkFqcGdeQXVyNjk2MzA0ODA@._V1_.jpg",
    "keywords": "ring,descendant,scotland yard,police,fight",
    "name": "Dracula A.D. 1972",
    "original_info": {
        "id": "Dracula A.D. 1972_1972",
        "name": "Dracula A.D. 1972",
        "year": "1972"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Wuchakk"
        },
        "dateCreated": "2014-03-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068505/"
        },
        "name": "More hip than horror",
        "reviewBody": "England's Hammer Studios did 9 Dracula or vampire films from 1958-1974:\n\n1. Horror of Dracula (1958); 2. Brides of Dracula (1960); 3. Dracula, Prince of Darkness (1966); 4. Dracula has Risen from the Grave (1968); 5. Taste the Blood of Dracula (1970); 6. Scars of Dracula (1970); 7. Dracula A.D. 1972 (1972); 8. The Satanic Rites of Dracula (1973); and 9. The Legend of the 7 Golden Vampires (1974).\n\nChristopher Lee plays the Count in all but \"The Brides of Dracula\" and \"The Legend 7 Golden Vampires.\" Peter Cushing also stars in four entries as Van Helsing.\n\nBy the time of the seventh film the creative well was apparently running dry and Hammer decided to spice up the series by bringing the Count to present-day London (1972, of course), which was Hammer's response to other successful vampire films at the time taking place in the modern day, such as \"The Night Stalker,\" \"Blacula\" and \"Count Yorga.\" The story revolves around a group of hip counter-culture youths performing a black mass in an abandoned church for kicks (although the ringleader takes it serious) and they revive the blood-sucking prince of darkness. Havok ensues.\n\nPeter Cushing appears as Van Helsing's descendant. Christopher Neame plays the nutjob who performs the black mass with utter relish. Also on hand are the stunning beauties Stephanie Beacham and Caroline Munro. Stephanie plays Van Helsing's daughter and Caroline has a small but significant role. There are a couple of other early-70s hippie babes as well.\n\nThe first half of the film borrows heavily from the previous \"Taste the Blood of Dracula\" in that the Count is resurrected in roughly the same manner, although \"Taste\" is more effective. Which isn't to say that \"Dracula A.D. 1972\" isn't a decent entry in the series, albeit bizarre. The main problem with the film is that the story doesn't seem to know what to do once Dracula is resurrected. For instance, Cushing's final battle with the Count is fairly lame for various reasons (I don't want to give anything away), not to mention Lee only appears for about 10 minute in the entire film, which is usual for the series, of course.\n\nAnother problem is the score. It screams \"early 70s\" in a bad way, but doesn't mesh with what is essentially a serious horror flick. Of course some would cite that as part of its charm. I said \"serious horror flick, by the way, because this is not a goofy or campy flick despite the colorful hippie elements and lousy score.\n\nWhat works best is that it's a great period piece. You'll get a groovy glimpse of England's counter-culture, including the hippie girls and a live performance by the band Stoneground (who didn't go anywhere beyond this movie, likely because their sound & style was already passe by 1972). So, the first half is fun and compelling, whereas the second half just sort of goes through the motions and peters out.\n\nBOTTOM LINE: \"Dracula A.D. 1972\" is hard to rate because, despite the mediocre-ness of the story's second half, the film is a fun experience with numerous highlights. Hence, as a Dracula story I give it a C+, but for entertainment value I give it a solid B or B+.\n\nThe film runs 96 minutes and was shot in England.\n\nGRADE: B-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi61980185",
        "name": "Dracula A.D. 1972",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWQ4MDRlZDEtYjY4Ny00MWJkLWE1ZGEtNDc5NGMzMTg0OGYyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWQ4MDRlZDEtYjY4Ny00MWJkLWE1ZGEtNDc5NGMzMTg0OGYyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-21T17:03:12.562Z",
        "url": "https://www.imdb.com/video/vi61980185/"
    },
    "url": "/title/tt0068505/"
}