{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wei-Qiang Zhang",
            "url": "/name/nm1041931/"
        },
        {
            "@type": "Person",
            "name": "Tara Birtwhistle",
            "url": "/name/nm1039461/"
        },
        {
            "@type": "Person",
            "name": "David Moroni",
            "url": "/name/nm0606074/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2168,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0090781/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045850/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043641/"
        },
        {
            "@type": "Person",
            "name": "Bram Stoker",
            "url": "/name/nm0831290/"
        },
        {
            "@type": "Person",
            "name": "Mark Godden",
            "url": "/name/nm1136257/"
        }
    ],
    "datePublished": "2003-12-12",
    "description": "A ballet rendition of Bram Stoker's \"Dracula\", stylized as an Expressionistic silent film.",
    "director": [
        {
            "@type": "Person",
            "name": "Guy Maddin",
            "url": "/name/nm0534665/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Drama",
        "Horror",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDQxM2I4NTAtMDNjYi00MTAxLWIzNmMtYTI2Njg3MzY3NTE1XkEyXkFqcGdeQXVyOTUzMjk0NDE@._V1_.jpg",
    "keywords": "canadian horror,canadian gothic,dracula character,fiance fiancee relationship,gothic",
    "name": "Dracula: Pages from a Virgin's Diary",
    "original_info": {
        "id": "Dracula: Pages from a Virgin's Diary_2003",
        "name": "Dracula: Pages from a Virgin's Diary",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2005-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0293113/"
        },
        "name": "Cinematically Erotic",
        "reviewBody": "I am completely revising my must see list after watching this. I know only one other of Maddin's projects, his \"Saddest Music in the World\" of the next year. I rated that in my category of films you must see. \n\nThe rules of that list are that no more than two films per year, nor no more than two per filmmaker can be on it. This almost bumped \"Talk to Her\" off that list. It may yet. Let me advise you now that this is powerful and important stuff, the only successful marriage I know of literature, dance and film. In fact I know few that successfully integrate any two, much less masterpieces in each medium.\n\nThe story itself is greatly enriched: all the most terrifying horror is beautiful, and this is: an arc of desire across your life for that hour and a half. Where the original was only about sex, this is written larger to race, money, power and all in an erotic context that transcends sex. You'll notice when seeing this that it is more true to the book than any other filmed version.\n\nNow just think for a moment about this: Dracula has been filmed by Murnau, Browning, Warhol, Herzog, Franco, Coppola and herds of lesser lights. No where has the scope been this broad and sharp.\n\n(The device of the diary has been changed from the detective's to the virgin's, a master concept that indicates the deep thought that went into this. Exposure to that diary makes the girlfriend sex-crazed, for instance, as if the art itself were the infected blood.)\n\nThe dance. The choreographer has put together something that is remarkable, even seen merely as a ballet. It uses Mahler's music, by the way. That music is usually so overtly ripe it smells of selfish world conquest. It says something that here it seems merely supportive, that what you see on the screen is bigger.\n\nSo the choreography affects powerfully but what matters is the cinematic rendition. This is far more evocative as filmed ballet than a live performance can ever be, because we are allowed to have our eyes dance as participants. When a character's eyes flutter and question, ours do too. When the dance suggests a motion, it is us that completes it or gives it a resting place. The integration of choreography and cinematography is the best I have ever had in my life: beyond the sheer energy of \"Red Shoes\" to intimacy.\n\nBut it is the other cinematic qualities that make this unique. Dracula is a powerful story only because it evokes notions of the past that have power to awaken and live in our souls. Those notions are like the vampire and carried by him in the story. Once we touch them -- have sex with them, we are infected, transformed.\n\nHow to convey that cinematically? Why by evoking old film techniques as the story did literary ones. (Today that evocation by hacks is inaptly called \"gothic.\") So we have a silent film. Actually a postmodern comment on a silent black and white film. Lots of reminders of the camera in cropping and Vaselined lenses. Occasional tinting (blood and lucre), overtly theatrical sound effects, wobbling when we have to move quickly (or die).\n\nThe gauzy camera lens is made three dimensional with fog that extends the blur as the camera motion is also made three dimensional by the moving crowd. The whole thing has a phrasing and rhythm that is so well integrated among the dance, light, camera, story and music it is as if the things coevolved from the big bang.\n\nWhoever did the art design deserves a reward. The sets are organic and in the last half in the lair, overtly vaginal -- so overtly it shocks. It must have been drawn at the same time as the choreography.\n\nThere's sex and beauty and seduction here. Be seduced my friends. Succumb. Art requires seduction and in the process some infection of urges. It is all about the dance -- Succumb, dance, die.\n\nTed's Evaluation -- 3 of 3: Worth watching."
    },
    "url": "/title/tt0293113/"
}