{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Patrick Bergin",
            "url": "/name/nm0000920/"
        },
        {
            "@type": "Person",
            "name": "Hardy Krüger Jr.",
            "url": "/name/nm0473204/"
        },
        {
            "@type": "Person",
            "name": "Stefania Rocca",
            "url": "/name/nm0733625/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 465,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064546/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044017/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047527/"
        }
    ],
    "datePublished": "2002-05-29",
    "description": "Bram Stoker's classic is given a frightful telling, as an attractive, ambitious group of 30-year-olds travel through Hungary looking for lucrative deals, unaware of the horrific threat hanging over their lives.",
    "genre": [
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2Q0N2E0YjUtZTJiMy00ZTFlLTg4MzctOWIyZWVmY2EzMGE5XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "psychotronic series,human vampire kiss,dracula mina romance,hypnotized woman,barefoot woman",
    "name": "Dracula",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "insightstraight"
        },
        "dateCreated": "2004-07-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0287846/"
        },
        "name": "Surprisingly faithful adaptation of Bram Stoker's novel \"Dracula\" -- deserves better attention!",
        "reviewBody": "Dracula is a major presence in our house (along with his relatives the Mummy, the Wolf Man, Frankenstein, zombies, ...) I cannot claim to have seen all of the many films which are descendants of Bram Stoker's original work -- the \"Dracula\" name has been applied to everything from sex farce to psychological allegory, and some of it is pure trash. But we have seen more than our share of not only Dracula movies but also vampire movies in general, as well as any number of play adaptations.\n\nIt seems that most Dracula movies are not adaptations of the book, but rather adaptations of previous movies. Admittedly, the book is devilishly hard to stage/film, as it is structured as a series of excerpts from journals, difficult to weave into a consistent narrative flow. But one often gets the impression that the directors (or screenwriters!) of some of the films haven't bothered to read Stoker's novel, contenting themselves with merely screening some previous efforts.\n\nSo it is always with some trepidation we watch a new \"Dracula\" film, bracing ourselves for yet another schlock assault with only passing connection to the original. (Not that we are against schlock per se -- only when it masquerades to deceive.) Frankly, the cover art and copy of \"Dracula's Curse\" didn't give us much hope of quality.\n\nThus, we were pleasantly surprised to find that it is a well-appointed, thoughtful, and reasonably faithful version of Bram Stoker's book. Obviously, the production team had not only read the book but understood it, and labored to bring it to the screen as accurately as possible. In this, it stands head and shoulders above most \"true to the novel\" versions, including Coppola's (don't get me started on *that* one...)\n\nThe film does strike several sour notes -- the flying effects are in my opinion quite overused, and in fact unnecessary -- and at several points is at odds with tradition. (Vampiric insensitivity to sunlight will jar most people.) But many of these \"traditions\" are actually creations of earlier films, as careful reading of the novel will show. The ending is also rather rushed, as though the production was running out of money and could not afford the chase across Europe to save Mina.\n\nThe multinational cast does take a bit of getting used to, with as many accents as there are actors. But even this is true to the spirit of Stoker, who inserted an \"exotic\" American and the European Van Helsing into his story to lend it an international flavor. \n\nSome of the casting plays against movie convention; Dracula (Patrick Bergin) in particular is at odds with what many people expect of the bloodsucking count. He looks far more authentically Romanian than any other Dracula we have seen (like a cross between Robert Goulet, Harvey Keitel, and Lech Walesa). Unfortunately, as the \"aged\" Dracula he looks distractingly like Scots comic actor Billy Connolly. But he has appropriate menace as well as some regal bearing, and is closer to Stoker's description than most.\n\nThe film is set in the present day, but by clever and deft scripting allows whole sections to feel as though they are set during Stoker's time. The locations and settings are sumptuous; the film makes very effective use of Budapest scenery to set the mood. Great care was obviously taken to achieve interesting camera angles.\n\nAnd more of Stoker's dialogue is present than in perhaps any other version of the story, including the Louis Jourdan mini-series.\n\nFor someone who has only seen other \"Dracula\" movies, this one may seem slow and overstated. But to anyone who has read the book and enjoyed it, this movie is a refreshing attempt to bring Bram Stoker's original vision to the screen. Rather than rely on gratuitous gore and nudity, this production builds on mood and a fluid sensuality. Just as Stoker intended."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Dracula's Curse",
        "duration": "PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3828333849",
        "name": "Dracula's Curse",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmM3NjgzMzYtZTJkMi00MzQzLTk5MGMtMzI5NjJjOTBhZWEyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmM3NjgzMzYtZTJkMi00MzQzLTk5MGMtMzI5NjJjOTBhZWEyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-11T02:06:48.394Z",
        "url": "https://www.imdb.com/video/vi3828333849/"
    },
    "url": "/title/tt0287846/"
}