{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Scott Lee",
            "url": "/name/nm0001462/"
        },
        {
            "@type": "Person",
            "name": "Lauren Holly",
            "url": "/name/nm0000452/"
        },
        {
            "@type": "Person",
            "name": "Robert Wagner",
            "url": "/name/nm0001822/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 31786,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063117/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Robert Clouse",
            "url": "/name/nm0167195/"
        },
        {
            "@type": "Person",
            "name": "Linda Lee Cadwell",
            "url": "/name/nm0004791/"
        },
        {
            "@type": "Person",
            "name": "Edward Khmara",
            "url": "/name/nm0451689/"
        }
    ],
    "datePublished": "1993-05-07",
    "description": "A fictionalized account of the life of the martial arts superstar.",
    "director": [
        {
            "@type": "Person",
            "name": "Rob Cohen",
            "url": "/name/nm0003418/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Action",
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA1MTQxNzAtM2MyOC00NDBhLWFlNmEtOWZlM2E5MjNlODU2XkEyXkFqcGdeQXVyNDAxNjkxNjQ@._V1_.jpg",
    "keywords": "kung fu,kato,racism,martial arts action,martial arts",
    "name": "Dragon: The Bruce Lee Story",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JMFOX"
        },
        "dateCreated": "2003-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106770/"
        },
        "name": "Dragon Review And General Feelings On Bruce's Death",
        "reviewBody": "Very Good But Horribly Inaccurate Account Of His Life\n\nIf you are watching this as someone who has no knowledge of Bruce Lee's life then this is a good fun action film but someone who knows the history and the story of his life may be dissapointed as this is not at all accurate. And knowing Bey Logan, he must cringe watching this. The film depicts Bruce's early childhood in Hong Kong, his teenage years in the US right way through to his eventual death in 1973. The element that I think drags this film down the most is the mythological side of it, if it had just been a realistic account of his life without the myths and demons, it would have faired much better. There are many innacurate scenes and occurences in this film which understandably makes the film more exciting for mainstream audiences but as a Bruce fan myself i wish they would have stuck to what actually happened. I wish there were more scenes where Bruce was on set of one of his films, like Way Of The Dragon or Fist Of Fury. There could have been more scenes with Bruce with Yip Man or Brandon. There could have been scenes of Bruce being challenged on the street in his infamous street fights, the episode of the green hornet they portrayed i don't think was an actual episode. And Bruce was not injured by the fighter at the martial arts challenge in Chinatown it was when he was weightlifting and pulled his back out. But the fight scenes are well choreographed.\n\nJason Scott Lee has got his portrayal of the man spot on, he brings the right amount emotion and power to the role, he's clearly done his research on Bruce's mannerism's and got himself in shape for the role as well as training for the fight scenes. Its hard to imagine anyone else who could have played the role, maybe Jet Li who at the time the film was made was 30 and roughly the right age to play Bruce, but Jet spoke very little English. Lauren Holly is equally as good in her role as Linda. The strong portrayals are in many ways successful because of the on set help of the real Linda and Shannon(who makes a cameo as a singer). The music is perhaps the film's strongest part, somehow the main score seems to catch the right emotion of Bruce's death and Brandon's death in 1993. I like the way the film captures the aura of Bruce Lee.\n\nThere will indeed never be another Bruce Lee. I find it fascinating to imagine what Bruce would have done if he had lived, the 80's and 90's would have been very different if Arnie, Stallone, Wiilis, Seagal and Van Damme had Bruce to compete with, Bruce is sometimes critcised for being a bad actor, but i disagree, if anyone has seen his episodes of `Longstreet' or `Marlowe' they will see that Bruce could convincingly carry a dramatic scene given the right script and no dubbing and he oozed charisma, and he showed glimpses of good acting in Enter The Dragon.\n\nBeing a Bruce fan i kind of wish that Jet Li would do the films that bruce did or was planning on doing, Jet's early work in Honk Kong like the Shaolin Temple or more recent stuff like Fist Of Legend(remake of Fist Of Fury) and Once Upon A Time In China was very promising and it seemed he was the successor to Bruce but instead now he's doing crap in Hollywood with DMX and Jason Statham. Strangely the mediocre Lethal Weapon 4 is Jet's best Hollywood film, Maybe Jet should do a project with John Woo, it would be interesting and they'd probably get the best out of each other."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Pictures",
        "duration": "PT1M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2258764057",
        "name": "Dragon: The Bruce Lee Story",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2JlYTNiMjAtMGQwNy00OTZkLTlmMjQtYmIzOTc3M2RkMmYxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2JlYTNiMjAtMGQwNy00OTZkLTlmMjQtYmIzOTc3M2RkMmYxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:52:59Z",
        "url": "https://www.imdb.com/video/vi2258764057/"
    },
    "url": "/title/tt0106770/"
}