{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Masako Nozawa",
            "url": "/name/nm0637586/"
        },
        {
            "@type": "Person",
            "name": "Hiromi Tsuru",
            "url": "/name/nm0875442/"
        },
        {
            "@type": "Person",
            "name": "Naoki Tatsuta",
            "url": "/name/nm0851311/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2460,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "Dragon Ball: The Path to Power",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050796/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038119/"
        },
        {
            "@type": "Person",
            "name": "Akira Toriyama",
            "url": "/name/nm0868066/"
        },
        {
            "@type": "Person",
            "name": "Aya Matsui",
            "url": "/name/nm1257846/"
        }
    ],
    "datePublished": "2003-04-29",
    "description": "Goku and friends go to an adventure searching for the legendary Dragon Balls, as they fight against the Red Ribbon army.",
    "director": [
        {
            "@type": "Person",
            "name": "Shigeyasu Yamauchi",
            "url": "/name/nm0945674/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjczMjkxOGEtN2NmNC00NGU2LWIxYTItYmZmNmQyZjRjMmE0XkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "reboot,mature animation,for grown ups animation,anime animation,army",
    "name": "Doragon bôru: Saikyô e no michi",
    "original_info": {
        "id": "Dragon Ball: The Path to Power_2003",
        "name": "Dragon Ball: The Path to Power",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JayWolfgramm"
        },
        "dateCreated": "2023-03-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0142250/"
        },
        "name": "Retelling the Beginning of Dragon Ball...Again",
        "reviewBody": "Let's get this out of the way. We have the original anime telling the story of Bulma meeting Goku. Then we had the \"Curse of the Blood Rubies\" that tells us the story of how Bulma met Goku. Then 10 years later, we had this movie \"Path to Power\". What is the point of rehashing the same story yet again? Well, perhaps I am being too harsh. Admittedly I am not a fan of the GT style animation that this movie goes with. That is more due to my bias against GT opposed to the animation style itself.\n\nThe movie condenses the opening Pilaf saga and combines it with the Red Ribbon Army saga. It cuts out Pilaf, Chi Chi and Mercenary Tao in attempt to pace it out to a solid 80-minute runtime. Once again setting this timeline apart, as if to say what if the Red Ribbon Army would have gone after the Dragon Balls a year earlier.\n\nThis DB movie has the gift of hindsight, in that they made this movie after the whole run of DBZ movies and show had completed its run. Watching it, there is a distinct DBZ feel that perinates through different parts. Goku screams to power up like in DBZ, despite that not being a major part of the original DragonBall. They don't use this hindsight to add in Dr. Gero to the timeline, but that's a nerdy nitpick.\n\nI don't think they get the characterization of Goku right in this. I am aware that Goku was a happy go lucky kid in the original Dragon Ball. But in this one, he laughs almost constantly, it gets really annoying.\n\nIt is a shame that they didn't pick up where they left off in the previous DB movie timeline. They recap the events of the Pilaf Saga twice but never recap the King Piccolo Saga. Once again, just a nerdy nitpick moment.\n\nThere isn't anything retold here that I do not prefer in either the \"Curse of the Blood Rubies\" of more importantly, the series proper. If you think this movie is fine away to abridge those original Dragon Ball Arcs you are mistaken. I still recommend watching the original instead of this truncated version. There are no shortcuts on the path to power.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0142250/"
}