{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Doc Harris",
            "url": "/name/nm0364629/"
        },
        {
            "@type": "Person",
            "name": "Christopher Sabat",
            "url": "/name/nm0754526/"
        },
        {
            "@type": "Person",
            "name": "Scott McNeil",
            "url": "/name/nm0573926/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 135338,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050796/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003331/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062107/"
        }
    ],
    "datePublished": "1996-09-13",
    "description": "With the help of the powerful Dragonballs, a team of fighters led by the saiyan warrior Goku defend the planet earth from extraterrestrial enemies.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGM5MTEyZDItZWNhOS00NzNkLTgwZTAtNWIzY2IzZmExOWMxXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "actor voicing multiple characters,antihero,cult favorite,friend,old man",
    "name": "Dragon Ball Z",
    "original_info": {
        "id": "Dragon Ball Z: Kid Buu Saga_2002",
        "name": "Dragon Ball Z: Kid Buu Saga",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lucas-42"
        },
        "dateCreated": "2002-04-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0214341/"
        },
        "name": "An Amazing Story...",
        "reviewBody": "I'm a late blooming DBZ fan, but I've already seen almost the entire series! LOL! I will tell you the story of how I became a die-hard fan, and why you'll be VERY sorry if you haven't already!\n\nIt was around the year 1999 that I first came across DBZ. I think the Namek saga was airing on Cartoon Network. My friend was big on the show (though he had very little knowledge of it's origins) and forced me to watch it myself. I made fun of the show every-time he watched it. I thought it was corny, cheesy and the voice-acting was stupid.\n\nHOWEVER, somewhere along the way in the summer of 2001 he told me they were re-airing the Android saga on CN. Well, I started the old usual comments, making fun of it. But then.. I actually became interested in the story. After a few episodes, I was hooked. You see, the story of Dragonball is more than you think. It covers over 500 episodes in it's entire run over three different animated series.\n\nI began watching with the Android/Cell sagas. I watched them to the end and then watched the Frieza saga. Then I watched the Saiyan and Namek Saga. Now here we are today at the Buu saga. What better time to become a DBZ fan than now! The last 54 episodes of the show will air this fall, and that's something NOT to be missed.\n\nThe show never has an ending to a story. It's a continous \"to be continued\" storyline that grows and grows. Characters have time to develop into interesting relationships among them, making moments where someone dies or is hurt even more emotional.\n\nIt tells the story of Goku (son Goku in Japan) who is an incredible man born with an amazing fighting talent. His strength never ceases and he becomes stronger and stronger. He is kind and pure of heart.. a friend to even his enemies at times. He is the central point of DBZ, but not the only point.\n\nThroughout the series, he learns of his Saiyan heritage, finding that he was born of an alien human-like race that has an ability to concentrate energy called Kai (or ki) to create energy blasts, fly, etc. They are born with a natural instinct to fight, and conquer entire planets to sale to the highest bidder.\n\nThat is only the beginning of DBZ, there are 200 episodes or so of a previous series called Dragonball that explain Goku's childhood-into-adult hood. DBZ covers him from his early twenties or so all the way until he's over 50 years old.\n\nThe show has sparked 13 movies and two specials.. and much more. Some of the movies are dubbed in english, while others are only available in Japanese subtitled versions.\n\nANYWAY, this show is specatacular, and takes forever to explain every aspect of the storyline. The ORIGINAL Japanese version has much better music and voice acting, I'll admit. And the English versions (at least early episodes) were edited to death, the show still holds what makes it magic.\n\nThe beginning of the series will re-air on Cartoon Network as of May 2002. I suggest you begin watching. Do NOT let the animation, or the voice-acting, or bad editing of this first saga shake you away. The show takes time to understand and become interested in, but once your there, you'll be hooked.\n\nThere are over 290 episodes of DBZ, and the animation gets much better, as does the storyline. Just keep watching, trust me... your gonna love it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Dragon Ball Z: Season Two",
        "duration": "PT17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4248940313",
        "name": "Dragon Ball Z: Season Two (Blu-Ray)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjg5MzExMGItZDk0NS00ZmI5LTg4YzktYTUzMjY2Zjg1ZjczXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjg5MzExMGItZDk0NS00ZmI5LTg4YzktYTUzMjY2Zjg1ZjczXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2014-12-05T07:22:09Z",
        "url": "https://www.imdb.com/video/vi4248940313/"
    },
    "url": "/title/tt0214341/"
}