{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Biao Yuen",
            "url": "/name/nm0950707/"
        },
        {
            "@type": "Person",
            "name": "Vivian Hsu",
            "url": "/name/nm0398852/"
        },
        {
            "@type": "Person",
            "name": "Kara Wai",
            "url": "/name/nm0401192/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 214,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "alternateName": "Dragon from Shaolin",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058276/"
        },
        {
            "@type": "Person",
            "name": "Biu Cheung Lee",
            "url": "/name/nm1385953/"
        },
        {
            "@type": "Person",
            "name": "Kai-Chung Mak",
            "url": "/name/nm4253075/"
        }
    ],
    "datePublished": "1996-04-17",
    "description": "A youthful Shaolin initiate inadvertenly separated from the rest of gang joins forces with dashing adventurer (Biao) on a request to protect a priceless artifact from his greedy brother.",
    "director": [
        {
            "@type": "Person",
            "name": "Sai Hung Fung",
            "url": "/name/nm0298687/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2NDA4MTc2Ml5BMl5BanBnXkFtZTcwMjI3MDAzMQ@@._V1_.jpg",
    "keywords": "drinking contest,crude humor,kung fu,child martial arts,shaolin kung fu",
    "name": "Long zai Shaolin",
    "original_info": {
        "id": "Dragon from Shaolin_1996",
        "name": "Dragon from Shaolin",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vonvegas"
        },
        "dateCreated": "2000-02-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116135/"
        },
        "name": "An enjoyable movie, with some excellent fight scenes and belly laughs to boot",
        "reviewBody": "Four individuals, drawn together by differing circumstances, become bonded in the quest to return an ancient Buddha head to it's rightful place. We have Yuen Biao (always reminds me of a young Errol Flynn) who has acquired the Buddha head with plans of returning it. We have two young (around 12) kung-fu prodigies. The first from the Shaolin Temple, sent by his master to search for Buddha. The second, an overweight street urchin. And of course, the lady in distress (Vivian Hsu).\n\nThis was a fun movie and one that won't collect dust before it receives a second viewing. The chubby orphan got on my nerves early on, but was the reason for enough laughs to consider adoption by the time closing credits were rolling. It was a treat watching the Little Dragon fight....similar to action in \"My Father is a Hero\".\n\nThe movie contains at least one scene that would never be put in an American film. It takes place after the two youngsters become friends and are attempting to earn money performing for a street audience. I'm sure if this movie was successfully dubbed (not my choice) it would be a favorite amongst the younger set.\n\nYou have to remember this is a HK film and has some minor inconsistencies. The Buddha head is made out of stone, but handled like a piece of Styrofoam. There is a scene where the girl is roughed up earlier in the movie. This fellow shows up later at a completely different local and confronts the girl again. There may have been dozens of other examples, but I missed them as I was enjoying the movie to much to take notice.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0116135/"
}