{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Hildreth",
            "url": "/name/nm0383926/"
        },
        {
            "@type": "Person",
            "name": "Chiara Zanni",
            "url": "/name/nm0953065/"
        },
        {
            "@type": "Person",
            "name": "Mark Oliver",
            "url": "/name/nm3568062/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 300,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0111280/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107376/"
        },
        {
            "@type": "Person",
            "name": "Dennis Foon",
            "url": "/name/nm0285168/"
        }
    ],
    "datePublished": "2004-09-11",
    "description": "Two young rival dragon riding warriors fight to end a 1000 year old war despite the hidden manipulator opposing them.",
    "director": [
        {
            "@type": "Person",
            "name": "Keith Ingham",
            "url": "/name/nm0408818/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Animation",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDQ0MjE4NTAtYTdmYS00MzMyLWE0NjItMGM1MzBjMmQ1ZmU2XkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
    "keywords": "based on toy,cg animation,dragon,warrior,princess",
    "name": "Dragons: Fire & Ice",
    "original_info": {
        "id": "Dragons: Fire and Ice_2004",
        "name": "Dragons: Fire and Ice",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jr-daboss"
        },
        "dateCreated": "2010-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0425960/"
        },
        "name": "Not LotR but still an epic kids movie",
        "reviewBody": "I caught this movie on Cartoon Network one night 6 years ago, when I was 12 years old, and was hooked. I had always been a huge fan of dragons and could not take my eyes off the screen for 5 seconds, even through commercial breaks. Unfortunately I was called away to dinner just as the plot really picked up. I never got to see the movie to the end. So later I found it at blockbuster and purchased it instantly. That was money well spent.\n\nNow, at 18 years old, I still enjoy this movie. The length is good enough to keep a child's attention and still serve the story with good pacing. The animation has a simple, unique 3D cell-shading style. The action scenes were very well animated, and not overly violent. All kids can enjoy a small dose of \"Lord of the Rings\" every now and then. Even though the whole animation looks a bit stiff sometimes it's not that important. I try not to let technical flaws like continuity or stiff motion gte in the way of the actual movie.\n\nThe acting is nothing Oscar-worthy. But at least its better than some other kids movies and TV shows out there with appalling acting (i.e. Care Bears, Nick Jr. shows...). There are some serious moments, but not that serious. There's is a good blend of comedy even during the action.\n\nMark Hildreth (Prince Dev) does a pretty good job of making a strong-hearted, yet impulsive, warrior with a smooth blend of some comic relief to brighten up the mood.\n\nChiara Zanni (Princess Kyra) is pretty much Mark's polar opposite. She has the same desires for peace but she has a more spicy attitude. Both their fathers do there parts well as the old \"wise\" veterans.\n\nMark Oliver (Xenos) plays the dragon ambassador between the two warring kingdoms. He does a good job at being a wise wizard of sorts while keeping certain secrets.\n\nSome say the characters were predictable. Maybe the heroes but not the villain. Considering the audience, I don't think kids would pick up on the villain's hints of evil. As a kid when I say it for the first time I had no idea of the big plot twist in the middle. So for the sake of the plot, the acting is well served.\n\nThe concept of of two \"rebellious teens\" from warring factions seeking peace or unity has always intrigued me. The \"Romeo and Juliet\" style plot is always good to watch. It shows how people must stop looking at petty differences between cultures and unite together to defeat evil. Today that may never happen but I always keep hoping.\n\nOn the whole this is a good movie for kids, a very good movie for dragon fans, and a decent movie for everyone else.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0425960/"
}