{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Masako Nozawa",
            "url": "/name/nm0637586/"
        },
        {
            "@type": "Person",
            "name": "Tôru Furuya",
            "url": "/name/nm0299228/"
        },
        {
            "@type": "Person",
            "name": "Miki Itô",
            "url": "/name/nm0411879/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2550,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Dragon Ball GT: A Hero's Legacy",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050796/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049595/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062107/"
        },
        {
            "@type": "Person",
            "name": "Neil Bligh",
            "url": "/name/nm1038863/"
        },
        {
            "@type": "Person",
            "name": "Takao Koyama",
            "url": "/name/nm0468715/"
        },
        {
            "@type": "Person",
            "name": "Akira Toriyama",
            "url": "/name/nm0868066/"
        }
    ],
    "datePublished": "2004-11-16",
    "description": "Goku Jr. is the great-great-grandson of the legendary warrior Goku, but unlike his predecessor he's not a brave fighter. He's constantly picked on by school bullies--his grandmother Pan sees this and is worried, but even though Go...",
    "director": [
        {
            "@type": "Person",
            "name": "Osamu Kasai",
            "url": "/name/nm0440391/"
        }
    ],
    "duration": "PT1H5M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDgzNGQyNDgtYjViMS00ODRlLThjYmUtZTc2Y2JkOGJmNTljXkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "anime animation,warrior,power up,fight,battle",
    "name": "Dragon Ball GT: Gokû Gaiden! Yûki no Akashi wa Sû-Shin-Chû",
    "original_info": {
        "id": "Dragon Ball GT: A Hero's Legacy_2003",
        "name": "Dragon Ball GT: A Hero's Legacy",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kdosda_Hegen"
        },
        "dateCreated": "2021-04-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0142232/"
        },
        "name": "This some of the most heartwarming and goodness at its purest things I've ever seen.",
        "reviewBody": "This is about the last generation of Dragon Ball characters. Yes, the protagonist is weak and he is supposed to be. It's maybe the 5th generation or so and if you don't know by each generation the purity of saiyan blood drops by 50% and with each generation they become more and more human which means they become weaker and weaker and I'm pretty sure this is the very last generation of still being somewhat Saiyan.\n\nThe point of the film is to show what will the last generation of Saiyans be like and it does its job perfectly. The film isn't about action but about saying the final goodbye to the characters you love. It does stay very faithful to its roots of Dragon Ball (not Dragon Ball Z) and this film mostly feels like an adventure like it used to be back in the days and it's done with such brilliance. The humor is great, the music is fantastic and the action is pretty good too (though as mentioned before there is barely any action here). I admit that the voice acting is terrible, the fact that bear is noticeably voiced by a human is not good and cringe.\n\nBut anyway this film does what it needs to do, it's an extremely emotional and beautiful farewell to Dragon Ball. Also, it must be noted that it ends with the beautiful Zard - Don't You See song, so I think it also works as an unintentional memorial of Izumi Sakai, which also adds even more nice sentimentality to it.\n\nToo bad Dragon Ball GT is considered \"non-canon\" and that crappy cash-grab Dragon Ball Super is...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0142232/"
}