{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        },
        {
            "@type": "Person",
            "name": "Kip Pardue",
            "url": "/name/nm0661164/"
        },
        {
            "@type": "Person",
            "name": "Til Schweiger",
            "url": "/name/nm0001709/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 42014,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043393/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0166202/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018355/"
        },
        {
            "@type": "Person",
            "name": "Jan Skrentny",
            "url": "/name/nm0804847/"
        },
        {
            "@type": "Person",
            "name": "Neal Tabachnick",
            "url": "/name/nm0845844/"
        },
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        }
    ],
    "datePublished": "2001-04-27",
    "description": "A young hot shot driver is in the middle of a championship season and is coming apart at the seams. A former CART champion is called in to give him guidance.",
    "director": [
        {
            "@type": "Person",
            "name": "Renny Harlin",
            "url": "/name/nm0001317/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Action",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA5MDk4NzI0NF5BMl5BanBnXkFtZTYwNjU0Nzc5._V1_.jpg",
    "keywords": "skirt flying,legs,car racing,rookie,german",
    "name": "Driven",
    "original_info": {
        "id": "Driven_2001",
        "name": "Driven",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Victor Field"
        },
        "dateCreated": "2001-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0132245/"
        },
        "name": "Where's that Speed Racer when you need him?",
        "reviewBody": "\"What am I, a piece of wood?\" \"Who cares?\" \"You should talk less and drive more.\" \"This is horrible.\" \"It doesn't mean anything.\" \"Unbelievable.\" \"Will it hold together?\" \"Not for long.\"\n\nAll the above are actual lines from Sylvester Stallone's screenplay for \"Driven,\" as if he was predicting the reception this spiritless racing film would get. To be fair, I hate sports and I fail to see what's so exciting about Formula One, Le Mans or C.A.R.T. (the milieu for Renny Harlin's latest opus) - but I still could and should have gotten some sort of thrill from the race scenes.\n\nInstead you have a mass of clichéd characters and poor acting (Burt Reynolds proves that he can actually sink even lower than shilling for British opticians), though since they have to spout dialogue that reminds you why Stallone hasn't had a writing credit since \"Cliffhanger\" (the last time he got together with Harlin) you can see why they have a hard time with it. Surprisingly, the best actors in this film are the non-professional ones - but some would say there's something seriously wrong with any film where Victoria's Secret/Sports Illustrated stunner Estella Warren and the ESPN announcers give the best performances (just one more reason why I'm looking forward to the \"Planet of the Apes\" remake).\n\nBut that would not be taking into account the bad editing and the ambitious but dreadful digital effects, not to mention the soundtrack (which is as horrible as Estella is gorgeous, and that's pretty damn horrible). It's so sterile it's amazing - even when a driver has a spectacular crash it only seems to have been put in for effect... and not to give away the ending, but don't the three fastest finishers in a race usually ascend the podiums in REVERSE order? (And why do the trucks for the scenes in Germany have \"German Grand Prix\" written on them in English?)\n\nReturning to the subject of hidden messages, the song credits include one called \"Take Me Away From Here.\" Amen - but the last line of the film (\"It doesn't last long.\") has to be a mistake, given that it takes two long hours to tell and runs out of gas before the end of the first lap. You'll get more entertainment from any episode of \"Speed Racer\" or \"Wacky Races\" (come to think of it, Estella would make a pretty good Penelope Pitstop). Heck, even \"Cannonball Run II\" is better than this. And that's a sentence I hope I never have to write again."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi94634265",
        "name": "Driven",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmNkNTg5ZTgtMGZiYi00OWUwLWE1Y2ItMTg2MmE1YzE2ZjU0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmNkNTg5ZTgtMGZiYi00OWUwLWE1Y2ItMTg2MmE1YzE2ZjU0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:57:27Z",
        "url": "https://www.imdb.com/video/vi94634265/"
    },
    "url": "/title/tt0132245/"
}