{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Claudette Colbert",
            "url": "/name/nm0001055/"
        },
        {
            "@type": "Person",
            "name": "Henry Fonda",
            "url": "/name/nm0000020/"
        },
        {
            "@type": "Person",
            "name": "Edna May Oliver",
            "url": "/name/nm0646829/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6478,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Lamar Trotti",
            "url": "/name/nm0873707/"
        },
        {
            "@type": "Person",
            "name": "Sonya Levien",
            "url": "/name/nm0397022/"
        },
        {
            "@type": "Person",
            "name": "Walter D. Edmonds",
            "url": "/name/nm0249526/"
        }
    ],
    "datePublished": "1939-11-10",
    "description": "Newlyweds Gil and Lana Martin try to establish a farm in the Mohawk Valley but are menaced by Indians and Tories as the Revolutionary War begins.",
    "director": [
        {
            "@type": "Person",
            "name": "John Ford",
            "url": "/name/nm0000406/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjljNzUxMWYtMzJmMy00NmRkLWEyMTQtZjVjYzAwZDAyYWZkXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "colonial america,fort,native american attack,based on novel,musket",
    "name": "Drums Along the Mohawk",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gregcouture"
        },
        "dateCreated": "2003-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0031252/"
        },
        "name": "Three-strip Technicolor in all its glory!",
        "reviewBody": "Other comments on this film quite well echo my sentiments: John Ford once again exhibits his mastery of the medium, with a minimum of the sentimentality to which he sometimes succumbed; a very young and handsome Henry Fonda wonderfully embodies an ordinary man virtually forced to perform feats of extraordinary heroism; Claudette Colbert, although she seems out of her usually sophisticated element, really cannot be faulted, especially when one considers the Hollywoodized glamor of her makeup and costuming; and Edna May Oliver, heading Ford's customarily astutely chosen supporting cast, almost steals the picture.\n\nBut, to my eyes, it is the unusually beautiful Technicolor cinematography by Bert Glennon and Ray Rennahan (the latter being the credited cinematographer on the first feature-length film in three-strip Technicolor, 1935's \"Becky Sharp\") who deserve the most accolades. Their work simply glows and has that special crispness characteristic of certain early Technicolor films (many of which bore the Twentieth Century Fox label, as it happens.) No doubt, working on outdoor locations with the cumbersome equipment and lighting requirements involved in the use of the Technicolor process at that time, not to mention the lengendarily dictatorial control of the Technicolor Corporation's czarina, Madame (Natalie) Kalmus, and her frequent associate, Henri Jaffa, Messrs. Glennon and Rennahan managed to accomplish one of 1939's finest achievements in color cinematography. With Alfred Newman's fine musical score and all of the other first-class production values lavished on this stirring tale, \"Drums Along the Mohawk\" deserves a place among the best recreations of those remarkable personal stories that were part of this newly emerging nation.\n\nI am not aware if the available VHS tape transfer does justice to the prints struck from the original negative, but American Movie Classics occasionally shows this title (mercilessly chopped up with endless commercials, etc., as is now their wont) in a version that makes one realize why the invention of color television broadcasting just had to happen!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Page turning trailer for this black and white western",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3478979097",
        "name": "Drums Along The Mohawk",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTQ1MDAwZjUtMTY0Ny00MjkwLWE4ZWItMjAwYmJhMjdhNjNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTQ1MDAwZjUtMTY0Ny00MjkwLWE4ZWItMjAwYmJhMjdhNjNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-09T12:07:54Z",
        "url": "https://www.imdb.com/video/vi3478979097/"
    },
    "url": "/title/tt0031252/"
}