{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Andrew",
            "url": "/name/nm1829365/"
        },
        {
            "@type": "Person",
            "name": "Simon Andrew",
            "url": "/name/nm1828886/"
        },
        {
            "@type": "Person",
            "name": "Sam Bandah Jr.",
            "url": "/name/nm1832187/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0183139/"
        },
        {
            "@type": "Person",
            "name": "Paul Fuller",
            "url": "/name/nm1829347/"
        }
    ],
    "description": "A lonely man responds to magazine advert offering friendship and recieves an unexpected delivery",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Fuller",
            "url": "/name/nm1829347/"
        }
    ],
    "duration": "PT8M",
    "genre": [
        "Short",
        "Horror"
    ],
    "name": "Dummy",
    "original_info": {
        "id": "Dummy_2003",
        "name": "Dummy",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aaron1375"
        },
        "dateCreated": "2010-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0445005/"
        },
        "name": "Not sure if I like this or not. I am sure that if I wanted a doll it would be a hot gal and not a creepy masked person.",
        "reviewBody": "Overall, I just have to say I did not care for it much. I do not know, it had moments when I thought it was rather creepy, just overall I did not know what the film was going for. The film has a man who is apparently lonely, and he sees an ad in the paper for a best friend that he can get on a trial basis. Well said friend arrives in the form of a life size dummy, more of a mannequin really with a creepy white mask. Well this guy brings it into his home and you see strange things here and there, however, I never got the gist of it, I would say it was cause I could not hear it as there was a very loud thunderstorm going on while I was watching it, but I do not believe there was any dialog of note in the entire movie. It has a nice look to it though and there were a couple of nice scenes and ideas, just overall I did not get what this short was trying to convey. That is the problem with watching horror shorts, they either work or they do not, they are generally hit and miss and I am afraid that for me anyway this one missed the mark. However, it is short and the full movie is here at the site so I suggest watching and making up your own mind.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0445005/"
}