{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "William Hurt",
            "url": "/name/nm0000458/"
        },
        {
            "@type": "Person",
            "name": "Alec Newman",
            "url": "/name/nm0627995/"
        },
        {
            "@type": "Person",
            "name": "Giancarlo Giannini",
            "url": "/name/nm0316284/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23313,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0382790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024204/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010962/"
        }
    ],
    "datePublished": "2000-12-03",
    "description": "A three-part miniseries on politics, betrayal, lust, greed and the coming of a Messiah. Based on Frank Herbert's classic science fiction novel.",
    "genre": [
        "Adventure",
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU4MjMyMTkxN15BMl5BanBnXkFtZTYwODA5OTU5._V1_.jpg",
    "keywords": "spice,desert planet,dune,giant worm,planetary romance",
    "name": "Dune",
    "original_info": {
        "id": "Dune_2000",
        "name": "Dune",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pianotm-58404"
        },
        "dateCreated": "2019-09-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0142032/"
        },
        "name": "So far this is the...most thorough film version of Dune",
        "reviewBody": "Jon Harrison's version of Dune isn't exactly what you'd expect from a SciFi TV Miniseries...but it's a SciFi TV Miniseries. Much like British Masterpiece Theater, you'd swear they got actors out of college trying to fill a work quota. The acting is Shakespeare in the Park levels of bland with all the pageantry of a repertory theater. William Hurt doesn't help considering his acting has always been bland. He even looks bored in the Marvel movies. There clearly isn't a single frame of this filmed outside, and every single desert scene looks green-screened. The costume design literally makes this look like a college project. No effort is made to produce makeup effects. On the plus side, they used actual contact lenses instead of roto-scoping for the Melange infused eyes. It wasn't the best way to do it since the camera has trouble seeing it in bright light, but it's a far superior way to do it than the other version of Dune did. So, points for that decision! That is a SciFi/SyFy TV mini-series, which means we can forgive most this. It's not as bad as most SciFi/SyFy TV productions. I've seen worse acting worst productions, so let's get into why I rated this at 7 out of 10 instead of 3 (which the acting absolutely deserves).\n\nFirst, let me get the good things about the acting out of the way. For all of my riding on how rehearsed and bland the acting sounds, they aren't actually bad, and we do get to see who the better actors are, like Julie Cox's Irulan, who was absolutely a stand out performance. Giancarlo Giannini was thoroughly convincing as the Padishaw-Emperor Shadam IV. In fact, I get the feeling that all of the scenes with Irulan's education and trying to solve the mystery of Muad'dib (which absolutely were not in any version of the book) were only added so that we could see more of Julie Cox's performance. It was a good choice. Giancarlo's Emperor gets a few extra scenes out of this, too, though not as many as Cox. These two are definitely a bright point in this production. Barbara Kordetova's Chani also stands out, but this might not be a good thing as she consistently outstages Alec Newman's Paul Atreides/Muad'dib. A lot of people will point to Ian McNiece's Baron Harkonnen, but I don't see it. While he's definitely chewing the scenery, if nothing else, I actually get the strongest rep theater, low-rent vibe from his performance. It doesn't help that he actually frequently breaks the fourth wall and talks directly to the audience repeatedly. I know that's the director's fault and that it's done for theatrical effect, but it does nothing to improve my view of the acting in this production. Miroslav Taborsky's Fenring was...an interesting performance. I don't know if it could be called good, but it definitely was memorable. He also appears in most of the extra scenes with Irulan, but I didn't find his performance particularly likable. He used a strange set of vocal ticks and hand motions for his performance that I suspect was intended to indicate that there is an inherent strangeness to the character (if you've read the books, you can probably see what he was trying to do), but I really don't think it worked. I think if he had a bit more time to perfect this performance it might have been something very special. Unfortunately, it just doesn't land.\n\nNow, onto set design. I've already mentioned that this movie has had the greenscreened out of it, and not very well. Regardless, there is nothing you can say bad about the design. The cities, interiors, and designs: if any money went into this production, this is where it went. Every detail is attended to and real work went into the design. For once, a SciFi production doesn't look like the room's been mostly made out of cardboard. You can actually believe the buildings and the city (and this only gets better in Children of Dune). I feel like with a little more budget and time behind it, this production could have been great.\n\nScript and story are fantastic. For all of this production's flaws, it's extremely immersive. True to the book? Absolutely, but it has a lot of material that isn't found in the book, and I think they could have actually replaced that material with greater depth from the book. It speaks to the quality of the extra material that I don't think they were wrong to do this. I loved every single Irulan scene, which is what the bulk of this additional story was. Don't forget that Jodorowsky's Dune would have been 14 hours. We don't actually need anything extra. Still, I'm glad for it. Julie Cox was a bright light in a sea of bland acting. The story delves far more deeply into the book than the Lynch version did, looking at the deeper nuances of Paul's transformation, and doing one very important thing that Lynch's version failed to do: blurring the moral line for the protagonist. Is Muad'dib the hero or the villain, or something inbetween? Can heroes and villains even really exist and is everyone something inbetween; not wholly good, but not wholly evil? That was the crux of the book, and this production jumps into that with both feet. Where this production fails in the technical aspect, it more than makes up for in story telling, and even a portion of the technical aspect is well done.\n\nOverall, of the things that are SciFi/SyFy Channel production quality series and films, this definitely ranks in the top tier. Absolutely worth your time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "special ed. dvd",
        "duration": "PT2M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2869933081",
        "name": "Frank Herbert's Dune",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGJjNGNmMDktMmQwZC00M2QxLThkYTgtMjZhY2ZiNzllODFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGJjNGNmMDktMmQwZC00M2QxLThkYTgtMjZhY2ZiNzllODFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-06-03T21:22:32Z",
        "url": "https://www.imdb.com/video/vi2869933081/"
    },
    "url": "/title/tt0142032/"
}