{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joseph Fiennes",
            "url": "/name/nm0001212/"
        },
        {
            "@type": "Person",
            "name": "David Wenham",
            "url": "/name/nm0920992/"
        },
        {
            "@type": "Person",
            "name": "Adrian Lester",
            "url": "/name/nm0504412/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2352,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014821/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019383/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103727/"
        },
        {
            "@type": "Person",
            "name": "Milcho Manchevski",
            "url": "/name/nm0541391/"
        }
    ],
    "datePublished": "2002-04-05",
    "description": "A New York thief, a tough-as-nails hundred-year-old woman, two brothers from the Wild West, a Macedonian revolutionary and a beautiful pregnant woman, all cross paths in a tale that spans two continents and three centuries.",
    "director": [
        {
            "@type": "Person",
            "name": "Milcho Manchevski",
            "url": "/name/nm0541391/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Drama",
        "Romance",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmNmZTlmOGQtMTNjYy00MDRkLTg5NDktODllNDczMDQ5YjI1XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "black and white scene,watching tv,skinny dipping,barefoot woman,cattle rustler",
    "name": "Dust",
    "original_info": {
        "id": "Dust_2001",
        "name": "Dust",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dazzerse13"
        },
        "dateCreated": "2004-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0243232/"
        },
        "name": "A film with more good ideas than most",
        "reviewBody": "It's unusual a film will have as many good ideas as this and so many striking ideas and images and still not be a success. Perhaps it's because there are simply too many striking visuals and set-pieces - other directors would have built whole films around just one or two of the concepts contained here - for one film to cope with all of them. Essentially, the story is of a burglar (Lester) who breaks into a house of an old woman (Murphy) in New York and she tells him the story of American cowboys (Fiennes and Wenham) in the Ottoman Empire in Macedonia and their tangled fraternal love/hatred when confronted with a beautiful woman. It's a story that dips in and out of narrative timelines. Sometimes it's New York and sometimes it's the Old west and sometimes it's old Macedonia - and sometimes it's bits of all of them. And sometimes it's just fantasy. Reality, illusion, truth and cinematic deception are all part of the mix. Director Machevski is not here to give the viewer an easy ride. He is an intelligent man and he expects intelligence of his viewers. However, in return he offers some beautiful images that pay homage to spaghetti westerns while adding a sly twist of knowing humour. It's violent, but there's a blackly funny element to it that's closer to life than the comic-book stock-in-trade of such directors as Tarantino (and rightly so, Macedonians have seen more real-life warfare than most Hollywood filmmakers).And despite this, it's a movie that's life-affirming (not in the easy way - you really have to like life to have it affirmed here). The performances are variable. Wenham and Fiennes have both done better in the past and you have to hope they'll do better in the future. But in Lester and Murphy, there are two actors who are in full command of the camera. There's not an emotion you'll feel that they haven't carefully worked to create. Simply beautiful work. With a greater distribution, this is would have built a considerable cult following. Not easy-going, pop-corn-chomping stuff, but highly recommended."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3517691417",
        "name": "Dust",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjE5NzAyMDczNV5BMl5BanBnXkFtZTgwNjk4MDQwMDI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjE5NzAyMDczNV5BMl5BanBnXkFtZTgwNjk4MDQwMDI@._V1_.jpg",
        "uploadDate": "2016-09-15T22:46:25Z",
        "url": "https://www.imdb.com/video/vi3517691417/"
    },
    "url": "/title/tt0243232/"
}