{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Shawn Ashmore",
            "url": "/name/nm0039162/"
        },
        {
            "@type": "Person",
            "name": "Kristin Kreuk",
            "url": "/name/nm0471036/"
        },
        {
            "@type": "Person",
            "name": "Isabella Rossellini",
            "url": "/name/nm0000618/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6324,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024368/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0087778/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069955/"
        }
    ],
    "datePublished": "2004-12-13",
    "description": "A reckless youth is destined to become the greatest sorcerer that the mystical land of Earthsea has ever known. When the young wizard Ged discovers that he possesses infinite magical powers, he seeks to master the ancient arts. As...",
    "genre": [
        "Fantasy",
        "Drama",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk0MjY2NTEyMV5BMl5BanBnXkFtZTcwMDMzMzcyMQ@@._V1_.jpg",
    "keywords": "magic,demon,demonic possession,apprentice mage,master apprentice relationship",
    "name": "Earthsea",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dilbertsuperman"
        },
        "dateCreated": "2009-09-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0407384/"
        },
        "name": "Generally boring yet watchable.Made-For-Television garbage.",
        "reviewBody": "This has your typical made-for-television quasi-medieval fantasy realm crap where swordfights never draw blood and the stunts are generally CGI or very simple run-of-the-mill boring stuff. This is a good kids movie but for adults it's just to inane, boring and bland to really stand out as anything worth watching. This is basically a director trying to jump on board the Harry Potter craze using a Television Show Movie budget.. you see the usual television quality CGI effects, a derivative script and bland actors and actresses who have no idea who their character is. The only acting that occurs in this movie is two people- the Head Magus and the Head Nun of the order that watches the unnamed ones. Other than that it's a bunch of drug addicts that just woke up blandly reading their lines and assuming their costume will make up for them not working very hard at the job of suspending disbelief. Isabella Rosellini has been taking more matronly looking roles these days, but she is still a classic beauty of the sort that drove artists insane during the renaissance- the movie is worth watching just to see her. If you want to see this legendary woman in a real movie- watch BLUE VELVET- a very harsh and brutal flick when she was at the height of her epic beauty- she burns into the screen like a fever vision in that one! In this movie she is pudgy, pasty, yet you can still tell she's completely gorgeous beneath it, a very good casting choice for her role as the head nun.\n\nAs far as suspending disbelief... There's a lot to disbelieve in this movie- like.. disbelieve you should watch it!! \n\nPLOT: The son of a blacksmith's mother died when he was a child- he was raised by his father, a blacksmith, and an old witch that his mother saved from the sea long ago- as such he has magical powers- powers that he wants to develop so off he goes to hogwartz.. oh wait this isn't harry potter- but it sort of IS!! The rip-offs are many but the movie is saved a little bit by several good looking women to watch and a little bit of bearable CGI effects.. sometimes this movie is OK, but then the direction comes back in and ruins it completely- making it a bland, boring affair lacking in imagination and budget to convey a story worth telling in a format worth seeing.\n\nIf you want to see what this movie was shooting for I think you would watch a Harry Potter movie followed by Willow followed by Dungeons and Dragons(which was terrible).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0407384/"
}