{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Scorsese",
            "url": "/name/nm0000217/"
        },
        {
            "@type": "Person",
            "name": "Dennis Hopper",
            "url": "/name/nm0000454/"
        },
        {
            "@type": "Person",
            "name": "Peter Bogdanovich",
            "url": "/name/nm0000953/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3015,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0114980/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136221/"
        },
        {
            "@type": "Person",
            "name": "Peter Biskind",
            "url": "/name/nm0084247/"
        },
        {
            "@type": "Person",
            "name": "Kenneth Bowser",
            "url": "/name/nm0101461/"
        }
    ],
    "datePublished": "2003-03-09",
    "description": "A look at 1970s Hollywood when it was known as New Hollywood, and the director was the star of the movie.",
    "director": [
        {
            "@type": "Person",
            "name": "Kenneth Bowser",
            "url": "/name/nm0101461/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMyNDI0MjU2OV5BMl5BanBnXkFtZTcwMTY1NDUyMQ@@._V1_.jpg",
    "keywords": "1970s,hollywood,producer,interview,filmmaker",
    "name": "Easy Riders, Raging Bulls: How the Sex, Drugs and Rock 'N' Roll Generation Saved Hollywood",
    "original_info": {
        "id": "Easy Riders_2003",
        "name": "Easy Riders",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmOtaku"
        },
        "dateCreated": "2003-05-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0359203/"
        },
        "name": "Good, broad study of the revolution of films from the '60s-'70s",
        "reviewBody": "I ran across the documentary by accident, and am really glad that I did - having been a slave to film study for the last 17 years of my life, I have read about, viewed documentaries involving, and seen the films of most of the filmmakers profiled in Easy Riders, Raging Bulls so I figured it would make for good background noise while I tended to some writing. What surprised me was that I had to postpone my work because I was literally riveted with this film.\n\nEasy Riders, Raging Bulls chronicles the new wave of filmmakers who revolutionized Hollywood in the late 60's and 70's. While a lot of the stories are relatively well known (the foreign film influence, the problems with the filming of Jaws, the raising of the bar in terms of the box office gross) the candid commentary from the directors, producers, writers and actors that were involved was extremely enlightening and brutally honest. One story that sticks in my mind in particular is the telling by various people of the \"Malibu Beach Group\" that included Scorsese, Keitel, Spielberg and Paul Schrader among others gathering to party and discuss and debate film. Being a complete film geek, when friends and I get into philosophical discussions about where we would go if we could travel back in time to any moment, my answer has always been to be a production assistant on the set of Citizen Kane. After hearing this story in the documentary, transporting myself back to that scene is a close second. Supplementing these interviews were excellent behind-the-scenes footage that I had never seen of the filmmakers at work, which was absolutely fascinating.\n\n While the documentary skips around according to genre, and not necessarily profiling a single filmmaker at a time, the range of directors presented is admirably wide. The obligatory (and famous) Coppola, Scorsese, Bogdanovch, Lucas and Spielberg are profiled with equal air time as directors who are not household names, like Sam Peckinpah, Arthur Penn and Hal Ashby. This is definitely a great documentary to catch if you want to get some ideas for films that you should watch but don't know are out there, as well as see some of the diverse portfolios the more \"commercial\" directors have in their pasts.\n\n--Shelly",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2292449561",
        "name": "Easy Riders, Raging Bulls",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTNhZWRmZDAtMTM1Yy00YzY5LWFkZjEtNDU1ZTY1NThkYTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTNhZWRmZDAtMTM1Yy00YzY5LWFkZjEtNDU1ZTY1NThkYTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:58:48Z",
        "url": "https://www.imdb.com/video/vi2292449561/"
    },
    "url": "/title/tt0359203/"
}