{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sihung Lung",
            "url": "/name/nm0485950/"
        },
        {
            "@type": "Person",
            "name": "Kuei-Mei Yang",
            "url": "/name/nm0945992/"
        },
        {
            "@type": "Person",
            "name": "Yu-Wen Wang",
            "url": "/name/nm0911096/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21949,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "Eat Drink Man Woman",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0034481/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057606/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007554/"
        },
        {
            "@type": "Person",
            "name": "Ang Lee",
            "url": "/name/nm0000487/"
        },
        {
            "@type": "Person",
            "name": "James Schamus",
            "url": "/name/nm0770005/"
        },
        {
            "@type": "Person",
            "name": "Hui-Ling Wang",
            "url": "/name/nm0910924/"
        }
    ],
    "datePublished": "1994-08-03",
    "description": "A senior chef lives with his three grown daughters; the middle one finds her future plans affected by unexpected events and the life changes of the other household members.",
    "director": [
        {
            "@type": "Person",
            "name": "Ang Lee",
            "url": "/name/nm0000487/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGEyNDI0OGQtMjY3Yi00NGU5LWFiNTQtNWMyZmJmNDAzMDMwXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "chef,chinese food,cooking,food,family relationships",
    "name": "Yin shi nan nu",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2001-04-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111797/"
        },
        "name": "Ang Lee Sets The Table Of Life",
        "reviewBody": "A veritable smorgasbord of all the things that make life worthwhile, including good friendship, love, food and sex, can be found in Ang Lee's `Eat, Drink, Man, Woman,' the story of a widower who has raised three daughters on his own, and now that they are grown is ready to move on with his life. Chu (Sihung Lung), a celebrated chef who runs the kitchen of a huge restaurant, finds himself at an impasse however; his daughters, Jia-Jen (Kuei-Mei Yang), the eldest, a teacher, Jia-Chen (Chien-lien Wu), his second, an airline executive, and Jia-Ning (Yu-Wen Wang), the youngest, who works at a fast food restaurant, all still live with their father, and though they are adults (all in their twenties), he feels responsible for them, as they are still under his roof. They, on the other hand, feel responsible for him; he'll soon be retired, and they fear age is catching up with him. And it makes them each, in turn, think twice about career opportunities and any romantic entanglements that may appear on the horizon. it's a situation they all realize is not conducive to a happy, fulfilling and fully functional family life; the love is there, but it's seasoned with frustration, and no one seems to know what to do about it.\n\n\tLee has crafted and delivered a complex, involving film, laced with poignancy and humor that deals with the kinds of problems most people face during the course of their lives. And, of course, there's the love, the many faces of which are all explored here. Food is the metaphor; Chu sets his table with a variety of tantalizing and exotic offerings, even as the table of life is set with like fare, and once set, it is up to the individual to sample what they will. Fittingly, it is at the dinner table that many of the meaningful events in the lives of the family members are revealed. Working from a screenplay written by Lee, James Schamus and Hui-Ling Wang, Lee uses the intricate emotional weave of the story to optimum effect with his ability to illuminate the sensibilities of his characters, and that he does it so well demonstrates the depth of his own insight into human nature. And that he can so proficiently transfer the emotions of the written page to the screen demonstrates his mastery of the art of film directing. As he proves with this film (as with films like `The Ice Storm' and `Crouching Tiger, Hidden Dragon'), he is simply one of the best directors in the business.\n\n\tLee's unique touch is also felt in the performances he exacts from his actors, a number of which are outstanding in this film, beginning with Lung, who brings Chu so credibly to life. Wang, Wu and Yang are also exemplary in their portrayals of Chu's daughters. To their credit-- as well as Lee's-- there's not a false moment to be found in their performances, all of which stand up to even the closest scrutiny. These are all very real people in a very real setting, which enables the audience to identify and relate to the characters and their story, assuring that connection which makes this film such a satisfying experience.\n\n\t\tThe supporting cast includes Sylvia Chang (Jin-Rong), Winston Chao (Li Kai), Chao-jung Chen (Guo Lun), Lester Chit-Man Chan (Raymond), Yu Chen (Rachel), Jui Wang (Old Wen) and Ah Lei Gua (Madame Ling). As with real life, `Eat, Drink, Man, Woman' is far from predictable, and is filled with twists and turns, including a surprise at the end that equals anything M. Night Shyamalan could come up with. In the final analysis, this film is a delightful, entertaining reflection upon the human condition that will awaken your taste buds and prepare you for the feast of life. And, like life, it is there for the taking; grab it with both hands and embrace it. By the end, you'll be glad you did. I rate this one 10/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Eat Drink Man Woman: Master Chu Is Here!",
        "duration": "PT3M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi253412633",
        "name": "Eat Drink Man Woman: Master Chu Is Here!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2ZlNDEwNDQtMGUxZS00MjlhLWI4MDAtYzg3M2QxMDdhNmIyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2ZlNDEwNDQtMGUxZS00MjlhLWI4MDAtYzg3M2QxMDdhNmIyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-02-02T19:08:39.212Z",
        "url": "https://www.imdb.com/video/vi253412633/"
    },
    "url": "/title/tt0111797/"
}