{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve Railsback",
            "url": "/name/nm0706883/"
        },
        {
            "@type": "Person",
            "name": "Carrie Snodgress",
            "url": "/name/nm0811202/"
        },
        {
            "@type": "Person",
            "name": "Carol Mansell",
            "url": "/name/nm0543738/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5482,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "alternateName": "Ed Gein",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103422/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038037/"
        },
        {
            "@type": "Person",
            "name": "Stephen Johnston",
            "url": "/name/nm0426848/"
        }
    ],
    "datePublished": "2001-07-20",
    "description": "The story of Ed Gein, who dug up the corpses of over a dozen women and made things out of their remains before finally shooting two people to death and butchering their bodies like beef sides.",
    "director": [
        {
            "@type": "Person",
            "name": "Chuck Parello",
            "url": "/name/nm0661257/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkzOTAyNTA2MV5BMl5BanBnXkFtZTcwMDc1ODAzMQ@@._V1_.jpg",
    "keywords": "human skin mask,true crime,docudrama drama,shooting,arrest",
    "name": "In the Light of the Moon",
    "original_info": {
        "id": "Ed Gein_2000",
        "name": "Ed Gein",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "myboigie"
        },
        "dateCreated": "2005-08-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0230169/"
        },
        "name": "ED GEIN: A Woman in a Man's Body",
        "reviewBody": "This movie gets a lot more criticism than it generally deserves. Indeed, it is extremely low-budget, but it basically nails the whole point of Ed Gein better than anyone ever has, or possibly ever will. What seems to disappoint most people is the fact that the film sticks so closely to the story of what happened. The reality is, Ed Gein was not a serial-killer in any respect, and murdered two women who he may have felt resembled his dead-mother. What he is most remembered for, in-reality, are the ghoulish-excavations and \"articulations\" of dead-bodies. \n\nIt's very difficult for us to imagine in 2005 how much of a bombshell Ed Gein was in late-1950s America. In-fact, it's my own humble opinion that we still haven't entirely coped with the knowledge of such aberrant-behavior. Why do people do such things? Sometimes, there are no clear-answers, but the makers of \"Ed Gein\" have shed some much-needed light on what is known about Gein's metamorphosis into a full-blown ghoul. Surprisingly, a great-deal of the psychological subtext of his life has leaked-into films \"based\" on his \"true story.\" Most successful-of-all--naturally--is Hitchcock's \"Psycho,\" but Steve Railsback and Chuck Parello have shown us a very clear scenario into why Ed Gein became the man we know-of today. Gein was basically bisexual and had a strong-desire to BE a woman, like his mother. \n\nAs stated in \"Psycho\" so well, he wanted to \"...become his mother,\" in a sad-attempt to \"bring her back\" to life. His father was a pathetic-drunk, and as is well-known, his mother had a god-like dominance (coupled with religious-fanaticism and sociopathic-attitudes)over the young boy. Ed was also deeply-traumatized by an incident on the family farm where he saw his parents slaughtering a pig--Ed was unable to assist them, and was often called a \"panty-waist\" by his mother. The incident, and a few others, are enacted convincingly by Parello and company, and much of the film takes-place in Gein's head (where it belongs). \n\nThere are a few continuity-errors: the headlights of a car are clearly from the 1990s in one insert-shot, and there are a few moments where the production-design could have been closer to what 1950s America looked-like. But, all-in-all, you have the definitive film on Ed Gein. It's all here, in all its pathetic-glory. This is what happens when someone is neglected by family and society spiritually and medically;this was simply a sick man who needed help. Nobody did until it was too-late. This isn't sexy and exciting to gore-hounds and thrill-seekers who come to a film like this not to learn something, but merely to stimulate their hunger for viscera. Excellent film! How can you lose with ole' Steve Railsback, anyway?\n\nPostscript: It seems possible Mr. Railsback was a target-for-death of Mr. Robert Blake!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from First Look",
        "duration": "PT1M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2913206553",
        "name": "Ed Gein",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmIyNjUxZjUtOGYzYy00ZDQ4LWE2MDItMjMwN2U1YWNjZjUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmIyNjUxZjUtOGYzYy00ZDQ4LWE2MDItMjMwN2U1YWNjZjUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:59:15Z",
        "url": "https://www.imdb.com/video/vi2913206553/"
    },
    "url": "/title/tt0230169/"
}