{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dale Midkiff",
            "url": "/name/nm0001535/"
        },
        {
            "@type": "Person",
            "name": "Joe Pantoliano",
            "url": "/name/nm0001592/"
        },
        {
            "@type": "Person",
            "name": "Paul Johansson",
            "url": "/name/nm0424035/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 228,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032859/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046031/"
        },
        {
            "@type": "Person",
            "name": "Evan Hunter",
            "url": "/name/nm0402805/"
        },
        {
            "@type": "Person",
            "name": "Larry Cohen",
            "url": "/name/nm0169540/"
        }
    ],
    "datePublished": "1996-02-18",
    "description": "Once she'd been a dancer. Now she lies on a sidewalk, her blood seeping into the snow. The detectives of the 87th precinct are learning about ice: in a mulitimillion dollar showbiz scam, in the glittering diamonds that spill out o...",
    "director": [
        {
            "@type": "Person",
            "name": "Bradford May",
            "url": "/name/nm0561879/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzYyMzc1MjQ3MF5BMl5BanBnXkFtZTcwMjkyNDA0MQ@@._V1_.jpg",
    "keywords": "author name in title,police,murder,sequel,based on novel",
    "name": "Ed McBain's 87th Precinct: Ice",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Joseph_Gillis"
        },
        "dateCreated": "2015-12-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116166/"
        },
        "name": "Larry Cohen, Or Ed McBain - Or Maybe A Bit Of Both?",
        "reviewBody": "I haven't read the book, but this little gem immediately made me want to seek it out: being familiar with the work of both men, though, I suspect that I'll eventually find that both can claim significant credit for the success of the film.\n\nIt hasn't set the record for the length of time I'd put a viewing of a DVD bought/film taped on the long finger, but I know I've previously found plenty of excuses for not watching it - TV movie; the previous small-screen 87th Precinct adaptation which had been too much of a Randy Quaid star vehicle, and then there was the no-name director. Pity my eye hadn't previously settled on the scriptwriter's name: in fact, it didn't register until about half-way through and I was ready to admit just how much I was loving it.\n\nThe plot might be standard-construct McBain - albeit still enough to rank it in the upper ranks of policier plots - and there were plenty of stock scenes and characters, and heard-it-all before dialogue, but the devil was in the detail, and particularly the playing of well-drawn support-character roles, such as the killer/drug-dealer, and a delightfully-devilish odd-couple pair of opportunist small-time criminals.\n\nIt starts off as shocking-murder - which might be someway theatre- district connected - then gravitates to apparent standard serial-killer type, before roping in related drug-deals,in a wonderfully-implausible way, by way of typical 87th Precinct sidelined sub-plots. Give credit where credit is due, though, it's actually quite niftily directed, and smartly paced, too, but I strongly suspect that in the way apparently- unconnected scenes are knitted together, and those sub-plots are made to appear all-in-a-night's work by the 87th Precinct crew, genre-movie scriptmeister Cohen is due at least as much credit as director, Bradford May, is.\n\nIn fact, I'd go even farther and say that this little effort compares more than favourably with Johnnie To's glorious policier,PTU, which I reviewed here recently: they'd even look good on a double-bill, together.\n\nNow the question is: can I award a humble TV movie an 8, or will I stick to the safe 7? If the IMDb had a 7.5 rating, it'd be a no-brainer.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0116166/"
}