{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Johnny Depp",
            "url": "/name/nm0000136/"
        },
        {
            "@type": "Person",
            "name": "Martin Landau",
            "url": "/name/nm0001445/"
        },
        {
            "@type": "Person",
            "name": "Sarah Jessica Parker",
            "url": "/name/nm0000572/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 178942,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Person",
            "name": "Rudolph Grey",
            "url": "/name/nm0340674/"
        },
        {
            "@type": "Person",
            "name": "Scott Alexander",
            "url": "/name/nm0018735/"
        },
        {
            "@type": "Person",
            "name": "Larry Karaszewski",
            "url": "/name/nm0438989/"
        }
    ],
    "datePublished": "1994-10-07",
    "description": "Ambitious but troubled movie director Edward D. Wood Jr. tries his best to fulfill his dreams, despite his lack of talent.",
    "director": [
        {
            "@type": "Person",
            "name": "Tim Burton",
            "url": "/name/nm0000318/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTA5ZjdjNWUtZGUwNy00N2RhLWJiZmItYzFhYjU1NmYxNjY4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "film director,misfit,director,based on real person,black comedy",
    "name": "Ed Wood",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pkendell"
        },
        "dateCreated": "1999-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109707/"
        },
        "name": "An Unlikely Masterpiece",
        "reviewBody": "I hear that ED WOOD took just $6,000,000 on its initial cinematic release in the USA. I'm not surprised. The extraordinary thing is that the film was financed and released at all. Had it not been for the prestige that Tim Burton had already earned from his previous projects, ED WOOD would no doubt have foundered long before the cameras began to roll. The result could have been another 1941  but it wasn't. What came out of Tim Burton's fascination with the `Worst Director of All Time' was something very rich and strange  perhaps the most un-Hollywood Hollywood picture of the 90s.\n\nI see two main themes in ED WOOD. The first is the dreadful fear that hovers over everyone who enters the creative arts  `Am I any good?' `Is my work any good?' `How do I know if it's any good?' `What if I think it's good, but everybody else thinks it's rubbish?' Artists use all kinds of strategies to deal with these fears  some become eccentric, others arrogant, others diffident. Without the right to fail, no artist is likely to take the sort of risk that sometimes, just sometimes, leads to great work. Tim Burton knew this.\n\nEdward D Wood Jnr believed himself to be a creative artist. Oh, how he believed. But he still failed to create anything worthwhile. And this leads to what I believe to be the second theme of the movie, and the reason why I think it failed commercially.\n\nLook at all the things Ed did right. He believed in himself. He followed his dream. He worked hard. He was an entrepreneur  he did his best to make others believe in his dream and help him to turn it into reality. In short, he did all the things that the self-help books, the daytime TV shows, the junk ballads and the feel-good movies tell us will give you success. Just wish upon a star, work all the hours there are to turn your vision into reality and you will succeed. Ed did all of these things. And still he failed. He died short of his 60th birthday, living in a crime-riddled apartment building, drunk, broke, supporting himself and his loyal wife Kathy by writing formula pornography and making sex instruction flicks on 8mm.\n\nAmerica doesn't want to hear this. Hollywood doesn't want to tell America this  that you can try and try and try and still get nothing but heartbreak. This is why ED WOOD is such an un-Hollywood film  and why it's one of the best Hollywood films of the 90s."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Touchstone Pictures",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2695102745",
        "name": "Ed Wood",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzRjYTJmY2MtMzBhZi00NzgyLWFjMTQtMmVlOTdjYjg0NzcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzRjYTJmY2MtMzBhZi00NzgyLWFjMTQtMmVlOTdjYjg0NzcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:59:18Z",
        "url": "https://www.imdb.com/video/vi2695102745/"
    },
    "url": "/title/tt0109707/"
}