{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eddie Izzard",
            "url": "/name/nm0412850/"
        },
        {
            "@type": "Person",
            "name": "Mac McDonald",
            "url": "/name/nm0567881/"
        },
        {
            "@type": "Person",
            "name": "Rhona Mitra",
            "url": "/name/nm0593961/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2554,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104871/"
        },
        {
            "@type": "Person",
            "name": "Eddie Izzard",
            "url": "/name/nm0412850/"
        }
    ],
    "description": "Eddie Izzard's routine has a loose trajectory from the beginning of the Old Testament and the creation of the world in seven days to Revelations; God, in the voice of James Mason, makes several appearances. Along the way, Izzard d...",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Richardson",
            "url": "/name/nm0724724/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Documentary",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQzMTc2MjU2MF5BMl5BanBnXkFtZTcwNjc4MjcyMQ@@._V1_.jpg",
    "keywords": "stand up special,computer,reference to the old testament,reference to noah,man in drag",
    "name": "Eddie Izzard: Glorious",
    "original_info": {
        "id": "Eddie Izzard: Glorious_1997",
        "name": "Eddie Izzard: Glorious",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2007-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0195753/"
        },
        "name": "Typically scatological and creative humour from Izzard",
        "reviewBody": "In a typically ambitious show, Eddie Izzard opens with a discussion of the old testament and the creation of the world itself by God as played by James \"The Voice\" Mason. From here he covers the siege of Troy, the new testament, revelations, the construction of the ark, settings on toasters and showers and the noise baboons make when being punched.\n\nEddie Izzard is perhaps an acquired taste  his film career has mostly been successful when he doesn't fly along surreal flights of fancy but his stand-up is where his style really comes though. His subjects are not really anything particularly new but where he takes them is almost always funny. And so it is with this 1997 show that sees him roughly have a structure of the bible and history but does bounce around rather randomly in the way that his material does. Of course having seen one of his live shows after having heard it on a CD from another place first I can confirm that it is as tightly scripted as you can get. In a way this is actually more impressive because Izzard does keep the sense of spontaneity and creativity alive no matter how many times he repeats it.\n\nHis material here is typical. At its weakest I found it amusing if a little silly but at its best it was taking me by surprise and drawing laughs from me so suddenly that I once nearly did that thing that people in films do when they have just been surprised after taking a gulp of water (except mine was noodles  which was as unattractive as it sounds). Of course those that don't like Izzard will not enjoy it for the same reasons as I did, but why then are you watching? Those unfamiliar will find this as good a place to start as any but, if you're not into it after 30 minutes then just give up as it is what it is. To me though it worked really well and it was only a weak ending (where he sort of apologetically closes the show) and the movie spoof at the start (which was a great idea but needed to look more professional to really be funny) that stood out in my mind as being misfires.\n\nOverall then, yet another funny stand-up show from Izzard with all the things that his fans love him for. Of course those that don't find it funny will hate it for the same reason but that to one side, I personally rarely found it less than amusing and comical."
    },
    "url": "/title/tt0195753/"
}