{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matthew McConaughey",
            "url": "/name/nm0000190/"
        },
        {
            "@type": "Person",
            "name": "Jenna Elfman",
            "url": "/name/nm0001184/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey Blake",
            "url": "/name/nm0086553/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 44080,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003687/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Émile Gaudreault",
            "url": "/name/nm0309996/"
        },
        {
            "@type": "Person",
            "name": "Sylvie Bouchard",
            "url": "/name/nm0098943/"
        },
        {
            "@type": "Person",
            "name": "Lowell Ganz",
            "url": "/name/nm0304665/"
        }
    ],
    "datePublished": "1999-03-26",
    "description": "A video store clerk agrees to have his life filmed by a camera crew for a television show.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Howard",
            "url": "/name/nm0000165/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjBhNjc1NjktZTg4OS00YmUyLWI4YjAtNGIxZGM4ZTdkNmZkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "television,fictional reality show,media circus,commercialism,satire",
    "name": "Edtv",
    "original_info": {
        "id": "EDtv_1999",
        "name": "EDtv",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-05-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0131369/"
        },
        "name": "Entertaining but not great",
        "reviewBody": "True TV launch their new concept  Real Life TV, where cameras will follow one person's life 24/7 and put it all unedited on TV. When Ed is dragged into his brother's audition tape he catches the eye of the studio and he becomes the lucky subject of edtv! However when he falls for Ray's girlfriend Shari things get difficult and he finds that his new found fame is not all it cracked up to be.\n\nStepping out of the shadow of The Truman Show came another film about reality TV and the nature of fame. However this has little to do with Truman in terms of content, instead it tries to be more of a comedy and tries to mix a little bit of social comment. The story is essentially a romance but it doesn't convince. It doesn't work simply because the whole idea of looking at fame, reality tv and studios is more interesting (even if it doesn't come off). The film promises much but doesn't fully use it's potential  the comedy is never a funny as you hope, the look at fame and TV is never as clever or as deep as you think.\n\nIt's a shame that it isn't better because the cast is good on paper. McConaughey is still a rising star (although needs a big hit soon). Harrelson is good as he usually is when in support and Elfman is pretty good as Shari. The support cast is great too  Landau is funny, DeGeneres is good, Reiner is funny and wicked while lesser roles are filled out by the likes of Hurley, Dennis Hopper, Clint Howard. Get past these and you have tonnes of little cameos from the likes of Harry Shearer, Michael Moore, Jay Leno and George Plimpton.\n\nOverall this is enjoyable  it's just that you feel that all of it's parts have potential that are never fully realised. It's OK but you can't help feeling that it's a missed opportunity."
    },
    "url": "/title/tt0131369/"
}