{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adam Sandler",
            "url": "/name/nm0001191/"
        },
        {
            "@type": "Person",
            "name": "Rob Schneider",
            "url": "/name/nm0001705/"
        },
        {
            "@type": "Person",
            "name": "Jackie Sandler",
            "url": "/name/nm0864490/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23993,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059609/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045792/"
        },
        {
            "@type": "Person",
            "name": "Brooks Arthur",
            "url": "/name/nm0037738/"
        },
        {
            "@type": "Person",
            "name": "Allen Covert",
            "url": "/name/nm0184445/"
        },
        {
            "@type": "Person",
            "name": "Brad Isaacs",
            "url": "/name/nm0410533/"
        }
    ],
    "datePublished": "2002-11-27",
    "description": "Davey Stone, an alcoholic with a criminal record, is sentenced to community service under the supervision of an elderly referee. Davey is then faced with trying to reform and abandon his bad habits.",
    "director": [
        {
            "@type": "Person",
            "name": "Seth Kearsley",
            "url": "/name/nm0444054/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Animation",
        "Comedy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk1NTU4NjE5OV5BMl5BanBnXkFtZTYwMTQ3OTY2._V1_.jpg",
    "keywords": "loss of parents,destruction of property,fraternal twins,song,brother sister relationship",
    "name": "Eight Crazy Nights",
    "original_info": {
        "id": "Eight Crazy Nights: Bonus Material_2002",
        "name": "Eight Crazy Nights: Bonus Material",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mOVIemAN56"
        },
        "dateCreated": "2005-12-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0271263/"
        },
        "name": "This is a tough one",
        "reviewBody": "Okay a viewer can watch this and see it in one of two lights, not both. Either a person can watch this and say, 'that was the cruelest and most disturbing thing I've ever seen' or the other 'That was kind of weird but portrayed a message.' Okay I know what you are saying, a Sandler film with a point, NO WAY! But no, this movie does have a message of Christmas (or Hanukkah) and works out quite plainly if you pay attention. \n\nThe story goes like this. It's the holidays and Davey (Voiced by Adam Sandler) is a mean-spirited, spiteful young man with a criminal record. His past was perfect until his parents died when he was 13. Now he's back in court and about to be sentenced to jail when a kind-hearted, old man named Whitey (also voiced by Sandler) who offers to the judge to have Davey perform community service as an assistant referee for youth basketball.\n\nDavey thinks he's going to get off easy until Whitey begins to try and reform the young man. Davey does some horrible, and almost unbelievable things to him but Whitey is ever kind and optimistic and even offers Davey a home once his burns down. Slowly Davey begins to change from a troubled young man to a kinder person. But all the while, memories form his troubled past continue to plague him and cause him to be angry. The whole time, the movie keeps you guessing if he'll overcome the anger that built inside of him with the help of Whitey or be engulfed in it.\n\nThe whole film I absolutely hated Sandler's character. He was more than angry, he was deranged and just plain mean to the old man who tries to help him and couldn't help but think 'man this guys horrible.' But after a second viewing I realized the film was trying to do something. The film echoes a cry for being kind and how good triumphs over evil, in the case of the film Whitey overtaking Davey's anger with kindness and changing him. By the end of the movie I had gotten some good laughs from it and really felt better and realized how I should act around the holidays.\n\nPretty much the film juxtaposes the two most opposite characters and shows what kind of affect they'll have on each other. It shows how when a person is kinder, they may not be as popular, but they'll be happy, they'll have friends, and they'll be set for life. This movie isn't a classic in anyway. \n\nThe film has some great laughs, the deer are great throughout the film along with Whitey's brother, Elanor (also voiced by Sandler)and will keep you laughing until the last five minutes. The humor is a bit crude in some of the scenes and some of the antics Davey performs are cruel and terrible. But in the end , the film shows how a person should be during the holidays, how kindness is always the better choice, and how the past shouldn't haunt a person.\n\nEight Crazy Nights. Starring the voices of: Adam Sandler, Jackie Titone, Austin Stout, and Rob Schneider.\n\n3 1/2 out of 5 Stars.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi968163609",
        "name": "Adam Sandler's Eight Crazy Nights",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTZmYjE5M2EtNzkxMi00NjI1LTkyNDYtNDBkZTRmMzVmOWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTZmYjE5M2EtNzkxMi00NjI1LTkyNDYtNDBkZTRmMzVmOWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T09:15:39Z",
        "url": "https://www.imdb.com/video/vi968163609/"
    },
    "url": "/title/tt0271263/"
}