{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        },
        {
            "@type": "Person",
            "name": "Sophia Loren",
            "url": "/name/nm0000047/"
        },
        {
            "@type": "Person",
            "name": "Raf Vallone",
            "url": "/name/nm0885203/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14885,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136673/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021927/"
        },
        {
            "@type": "Person",
            "name": "Fredric M. Frank",
            "url": "/name/nm0290931/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        },
        {
            "@type": "Person",
            "name": "Ben Barzman",
            "url": "/name/nm0059553/"
        }
    ],
    "datePublished": "1961-12-14",
    "description": "The fabled Spanish hero Rodrigo Diaz de Vivar (a.k.a. El Cid) overcomes a family vendetta and court intrigue to defend Christian Spain against the Moors.",
    "director": [
        {
            "@type": "Person",
            "name": "Anthony Mann",
            "url": "/name/nm0542649/"
        }
    ],
    "duration": "PT3H2M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGY3N2E3NzYtMjgzMi00ZjA4LTg3YzUtN2ZiYjI1MGI2MWI2XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "spanish history,11th century,reconquista,duel,king of spain",
    "name": "El Cid",
    "original_info": {
        "id": "El Cid_1961",
        "name": "El Cid",
        "year": "1961"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Rueiro"
        },
        "dateCreated": "2012-12-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054847/"
        },
        "name": "Excellent epic",
        "reviewBody": "This is one of the best epic super-productions of all time, with a beautiful cinematography, a majestic score and a solid and dynamic direction. \n\nStill many people have put it down as a folly with no real depth or substance, and others for its historical inaccuracy. Yes, it is not one hundred per cent historically accurate, but then, how much do we really know about an 11th century warrior when very few written documents of the era survive today? We only have a few of the old cantigas (poems to be sung) and the Poema de Mio Cid at the Spanish national archives. \n\nMany Spaniards tend to put this great film down only because it was made by a bunch of American and Italian \"philistines\" with no knowledge of the legend at all but for the only purpose of creating an epic to rival with \"Ben-Hur\" and \"Spartacus\". That is a childish way to see it. \n\nAt least we should be grateful that someone came up and took the challenge of making such a film in the first place. That man was Samuel Bronston. \n\nThis self-made movie mogul not only had the confidence and charm to persuade other people to lend him huge sums of money but he also got Franco's ultra-Catholic fascist regime to approve the making of a film about their national hero where the main character was to be played by a foreigner who was also a Protestant. Of course, Bronston succeeded easily through bribery in a corrupt country, as well as through the willingness of Franco to allow American business to settle in Spain and help revive its obsolete economy. Franco would use \"El Cid\" to promote Spain around the world as a touristic destination during the Sixties. \n\nBronston wanted to make an unique epic, a high quality production with sheer spectacle and credited with some historical veracity. So he hired the best people he could think of: cinematographer Robert Krasker, who used the radical and innovative Technirama70 format that magnified the endless open spaces of the Spanish plateaus, Miklos Rozsa for the score -his last great triumph, which should have won him another Oscar- and Anthony Mann, who had cut his teeth making Westerns with James Stewart. Finally, as technical adviser Bronston hired the illustrious Spanish scholar Ramon Menendez Pidal, the greatest living authority on El Cid at that time. Don Ramon was also of great assistance to Rozsa during the composer's careful and thorough research on Spanish medieval music. Rozsa visited the libraries and archives of old monasteries and was given special access to documents dating back to the 13th and 14th centuries. Not many film composers would have gone through such painstaking research work, but Rozsa was a perfectionist and probably the greatest composer of all. \n\nWhen we think of the leading male stars in Hollywood at that time, Heston had become world famous and highly bankable after the huge success of \"Ben-Hur\" and the Oscar it won him. So he was the ideal man for the role. \n\nBronston wanted Loren because of her fast-growing popularity, as well as by the the fact that hiring her would please the Italian investors and that would mean more money into the budget. Then enter the British, and what a fine supporting cast they are: the smoky-voiced Genevieve Page as Urraca(it is the Spanish word for jackdaw, by the way) who always reminds me of Lauren Bacall; the gentlemanly and self-composed Michael Hordern as Rodrigo's father, the handsome blue-eyed John Fraser as the arrogant but vulnerable prince Alfonso, Gary Raymond as prince Sancho, Douglas Wilmer as Rodrigo's Arab ally, and finally the recently deceased, excellent Czeck-born character actor Herbert Lom as the black-clad villain, a role initially offered to Orson Welles and who turned it down when he learnt that audiences wouldn't see his masked face. The great Orson needed the money very much to finance his own projects, but sometimes his ego was bigger than him. \n\n\"El Cid\" was a huge box-office hit all around the world and made Bronston a very rich man. The profits of the film were used to start preparing \"The Fall of the Roman Empire\", but then the refusal of Heston to work again with Loren -they detested each other- set in motion the snowball that would sweep the Bronston empire. Although three more epics were made: the exotic and spectacular \"55 Days at Peking\", the splendid but failed \"The Fall of the Roman Empire\" that bankrupted Bronston, and the minor and much cheaper \"The Magnificent Showman\", which was his swansong, he never again reached the heights of greatness and success he had reached with \"El Cid\". \n\nAnd then think that the tournaments and battles you see here were staged for real, with real armours, swords, catapults and everything, and thousands of people taking part -entire companies of the Spanish army and entire villages of civilians were hired as extras. Today you will never get that in a film: too costly and too complicate to coordinate. And of course, all of the Health and Safety rubbish laws that there are nowadays... If you play knights of the Round Table you can cut yourself, mind you. So enter CGI.\n\nBut at least we have \"El Cid\" in all its glory. \n\nAnd please, let them not make a remake! Let them not destroy the old magic and beauty of cinema.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi454868505",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDBjYjg4MGUtMjU3Mi00MWI1LTkwMTMtNDAwNTcyYTQ0YmM3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDBjYjg4MGUtMjU3Mi00MWI1LTkwMTMtNDAwNTcyYTQ0YmM3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-01T11:07:48.491Z",
        "url": "https://www.imdb.com/video/vi454868505/"
    },
    "url": "/title/tt0054847/"
}