{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cate Blanchett",
            "url": "/name/nm0000949/"
        },
        {
            "@type": "Person",
            "name": "Liz Giles",
            "url": "/name/nm0318884/"
        },
        {
            "@type": "Person",
            "name": "Rod Culbertson",
            "url": "/name/nm0191358/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 101559,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106129/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057311/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Person",
            "name": "Michael Hirst",
            "url": "/name/nm0386694/"
        }
    ],
    "datePublished": "1999-02-19",
    "description": "The early years of the reign of Elizabeth I of England and her difficult task of learning what is necessary to be a monarch.",
    "director": [
        {
            "@type": "Person",
            "name": "Shekhar Kapur",
            "url": "/name/nm0001408/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWM4NmYwNTYtZDJhNS00YTIwLWJhNjAtNzAxNTEzMzAxN2ZiL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "queen elizabeth i,catholic,queen,british royal family,murder of a nude woman",
    "name": "Elizabeth",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MaxBorg89"
        },
        "dateCreated": "2008-01-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0127536/"
        },
        "name": "Queen Blanchett",
        "reviewBody": "The Academy Awards ceremony of 1999 angered many people: Shakespeare in Love, albeit a very smart and funny film, robbed the superior Saving Private Ryan of the Best Picture Oscar; Roberto Benigni beat Edward Norton in the Best Actor category (though it was the Italian star's behavior, rather than his performance, that irritated those attending the event); and Gwyneth Paltrow, who wasn't actually bad in Shakespeare, walked away with the Best Actress award, depriving Cate Blanchett of the recognition she should have received for her revelatory work in Elizabeth.\n\nThis film, the first in what the director hopes will be a trilogy (the second installment was released in 2007), covers the early years of Elizabeth I's reign, from her harsh upbringing to the decision to call herself \"the Virgin Queen\". To describe her situation as tough is an understatement: she was a Protestant monarch in a largely Catholic kingdom, several covert groups wanted her dead and foreign sovereigns kept asking for her hand in marriage, without ever succeeding, for the only man she loved was also the only one she couldn't have.\n\nConspiracies and unhappy romances: two unusual ingredients for a period drama. And that is exactly why the film succeeds: in the mind of director Shekhar Kapur, this is not the usual costume film where events are observed with a static eye and what might be perceived by some as excessive slowness (Quentin Tarantino's infamous rant about \"Merchant-Ivory sh*t\" is aimed at those productions); instead, we get a lively, vibrant piece of work, with the camera sweeping through the gorgeous sets and leering at the exquisite costumes while recounting the grand story. And what a story: the thriller aspect aims to please viewers who find the genre a bit lacking in the tension department, whereas the Queen's doomed love affair with Joseph Fiennes' Earl of Leicester (a plot element to which the BBC miniseries from 2005, starring Helen Mirren and Jeremy Irons, is a sort of sequel) is the polar opposite of the sanitized, passionless romantic tales that tend to feature in other period films.\n\nGood-looking technique and strong storytelling would, however, be useless if the title role wasn't played by an equally great actress, and Pakur found the perfect Elizabeth in Blanchett: an odd choice she may have seemed (she was a complete unknown in Hollywood prior to being cast in this movie), but the performance she delivers is nothing short of astonishing. Doubtful, determined, passionate, naive, heartbroken, firm and charismatic - she is quite simply the best on-screen incarnation of Elizabeth in the long history of biopics. The supporting cast (Fiennes, Geoffrey Rush, Christopher Eccleston, Richard Attenborough) is also excellent, as expected from British and Australian thespians, but it is Blanchett who dominates the entire picture. Shame the Academy didn't take notice.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from USA Films",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4037280025",
        "name": "Elizabeth",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjg2OWZhZDktZjkzMS00MTdiLTlhYmUtNjViYWQyZGU3NjBlXkEyXkFqcGdeQWpvaG5oYXJ0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjg2OWZhZDktZjkzMS00MTdiLTlhYmUtNjViYWQyZGU3NjBlXkEyXkFqcGdeQWpvaG5oYXJ0._V1_.jpg",
        "uploadDate": "2008-04-11T13:59:54Z",
        "url": "https://www.imdb.com/video/vi4037280025/"
    },
    "url": "/title/tt0127536/"
}