{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elvis Presley",
            "url": "/name/nm0000062/"
        },
        {
            "@type": "Person",
            "name": "James Burton",
            "url": "/name/nm0123604/"
        },
        {
            "@type": "Person",
            "name": "Jerry Scheff",
            "url": "/name/nm0770483/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1551,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079468/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006538/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045945/"
        }
    ],
    "datePublished": "1973-04-04",
    "description": "A 1973 concert by Elvis Presley taped at the Convention Center in Honolulu, Hawaii. This was the first program to ever be beamed around the world by satellite.",
    "director": [
        {
            "@type": "Person",
            "name": "Marty Pasetta",
            "url": "/name/nm0664515/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGM2NDRjM2YtYmUyNS00YzZmLTljNmYtZmU4ZWZmNmM3Nzg1XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "1970s,year 1973,honolulu hawaii,hawaii,concert",
    "name": "Elvis: Aloha from Hawaii",
    "original_info": {
        "id": "Elvis: Aloha from Hawaii_1973",
        "name": "Elvis: Aloha from Hawaii",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ccthemovieman-1"
        },
        "dateCreated": "2010-01-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0167923/"
        },
        "name": "Appreciating Elvis",
        "reviewBody": "I hadn't seen, even on TV, an Elvis concert performance in 30 years and even though I grew up with \"The King\" and rock 'n roll, I still was surprised how good this concert turned out to be. I also remember hearing and reading - for years - how fat and bloated Elvis looked in his \"last years\" but that must have been later because he looked great here.\n\nIt also surprised me that Presley did Beatles' songs along with other tunes made famous by other people....and did them really well. Maybe I shouldn't have been because Elvis did Carl Perkins' \"Blue Suede Shoes\" way back in the beginning of his career and he liked Chuck Berry songs, which he does in this concert, along with a Jerry Lee Lewis and a Little Richard song. I wish Elvis had done more blues numbers because he sounded very good on \"Steamroller Blues,\" a James Taylor song.\n\nAnyway, whether it's a ballad, or a country song, a gospel tune, a rockabilly number.....whatever, Presley sounded good, showing his versatility. He also had - no surprise - a great band and backup singers. I particularly appreciate the work of lead guitarist James Burton, who's still going strong at age 70.\n\nThis concert is available, by the way, on two different DVDs: the \"TV concert\" and an \"extended\" version which includes his rehearsals and other bonus features.\n\nThis might be Elvis four years before his death and, yes, he's not the super-energetic rockabilly kid from the '50s, but the man wasn't just a legendary performer, this concert shows how well he could sing! I'm only sorry it took me this long to fully appreciate the man's talents.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0167923/"
}