{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elvis Presley",
            "url": "/name/nm0000062/"
        },
        {
            "@type": "Person",
            "name": "James Burton",
            "url": "/name/nm0123604/"
        },
        {
            "@type": "Person",
            "name": "Glen D. Hardin",
            "url": "/name/nm0362219/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3079,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        }
    ],
    "datePublished": "1970-11-11",
    "description": "After years of making movies, the King made a triumphant return to the stage in 1970. Now, see the backstage footage from rehearsals to relaxing at the hotel and the performances in one of the most intimate looks at Elvis captured...",
    "director": [
        {
            "@type": "Person",
            "name": "Denis Sanders",
            "url": "/name/nm0761522/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDg4ZDhhNTYtYzU0MC00NDg5LTk5MDctOTMzMTY1NjFhZDllXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "concert film,concert footage,mgm studios,culver city,jam session",
    "name": "Elvis: That's the Way It Is",
    "original_info": {
        "id": "Elvis: That's the Way It Is_1970",
        "name": "Elvis: That's the Way It Is",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slokes"
        },
        "dateCreated": "2003-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065687/"
        },
        "name": "Yes, he was really THAT cool",
        "reviewBody": "Filmgoers were treated to two rockumentaries in 1970. The first, \"Let It Be,\" shows the greatest rock n' roll band ever, The Beatles, struggling unsuccessfully to get out of its first and only decade of existence. The second, \"That's The Way It Is,\" shows the greatest rock n' roll singer ever, Elvis Presley, entering his third decade of stardom lean, mean, and taking no prisoners.\n\nThe form of both is almost identical. You see rehearsal footage in a studio, some backstage chatter, and then a live performance before an enthused crowd. But while \"Let It Be\" is more interesting as a historical document than entertainment, \"That's The Way It Is\" is a powerful, galvanizing performance piece that stands up as well now as it did in 1970.\n\nEven better than in 1970, many would say, because the version we have now is heavily re-edited, using unused footage from the original filming, mostly focused on Elvis, and discarding other bits showing interviews with fans. (You can see the seams, though, as many of the patched-in bits have a washed-out color scheme immediately apparent when contrasted with the vibrant Lucien Ballard photography of the original film.)\n\nI'm not sure I like the idea of tampering with the record, but it's hard to bicker with results. The new \"Way It Is\" has a power and freshness that makes you feel the vitality of Elvis, who by 1970 was at least a half-step behind the fashion of the times but a better performer than ever. Since the film features Elvis in a series of Vegas shows (six filmed over three days in August, 1970, just seven years before his death) it's not unnatural to expect a bloated rhinestone-encrusted drug addict with velcro sideburns performing hokey schmaltz, as the myth perpetuated by his detractors would have it. But 1970 was a very good year for the King. He was not only in fine physical shape, he had matured into a vocalist who had married his awesome power with subtlety and finesse, and found his voice in a series of country-tinged rock songs that complemented him nicely even if they never achieved the pop status of his earlier hits. Songs like \"Patch It Up,\" \"Just Pretend,\" \"Twenty Days And Twenty Nights\" and \"Tiger Man\" (seen in a killer title sequence juxtaposed with Elvis's standard show-opener \"Mystery Train\") are thrilling, classic-sounding numbers not burdened today by overplay on oldies radio stations. Even his outfits were in surprisingly good taste for the period, at times even casual and comfortable-looking.\n\nIn rehearsal and on stage, Elvis works in his biggest hits of yore, which he seems almost embarrassed by and trots out almost perfunctorily, then throws in newer songs recorded by other artists, like the Bee Gees' \"Words\" and The Righteous Brothers \"You've Lost That Loving Feeling,\" that he invests with real conviction and passion. He was a real artist, always moving forward, finding brilliance in the work of others, and believing in the power of song.\n\nThere are many highlights in this film. Elvis throws himself into each number he performs on stage like its his last moment on earth, even his older hits once he warms up to them. His \"Love Me Tender\" sends him into the audience for a lengthy series of kisses with delighted female audience members, and what blows you away is not so much the serial smooching but the way Elvis makes an effort to offer serious eye contact to everyone who approaches him, and thanks them sincerely when he returns to the safety of the stage. \"Sorry I couldn't make it up there,\" he yells to the people in the balcony, and I think he meant it.\n\nI especially appreciated the chance to see Elvis's interaction with his bandmates, a killer ensemble led by guitarist extraordinaire James Burton and drummer Ronnie Tutt, who was probably the only guy in 1970 who could have given Keith Moon a run for his money in a \"Wipeout\" faceoff. \"The backbone of my whole show,\" he calls his musicians in a typical moment of humility. Elvis is also accompanied by the playful and vibrant Sweet Inspirations and the Imperials, male back-up singers who resemble Elvis impersonators before their time.\n\nElvis comes across as genuinely decent and sweet, but doesn't let you into his world too much. That's just as well when you get a load of his unctuous retinue, the Memphis Mafia, a squalid band of freeloaders and enablers who sped the King to his sordid doom. They giggle and interfere a bit, enough to remind you of the dark side of Elvis's celebrity, but in the end what you have is a prime slice of music greatness, the greatest vocalist of his day finding new power in his reinvention as rock's elder statesman and most accomplished showman, plowing through songs like \"Polk Salad Annie\" and \"I Can't Stop Loving You\" like he was plugged into God's private frequency.\n\nI'd never say the Beatles were a shabby second to Elvis, but it's hard not to see them falling short in the rockumentary department. Elvis even delivers a better version of \"Get Back\" (though he seems to think the title is \"Take It Back.\") This is a film you will want to see at least once, just to get a sense of who Elvis was just before the money-changers moved into the temple and the man was hijacked by the legend.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Elvis: That's The Way It Is",
        "duration": "PT2M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3062607897",
        "name": "Elvis: That's The Way It is",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGVhYTUwY2UtYTc2OC00Y2VlLTk1MzQtOGNiNmU5NzAxOTFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGVhYTUwY2UtYTc2OC00Y2VlLTk1MzQtOGNiNmU5NzAxOTFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-05-13T04:24:41Z",
        "url": "https://www.imdb.com/video/vi3062607897/"
    },
    "url": "/title/tt0065687/"
}