{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Holly Sampson",
            "url": "/name/nm0760175/"
        },
        {
            "@type": "Person",
            "name": "Shauna O'Brien",
            "url": "/name/nm0639815/"
        },
        {
            "@type": "Person",
            "name": "Lyle Skosey",
            "url": "/name/nm0804735/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 218,
        "ratingValue": 4,
        "worstRating": 1
    },
    "alternateName": "Emmanuelle 2000: Emmanuelle's Intimate Encounters",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024037/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018187/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006934/"
        },
        {
            "@type": "Person",
            "name": "Rolfe Kanefsky",
            "url": "/name/nm0437490/"
        }
    ],
    "description": "A couple has a machine that gives the paraplegic wife different degrees of mind and body control of other people, allowing her to feel the sexual pleasure that women sleeping with her husband feel. Emmanuelle joins the testing.",
    "director": [
        {
            "@type": "Person",
            "name": "Rolfe Kanefsky",
            "url": "/name/nm0437490/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAzMjk3NTMxM15BMl5BanBnXkFtZTcwNjk1MzEzMQ@@._V1_.jpg",
    "keywords": "sex,sex in bed,lingerie,bikini,blonde",
    "name": "Emmanuelle's Intimate Encounters",
    "original_info": {
        "id": "Emmanuelle's Intimate Encounters_2000",
        "name": "Emmanuelle's Intimate Encounters",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "it001k0306"
        },
        "dateCreated": "2009-05-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0295232/"
        },
        "name": "There must be a market for this rubbish but...?",
        "reviewBody": "...I have no idea what that market is! Now, I'm a film fan of eclectic tastes - I like an awful lot of the films that cinema snobs tell me I should - but I also absolutely love the horror/sci-fi genre and am a great fan of exploitation films from B-Movie to Z-Movie. Favourite actor? Peter Cushing. Favourite comedies? The wonderfully British 'Carry-On' series. Favourite directors? Terence Fisher, John Carpenter, Alfred Hitchcock. Shane Meadows. Favourite films? Everything from Muppet Christmas Carol to Halloween (original), Casino Royale, Hitchcock's Rope and Frenzy, It's a Wonderful Life, Frankenstein and the Monster From Hell. See what I mean? Eclectic? I'm no film snob. BUT I STILL DON'T KNOW WHO WOULD WATCH THIS FILM!!!!! So, hold on. Why did I watch it? Because B-Movie horror starlet Tiffany Shepis made a brief appearance in it and, as B Movie horror starlets go, she's pretty good. And whilst watching it, I might as well try to watch with an open mind. Only....well, it's complete rubbish, isn't it? Can any of the principal actors actually act? Not really. Any decent effects for sci fi lovers? No. Any atmosphere created? No. Are the soft core sex scenes erotic enough for daylight dodging pervs? No. So who gets what they want? Nobody. Now, I've seen the original 'Emmanuelle' because it's one of those films that has entered into legend. Didn't think it was great but it had a touch of style and it was pretty erotic. Good - came good for its audience (is there a joke in that sentence somewhere?). Now, this mess of a film has nothing in common with the original bar the name. Rip-off! The only interest for me was the afore mentioned Shepis and the fact that the general storyline bears passing resemblance to Michael Reeves' British shocker for Tigon films - 'The Sorcerers' (1967) starring Boris Karloff. Now that was a great B Movie! This? If you like sex films - don't bother. If you like low budget sci-fi - don't bother. Just don't bother. Anyone. I gave this 3 stars, by the way, for the number of different girls who got their kit off in the first hour of the film!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H30M",
    "url": "/title/tt0295232/"
}