{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Monique Gabrielle",
            "url": "/name/nm0001249/"
        },
        {
            "@type": "Person",
            "name": "Crofton Hardester",
            "url": "/name/nm0362148/"
        },
        {
            "@type": "Person",
            "name": "Dana Burns Westburg",
            "url": "/name/nm0922480/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1060,
        "ratingValue": 3.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0216657/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014338/"
        },
        {
            "@type": "Person",
            "name": "Emmanuelle Arsan",
            "url": "/name/nm0037491/"
        },
        {
            "@type": "Person",
            "name": "Walerian Borowczyk",
            "url": "/name/nm0097259/"
        },
        {
            "@type": "Person",
            "name": "Alex Cunningham",
            "url": "/name/nm0192227/"
        }
    ],
    "datePublished": "1987-01-07",
    "description": "Emmanuelle has a streak of bad luck that starts when she is stripped by a mob of adoring fans at the Cannes Film Festival. Her rotten luck continues when the dictator of a banana republic uses the screening of one of her films as ...",
    "director": [
        {
            "@type": "Person",
            "name": "Walerian Borowczyk",
            "url": "/name/nm0097259/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWVhMjJiNDAtZTU5Ni00MjMyLWIwY2YtNjJkYjRlMjdiODFhXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "female rear nudity,female full frontal nudity,female pubic hair,cannes film festival,sex scene",
    "name": "Emmanuelle 5",
    "original_info": {
        "id": "Emmanuelle 5_1992",
        "name": "Emmanuelle 5",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2008-11-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092962/"
        },
        "name": "Poor",
        "reviewBody": "Emmanuelle 5 (1987) \n\n* 1/2 (out of 4) \n\nEmmanuelle (Monique Gabrielle) is at Cannes showing off her latest film, which is bought by an Arab prince. Emmanuelle goes to his small country for the premiere but soon she is held captive by the evil ruler who won't even allow women to show their legs or touch themselves but that's not going to sit well with our star. Apparently there are three versions of this film; the original European version, an American edit and an alternate hardcore version. I watched the American edit, which features some newly shot scenes as well as outtakes from the Euro version. I've never been a huge fan of the director but I might go as far to say this is the most entertaining film I've seen from him. If you've seen any of the Emmenuelle movies, whether the original series or the Black Emanuelle movies, then you know what to expect. Gabrille isn't much of an actress but she does have a great body and shows it off enough to keep the film moving. The supporting cast includes Crofton Hardester and Dana Bruns Westburg but they don't add a whole lot to the film. The biggest problem is the studio subplot dealing with the evil ruler who won't let women be free but of course we all know this movie was made to show women naked so the political message just comes off silly and rather stupid. Apparently fans have called Borowczyk a sell out for doing this film but there's still plenty of \"art\" here to where he can call it his own. I doubt his die-hard fans are going to give this film too much credit so I'd say those seeking cheap nudity will be the ones to enjoy this the most."
    },
    "url": "/title/tt0092962/"
}