{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christian Bale",
            "url": "/name/nm0000288/"
        },
        {
            "@type": "Person",
            "name": "John Malkovich",
            "url": "/name/nm0000518/"
        },
        {
            "@type": "Person",
            "name": "Miranda Richardson",
            "url": "/name/nm0001669/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 128817,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009119/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Tom Stoppard",
            "url": "/name/nm0001779/"
        },
        {
            "@type": "Person",
            "name": "J.G. Ballard",
            "url": "/name/nm0050618/"
        },
        {
            "@type": "Person",
            "name": "Menno Meyjes",
            "url": "/name/nm0583675/"
        }
    ],
    "datePublished": "1987-12-25",
    "description": "A young English boy struggles to survive under Japanese occupation of China during World War II.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Spielberg",
            "url": "/name/nm0000229/"
        }
    ],
    "duration": "PT2H33M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmQwNzczZDItNmI0OS00MjRmLTliYWItZWIyMjk1MTU4ZTQ4L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "world war two,japan,soldier,1940s,china",
    "name": "Empire of the Sun",
    "original_info": {
        "id": "Empire of the Sun_1987",
        "name": "Empire of the Sun",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2016-11-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092965/"
        },
        "name": "A great adventure for a child",
        "reviewBody": "I can see that a tale told from a child's point of view how it would stir the imagination of one Steven Spielberg. Empire Of The Sun is a really imaginative story of a young boy stuck in World War II China in a truly terrible situation cut off from his parents. Yet young Christian Bale turns the whole thing gradually into an adventure of sorts. \n\nUp to the age of 11 young Bale has lived in the British quarter of Shanghai and in fact has never seen the United Kingdom, his father Rupert Frazer owns a textile factory. Bale and his parents live in luxury among the millions of Chinese.\n\nWhat one should remember when watching Empire Of The Sun is that since the Opium War of 1841 western powers and Japan joined them took small little nibbles out of China and in fact were granted by the weak Chinese governments special treatment in their quarters. Frazer, Emily Richard his wife and young Bale lived under British law and did not answer to the Chinese. The other powers did the same, even the USA had its own quarter in Shanghai as well as other large Chinese cities. That only ended with the Communist takeover in 1949.\n\nIt ended a bit prematurely for the west in 1941 when the Japanese attacked America, Great Britain, the Netherlands. That's when Bale's well ordered world falls apart.\n\nI had to marvel at how when Bale came home and the parents were gone and some looting had occurred how his reactions were. Without any dialog Bale runs through a gamut of emotions. Great job of acting and directing.\n\nLater on Bale is rounded up and taken to an internment camp next to an airfield. Fascinating how Bale who had an interest in aviation looks at the Japanese planes and become almost worshipful of the enemy. He even makes friend with some of the Japanese, a group not known for treating prisoners well in World War II.\n\nJoe Pantoliano and John Malkovich are a pair of American adventurers, no better than they ought to be. They're caught along with Bale and sent to the internment camp. Our adult eyes see them as a pair of bottom feeders. But we see them through the child's eyes also and they become sort of devil may care rogues that one reads in pulp fiction the kind Bale no doubt read. \n\nSteven Spielberg did a marvelous job of recreating wartime China and it certainly helped to shoot the film there. Just part of the People's Republic's post Mao entry into the community of nations.\n\nThe adult performers are fine. Empire Of The Sun got a flock of Oscar nominations in technical categories, no gold though. But it did inaugurate the career of Christian Bale who's done pretty well for himself as an adult actor too.\n\nThis one is highly recommended for its realism and encouragement of imagination.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi497352985",
        "name": "Empire of the Sun",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWE2YzliMmQtMzAyOS00ZTIzLWE2YjItNzU1NzNjZDRlNGQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWE2YzliMmQtMzAyOS00ZTIzLWE2YjItNzU1NzNjZDRlNGQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:00:13Z",
        "url": "https://www.imdb.com/video/vi497352985/"
    },
    "url": "/title/tt0092965/"
}