{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rhys Ifans",
            "url": "/name/nm0406975/"
        },
        {
            "@type": "Person",
            "name": "Daniel Craig",
            "url": "/name/nm0185819/"
        },
        {
            "@type": "Person",
            "name": "Samantha Morton",
            "url": "/name/nm0608090/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10737,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108804/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104092/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002948/"
        },
        {
            "@type": "Person",
            "name": "Ian McEwan",
            "url": "/name/nm0568605/"
        },
        {
            "@type": "Person",
            "name": "Joe Penhall",
            "url": "/name/nm0671856/"
        }
    ],
    "datePublished": "2004-11-26",
    "description": "Two strangers become connected by a tragedy, yet one dangerously feels that the connection goes much deeper than the other is willing to admit.",
    "director": [
        {
            "@type": "Person",
            "name": "Roger Michell",
            "url": "/name/nm0585011/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Mystery",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmUzZDZlZTMtMDg0Mi00ZDA4LThkMjAtNDRlODMxMGVkNDk0XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "accident,hot air balloon,dangerous friend,being stalked,stalking",
    "name": "Enduring Love",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-12-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0375735/"
        },
        "name": "Not easy viewing but interesting and engaging. Oh, and viewers calling it a 'Fatal Attraction rip off' are just missing the point",
        "reviewBody": "Out in the country for a nice picnic, Joe and Claire get involved in a ballooning accident that leads to the death of one of the men who came to help. Joe seems to get over it but he does obsess over whether or not he could have done more. This obsession is fed when he begins being stalked by one of the men who was also involved in the accident  Jed, who appears to believe that Joe and him are close and belong together as a result of what they shared. As Jed continues to get close, Joe appears to be coming apart, putting a great deal of strain on his relationship with Claire.\n\nWhen I went to see this film I had no idea whatsoever what it was about and the first four minutes of the film had as much of an impact on me as I'm told the start of the book did. With the accident (that is frighteningly convincing) the seeds are sown for a film that is about love, mental health and about a sort of Fatal Attraction vibe. I use the last description with reservations because I don't think this is comparable to Fatal Attraction because this has so much more to it than just the bunny boiler stuff. Instead the story mixes it with Joe's own sanity crumbling at the same time as Claire's 'enduring love' for him is put to the test. I have not read the book, but for my money the film did this pretty well, producing plenty of good dialogue that meant the film was more about the character of Joe than it was about Jed. This is not say it is totally perfect because it isn't; the fatal attraction thing easily takes the focus meaning that some parts of the audience may feel that this is the whole ball game and that all the 'talking' is what gets in the way. For me, I felt the other way, the fatal attraction thing weakened the film when it is the focus and, for this reason, I didn't like the extra ending during the credits because I felt that the open ending had done fine on its own.\n\nThe writing is good but the film relies very heavily on the performances and, luckily they are all good where they need to be. Craig is fast becoming someone who is headed for big things, not only does he have the body of a star but he can really act too. Here he is a convincing 'normal' person and his initial polite bemusement by Jed is realistic, as his gradual descent into instability himself. Morton may have less time but she is equally convincing and realistic in showing that love always has limits everywhere except in the movies. Ifans is good even though he has the roles of the religious fanatic, mentally ill, homosexual stalker to deal with. Whether or not it was wise to link all those aspects or not is one matter but Ifans still does well  never really resorting to showboating or easy 'mad man' stuff. I wasn't totally won over by him because Craig was my focus, but he still did well. Support from Nighy, Lynch etc is OK but really they are minor roles and not anywhere near the centre of the film.\n\nOverall this is a strange film and anyone who dismisses it as being a rip off of Fatal Attraction has totally missed the point. Instead the film looks at love, at sanity and relationship all in a well-written script that is well delivered by a couple of very good actors in the lead roles. Not to everyone's tastes then and not the easiest one to really put into a nutshell but interesting, moving and satisfyingly lacking in gloss throughout."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1436877081",
        "name": "Enduring Love",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTgxNDhhMmQtZjdlMy00ZWZiLTg1N2ItOGY2NWZmNWJiNzRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTgxNDhhMmQtZjdlMy00ZWZiLTg1N2ItOGY2NWZmNWJiNzRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:00:56Z",
        "url": "https://www.imdb.com/video/vi1436877081/"
    },
    "url": "/title/tt0375735/"
}