{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dennis Quaid",
            "url": "/name/nm0000598/"
        },
        {
            "@type": "Person",
            "name": "Louis Gossett Jr.",
            "url": "/name/nm0001283/"
        },
        {
            "@type": "Person",
            "name": "Brion James",
            "url": "/name/nm0001397/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49329,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072649/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142386/"
        },
        {
            "@type": "Person",
            "name": "Barry Longyear",
            "url": "/name/nm0519530/"
        },
        {
            "@type": "Person",
            "name": "Edward Khmara",
            "url": "/name/nm0451689/"
        }
    ],
    "datePublished": "1985-12-20",
    "description": "During a long space war, the lives of two wounded enemies become dependent on their ability to forgive and to trust.",
    "director": [
        {
            "@type": "Person",
            "name": "Wolfgang Petersen",
            "url": "/name/nm0000583/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjRhMDI3YTEtZjNhNC00OGQwLWE1M2EtODVkNmIxZWQwYjIwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "unknown planet,man tied up,future,reptilian humanoid,snow adventure",
    "name": "Enemy Mine",
    "original_info": {
        "id": "Enemy Mine_1985",
        "name": "Enemy Mine",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gavin6942"
        },
        "dateCreated": "2007-09-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089092/"
        },
        "name": "A Story of Friendship, Love and Cross-Species Adoption",
        "reviewBody": "Wolfgang Petersen (acclaimed director of \"Das Boot\" and many others) brings us the story of a future where Earth no longer battles itself, but must fight other entities (the Dracs) in order to get resources from unclaimed planets. After one dogfight, a human and Drac land on the same planet and aren't sure whether to help or destroy each other.\n\nThe casting of this film was by far the best part. Science fiction films in general often suffer because they are harder for an audience to believe and accept. But Louis Gossett Jr. and Dennis Quaid are both actors who are able to make anything seem plausible. Gossett is particularly amazing, going so far as to manipulate his speech and appearance to the point of being unrecognizable. I will say that any actor who does well when we can't even tell it's him is a man to be respected.\n\nThere are some flaws with the film. I, for one, found it unusual that a peace-loving Earth would be so quick to fight other aliens, rather than pursue some diplomatic relationship. But I guess I shouldn't assume humans are logical. I shared a concern with Roger Ebert, who said that the film \"gives us an alien that is too human, too familiar. It takes that amazing planet and gives it food, water, gravity and atmosphere that are suitable for both humans and Dracs... Why couldn't the Drac be truly alien in this film?\" I don't mind that the planet was an M-class planet, but I did find it sad the alien was so humanoid in nature, particularly after they explicitly stated there's nothing human about them. Ebert, in his review, actually goes on about this concern for some time, referencing other science fiction stories (which I will not do here).\n\nEbert also ponders, \"As the slavers stood over their captives with whips, I found myself wondering how cost-effective it would be to transport manual laborers millions of light years. Surely a technology capable of arriving at the planet Fyrine IV would have figured out a better way to mine its ores?\" I guess he thinks about this sort of thing far more than I do, as I had no real problem with the slave traders or any of the subplots. The film was a \"buddy film\" at heart, and a commentary on racism. But it was also an action film, and any good action film requires some senseless fight scenes and killing. Action movies are generally not Oscar-worthy in their writing, but that's because they cater to the primal urges and not the mind, which isn't always a bad thing.\n\nEbert's last concern is that this \"is a movie that made no compromises in its art direction, its special effects and its performances - and then compromised everything else in sight.\" I have already addressed why the action scenes work for me. And yes, I suppose their was a cheesiness to raising an alien child to like American football. But this wasn't an Asimov or Crichton science-rich story -- it was a fun story. And it was a 1980s film, for goodness sakes.\n\nHe is right about the art direction and everything he praises. The directing, acting and scenery were amazing. I forget where this was filmed, but it serves very well as an alien landscape. My only bother with the art was that I felt the film had a bit much influence from \"Star Wars\". I know this is a film from the same era, so it's hard not to be influenced. But there is a creature that is very much like a Sarlacc, and the spacecraft shown in this film had George Lucas written all over them. Maybe I'm just picky, though.\n\nAll in all, i really enjoyed this film. It was at a good pace, it had great acting from two of the better performers out there, and it comes from Petersen, who refuses to make low-quality pictures. Ebert might be overly concerned with the technical aspects of this universe, but for all the shortcomings this film had in that regard, it more than made up for with sheer pleasure.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2024079641",
        "name": "Enemy Mine",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTc1YmIyZTktY2FkNS00MWJmLTk2MDMtMGM4MWEwMjVkN2RiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTc1YmIyZTktY2FkNS00MWJmLTk2MDMtMGM4MWEwMjVkN2RiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:01:09Z",
        "url": "https://www.imdb.com/video/vi2024079641/"
    },
    "url": "/title/tt0089092/"
}