{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dougray Scott",
            "url": "/name/nm0779084/"
        },
        {
            "@type": "Person",
            "name": "Kate Winslet",
            "url": "/name/nm0000701/"
        },
        {
            "@type": "Person",
            "name": "Saffron Burrows",
            "url": "/name/nm0004787/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21423,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076402/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010183/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057092/"
        },
        {
            "@type": "Person",
            "name": "Robert Harris",
            "url": "/name/nm0365249/"
        },
        {
            "@type": "Person",
            "name": "Tom Stoppard",
            "url": "/name/nm0001779/"
        }
    ],
    "datePublished": "2002-06-07",
    "description": "A young genius frantically races against time to crack an enemy code and solve the mystery surrounding the woman he loves.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Apted",
            "url": "/name/nm0000776/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama",
        "Mystery",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTI5ODU3N2UtM2QzNS00NjM1LWExNzMtNjgzYWQ5MWNkYTJmXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "code breaking,traitor,world war two,bletchley park,spy",
    "name": "Enigma",
    "original_info": {
        "id": "Enigma_2001",
        "name": "Enigma",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gvb0907"
        },
        "dateCreated": "2003-11-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0157583/"
        },
        "name": "Adequate Film on Neglected Topic",
        "reviewBody": "Code breaking is hard work. Though picks and shovels aren't required, the hours are long and the frustrations constant. The code breaking process is complex, relying heavily on logic, mathematics, and the assistance of computers. Code breakers themselves often are very weird people who make the common nerd seem comparatively normal. Given all this, it's understandable that hardly any films, aside from documentaries, have been made about the lives and loves of code breakers.\n\n Until \"Enigma\", the one exception was \"Breaking the Code\", the story of Alan Turing, the mathematician perhaps most responsible for cracking the Enigma. But Turing's story, though psychologically fascinating, has its limitations for conventional film makers, the most obvious being the difficulty in creating dramatic tension and the absence of any female love interest.\n\n Michael Apted's `Enigma' is the first real attempt to tell the story of the Bletchley Park code breakers within the framework of both a thriller and a heterosexual romance. As might be expected given the historical circumstances, the thriller aspects come off as rather subdued and the romance, such as it is, as rather restrained.\n\n Set in the dreary England of 1943, where stiff upper lips were bearing the weight of four years of war, `Enigma' centers on mathematician Tom Jericho (Dougray Scott). His day and night job is code cracking, but Jericho spends much of the film attempting to solve the mystery of the disappearance of his former lover, Claire Romilly (Saffron Burrows). Jericho is assisted by the suitably frumpy Hester Wallace (Kate Winslet), but harassed by an elegant MI-5 officer named Wigram (Jermey Northam), who suspects him of both murder and treason.\n\n The disheveled Mr. Jericho and the dowdy Miss Wallace spend much of the film on a last-name basis as they poke through files and try to decode intercepts Claire had in her possession. This leads them off into what seems a blind alley but eventually turns out to be the key to much of the mystery. In the midst of all this, Tom manages to tear himself away long enough to return to work, make a breakthrough, and help his mates recover the keys to a code the Germans had altered, thus changing the course of a critical convoy battle in the North Atlantic.\n\n Slow paced and sometimes dense, `Enigma' is enlivened by Northam's portrayal of Wigram, who has a habit of turning up at inopportune moments and making matters difficult for Jericho. Northam has a lot of fun with this role and he looks great in his suits, providing a sharp sartorial contrast to the drab Jericho-Wallace line of wartime apparel.\n\n Although some critics have compared `Enigma' favorably to works of Hitchcock, Hitch's touch was always lighter and his pacing livelier. And Dougray Scott is not Cary Grant any more than Kate Winslett is Grace Kelly, which is all well and good as this dark, serious film clearly benefits from the use of less glamorous performers.\n\n Historically `Enigma' is reasonably accurate, though only so far as it goes. Alan Turing isn't even given a cameo and the original Polish contribution to the code breaking is barely acknowledged. Unfortunately, the film was not shot at Bletchley Park, some of which still survives, but at various other sites in England and Holland.\n\n Recommended to those interested in code breaking and in World War Two. Others probably will find \"Enigma\" just that."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1084555545",
        "name": "Enigma",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmRjYTdmYTYtNWY4ZC00N2FiLWEzZDUtNzk3MTc4ZDE5MGI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmRjYTdmYTYtNWY4ZC00N2FiLWEzZDUtNzk3MTc4ZDE5MGI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:01:04Z",
        "url": "https://www.imdb.com/video/vi1084555545/"
    },
    "url": "/title/tt0157583/"
}