{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christian Bale",
            "url": "/name/nm0000288/"
        },
        {
            "@type": "Person",
            "name": "Sean Bean",
            "url": "/name/nm0000293/"
        },
        {
            "@type": "Person",
            "name": "Emily Watson",
            "url": "/name/nm0001833/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 336630,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007610/"
        },
        {
            "@type": "Person",
            "name": "Kurt Wimmer",
            "url": "/name/nm0934483/"
        }
    ],
    "datePublished": "2002-12-06",
    "description": "In an oppressive future where all forms of feeling are illegal, a man in charge of enforcing the law rises to overthrow the system and state.",
    "director": [
        {
            "@type": "Person",
            "name": "Kurt Wimmer",
            "url": "/name/nm0934483/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkzMzA1OTI3N15BMl5BanBnXkFtZTYwMzUyMDg5._V1_.jpg",
    "keywords": "dystopia,suppression of emotion,gun fu,law,brainwashing",
    "name": "Equilibrium",
    "original_info": {
        "id": "Equilibrium_2002",
        "name": "Equilibrium",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-03-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0238380/"
        },
        "name": "Enjoyable sci-fi despite the low budget and the recognisable style",
        "reviewBody": "After the third world war had ended, the survivors realised that mankind would not be able to survive much longer if it didn't tackle the thing that makes them fight - emotion. To tackle the drive to hurt and hate, the Government issues drugs to sedate the populace from the highs or lows of feeling. Meanwhile the police round up those who still feel and destroy art, books and anything that would stir feeling. The heads of these police are the elite Clerics. John Preston has always been a Cleric, but the failure of his partner and an encounter with a feeler start him thinking and feeling.\n\nWith sighs of `matrix clone' and `cashing in', I, like many viewers overlooked this film in favour of other things that may have come across as more original. However, in the mood for a bit of slick action, I rented this film and was pleasantly surprised by it. The plot may not be original - but what is these days? The film has shades of 1984 and Brave New World about it and it uses these ideas reasonably well. The concept does fall down a little bit with too much thought but on the surface it works well enough to suffice for a sci-fi action movie - the running time doesn't allow for much more than superficial thought here, although there is enough in this future to be thought provoking.\n\nThe action is good considering the low budget involved here. Yes, it's all very much thanks to the influence of the Matrix but at least it is quite stylish and exciting in it's own right rather than just being a lazy copy. The action scenes are well spread out over the film and they have good pace despite being very much style over substance. The explanation for all the acrobatics and semi-invincibility here is not as good as the explanation/justification for the same in Matrix, but again it is acceptable for this level of film. If anything, the plot goes too fast and too far - it is difficult to accept that things happen so fast, but generally it works.\n\nThe cast is a strange mix but works. The thing that surprised me was the sheer number of British actors in the cast. Bale is good in the lead role despite his American accent, he is pretty cool and manages to do the emotional change required despite the rush enforced on him by the film. Diggs is disappointing - his character doesn't get enough screentime and he doesn't fulfil the role of rival to Bale, he is a good looking guy but that isn't enough here. The support cast features Bean, Pertwee, Connelly, Fincher and McFadyen but really it is totally Bale's movie and he does pretty well to make it together.\n\nOverall this is not a great film but it is an enjoyable action sci-fi that manages to produce an interesting, if unoriginal plot and some slick and fun action that is no less slick or fun for being a low rent version of The Matrix's effects. Well worth a Friday night look!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi368025113",
        "name": "Equilibrium",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTg5NmRmYzUtYzM3MS00OWU0LTgzYmMtNzc2OTFkZGZhMzI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTg5NmRmYzUtYzM3MS00OWU0LTgzYmMtNzc2OTFkZGZhMzI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:19:50Z",
        "url": "https://www.imdb.com/video/vi368025113/"
    },
    "url": "/title/tt0238380/"
}