{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Clapton",
            "url": "/name/nm0002008/"
        },
        {
            "@type": "Person",
            "name": "Nathan East",
            "url": "/name/nm0247543/"
        },
        {
            "@type": "Person",
            "name": "Andy Fairweather Low",
            "url": "/name/nm0522784/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 161,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "datePublished": "2002-11-05",
    "description": "This film, from the makers of Eric Clapton - The 1960s Review, follows Clapton's bold musical journey through the seventies. Featuring new and archive interviews, rare performance footage, contributions from the likes of Bonnie Br...",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Lockwood",
            "url": "/name/nm1201539/"
        },
        {
            "@type": "Person",
            "name": "Danny O'Bryen",
            "url": "/name/nm1161679/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU2NTU0NzA5M15BMl5BanBnXkFtZTgwNDI0NzA0MTE@._V1_.jpg",
    "keywords": "year in title,20th century,1970s,concert film,number in title",
    "name": "Eric Clapton: One More Car, One More Rider - Live on Tour 2001",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bassisgreat"
        },
        "dateCreated": "2005-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0473479/"
        },
        "name": "Spectacular performance, covers a wide range of material",
        "reviewBody": "I saw this DVD playing in a local video store that I go to and actually bought the copy right out of their DVD player (it was the only copy they had). This is a spectacular performance from Eric Clapton, and has equally impressive performances by everyone in the band, including Nathan East on bass, and Steve Gadd on drums showing how tasteful and musical a rhythm section can be.\n\nThe sound on the DVD is outstanding, and you can hear the entire band in crystal clear 5.1 surround. The camera work is also terrific. They don't miss a beat, and show everything I could hope to see from home of this terrific concert. This is the next best thing to being there in the front row. I love music DVD's and can be particular about the way they sound and the way they are shot, and this one is very satisfying on both fronts.\n\nThe material covered ranges from the classics to his more recent material, and really gives you a feeling of what a prolific and diverse artist he is. Overall, I would highly recommend this DVD to any Clapton fan, or anyone who is interesting in trying him out. He is truly a musical genius and a seasoned professional that has aged very well musically.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0473479/"
}