{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Beck",
            "url": "/name/nm0065169/"
        },
        {
            "@type": "Person",
            "name": "Doyle Bramhall II",
            "url": "/name/nm1129671/"
        },
        {
            "@type": "Person",
            "name": "Eric Clapton",
            "url": "/name/nm0002008/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 108,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066897/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0113655/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        },
        {
            "@type": "Person",
            "name": "Mitch Glazer",
            "url": "/name/nm0322248/"
        }
    ],
    "datePublished": "2007-11-28",
    "description": "In the spring of 2013 in New York City, Eric Clapton once again assembled an unparalleled lineup of the world's most celebrated guitarists for the fourth incarnation of his legendary Crossroads Guitar Festival. While the previous ...",
    "director": [
        {
            "@type": "Person",
            "name": "Martyn Atkins",
            "url": "/name/nm0040631/"
        }
    ],
    "duration": "PT4H",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQyMzUyOTc0OV5BMl5BanBnXkFtZTgwNTgwOTc5MjE@._V1_.jpg",
    "name": "Eric Clapton: Crossroads Guitar Festival, Chicago",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ccthemovieman-1"
        },
        "dateCreated": "2007-12-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1091176/"
        },
        "name": "Great Music, Great Vibes At This Concert!",
        "reviewBody": "Different from first Crossorads Festival on DVD, the one held in Texas in 2004, was the following: (1) this one took place in the Chicago area in July of this year; (2) had comedian Bill Murray as a host, beginning the festivities and introducing many of the performers; (3) had some new faces at the concert.\n\nOf the performers that were not on the 2004 DVD, the ones I enjoyed the most were Albert Lee (incredibly-fast hands), Susan Tedeschi, Jeff Beck, Steve Winwood and Derek Trucks. Of the new faces, none was more startling than Beck's bass player: Tal Wilkenfeld.\n\nOf the musicians on both Crossroads concert DVDs, once again the one who continues to stun me with his guitar talent is Vince Gill. Next to him, I throughly welcomed back our host, Eric Clapton, of course, who always is fantastic; B.B. King, Jimmy Vaughan, Robert Cray, Robert Randolph, Doyle Bramhall II and Los Lobos.\n\nI have to admit I do not understand why Willie Nelson and Sheryl Crow were there, as this was a guitar festival and neither one is known for that particular talent. \n\nSpeaking of talent, here's 10 guitarists, just offhand, I'd love to see if Eric keeps hosting these festivals: Mark Knopfler, Mick Taylor, Ronnie Earl, Keith Richards, Peter Green, Dave Mason, Jack Bruce, Sue Foley, Walter Trout and Robben Ford. I'm sure I left out a ton of other great guitarists, but those just came to mind.\n\nThere were touching moments in this all-day concert, too, and you can see the love Eric has with King and Winwood. The whole thing, really, is one big love affair the artists share for each other and the good cause for the concert. Speaking of that, the $20 you shell out for this four hours of music all goes to rehab center in Antigua.\n\nOverall, this is another outstanding Crossroads Guitar Festival and I just hope they keep coming!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "timeRequired": "PT4H",
    "url": "/title/tt1091176/"
}