{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Clapton",
            "url": "/name/nm0002008/"
        },
        {
            "@type": "Person",
            "name": "Doyle Bramhall II",
            "url": "/name/nm1129671/"
        },
        {
            "@type": "Person",
            "name": "Nathan East",
            "url": "/name/nm0247543/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 112,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0138440/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0138439/"
        }
    ],
    "datePublished": "2004-12-07",
    "description": "Live, intimate and raw, ERIC CLAPTON - SESSIONS FOR ROBERT J is Eric Clapton's tribute to blues legend Robert Johnson. The project was filmed during tour rehearsals in London and Dallas, and features a recording session at 508 Par...",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Nomura Schible",
            "url": "/name/nm1317469/"
        },
        {
            "@type": "Person",
            "name": "Chris Hilson",
            "url": "/name/nm0385209/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Music",
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWI1NjQ0ZDEtOWZmYS00ZjQ1LWFkZTItYTlkYmM0YzlkNjcwXkEyXkFqcGdeQXVyNjgxMjIyNTU@._V1_.jpg",
    "keywords": "plagiarism,character name in title",
    "name": "Eric Clapton: Sessions for Robert J",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rallee2"
        },
        "dateCreated": "2006-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0439806/"
        },
        "name": "Heartfelt Work of Art",
        "reviewBody": "Greetings\n\nI rarely write comments and have never written a fan letter in my life but I am moved to comment on this show - \"Sessions for Robert J.\". While I have mostly enjoyed Eric Clapton's work I am certainly not a fan. However I must admit that I am most fond of Mr Clapton's less commercial work and definitely his more \"devilish\" (sorry about that bad acid trip at the Fillmore years ago that set him on his commercial stint) work is what moves me most. This project however is at once devilish and angelic and I think that is just perfect. The juxtaposition of the sacred and the profane is after all what the Blues and maybe even the whole of Music is all about.\n\nIn the interest of brevity (you really should get about the business of seeing this as soon as possible, or at least as soon as you might be in the mood for this type of show) see this show. By that I mean this is certainly no action/adventure movie but rather more like a documentary. That said it is by no means dry or overly intellectual even though Clapton does spend some time describing and demonstrating the difficult Johnson techniques, both vocally and instrumentally. This is done in a manner that will serve to delight musicians and non-musicians alike. Some moments can raise gooseflesh. The most important comment I can make is that Clapton is reverent without gushing and that he delivers the music in a perfect blend of homage and personal integrity. He does not try to \"screw his voice up\" to \"sound black\" yet he pays detailed attention to phrasing and conventions, such as hoots, hollers and asides but he sings in his own voice in a way he probably could not have back in Cream days.\n\nSimply put, if you love Clapton, or if you love Robert Johnson or probably even if you just love the honesty and integrity of The Blues done up right, you will thoroughly enjoy this heartfelt work of art.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0439806/"
}