{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julia Roberts",
            "url": "/name/nm0000210/"
        },
        {
            "@type": "Person",
            "name": "Albert Finney",
            "url": "/name/nm0001215/"
        },
        {
            "@type": "Person",
            "name": "David Brisbin",
            "url": "/name/nm0109773/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 204421,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010434/"
        },
        {
            "@type": "Person",
            "name": "Susannah Grant",
            "url": "/name/nm0335666/"
        }
    ],
    "datePublished": "2000-03-17",
    "description": "An unemployed single mother becomes a legal assistant and almost single-handedly brings down a California power company accused of polluting a city's water supply.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Soderbergh",
            "url": "/name/nm0001752/"
        }
    ],
    "duration": "PT2H11M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTA1NWRkNTktNDMxNS00NjE4LWEzMDAtNzA3YzlhYzRhNDA4L2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "environmental issue,contamination,corporate crime,single mother,contaminated water",
    "name": "Erin Brockovich",
    "original_info": {
        "id": "Erin Brockovich_2000",
        "name": "Erin Brockovich",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2003-02-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0195685/"
        },
        "name": "Enjoyable",
        "reviewBody": "Out of work, out of hope, trashy, twice divorced single mother Erin fails to get another job due to her lack of experience. On her way home she is hit by another car. She goes to lawyer Ed Masry who spectacularly fails to win her any damages. Erin demands he gives her a job and he begrudgingly does. Doing some of his pro-bono work, Erin uncovers evidence that suggests that manufacturing firm PG&E had poisoned the local water supply and lie to residents about the content. As she looks deeper she finds a legacy of illness and a small bit of research turns into a mammoth case.\n\nI don't know how much of this drama is factual and how much of it is changed to add to dramatic effect but regardless the story is involving, funny and moving. At the time there was a rash of 'environmental damage' legal films of which this is one of the more polished and classy. The film focuses as much on Erin as it does on the case and at times it risked failing as a legal drama/thriller. However it still grips as the facts pretty much speak for themselves  the film adds to this by creating a real sense of PG&E as a monster without scruples or concern for the residents. As a result the events feel more powerful and involving. It feels slow at times, but if you're into it then it feels patient rather than slow and deliberate rather than laboured.\n\nThe biggest reason that the focus on Erin works is because Roberts really does very well giving her Erin a down to earth, trashy feel that could have been hammy or unbelievable (she is a multimillion pound actress after all), but it wasn't. Instead it was realistic and quite warm  where she could have been annoying. The grumpy Finney is also good value and seems natural in the role. Eckhart is almost too good to be true but gives a likable performance and is a winning non-distraction.\n\nThe film benefits from the style that Soderbergh brings to it. It glides with the grace that he brought to Ocean's 11 and has the rich colouring that parts of Traffic had. His direction really adds to the film and makes the sum feel a little greater that the parts put together.\n\nOverall this may not be the legal thriller that you hoped for and it may move a great deal slower that I thought a Hollywood film would, but it is worth it. The film is patient and worth baring with and Roberts is actually pretty good in the lead! Enjoyable."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi440712729",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTRhNjI2NjEtZTdhMi00ZDkxLWI4MjYtMWU2ODU0MzExMmU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTRhNjI2NjEtZTdhMi00ZDkxLWI4MjYtMWU2ODU0MzExMmU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-22T13:35:57.041Z",
        "url": "https://www.imdb.com/video/vi440712729/"
    },
    "url": "/title/tt0195685/"
}