{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Daniels",
            "url": "/name/nm0001099/"
        },
        {
            "@type": "Person",
            "name": "Harve Presnell",
            "url": "/name/nm0696193/"
        },
        {
            "@type": "Person",
            "name": "Joey Albright",
            "url": "/name/nm0017020/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1913,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044718/"
        },
        {
            "@type": "Person",
            "name": "Jeff Daniels",
            "url": "/name/nm0001099/"
        },
        {
            "@type": "Person",
            "name": "Guy Sanville",
            "url": "/name/nm0764393/"
        }
    ],
    "datePublished": "2001-02-09",
    "description": "A macho man in a family on the eve of deer-hunting season must deal with the eldest son's curse of never having bagged a buck.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeff Daniels",
            "url": "/name/nm0001099/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk4MzcwNTA3NF5BMl5BanBnXkFtZTYwMDk0ODc2._V1_.jpg",
    "keywords": "hunting cabin,written and directed by star,chamber play,family drama,satire comedy",
    "name": "Escanaba in da Moonlight",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mike-925"
        },
        "dateCreated": "2001-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0180679/"
        },
        "name": "Da Yoopers Deer Hunt Their Way Into Our Hearts",
        "reviewBody": "Its a twisted family romance. The girls are kept mercifully and safely away from deer camp. If you're from the Rural Midwest you've heard it all, but you can stand hearing it again.\n\nJeff Daniels, actor, producer, writer and director of Escanaba in Da Moonlight, lives in the UP so he knows whereof he speaks. A lightbulb must have gone off in the Dumb and Dumber Co-star's head when he heard the dialogue in Fargo: \"Hey, they talk stupid in the Upper Peninsula of Michigan too! Voila, I got a idee for a film script!\"\n\nDaniels plays Rueben Soady, son of Albert (Harve Presnall), brother of Remnar (Joey Albright). The non-Soady of the Deer Camp Group is Jimmer Negominee played by Wayne David Parker. Jimmer has an enormous capacity for Linenkugels (thats regional beer, friends, from Chippewa Falls, Wisconsin) and any other alcohol you can furnish him free.\n\nAnything thats free is welcome in deer camp. Including porcupine p*** and home-brewed whiskey that can just as easily turn into maple syrple or treesap. Jimmer handles it all with equanamity.\n\nRueben has come to the threshhold of his 43rd birthday without offing a single \"Turdy Point Buck\" or any other kind either, in all those years of trying. In Wisconsin, the DNR is officially the Department of Natural Resources, but to hunters, it is \"Damn Near Russia\" in both states.\n\nBut I digress. Schoolchildren openly mock Rueben on the streets of Escanaba. In one dream sequence, Rueben sees himself at the Escanaba Football Game, clad only in long johns and enormous fur-flapped hat, being given the raspberries for his failure, by the entire fanbase of the Escanaba High School Football Team. The scoreboard reads Rueben O, Visitors 41.\n\nThe film has a serious problem. It needs to be opened up; the Soadys spend way too much time at that dopey deer camp with the two-holer out back. Its alright for Rueben and his Dad to sit side-by-side in the outhouse and try to solve the problems of the world. But what the movie needs is more scenes like the tavern dance, where 30 male hunters with pool cues sticking straight out from between their legs, attempt to mesh romantically with an equal number of mannish, flannel-shirted, jean-wearing women, bearing full rolls of Charmin between THEIR legs. We are given to understand this is one of the yearly Dear-hunting rituals that separate Yoopers above the Mackinac bridge, from the rest of us Charming Midwesterners.\n\nThe script for this film was certainly dreamed up by listening to the Musical Da Yoopers' CDs for ideas to use in the film. While sitting in the two-holer, Rueben dream sequences his Uncle- now deceased- who managed to shoot a ten pointer accidentally by firing his rifle over his shoulder at some lurking presence outside, a full twenty years earlier.\n\nWhen a game warden recently transferred from Detroit shows up at the Cabin, its four occupants tremble in fear; in Michigan during deer season, a game warden is God. So we're not surprised when the skinny warden casually disrobes and beds down in a lower bunk without so much as asking. Rueben Soady has persuaded the Deer Camp Occupants to cease eating their usual deer camp fare, pastys- I don't think I know what this is except simple paste, a staple of Da Yoopers of musical fame- in favor of a natural poultrice dreamed up by Rueben's indian maiden wife, who we see seldom, but always clad in the most politically incorrect costume-beaded buckskin dress, complete with headband and feather. Mrs. Soady's confection includes essence of Moose testicle but Negominee thinks its right up there with Gator-Ade.\n\nThere's a bumpy night before the First Morning. Rueben develops a bear holler and needs smelling salts of which there are none in deer camp. So one of Jimmer's notorious beer-farts becomes the substitute, only Jimmer can't provide one in a pinch. The notorious God EEAHEE demands a human sacrifice. The Soadys and Jimmer wake the Warden, douse him with Porcupine P***, and put him outside for the Game God in his smokey bear hat, t-shirt and shorts.\n\nComes the Dawn and Rueben takes his trusty rifle to the top of the hill where his father and brother have both refused to hunt with him, on accounta' his presence amounts to a curse. This time his long-deceased Grandfather appears to give advice on how to squeeze off a shot at a Fifty pointer- \"Fifty pointer, they ain't no such thing as no fifty pointer..,\" except the exceptional one Granpa brought down according to the Soady family bible record of the entire history of Soady deer-hunting, an event reported neither to the State of Michigan nor to the CBMA, the official trophy deer recognizing agency for the Free World.\n\nEscanaba is not a Great Film, but it is a great effort. By Daniels. He's created the first deer-hunting film. There should have been one Eons ago. This one is descended from a play written for Daniels' Purple Rose Theatre located in Michigan, where the filmstar lives.\n\nWhen Daniels showed a print to the Suits in the Tower in Hollywood, they had him thrown off the lot. So now he is gamely - a little pun, you won't mind!- peddling the Film from theater chain to theater chain, first in the Midwest, where he believes the audience will be most likely to understand. I can see him roaming from newspaper office to newspaper office wearing his trademark white trapdoor long johns and sporting his winchester, stubble beard and multi-flapper hat, seeking free publicity.Here's to you Jeff Daniels. The Secrets of the Midwest have remained hidden for almost an entire century. Its about time these bi-coastals got a smell of what we midwesterners is like.\n\nThe film needs a new screenplay with a lot more scenes shot in Escanaba and around the UP. The film needs its jokes more structured to top off better-written scenes. And it needs a cutback in farting and pineapple p*** jokes. Escanaba needs more characters in a variety of new settings. And it needs women, Lusty Women! The Film needs a better story with a beginning middle and end. Escanaba needs another $15 million in budget to be made properly. This primitive cut certainly cost less than $2 million. If this film is done right, it will be THE Deer Hunting Classic. You can take my word for it, I'm from the Midwest!"
    },
    "url": "/title/tt0180679/"
}