{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Gregory",
            "url": "/name/nm0339888/"
        },
        {
            "@type": "Person",
            "name": "Henry Silva",
            "url": "/name/nm0798328/"
        },
        {
            "@type": "Person",
            "name": "Valeria D'Obici",
            "url": "/name/nm0195799/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2836,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "alternateName": "Escape from the Bronx",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0137336/"
        },
        {
            "@type": "Person",
            "name": "Tito Carpi",
            "url": "/name/nm0139536/"
        },
        {
            "@type": "Person",
            "name": "Enzo G. Castellari",
            "url": "/name/nm0144758/"
        }
    ],
    "datePublished": "1985-01-18",
    "description": "A rag-tag group of people must fight extermination squads amid their ruined city.",
    "director": [
        {
            "@type": "Person",
            "name": "Enzo G. Castellari",
            "url": "/name/nm0144758/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDEwNTQ2YjMtNjY1NC00ZGEwLWI0OWMtMTg0YTM4Yjk5MWNlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "kidnapping,murder of reporter,killed in an explosion,flamethrower,gunfight",
    "name": "Fuga dal Bronx",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LanceManley"
        },
        "dateCreated": "2002-12-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089104/"
        },
        "name": "\"You can count on me!\"",
        "reviewBody": "Outstripping its predecessor by 3 score and ten this little beauty ranks with Hard Boiled for relentless, brutal action.\n\nDepending on which copy of this film you own it is either \"a few\" or \"ten\" years after Bronx Warriors and another sinister corporation (or it may be the same one with a different name as Thomas Moore is the boss again, but he has a different name too) is diddling with the denizens of the Bronx, this time by \"burning and gassing the last remnants in order to build the city of the future\". Understandably pissed off at this \"the murdering warrior gangs unite to defend their homeland sewer by sewer\" from the silver suited sadists that are roaming around wielding bombs, machine guns and flamethrowers. Henry Silva is leader of The Disinfestors and when knocking out several squads fails to halt the clean up, Trash and a crusading but hideous reporter Moon, decide to kidnap the GC Corporation president as a bargaining tool. A final assault involving The Disinfestors against everyone else rounds off the show.\n\nRemoving the loathsome martial arts from the first flick and also the tiresome expostion this move almost never relents and has an orgasmic final 15 minutes involving so many dead bodies that it defies belief. Trash (unarmed) taking on 3 heavily armed men with a helmet plus the scene where he trips up a couple with a conveniently placed drainpipe are cartoon-like in their energy and ludicrousness.\n\nMark Gregory has lost the mincing gait this time and looks like he really means it when he offs people (check his expression as he burns Disinfestors).\n\nThe only other bona fide returning character from part one is Carla Brait in a cameo as the Iron Men leader although the lack of continuity isn't a big deal as this film was quite clearly meant to stand alone and was only called Bronx Warriors 2 in the UK.\n\nThe theme score is cracking and hits home all through the set pieces. It seemed that a loose plot was formuated and Enzo Castellari decided daily to create ever more ambitious set pieces to fill time. The first ambush on a clean-up squad, the hostages rigged with bombs scene, Clark's kidnapping and the final scrap are pure energy.\n\nIt's not high art, it's dubbing is shite but it has a good-looking, hard as nails hero, a body count that is in the hundreds and easy-to-hate loathsome villains.\n\nNegative points: The ease with which they kidnap Clark; Little Strike; Trash's high explosive bullets.\n\nPositive points: Everything else\n\nJoy!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Escape From The Bronx\r\nSeveral years after the events of The Bronx Warriors, Trash, the former leader of the Riders gang is now a cynical loner, remaining in the Bronx and trading in stolen ammunition. The General Construction Corporation wishes to tear down the Bronx to turn it into \"the city of the future\", but to do this they need to clear the current population from the area and have employed a private squad of \"Disinfestors\" to burn, shoot and gas those that will not leave willingly. While the bums, vagrants and elderly prove to be easy prey, the warrior gangs of the Bronx are not prepared to go quietly.\r\nTHE BRONX WARRIORS TRILOGY (cert. 18) is released on DVD (£29.99) by Shameless Screen Entertainment.",
        "duration": "PT44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi488507161",
        "name": "Bronx Warriors II",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTI5ODI4NjAzN15BMl5BanBnXkFtZTcwMTM1ODU0Mw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTI5ODI4NjAzN15BMl5BanBnXkFtZTcwMTM1ODU0Mw@@._V1_.jpg",
        "uploadDate": "2010-05-11T05:37:31Z",
        "url": "https://www.imdb.com/video/vi488507161/"
    },
    "url": "/title/tt0089104/"
}