{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Ray Romano",
            "url": "/name/nm0005380/"
        },
        {
            "@type": "Person",
            "name": "Patricia Heaton",
            "url": "/name/nm0005004/"
        },
        {
            "@type": "Person",
            "name": "Brad Garrett",
            "url": "/name/nm0004951/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 73010,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0122201/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0112861/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002401/"
        },
        {
            "@type": "Person",
            "name": "Phil Rosenthal",
            "url": "/name/nm0742814/"
        }
    ],
    "datePublished": "1996-09-13",
    "description": "The comical everyday life of sports columnist Ray Barone and his dysfunctional family.",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGExOGM4NWEtNDRlYi00MjU4LTk3NzQtOTllYzgxOGYyNWUwXkEyXkFqcGdeQXVyMzU3MTc5OTE@._V1_.jpg",
    "keywords": "sports writer,suburb,sibling rivalry,sitcom,male protagonist",
    "name": "Everybody Loves Raymond",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fee_tambo"
        },
        "dateCreated": "2006-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115167/"
        },
        "name": "This series took me ages to get into",
        "reviewBody": "...but now I'm hooked, and I've even bought 5 DVD boxsets of it! Its weird because its both subtle AND sharp humour.\n\nIts about Ray Romano, a sportswriter who just wants a quiet life...but he has 3 kids (a girl and twin toddler boys) and Debra (his wife) who struggles to juggle housekeeping and being a mother because Ray just will do anything to stay out of her way and not help! Debra is not your typical sitcom mum. She's independent and opinionated, and a very good match for Ray - she keeps him in line!\n\nHis Italian American parents (Marie and Frank) and divorced 40 year old brother (Robert) stay in the same street and facing across from Ray & Debra's house. And they are never away from there - The parents are very loud, expressive, overbearing people, but they don't mean to be....It's just their way. The brother is quirky to say the least! he's 7 foot tall and has a voice like Eeyore from the winnie the pooh movies (he IS the voice from the cartoon). He has weird little habits and is a little obsessive compulsive and insanely jealous of his younger brother Ray. However, at heart they are good, caring people and the family are extraordinarily close...but you'd never know it by the drama and shouting that goes on all the time! This is where the comedy comes from....\n\nNow, I am married to an Italian man and I know from experience what Italian in-laws are like! so this might be why I find this so funny....watching Marie (Rays mum) is like watching my MIL (only its not so funny in real life, believe me!!)\n\nIf you like Seinfeld, King of Queens (another sitcom which took ages to grow on me), CLASSIC Woody Allen movies, the film Mambo Italiano or My Big Fat Greek Wedding, then you'll like this. Give it a go, watch more than one episode and you'll end up hooked like me - I promise!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from HBO Home Video",
        "duration": "PT17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3517251865",
        "name": "Everybody Loves Raymond: The Complete Ninth Season",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGE3OWU3N2QtZDc1Ny00NmNiLWJlYzMtY2Y1ZjIxZDIzNDZmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGE3OWU3N2QtZDc1Ny00NmNiLWJlYzMtY2Y1ZjIxZDIzNDZmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:02:26Z",
        "url": "https://www.imdb.com/video/vi3517251865/"
    },
    "url": "/title/tt0115167/"
}