{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Evgeny Kissin",
            "url": "/name/nm1189905/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "description": "A film by Christopher Nupen with the Russian master pianist who has taken the classical music world by storm. Evgeny Kissin not only has dazzling virtuosity and unmistakable star-appeal, his meteoric rise to the top of the interna...",
    "duration": "PT1H44M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTMyZjM4NGYtZTc5ZS00MWM2LTliYmQtMGNmMjFmMWI0ZTVkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "name": "Evgeny Kissin: Gift of Music",
    "original_info": {
        "id": "Evgeny Kissin: The Gift of Music_1999",
        "name": "Evgeny Kissin: The Gift of Music",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "standardmetal"
        },
        "dateCreated": "2004-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0303980/"
        },
        "name": "Remarkable!",
        "reviewBody": "Evgeny Kissin: The Gift of Music\n\nA Christopher Nupen Film (1999)\n\nOne of the most prodigiously gifted pianists of his generation, Kissin can seem like a very odd young man indeed. One of the virtues of this film is that it manages to bring him down to earth and show his humanity. His English is excellent though his speech is a bit odd. In interaction with his fans he seems to exude a surprising amount of warmth and almost superhuman patience.\n\nThere is an extended interview section in which Kissin is quite voluble about his musical gifts and attitudes. A scene with him playing the Schubert \"Trout\" Quintet in rehearsal shows that, though Gidon Kremer the violinist tells everyone to relax in the first movement, Kissin seems unable to relax to any extent. \n\nThe major part of the DVD is devoted to Kissin's Promenade recital at London's Albert Hall (the first solo one ever.) in 1997 with brief excerpts of each selection of the main program but all of the many encores he played after. And after a while it all gets to be too much with Kissin bowing in all directions (his \"playstation\" is in the middle of the audience!) running up the stairs into one of the exits, running back, bowing again, running off, then the rhythmic clapping and then his encore. During this time the pianist is sweating profusely and it is apparent that his white jacket is soaked as well.\n\nIt seems rather cruel to put him through all of that despite his youth but he is unfailingly cheerful throughout. And then he is again signing autographs when it is all over.\n\nThe pianist's control and accuracy are amazing and, in his chosen repertoire, he is superb.\n\nIn short, a most revealing film and highly recommended to all fans of the classical piano.\n\n9 of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0303980/"
}