{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Campbell",
            "url": "/name/nm0132257/"
        },
        {
            "@type": "Person",
            "name": "Sarah Berry",
            "url": "/name/nm0077670/"
        },
        {
            "@type": "Person",
            "name": "Dan Hicks",
            "url": "/name/nm0382830/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 169334,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047594/"
        },
        {
            "@type": "Person",
            "name": "Sam Raimi",
            "url": "/name/nm0000600/"
        },
        {
            "@type": "Person",
            "name": "Scott Spiegel",
            "url": "/name/nm0818547/"
        }
    ],
    "datePublished": "1987-03-13",
    "description": "The lone survivor of an onslaught of flesh-possessing spirits holes up in a cabin with a group of strangers while the demons continue their attack.",
    "director": [
        {
            "@type": "Person",
            "name": "Sam Raimi",
            "url": "/name/nm0000600/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWY3ODZlOGMtNzJmOS00ZTNjLWI3ZWEtZTJhZTk5NDZjYWRjXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "grindhouse film,evil dead,panties,1980s,cult film",
    "name": "Evil Dead II",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FatChino"
        },
        "dateCreated": "2005-09-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092991/"
        },
        "name": "The Sequel to the Ultimate Experience in Grueling Terror indeed",
        "reviewBody": "This is the type of film we really wish we made ourselves before some else thought of it. It's intelligent but not entirely complex ... entirely enjoyable yet a serious piece of film making ... everything adds up to cult status. It's the type of film your uninformed friends (or mine at least, I'm surely surrounded by fools) dismiss as trash without giving it a chance.\n\nRaimi showed us the thrills, chills and blackly tinged laughs he could bring about in the first in the series on a virtually non-existent budget. Here with just that little bit more he retreads old ground but everything still works ... probably more effectively too! Seeing some of props used and slightly off production values (the 'muppet' headless girlfriend in the shed, the demon head stuck to camera attacking Ash towards the end, Ted Raimi's ripped old lady from hell suit and the quickest of glimpses of set floor boards during one stage of shooting) shows how Raimi was still constrained by budget issues.\n\nSeriously though, who cares ... this film has 6 different colours of blood, some seriously funny slap-stick scenes (didn't think I'd say that anytime soon) and a chemistry between lead Campbell and director Raimi that let the jokes flow freely.\n\nCampbell proves himself a master of face contortion, self-harm as well as flipping himself over! So many classic scenes in such a short space of time ... my favourite being when Jake is dragged into the cellar and a torment of pink blood comes pumping out. The camera work is as dynamic and as fast paced as in the first outing, the shot of ash standing by the remains of the bridge at the start of film standing out for its grandness among otherwise less cinematic shots.\n\nThe film leads on nicely to the 3rd installment in the series with one-handed Ash getting sucked into another dimension to face the undead in jolly olde England (or something like that). It really is no wonder that the in-store geeks/pop-culture snobs of High Fidelty described Evil Dead II as the greatest movie of all time.\n\n'Groovey' indeed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 4",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2539306009",
        "name": "Evil Dead 2: Dead by Dawn",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjNhN2JiNTYtOTFhOS00YjlhLThlOWYtNWM1NjEwMTZiNDMwXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjNhN2JiNTYtOTFhOS00YjlhLThlOWYtNWM1NjEwMTZiNDMwXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-06T17:15:15.243Z",
        "url": "https://www.imdb.com/video/vi2539306009/"
    },
    "url": "/title/tt0092991/"
}