{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Madonna",
            "url": "/name/nm0000187/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Pryce",
            "url": "/name/nm0000596/"
        },
        {
            "@type": "Person",
            "name": "Antonio Banderas",
            "url": "/name/nm0000104/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 36482,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076240/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094483/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0502036/"
        },
        {
            "@type": "Person",
            "name": "Tim Rice",
            "url": "/name/nm0005358/"
        },
        {
            "@type": "Person",
            "name": "Alan Parker",
            "url": "/name/nm0000570/"
        },
        {
            "@type": "Person",
            "name": "Oliver Stone",
            "url": "/name/nm0000231/"
        }
    ],
    "datePublished": "1997-01-10",
    "description": "The hit musical based on the life of Eva Perón (Evita Duarte), a B-picture Argentinian actress who eventually became the wife of Argentinian president Juan Domingo Perón, and the most beloved and hated woman in Argentina.",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Parker",
            "url": "/name/nm0000570/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDNhZGZiMzYtNzkxNy00MGE0LWE4Y2QtOGIwOTM3ZmY5M2QwXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "argentina,argentine president,argentinian politics,actress,politics",
    "name": "Evita",
    "original_info": {
        "id": "Evita_1996",
        "name": "Evita",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmOtaku"
        },
        "dateCreated": "2005-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116250/"
        },
        "name": "Best role for Madonna",
        "reviewBody": "I used to think that there were a couple of absolutes in this world other than the standard issue ones. One is that I will always hate Andrew Lloyd Webber and another is that Madonna will never be a good actress. After seeing Alan Parker's 1996 musical \"Evita\" however, starring Madonna and featuring the music of Andrew Lloyd Webber, I have had to amend those two statements slightly.\n\n\"Evita\" tells the true story of Eva Peron, the wife of Argentina's former president (and dictator) Juan Peron. In a story that was ready-made for Hollywood, she started out as the illegitimate and poor daughter of a man who dies when she is very young, sleeps with a mediocre nightclub singer at the age of 15 in order to gain passage to Buenos Aires, and from there begins her struggle to reach whatever achievements her ambitions require (which is a lot). Using her body to gain important friends (because, frankly, she didn't have any acting talent) she becomes an actress and radio star before she meets Juan Peron, at the time, an up and coming politician. They get married and the two work to get him elected as the president of Argentina on the platform that \"they are workers too\". When he is elected, Evita's popularity grows even more, to the point where her dreams of becoming the vice president of the country could be realized, until she is stricken with cancer and dies, essentially with the image of a saint, at the age of 32.\n\n\"Evita\" is a gorgeous, lush film, full of thousands of extras, great location scenes and features a very talented cast. It acts almost as an incredibly big budgeted and elaborate music video, mainly because it features almost constant singing, and well, it stars one of the most visible music video stars of all time. Madonna finally found her part in this film, and no, it wasn't just easier because she didn't have a lot of speaking lines. It is clear that not only did she take voice lessons (which actually is true) because her voice quality was better than \"normal\", and has stayed that way since the making of this film, but she was able to knock off some decent dramatic moments. Banderas, though he spent a lot of the film looking pretty furious with the camera, doesn't have to prove any acting mettle (anyone who has seen him in an Almodovar film can attest to this) but did come up with a surprisingly good singing voice. Jonathan Pryce, who was curiously cast as Peron also did a good job, though his part was fairly minor, and even at that he was relegated to giving Evita a lot of loving looks. All in all, however, the slick production, some catchy music (I cannot believe I am actually saying that I actually really like a film featuring the music of the insipid, mainstream, gnome-like Webber) that is good enough to listen to extra-curricularly and performances that weren't bad made for a pretty good and very entertaining viewing.\n\nDon't get me wrong  there are more than a few eye-rolling moments in \"Evita\", but the good definitely outweighs the bad, exponentially. The story, while coherent, was pretty mediocre, and I found that I felt that there were some things that were glossed over or trivialized with a cute musical number. Admittedly, however, this IS a musical and you don't sign up for a hard-hitting knowledge fest when you watch one. This wasn't the first time I had seen this film, and yet I still end up getting so wrapped up in the action that I end up bawling a couple of times, and this viewing was no exception. More importantly, though, I didn't feel like a doofus when I recommended it as a movie that three guys and I should watch together, because while it's slick and a musical, (and therefore, traditionally, a chick film) there's enough compelling elements to the film that will keep some guys happy as well. Good job, Parker and thanks a lot for blowing two of the absolutes I normally stand by. 6/10 --Shelly",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2691284505",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjJhY2Y5NWEtZTc2NC00MDBiLTliNmItMjliMTAyYjYzNGI2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjJhY2Y5NWEtZTc2NC00MDBiLTliNmItMjliMTAyYjYzNGI2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-04T16:41:04.718Z",
        "url": "https://www.imdb.com/video/vi2691284505/"
    },
    "url": "/title/tt0116250/"
}