{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nigel Terry",
            "url": "/name/nm0856050/"
        },
        {
            "@type": "Person",
            "name": "Helen Mirren",
            "url": "/name/nm0000545/"
        },
        {
            "@type": "Person",
            "name": "Nicholas Clay",
            "url": "/name/nm0165551/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 63770,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0779514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001995/"
        },
        {
            "@type": "Person",
            "name": "Thomas Malory",
            "url": "/name/nm0540627/"
        },
        {
            "@type": "Person",
            "name": "Rospo Pallenberg",
            "url": "/name/nm0657853/"
        },
        {
            "@type": "Person",
            "name": "John Boorman",
            "url": "/name/nm0000958/"
        }
    ],
    "datePublished": "1981-04-10",
    "description": "Merlin the magician helps Arthur Pendragon unite the Britons around the Round Table of Camelot, even as dark forces conspire to tear it apart.",
    "director": [
        {
            "@type": "Person",
            "name": "John Boorman",
            "url": "/name/nm0000958/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Adventure",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmI4MDU0NDUtZTNmZC00YTYwLTk3NzgtMGFmYjg3N2VjODczXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "knight,knights of the round table,holy grail,arthurian legend,king arthur character",
    "name": "Excalibur",
    "original_info": {
        "id": "Excalibur_1981",
        "name": "Excalibur",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "davidmvining"
        },
        "dateCreated": "2020-01-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082348/"
        },
        "name": "John Boorman is a crazy person.",
        "reviewBody": "This is a film that needs to be watched differently from most films. It operates very differently from the more realistic bent that the vast majority of films lend themselves towards and leans very heavily into a much more formalistic approach. It's an effort to bring Romantic painting to life with an operatic feel, and if you can't get into that different style of reality, then the movie's going to just be funny. Buy into the hyper-reality, though, and you have an entertaining 140 minutes ahead of you.\n\nEverything about this film is big. Costumes entail men walking everywhere in full plate armor. Sets are huge and completely impractical. Performances reach for the rafters. The world is filled with magic and the implication of a huge dragon. It's very much of its own style, and the fact that Zach Snyder considers Excalibur his favorite movie makes just so much sense.\n\nIt's the traditional Arthurian legend filtered through the crazy mind of John Boorman. It goes beyond the formalistic stylistic approach to the story, but the inclusion of every weird factor of the original myths plays into Boorman's wheelhouse. Merlin using the magic of the dragon to disguise Uther to trick Igraine is a prime example. But Boorman also includes some extra-mythical elements like having Morgana be Mordred's mother and Arthur his father, creating an incestuous relationship that was never there before. It's rather fertile feeding ground for Boorman's insanity, and I'm really glad he used it.\n\nIt blows through the Arthurian legend, mostly propelled by Nicol Williamson's awesomely weird performance as Merlin, watching Uther father Arthur, Arthur claim the sword in the stone and rise to become king, the peace that follows, and the dissolution of that peace precipitated by the affair between Guinevere and Lancelot. Alongside is the rise of Morgana, her tutelage under Merlin, and her raising of Mordred. All of this is big and entertaining (if weird and uncomfortable at certain moments), but it's the late introduction of the Grail Quest that kind of derails the latter half of the film for me.\n\nThe Grail isn't mentioned until about 90 minutes into the film, and it's just very suddenly dropped in as a very important thing that needs to be found right then. Arthur is sick, the country is sick, and they need something to revive the nation and its king. Suddenly, \"Hey, Percival, go find the Holy Grail.\"\n\nThe Grail Quest feels really tacked on. There are some striking visuals like the actual vision of the Grail that Percival has and the image of Percival hanging from the tree because of where the Quest took him, but it's a sudden late introduction that actually doesn't come to fruition. Maybe if the Grail had been introduced earlier in the film it would have worked better, but as it is, it feels like the Grail is in the film because it's a common part of the Arthurian legend and not because there was a compelling reason to include it in this telling.\n\nOverall, though, the film is really quite an experience. Divorced from reality and existing in its own fantasy realm, it creates its own rules of behavior and sticks to them. It's really pretty from beginning to end, well using the Irish countryside (around John Boorman's house) with mise-en-scene that really evokes Romantic paintings. The performances, especially Nicol Williamson's as Merlin, fit well with the material, and it's an entertaining look into another reality that follows different rules from our own.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT2M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3679453209",
        "name": "Excalibur",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjg4ZmMzYjEtMzRjMi00ZTMwLWI4YjUtMGE3NmU5MDJmOGU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjg4ZmMzYjEtMzRjMi00ZTMwLWI4YjUtMGE3NmU5MDJmOGU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-30T03:16:38Z",
        "url": "https://www.imdb.com/video/vi3679453209/"
    },
    "url": "/title/tt0082348/"
}