{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chazz Palminteri",
            "url": "/name/nm0001590/"
        },
        {
            "@type": "Person",
            "name": "F. Murray Abraham",
            "url": "/name/nm0000719/"
        },
        {
            "@type": "Person",
            "name": "Anna Galiena",
            "url": "/name/nm0302105/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1273,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019117/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053253/"
        },
        {
            "@type": "Person",
            "name": "Alexander Stille",
            "url": "/name/nm0830239/"
        },
        {
            "@type": "Person",
            "name": "Peter Pruce",
            "url": "/name/nm0699136/"
        }
    ],
    "datePublished": "1999-10-16",
    "description": "Fact based story about the political battle that was waged against the Mafia in Sicily during the late 1980's and early 1990's. Chazz Palminteri plays Giovanni Falcone, a crusading prosecutor who tried to use money trails as a way...",
    "director": [
        {
            "@type": "Person",
            "name": "Ricky Tognazzi",
            "url": "/name/nm0865573/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGQ4YWYwZWQtODk0Yi00NWI1LTgzYWQtOWIyODEwNjM5YjA1XkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "sicily,mafia,true crime,based on true story,independent film",
    "name": "Excellent Cadavers",
    "original_info": {
        "id": "Excellent Cadavers_1999",
        "name": "Excellent Cadavers",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RJBurke1942"
        },
        "dateCreated": "2007-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0151734/"
        },
        "name": "See the documentary for the truth about the Mafia...",
        "reviewBody": "Why bother seeing a fictionalized account of such trauma and horror when the real McCoy is available as a documentary? I haven't seen this account, but I have seen the documentary produced by Stille in the same year as this.\n\nI have great admiration for Chaz Palminteri and F. Murray Abraham, two fine actors, whom I'm sure acquitted themselves well. Much more interesting, however, to find out how Stille unraveled the truth behind the assassinations of Falcone and Borsellino.\n\nI'd read about the efforts of those two martyrs as it all happened: press coverage at the time was quite good, and I was amazed at how those two judges managed to avoid death so often.\n\nBut, as we all know, that cowardly organization of Cosa Nostra aka the Mafia has seemingly unstoppable reach, right into the upper echelons of Italian government. And, Stille holds nothing back as he shows the connections between government officials of all types  including another judge  and the Mafia. There is even the strong implication that, after the trial and sentencing of 384 Mafia gangsters, rogue elements in the Italian government may have been involved in efforts to stop and kill Falcone and Borsellino.\n\nUnhappily, where there's money, there's always corruption. No society seems to be able to avoid that.\n\nWith the Mafia, however, the control of Sicily and Italian government seems complete, proving once again that everything changes, but nothing changes fundamentally.\n\nScenes in the documentary are not for kiddies, with many real dead bodies, a severed head, bits and pieces from bomb blasts  an absolute carnage. Maybe the commercial production had the same shots, but somehow I doubt it.\n\nIf you want the whole story  well, as much as you're ever gonna get  then see the documentary of the same name: Excellent Cadavers.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0151734/"
}