{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Greenwood",
            "url": "/name/nm0339304/"
        },
        {
            "@type": "Person",
            "name": "Elias Koteas",
            "url": "/name/nm0000480/"
        },
        {
            "@type": "Person",
            "name": "Don McKellar",
            "url": "/name/nm0001528/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20282,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005210/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093742/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Atom Egoyan",
            "url": "/name/nm0000382/"
        }
    ],
    "datePublished": "1995-03-24",
    "description": "A man plagued by neuroses frequents the club Exotica in an attempt to find solace, but even there his past is never far away.",
    "director": [
        {
            "@type": "Person",
            "name": "Atom Egoyan",
            "url": "/name/nm0000382/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2U3MmIyODktNGYzOS00NzYwLTlkMjEtNDcxOTlmZmNjZWNmXkEyXkFqcGdeQXVyMzU4ODM5Nw@@._V1_.jpg",
    "keywords": "cult film,public nudity,protective male,death of daughter,illegitimate daughter",
    "name": "Exotica",
    "original_info": {
        "id": "Exotica_1994",
        "name": "Exotica",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Gouda-3"
        },
        "dateCreated": "1999-04-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109759/"
        },
        "name": "Amazingly beautiful, haunting film",
        "reviewBody": "I can't remember seeing a film as intriguing, complex, and beautifully photographed as \"Exotica.\" I nearly didn't watch it because the video cover advertized it as an \"erotic thriller\" and the image on the front is of Mia Kirchner doing her strip-tease bit. Granted, \"Exotica\" centers around a \"gentleman's club\" of the same name, but to call this film a simple erotic thriller is to miss out on a lot, on too much.\n\n\"Exotica\" follows four seemingly unrelated storylines: a man sitting alone at a table in a strip club, another man smuggling exotic parrot eggs into the country (\"Exotica\" takes place in and around Toronto), two apparent strangers walking in a field of green, and a young girl who plays a flute in an empty house. Egoyan begins with these vastly different puzzle pieces then slowly, inexorably brings them together.\n\nAtom Egoyan is one heck of a masterful director. He is the epicenter of this cinematic symphony that leads carefully from movement to movement until the finale bursts forth in equal measure of catharsis, discovery, and tragedy. Plot to him is like tapestry weaving. He threads narrative, characters, time, and setting in such complicated iterations that one is at once nearly overwhelmed by the intricacy and awed at his skill, a testament to his brilliance as well as his belief that a film-going audience is actually intelligent.\n\nAt it's heart, \"Exotica\" is a tragedy of circumstances. Or better yet, a collision of tragedies of circumstances. Indeed, the film isn't so much about tragedy as it is about those who survive tragedy and the toll a single event can exact for the rest of the lives of those who survive. Exotica, the gentleman's club, serves merely as a focal point where all these individual tragedies radiate to.\n\nEqually haunting in all this is the music. Mychael Danna's score sets the film's tone: dark, \"exotic,\" deceptively simple but savvier than it lets on. Also worthy of note is the music in the club itself, a blend of American house funk and Middle Eastern tones, warbled in Arabic.\n\nI highly recommend this film. Ignore the naked women who sashay from time to time in front of the screen (difficult as that may be at times) in the scenes shot in the club. The really interesting stuff occurs at the margins of the film, as the gulf separating the storylines begin to vanish, and the final scene gives you the keystone to a horrifying clear vision of a sadness so overwhelming that no one in the film escapes unscathed."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi267361817",
        "name": "Exotica",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTlkYzI0YjAtNjc0ZS00MjhiLWE2Y2QtZGJkMzc5OTdjY2E3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTlkYzI0YjAtNjc0ZS00MjhiLWE2Y2QtZGJkMzc5OTdjY2E3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:20:18Z",
        "url": "https://www.imdb.com/video/vi267361817/"
    },
    "url": "/title/tt0109759/"
}