{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Claire Litton",
            "url": "/name/nm2368413/"
        },
        {
            "@type": "Person",
            "name": "Gene Wilder",
            "url": "/name/nm0000698/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 198,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0097779/"
        },
        {
            "@type": "Person",
            "name": "Brian Connelly",
            "url": "/name/nm1606925/"
        }
    ],
    "datePublished": "2005-09-13",
    "description": "Narrated by Gene Wilder (\"Young Frankenstein\", \"Blazing Saddles\" and \"Willy Wonka and the Chocolate Factory\"), \"EXPO - Magic of the White City\" brings the Chicago World's Fair to life. Experience the world of 1893 through a cinema...",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Bussler",
            "url": "/name/nm1345744/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA4NDgxMjM4M15BMl5BanBnXkFtZTcwMzU5MTkyMQ@@._V1_.jpg",
    "keywords": "white city,expo,midway,henry ford,belly dancing",
    "name": "EXPO: Magic of the White City",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KingProjector93"
        },
        "dateCreated": "2019-11-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0455940/"
        },
        "name": "Informative but uninspired",
        "reviewBody": "Past and future Classic Game Room host Mark Bussler enjoyed a secondary career of making direct-to-DVD documentaries during the 2000s. One such film covered the 1893 World's Fair, a grand and gaudy celebration of the achievements, and vices, of 19th century America and her global neighbours.\n\nNarrated by the sublime Gene Wilder, the film benefits from clear extensive research: Bussler shows us a wealth of archival material to paint a picture of the Fair. Photos, adverts, plans, sketches and even surviving artefacts like an Eidson phonograph. It's all fascinating... until you realize that's all there is. For a film, EXPO is decidedly non-cinematic and clearly made on a tight budget for a specific market at a specific time. Most of it, as another reviewer noted, plays out like a slick but undeniable Powerpoint presentation, which even Wilder's soothing delivery can't mask. What actual footage there is mostly flat stocks of animals or locations around present-day Chicago. There's a reenactment and a belly dancer, but not much else.\n\nWithout talking heads from relevant authorities, or much other footage to break it up, the documentary's pacing suffers for it and at nearly two hours is a bit long. By the end I certainly felt informed about the White City, but perhaps not as inspired or enthralled as I hoped to be, or Bussler likely intended. Worth checking out at least once for those with an interest in the era, but a pedestrian production for what was a celebration of human imagination.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0455940/"
}