{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Bean",
            "url": "/name/nm0000293/"
        },
        {
            "@type": "Person",
            "name": "Juliet Aubrey",
            "url": "/name/nm0041411/"
        },
        {
            "@type": "Person",
            "name": "Ralph Brown",
            "url": "/name/nm0114460/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 399,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0145745/"
        }
    ],
    "datePublished": "1999-11-11",
    "description": "An intense thriller starring Sean Bean who plays a former M-15 agent who after being wrongfully convicted of murdering his family, goes on the run to seek vengeance on those responsible in a world beyond the law.",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjU5N2U3NTAtNmVhMy00MTJkLWFmYTUtZTFhYTU4ZTRlZmY0XkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "tv mini series,innocent,murder,danger,on the run",
    "name": "Extremely Dangerous",
    "original_info": {
        "id": "Extremely Dangerous_1999",
        "name": "Extremely Dangerous",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hellodaves"
        },
        "dateCreated": "2012-07-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0205917/"
        },
        "name": "You've Bean Framed!",
        "reviewBody": "Extremely Dangerous is a Fugitive-type thriller starring Sean Bean (Patriot Games, Goldeneye). Bean plays a former secret service agent, convicted for the brutal murder of his wife and child, who escapes police custody and goes on the run in the Greater Manchester area. Byrne then goes undercover and takes down an organized crime syndicate and the corrupt authorities that set him up.\n\nI like Bean because he can do almost everything from big-budget blockbusters to Shakespearean stage work and parochial TV. Fans will like this one, but it is difficult to recommend that casual viewers to go out of their way to see this. Extremely Dangerous is well-over a decade old now and will not blow you away with its modest budget. There are lots of scenes needed tighter editing, and the whole thing seems to a drag a bit over four episodes. The northern accents may also be a problem for non-Brits.\n\nSaying that, there's a lot to really enjoy about Extremely Dangerous. The plot is strong and pretty plausible, the score was memorable, and the action was free of shaky-cam (since this only really came into fashion after 1999). Sean Bean's character moves through situations like a pro and does some really cool things: jumps from a intercity train as it slows on a bend; pickpockets a man in a clothes shop; steals a car from a long-stay car park; infiltrates lots of guarded buildings; beats up lots of thugs; and gets to point a gun at his ex-boss.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0205917/"
}