{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nick Nolte",
            "url": "/name/nm0000560/"
        },
        {
            "@type": "Person",
            "name": "Powers Boothe",
            "url": "/name/nm0000959/"
        },
        {
            "@type": "Person",
            "name": "Michael Ironside",
            "url": "/name/nm0000461/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8062,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094459/"
        },
        {
            "@type": "Person",
            "name": "John Milius",
            "url": "/name/nm0587518/"
        },
        {
            "@type": "Person",
            "name": "Fred Rexer",
            "url": "/name/nm0721009/"
        },
        {
            "@type": "Person",
            "name": "Deric Washburn",
            "url": "/name/nm0913346/"
        }
    ],
    "datePublished": "1987-04-24",
    "description": "A Texas Ranger and a ruthless narcotics kingpin - they were childhood friends, now they are adversaries...",
    "director": [
        {
            "@type": "Person",
            "name": "Walter Hill",
            "url": "/name/nm0001353/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjY0N2FjMjctY2QzYS00NWFiLTgwY2YtMzkwOGQyMGE0NDUyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "female topless nudity,female rear nudity,noir western,female nudity,time bomb",
    "name": "Extreme Prejudice",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2021-01-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092997/"
        },
        "name": "not exactly a Lifetime movie when you got Walter Hill and John Milius on your plate",
        "reviewBody": "Extreme Prejudice moves and unfolds just a like a Swiss watch, a well oiled and violent action movie that you can tell\" even though he only has a story by credit, is through and through a John Milius yarn. Walter Hills direct clear, muscular action, and a hell of a lot of fun to experience, but what I like the most is just how completely this is a modern western, and decidedly a character-based one at that. Nick Nolte has almost the same tough Grimace expression through the whole thing, but that's fine because then that gives plenty of space for Powers Boothe, Clancy Brown, Michael Ironside, Rip Torn, William Forsythe and everybody else to work there grizzly magic if that is what it can be called on the screen.\n\nIn particular Powers Boothe is a delightful antagonist, like others sweating at times like its going out of style but making it part of his menace, and at one key point snorting enough coke to make Scarface blush. As soon as you see him and Nolte together you know this is going to be whenever they reappear a great meaty \"I'm gonna emotionally and probably physically kick your ass\" scene.\n\nOne could say we've seen a lot of this before, matter of fact it's deep down a \"I got to hold up my Man code\" story, down to the love intetest (Maria Conchita, who thankfully is cast well and she gives a very good performance), and at its best feels like Son of Peckinpah, in particular with that climax. I'm at saying this movie reinvent the wheel, but the direction is always precise and exciting and the interplay and dialogue is sharp and occasionally very funny or just the right tone of humorous attitude and one-liners for this kind of mercenary, Western heights movie, and by the very end it almost feels like Milius and Hill are giving us the origin story of the modern Mexican cartel haha. It's a good one.\n\nAlso one last thing, did it feel like the climax of this movie is almost like John Milius was finally getting to do the climax of Apocalypse Now, now only if Willard and Kurtz knew and even were friends going back? Just a musing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi296091929",
        "name": "Extreme Prejudice",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTBkZGNlODAtN2ZhMC00ZDljLWEyZTItNWUzZmQwZmNlYjVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTBkZGNlODAtN2ZhMC00ZDljLWEyZTItNWUzZmQwZmNlYjVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:03:11Z",
        "url": "https://www.imdb.com/video/vi296091929/"
    },
    "url": "/title/tt0092997/"
}