{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve-O",
            "url": "/name/nm0828177/"
        },
        {
            "@type": "Person",
            "name": "Jarno Leppälä",
            "url": "/name/nm1385986/"
        },
        {
            "@type": "Person",
            "name": "Jarno Laasala",
            "url": "/name/nm1385892/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 369,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0101295/"
        }
    ],
    "datePublished": "2001-01-25",
    "description": "The original The Dudesons series before they got famous.",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGJhMGVjOWItNDMzMC00OTZhLWJlZTctNzI5ZWUyMTBhMGFkXkEyXkFqcGdeQXVyNjExODE1MDc@._V1_.jpg",
    "keywords": "stupidity,injury",
    "name": "Extreme duudsonit",
    "original_info": {
        "id": "Extreme Days_2001",
        "name": "Extreme Days",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Shaolin_Apu"
        },
        "dateCreated": "2005-04-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368493/"
        },
        "name": "Dude is an animal",
        "reviewBody": "The Extreme Duudsonit is what you get when you combine Bruce Lee with David Hasselhoff (as Knight Rider) and Finnish ski jumper Matti Nykänen. Four Finnish guys that are usually compared to Jackass and Dirty Sanchez are however a separate phenomenon, although every program claim to have its origins in skateboarding or snowboarding sub-cultures. Duudsonit themselves explain that they are just traditionally mad Finns  they speak broadly their own dialect and are very proud of their home district and they don't hide their sentimentalism. They have even designed their own shirts in accordance with local traditions!\n\nThe Extreme Duudsonit are also very popular performers on Finnish television and hosts in various events. It could even be said that they are respected, even though they have a fame of complete idiots. They claim that 'stupidity has no limits' and 'dude is an animal'. Their basic stunt is usually a downhill skiing from various places with any equipment you can think about. A car is often used as an engine to drag down a road various types of carriages, always someone of them as an outside-passenger. It should be emphasized that it is not only their stunts, but also their pre-stunt speeches that add to the entertainment value, like \"now we gonna see who's the boss in here\".\n\nIt is also fun to see how seriously they review their stunts, like: \"How is it possible that a house may burn?\" and \"Beware David Hasselhoff, here comes the new Knight Rider!\" These are just bad translations from their original speeches, for none of their four DVD's have any subtitles. About the language problems the boys have commented that \"The others will learn Finnish in one week.\" The boys are very skillful but injuries are also frequent. When somebody gets hurt, the camera goes into the hospital and shows how bad the injuries really are. This is also where duudsonit differ from the Jackass: viewers also see their misfortunes and tears, which makes them very human. And, of course, because they are the Extreme Duudsonit, hospital is never the end of story.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0368493/"
}