{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rufus Sewell",
            "url": "/name/nm0001722/"
        },
        {
            "@type": "Person",
            "name": "Devon Sawa",
            "url": "/name/nm0001701/"
        },
        {
            "@type": "Person",
            "name": "Bridgette Wilson-Sampras",
            "url": "/name/nm0933098/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5589,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0265744/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086487/"
        },
        {
            "@type": "Person",
            "name": "Timothy Scott Bogart",
            "url": "/name/nm0091579/"
        },
        {
            "@type": "Person",
            "name": "Mark Mullin",
            "url": "/name/nm0612355/"
        },
        {
            "@type": "Person",
            "name": "Michael Zaidan",
            "url": "/name/nm0952056/"
        }
    ],
    "datePublished": "2002-11-27",
    "description": "While filming an advertisement, some extreme sports enthusiasts unwittingly stop a group of terrorists.",
    "director": [
        {
            "@type": "Person",
            "name": "Christian Duguay",
            "url": "/name/nm0240995/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjgwYTFlNDMtMDNlNi00OWFiLTk0YjMtYzMxMzdmNjI3ZDEwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "snow adventure,time bomb,stunt woman,stuntman,timeframe 2000s",
    "name": "Extreme Ops",
    "original_info": {
        "id": "Extreme Ops_2002",
        "name": "Extreme Ops",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LebowskiT1000"
        },
        "dateCreated": "2002-12-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283160/"
        },
        "name": "Extreme Oops!!!",
        "reviewBody": "I couldn't resist with that one line summary above. Actually this film wasn't a total stinker. It had some good points, a lot of low points as well, but still some good stuff to be seen.\n\nI thought the story was actually a rather interesting idea. It could have definitely been a great movie, with the right director. I did like some of Christian Duguay's work (\"The Art of War\" and \"Screamers\"), I'm not really sure what happened here. I want to blame the writing and the editor...but I'm sure that the director is also to blame here. Speaking of editing, there was some HORRIBLE editing in this film. There were a few scenes where I couldn't help but ask myself \"What the heck was that?!?!\"\n\nThe characters in the film were all pretty good ideas, just not executed correctly. The two characters that were supposed to be super adrenaline junkies were good ideas, but weren't done justice. I'm not saying the acting was horrible or anything like that, I'm just saying that some of the things they were doing didn't look \"cool\", just plain stupid!!! There were a few stunts that they did that were really cool though, so it wasn't a total bust. I did like the snowboarding off the back of the train, that was kind of cool.\n\nThe action in the film was actually really good at times. But, it was very often short-lived. I was shocked how short \"the chase\" in the film was between the terrorists and the good guys. At the end of the film, I was thinking \"That's it???\" ...And as for the actual final moments of the film...well, let's just say it could have been better.\n\nMost of the actors did a fine job. Rufus Sewell did a fine job as always. Ever since I saw him in \"Dark City\" I've really liked his acting and tried to follow his work. Devon Sawa did a surprisingly good job, I usually don't like his acting, but did a pretty good job in the film. Bridget Wilson did a great job with her role and looks absolutely fantastic throughout the film. She is reason enough to watch the film. Jana Pallaske is a new face to me, she did an ok job with her role. I didn't think she was spectacular, but she did pretty good job given the material (and is quite the looker as well...her lips remind me of Angelina Jolie).\n\nAll in all, I can't in good conscience recommend you go see this film in the theater unless you just want to see some cool snowboarding/skiing footage. I strongly urge you not to pay a full price ticket, see this one at a matinee if you absolutely must. Otherwise, wait till video. Thanks for reading,\n\n-Chris",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4275634457",
        "name": "Extreme Ops",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWM1MzQxZmItNmRhMC00OTA2LTkyMzQtOGJjODg2NjcwMTlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWM1MzQxZmItNmRhMC00OTA2LTkyMzQtOGJjODg2NjcwMTlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-07-14T03:11:22Z",
        "url": "https://www.imdb.com/video/vi4275634457/"
    },
    "url": "/title/tt0283160/"
}