{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mary Kay Place",
            "url": "/name/nm0005316/"
        },
        {
            "@type": "Person",
            "name": "Nick Stahl",
            "url": "/name/nm0001763/"
        },
        {
            "@type": "Person",
            "name": "Chris Freihofer",
            "url": "/name/nm0293803/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1233,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001200/"
        },
        {
            "@type": "Person",
            "name": "Tim Blake Nelson",
            "url": "/name/nm0625789/"
        }
    ],
    "datePublished": "1997-10-17",
    "description": "We see two stories told over four time lines, which wind down to a devastating ground zero collision, as we watch a double tragedy unfold in a small Oklahoma town. The two stories are told out of normal time sequence, showing us b...",
    "director": [
        {
            "@type": "Person",
            "name": "Tim Blake Nelson",
            "url": "/name/nm0625789/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5MDM4NTM0MV5BMl5BanBnXkFtZTgwNTk0NTM2MTI@._V1_.jpg",
    "keywords": "ex convict,murder of a nude woman,sheriff,voice over narration,sex",
    "name": "Eye of God",
    "original_info": {
        "id": "Eye of God_1997",
        "name": "Eye of God",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gusalden"
        },
        "dateCreated": "2000-09-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116261/"
        },
        "name": "A tragic story that asks, \"Why, God?\"",
        "reviewBody": "Eye of God, a suspenseful and painfully real story as narrated by Hal Holbrook who plays the town sherriff of an oil town in Oklahoma. He speaks of the story of Abraham & Isaac from the Old Testament with an air of sad resignation and cynicism. His faith in God has been eroded by a harrowing event and he is obviously bitter over it. I would venture to say the screenplay writer has a bone or two to pick with God, and having just seen this film, it's easier than ever for me to say rightfully so. This movie asks over and over again, \"Why, God?\"\n\nA local 14 year old boy has just been found by the local cops, in the woods by the lake, completely covered in blood, and in a state of speechless shock. The blood is not his. It's quite evident that he's been witness to a murder.\n\nAs the story unfolds, it becomes quite evident early on in the movie what the outcome of this tragic story is going to be, but this doesn't detract from the suspense created by the film one iota. Wonderfully directed, the story is presented in fragmented pieces of time and space, like the pieces of a jig saw puzzle. You may already have a good idea what it's going to look like when it's all been put together, but the process of putting the pieces together is what keeps the viewer intently interested all the way to the seemingly inevitable conclusion.\n\nA very well told story, socially relevent, well directed, well cast and wonderfully acted. Martha Plimpton is fabulous in her role as the carrier of the eye of God. 9.5/10"
    },
    "url": "/title/tt0116261/"
}