{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Cruise",
            "url": "/name/nm0000129/"
        },
        {
            "@type": "Person",
            "name": "Nicole Kidman",
            "url": "/name/nm0000173/"
        },
        {
            "@type": "Person",
            "name": "Todd Field",
            "url": "/name/nm0276062/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 350819,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038089/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025383/"
        },
        {
            "@type": "Person",
            "name": "Stanley Kubrick",
            "url": "/name/nm0000040/"
        },
        {
            "@type": "Person",
            "name": "Frederic Raphael",
            "url": "/name/nm0710698/"
        },
        {
            "@type": "Person",
            "name": "Arthur Schnitzler",
            "url": "/name/nm0774217/"
        }
    ],
    "datePublished": "1999-07-16",
    "description": "A Manhattan doctor embarks on a bizarre, night-long odyssey after his wife's admission of unfulfilled longing.",
    "director": [
        {
            "@type": "Person",
            "name": "Stanley Kubrick",
            "url": "/name/nm0000040/"
        }
    ],
    "duration": "PT2H39M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzMzZjcyNzEtZjE2OC00Yjk3LWExOGItODdhNzhkZTdmM2M0XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "orgy,password,sex party,prostitute,sexual fantasy",
    "name": "Eyes Wide Shut",
    "original_info": {
        "id": "Eyes Wide Shut_1999",
        "name": "Eyes Wide Shut",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CinemaClown"
        },
        "dateCreated": "2015-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120663/"
        },
        "name": "The Final Masterpiece From The Greatest Filmmaker Of All Time",
        "reviewBody": "From the director behind influential masterpieces like The Killing, Paths of Glory, Spartacus, Lolita, Dr. Strangelove, 2001: A Space Odyssey, A Clockwork Orange, Barry Lyndon, The Shining & Full Metal Jacket, Eyes Wide Shut marks the final entry in the decades-spanning, unprecedented & extraordinary filmmaking career of Stanley Kubrick. And just like all of his reappraised works, is a classic that unveils more of its intricate layers on multiple viewings.\n\nSet in New York City, Eyes Wide Shut tells the story of Dr. William \"Bill\" Harford whose life spirals out of control when his wife tells him about an erotic fantasy she had about another man which shatters his faith in her. Unable to get the image of his wife & the other man out of his head, he embarks on a night-long adventure during which he comes extremely close to cheating on his wife & also infiltrates a quasi-religious sexual ritual at a country mansion after learning about it from a friend.\n\nCo-written, produced & directed by Stanley Kubrick, Eyes Wide Shut is a film about sexual desires that's jam-packed with symbolism & metaphorical elements. The entire film exhibits a sexually charged atmosphere and every single character inhabiting it has nothing but sex on his or her mind. Kubrick's direction makes efficient use of all his trademarks and just like before, he manages to push forward the existing boundaries of the medium while adding a few innovative tricks into the filmmaking manual in the process.\n\nThe screenplay smears the plot with multitudes of themes & insinuations, the story unfolds in a slow, methodical manner, the leading characters have an in-depth complexity which is wonderfully illustrated by the master storyteller, each sequence is meticulously detailed & technically refined, and it has a lot to say about sex, infidelity, physical relations, desires & fantasies. However, dialogue isn't one of its strengths for every time anyone says anything, the other character repeats the same as a question which becomes annoying after a while.\n\nThe technical aspects always score very high marks in Kubrick films and Eyes Wide Shut is no exception. The set pieces are gorgeously rendered, extensively detailed & beautifully lit. Cinematography encapsulates the entire picture with a bizarre, dream-like ambiance which goes on to further amplify the overall experience while also intensifying its erotic attributes. The use of colours is noteworthy while lighting here is a work of perfection. Its 159 minutes of runtime & deliberately slow pace may feel like a challenging ordeal but it never becomes an issue once the drama sets in.\n\nThe incorporation of classical songs to compliment the unfolding drama continues in Eyes Wide Shut and all the musical arrangements are wisely chosen & carefully infused into the storyline. Coming to the performances, the cast comprises of Tom Cruise, Nicole Kidman, Sydney Pollack, Marie Richardson & Todd Field. Even though both Cruise & Kidman put in commendable effort into their respective roles of Mr. & Mrs. Harford, it's actually their on- spot chemistry that makes them click so well, and while there are no definite stand-outs, the contribution by its entire cast only works in the film's favour.\n\nOn an overall scale, Stanley Kubrick's Eyes Wide Shut may not be as pathbreaking as most of his masterpieces but it's nonetheless a deeply fascinating meditation on sexual relations and despite its cynical tone, manages to be an erotic, enthralling & engaging thriller. While the plot is heavy & explicit in sexual content, approaching it as a sex-romp cinema won't do enough justice for Kubrick digs much deeper into the primordial aspects of human nature to put up an exquisite looking tale that's aesthetic, artistic & unlike anything before or since. It may not be Kubrick's greatest, but it's still a genre masterpiece. Thoroughly recommended. Multiple viewings advised."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2812477721",
        "name": "Eyes Wide Shut",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjRjMDZmMGMtMzZjMy00Y2RjLWFiYTEtNjZiN2RlN2Y1ZWJjXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjRjMDZmMGMtMzZjMy00Y2RjLWFiYTEtNjZiN2RlN2Y1ZWJjXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg",
        "uploadDate": "2008-04-11T13:56:22Z",
        "url": "https://www.imdb.com/video/vi2812477721/"
    },
    "url": "/title/tt0120663/"
}