{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        },
        {
            "@type": "Person",
            "name": "Oja Kodar",
            "url": "/name/nm0462648/"
        },
        {
            "@type": "Person",
            "name": "François Reichenbach",
            "url": "/name/nm0717025/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17426,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055813/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054085/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004791/"
        },
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        },
        {
            "@type": "Person",
            "name": "Oja Kodar",
            "url": "/name/nm0462648/"
        }
    ],
    "datePublished": "1975-03-12",
    "description": "A documentary about fraud and fakery.",
    "director": [
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        },
        {
            "@type": "Person",
            "name": "Gary Graver",
            "url": "/name/nm0004372/"
        },
        {
            "@type": "Person",
            "name": "Oja Kodar",
            "url": "/name/nm0462648/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDgzMWIyNDQtNjBmMy00MTI3LWFmZjgtODkxYzRiODE1OTg1XkEyXkFqcGdeQXVyMTExMTE3NDg5._V1_.jpg",
    "keywords": "fraud,painter,cigar smoking,france,female full frontal nudity",
    "name": "F for Fake",
    "original_info": {
        "id": "F for Fake_1976",
        "name": "F for Fake",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zetes"
        },
        "dateCreated": "2001-11-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0072962/"
        },
        "name": "Not a major Welles film, but a heck of an entertaining one!",
        "reviewBody": "F for Fake is perhaps Orson Welles' least famous film. It's easily eclipsed by such masterpieces as Citizen Kane, The Magnificent Ambersons, and Touch of Evil. Also, the lesser-known masterpieces The Trial and Chimes at Midnight, which are as good as the previous three. Still, F is quite brilliant in itself, even if it's little more than an exercise in stylized editing. In fact, there's a little more to it than that. F is ostensibly a semi-documentary about forgery and fakery. Its main subjects are Elmyr, a pre-eminent art forger, Clifford Irving, who faked the Howard Hughes biography, Orson Welles himself briefly (chiefly the War of the Worlds broadcast), and Elmyr's precursor, another Hungarian forger who is supposedly the best forger who ever lived. There is a lot of play in the film about what is real and what is not. A lot of the documentary footage appears to be real, and some is open to question. \n\nAll in all, the film's subjects are enormously interesting, especially Elmyr. It's simply amazing watching him effortlessly, and I MEAN EFFORTLESSLY, reproducing the paintings of Picasso and Matisse. Elmyr gloats how no expert on Earth could tell his fakes apart from the real thing.\n\nClifford Irving's segments are somewhat less fascinating, but still worthwhile. His first major success was the biography of Elmyr (which was honestly produced), so Welles intermingles his story, more or less, into Elmyr's. After that, Welles talks a lot about Howard Hughes.\n\nThe final segment, about a woman who seduced Picasso into producing portraits of her which she then seduced away from him, is mostly re-enacted. Since it is not made up of documentary footage, but re-enacted, it proves very interesting. Welles himself participates in the segment, where he role plays the part of the dying old forger, with the girl, the real-life Picasso seductress, playing Picasso, who came to Paris to root out the master art forger who produced some original \"Picassos.\" Once again, Welles puts on yet another performance of a lifetime. What was it at this point, his one thousandth? He also has a great scene at the beginning of the film putting on a magic show for a little boy.\n\nI deliberately skipped the part of the film, quite short, where Welles talks about himself. He speaks about War of the Worlds and Citizen Kane, a forgery of William Randolph Hearst's (and Marion Davies') life. He claims that one of his original ideas was to do a pseudo-biopic of Howard Hughes. I've never heard of it. Is he making this up, too?\n\nThere is also, though, this sad undertone of the film about Welles' own life. He seems to be wondering whether it was all worth it. He talks about forging a career as a Broadway star in order to get work in Ireland. But wasn't he? He was a director, at least, but wasn't he also a stage actor? If not, he was always a famous and successful film actor, even in movies that he didn't direct himself. He speaks of his War of the Worlds radio production in very demeaning terms, joking that, if it were produced for a medium other than radio, he would have been laughed at (he shows clips of, I believe, Earth vs. the Flying Saucers, or one such 1950s UFO movie, where UFOs are wasting Washington D.C., clips which he also runs under the closing credits). \n\nAs for the film's style, it has very complex but sometimes annoying editing, very rapid. I would suspect that even people raised on MTV might get a little dizzy watching it. There is also a lot of repetition of bits of interviews, clips, and the like. It's all in fun, but it also can't help but seem a bit silly. What it really ends up doing is subtracting the illusion of abundant substance. Oh well. Like I said, it's enormously entertaining. I think all of Welles' films were, really. People tend to forget that this master crafstman, rightfully thought of as one of the pre-eminent artists of the medium, was, first and foremost, an entertainer. That's not something you can say about the majority of cinematic auteurs. 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A documentary about fraud and fakery.",
        "duration": "PT2M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1289011993",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2Q4YmQyZDMtZDZiYi00M2Q3LTkzOTgtYjA0YWU5OGVjOGU0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2Q4YmQyZDMtZDZiYi00M2Q3LTkzOTgtYjA0YWU5OGVjOGU0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-25T20:19:13.276Z",
        "url": "https://www.imdb.com/video/vi1289011993/"
    },
    "url": "/title/tt0072962/"
}