{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dennis Christopher",
            "url": "/name/nm0160550/"
        },
        {
            "@type": "Person",
            "name": "Tim Thomerson",
            "url": "/name/nm0859772/"
        },
        {
            "@type": "Person",
            "name": "Gwynne Gilford",
            "url": "/name/nm0318522/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4636,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0309863/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0311848/"
        },
        {
            "@type": "Person",
            "name": "Vernon Zimmerman",
            "url": "/name/nm0956796/"
        }
    ],
    "datePublished": "1980-10-14",
    "description": "A shy, lonely film buff embarks on a killing spree against those who browbeat and betray him, all the while stalking his idol, a Marilyn Monroe lookalike.",
    "director": [
        {
            "@type": "Person",
            "name": "Vernon Zimmerman",
            "url": "/name/nm0956796/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzM3ZGFhNjktNGRlNy00ZmEyLWE0NWMtYjBkZmIzM2RjM2E5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "blonde,loner,nerd,obsession,psychopath",
    "name": "Fade to Black",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "matt-282"
        },
        "dateCreated": "2000-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080711/"
        },
        "name": "A good idea, but poorly executed.",
        "reviewBody": "I first saw this film a few years ago which details a geekish movie buff that lives in a fantasy world of movies. Dennis Christopher plays Eric Binford, a young man living with his crippled, domineering aunt, and who works as a studio film delivery boy for a living. The nerd-like Eric gets teased and abused by his aunt, his nagging boss, and his co-workers. Seeing that this is a horror film, you know it's only a matter of time before Eric goes over the deep end and beings killing people, but the twist is he kills them by copying various death scenes from his favorite movies. With his studio connections, he dresses up as his favorite characters, (Dracula, the Mummy, etc.) for the killings.\n\nAlthough we can relate to Eric Binford as a troubled soul, his character is not very sympathetic for it's not hard to see the reason why nobody likes Eric. With the exception that he knows a lot about movies, underneath he is just a hollow, chain-smoking, ill-tempered, clod. A subplot which includes a police psychologist tracking Eric's moves comes off as excess baggage and even the psychologist himself is not likeable either. In fact with the exception of the actress who plays the Marilyn Monroe lookalike, every character in the film is annoying, obnoxious, loud, selfish, mean-spirited and that hurts the film.\n\nI think it could have been a lot better if it was made by more professional filmmakers other than talented amateurs. It was a good idea for a movie, but not well made. Although the storyline is good, some of the plotlines are not believable, the violence and special effects for the killings (mostly shootings) look cheep and phoney, and the editing is poor. But worth a look if you're a fan of the movies and just want to see some clips of your favorite B-movies, oafers and classic horror films. This is Dennis Christopher's show and he takes hold of it and doesn't let go. Probably his finest hour-and-a-half."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi771670297",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDNlYzUyYjctOTQ1MS00NGM3LTk0ODgtN2Y0MGIzMzFjNTIxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDNlYzUyYjctOTQ1MS00NGM3LTk0ODgtN2Y0MGIzMzFjNTIxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-21T23:14:21.405Z",
        "url": "https://www.imdb.com/video/vi771670297/"
    },
    "url": "/title/tt0080711/"
}