{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Shelley Duvall",
            "url": "/name/nm0001167/"
        },
        {
            "@type": "Person",
            "name": "John Achorn",
            "url": "/name/nm0009854/"
        },
        {
            "@type": "Person",
            "name": "Patrick DeSantis",
            "url": "/name/nm0220885/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2355,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0118435/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0306113/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091983/"
        }
    ],
    "datePublished": "1982-09-11",
    "description": "A miscellany of numerous classic fairy tales' adaptations.",
    "genre": [
        "Adventure",
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWI0NmMwOWQtMzdjZi00N2YyLTkxZTgtNDAxMmY4NzcyZDQ1XkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1_.jpg",
    "keywords": "hosted television series,camp,cult following,fairy tale fantasy,anthology",
    "name": "Faerie Tale Theatre",
    "original_info": {
        "id": "Faerie Tale Theatre: The Tale of the Frog Prince_1982",
        "name": "Faerie Tale Theatre: The Tale of the Frog Prince",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "turboman2814"
        },
        "dateCreated": "2001-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0199214/"
        },
        "name": "The best",
        "reviewBody": "i dont know why but i always used to call this the Krofft Supershow of the 80's. maybe that is pushing it but anyone who saw this show would not disagree the imagination and fun of this series. Each episode was roughly an hour long and each episode dedicated to diferent Fairy Tales starring some of the biggest names in the busness. The show was produced, narrated and opened by Shelly DuVaul. Its witty writing and good acting were a guaranteed hit. the show ran from 1982 to 1987 with random syndications all over the place and was released on video by Playhouse(which arguably had the coolest beginning), CBS fox and Raz ma Taz or something like that. The show had some of the biggest directors like Francis Ford Coppola(Rip Van Winkle)and Tim Burton(Alladin and his Wonderful Lamp) directing some of the biggest stars such as\n\nTatum O'Neal as goldilocks, Billy Crystal as Larry, the 3rd Pig, Robin Williams and Terri Garr in The Frog Prince, Jeff Goldblum as The Big Bad Wolf, Vinent Price as the magic mirror in snow white, Gregory Hines and Ben Vereen in Puss in Boots, Elliot Gould, Jean Stapleton and Dennis Christopher in Jack and the Beanstalk, Valerie Bertinelli, Lenard Nemoy, Robert Carradine and James Earl Jones in Alladin, Matthew Broderick and Jennifer Beals in Cinderella, Ricky Shroder and Joan Collins in Hansel and Gretal, Carrie Fisher as Thumbelina, Eric Idle in the Pied Piper of Hamlin, Carl Riner, James Belushi, Michael Richards and Paul Reubens in Pinnochio, MalcomMcDowell and Mary Steinburgen in Little Red Riding Hood, Pam Dawber as the Little Mermaid, Shelly Duvaul, Herve` Vilachez and Ned Beatty in Rumpelstiltskin, Art Carney and Alan Arkin in The Emperors New Clothes, Mick Jagger in The Nightingale, Liza Manelli in the Princess and the Pea, Howie Mandell in The Princess Who Had Never Laughed, Christopher Reeves in Sleeping Beauty, Lee Remick as the Snow Queen, Elizabeth McGovern as Snow White and Harry Dean Stanton as Rip Van Winkle.\n\nAnd there was many more than that. that was basicly the run down of each episode and the bigger stars in each one. i used to have all 26 episodes on video but now am down to about 15. with the re-release of i think 12(plus a mail away princess who had never laughed) by Raz Ma Taz you shouldnt have too much of a problem obtaining the better ones. Blockbuster has a handful too. I highly recommend checking these out. You may just love these more than your kids. This show is perfect for the young and the young at heart. I cant recommend it enough."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Faerie Tale Theatre: Hansel And Gretel",
        "duration": "PT1M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3926179097",
        "name": "Faerie Tale Theatre: Hansel And Gretel",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzg3MGU0NjUtN2UwMi00MDA3LWE4MmUtODk3NTgxODgxY2EzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzg3MGU0NjUtN2UwMi00MDA3LWE4MmUtODk3NTgxODgxY2EzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-12T06:03:32.440Z",
        "url": "https://www.imdb.com/video/vi3926179097/"
    },
    "url": "/title/tt0199214/"
}