{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dick Morris",
            "url": "/name/nm1653884/"
        },
        {
            "@type": "Person",
            "name": "Zell Miller",
            "url": "/name/nm1722647/"
        },
        {
            "@type": "Person",
            "name": "Ed Koch",
            "url": "/name/nm0462292/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3698,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065909/"
        },
        {
            "@type": "Person",
            "name": "Eileen McGann",
            "url": "/name/nm1761053/"
        },
        {
            "@type": "Person",
            "name": "Dick Morris",
            "url": "/name/nm1653884/"
        },
        {
            "@type": "Person",
            "name": "Lee Troxler",
            "url": "/name/nm1761133/"
        }
    ],
    "datePublished": "2004-10-05",
    "description": "A documentary which refutes and debunks \"facts\" made by Michael Moore in his hit film Fahrenheit 9/11 (2004).",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Peterson",
            "url": "/name/nm0676992/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NzMwNTIwMF5BMl5BanBnXkFtZTYwODg5NjY2._V1_.jpg",
    "keywords": "rebuttal,lie,propaganda,conservative politics,right wing",
    "name": "Fahrenhype 9/11",
    "original_info": {
        "id": "FahrenHYPE 9|11_2004",
        "name": "FahrenHYPE 9/11",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mkfreeberg"
        },
        "dateCreated": "2004-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0427228/"
        },
        "name": "Consider this...",
        "reviewBody": "There's this dead guy lying in the morgue with a bullet in his chest. I think you might have been the one who shot him. The guy's wife agrees with me. So does the District Attorney.\n\nSo what do we do?\n\nIn the world of Michael Moore, he would be allowed to file a 'Friend of the Court' briefing on celluloid and your guilt or innocence would be decided by that alone. But in this country, we have a trial. The prosecution presents its case, and then the defense calls out errors in the prosecution's logic, problematic witnesses and inconsistencies in the timeline. Then the prosecution gets to call out how the defense is taking things out of contextback and forth it goes.\n\nThe DA is not supposed to be objective. If he becomes aware of something that would suggest your innocence, he is not obligated to come forward with it.\n\nThe defense is also biased. If he knows you shot the guy, he's not supposed to give the evidence to the court or the prosecution.\n\nSo both parties are expected to work toward a singular goal: Getting the outcome they want. It is impossible for both of them to achieve this. This is not a perfect way to get to the truth, but it's the very best way there is. So all the Michael Moore fans out there whining and sniveling about 'the 'no terrorist threat' remark was taken out of context' and 'FahrenHYPE has become exactly what it decries' are whistling in the wind.\n\nWhat this film did was yank Michael Moore out of the 'judge's' chair, and reduce him to being just one of two diametrically opposed advocates. This is good. Most of us, and I do mean nearly all thinking people who were paying attention, are far more comfortable with Moore in the role of one of the advocates, instead of him simply telling people what to think. For one thing, this makes him truly accountable for the factual distortions in his material, regardless of whether the distortions were intentional or not. So liberals, it might make you look good to your fellow liberals to go on about 'it became exactly what it's complaining about' but this idea misses the point: Moore has freedom of speech, and so do people who disagree with him.\n\nWhat's written above deals with how FahrenHYPE affects the political dialog in our nation. What is written below, deals with quality and whether it's worth seeing.\n\nWell, the election is over, so this is a peek in the rear-view mirror but you already know that. The film has been attacked for being a mouthpiece of conservatives, but this is incorrect. It's very obvious someone has gone to considerable trouble to recruit democrats into the project. This is powerful. Here is Clinton's political adviser, a distinguished senator from Georgia, a school principal who didn't vote for Bush, and a famous former mayor of New York. All Democrats, and all of them taking considerable time and trouble to appear in a documentary refuting the work of Michael Moore, narrated by a liberal Hollywood actor.\n\nAfter the film shoots down point by point the issues that Fahrenheit was trying to raise, you'll see a pattern emerge: Michael Moore has a tactic of presenting only the side of the story he wants to present. There is no big surprise here, after all this is something we 'know' about documentaries. The thing of it is, though, we may 'know' of the tactic but it is difficult to achieve a reckoning of how much damage this can do to the truth, or how convincing a documentary can be when the material therein is deceptive. This is going to come as a surprise to the Michael Moore fans, especially to the ones who have been memorizing the Fahrenheit arguments and repeating them word for word in the e-mail, thread postings, and chat rooms. This is why (see above) you want to have two diametrically opposite advocates each attacking the weaknesses in the arguments of the other, when you really want to learn the truth.\n\nAnd you should let that process go for awhile, before repeating what someone said.\n\nI suspect many of the Michael Moore fans who say they didn't like this film, are quietly undergoing a subtle change in their habits of parroting the Fahrenheit arguments wherever they can. They may not like the direction in which this film leaned, and they'll never admit to anyone they learned a valuable lesson, but learn it they did. It can be hazardous to willingly become a walking sandwich board for someone else, especially someone with as fragile a reputation for telling the truth as Michael Moore.\n\nSo yes it's worth seeing. If you're prejudiced against Michael Moore, you probably have a lot of liberal buddies constantly badgering you about 'did you see it yet, did you see it yet' insinuating that you're 'ignorant' until you have seen Michael's 'documentary.' Well now you can tell them you saw a documentary of the documentary  did THEY see it? And you didn't give Michael Moore one single dime out of your pocket.\n\nAnd as I've written already, if you're prejudiced in favor of Moore  there is a lesson for you here. I suspect the most loudmouthed among the Michael Moore fans are going to nervously scan through this piece, just to get a feel for how much they've been had. Now that you've echoed some of the lies and distortions in Fahrenheit, it's better to get a heads-up on how someone is going to nail you to the wall on it, than to let the nailing proceed while being completely oblivious to how it's going to come about."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Fahrenhype 9/11",
        "duration": "PT1M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi380612121",
        "name": "Fahrenhype 9/11",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzAwYWMwODItMzI2ZC00MjZlLWFlY2UtOGJiY2I2OWEwYThkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzAwYWMwODItMzI2ZC00MjZlLWFlY2UtOGJiY2I2OWEwYThkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2014-12-20T07:27:56Z",
        "url": "https://www.imdb.com/video/vi380612121/"
    },
    "url": "/title/tt0427228/"
}