{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eddie Barth",
            "url": "/name/nm0058532/"
        },
        {
            "@type": "Person",
            "name": "Irene Cara",
            "url": "/name/nm0001011/"
        },
        {
            "@type": "Person",
            "name": "Lee Curreri",
            "url": "/name/nm0001087/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23596,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Christopher Gore",
            "url": "/name/nm0330731/"
        }
    ],
    "datePublished": "1980-05-16",
    "description": "A chronicle of the lives of several teenagers who attend a New York high school for students gifted in the performing arts.",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Parker",
            "url": "/name/nm0000570/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Drama",
        "Music",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmQ1NTNjN2YtY2IxMS00MjMxLThhM2ItNmFlOGM1NjcxY2EzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "performing arts,new york city,performing arts school,casting couch,teen pregnancy",
    "name": "Fame",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TVholic"
        },
        "dateCreated": "2000-10-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080716/"
        },
        "name": "It was the best of times, it was the worst of times.",
        "reviewBody": "High school. Years and decades later, some look back on it with fondness, others with embarrassment. But few find it easy to forget. It's one of the most critical phases of our lives, when changes come fast and furious whether we're ready or not. No longer children, not yet adults, irresistible forces buffet us, pushing and pulling us in every direction.\n\n\"Fame\" did its best to capture this turbulent, chaotic period for its cast of young characters. For the most part, it succeeded. It meandered, but did feel like a slice of life. This movie holds a special place in the hearts of the Class of '80. We had just bid farewell to the sensational '70s, and soon to the end of three or four stimulating and sometimes difficult school years. We were headed out into the cold, cruel world, leaving home for college then parts unknown. As we approached our watershed event, this newly released movie was like a two-hour yearbook for us. We couldn't escape the titular song on the radio. That was us up there on the screen. Those were our friends, rivals and classmates as we had faced our own dreams, frustrations, successes and failures. Except that theirs were peppered and punctuated with lively tunes from Michael Gore.\n\nIt's especially poignant for those who attended any of New York City's other elite, top-tier high schools, especially Stuyvesant, Bronx HS of Science or Brooklyn Tech. Like the kids here, we were considered the best of the best. We had no auditions, but instead rigorous entrance exams. More than the Performing Arts kids, we were expected to change the world, although not necessarily become famous. Like them, not all of us made it. But the pressure cooker environment fostered extraordinary camaraderie and esprit de corps, not unlike the toe-tapping \"Hot Lunch Jam\" in the cafeteria. On our own graduation day, our spirits soared almost like the jubilant crescendo in the rousing finale. The film leaves us fittingly on a single, triumphant note at the end of \"I Sing the Body Electric,\" pointing to the blindingly bright, boundless future and all the promise it held.\n\n\"Fame\" couldn't have been set anywhere else. This story would never have worked in a small or suburban school. Los Angeles has a stronger identification with movies and television, but NYC is a mecca for all of the arts. Home not only to what was then called PA, but also world-renowned Juilliard, NYC is a cultural center unmatched by any other city in the world. \"Fame\" is also a time capsule of the rest of the city of the time, showing the seediness, grit and grime that was endemic of a New York still struggling back from the fiscal crisis that had nearly bankrupted it. But most of all, it showed the vitality, since muted by the inroads of Giuliani, Disney and tourism. Having it filmed in and around an actual NYC school - although not the real PA - helped give it a wonderful sense of verisimilitude.\n\nWhat I wouldn't give to be young again. But with \"Fame,\" at least I can remember what it was like.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4290493977",
        "name": "Fame",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjBhZjcyZmUtZmE4Yi00ZDQxLTkwNTItMjExNzIyNDhlYTdmXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjBhZjcyZmUtZmE4Yi00ZDQxLTkwNTItMjExNzIyNDhlYTdmXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-29T17:02:05.131Z",
        "url": "https://www.imdb.com/video/vi4290493977/"
    },
    "url": "/title/tt0080716/"
}