{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charles Bronson",
            "url": "/name/nm0000314/"
        },
        {
            "@type": "Person",
            "name": "Angela Featherstone",
            "url": "/name/nm0004911/"
        },
        {
            "@type": "Person",
            "name": "Sebastian Spence",
            "url": "/name/nm0817819/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1038,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0077387/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0040329/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044654/"
        },
        {
            "@type": "Person",
            "name": "Joel Blasberg",
            "url": "/name/nm0087650/"
        }
    ],
    "datePublished": "1995-11-26",
    "description": "A police detective's oversexed daughter is charged with murder when someone kills the wealthy married man she slept with.",
    "director": [
        {
            "@type": "Person",
            "name": "Ted Kotcheff",
            "url": "/name/nm0467646/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkxNTc4NTcwOF5BMl5BanBnXkFtZTYwNzc4ODI5._V1_.jpg",
    "keywords": "police,bullet wound,suit and tie,blood,police car",
    "name": "Family of Cops",
    "original_info": {
        "id": "Family of Cops_1995",
        "name": "Family of Cops",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2015-07-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113024/"
        },
        "name": "A Fein cop dynasty from Milwaukee",
        "reviewBody": "Charles Bronson's last film role was as police inspector Paul Fein of the Milwaukee,PD which he did for Family Of Cops for this and two sequels. His two sons, Daniel Baldwin and Sebastian Spence went on the job and daughter Barbara Williams became a public defender. \n\nBut she's not the real rebel in the Fein family. The youngest is daughter Angela Featherstone who is out in California looking to 'find herself'. That meaning that she's taken up with any and all. She's back for a family occasion where she takes up with hotel magnate Simon MacCorkindale.\n\nSo when she wakes up from an alcoholic stupor and finds MacCorkindale shot to death she has the presence of mind to call dad. So Bronson and the rest of the family put their careers on the line to save Featherstone when at first they're not sure she's even innocent.\n\nBoth Bronson and MacCorkindale have made a lot of enemies. It's not beyond the realm of possibility that someone would shoot Simon just to embarrass the Fein family with their black sheep. MacCorkindale also has a jealous wife in Lesley-Anne Down and an ex-wife Paula Trotter who have motives.\n\nDuring the course of this Daniel Baldwin nearly dies, but the criminal he's pursuing and the snitch who tips off Bronson have the key to the whole case.\n\nWatching this I was of two minds. Just a small investigation would have shown this a professional hit and the Feins need not have put their careers at risk. But also in my experience the easiest answer is the one police often go with. \n\nAt age 73 when he tackled this role Bronson is clearly slowing down. He lets a lot of the action go to younger cast members. He's clearly though not one to be trifled with. \n\nIn fact the real main character is Featherstone whose rehabilitation as well as acquittal becomes a Fein family project.\n\nTwo more films about the Feins of Milwaukee were done before Charles Bronson called it a career. A good if not great role to go out on.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0113024/"
}