{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tamara Garina",
            "url": "/name/nm0307447/"
        },
        {
            "@type": "Person",
            "name": "Sergio Kleiner",
            "url": "/name/nm0459073/"
        },
        {
            "@type": "Person",
            "name": "Diana Mariscal",
            "url": "/name/nm0548073/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6167,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Fando and Lis",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035332/"
        },
        {
            "@type": "Person",
            "name": "Fernando Arrabal",
            "url": "/name/nm0037130/"
        },
        {
            "@type": "Person",
            "name": "Alejandro Jodorowsky",
            "url": "/name/nm0423524/"
        }
    ],
    "datePublished": "1972-06-08",
    "description": "Fando and his partially-paralyzed lover Lis search for the mythical city of Tar. Based on Jodorowsky's memories of a play by surrealist Fernando Arrabal.",
    "director": [
        {
            "@type": "Person",
            "name": "Alejandro Jodorowsky",
            "url": "/name/nm0423524/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Adventure",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjk2YjhhNTEtZmYzYy00MzBkLTk2YTMtYTkwMjQyY2EwYWMxXkEyXkFqcGdeQXVyNzM0MTUwNTY@._V1_.jpg",
    "keywords": "directorial debut,post apocalypse,nihilism,experimental film,journey",
    "name": "Fando y Lis",
    "original_info": {
        "id": "Fando & Lis | Constellation Jodorowsky_1994",
        "name": "Fando & Lis / Constellation Jodorowsky",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "reptilicus"
        },
        "dateCreated": "2002-01-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061643/"
        },
        "name": "Is this man a genius or a drugged out hack? You tell me!",
        "reviewBody": "Mention the name Alexandro Jodorowsky wherever two or more film buffs are gathered and a fight is only minutes away. Some argue that he is a latter day Bunuel whose non-linear style of storytelling illustrates the falsities and hypocrasies of the ruling class while others declare that he is a talentless poseur who incorporates his own LSD inspired ramblings into his scripts and \"non linear\" is just a fancy way of saying his plots make no sense.\n\nMany directors have woven the search for the Meaning of Life into their plots. Ingmar Bergman, David Lynch, Carl Dreyer and Luis Bunuel among them especially. The thing about Jodorowsky is not that his characters are looking for the meaning OF life, rather they are seeking to give meaning TO their lives. This is not wrong per se, but the problem is the characters in EL TOPO, THE HOLY MOUNTAIN and even FANDO AND LIS all find what they are seeking, and that is where the problems begin, not end. While having a goal and dedicating your life to it is laudible in itself, once you have satisfied that goal where do you go? Is Life still meaningful once you have solved Meaning of same? Not to reveal the ending of any of these movies but: There are disastrous results for everyone in these pictures once they reach their goal . . .which turns out to be not what they expected anyway.\n\nFando and his crippled girlfriend Lis are on a journey to the legendary magical city of Tar where, both believe, Lis will be able to walk and all their problems will be solved. Along the way they meet all sorts of odd characters (the only kind who inhabit the Jodorowsky universe) and Fando tries to leave several times only to return repentant. Jodorowsky seems to share a dislike of the upper classes of society with Bunuel. The representatives of the upper crust we encounter are narrow minded ineffectual idiots anxious to maintain the status quo because that is the only life they know and they are unwilling to accept change (think about the townsfolk in EL TOPO and compare them to the rich people in VIRIDIANA).\n\nTar may be no more real than El Dorado or Atlantis but as long as they are actively involved in searching for it, Fando and Lis's live's have meaning. The question ultimately put before them and, by proxy, also before us is this: Is the realisation of this goal worth it? And what happens if we arrive at the wrong answer? Of course with Jodorowsky the wrong answer is the only one anyone ever seems to reach, EL TOPO being the prime example of this. FANDO AND LIS reaches a climax which, while not wholly unexpected, is no less heartbreaking because we saw it coming.\n\nThis film was withdrawn for several film festivals worldwide and allegedly caused riots when it was shown in Brazil. It was withdrawn from distribution for many years by Jodorowsky himself but is now available on videocassette and DVD. So is this man an unsung genius? You figure it out, I'm going home."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3126574873",
        "name": "Trailer [English SUB]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWJmMjgxM2QtYWQxYy00OWM2LTg5ZTYtYzM5ZjI1NDllYzE4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWJmMjgxM2QtYWQxYy00OWM2LTg5ZTYtYzM5ZjI1NDllYzE4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-05T20:30:57.781Z",
        "url": "https://www.imdb.com/video/vi3126574873/"
    },
    "url": "/title/tt0061643/"
}