{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lotte Eisner",
            "url": "/name/nm0252151/"
        },
        {
            "@type": "Person",
            "name": "Eugen Des Montagnes",
            "url": "/name/nm0220770/"
        },
        {
            "@type": "Person",
            "name": "James William Gledhill",
            "url": "/name/nm0322391/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3902,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039268/"
        },
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "datePublished": "1972-02-01",
    "description": "Footage shot in and around the Sahara Desert, accompanied only by a spoken creation myth and the songs of Leonard Cohen.",
    "director": [
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "duration": "PT1H19M",
    "genre": [
        "Documentary",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmNjMjI1YzUtNDlhNS00NmQ3LTg4OGEtZWYwMzdmMjJjMTJjXkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_.jpg",
    "keywords": "desert,voice over,three parts,experimental film,sahara desert",
    "name": "Fata Morgana",
    "original_info": {
        "id": "Fata Morgana_1971",
        "name": "Fata Morgana",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2009-07-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067085/"
        },
        "name": "Strange to Say Just a Few Words",
        "reviewBody": "Fata Morgana (1971) \n\n* 1/2 (out of 4) \n\nI knew what I was getting into with this film so I actually read the production notes to before getting to the movie itself and I must admit that the notes were a lot more entertaining. Now, I certainly see why some might love this movie and call it a masterpiece but at the same time, to me, this is just a movie that's \"art\" for the sake of being art. There's really an interesting movie to discuss here but it's just not an entertaining one and no matter what type of art you're trying to create, the importance of being entertaining can never be overlooked. There's really no way to fully describe or give a plot detail of this film but it's pretty much Herzog's documentary on why images are so important. Shot in Africa, we get all sorts of images of the desert as well as various other tracking shots, which are shown with narration as well as a soundtrack by Leonard Cohen and Blind Faith. I'm really not sure what to say about this film except that it didn't work for me and Herzog's attempt to show the visuals as \"aliens looking around\" just didn't work. This is something Herzog would attempt later in his career and to me these type of thoughts have always been a miss. I'm sure Herzog has something to say with the film but I don't see it being said in the film itself. I've read his comments and listened to parts of the commentary where he explains things but if it weren't for this, the movie itself wouldn't have said anything. There are certainly some surreal moments and there's no question that a brilliant mind is behind all the images but in the end the film left me cold and bored, which is something I can't say about too many of Herzog's films as he's one of my favorites."
    },
    "url": "/title/tt0067085/"
}