{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Spencer Tracy",
            "url": "/name/nm0000075/"
        },
        {
            "@type": "Person",
            "name": "Joan Bennett",
            "url": "/name/nm0000910/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Taylor",
            "url": "/name/nm0000072/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11927,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Frances Goodrich",
            "url": "/name/nm0329304/"
        },
        {
            "@type": "Person",
            "name": "Albert Hackett",
            "url": "/name/nm0352443/"
        },
        {
            "@type": "Person",
            "name": "Edward Streeter",
            "url": "/name/nm0834117/"
        }
    ],
    "datePublished": "1950-06-16",
    "description": "The father of a young woman deals with the emotional pain of her getting married, along with the financial and organizational trouble of arranging the wedding.",
    "director": [
        {
            "@type": "Person",
            "name": "Vincente Minnelli",
            "url": "/name/nm0591486/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzBlYzAxMjgtOGRmZS00ZmRjLWFmNjQtZjVjZTFlMzE3Y2MzXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "fatherhood,dream,church,family relationships,f rated",
    "name": "Father of the Bride",
    "original_info": {
        "id": "Father of the Bride_1950",
        "name": "Father of the Bride",
        "year": "1950"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2005-12-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0042451/"
        },
        "name": "When You're the Father of Girls?",
        "reviewBody": "When I watch either this version or the Steve Martin version of Father of the Bride, I always think of my poor brother now. He's the father of girls 21 and 19 so he will have to deal with what Spencer Tracy did twice.\n\nThis film was one of Metro-Goldwyn-Mayer's big moneymakers at the tail end of Louis B. Mayer's reign. It certainly has a theme, one that we can all identify with. 55 years after Father of the Bride came out, fathers all over the world will be overwhelmed by weddings. It will be so 100 years from now.\n\nTwelve years after he won his second Oscar in Boystown, Spencer Tracy got an Oscar nomination for Stanley Banks, beleaguered and harried father of one of the most beautiful brides ever to grace the screen. It's on his performance, narrated in flashback by him, that the whole film rises or falls. Of course Tracy never let an audience down.\n\nBy coincidence the publicity surrounding Elizabeth Taylor's first marriage came as this film was being made and released. Sad that Liz Taylor never settled down to a stable marriage with a loving, faithful husband as Kay Banks did with Buckley Dunstan. But she sure is a bride for all seasons.\n\nOf course the wedding, the planning, the cost, the disruption to the lives of the Banks household is the film. Who of us who dealt with having a wedding didn't have to deal with a snooty caterer? A formal announcement party that Tracy puts on and can't enjoy because he's stuck behind a jerry-built bar in his kitchen? A wedding rehearsal that can't seem to come off? Universal and timeless themes.\n\nJoan Bennett registers well as the patient and loyal mother of the bride who has to deal with both her husband and daughter losing their minds to pre-wedding jitters. Moroni Olsen and Billie Burke and their son, Don Taylor, do just fine as the groom's side. And Leo G. Carroll is the wedding caterer from snob city. Maybe Clifton Webb could have done it better, if MGM could have afforded him, but Carroll is just fine.\n\nMy favorite moment in Father of the Bride is in the midst of all the chaos, Tracy looks at the older of Taylor's two brothers, Tom Irish, and tells him with great relief that when he gets married, his only contribution to the wedding will be him. My brother has to go through two daughters before he can say that to my nephew.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3284123161",
        "name": "Father of the Bride",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWY4OTI5YWUtMGRmNC00M2U3LWEwMzgtMTZlNmEyNWMyYmU3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWY4OTI5YWUtMGRmNC00M2U3LWEwMzgtMTZlNmEyNWMyYmU3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-03T17:03:15.644Z",
        "url": "https://www.imdb.com/video/vi3284123161/"
    },
    "url": "/title/tt0042451/"
}