{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve Martin",
            "url": "/name/nm0000188/"
        },
        {
            "@type": "Person",
            "name": "Diane Keaton",
            "url": "/name/nm0000473/"
        },
        {
            "@type": "Person",
            "name": "Martin Short",
            "url": "/name/nm0001737/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 79684,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059172/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005929/"
        },
        {
            "@type": "Person",
            "name": "Frances Goodrich",
            "url": "/name/nm0329304/"
        },
        {
            "@type": "Person",
            "name": "Albert Hackett",
            "url": "/name/nm0352443/"
        },
        {
            "@type": "Person",
            "name": "Nancy Meyers",
            "url": "/name/nm0583600/"
        }
    ],
    "datePublished": "1991-12-20",
    "description": "With his oldest daughter's wedding approaching, a father finds himself reluctant to let go.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Shyer",
            "url": "/name/nm0796124/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy",
        "Family",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzM0YzBmMTUtN2RmZS00YWY5LWFkZTMtMjM1OWU3Nzk4ZjI1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "father daughter relationship,wedding planning,husband wife relationship,father of the bride,wedding",
    "name": "Father of the Bride",
    "original_info": {
        "id": "Father of the Bride_1991",
        "name": "Father of the Bride",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2004-03-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101862/"
        },
        "name": "Steve Martin's second favorite film he has starred in. I can see why.",
        "reviewBody": "The sweetness that \"Father of the Bride\" exudes does not stem from the fact that it is funny, but rather because it is honest. It's a remake of the 1950s Spencer Tracy classic (which is great in its own right), but has more warmth about it than that film did. It doesn't rely on slapstick as much as it does on the realistic and ironic lead performance by Steve Martin. This is Martin's second favorite film that he has starred in (behind \"Planes, Trains and Automobiles\" and followed by \"Little Shop of Horrors\"), and I can see why.\n\nMartin stars as George Banks, a wealthy upper-class businessman living in Suburban America with a gentle wife (Diane Keaton) and feisty son (Kieran Culkin). His oldest daughter (Kimberly Williams) has finally grown up and departed the house, and the day she comes home with a fiancée he literally has a panic attack.\n\nShe's getting married to possibly the most sensitive man in the world, but George is oblivious to this. All he sees are two big words flashing about the room: LOSING and DAUGHTER. But he is even more upset when he realizes the cost of the wedding: about a couple hundred dollars per head, multiplied by six hundred. You do the math.\n\nNina (Keaton) and her daughter hire Franck Eggelhoffer to handle the wedding, and Eggelhoffer is one of Martin Short's finest roles. Short, an ex-\"SNL\" member, and star of \"Three Amigos\" (which also starred Martin), is simply hilarious as the ecstatic and eccentric Frenchman. Amidst the ceremony's setup procedures, George cannot believe he is the only one who realizes just how crazy the cost of the wedding is.\n\nLet's get this straight: \"Father of the Bride\" is nothing great. It's been done before, and it will be done again (and it has). Yet because of a likable and warm presence, the movie is more than just the sentimental goo that it nearly becomes at certain points throughout. It's truthful, blunt, and occasionally rather funny, which makes for an entertaining and extremely likable motion picture.\n\nThis is not Steve Martin's greatest role. That honor would go to his portrayal of frustrated advertising executive Neal Page in \"Planes, Trains and Automobiles.\" But here he provides us with a character almost as realistic, touching and likable. Neal was the character we empathized with in \"Planes,\" and in \"Bride\" it's essentially the same for Martin. We're seeing the world through his eyes - which explains the reason it is quite often very overwhelming and comical.\n\nThe movie indeed benefits from Martin's portrayal of a worried father - not as scared by the fact that his daughter is getting married, as he is by the idea that he will undoubtedly lose her to another man. It's a turning point in both their lives, but it doubles for him. Not only has he essentially lost his daughter, but also he has also just been faced with the reality that he is old enough to nearly be a granddad. This would leave good room for a sequel. Oh, wait...\n\n4/5 stars.\n\n\n* John Ulmer\n"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "With his oldest daughter's wedding approaching, a father finds himself reluctant to let go.",
        "duration": "PT2M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi673103385",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGU4YmMzMjgtMTlkMS00OWM0LWI3YjctNTVlNTkzNTllZWJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGU4YmMzMjgtMTlkMS00OWM0LWI3YjctNTVlNTkzNTllZWJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-03T10:41:37.896Z",
        "url": "https://www.imdb.com/video/vi673103385/"
    },
    "url": "/title/tt0101862/"
}