{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Bridges",
            "url": "/name/nm0000313/"
        },
        {
            "@type": "Person",
            "name": "Isabella Rossellini",
            "url": "/name/nm0000618/"
        },
        {
            "@type": "Person",
            "name": "Rosie Perez",
            "url": "/name/nm0001609/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23390,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0114242/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Rafael Yglesias",
            "url": "/name/nm0947913/"
        }
    ],
    "datePublished": "1993-11-05",
    "description": "A man's personality is dramatically changed after surviving a major airline crash.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Weir",
            "url": "/name/nm0001837/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGYyYzgyODMtOGYwOC00OTM5LTk4NDUtNTRkN2I3YmUxNTM5XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "survivor guilt,pancake,allergic reaction,taxi,first class ticket",
    "name": "Fearless",
    "original_info": {
        "id": "Fearless_1993",
        "name": "Fearless",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "GMJames"
        },
        "dateCreated": "2001-04-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106881/"
        },
        "name": "One of the few films that in the end brought on a full-fledged catharsis",
        "reviewBody": "When I first saw \"Fearless\" in a movie theater, I believe there were about 20 to 30 other moviegoers in the theater on a weekday afternoon. It was in it's second week in theaters. After the credits rolled, I heard a lot of weeping from the small but vocal audience.\n\nMaybe the film flopped because some people expected a 1970's-style disaster flick with cardboard characters, laughable dialog and unknown extras & doubles performing dangerous stunts.\n\nIt's been almost eight years since watching \"Fearless\" for the first time. This is one of only 5 movies I actually own in my very small tape library.\n\nDirector Peter Weir amazes me. With a few exceptions (I didn't like \"Dead Poets Society\" and I haven't seen \"Green Card\"), he has always walked on a tightrope when it comes to telling a story. It might not result in a \"satisfying\" ending but when you think about what was presented two hours earlier, it makes a lot of sense. It's a logical and very fascinating progression.\n\nI believe that Jeff Bridges can (almost) do no wrong. His character may not be very likable but put yourself in his character's shoes and you may understand the reasons why he believes that he is \"fearless\".\n\nI haven't seen Isabella Rossellini's performance in \"Blue Velvet\" but it makes me wonder if her performance in that film beats her role as the caring but very confused wife of Jeff Bridges' character. She's definitely the heart of \"Fearless\". I cared for her. I felt empathy; her confusion of what her husband was doing to himself, her family and herself. She's on the outside trying her best to understand what it was like to survive a plane crash. But at the same time, not totally understanding what it was like to be on the ill-fated flight. Rossellini gave a glowing performance.\n\nRosie Perez's performance as the distraught woman who lost her young son in the crash was incredible. Unlike some people in this world, I do like Perez (thick Spanish accent and all). What really impressed me was how she captured the depth of losing her child. There have been some films & TV movies that have captured the effects of a family losing a spouse or adult child. There haven't been as many to deal with the loss of a child as well as \"Fearless\" did. Perez hasn't had a role with this much depth in a long time. I was pleasantly surprised when she received an Oscar nomination for Supporting Actress, the movie's only nomination.\n\nThe unrequited bond between Bridges' and Perez's characters was fascinating to watch. They survived something that their love ones will never understand. In the end, the two need to understand that despite their losses, they are still alive in this world and somehow they need to find a way to get back to reality.\n\nScreenwriter Rafael Yglesias, who wrote the novel, captured the complexity of crash survivors almost flawlessly. One weak link: John Turturro had the thankless job of playing the underwritten role of the psychiatrist.\n\nWhen a film like \"Fearless\" even inspires a music video (Brian McKnight's \"Back At One\"), then you know that this movie will have a lasting effect and with cable, VHS & DVD, it'll never be forgotten. I certainly haven't forgotten it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3735421209",
        "name": "Fearless",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmU0YWVkYWItODBiYi00MmQ0LWJkZWYtZTdlZGUyN2ExYzg2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmU0YWVkYWItODBiYi00MmQ0LWJkZWYtZTdlZGUyN2ExYzg2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:05:34Z",
        "url": "https://www.imdb.com/video/vi3735421209/"
    },
    "url": "/title/tt0106881/"
}