{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Hoskins",
            "url": "/name/nm0001364/"
        },
        {
            "@type": "Person",
            "name": "Arsinée Khanjian",
            "url": "/name/nm0451376/"
        },
        {
            "@type": "Person",
            "name": "Elaine Cassidy",
            "url": "/name/nm0144187/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8120,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054762/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000700/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073417/"
        },
        {
            "@type": "Person",
            "name": "William Trevor",
            "url": "/name/nm0872485/"
        },
        {
            "@type": "Person",
            "name": "Atom Egoyan",
            "url": "/name/nm0000382/"
        }
    ],
    "datePublished": "1999-11-24",
    "description": "A young woman leaves Ireland to find her boyfriend in England, and while there is helped by a man hiding unsettling secrets.",
    "director": [
        {
            "@type": "Person",
            "name": "Atom Egoyan",
            "url": "/name/nm0000382/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMThhZjNjNDctOTgwYi00NDQ0LThiZTktOGI0ZGQzZTc3Yjk2XkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_.jpg",
    "keywords": "caterer,catering,lawn mower,friend,chef",
    "name": "Felicia's Journey",
    "original_info": {
        "id": "Felicia's Journey_1999",
        "name": "Felicia's Journey",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "philip_vanderveken"
        },
        "dateCreated": "2005-08-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0165773/"
        },
        "name": "Keep watching it until the very end if you really want to know what exactly is going on.",
        "reviewBody": "For as far as I know this was the very first movie that I've seen from Atom Egoyan. I had heard his name before and I knew that the movies he makes are often very good, but you just can't see them all, can you? Still, I'm glad that I finally got to see one and I must say that I'm already a fan of his work. If his other movies are as good as this one, than I almost can't wait to see those too.\n\nThe title \"Felicia's Journey\" already tells something about what to expect from this movie. It tells the story of an Irish girl that is making her way from Ireland to England, to find her boyfriend who moved there to get a job in a lawn-mower factory. On arrival she meets a lonely middle-aged catering manager, called Hilditch, who recommends a boarding room to her. But Hilditch is a bit of a strange man. Even though he seems very nice and polite, he's always alone and seems to spend hours on studying tapes of an eccentric TV chef called Gala. Gradually we learn that the man has a much darker side than what we and Felicia at first assume...\n\nEven though he could easily have made a horror movie out of this subject or perhaps even worse, a TV-movie (it has something to do with having a bad youth, murder,...), Atom Egoyan has made the excellent choice of focusing on the drama and studying the characters with flashbacks. And by only slowly allowing the viewer to get some new information, rather than to give away everything at once, he builds up tension very well. But a good story isn't enough to make a good movie of course, some fine performances by all the actors are needed as well. Despite the fact that I didn't really know Elaine Cassidy (I only saw her play in \"The Others\" before), I must say that she is a pleasant surprise. She really did a very nice and convincing job with this role. The same can be said about Bob Hoskins. Him I know a lot better, but he too surprised me. He was so good in his role as Hilditch, that it took me quite some time to believe that it was really this man who did those horrible things.\n\nOverall this is a very fine movie with some excellent performances and a very interesting story. I'm convinced that there will be several people who will not like it for several reasons, but personally I liked it a lot. For me it wasn't too slow and I stayed focused from beginning until the end. And as this movie shows, you always have to be patient. Its power doesn't lie in the beginning or in the middle. Only when it is finished, you'll fully understand what has happened. That's why I give this movie a rating in between 7.5/10 and 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi161743129",
        "name": "Felicia's Journey",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2ZhZGI3ZTAtZDVjNy00N2YxLWI4ZDktMDI5YmE0Y2EyNTVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2ZhZGI3ZTAtZDVjNy00N2YxLWI4ZDktMDI5YmE0Y2EyNTVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:57:18Z",
        "url": "https://www.imdb.com/video/vi161743129/"
    },
    "url": "/title/tt0165773/"
}