{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tilda Swinton",
            "url": "/name/nm0842770/"
        },
        {
            "@type": "Person",
            "name": "Amy Madigan",
            "url": "/name/nm0001496/"
        },
        {
            "@type": "Person",
            "name": "Karen Sillas",
            "url": "/name/nm0798076/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2564,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076310/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061958/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025720/"
        },
        {
            "@type": "Person",
            "name": "Louise J. Kaplan",
            "url": "/name/nm0438303/"
        },
        {
            "@type": "Person",
            "name": "Julie Hébert",
            "url": "/name/nm0372877/"
        },
        {
            "@type": "Person",
            "name": "Susan Streitfeld",
            "url": "/name/nm0834201/"
        }
    ],
    "datePublished": "1997-04-25",
    "description": "An ambitious female attorney wallows in excess and meaningless sex with both male and female partners, while dealing with her personal life problems including helping her kleptomaniac sister.",
    "director": [
        {
            "@type": "Person",
            "name": "Susan Streitfeld",
            "url": "/name/nm0834201/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Drama",
        "Fantasy",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWEwNTdlZTktYWNlMC00MWUyLWFiYjQtNjNjOWMxMjZhNjk5XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "insecurity,sibling rivalry,kleptomania,bisexuality,lesbian",
    "name": "Female Perversions",
    "original_info": {
        "id": "Female Perversions_1997",
        "name": "Female Perversions",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Doctor_Bombay"
        },
        "dateCreated": "1999-03-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116293/"
        },
        "name": "On target.",
        "reviewBody": "The idea that a career driven woman finds herself disconnected from emotions, vacant in today's society, is the subject of at least one daytime television program daily. The presentation of Evelyn Stevens (Tilda Swinton, of Orlando fame) in Female Perversions, is not the sugar-coated world of The View, but a carefully crafted life-study (accurate to the minute details).\n\nEvelyn is an attractive woman, she believes herself a beautiful one. She inappropriately wonders through a shop while trying on a revealing piece of underwear, but the only one available is a disinterested octogenarian. She is a competent attorney, yet she represents herself as a premier legal strategist. Her credit card is rejected while making the simplest of purchases, she drives a SAAB 900 Turbo-the whole thing is perfect.\n\nFurther insight to Evelyn's internal monsters are seen though the film's portrayal of her sister, Madelyn-the good soul to Evelyn's evil one. She has chosen a more bohemian existence, and calms her internal monsters through adventures in kleptomania.\n\nLet's recap: Driven woman, faux life, dysfunctional family, bad credit cards, soon to be made a judge (with no one to tell, and no one who cares). There is only one place left for her to go.\n\nTo a deeply invested lesbian encounter. Where else can she go? Her entire life as it stands is moments from implosion. The realization that the new lawyer entering her firm (her replacement') is prettier (Paulina Porizkova, no less), smarter, and likely more stable further pushes Evelyn to the inevitable.\n\nWonderfully cast with Amy Madigan (as the sister), Karen Sillas (as the Doctor/Lesbian love interest), and Clancy Brown (as the boyfriend) in a rarely seen beefcake role. Throw in Frances Fisher and Laila Robins for good measure.\n\nMust for all art film fans. Highly recommended for the more mainstream tastes who like a small distraction now and then."
    },
    "url": "/title/tt0116293/"
}