{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Meiko Kaji",
            "url": "/name/nm0435299/"
        },
        {
            "@type": "Person",
            "name": "Fumio Watanabe",
            "url": "/name/nm0913796/"
        },
        {
            "@type": "Person",
            "name": "Yukie Kagawa",
            "url": "/name/nm0434600/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3137,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Female Prisoner Scorpion: Jailhouse 41",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053157/"
        },
        {
            "@type": "Person",
            "name": "Shun'ya Itô",
            "url": "/name/nm0411746/"
        },
        {
            "@type": "Person",
            "name": "Fumio Kônami",
            "url": "/name/nm0464817/"
        },
        {
            "@type": "Person",
            "name": "Hirô Matsuda",
            "url": "/name/nm0559406/"
        }
    ],
    "datePublished": "1972-12-30",
    "description": "After spending a year in solitary confinement, Matsu escapes from prison with six more convicts, followed by the guards led by the vengeful warden who wants her dead at all costs.",
    "director": [
        {
            "@type": "Person",
            "name": "Shun'ya Itô",
            "url": "/name/nm0411746/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDJjOWE3NjAtYjMyYS00NzI3LWI1NzktNjg1YmY5MjI0NjU2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "japanese woman,female inmate,exploitation film,grindhouse film,rape",
    "name": "Joshû sasori: Dai-41 zakkyo-bô",
    "original_info": {
        "id": "Female Convict Scorpion: Jailhouse 41_1972",
        "name": "Female Convict Scorpion: Jailhouse 41",
        "year": "1972"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2008-03-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0226874/"
        },
        "name": "Surreal Female Convicts' Road trip!",
        "reviewBody": "The first film in this acclaimed Japanese exploitation cycle, entitled \"Female Prisoner 701: Scorpion\", literally perplexed me because it was such an atypical W.I.P accomplishment. It had a great story, a likable heroine character, stylish photography and - shockingly enough - only a minimal amount of nudity and perversion. The second entry in the series, entitled \"Female Convict Scorpion: Jailhouse 41\", actually astonished me even more! This time because it's such an atypical sequel. The formula of the original film clearly worked, so you would expect and even respect director Shunya Ito and his crew to embroider on the same successful elements, but they don't. In fact, the concept is completely different and easily the most innovative one ever used in a W.I.P film. Most of the action takes place outside the prisons' walls, during an escape that gradually changes into a wild and surreal 7-headed girl-power road trip across the desolate Japanese countryside. Seen from a certain viewpoint the script's drastic change of direction is actually rather logic, since the protagonist's engaging background story properly ended in part one. Scorpion successfully extracted her vengeance and returned to prison to serve a deserved sentence this time. But still, the completely alternative set-up is courageously ambitious and not just the story lines vastly changed, but nearly everything else as well, including atmosphere, imagery, editing, the depiction of violence and even the Matsu's entire persona! She now fully embodies bitterness and ferocity, which is masterfully illustrated through Ito's visionary direction. Matsu barely speaks five complete sentences during the whole film, yet her stares penetrate through the thickest skulls and she catches each suspicious sound in massive stereo. Since her virulent escapades, which even cost the headmaster's eye, Matsu spent the last year in a moist pit underneath the prison. She's allowed one day of daylight when a government inspector comes to visit and this is already enough for her to cause a major hoedown. Severe punishment ensues, but Matsu and six others manage to escape. Their journey turns into a crusade of retaliation against all (male) foes. The convicts' \"road trip\", if you can refer to it like that, is truly surreal and artsy and often nightmarishly macabre! They encounter a witch who eerily narrates the women's stories, rapists on tour, numerous abstract and depressing tableaux and  last but not least  collective hatred. Especially the vicious Oba battles Matsu for the honor of most respected jailbird. There's a lot of dreamy and addictive weirdness going on during the escape, but nonetheless the actual prison and revenge footage remains the best and most exciting. Both the opening and climax are tremendously brilliant, and even though everything in between is quite uniquely experimental and accomplished, it occasionally gets in the way of the good old exploitation themes. Meiko Kaji's performance is once again marvelous and she receives excellent support from Kayoko Shiraishi (who's overacting actually works) as Oba and Fumio Watanabe as the sadist head warden. Great stuff!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3023485465",
        "name": "Female Prisoner 701 Scorpion",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTAwODM2YWEtNTViOC00Zjg3LThjNmEtZjE3NmU5OTFlYjczXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTAwODM2YWEtNTViOC00Zjg3LThjNmEtZjE3NmU5OTFlYjczXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-12-21T17:06:11.198Z",
        "url": "https://www.imdb.com/video/vi3023485465/"
    },
    "url": "/title/tt0226874/"
}