{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lina Romay",
            "url": "/name/nm0739124/"
        },
        {
            "@type": "Person",
            "name": "Jack Taylor",
            "url": "/name/nm0852488/"
        },
        {
            "@type": "Person",
            "name": "Alice Arno",
            "url": "/name/nm0036309/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1967,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "alternateName": "Female Vampire",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018510/"
        },
        {
            "@type": "Person",
            "name": "Gérard Brisseau",
            "url": "/name/nm0109884/"
        },
        {
            "@type": "Person",
            "name": "Jesús Franco",
            "url": "/name/nm0001238/"
        },
        {
            "@type": "Person",
            "name": "Josyane Gibert",
            "url": "/name/nm0067514/"
        }
    ],
    "datePublished": "1973-04-10",
    "description": "A beautiful female vampire lures men to their doom.",
    "director": [
        {
            "@type": "Person",
            "name": "Jesús Franco",
            "url": "/name/nm0001238/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTFkZjYwYzEtZmMxOC00YTMzLWE5MmUtOGQ4MTIxODkxZTk2XkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "female vampire,woman on top,vampire,mute,sex",
    "name": "La comtesse noire",
    "original_info": {
        "id": "Female Vampire_1973",
        "name": "Female Vampire",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2005-04-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069745/"
        },
        "name": "mmmmm....vampirism!",
        "reviewBody": "Cultmaster Jess Franco delivers with this \"Female Vampire\" the jolliest and sleaziest bunch of sleaze you'll ever behold, and that's a guarantee! This in fact is the closest you can get to renting porn while still able to claim it's essential and rare cult, haha!! The star in this film is Franco's favorite toy-girl, the astonishingly beautiful (at least back then) and sexy Lina Romay, who definitely makes up in charisma what she lacks in experience and acting skills. Luckily for her, her character is a mute so can use her body language to the fullest! She plays Irena von Karlstein, the last descendant of a cursed family of vampires who's doomed to travel from one great place to another and survive by making love to random people...The poor, poor girl!! Irana isn't your ordinary type of vampire as she's perfectly able to stand daylight and it ...um...isn't exclusively blood she sucks! Countess von Karlstein really is one of the most unique Franco characters ever and you'll unquestionably love her! Whenever she's not killing people, she walks naked through the woods or makes love to the furniture. In order to add a tiny bit of substance to story, there's a sub plot involving a neurotic scientist (played by Franco himself) who wants to destroy the yummy Irena. So, what exactly is the point of this film? There isn't any...and that's the beauty of it! Like several of Franco's film, this \"Female Vampire\" is rather meaningless and overall incompetent BUT also very sensual! The photography is magnificent and the musical guidance is very beautiful. The film is slow-paced, elegant and remarkably stylish for being a  let's face it  voyeuristic movie! If you're into euro-sleaze, cult classics and off-category movies .... this is a must! The same film is also available as a different cut and under a different title  Erotikill  but that one is pure pornography!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0069745/"
}