{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Reiko Ike",
            "url": "/name/nm0407409/"
        },
        {
            "@type": "Person",
            "name": "Makoto Aikawa",
            "url": "/name/nm6340947/"
        },
        {
            "@type": "Person",
            "name": "Arumi Kuri",
            "url": "/name/nm1055707/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 880,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Female Yakuza Tale",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053157/"
        },
        {
            "@type": "Person",
            "name": "Teruo Ishii",
            "url": "/name/nm0411030/"
        },
        {
            "@type": "Person",
            "name": "Masahiro Kakefuda",
            "url": "/name/nm0435363/"
        },
        {
            "@type": "Person",
            "name": "Ikuo Sekimoto",
            "url": "/name/nm0782865/"
        }
    ],
    "datePublished": "1973-06-07",
    "description": "Ocho gets abducted by a yakuza clan that uses a gang of women to smuggle drugs in their vaginas. Finding out that the kingpin had killed the last boss and abducted his daughter, Ocho joins forces with the drug mules against the clan.",
    "director": [
        {
            "@type": "Person",
            "name": "Teruo Ishii",
            "url": "/name/nm0411030/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzhkZWU3MDItYzBmOS00ZDZiLWI0MGMtOTc5MjdmZDZmOGU3XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "drugs,gambling,tattoo,murder,female gang",
    "name": "Yasagure anego den: Sôkatsu rinchi",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "EVOL666"
        },
        "dateCreated": "2006-02-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0142998/"
        },
        "name": "Pinky J-Sleaze At It's Finest...",
        "reviewBody": "DAMN I love this era of Japanese exploit film-making. I just recently really started digging into the 70's pinky and samurai films - but I have to say that I've LOVED every one that I've seen so far. Violent, gory, sleazy, sexy - they just don't make films like these anymore...\n\nUnfortunately, the story behind FEMALE YAKUZA TALE is a little convoluted and can be hard to follow at times. This one has Ocho (female pickpocket and \"swords-mistress\" extraordinaire of SEX AND FURY fame) trying to bring down a drug cartel that uses dope-addicted women as mules to smuggle drugs in their snatches. There are some rival gangs also involved, and throw in a side-plot of some of the local girls becoming victims of a string of \"Crotch-Gouge\" crimes (!?!), another female assassin who prays before she kills, and a guy who is part of a local crime family who was in jail but now is out and is looking to take down the new leader...and there ya have it...\n\nAgain, the main problem with FTY is that there are too many things going on at once, and too many characters who are introduced and then not explained very well, so that the story can become confusing and hard to keep up with. But, on the good side - there is so much sleazy \"fun\" going on that it's hard to fault the film for some plot inconsistencies. We are treated to the typical rape, torture, some hilarious dildo play, tons of tits and ass, and a few good fight scenes (including an awesome end battle of the drug dealers versus a gang of ex-mules who are naked and p!ssed!!!). I do think there could have been some more violence also - but I won't really hold that against the film either, as there is just so much fun stuff going on in this one. And in typical fashion for the Japanese exploit-style films of this time-frame - the sets, settings, cinematography, choreography, and acting are all top-notch. An absolute winner and highly recommended for pinky fans. Check out also SEX AND FURY, FEMALE PRISONER 701: SCORPION, LADY SNOWBLOOD, and the BABY CART series. 8.5/10 for FEMALE YAKUZA TALE...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0142998/"
}