{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kris Aquino",
            "url": "/name/nm0032643/"
        },
        {
            "@type": "Person",
            "name": "Coco Martin",
            "url": "/name/nm2029519/"
        },
        {
            "@type": "Person",
            "name": "Cherry Pie Picache",
            "url": "/name/nm0681367/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 189,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0227225/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0434035/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050691/"
        },
        {
            "@type": "Person",
            "name": "Chito S. Roño",
            "url": "/name/nm0747689/"
        },
        {
            "@type": "Person",
            "name": "Roy Iglesias",
            "url": "/name/nm0407150/"
        }
    ],
    "datePublished": "2014-12-25",
    "description": "A long time after Joy last saw the Bagua mirror, a man named Lester finds it and has the same experiences that Joy had with it. It's up to Joy to help Lester battle the curse and the deadly consequences.",
    "director": [
        {
            "@type": "Person",
            "name": "Chito S. Roño",
            "url": "/name/nm0747689/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGM5NDg0ZjQtMDQxOC00MjdiLWIyNTUtMDE2YWQ0ZDY2OTBiXkEyXkFqcGdeQXVyNTI5NjIyMw@@._V1_.jpg",
    "keywords": "killed by ghost,mirror,consequence,curse,chinese",
    "name": "Feng Shui 2",
    "original_info": {
        "id": "Feng Shui_2000",
        "name": "Feng Shui",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "billygoat1071"
        },
        "dateCreated": "2014-12-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3837198/"
        },
        "name": "New Directions",
        "reviewBody": "It's been ten years since the first Feng Shui movie came out and pleasantly this late sequel hasn't lost the same touch of the original, except of course it's now designed for a larger installment. We see how things have changed, but the story's quality and its horror tricks stayed intact, probably giving a slight sign of nostalgia. However the film still offers a lot of new ideas that can be both helpful and not to the new storyline. But overall, in spite of some missteps, Feng Shui 2 is a pretty fun horror film that builds its classic atmosphere while plays around with its new tricks.\n\nThe genius of the movie is having a main character who is reasonable enough to take the risk of keeping the cursed \"bagua.\" This is a strong set up, Lester's desperation for luck makes for a compelling tension to the worst things to come. And once things get terrible, the horror indeed pays off. The story finds a lot of clever ways to deliver the horror, by building a much gritty world around them. When the second act moves in, stakes get a lot bigger. It is now focused to more characters with their own arcs. This becomes a more thriller mode where it takes a lot of action. It kind of taken things too far, rather transforming it into a race-against-time game that spits out too many rules. This is the part where it feels like it aggressively tries to push the suspense, while it is effective, it also made the ride clunky.\n\nThe scares are still well put. Though, most of the death scenes are reliant with murder, which gets pretty repetitive. It does sum up its ruthless streets, but the best of the deaths are usually the ones that doesn't involve any thug holding a knife or a gun, scenes that instead plays mind tricks with the victims in \"Final Destination\" plus \"Oculus\" style. The acting is solid. Coco Martin makes for a strong lead here, while Kris Aquino reprises, nearly does the same thing she did in the first. Cherry Pie Picache however joins in being the comic relief of her character's vanity.\n\nFeng Shui 2 gets a little absurd, but then this is just the director having fun with whatever he does best in this genre. There's plenty of smart new ideas in its storyline and memorable creeps around the corner. Whatever compromises at the final act is for the sake of having extra suspense. And they actually work, but sometimes there is a sense where it has the potential of being a far more compelling film, probably if it lives up more to its first half. Then again, there's nothing wrong if the movie is enjoying itself. It own entertainment alone is an easy recommendation.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt3837198/"
}