{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Víctor Huggo Martin",
            "url": "/name/nm0553186/"
        },
        {
            "@type": "Person",
            "name": "Gael García Bernal",
            "url": "/name/nm0305558/"
        },
        {
            "@type": "Person",
            "name": "Patricia Velasquez",
            "url": "/name/nm0892383/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1250,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052980/"
        },
        {
            "@type": "Person",
            "name": "Stephen Tolkin",
            "url": "/name/nm0006809/"
        },
        {
            "@type": "Person",
            "name": "Georgie Anne Geyer",
            "url": "/name/nm1118173/"
        },
        {
            "@type": "Person",
            "name": "Robert E. Quirk",
            "url": "/name/nm8654961/"
        }
    ],
    "datePublished": "2002-01-27",
    "description": "Fidel Castro rises to power in Cuba.",
    "director": [
        {
            "@type": "Person",
            "name": "David Attwood",
            "url": "/name/nm0041118/"
        }
    ],
    "duration": "PT3H26M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE5MTEyMDAwMF5BMl5BanBnXkFtZTcwOTMxNTEyMQ@@._V1_.jpg",
    "keywords": "character name as title,forename as title,fidel castro character,male full frontal nudity,fidel castro",
    "name": "Fidel",
    "original_info": {
        "id": "Fidel_2002",
        "name": "Fidel",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "esteban1747"
        },
        "dateCreated": "2005-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0258351/"
        },
        "name": "Average film",
        "reviewBody": "It is certainly very difficult for someone to prepare well a film about Fidel Castro and Cuban Revolution. One lengthy film is not enough, may be some sequels are the best way to show something consistent. The director and producers should be obviously people neutral trying to show good and bad of this process. The film from historical point of view has a lot of incoherences, persons like Fidel and Raúl Castro as well as Che Guevara are badly played. Fidel Castro is not so sweet talking as you can see him in this film, while Guevara was a man with culture and deep in his arguments, Gael García Bernal played a role far to be Che Guevara. There are also some doubtful scenes and assertions, e.g. young Fidel Castro arguing with the American Ambassador after the American marines raped the monument of José Martí. Historically there is no evidence that Castro had such a discussion with the ambassador. Raúl Castro was never sympathetic to the leader of Orthodox party, Eduardo Chivas. Raúl was a member of the youth of the so-called Partido Socialista Popular (Communist), and this party had no good relationship with Orthodox party, so the scene of Raúl running together with Fidel at the time Chivas shot himself is not real. Celia Sánchez died several years after the revolutionary offensive, which happened in 1967. Che Guevara resigned as Minister and went first to Congo, then came back to Cuba in order to prepare the guerrilla for Bolivia. Thus the film was wrong showing that Guevara resigned and went directly to Bolivia. Any film about Cuban Revolution should give some space to Camilo Cienfuegos' life, a real hero of the Cuban Revolution, who was badly shown in the film. The figure of Dr. Osvaldo Dorticos, the second president during the Revolution, who killed himself, is absent in the film. Hubert Matos' problem was touched superficially, the same is applicable to the case of General Ochoa, just mentioned slightly at the end of the film and mixed with Mariel exodus, the latter happened in 1980 while Ochoa was arrested and processed in 1989. The relationship between Cuba and USSR was historically very complicated, and shifting from time to time. I can make a longer list of historical shortcomings of this film, but it also has the Mexican accent of the actors talking in Spanish plus some extras that do not look at all as Cubans. To prepare a good material about Cuba you must have more mulatos and black people (no less than 40% of Cuban population) participating in the film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0258351/"
}