{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Laura Harris",
            "url": "/name/nm0364977/"
        },
        {
            "@type": "Person",
            "name": "Chris William Martin",
            "url": "/name/nm0552072/"
        },
        {
            "@type": "Person",
            "name": "Todd Talbot",
            "url": "/name/nm0847982/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 484,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Fifteen",
    "contentRating": "TV-14",
    "datePublished": "1991-02-02",
    "description": "'Fifteen' follows the students of fictional Hillside School and dealt with a variety of issues including dating, divorce, alcohol abuse, and friendship. The show played heavily into stereotypes, including two characters named Dyla...",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDkzYzRlZTUtZjA4NC00NGZiLWI3MGUtZjZjYjk5NTcxMWYwXkEyXkFqcGdeQXVyNTA3MTU2MjE@._V1_.jpg",
    "keywords": "1990s,timeframe 1990s,high school,fictional band",
    "name": "Hillside",
    "original_info": {
        "id": "Fifteen & Pregnant_1998",
        "name": "Fifteen & Pregnant",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Eschete"
        },
        "dateCreated": "2005-04-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101099/"
        },
        "name": "Why Did I Suddenly Remember This Show?",
        "reviewBody": "I was talking to my nephew about bad television shows the other day when this one came to mind. I remember watching it with friends in junior high just to laugh at how stupid and badly-produced it was. All I can really remember is a character named Dylan (who was supposed to be a rebel) and Dylan's ugly girlfriend. Why were so many characters named Dylan in the early nineties? What a stupid name.\n\nAnyway, in one episode, Dylan plays the guitar down at the local \"teen scene\"/maltshop place. They seem to have actually let the actor play...and he was HORRIBLE. He made several grating, audible mistakes and they just LEFT THEM IN. No post-edit! And, when the actor finished, the audience clapped and cheered. I remember laughing and laughing at this episode. And talk about wooden acting! Oh! They had the obligatory \"anti-alcohol\" episode. And one kid had to pretend to be drunk. Oh, God! I'd give anything to see this show again! A+ for camp, F- for quality."
    },
    "url": "/title/tt0101099/"
}