{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "A.J. Cook",
            "url": "/name/nm0176882/"
        },
        {
            "@type": "Person",
            "name": "Ali Larter",
            "url": "/name/nm0005123/"
        },
        {
            "@type": "Person",
            "name": "Tony Todd",
            "url": "/name/nm0865302/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 172166,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100462/"
        },
        {
            "@type": "Person",
            "name": "J. Mackye Gruber",
            "url": "/name/nm0344259/"
        },
        {
            "@type": "Person",
            "name": "Eric Bress",
            "url": "/name/nm0107774/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Reddick",
            "url": "/name/nm0714695/"
        }
    ],
    "datePublished": "2003-01-31",
    "description": "Kimberly has a premonition of an accident killing multiple people including her and her friends. She blocks the cars behind her on the ramp and as a police trooper arrives, the accident happens. Death is stalking this group of sur...",
    "director": [
        {
            "@type": "Person",
            "name": "David R. Ellis",
            "url": "/name/nm0254786/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjExMTMyODAzN15BMl5BanBnXkFtZTYwNjc5NDQ3._V1_.jpg",
    "keywords": "repeat sequel,scantily clad female,cheating death,single mother,woman in jeopardy",
    "name": "Final Destination 2",
    "original_info": {
        "id": "Final Destination 2_2003",
        "name": "Final Destination 2",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jimboduck"
        },
        "dateCreated": "2005-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0309593/"
        },
        "name": "Shock Value -- 7 (Good Flick)",
        "reviewBody": "You know that feeling you get when you're watching America's Funniest Home Videos and the oblivious son hits his hapless father in the crotch with an aluminum bat? It gets a quick reaction, like, ooh, I feel your pain man. FINAL DESTINATION 2 is a 90 minute or so string of those painful shots, as each character one by one meets an unfortunate death by household appliance. Bodies are slammed by trucks, heads are impaled, and limbs fly through the air. When one of the characters dies when her car's airbag explodes out of nowhere, I blurted \"Yeah! Wow, did they do that??? Yeah, they DID do that. Right on!\" Although the film has a very serious atmosphere about it, what with the creepy score and people sincerely freaking out and everything, it still retains a campy humor about it buried beneath its high-budget exterior. Many movies would shy away from smashing up plastic ketchup-filled dummies, opting instead to avoid the gore. Not FINAL DESTINATION 2! This movie is an honest approach to movie-making, hearkening back to the day when you got together with friends and said, \"Okay, in this scene we cut to the dummy falling off the building, it's run over by a Mack truck, and it splatters chunks of blood all over that Oldsmobile over there.\" As for the premise behind FINAL DESTINATION 2, how do I put it into words? A.J. Cook has premonitions that people died in a nasty pileup on the highway. Thing is, this never happened. And ... she continues to have premonitions that those same people will die in due time. Those people eventually die. Did I get that right? The universal law of nature is that, well, Death sometimes misses its mark and has to fix its mistakes (which usually involves electrical equipment getting wet and other freak accidents of home improvement). If this all sounds convoluted, watch the movie. You'll see what I mean. The premise of FINAL DESTINATION 2, as much potential as it might have, doesn't make much sense and is pretty hokey, but if you medicate your inquisitive mind with heavy sedatives, you'll be able to look past the flimsy premise and enjoy the movie. I'm definitely looking forward to a Final Destination 3.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from New Line Cinema",
        "duration": "PT1M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi799277337",
        "name": "Final Destination 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTgyNzRmMTktNWIxOS00ZWRiLTgyNzEtZjZmY2JiZmRiNmFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTgyNzRmMTktNWIxOS00ZWRiLTgyNzEtZjZmY2JiZmRiNmFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:57:43Z",
        "url": "https://www.imdb.com/video/vi799277337/"
    },
    "url": "/title/tt0309593/"
}