{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Rob Brown",
            "url": "/name/nm0114532/"
        },
        {
            "@type": "Person",
            "name": "F. Murray Abraham",
            "url": "/name/nm0000719/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 87428,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0248885/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103746/"
        },
        {
            "@type": "Person",
            "name": "Mike Rich",
            "url": "/name/nm0723692/"
        }
    ],
    "datePublished": "2001-01-12",
    "description": "A young writing prodigy finds a mentor in a reclusive author.",
    "director": [
        {
            "@type": "Person",
            "name": "Gus Van Sant",
            "url": "/name/nm0001814/"
        }
    ],
    "duration": "PT2H16M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk5MjQ4MjcyOF5BMl5BanBnXkFtZTYwNTMzODg2._V1_.jpg",
    "keywords": "school,basketball,writing,new york,mentor",
    "name": "Finding Forrester",
    "original_info": {
        "id": "Finding Forrester_2000",
        "name": "Finding Forrester",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2001-02-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0181536/"
        },
        "name": "On The Resilience Of The Human Spirit",
        "reviewBody": "A reclusive author, whose only published novel won the Pulitzer Prize, becomes the mentor of an underprivileged and talented sixteen-year-old in `Finding Forrester,' directed by Gus Van Sant and starring Sean Connery and newcomer Rob Brown. Young Jamal Wallace (Brown) is a star basketball player in his neighborhood, and-- unbeknownst to his peers-- also has a gift for writing. The acceptance he needs from his friends, however, that need to `fit in,' is derived from playing ball; yet his heart is in his writing. But he knows that within the limited confines of his environs his skill with the written word means next to nothing in regards to his future, and he sees basketball as the only viable means of doing anything worthwhile with his life. That is, until one day circumstances bring him into contact with William Forrester (Connery); and it's an encounter that ultimately changes the direction of his life forever. \tWorking from an intelligent, well crafted screenplay by Mike Rich, Van Sant establishes the milieu within which the story will unfold with his opening shot: A black youth setting the stage in rap. It's clever and effective, and the contrast between the rap at the beginning and the song at the end not only frames the film but underscores the impact of the story, as it succinctly encapsulates the changes in Jamal's life. As he did with `Drugstore Cowboy' and `Good Will Hunting,' Van Sant successfully captures the essence of a particular culture and how those living within it relate to those apart from it. It's a study of human nature and the levels of diversity of which our society is comprised, and Van Sant does it exceedingly well. \tAs far as performances go, Connery makes the most of one of his best roles in years. Perfectly cast as Forrester, he lends an adamant toughness to the character initially, then slowly and subtly allows the vulnerability that lies beneath the gruff exterior to surface. It makes for a well-rounded, complete portrayal, as we see not only his iconoclastic leanings, but the very human and caring side of the man as well. And it's Connery's superlative performance, through which he conveys the complexities of the character so well, that illuminates the true depth and multi-faceted dimensions of Forrester; it is not only memorable, but worthy of an Oscar. In his motion picture debut, Brown takes the screen by storm; a storm that is at once gentle and discerning, yet endowed with a strength born of it's own momentum. With a manner reminiscent of Cuba Gooding Jr. in `Boyz N the Hood,' he has a natural acting ability that commands attention, and if his performance here is any indication of his talents (which obviously it must be), then it is safe to say that the cinematic world has certainly just been enriched by his presence. \tThe supporting cast includes F. Murray Abraham (Professor Robert Crawford), Anna Paquin (Claire), Busta Rhymes (Terrell), April Grace (Ms. Joyce), Michael Pitt (Coleridge) and Michael Nouri (Dr. Spence). An uplifting example of deriving hope from hopelessness, `Finding Forrester' is an entertaining and moving testimony to the resilience and depth of the human spirit. It's a film that will stay with you long after the screen has gone dark, for there is much here to be savored and embraced; a film too good to be allowed to let pass you by. I rate this one 9/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Finding Forrester",
        "duration": "PT2M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4146706457",
        "name": "Finding Forrester",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzJkMzI2ZWUtNTFmMC00OTM4LWJhNWYtMWRkN2E4NTlmYzg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzJkMzI2ZWUtNTFmMC00OTM4LWJhNWYtMWRkN2E4NTlmYzg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2018-03-10T17:08:23Z",
        "url": "https://www.imdb.com/video/vi4146706457/"
    },
    "url": "/title/tt0181536/"
}