{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harvey Keitel",
            "url": "/name/nm0000172/"
        },
        {
            "@type": "Person",
            "name": "Tisa Farrow",
            "url": "/name/nm0268533/"
        },
        {
            "@type": "Person",
            "name": "Jim Brown",
            "url": "/name/nm0000987/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2714,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007508/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0686884/"
        },
        {
            "@type": "Person",
            "name": "James Toback",
            "url": "/name/nm0864812/"
        }
    ],
    "datePublished": "1978-08-23",
    "description": "A dysfunctional young man is pulled between loyalties to his Italian mob-connected loan-shark father and his mentally-disturbed Jewish concert-pianist mother.",
    "director": [
        {
            "@type": "Person",
            "name": "James Toback",
            "url": "/name/nm0864812/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Crime",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2I2MDU1ZDAtZDM4Ny00Y2VhLThlZjEtZjMwNDY1MGRiZmU2XkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_.jpg",
    "keywords": "timeframe 1970s,female rear nudity,sorority,loan shark,debt collector",
    "name": "Fingers",
    "original_info": {
        "id": "Fingers_1978",
        "name": "Fingers",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Hey_Sweden"
        },
        "dateCreated": "2012-03-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077549/"
        },
        "name": "Worth seeing for Keitel's performance.",
        "reviewBody": "\"Fingers\" is the offbeat, intriguing study of one dysfunctional character, Jimmy (Harvey Keitel), a man who straddles two distinct worlds. In one, he's the reluctant debt collector for his mobster father Ben (Michael V. Gazzo), and a man who won't hesitate to use violence to get the job done. However, he's also an obsessive music lover, and talented pianist with the lofty ambition of performing at Carnegie Hall. He puts off what will prove to be a brutal confrontation at the end to pursue the spaced-out Carol (Tisa Farrow). Writer / director James Toback's unique little movie is more than just the typical NYC gangster picture. It does feature excellent use of NYC locations, and it does have some very brutal moments, but is a decidedly laid back rather than intense experience, with deliberate pacing. The movie is marked by a very erotic quality, whether Jimmy is making the acquaintance of the sexually charged club owner Dreems (Jim Brown, in a captivating low key portrayal), or having an encounter with Julie (Tanya Roberts). We even get a glimpse of Keitel nudity, 14 years before he bared all in Abel Ferrara's \"Bad Lieutenant\". The movie has a serious, somber mood, yet at the same time is not without some humour. It's a very good vehicle for Keitel, who really throws himself into the twisted main role; other familiar faces such as Danny Aiello, Ed Marinaro, Marian Seldes, Lenny Montana, Tom Signorelli, Frank Pesce, and Zack Norman comprise the supporting cast, and the movie is now notable for co-starring two future 'Sopranos' regulars, Tony Sirico as young mobster Riccamonza and Dominic Chianese as Arthur Fox. But Keitel is truly the one to watch playing an obviously flawed, yet compelling individual with more than his fair share of psycho sexual problems, a certain arrogance, and a tendency towards explosive behaviour who also wants something more out of life. Film fans looking for something a little off the beaten path and deserving of more attention are advised to check out \"Fingers\", as it refrains from ever being too predictable and tells its story in a very straightforward manner. It's gritty and provocative and rather memorable as well; it's not for all tastes but is rewarding for those who seek it out. Seven out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A dysfunctional young man is pulled between loyalties to his Italian mob-connected loan shark father and his mentally disturbed Jewish concert pianist mother.",
        "duration": "PT3M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3692282649",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWZhNGRiZDktOTUwYy00N2RhLWFhNGMtYjE1ZWViNTIxOTcyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWZhNGRiZDktOTUwYy00N2RhLWFhNGMtYjE1ZWViNTIxOTcyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-21T17:12:18.651Z",
        "url": "https://www.imdb.com/video/vi3692282649/"
    },
    "url": "/title/tt0077549/"
}