{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anna Thomson",
            "url": "/name/nm0505764/"
        },
        {
            "@type": "Person",
            "name": "Felicia Maguire",
            "url": "/name/nm0536568/"
        },
        {
            "@type": "Person",
            "name": "Alyssa Mulhern",
            "url": "/name/nm0611821/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 629,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074867/"
        },
        {
            "@type": "Person",
            "name": "Amos Kollek",
            "url": "/name/nm0464180/"
        }
    ],
    "datePublished": "1999-09-11",
    "description": "Despite the fact that Fiona has lived apart from her mother, they lead parallel lives as bi-sexual prostitutes. The meeting of the two women spells tragedy for the mother and hope for the daughter.",
    "director": [
        {
            "@type": "Person",
            "name": "Amos Kollek",
            "url": "/name/nm0464180/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI5Nzc4MTcyOF5BMl5BanBnXkFtZTcwMTM2NzAyMQ@@._V1_.jpg",
    "keywords": "erect penis,unsimulated fellatio,blowjob,blow job,male frontal nudity",
    "name": "Fiona",
    "original_info": {
        "id": "Fiona_1998",
        "name": "Fiona",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "honeybearrecords"
        },
        "dateCreated": "2005-03-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0168787/"
        },
        "name": "Cassavetes on Crack",
        "reviewBody": "Amos Kollek must be crazy. \"Fiona\" is a film not only about prostitutes and crack addicts. It was an entire supporting cast of the real deal. Not just extras, several of the main characters are actual prostitutes and crack addicts with much of the film shot in a NYC crack house / crash pad. This is about as heavy duty as you can get without it being a documentary. Actually, this is beyond documentary because Kollek is no quiet observer. He's in there as a director working closely with the drug addicts and prostitutes. It's Dogma taken in a weird, dangerous and, inadvertently, titillating direction.\n\nThe story follows a young woman, Fiona (Anna Thomson) from her recollections of being sexually abused in a foster home to her adventures on the streets. The plot turns Oedipal as we meet her mother, who is a much more weathered prostitute working the same streets. Eventually, their paths meet and our streetwise Ophelia finally transcends her destiny by taking control of it.\n\nYeah, it's a simple plot. But the plot is really just a hanger with which a series of vignettes, both shocking and touching, are draped. Kollek's previous film, \"Sue\" (which also starred Anna Thomson), let him wear his influences on his sleeve as it clearly brings Cassavettes to mind. \"Fiona\" lets him take it to it's logical extent which, while most people will remember the grim moments, also allowed for some very real moments unlike anything you'll see at the multi-plex.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0168787/"
}