{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Nathan Fillion",
            "url": "/name/nm0277213/"
        },
        {
            "@type": "Person",
            "name": "Gina Torres",
            "url": "/name/nm0868659/"
        },
        {
            "@type": "Person",
            "name": "Alan Tudyk",
            "url": "/name/nm0876138/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 270042,
        "ratingValue": 9,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056447/"
        },
        {
            "@type": "Person",
            "name": "Joss Whedon",
            "url": "/name/nm0923736/"
        }
    ],
    "datePublished": "2002-09-20",
    "description": "Five hundred years in the future, a renegade crew aboard a small spacecraft tries to survive as they travel the unknown parts of the galaxy and evade warring factions as well as authority agents out to get them.",
    "genre": [
        "Adventure",
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTcwNzkwMDItZmM1OC00MmQ2LTgxYjgtOTNiNDgxZDAxMjk0XkEyXkFqcGdeQXVyNDQ0MTYzMDA@._V1_.jpg",
    "keywords": "future,outer space,single season tv series,one word series title,neo western",
    "name": "Firefly",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Darknessinthesky"
        },
        "dateCreated": "2004-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0303461/"
        },
        "name": "You will either love it, or hate it - read why...",
        "reviewBody": "There is one big premise that you have to swallow in order to like this show. If you can't cope with it, you won't like it, because it will smack you in the face in every episode.\n\nIt is like the James Bond movies, if you don't accept, as a premise, that Bond, James Bond, can do everything, fly, drive, shoot, use *every* piece of machinery on the planet, that he can shoot better than all his adversaries (who all miss, all the time) and gets *all* the babes, if you don't accept this, you have to hate James Bond movies, because they are ridiculous. We talk about suspense of disbelief.\n\nThe one thing you have to swallow, without thinking about it, is, that in this particular science fiction universe, the future looks like this:\n\n You have core planets, which are like one would imagine future worlds: Big, beautiful buildings, hight tech gadgets, spaceships and shuttles, modern weapons (some that don't kill by using some kind of sonic boom), flat displays, a modern, digital credit system instead of localised currency, a totally diverse people influenced by every imaginable culture, heavily influenced by the chinese society, the only remaining superpower besides the USA and so forth.\n\nBut, and this is a capitalized BUT: There are also the outer rim planets. They don't have a developed infrastructure and such. Settlers are dumped on planets with next to nothing, exploited to recover raw materials, used as cheap labor, trying to survive. Still sounds reasonable, no? The catch is: all these outer rim worlds look like you have been thrown into a cheap spaghetti WESTERN movie.\n\nThey trade cows, they use old revolvers, drive horses and dress in western-style garments. You have little, old, dirty small villages with a saloon and stuff. These outer rim planets, out of reach of the civilised Alliance, are a no-mans-land, with superstitious, uneducated fools, where the strong fist rules - if you have the most men and guns behind you, you are the law. The poor grunt is like the cowboy in a typical western movie.\n\n Hard to accept? Partially yes, of course. But there is logic in almost everything: there are future references everywhere! Real food (as opposed to synthesized proteins) is a rare commodity, the RICH guys have laser guns or state of the art display devices.\n\nAnd - they stay true to this premise throughout the show, which is a rare thing in today's entertainment.\n\nBut apart from this (for some) hard to accept premise, this show is the most entertaining, clever, realistic(!), funny, imaginative, creative, thrilling piece of entertainment I had the pleasure of viewing (by downloading it from the internet) in years (don't get me wrong: I downloaded it because I live in Germany and the show was never aired here, and I asked my brother, who lives in the USA, to get me the DVD as a christmas present - and he did)\n\n As for realism: Why do they still use guns to kill people, why not lasers like in Star Trek (which i am avid fan of)? I say: guns kill people, bullets are cheap. Guns get the killing done. (And there are modern (bullet) guns and lasers in the show, they exist, they are simply not widespread and only available to the rich.\n\nNo sound in space - a little thing with big impact. Not only is it realistic, but it adds to the atmosphere. Instead of ridiculous sound effects the scenes in space are underlaid with vivid music, only emphasising the vastness and nothingness of space.\n\nThe basics of the universe comply with our world. In the outer rim, where modern civilization hasn't gotten a foothold yet, things - which are to us - common, are valuable merchandise! Just imagine the third world... How much worth are medicine, guns, food there? There are (to us) barbaric customs in uncivilised areas of the world and all this is being portrayed in the show.\n\n The Plots are great, not like in Enterprise where you seem to have seen everything somewhere before, these plots are unique, thrilling and exciting. I have seen episodes where I thought \"ok, I get it\" and then *wham* the story turns into a totally different direction. Surprises at every corner.\n\n The show is so refreshingly politically incorrect, I don't want to give away plot details, but there are situations you know from your movie/series experience and think OMG there we go again (Hostage situations someone?) and then*boom* - the protagonist does EXACTLY what WE would wish to do but which every movie/series is afraid of doing because it is not PC.\n\n The characters are three dimensional and so well laid out. This \"family\" on board a little spaceship, a confined space(!), with all their motivations, quirks and problems, trying to get along and achieve their goals, are so believable and make for a hell of a ride.\n\nThe creators of this show have, in the first 14 episodes, established plots, characters and atmosphere that other science fiction series have only managed to achieve - if ever - in the last seasons of their time on air.\n\n Such a pity that most American viewers couldn't see behind a bold, unique, hilarious - if difficult to accept at first glance - premise... and see the beautiful gem of a show behind it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Firefly Season 1 Trailer",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1961539609",
        "name": "Season 1 Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzM4ZmU4YWQtZWQ5Yi00Zjg4LTg0NGMtMzdjNDEyOGI3ZGM5XkEyXkFqcGdeQXVyNzI0Mzk4NTk@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzM4ZmU4YWQtZWQ5Yi00Zjg4LTg0NGMtMzdjNDEyOGI3ZGM5XkEyXkFqcGdeQXVyNzI0Mzk4NTk@._V1_.jpg",
        "uploadDate": "2018-01-27T00:47:31Z",
        "url": "https://www.imdb.com/video/vi1961539609/"
    },
    "url": "/title/tt0303461/"
}