{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Drew Barrymore",
            "url": "/name/nm0000106/"
        },
        {
            "@type": "Person",
            "name": "David Keith",
            "url": "/name/nm0001418/"
        },
        {
            "@type": "Person",
            "name": "Freddie Jones",
            "url": "/name/nm0428086/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35350,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Stephen King",
            "url": "/name/nm0000175/"
        },
        {
            "@type": "Person",
            "name": "Stanley Mann",
            "url": "/name/nm0542970/"
        }
    ],
    "datePublished": "1984-05-11",
    "description": "A couple who participated in a potent medical experiment gain telepathic ability and then have a child who is pyrokinetic.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark L. Lester",
            "url": "/name/nm0504495/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Action",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzFiZTQ4ZjQtNjgyZi00Yjc0LWI2Y2YtNjk0YzM3NWEwYjYzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "pyrokinesis,experiment,fire,psychic,doctor",
    "name": "Firestarter",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2012-10-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087262/"
        },
        "name": "Great Cast but the Film is a Flop",
        "reviewBody": "Firestarter (1984) \n\n** (out of 4) \n\nWeak adaptation of the Steven King novel about a young child named Charlie (Drew Barrymore) who has the special power of being able to set things on fire by just using her thought. She's on the run with her father (David Keith) from various government people wanting to exploit her talent as she tries to control her gift. I haven't read the novel that this movie is based on so I can't comment on what this got right or wrong. However, I'm one who never expects a movie to follow the book 100% so with that in mind I can only say that this film is a complete mess. Thankfully this thing offers up an all-star cast including some legends because without them this film would be nearly impossible to get through. Clocking in just under two-hours, the film feels twice as long and I think a lot of the blame has to go to director Mark L. Lester. His direction is all over the place and not for a second did I feel any tension in the story and I also thought the pacing was pretty bad. I will say that not all of this might be his fault because the screenplay itself has a fair number of problems. One such problem is that the entire thing never really seems to know what it wants to do. Is it a horror film? Science fiction? Is it trying to be some sort of hard, negative look at the government and their powers? The film is all over the map in regards to what it's trying to do but sadly it doesn't do any of them very well. The performances are actually pretty good and are the best thing in the film. Barrymore delivers a strong and believable performance as the haunting girl and I've always liked Keith in just about everything he's done. Heather Locklear does a nice job in her scenes as the mother and we get vets like Martin Sheen and George C. Scott offering up fine performances. The highlight of the film deals with a couple farmers played by Art Carney and Louise Fletcher. Yes, FIRESTARTER has three Oscar-winning actors. The special effects are another plus and help give the film some energy. I must admit that the entire story struck me as being silly and especially early on as we see Keith's character getting nosebleeds from doing his psychic powers and Barrymore crying from setting people on fire. These scenes really made me laugh the majority of the time and once we keep seeing the same thing over and over it just gets boring."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Firestarter",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3273564953",
        "name": "Firestarter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWUyZjAzOTktNGE5Yi00N2IzLTkxMzktNmRhYTI1MGVlOWRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWUyZjAzOTktNGE5Yi00N2IzLTkxMzktNmRhYTI1MGVlOWRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-04-20T03:17:04Z",
        "url": "https://www.imdb.com/video/vi3273564953/"
    },
    "url": "/title/tt0087262/"
}