{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Buster Crabbe",
            "url": "/name/nm0185568/"
        },
        {
            "@type": "Person",
            "name": "Jean Rogers",
            "url": "/name/nm0736939/"
        },
        {
            "@type": "Person",
            "name": "Charles Middleton",
            "url": "/name/nm0585481/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2517,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0679150/"
        },
        {
            "@type": "Person",
            "name": "Alex Raymond",
            "url": "/name/nm0713204/"
        },
        {
            "@type": "Person",
            "name": "Frederick Stephani",
            "url": "/name/nm0826873/"
        },
        {
            "@type": "Person",
            "name": "Ella O'Neill",
            "url": "/name/nm0642150/"
        }
    ],
    "datePublished": "1936-04-06",
    "description": "Flash Gordon, Dale Arden and Dr. Alexis Zarkov visit the planet Mongo to thwart the evil schemes of Emperor Ming the Merciless, who has set his planet on a collision course with Earth.",
    "director": [
        {
            "@type": "Person",
            "name": "Frederick Stephani",
            "url": "/name/nm0826873/"
        },
        {
            "@type": "Person",
            "name": "Ray Taylor",
            "url": "/name/nm0853028/"
        }
    ],
    "duration": "PT4H5M",
    "genre": [
        "Action",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODUxMjQzZjMtNjJiMC00OTc2LTlmNWMtNGVkYTFjOTU3YjljXkEyXkFqcGdeQXVyMTE2NzA0Ng@@._V1_.jpg",
    "keywords": "serial,national film registry,daughter betrays father,b movie,cliffhanger",
    "name": "Flash Gordon",
    "original_info": {
        "id": "Flash Gordon: Space Soldiers_1936",
        "name": "Flash Gordon: Space Soldiers",
        "year": "1936"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2005-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0027623/"
        },
        "name": "A Cult Movie With a Magnificent Transposition of Alex Raymond's Cartoon to the Big Screen",
        "reviewBody": "When a mysterious planet is menacing to collide on Earth, the athlete Flash Gordon (Buster Crabbe) flies by plane to meet his father in New York and stay with him during the collision. While traveling, Flash meets the blonde passenger Dale Arden (Jean Rogers) and they become friends. However, their plane falls, and Flash and Dale jump together using the same parachute. They land nearby the laboratory of Dr. Alexis Zarkov (Frank Shannon), who invites them to join him in a travel in his rocket to the threatening planet in an attempt to avoid the eminent destruction of Earth. When they arrive in the planet, they meet Ming the Merciless (Charles Middleton), the emperor of Planet Mongo, who wants to destroy Earth, and his daughter, Princess Aura (Priscilla Lawson), who has an infatuation for Flash Gordon. This is the beginning of a magnificent transposition of Alex Raymond's cartoon to the big screen, in a cult movie. The story is divided in thirteen chapters as follows:\n\n1) The Planet of Peril (\"O Planeta do Perigo\") 2) The Tunnel of Horror (\"O Túnel do Terror\") 3) Captured by Shark Men (\"Capturado Pelos Homens-Tubarão\") 4) Battling the Sea Beast (\"Enfrentando a Fera do Mar\") 5) The Destroying Ray (\"O Raio da Destruição\") 6) Flaming Torture (\"Tortura Flamejante\") 7) Shattering Doom (\"Perdição Quebrada\") 8) Tournament of Death (\"Torneio da Morte\") 9) Fighting the Fire Dragon (\"Lutando Contra o Dragão de Fogo\") 10) The Unseen Peril (\"O Perigo Invisível\") 11) In the Claws of the Tigron (\"Nas Garras de Tigron\") 12) Trapped in the Turret (\"Encurralado na Torre\") 13) Rocketing to Earth (\"Voando Para a Terra\")\n\nThe adventure of Flash Gordon in Planet Mongo shows all the characters of the comic strip: he becomes friend of the Prince Thun (James Pierce), the leader of the Lion Men, a people enemy of Ming. He is arrested by the Shark Men in the underwater Shark Palace of King Kala (Duke York Jr.), who is dominated by Ming. Flash Gordon allies to Prince Barin (Richard Alexander), who claims to be the inheritor of the Mongo's throne, and they fight against the Hawk Men, leaded by King Vultan (Jack 'Tiny' Lipson), in the palace in the air, becoming allied in the end. \n\nIn the Twentieth-First Century, the special effects of this film are very cheesy and dated, like in an Ed Wood movie: visible wires holding rockets and flying objects, quite ridiculous \"maquettes\" of the cities, the fire dragon, the fly and movements of the rockets with fire in the propellers, even the behavior of the character of Dale Arden, screaming, fainting, being paralyzed in the dangerous situations are very funny in the present days. But this is part of the entertainment, and the viewer must appreciate the film never forgetting when it was shot (1936). For the Brazilian readers, I would like to inform that the DVD released by Classicline has some mistakes in the translation. Inclusive some titles in Portuguese of the chapters written on back cover of the DVD are not correlated with the titles showed in the beginning of each chapter in the movie. My vote is eight.\n\nTitle (Brazil): \"Flash Gordon no Planeta Mongo\" (\"Flash Gordon in the Planet Mongo\")"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Flash Gordon, Dale Arden and Dr. Alexis Zarkov visit the planet Mongo to thwart the evil schemes of Emperor Ming the Merciless, who has set his planet on a collision course with Earth.",
        "duration": "PT3M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1176617753",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjcyNDBkNzQtZTE5Yy00YzI2LWE2MTktMjAzMzU2YTkyNDBjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjcyNDBkNzQtZTE5Yy00YzI2LWE2MTktMjAzMzU2YTkyNDBjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-10T20:25:46.325Z",
        "url": "https://www.imdb.com/video/vi1176617753/"
    },
    "url": "/title/tt0027623/"
}