{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jennifer Beals",
            "url": "/name/nm0000884/"
        },
        {
            "@type": "Person",
            "name": "Michael Nouri",
            "url": "/name/nm0636694/"
        },
        {
            "@type": "Person",
            "name": "Lilia Skala",
            "url": "/name/nm0803785/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 56049,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106129/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102770/"
        },
        {
            "@type": "Person",
            "name": "Thomas Hedley Jr.",
            "url": "/name/nm0373320/"
        },
        {
            "@type": "Person",
            "name": "Joe Eszterhas",
            "url": "/name/nm0000390/"
        }
    ],
    "datePublished": "1983-04-15",
    "description": "A Pittsburgh woman with two jobs as a welder and an exotic dancer wants to get into ballet school.",
    "director": [
        {
            "@type": "Person",
            "name": "Adrian Lyne",
            "url": "/name/nm0001490/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmRlOTFiYjAtMzkyNy00MTA0LThiNzctYWVkODExMDQ0ZjViXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "ballet,brunette,dance movie,sweaty woman,workout",
    "name": "Flashdance",
    "original_info": {
        "id": "Flashdance_1983",
        "name": "Flashdance",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bbhlthph"
        },
        "dateCreated": "2003-11-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085549/"
        },
        "name": "Flashdance clearly provides what many viewers want",
        "reviewBody": "There are already many comments on this film in the IMDb database, and I had no intention of writing another until to my surprise I noticed that it was frequently being replayed on several different local TV channels. Flashdance is a very outdated movie that has never appealed to most film critics, so I felt this was sufficiently unusual to justify an attempted explanation.\n\n\tSince the DVD of Flashdance was released, it has appeared for hire in many small local convenience stores and service stations that only maintain a very small rack of films for hire Clearly although it is now very much of a period movie, it continues to retain an enormous appeal for many of those who have seen it before. Personally I have watched our tape of Flashdance more often than most of the other tapes we have at home. This is not because it would be my first choice, but because it is a film that my wife loves to watch again and again; whilst I find I can view it repeatedly more readily than many of her other favorite tapes, so when we are discussing what to view and have rejected a number of other possibilities we tend to turn back to Flashdance. This reinforces the comments already made in your database about Flashdance being a \"feel good\" movie for which most people seem able to ignore the faults and just enjoy the music, the dancing and the romance. (It also features \"Grunt\", a very appealing dog, who remains one of the reasons why my wife is always ready to rewatch this film.) As a film Flashdance is therefore something of a paradox. Originally the final product was not very highly regarded by the studio and only received a limited release. This was severely panned by most of the critics, and not surprisingly the film initially received very little support from the public. The reviews and the low attendance led to plans to withdraw it from circulation early, but before these were implemented the audiences started to grow and continued to increase until cinemas showing the film were mostly packed out. Clearly those few who saw the film at an early showing started telling their friends to ignore the critics and see it. This escalated exponentially until the film finished up as a major hit. In commenting on this film it would be equally invalid to ignore the very real concerns of the critics or the equally real appeal it had, and still seems to have, for most of the public.\n\n\tThe story is trite - a female welder in a steelworks dreams of being a ballet dancer and practices her dancing in one of the local bars at night. Here she meets and starts to fall in love with her fairly young divorced boss. With his support she is able obtain an audition with a major dance company who are essentially only interested in her dance training, and lose any interest they may have had when she says she has never attended a dance school. However she proceeds to audition for the very bored selection committee and gives an electrifying free dance performance that in true fairy story tradition brings the committee to its feet. Some critics have complained that doubles replaced the star Jennifer Beals for this sequence, but this is surely not important - the real question is how effectively the film plays, and this sequence has rightly been very widely admired. About the time the film was released, modern dance companies were being formed alongside traditional ballet companies in many major cities in North America and this sequence certainly added to the appeal of the film at the time, but it is decidedly not the only reason for watching it.\n\n\t\tI could spend pages criticizing the screenplay in several different respects, but other comments in your database have already done this, and these criticisms are ultimately not damming. The important thing is that the film maintains an ongoing flow which sweeps most viewers along and earns it a place as one of the finer musical comedies to have been released in the past quarter century. The object of a film is to entertain the public and in ranking Flashdance I feel I must base my rating on its undeniable success in doing just this. So 7 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Newly Remastered Limited Edition",
        "duration": "PT11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3623861785",
        "name": "Flashdance",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGE4YTJiNDktNmU5YS00OTQ2LTkxZGItMWI4NTkxMzU2NjAxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGE4YTJiNDktNmU5YS00OTQ2LTkxZGItMWI4NTkxMzU2NjAxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-04-21T17:01:57.675Z",
        "url": "https://www.imdb.com/video/vi3623861785/"
    },
    "url": "/title/tt0085549/"
}