{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Buster Crabbe",
            "url": "/name/nm0185568/"
        },
        {
            "@type": "Person",
            "name": "Jean Rogers",
            "url": "/name/nm0736939/"
        },
        {
            "@type": "Person",
            "name": "Charles Middleton",
            "url": "/name/nm0585481/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1002,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Ray Trampe",
            "url": "/name/nm0870816/"
        },
        {
            "@type": "Person",
            "name": "Norman S. Hall",
            "url": "/name/nm0355963/"
        },
        {
            "@type": "Person",
            "name": "Wyndham Gittens",
            "url": "/name/nm0321216/"
        }
    ],
    "datePublished": "1938-03-21",
    "description": "When a deadly Nitron ray strikes Earth, Flash Gordon and his friends travel to Mars to battle Ming the Merciless and his new ally Queen Azura.",
    "director": [
        {
            "@type": "Person",
            "name": "Ford Beebe",
            "url": "/name/nm0066247/"
        },
        {
            "@type": "Person",
            "name": "Robert F. Hill",
            "url": "/name/nm0384616/"
        },
        {
            "@type": "Person",
            "name": "Frederick Stephani",
            "url": "/name/nm0826873/"
        }
    ],
    "duration": "PT4H59M",
    "genre": [
        "Action",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYwNjQyNjAzN15BMl5BanBnXkFtZTgwNTQ0NzkxMjE@._V1_.jpg",
    "keywords": "flash gordon character,ming the merciless character,psychotronic film,camp,queen",
    "name": "Flash Gordon's Trip to Mars",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "daveosh"
        },
        "dateCreated": "2002-04-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0030138/"
        },
        "name": "Great escapism; not quite as good as the 1st \"Flash\" serial",
        "reviewBody": "Some of my reactions to Flash Gordon serials (such as this one) are similar to my feelings about the original Star Trek series. I revel in the swashbuckling fun and the intensity of the experience. I marvel at the ingenious and original sci-fi elements, while chuckling at some of the increasingly dated technology and special effects. I roll my eyes at some of the overacting while secretly cherishing it. I question the plausibility of some of the plot elements, and wince at some of the social commentary that hasn't aged particularly well.\n\nIn Flash Gordon's Trip to Mars, many of the actors from the first serial return in their memorable roles. In particular, Buster Crabbe (Flash) and Charles Middleton (Ming) portray their characters with a great deal of flair. Jean Rogers (Dale Arden) seems more subdued and less memorable than in her previous outing. (This may reflect my disapproval of her transformation from a blonde to a short-haired brunette and her censor-demanded, conservative garb!) The new comic-relief journalist character (not present in the original comic strip), \"Happy\" Hapgood, seems to be a bit of a miscalculation, but his role falls far short of \"Jar-Jar\" level distraction.\n\nThe storyline is interesting, although things do drag a bit during the second half of the serial. The plot is primarily action-driven; the romantic story angles that percolated through the first series are virtually absent here. Although the world of Mars is not as diverse as Mongo's (Lionmen, Sharkmen, Hawkmen), the Clay People are a sad and interesting race. The acting and special effects both seem somewhat more polished than in the first serial. Although in one sense this is an improvement, it also removes some of the quirky fun. Overall, this is an enjoyable and memorable serial that fans of old sci-fi will want to seek out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0030138/"
}