{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "Philip Seymour Hoffman",
            "url": "/name/nm0000450/"
        },
        {
            "@type": "Person",
            "name": "Barry Miller",
            "url": "/name/nm0587944/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19186,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063961/"
        },
        {
            "@type": "Person",
            "name": "Joel Schumacher",
            "url": "/name/nm0001708/"
        }
    ],
    "datePublished": "1999-11-24",
    "description": "An ultraconservative security guard suffers a debilitating stroke and is assigned to a rehabilitative program that includes singing lessons with the drag queen next door.",
    "director": [
        {
            "@type": "Person",
            "name": "Joel Schumacher",
            "url": "/name/nm0001708/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTJlMGU2YjgtOTQzNS00ODNmLTg4OTEtM2Y5NDE3MTNjMjNlXkEyXkFqcGdeQXVyMTQ4NDY5OTc@._V1_.jpg",
    "keywords": "stroke,homosexual,gay interest,gay republican,female impersonator",
    "name": "Flawless",
    "original_info": {
        "id": "Flawless_1999",
        "name": "Flawless",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2000-07-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0155711/"
        },
        "name": "Examines The Flaws In All Of Us",
        "reviewBody": "An unlikely bond is formed between a conservative, retired New York City cop who has suffered a stroke, and a drag queen, in `Flawless,' written and directed by Joel Schumacher. Walter Koontz (Robert De Niro) is paralyzed on his right side, his speech is impaired and he can barely walk; to overcome his speech difficulties, he is encouraged by his doctor to try singing lessons, which in some cases like his have proved effective. Toward that end, he hires Rusty Zimmerman (Philip Seymour Hoffman), a neighbor in his apartment building, who performs at a local club in town. Formerly at odds with one another, the two form an alliance for their mutual benefit; Walter needs help, and Rusty needs the money. \tDe Niro, as always, turns in an outstanding performance here, so physically convincing and shading Walter's disability with such finesse, that you forget that this is an actor playing a role. Such is the magic De Niro can weave on the screen. Hoffman, too, is excellent as Rusty, the tortured soul who wouldn't wish his life on anyone, and who can readily identify with Walter's newly acquired sense of isolation and helplessness. He understands self-pity and tries to help Walter get past his own. There is nuance to his performance through which he conveys so well Rusty's subtle anxieties and the feeling of rancor that surrounds him, and with which he must live every day of his life. Also notable in a supporting role is Skipp Sudduth as Walter's friend, Tommy, who must deal with his own confusion in dealing with Walter's situation, and the people with whom he now finds him involved. Previous to the stroke, drag queens were definitely not a part of their immediate circle of friends. \tThe supporting cast includes Barry Miller (Leonard), Christopher Bauer (Jacko), Daphne Rubin-Vega (Tia) and Karina Arrovave (Amber). Schumacher has deftly crafted a character study that examines diversity and proffers the rewards of a symbiotic existence. The message here is that no one is flawless; we're imperfect creatures living together in an imperfect world, and if we can only get beyond ourselves and our prejudices, we just may find that gold at the end of the rainbow. `Flawless' is not without it's own flaws, either; some of the scenes involving the other drag queens and some of the criminal elements involved are somewhat overplayed at times, but that's a minor complaint. This film is deeply felt without being sentimental, and sheds some light on the human condition. It holds up a mirror to all of us, and asks the flawless among us to step forward. I rate this one 7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2870853145",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzk0YWU0MmEtNTk4My00OTE5LTg3OGUtMzA0ZWU2YWQ5ZDYwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzk0YWU0MmEtNTk4My00OTE5LTg3OGUtMzA0ZWU2YWQ5ZDYwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-02T18:49:53.855Z",
        "url": "https://www.imdb.com/video/vi2870853145/"
    },
    "url": "/title/tt0155711/"
}