{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jun Mizuki",
            "url": "/name/nm0594659/"
        },
        {
            "@type": "Person",
            "name": "Mayumi Shintani",
            "url": "/name/nm0794027/"
        },
        {
            "@type": "Person",
            "name": "Izumi Kasagi",
            "url": "/name/nm0440374/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18429,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071695/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002212/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090327/"
        }
    ],
    "datePublished": "2003-08-05",
    "description": "Mysterious things start happening when 12-year-old Naota meets a strange woman on a Vespa wielding a big guitar.",
    "genre": [
        "Animation",
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzkzYjI2YzMtZjllMS00MzRmLTk2MDMtZWY4Zjg4N2M2NmIxXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "robot,alien,mecha,guitar,vespa",
    "name": "FLCL",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lvlln"
        },
        "dateCreated": "2002-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0279077/"
        },
        "name": "The greatest anime of all time.",
        "reviewBody": "At first glance, FLCL seems like a foolish attempt at putting too much randomness into an anime. Indeed, it's impossible to summarize the show without making it sound completely stupid: \"It's about an alien woman who hits a boy with a guitar, and robots start popping out of his head.\" Yeah, that's gonna make people want to see it (not). But then again, it's also one of the most artistically perfect pieces of work ever.\n\n The best short summary I can come up with it is that it's a coming-of-age story about a wacky woman who takes advantage of a 12 year old boy. But that doesn't explain half of it. It perfectly molds hidden themes into a beautiful story. The style of this anime is incredibly unique. It completely departs from the classic realistic anime style, and seems to emulate more American cartoons by not letting the characters show very exaggerated characteristics at times.\n\nWhile it indeed is filled with craziness, there is an obvious and very strong structure to the plot. Every scene is intimately connected to every other scene, and it works perfectly. There are inherent themes about love, friendship, jealousy, and the discovery of all those as one grows up. I've read someone write that watching FLCL is like falling in love for the first time again, and it's a great description. After all, as a coming-of-age story, those are the feelings that the main character Naota is going through himself.\n\nThe music is simply the best in anime, period. Every major sequence has rock music by The Pillows in the background, and every time, it seems to fit perfectly with the scene. While the music is excellent by itself, it strengthens the emotions that FLCL is trying to deliver in those scenes.\n\n At just 6 episodes, it's short. But because of its shortness, the plot structure is incredibly tight, allowing it to have such great connections within. FLCL is simply an excellent work of art. Don't look at it as the best anime ever created. Look at it as a beautiful piece of art that chose anime as the medium to deliver itself in.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for FLCL: The Complete Series",
        "duration": "PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi480614937",
        "name": "FLCL: The Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWE0ZjQ5ZDktNzcwOS00MzZlLTllYzMtZGE5YWZkN2FjZmI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWE0ZjQ5ZDktNzcwOS00MzZlLTllYzMtZGE5YWZkN2FjZmI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-01-25T06:14:42Z",
        "url": "https://www.imdb.com/video/vi480614937/"
    },
    "url": "/title/tt0279077/"
}