{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lindsey Buckingham",
            "url": "/name/nm0118495/"
        },
        {
            "@type": "Person",
            "name": "Christine McVie",
            "url": "/name/nm0574730/"
        },
        {
            "@type": "Person",
            "name": "John McVie",
            "url": "/name/nm0574732/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 749,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067273/"
        }
    ],
    "datePublished": "1997-08-12",
    "description": "The long-awaited reunion of the \"Rumours\" version of Fleetwood Mac (Stevie Nicks, Christine McVie, John McVie, Mick Fleetwood, and Lindsey Buckingham) At this live MTV concert, they perform their greatest hits, and a few new songs...",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Gowers",
            "url": "/name/nm0332985/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ2OTQzOTI3Nl5BMl5BanBnXkFtZTgwNjQ1MzgwMzE@._V1_.jpg",
    "keywords": "tv special,concert film",
    "name": "Fleetwood Mac: The Dance",
    "original_info": {
        "id": "Fleetwood Mac: The Dance_1997",
        "name": "Fleetwood Mac: The Dance",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dust-7"
        },
        "dateCreated": "1999-11-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0123073/"
        },
        "name": "Great concert - gets better each time!",
        "reviewBody": "The big reunion concert, from a few years ago, of the battling and estranged members of Fleetwood Mac - concert apparently first shown on MTV.\n\nI never really like the studio cuts from this band. It was just more MOR AM fodder, one song sounding like the next - musically induced stupor; while the real bands were playing on the 'rockin' FM station somewhere.\n\nBut . . this isn't the same band, on the video. This band rocks. Maybe it's the 90s, and all music has more of an 'edge'. But for a bunch of 50+ rockers, these guys could give the Stones lessons in performing rock tunes.\n\nNow when I hear Gold Dust Woman from the studio album, in my head I'm hearing Stevie go off on 'you'd better SELL IT! Sell it!', and that soulful wail at the crescendo, from this vid. People around me think I've gone 'soft' or something - cause all they hear in the relatively insipid 70s AM version playing. Alas. I'm hearing something else. Like put _this_ album on the jukebox!\n\nI'd never heard Silver Springs, before. It's really a clever and interesting song, when performed with some heart. I'd never heard Buckingham's 'spanish guitar' inspired songs and riffs. It was really impressive - as was the effort he put in to obv. trying to compensate for his aging voice. At first it sounds forced, like some old guy who doesn't quite have it, anymore. Watch the vid over and over again, and it seems less and less to be like that, and more just a really good performance on his part.\n\nHard to believe Buckingham and Nicks started out as a bunch of naked folkies. They've come a long way. You can almost hear Deep Purple and Euro-rock in I'm So Afraid; and a really fitting vocal tone from Buckingham, here, as well. Very versatile. Even the sort of Romper Room feel of Christine's, I suppose 'pure' Mac, ditties sort of grow on you (like Temporary One) - I'd never heard those either. And her keyboard chords, for the other songs, are that extra dramatic 'touch' that you don't quite perceive, but you recognize.\n\nIt's also great to listen to the economy, but surprizing fill and power, of the notes just from Mick and John. Those two guys make a heck of rhythm section, as it were. Where Lindsey isn't exactly a blues picker or guitar hero, it doesn't matter in that the bottom and beat are so strong to catch any limitation where you expect more from the lead. The guys make it look too easy - just way too easy.\n\nIt's a video that the more you listen to/watch it, the BETTER it gets. Maybe that's true for music you like, maybe even films. But, it's a shame the 'Mac' couldn't have released something like this for the first albums (but then they wouldn't have had the polish, the sense, the wisdom and the heart, perhaps, that they have now, which makes it possible)."
    },
    "url": "/title/tt0123073/"
}