{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joe Dallesandro",
            "url": "/name/nm0198072/"
        },
        {
            "@type": "Person",
            "name": "Geraldine Smith",
            "url": "/name/nm0808318/"
        },
        {
            "@type": "Person",
            "name": "Patti D'Arbanville",
            "url": "/name/nm0001091/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2501,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0235980/"
        },
        {
            "@type": "Person",
            "name": "Paul Morrissey",
            "url": "/name/nm0607407/"
        }
    ],
    "datePublished": "1970-05-27",
    "description": "A man desperate for money and no income, turns prostitute and interplays with a variety of clients and hustlers.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Morrissey",
            "url": "/name/nm0607407/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjgwOGU4MjYtNmEwZi00MjlmLWFjYmMtZTA3N2ExM2UwZWUxXkEyXkFqcGdeQXVyMjIyNjE2NA@@._V1_.jpg",
    "keywords": "female topless nudity,sex scene,sexiness,male pubic hair,sex comedy",
    "name": "Flesh",
    "original_info": {
        "id": "Flesh (Andy Warhol)_1968",
        "name": "Flesh (Andy Warhol)",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "czar-10"
        },
        "dateCreated": "2000-10-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062979/"
        },
        "name": "Lots of Flesh in Flesh.",
        "reviewBody": "The opening static shot of Joe sleeping, for a full 4 minuets was very reminiscent of Earlier work done by Morrissey's Quasi-partner, Warhol on the movie Sleep, which is a static shot of some guy sleeping for 6 hours. But Unlike Warhol's work, Paul Morrissey put the narrative into the Warhol aesthetic principals,by giving the actors more substance to each scene, and then moving around the camera, and following the actors actions more closely with a omnipresent eye that doesn't inhibit the actors in sometimes highly improvised situations. (unlike in Warhol's work actors/actresses were aware of the camera at all times and didn't allow them to lose themselves in the moment on screen).Yes there is allot of Improvisation in this film which is what gives it the feeling of watching something that is real. The movie was not scripted, before every scene Paul Morrissey told each actor what he wanted from each scene and the actors were left to their own devices improvising dialogue and advancing the narrative. Choosing the subject of Hustling for a living, selling your self for money, and pairing it with an actor that knows about the lifestyle is what really gave Joe the opportunity to make the character believable. In fact after the movie was shown around the world, people actually thought Joe was Like that in real life, Just like in TRASH, everyone really thought Joe was a junkie. One good scene has Joe picked up by an older gentleman who wants Joe only to pose for some artwork. Joe tells him he wants to earn 100 bucks, (to pay for his wife's girlfriend's abortion) \"one hundred dollars!, you'll have to take off all your clothes for that\" the old man tells him. The old man is in fact hiding his homosexuality, Pretending to be an artist. Back at his place He tells Joe to take off his clothes, saying that that is the hardest part for anyone to do when posing for art. But Joe's not shy, He takes off all his clothing and starts posing in various olympiadic poses,. While the old man rants on about the different artworks in contemporary society, the aesthetic of greek statues, philosophizing on the beauty of human skin, and how people are obsessed with it, It's too much for Joe, Joe interrupts him asking him for the dinner he promised him. The aesthete's rationalization is paralleled by Joe's last customer of the day, Louis Waldon playing a guy Joe knows from the gym. He pretends that their sex is for the friendlier motive than the money Joe always requests and that despite their sex, \"we're not queers.\" The pretense to friendship is undermined when the customer shifts from the passive suggestions to brusquely ordering Joe about. The client's delusions show his need for purity in a relationship-such as glimpsed in Joe's scene with the baby, where he is nude on the floor feeding the baby bits of muffin. Only with the baby is Joe shown in a relationship were he is not a commodity. Joe runs into some other hustlers on the street, younger ones who sorta look at Joe with respect, because he's the more experienced Hustler, and they being ones who want to learn more. One of the boys asks him if he's straight Joe say's \"Hey nobody's straight. What's straight? It's not a thing of being straight or being not straight. It's just...you just do whatever you have to do\", and about the johns, he only says \"they only wanna suck your peetta!\" In another memorable scene With Geri Miller, Candy Darling, Jackie Curtis, and Joe. Morrissey pans from, Candy and Jackie (transvestites in real life) sitting down on a couch reading from an old Hollywood magazine > The trannie's quote stuff from the magazine and then Geri's goes into her dramatic story of her rape, meanwhile Joe (emotionless) listens to it all. Later Geri does a topless dance at Joe's request but he ignores her. The film ends like it begins, but with a difference.Again Joe is Naked on his belly on the bed. Reversing the opening order, the full-length view is followed by the profile close-up. But now Joe is no longer alone. His wife is asleep beside him, but between them lies her new lover, the women's legs ardently intertwined. We see him in the relationship from which he is excluded. Joe's naked solitude is redefined as an alienation within a relationship. The film went on to gross over $2,000,000 dollars, making it a very profitable, considering it was done on a budget of only $1,500. It was banned from England for a while, and in Germany 3,000,000 people saw it making it one of the top movies in Germany in that year. It was the first underground film that was accepted on a wide scale basis, and made Joe a very well known person all over the world.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0062979/"
}