{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Luke Halpin",
            "url": "/name/nm0356983/"
        },
        {
            "@type": "Person",
            "name": "Pamela Franklin",
            "url": "/name/nm0291512/"
        },
        {
            "@type": "Person",
            "name": "Helen Cherry",
            "url": "/name/nm0156078/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 592,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0214249/"
        },
        {
            "@type": "Person",
            "name": "Ivan Tors",
            "url": "/name/nm0868974/"
        },
        {
            "@type": "Person",
            "name": "Ricou Browning",
            "url": "/name/nm0115202/"
        },
        {
            "@type": "Person",
            "name": "Jack Cowden",
            "url": "/name/nm0184689/"
        }
    ],
    "datePublished": "1964-11-19",
    "description": "Boy Sandy and Dolphin Flipper are in the Bahamas where they pester a bunch of outlaws holding an English family captive.",
    "director": [
        {
            "@type": "Person",
            "name": "Leon Benson",
            "url": "/name/nm0072561/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Family",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzFkYTk1ZjAtMjliNi00MGRlLWFmNjAtM2E2MTk5NzMwM2E3XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "1960s,bahamas,animal character name in title,flipper character,three word title",
    "name": "Flipper's New Adventure",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Light_Triton"
        },
        "dateCreated": "2005-05-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058105/"
        },
        "name": "I'll take this over Eye of the dolphin any day!",
        "reviewBody": "(Note: This comment has been re-written as of July 28th, 2020)\n\nIf anyone thinks this film is bad, they're wrong. Sure, it might not stack up to the original, or the TV series, but i'd rather go pop the 1990 VHS restored version into my VCR, or the DVD re-release and waste 2 hours on a movie I can almost recite line-by-line than any other dolphin movie available now. This, and the original 1963 film turned me & many other young men & women into Aquaphiles, people who love being in the water, swimming with fish and other creatures, and some have become marine biologists and learned more about the oceans and discovered new things.\n\nTeenaged Sandy Ricks spends a lot of his time at home, alone with only his dolphin (Bud didn't exist in the movies yet) the 2 are inseparable, and this is tested when he has to leave home for a place with his aunt, leaving flipper behind because the land they live on is government property and the government wants it back. To avoid being separated, Sandy escapes with flipper to a deserted island. When he arrives at this island, it is his home. but little does he know that a British mother and her 2 children will be dumped off at this island by 3 murderers who recently escaped Prison. It will take all of his and flipper's wits and abilities to help the helpless family and to thwart the killers' plans.\n\nYeah, it's a hackplot meant for kids, simple & predictable, but films with friendships between man & animal never go out of style. The presentation that makes it so good. A good chunk of the movie takes place underwater, an already beautiful place to bring a camera, with Henry Vars's beautiful score giving the film it's tropical flavor. Plus, Flipper always drags the audience out of a sour moment. If something goes wrong for the characters, Flipper always swims in and lends a fin, sometimes with a little bit of humor.\n\nIt's highly unlikely we'll ever see a movie like this ever again due to laws prohibiting people from interacting with wild animals in the united states. Plus, it's sad to think the dolphin who played Flipper ended her life prematurely in her trainer's arms.\n\nAnother cool thing to comment on is that there is Advertising inside of the movie. How is that? the characters talk about the movie \"Mutiny on the Bounty\" Which is a real MGM film. they also Talk about \"Showdown in Samoa\" but that's not a real film, perhaps it was a project MGM was working on, but abandoned halfway through.\n\nFor me, this will always be the ultimate summertime film. Even the original box art said that \"it's the next best thing to a day at the beach.\"\n\n9/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3445407513",
        "name": "Flipper's New Adventure",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGI0NDczYjItNDQyZS00ZDg2LTg4ZjYtOTM3YjI5MmIxODFjXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGI0NDczYjItNDQyZS00ZDg2LTg4ZjYtOTM3YjI5MmIxODFjXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-06T17:03:50.899Z",
        "url": "https://www.imdb.com/video/vi3445407513/"
    },
    "url": "/title/tt0058105/"
}