{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ganjirô Nakamura",
            "url": "/name/nm0620131/"
        },
        {
            "@type": "Person",
            "name": "Machiko Kyô",
            "url": "/name/nm0477553/"
        },
        {
            "@type": "Person",
            "name": "Haruko Sugimura",
            "url": "/name/nm0837503/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8400,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "alternateName": "Floating Weeds",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067278/"
        },
        {
            "@type": "Person",
            "name": "Yasujirô Ozu",
            "url": "/name/nm0654868/"
        },
        {
            "@type": "Person",
            "name": "Kôgo Noda",
            "url": "/name/nm0633792/"
        },
        {
            "@type": "Person",
            "name": "Tadao Ikeda",
            "url": "/name/nm0407456/"
        }
    ],
    "datePublished": "1970-11-24",
    "description": "The head of a Japanese theatre troupe returns to a small coastal town where he left a son who thinks he is his uncle, and tries to make up for the lost time, but his current mistress grows jealous.",
    "director": [
        {
            "@type": "Person",
            "name": "Yasujirô Ozu",
            "url": "/name/nm0654868/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGE3MWQyYzYtNmY4OC00YjdlLTk1ODktZmM1YzNkNTNkNjQ0XkEyXkFqcGdeQXVyNTc2MDU0NDE@._V1_.jpg",
    "keywords": "travelling players,remake by original director,one word title,seaside,lighthouse",
    "name": "Ukikusa",
    "original_info": {
        "id": "Floating Weeds_1959",
        "name": "Floating Weeds",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SanTropez_Couch"
        },
        "dateCreated": "2003-04-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053390/"
        },
        "name": "Simple never felt so good",
        "reviewBody": "Komajuro Arashi and his acting troupe arrive in a small fishing village on the coast of Japan. Komanjuro goes to visit a woman who runs a sake bar, and who, we learn, is a former lover, and with whom he fathered a child, though the child is unaware of this fact and believes him to be his uncle\n\nTheir son, Kiyoshi, has just finished high school, and Komanju comes to see him as much as his former lover. He hopes that Kiyoshi will be able to become something in his life and not end up like Komanju himself, a washed-up actor drawing small crowds for his failing samurai productions.\n\nWhen Komajuro talks with his gorgeous young son, we can see the excitement in his eyes, in his face. The acting here is all rather flat, or better, it's reserved. (Ozu adds a little joke to this later in the film, when on a fishing boat Kiyoshi accuses his father of being \"too muggy\" in his performance.) This adds to the impact of the few emotional (and physical) outbursts later in the film.\n\nThe conflict in the film is that of Komajuro's double lives. When his current mistress, Miss Sumiko -- a jealous and conniving witch of a woman -- discovers that he's been seeing some other woman, she's enraged, and plots what she believes will be his sort of downfall. By hiring a young woman, Kayo, to seduce Kiyoshi and embarrass Komajuro, she plans on making the two seem like different generations of the same person, both relating with unimportant actresses, thereby ruining Komajuro's hopes of his son becoming somebody important.\n\nUnlike most, Ozu is an auteur because of what he doesn't do. His unmoving camera, which is famous, sits placidly, observing the characters with interest. I do sometimes wish that the camera would move around curiously, interested in the conversations of the characters, but maybe Ozu's point was that his camera is (or we should be) too interested to move, and that the events of everyday life need not be jazzed up for entertainment purposes. (He seems to mock this idea when he has Komajuro say to Kiyoshi about his plays that, basically, modern audiences can't appreciate good drama.) The entire film is restrained; on the rare occasion when people cry, they cover their faces and softly whimper.\n\nThe ending shot of a dark blue sky, with red lights from a rolling train, reminds us that whether it's 2003 in North America or 1959 in a small Japanese fishing village, we're all the same people with the same problems.\n\nIn and of itself, the film is terrifically simple: a simple story, with simple acting, simple music, and made even more simple by the simplicity of the static camera. But what makes the film something special, rather than just some family drama, is the honesty. Ozu isn't after anything big here. Any enlightenment comes from Ozu's realization that the most important conflicts are in the home, the ones no one sees, the ones we all feel.\n\n****"
    },
    "url": "/title/tt0053390/"
}