{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matthew Modine",
            "url": "/name/nm0000546/"
        },
        {
            "@type": "Person",
            "name": "Nancy Travis",
            "url": "/name/nm0001802/"
        },
        {
            "@type": "Person",
            "name": "Samuel L. Jackson",
            "url": "/name/nm0000168/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7152,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047597/"
        },
        {
            "@type": "Person",
            "name": "James Herbert",
            "url": "/name/nm0378562/"
        },
        {
            "@type": "Person",
            "name": "Carlo Carlei",
            "url": "/name/nm0137363/"
        },
        {
            "@type": "Person",
            "name": "James Carrington",
            "url": "/name/nm0140572/"
        }
    ],
    "datePublished": "1995-06-02",
    "description": "After a man dies in a car crash, he is reincarnated as a dog and attempts to reconnect with his family.",
    "director": [
        {
            "@type": "Person",
            "name": "Carlo Carlei",
            "url": "/name/nm0137363/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2I1YzJkOWYtMzNjNC00NDA3LWFlMTktNDJkM2JmZTEzNDYxXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "reincarnation,cartoon on tv,close up of eye,united states of america,dog",
    "name": "Fluke",
    "original_info": {
        "id": "Fluke_1995",
        "name": "Fluke",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2012-07-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113089/"
        },
        "name": "A beautiful and original movie.",
        "reviewBody": "Fluke is directed by Carlo Carlei who also co-adapts the screenplay with James Carrington from the novel written by James Herbert. It stars Matthew Modine, Eric Stoltz, Nancy Travis, Ron Perlman, Bill Cobbs, Jon Polito and Samuel L. Jackson. Music is scored by Carlo Siliotto and cinematography by Raffaele Mertes.\n\nWorkaholic Thomas Johnson is killed in an auto accident and is reincarnated as a dog. As he grows from pup to adult dog he starts to remembering things from his human life and sets about piecing together exactly who he was and what happened to him.\n\nIt was a box office flop, a hard sell anyway with its cross genre themes, but MGM didn't know how to market it. Was it an animal adventure for the kids? A family drama message movie? Or a metaphysical bit of dalliance? Truth is is that it is all three, an engagingly thoughtful movie that is flavoured by fantastical whimsy whilst also beating a poetic heart. There's humour in here, too, especially when Fluke teams up with the wise and shaggy Rumbo (Jackson). But predominantly picture is about emotional beats, sitting in that void between genuine warmth and tragedy. It's unashamedly sentimental, but that's a good thing, and it's not just confined to the animal aspects of the story, this is still a very real human drama. The messages within are handled with care, there's no beating us over the head here.\n\nDirector Carlei disappeared from Hollywood after the failure of Fluke, which is a shame since he crafts a great picture of strength. His dog POV camera work is smart in bringing us into Fluke's world, and many shots are gorgeously framed and filmed by director and photographer alike. It's also admirable in how he handles the excellent canine actors (Comet as Fluke is mightily impressive and expressive), it's no disgrace to the human actors to say the canines own the movie. There's some implausibilities, obviously, and one or two moments are too surreal for their own good; a laboratory break out sequence is cheer worthy but Carlei overdoes it, but this is still a lovely and interesting movie. Just like the great John Herbert's novel is for adults, so is the film. You can watch it with the kids for sure, so long as you have the fortitude to discuss with them the film's inner workings. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Workaholic Thomas Johnson dies in an auto accident and comes back to life as a dog. Remembering some of who he was, he returns to his wife and son to protect them from the man who caused his accident. But, as time goes by, he remembers more of his life, and realizes he wasn't such a good husband and father.",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2179842841",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTdhZTYyNjMtYmUyNy00NTdjLWEwNTctOWM4OTdhNjVhYTk1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTdhZTYyNjMtYmUyNy00NTdjLWEwNTctOWM4OTdhNjVhYTk1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-22T16:56:50.495Z",
        "url": "https://www.imdb.com/video/vi2179842841/"
    },
    "url": "/title/tt0113089/"
}