{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William H. Macy",
            "url": "/name/nm0000513/"
        },
        {
            "@type": "Person",
            "name": "Laura Dern",
            "url": "/name/nm0000368/"
        },
        {
            "@type": "Person",
            "name": "David Paymer",
            "url": "/name/nm0001601/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3073,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013306/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0148005/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065921/"
        },
        {
            "@type": "Person",
            "name": "Arthur Miller",
            "url": "/name/nm0007186/"
        },
        {
            "@type": "Person",
            "name": "Kendrew Lascelles",
            "url": "/name/nm0489472/"
        }
    ],
    "datePublished": "2002-05-02",
    "description": "In the waning months of World War II, a man and his wife are mistakenly identified as Jews by their anti-Semitic Brooklyn neighbors. Suddenly the victims of religious and racial persecution, they find themselves aligned with a loc...",
    "director": [
        {
            "@type": "Person",
            "name": "Neal Slavin",
            "url": "/name/nm0805595/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc1MzJjZWYtZjU1ZC00NjJkLWJkMjAtN2MwZjkyOGM4OWIzXkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "card game,pond,wading,nosebleed,hatred",
    "name": "Focus",
    "original_info": {
        "id": "Focus_2001",
        "name": "Focus",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lawprof"
        },
        "dateCreated": "2001-11-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0246628/"
        },
        "name": "American Anti-Semitism Confronted in \"Focus\"",
        "reviewBody": "In 1947, two films, \"Crossfire\" and \"Gentlemen's Agreement,\" opened a queasy Hollywood's examination of anti-Semitism in our society. \"Gentlemen's Agreement\" dealt with religious bigotry at the level of high, or at least upper middle-class, America while \"Crossfire\" exposed the brutal violence that always accompanies irrational hatred and bias. Both films made, and continue to make, an impression.\n\nOverall, Hollywood has left anti-Semitism in the U.S. pretty much alone. That many Jews have found success at both ends of the movie camera is well-known. That some of those Jews, many with Anglicized names, particularly feared the sting of the anti-communist fervor of the HUAC and Mc Carthy era, is a still disturbing and lasting legacy of a difficult time in our history. The controversy several years ago about the special Oscar for Elia Kazan brought the issue to the attention of millions ignorant of the heyday of Hollywood's involvement with the anti-communist campaign. Kazan, incidentally, directed \"Gentlemen's Agreement.\"\n\n\"Focus,\" which is showing in remarkably few theaters (only two in Manhattan and I wouldn't bet on a long run) both exaggerates and encapsulates a strain of anti-Semitism in New York City during the Second World War that, even today, few who recall it say much about its pervasiveness.\n\nThe War Department was discomfited to learn through surveys that a surprising minority of servicemen thought the war was being fought for Jewish interests or that actually it had been caused by Jews. These beliefs, possibly spawned by the virulent rhetoric of Father Coughlin, the near treasonous utterances of Charles Lindbergh and the organized pro-Nazi rallies of the Bund (the U.S. arm of the Nazi Party), were more widespread than most accounts of the war recognize let alone explore.\n\n\"Focus\" takes place in a Brooklyn neighborhood of seeming homogeneity marred only by the presence of Finkelstein, the candy store proprietor on the corner. To insure that the audience understands the depth of the community's fear of Jews, quick shots of his unmistakably \"frum\" (Orthodox) relatives from the Lower East Side are presented several times.\n\nThe cohort of organized thugs who harass both the nerdy-with-glasses-mistaken-as-a-Jew guy, William H. Macy, and his glamorous-in-a-forties-way, also mistaken as Jewish, bride, Laura Dern, didn't exist in New York City. Anti-semitic assaults occurred but they were sporadic and involved local youths, not followers of a priest who in the film is the spitting image of Father Coughlin back from hell.\n\nWhat is so chilling is that the married couple's abhorrence of the growing and organized anti-Semitic harassment is not matched by any introspection as to the baseness of their own feelings about Jews. Both Mr. Macy and Ms. Dern are extraordinary as actors in a small, local drama that recasts their lives without, perhaps, causing them to reshape their own bigoted views. Or do they change?\n\nThis is a moving drama that invites exploration of part of the reality of World War II on the Home Front not covered in the continuing outpouring of Greatest Generation memoirs. When available for rental or purchase it should secure the much wider audience it deserves."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount Classics",
        "duration": "PT2M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3383165209",
        "name": "Focus (2001)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjk0ZDY2ZWQtYTM1Ni00ODlmLTk4YzAtOTMwZTk5NTE1OTMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjk0ZDY2ZWQtYTM1Ni00ODlmLTk4YzAtOTMwZTk5NTE1OTMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:09:58Z",
        "url": "https://www.imdb.com/video/vi3383165209/"
    },
    "url": "/title/tt0246628/"
}