{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Andre Gregory",
            "url": "/name/nm0339737/"
        },
        {
            "@type": "Person",
            "name": "Stephen Sondheim",
            "url": "/name/nm0814227/"
        },
        {
            "@type": "Person",
            "name": "Arthur Rubin",
            "url": "/name/nm0748008/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 185,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012434/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066897/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Person",
            "name": "James Goldman",
            "url": "/name/nm0063953/"
        }
    ],
    "datePublished": "1986-03-14",
    "description": "Film of the legendary 1985 concert performance presented by the New York Philharmonic of Stephen Sondheim's classic musical at Avery Fisher Hall at Lincoln Center. The plot of the musical centers around a reunion of showgirls who ...",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Houldey",
            "url": "/name/nm0396504/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE0Mzk2MzQ2NV5BMl5BanBnXkFtZTcwOTM2NDYyMQ@@._V1_.jpg",
    "keywords": "based on broadway musical,reunion,husband wife relationship,based on stage musical,tv special",
    "name": "Follies in Concert",
    "original_info": {
        "id": "Follies in Concert_1985",
        "name": "Follies in Concert",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Isaac5855"
        },
        "dateCreated": "2006-07-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0208162/"
        },
        "name": "Sondheim's Amazing Score Delivered by a Powerhouse All-Star Cast",
        "reviewBody": "FOLLIES was one of Stephen Sondheim's most glorious musicals with one of the most memorable scores he has ever written. A huge score and a cast of over 40 major characters, it is a huge undertaking in any form and this concert version was no exception. FOLLIES was the story of a reunion that takes place in a an old theater, about to be demolished, among several follies performers from the past, now in their 50's, 60's, and 70's, reuniting for a final goodbye to their theater, orchestrated by the fictional theatrical director, Dimitri Wiseman. The bulk of the show focuses on four central characters, Ben, Sally, Buddy, and Phyllis. Ben and Sally were in love many years ago, but now Sally is married to Buddy and Ben is married to Phyllis but old feelings eventually find their way to the surface in this landmark musical. Sondheim hand-picked an a amazing cast for this concert, headlined by George Hearn as Ben, Lee Remick as Phyllis, Mandy Patinkin as Buddy and the legendary Barbara Cook as Sally. Hearn and Cook flawlessly perform the haunting duet \"Too Many Mornings\" in which Ben and Sally explore old feelings. Hearn also scores on \"The Road You Didn't Take\" and Cook's rendition of \"In Buddy's Eyes\" is just breathtaking and has become part of her current cabaret act. Remick has a ball with \"Could I Leave You?\" and \"The Story of Lucy and Jesse\" and Patinkin stops the show with \"Buddy's Blues.\" Other highlights include Carol Burnett as Carlotta, singing \"I'm Still Here\" and Broadway legend Elaine Stritch, who brings down the house with \"Broadway Baby\". Phyllis Newman effectively leads the female ensemble in \"Who's that Woman?\" and there is an amazing quartet called \"You're Gonna Love Tomorrow/Love Will See us Through\" which features BABY's Liz Calloway and Broadway's current Phantom, Howard McGillen. The version I saw on Showtime also includes backstage rehearsal footage, showing longtime Sondheim musical director Paul Gemigiani coaching Hearn and Cook on \"Too Many Mornings\" and Lee Remick and Patinkin sitting in a rehearsal hall, mesmerized as Barbara Cook rehearses \"In Buddy's Eyes.\" There is even a moment with George Hearn moments before curtain where he confesses to writing lyrics he tends to forget on his hand. This concert is a must for all Sondheim fans and FOLLIES fans in particular, since this is probably the closest thing we will ever have to a film version of FOLLIES. Don't miss it...a joy from start to finish.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H30M",
    "url": "/title/tt0208162/"
}