{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Rhys",
            "url": "/name/nm0722631/"
        },
        {
            "@type": "Person",
            "name": "Kevin Bishop",
            "url": "/name/nm0084107/"
        },
        {
            "@type": "Person",
            "name": "Juliet Stevenson",
            "url": "/name/nm0828980/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1779,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080806/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065782/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010400/"
        },
        {
            "@type": "Person",
            "name": "David Leavitt",
            "url": "/name/nm0495380/"
        },
        {
            "@type": "Person",
            "name": "Ventura Pons",
            "url": "/name/nm0690532/"
        }
    ],
    "datePublished": "2002-02-08",
    "description": "Paul, a handsome and talented music student is employed as the page-turner at one of the world famous pianist Kennington's concerts in San Francisco.",
    "director": [
        {
            "@type": "Person",
            "name": "Ventura Pons",
            "url": "/name/nm0690532/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTZiNTE3MzEtZDMwZi00M2ViLWE2OTEtYjZlOGM3NTM4NDA4XkEyXkFqcGdeQXVyMzMwMjI2NA@@._V1_.jpg",
    "keywords": "pianist,page turner,music student,neglected wife,homosexuality",
    "name": "Food of Love",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "NYCNetguy"
        },
        "dateCreated": "2003-06-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0309600/"
        },
        "name": "A Nice Snack, But Not Quite A Meal",
        "reviewBody": "`Food Of Love' marks the debut of Ventura Pons first English language film and is based on the novel, `The Page Turner' by David Leavitt. As the film began I thought to myself, `This is going to be one of the best gay films I've seen in recent memory', and although I really enjoyed it, what began as a really good coming of age love story, midway through it took a completely different direction and became an after school special, centered around a mother dealing with her son's homosexuality. Having not read the book I can't say how it compares, but as a movie, it left me hungry for more. All the performances are great although the mother (Juliet Stevenson) at times seemed too over the top and almost cartoonish. Kevin Bishop who plays Paul, is a cute, blue-eyed, blonde that showed a wide range of emotions throughout the film, from his first sexual encounter, to his disappointments with school, and frustrations with his mom, and so forth. Paul Rhys also gives a wonderful performance and appears sensitive, intimate and charming towards towards the boy and his mom.\n\n It begins in San Francisco as 18 year old Paul Portfield (Kevin Bishop), an aspiring piano player and soon to be Juliard student, gets a job as a page turner for his idol Richard Kennington (Paul Rhys), a renowned concert pianist. During the concert as Paul reaches to turn the pages as Richard plays feverishly, you get the beginning glimpses of the sexual sparks between them. After the concert, Richard invites Paul out for a drink only to be interrupted and taken home by his overprotective and at times manic mother (Juliet Stevenson).\n\nAfter finding out his dad has left his mother for another woman, Paul and his mom venture off to Spain on vacation. While wandering the streets Paul spots a concert poster featuring Richard and he sets out to find him. Paul tracks him down and drops by his hotel room where he's soon seduced by the pianist in an intimate and gentle way. Paul becomes totally infatuated with Richard and after a week long fling Paul and his mom are off to Granada while Richard, unbeknownst to Paul, returns home to New York and his manager/lover Joseph Mansourian (Allan Corduner). Months go by and Paul is now attending Juliard, seeing an older man, and trying to get over Richard. It's a rollercoaster of a ride especially when a classmate of Paul's gets signed by Mansourian while Mansourian wants Paul to be a page turner yet again at a dinner party. In the midst off all this Paul's mom is trying to cope with divorce and, after finding a porn magazine in Paul's suitcase, her son's homosexuality. This is where the story takes a turn that was not completely satisfying. The mother attends a `mom's with gay sons' meeting and it just seemed totally misplaced and campy. Also, while attending school Paul seems to always be in the company of older men. I considered maybe that was his way of looking to a father figure or something but why wasn't he going out with guys his own age? His roommate looked cute enough. Also the portrayal of the older guys seemed to suggest they preyed on younger men. Those are just a couple of the issues I had with the story and I was a bit disappointed that it didn't stay focused on his relationship with Richard.\n\nEvents unfold and secrets are revealed, but many questions are still left unanswered at the end. Overall I would recommend it but still wish the story had centered more around Paul and his relationships than that of his mother and her issues. I'd love to see a sequel that's for sure! The acting is fine and the locales and direction I thought were great. There are a number of scenes with brief nudity and homoerotic touches that give this picture an `R' rating. The picture quality of the DVD is crisp and clear and so is the audio. It also features extras that include interviews with the cast members, the director Ventura Pons and even David Leavitt, author of the novel. Numerous trailers of other features from TLA Releasing as well.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi49069849",
        "name": "Food of Love",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWZjZmFmNTMtZjlmYS00YWU5LWEzMmYtNzBiY2JlNjJkZDJiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWZjZmFmNTMtZjlmYS00YWU5LWEzMmYtNzBiY2JlNjJkZDJiXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-10-30T17:05:19.831Z",
        "url": "https://www.imdb.com/video/vi49069849/"
    },
    "url": "/title/tt0309600/"
}