{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ekin Cheng",
            "url": "/name/nm0155562/"
        },
        {
            "@type": "Person",
            "name": "Louis Koo",
            "url": "/name/nm0465503/"
        },
        {
            "@type": "Person",
            "name": "Shu Qi",
            "url": "/name/nm0795517/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 232,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "alternateName": "For Bad Boys Only",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0204855/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073077/"
        },
        {
            "@type": "Person",
            "name": "Manfred Wong",
            "url": "/name/nm0939236/"
        }
    ],
    "datePublished": "2000-12-15",
    "description": "Badboy is a HK detective agency. They specialize in finding wealthy clients' first love. Two clients are looking for a look-alike girl with a 20 year age difference. She/Shu Qi is seen with a geneticist.",
    "director": [
        {
            "@type": "Person",
            "name": "Wai-Man Yip",
            "url": "/name/nm0948145/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYyODY3MzkyNV5BMl5BanBnXkFtZTcwMjQ4NDcxMQ@@._V1_.jpg",
    "keywords": "genetic,detective",
    "name": "Bad boy dak gung",
    "original_info": {
        "id": "For Bad Boys Only_2000",
        "name": "For Bad Boys Only",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rsoonsa"
        },
        "dateCreated": "2005-06-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0284878/"
        },
        "name": "Too Many Plot Shifts In Too Many Directions.",
        "reviewBody": "Director Raymond Wai Man Yip is given almost everything that he might require for preparation of a satisfactory film, a daunting exception being coherence within the script, since writer/producer Manfred Wong has not focused upon any particular genre, romance, humour, mystery, drama, martial arts, science fiction, and CGI fantasy all being included in random and unblended fashion, an inevitable result being this largely uninvolving mishmash. The Bad Boy Squad, a variety of private detective agency, is composed of King (Ekin Cheng Yi-kin), Queen (Kristy Yeung), and Jack (Louis Koo Tin-lok), whose primary source of business is the reuniting of clientèle with their first flames, and when the trio of young operatives returns to Hong Kong from an assignment in Thailand and the Squad's next three customers supply photographs of lost loves, the women in the pictures appear to be the same individual. A more than adequate budget provides for above-standard production values for the work that took four months to complete, with location shooting in Hong Kong, Taiwan, Thailand, and Macau, while the actors do their best with a surfeit of silly scenes, Shu Qui being the most impressive with her task of playing multiple characters including an androidal clone with a mentality of a ten year old, and a middle-aged paraplegic. The DVD version includes a lightweight \"making of..\" segment, and the subtitles, including those in English, are quite accurate; original dialogue is in Cantonese, with frequent usage of Mandarin and U.S. English.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0284878/"
}