{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sandra Bullock",
            "url": "/name/nm0000113/"
        },
        {
            "@type": "Person",
            "name": "Ben Affleck",
            "url": "/name/nm0000255/"
        },
        {
            "@type": "Person",
            "name": "Maura Tierney",
            "url": "/name/nm0005491/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 34949,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0819670/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000680/"
        },
        {
            "@type": "Person",
            "name": "Marc Lawrence",
            "url": "/name/nm0492909/"
        }
    ],
    "datePublished": "1999-03-19",
    "description": "A soon-to-be-married man encounters an exciting stranger after his plane suffers an accident on takeoff.",
    "director": [
        {
            "@type": "Person",
            "name": "Bronwen Hughes",
            "url": "/name/nm0400486/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWI5OWE0MWQtNjliMi00MjE4LTg5ODAtOTM0YjA2OWVlYzgwXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "love,united states of america,wedding,hurricane,marriage",
    "name": "Forces of Nature",
    "original_info": {
        "id": "Forces of Nature_1999",
        "name": "Forces of Nature",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2003-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0141098/"
        },
        "name": "Planes, Trains andvery few laughs",
        "reviewBody": "Two days before his wedding, Ben's grandfather has a heart attack while dancing with a stripper. Due to the delay Ben's fiancé, Bridget, flies ahead to Savannah to make the preparations. Ben catches a plane later the day and meets free-spirit Sarah. When the plane is in a minor crash the two join up to head to Savannah by any way other than road, leading to one `comic' delay after another. Meanwhile the two become a little closer and Ben begins to doubt that marriage is for him.\n\nI first saw this in the cinema with my girlfriend (at the time) in a fit of trying to be seen to be giving and willing to watch silly films that she wants to see. At the time I was particularly untaken by the whole film despite the odd amusing touch. A few years on she bought it on video  she likes the silly films she can watch with her friends  and I gave it another go. The film is sadly as poorly pitched as I remember it, it isn't light enough to be funny and it isn't well enough written to be an involving drama. However, by trying to do both it fails to do either well.\n\nThe light part is clearly indebted to `Planes, Trains & Automobiles' in it's make-up, with cross country japes and one mishap after another. However to even compare the laughs in that film with the low number in this is, well, laughable. The film tries to have some `hilarious' set pieces but none of them are more than amusing. Even the support characters who wander in and out only ever manage a few good lines. What makes this harder is the serious side to the film where Sarah has a child and an abusive husband and Ben gets nothing but advice not to marry. This element is present all the way through and makes the film much more of a drama than a comedy, but, because it wants to be funny as well, the drama doesn't really work very well.\n\nAffleck is a non-character here and doesn't have the charisma to really involve the audience. Bullock is normally good but this is outside of her normal character and she doesn't wear the difficult edges well. The two have a reasonable chemistry that helps them through the rough patches but they don't fizz or spark together. The support cast throws up a few interesting faces who give good performances including Ronny Cox, Zahn, Tierney and a few others.\n\nThe film has been applauded for the realistic (low-key) ending which is certainly better on paper than the usual formulaic ending and on this I pretty much agree. It doesn't spoil the film simply because the 30 minutes before this are so very serious and not funny. On top of this the film also has some nice directorial touches in slow-mo rain and hail storms. However the impact of the emotional climax in a swirling wind of flower petals is rather spoilt by the really poor back projection used to carry it off.\n\nOverall though this film is a bit of a letdown as it manages to only half work as a comedy and as a drama although it does have some nice touches that make it worth seeing as long as you know what to expect."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Dreamworks Home Entertainment",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2778988825",
        "name": "Forces of Nature",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjViZGVjYTUtZDA3Ni00YjU0LTg0YmUtMjU5OGI2Y2Q2MzI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjViZGVjYTUtZDA3Ni00YjU0LTg0YmUtMjU5OGI2Y2Q2MzI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T13:59:20Z",
        "url": "https://www.imdb.com/video/vi2778988825/"
    },
    "url": "/title/tt0141098/"
}