{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joel McCrea",
            "url": "/name/nm0566948/"
        },
        {
            "@type": "Person",
            "name": "Laraine Day",
            "url": "/name/nm0206478/"
        },
        {
            "@type": "Person",
            "name": "Herbert Marshall",
            "url": "/name/nm0003339/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21987,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035064/"
        },
        {
            "@type": "Person",
            "name": "Charles Bennett",
            "url": "/name/nm0071657/"
        },
        {
            "@type": "Person",
            "name": "Joan Harrison",
            "url": "/name/nm0365661/"
        },
        {
            "@type": "Person",
            "name": "James Hilton",
            "url": "/name/nm0385264/"
        }
    ],
    "datePublished": "1940-08-16",
    "description": "On the eve of World War II, a young American reporter tries to expose enemy agents in London.",
    "director": [
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Action",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmM3ZGE4Y2EtNGFlMS00YjE5LWExYzYtYzQyYTQxYTZlMWRmXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "reporter,foreign correspondent,editor,diplomat,spy",
    "name": "Foreign Correspondent",
    "original_info": {
        "id": "Foreign Correspondent_1940",
        "name": "Foreign Correspondent",
        "year": "1940"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Snow Leopard"
        },
        "dateCreated": "2001-05-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0032484/"
        },
        "name": "Entertaining, Exciting, and Masterfully Constructed",
        "reviewBody": "While not as well-known today as some of his later films, Alfred Hitchcock's spy thriller \"Foreign Correspondent\" is entertaining, exciting, and masterfully constructed. Though lacking the star power of some of the great director's more famous movies, the cast is very good, the settings are wonderfully conceived, and the story and writing keep the viewer's attention at all times. It has everything we hope for from Hitchcock: action, suspense, and a good dose of humor.\n\nThe plot is a complicated one, beginning when American reporter Johnny Jones (Joel McCrea) is sent to Europe just before the outbreak of World War II. Expected to send back news about the possibility of war, Jones stumbles across an espionage ring that is using kidnapping and murder in an attempt to get important government secrets for use in the coming war. The action goes from England to Holland and back to England, with Jones constantly escaping from danger as he tries to get the details of the spy plot for his newspaper. It does take some effort to follow everything that is happening, but there are many action sequences and a lot of good writing - with many fine touches of humor - that make it easy to pay attention.\n\nIn the lead role, McCrea performs with the easy-going understatement that typifies the heroes of Hitchcock's earlier films. Laraine Day is pleasant if unspectacular as McCrea's romantic interest, whose father (played nicely by Herbert Marshall) is also one of the key figures on the international scene. The supporting cast also has some fine actors. George Sanders for once gets to play a good guy, Robert Benchley is very funny as McCrea's fellow foreign correspondent, and Albert Basserman is touching as an old diplomat who has seen too much of the world's troubles.\n\nBut it is the action sequences and the settings that really make the film. Hitchcock's expert hand can be seen in almost every setting, and he displays a wealth of creative ideas here equal to any of his films. Particularly good are the memorable windmill scenes and the exciting climactic sequence in mid-ocean. This final sequence is not only thrilling, it also perfectly completes all of the film's action and themes.\n\n\"Foreign Correspondent\" contains plenty of excitement, humor, and suspense, along with some of Hitchcock's best set pieces. It is highly recommended."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4248092441",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzkzZDYxZDItYjg1Ni00OWViLWExYmUtYjE0M2JiNGJmMzIyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzkzZDYxZDItYjg1Ni00OWViLWExYmUtYjE0M2JiNGJmMzIyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-11-28T14:28:25.271Z",
        "url": "https://www.imdb.com/video/vi4248092441/"
    },
    "url": "/title/tt0032484/"
}