{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jessica Tandy",
            "url": "/name/nm0001788/"
        },
        {
            "@type": "Person",
            "name": "Hume Cronyn",
            "url": "/name/nm0002025/"
        },
        {
            "@type": "Person",
            "name": "John Denver",
            "url": "/name/nm0000135/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 412,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0078555/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039572/"
        },
        {
            "@type": "Person",
            "name": "Susan Cooper",
            "url": "/name/nm0178402/"
        },
        {
            "@type": "Person",
            "name": "Hume Cronyn",
            "url": "/name/nm0002025/"
        }
    ],
    "datePublished": "1987-12-13",
    "description": "Annie Nations and her husband Hector loved their life together in the Blue Ridge Mountains, but when Hector dies, Annie has to decide if she can handle the wilderness on her own.",
    "director": [
        {
            "@type": "Person",
            "name": "Jud Taylor",
            "url": "/name/nm0852676/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmY4NTgzNGUtM2M4NS00MmU1LTg2MzItM2ViOGRjZDkyZmQxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "country singer,florida,father children relationship,reference to divorce,wife runs away from husband",
    "name": "Foxfire",
    "original_info": {
        "id": "Foxfire_1987",
        "name": "Foxfire",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Snowgo"
        },
        "dateCreated": "2014-10-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0093046/"
        },
        "name": "Hey! You! Get Off Of My Cloud!",
        "reviewBody": "I really wanted to like Foxfire. I am a big fan of John Denver, and enjoyed his movie from a year earlier: A Christmas Tale, very much. Jessica Tandy was very good in Foxfire; I can't really say anything else good about it.\n\nThe dialogue was sub-standard and the scenes repetitive, but it was the unlikely, cynical and even shocking ending that killed this movie. The movie was going along well up to and including what should have been a fulcrum and the most critical scene of the movie: Harriet Hall (as Holly) criticised John Denver (as Dillard Nations) for being such a phony on stage. She was obviously in love with him, and the movie should have been re-written to have her lead Dillard to experience a change-of-heart about everything: The honesty of his relationships, his relationship to his work, his relationship to his mother and his relationship to the land, all of which are jaundiced and askew.\n\nHe has absolutely no appreciation for the appalachian life and land that he was raised on, and has no respect for the wishes of his mother. This is the first movie I have seen where John Denver plays a real self-centered creep: Did Dillard stop for one moment to think about what a trip to Florida could do to an old woman such as her? Did he think about how long she would last, being torn away from the land and memories that give her identity and roots? This is the cheapest, most callous ploy I have ever seen to get a free babysitter. \n\nHe had the opportunity, when Holly took-him-to-task, to get honest with himself and bring his children up there to live with her. He could have decided to help his mother, and respect her wishes, instead of fetch her to act as nanny in Florida to his then-motherless children.\n\nWhen Jessica Tandy (as Annie Nations) decided to sell, it screwed with my head so bad, I threw the movie out. This would not, should not have happened, in real life. She would have lived her life there. I felt abused and betrayed by screenwriters Susan Cooper and Hume Cronyn. I haven't researched either of them, but what do you want to bet they are a couple of city slickers?\n\nHow can we feel good about Foxfire? A mountain girl like Annie would have lasted maybe 3 months best in the Florida high-rise retirement/tourist swamp.\n\n(spit)\n\nFoxfire could have been great, but instead of John Denver's character experiencing the transformation he did in A Christmas Tale, he remained the same careless, selfish lout he was at the beginning of the movie. I still love John Denver, but I'm sorry I watched Firefox. If you want to see a movie about appalachia, then watch Song Catcher, or Fire Down Below, instead.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0093046/"
}