{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12,
        "ratingValue": 7,
        "worstRating": 1
    },
    "datePublished": "2007-06-17",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzBhZDhjNzEtOTdmOS00NTM5LWI2MmItNmNmNmU0YTg5NTY0XkEyXkFqcGdeQXVyODg3NDc1OTE@._V1_.jpg",
    "name": "Foyle's War, Series IV: Invasion",
    "original_info": {
        "id": "Foyle's War: Series 1_2003",
        "name": "Foyle's War: Series 1",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ctyankee1"
        },
        "dateCreated": "2015-03-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1549381/"
        },
        "name": "It started off good but then..",
        "reviewBody": "This started off with the Americans landing in Britain to help the Brits during a time of war to build an airport.\n\nThe Americans get threatened on the land where the airport will be build by the owner who is a farmer. The farmer does not know the government is taking some of his land for the use of erecting an airport and orders them off the land and shoots the window of a jeep off.\n\nThe American leader of the the soldiers had a fake accent to make him sound like he is from the US but he sounds more like a gangster. It seems when they have \"Americans' in the episode they swear and use God's name. There was another episode called \"Fifty Ships\" and the same thing happened.\n\nI love watching Foyle's War. It has plenty of history and accounts of war that I know little about. Michael Kitchen/Foyle is an excellent actor and so are the others. They are all honest, polite and humorous in their own way. \n\nI stopped watching when the swearing starts. It is because they use God's name -- so thoughtless for such a good series.\n\nSo the episodes are not all like this but I am disappointed in this one and Fifty Ships."
    },
    "url": "/title/tt1549381/"
}