{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Powers Boothe",
            "url": "/name/nm0000959/"
        },
        {
            "@type": "Person",
            "name": "Bill Butler",
            "url": "/name/nm0124832/"
        },
        {
            "@type": "Person",
            "name": "Kevin Cozen",
            "url": "/name/nm0185480/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "duration": "PT26M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAzMzI1Mjk1OF5BMl5BanBnXkFtZTcwMDAzNzUyMQ@@._V1_.jpg",
    "name": "Frailty",
    "original_info": {
        "id": "Frailty_2002",
        "name": "Frailty",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lor_"
        },
        "dateCreated": "2010-08-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0512168/"
        },
        "name": "Insightful \"making of\" doc",
        "reviewBody": "Far better than the usual documentary \"extra\" on DVD releases, this analysis of Frailty is taken from the Sundance Channel's \"Anatomy of a Scene\" series.\n\nFocus is on the framing device for Bill Paxton's debut thriller, that of Matthew McConnaughey in the back seat of FBI agent Powers Boothe's car, driving in the rain one night to the site where all the film's bodies are presumably buried. Surrounding material is featured, but the intense examination of this specific scene gives this short a purpose, generally lacking in the \"rah-rah\", \"boy did we make a great movie\" junk that passes for documentaries nowadays but is just filler.\n\nWe see the contributions of key crew members, notably Bill (most famous for two classics: \"The Conversation\" and \"Jaws\") Butler and editor Arnold Glassman, and see how meticulously novice director Paxton prepared for his assignment. Together with the okay short \"The Making of Frailty\" there is insight into the brick by brick aspect of filmmaking that will be of interest to any student of the form."
    },
    "timeRequired": "PT26M",
    "url": "/title/tt0512168/"
}