{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harrison Ford",
            "url": "/name/nm0000148/"
        },
        {
            "@type": "Person",
            "name": "Betty Buckley",
            "url": "/name/nm0000990/"
        },
        {
            "@type": "Person",
            "name": "Emmanuelle Seigner",
            "url": "/name/nm0782561/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 55227,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007229/"
        },
        {
            "@type": "Person",
            "name": "Roman Polanski",
            "url": "/name/nm0000591/"
        },
        {
            "@type": "Person",
            "name": "Gérard Brach",
            "url": "/name/nm0102722/"
        },
        {
            "@type": "Person",
            "name": "Robert Towne",
            "url": "/name/nm0001801/"
        }
    ],
    "datePublished": "1988-02-26",
    "description": "In a hotel room in Paris, a doctor comes out of the shower and finds that his wife has disappeared. He soon finds himself caught up in a world of intrigue, espionage, gangsters, drugs and murder.",
    "director": [
        {
            "@type": "Person",
            "name": "Roman Polanski",
            "url": "/name/nm0000591/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjY2ODQ3MTQyOV5BMl5BanBnXkFtZTgwNTc2MzkyMTE@._V1_.jpg",
    "keywords": "hotel room,espionage,american in paris,husband wife relationship,paris france",
    "name": "Frantic",
    "original_info": {
        "id": "Frantic_1988",
        "name": "Frantic",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095174/"
        },
        "name": "An enjoyably stylish film that is quite thrilling without resorting to gimmicks or tricks",
        "reviewBody": "Richard and Sondra Walker return to Paris for the first time since their honeymoon for him to attend a medical conference. While Richard is in the shower, Sondra leaves the hotel and vanishes. Unsure of where she has gone or if she left under duress or not, Richard begins a search that quickly reveals that she has gone missing. A mix-up with luggage and a smuggled substance lead him into the life of the mysterious Michelle who is more mixed up with his wife's disappearance than she lets on.\n\nI have seen this film several times and I think the fact that it isn't a spectacularly gimmicky film is a big part of the reason why it doesn't really stick in my mind over the years. For this reason I watched it again yesterday as I'd forgotten most of the plot and felt it would be like seeing it all over again for the first time. The film takes the simple plot and uses the 'object' as a McGuffin of sorts of quite a big chunk of the film  we don't need to know why his wife has been kidnapped, only that Richard is desperate to get her back and is sucked into a situation he knows nothing of. In this regard the film really works well and manages to keep the pace up even if some of the characters are difficult to fit into the narrative. As a story it lacks fireworks and has a rather understated feel but it still works really well and I enjoyed the simplicity of the story combined with the ease with which it involved me.\n\nThe cast are good but it is Ford's film and he leads it really well. He convinces as the man becoming increasingly 'frantic' and he manages to involve humour as his character becomes savvier about what is happening and also appears to be seedier and less professional as a result! Seigner is good even if her character is easier to play; she is a fun character and her performance is good. Outside of these two, few are memorable and it is to their credit (mostly Ford's) that the film is still strong regardless. Other familiar faces include Pinon, Weeks and Huddleston.\n\nOverall this is a solid little thriller that is rather old fashioned in it's telling. It relies on good set pieces within a good mystery plot rather than explosions or car chases and is much more satisfying as a result. Small bits of it don't totally come together but the overall effect is one of a simple film that is delivered with style and is enjoyable to watch."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Need to re-encode 500k QT",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2886710297",
        "name": "Frantic",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk4YTFiZTUtZTUxNC00ODA0LTk0Y2ItNDlmOWEyODdhZGI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk4YTFiZTUtZTUxNC00ODA0LTk0Y2ItNDlmOWEyODdhZGI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-06-03T21:22:38Z",
        "url": "https://www.imdb.com/video/vi2886710297/"
    },
    "url": "/title/tt0095174/"
}