{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Linda Cardellini",
            "url": "/name/nm0004802/"
        },
        {
            "@type": "Person",
            "name": "John Francis Daley",
            "url": "/name/nm0197855/"
        },
        {
            "@type": "Person",
            "name": "James Franco",
            "url": "/name/nm0290556/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 145894,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073081/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003158/"
        },
        {
            "@type": "Person",
            "name": "Paul Feig",
            "url": "/name/nm0082450/"
        }
    ],
    "datePublished": "1999-09-25",
    "description": "A high school mathlete starts hanging out with a group of burnouts while her younger brother navigates his freshman year.",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWJhOGFiZWMtYTY5Ni00NGU1LWE5OWItNzA5NThkNWUwYzc4XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "chippewa michigan,20th century,year 1980,year 1981,reference to william mckinley",
    "name": "Freaks and Geeks",
    "original_info": {
        "id": "Freaks & Geeks: The Complete Series_2000",
        "name": "Freaks & Geeks: The Complete Series",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "liquidcelluloid-1"
        },
        "dateCreated": "2004-04-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0193676/"
        },
        "name": "Perfect Television (only a network executive couldn't love it)",
        "reviewBody": "Network: NBC; Genre: Drama/Comedy; Content Rating: TV-PG (for language, drug use and adult content); Available: on DVD; Perspective: Modern Classic (star range: 1 - 5); \n\nSeason Reviewed: Completed Series (1 season)\n\nThere are few shows, currently on the air or in the entire pantheon of television, that are so obviously crafted with as much love as 'Freaks and Geeks'. Created by Paul Feig and produced by Judd Apatow, 'Freaks' crackles with an honest writing and flawless chemistry and creates it's own wonderful universe. To watch the show is to be awash in details and obvious care that was taken to make it.The high school series has never been so real. \n\n'Freaks' follows a group of geeks and a group of burnouts at McKinley High School in 1980, both of which centering around the Weir siblings. Lindsay Weir (Linda Cardellini) is our heroine whose rebellion from the Mathlete life and into the world of the burn-outs (with the terrific James Franco, Jason Segel, Seth Rogen & Busy Philipps) creates a domino effect that the entire series spins on. Sam Weir (John Francis Daley) is an underdeveloped geek whose unrequited love of cheerleader Cindy Sanders (Natasha Melnick, perfectly cast) drives much of the geek story lines. Sam faces the torment and humiliation of daily life in high school with friends Neil and Bill (wildly underrated, star-making Samm Levine and Martin Starr, respectively). The show is a badge of honor for all involved. \n\nThe school is populated with a fully realized universe of supporting characters from Lindsey's church-going friend Millie to Dungeon master Harris to Mr. Rosso (David \"Gruber\" Alan, hilariously stealing any scenery not bolted down) - the school guidance counselor without any boundary for the inappropriate. . No more accurate depiction of the look and feel of high school (or the hell that was high school depending on your perspective) TV has ever seen. \n\nBecky Ann Baker and Joe Flaherty make the perfect '50s era parents. Flaherty comes off the most over-the-top, but even that fits the vision. The dinner table scenes between the Weir family are so uncharacteristically happy and intentionally corny that it will surely be off-putting to the average cynical viewer. Years before \"The Office\" made embarrassment and viewer discomfort into a science, \"Freaks and Geeks\" was doing a similar thing, effectively making us really feel Sam and Lindsey's embarrassment over their parent's behavior. I particularly like the set design of the Weir house, and the show in general. \"Freaks\" is set in 1980 but designed with 50s, 60s and 70s paraphernalia. Unlike the many fast food period pieces now, - \"That 70s Show\", \"The Wedding Singer\", \"American Dreams\" - where the decade is treated like a \"Saturday Night Live\" sketch, the decade doesn't turn over to 1980 and suddenly everyone runs out and buys parachute pants and the Thriller album. \n\nThe self-professed anti-'Dawson's Creek', the series is almost as distinctive for what it isn't than for what it is. It isn't a flashy show with 20-something preps playing high school kids set to blaring Top 40 pop songs where the biggest problems among the characters include juggling two hot dates on the same night. In other shows - most overly concerned with what the consuming public thinks of them, the geeks and the burnouts are fringe groups usually given as much thought as the potted plant in the corner, or used as 1-joke stereotypes. 'Freaks and Geeks' is the first show to acknowledge that they may be more interesting. They don't participate in the high school caste system and they muse about never being able to get girls. \n\nI love the way the show's camera lingers on faces and soaks up Cardellini's incredible expressions. It rests on the kids as they sit and talk about their favorite drummer or the TV show they watched last night just like everyone does. At an hour the show allows for those quite moments. Just as it takes time out to do elaborate mid-show set pieces like an action movie-like dodge ball sequence or a violent spat between Kim Kelly (Philips) and her parents. The series is packed with these unforgettable little moments - heart-breaking and screaming funny, sometimes all at once. In 18 episodes it says more than most shows ever do: the geeks watching their first porno, the freaks getting their first fake IDs, the family catastrophes in Niel and Bill's homes and the painfully real crush Sam has on Cindy. Their world doesn't always a happy ending and awkwardness and embarrassment rule the day. \n\nThe fact that 'Freaks and Geeks' wasn't given a chance to make it by NBC is a sad testament to how network executives box in their viewers to find a ratings silver bullet. No matter, these 18 episodes are self-containing and fully satisfying enough to get over the sting of the network apathy. I'll break a rule and do a little necessary promotion here. All this is captured in a DVD set this show deserves, with as much attention and love put into the extras (29 commentary tracks!) that was put into the show. It is the single best DVD I've ever seen. \n\nWho knows if the show would have been able to keep it up as the kids grew up and the show had to be written around it. As it stands, this is like lightening captured in a bottle. That perfect mix of all the elements coming together to make a truly classic series. No matter what the future holds, \"Freaks\" has a reserved place in my heart. This is really one for the ages, people. No list of modern classics is complete without \"Freaks and Geeks\". \n\n* * * * * / 5"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Shout! Factory",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1990721817",
        "name": "Freaks and Geeks: The Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGNlYTMzNmItMjczYS00NThjLWI1MDktNDRjMzY1OTk1OTliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGNlYTMzNmItMjczYS00NThjLWI1MDktNDRjMzY1OTk1OTliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:12:04Z",
        "url": "https://www.imdb.com/video/vi1990721817/"
    },
    "url": "/title/tt0193676/"
}