{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason James Richter",
            "url": "/name/nm0725284/"
        },
        {
            "@type": "Person",
            "name": "Michael Madsen",
            "url": "/name/nm0000514/"
        },
        {
            "@type": "Person",
            "name": "Francis Capra",
            "url": "/name/nm0135584/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18900,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064773/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007127/"
        },
        {
            "@type": "Person",
            "name": "Karen Janszen",
            "url": "/name/nm0418321/"
        },
        {
            "@type": "Person",
            "name": "Corey Blechman",
            "url": "/name/nm0088097/"
        },
        {
            "@type": "Person",
            "name": "John Mattson",
            "url": "/name/nm0560469/"
        }
    ],
    "datePublished": "1995-07-19",
    "description": "Teenager Jesse becomes reunited with Willy two years after the whale's jump to freedom as the teenager tries to rescue the killer whale and other orcas from an oil spill.",
    "director": [
        {
            "@type": "Person",
            "name": "Dwight H. Little",
            "url": "/name/nm0514546/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmZlNDBmMzctNmJiOC00YWZkLTk4MzYtOTU4NzZkMmUxMDRjXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "whale,boy,oil tanker,oil spill,killer whale",
    "name": "Free Willy 2: The Adventure Home",
    "original_info": {
        "id": "Free Willy 2: The Adventure Home_1995",
        "name": "Free Willy 2: The Adventure Home",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Juni78ukr"
        },
        "dateCreated": "2004-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113114/"
        },
        "name": "Pretty good and quite underrated sequel.",
        "reviewBody": "First of all, I have to say what I liked original Free Willy movie. In fact, I fall in love with it. I suppose it is one of the best family movie and best animal movie so far. For some reasons Simon Wincer, who directed the first movie didn't return for making this sequel, though we can see again all major characters from Free Willy. Our main hero, Jesse is now fourteen years old and he finds out that his mother passed away and he has a stepbrother named Elvis. Elvis hasn't got any relatives except Jesse and he arrives to Greenwood's home. The whole family goes to the holiday trip in a camping near an ocean's cove where Jesse again meets his friend Randolph and Willy. Willy found his family and all seems perfect for the friends but suddenly another danger threatens their friendship. But now it's even more serious. The movie was released in 1995, eight years before notorious tanker \"Prestege\" shipwrecked near Spanish coast and ruined hundred of miles of coastline, not to mention that millions living creatures got killed in the result. It was a real message and it passed absolutely unnoticed because for many people these movies are just cheesy movies for kids only. And in the real life the main reasons of the monstrous disaster was absolutely same  money. The other problem point of the movie is rather difficult and complicated relation between Jesse and his much younger stepbrother, Elvis (played by Francis Capra). Elvis, who has lost his mother, also feel himself very uneasy about the situation and now both boys have to decide how to deal with this difficult situation. The story is basically good written and leaves some place for action and excellent scenes in the cove, including underwater shots. This time we can see whales in their natural habitat, not in the small pool. Whole movie is well shot and locations for shootings are very suitable and good selected. Jason James Richter is as good as in original movie and Francis Capra also did a very good job as rather annoying Jesse's half-brother. The soundtrack (again written by Basil Poleydoris) is worth mentioning alone because of its rather good musical themes and songs. A very good movie for whole family and not a brainless laughable family entertainment that very often bring to us Hollywood studios. A nice message for young audience that you must always think about defending the wild nature and what in real life there are more important things than money.\n\nMy vote 8,2 out of 10 or between B+ and A-.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi413466905",
        "name": "Free Willy 2: The Adventure Home",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTA4MmNiM2YtNTNhNy00Njk5LWIzZjUtNGI5NDAxNmE0YmRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTA4MmNiM2YtNTNhNy00Njk5LWIzZjUtNGI5NDAxNmE0YmRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:00:10Z",
        "url": "https://www.imdb.com/video/vi413466905/"
    },
    "url": "/title/tt0113114/"
}