{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chali 2na",
            "url": "/name/nm0829263/"
        },
        {
            "@type": "Person",
            "name": "Muhammad Ali",
            "url": "/name/nm0000738/"
        },
        {
            "@type": "Person",
            "name": "Planet Asia",
            "url": "/name/nm1322154/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 571,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0092602/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0092603/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0092604/"
        }
    ],
    "datePublished": "2000-04-14",
    "description": "A documentary about freestyling--the improvised, on-the-spot rhymes that demonstrate the skills of hip-hop MCs.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Fitzgerald",
            "url": "/name/nm0280302/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDk2ODU5OTU2MF5BMl5BanBnXkFtZTcwOTY2ODkyMQ@@._V1_.jpg",
    "keywords": "2000s,20th century,new york,los angeles california,music documentary",
    "name": "Freestyle: The Art of Rhyme",
    "original_info": {
        "id": "Freestyle: The Art of Rhyme_2004",
        "name": "Freestyle: The Art of Rhyme",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Voivod-2"
        },
        "dateCreated": "2004-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0262424/"
        },
        "name": "A so-so documentary made with... LOVE!",
        "reviewBody": "This is a decent documentary with a very homemade and intimate feel, full of interesting people, and with compelling subject matter. Despite its admirable goals, I feel that it was a documentary with major flaws in it, and I have the sense that it had the potential to be a lot better than it was. Some of these shortcomings I would level against the director, while some seem to have their roots in the art form itself.\n\nMost importantly, as a showcase for freestyle as an art form, it is surprising to see how the MCs in this movie are, by and large, pretty wack. There are a few that are quite good-- particularly a talented freestyler named Juice who is easily the best rapper depicted -- but for the most part they are mediocre rappers with poor flow, throwing around tired battle rhymes. Even Supernatural, who is often cited as the world's best freestyler, doesn't seem all that remarkable. Nor does the much heralded Mos Def, who raps in a monotonous style that quickly proves tedious and boring. However, there is a very early clip of Biggie Smalls at age 17, rhyming in the streets of New York; it's both historically interesting and one of the better examples of freestyle featured in the movie. This clip also has a way of showing how a better selection of rhymes would have drastically improved the quality of the documentary. And even though \"Freestyle\" catches the loose and casual feel of impromptu \"cyphers\" (circles of freestylers that rhyme and battle), it is largely unable to capture many transcendent rhymes, the kind that you go to the movie in hopes of seeing. Unfortunately, there are only a couple times you might be genuinely impressed by the rhymes. In general, freestyle comes off in the movie as something that you respect and appreciate \"in theory\" rather than when you're actually presented with it, again, with a few exceptions. \n\nIf you didn't already know about freestyling, and hadn't already been exposed to good freestyling, this movie might convince you that freestyling is an interesting facet of urban culture, but it probably would not make a strong argument that it's a art form worth paying attention to. Sure, there are isolated moments of interest, but in general, it comes off here as a rather undeveloped art. On top of that there's all these guys doing these unenlightened rhymes that hardly seem like important or progressive social, political, or even humanitarian statements. I would have liked to have seen people rapping about intelligent things, not insulting each others' physical appearances and making wack attacks on each other's clothes! And yes, I realize that these MC battles are part of what freestyling is about and where it came from, yet the director does not attempt to explain what socially progressive purpose such rhymes provide. Agreed, that it helps create community, but what use is that community without a positive purpose? After all, it's not hard to gather crowds around fights.\n\nIn this manner, too much effort is made by the director to make freestyling out to be a \"spiritual\" exercise. While it is conceivably true, \"Freestyle: The Art of Rhyme\" nakedly makes overtures to convince you of this at every possible opportunity; and at times, it seems to use this \"spiritual\" veneer to gloss over the rampant violence, misogyny, and homophobia that comes through in many of the freestyle lyrics. It seems disingenuous on the part of the director to portray these rhymes as \"spiritual\" and \"expressions of the divine\" when they don't seem particularly bent on promoting consciousness. Instead, it almost seems that all the \"spiritual\" talk is a way of deflecting this sort of criticism. \n\nIn the end, I think this movie is largely for \"heads\" (AKA hardcore hip-hop fans); anyone else won't come out feeling too impressed by this art form, if their only exposure to it is based on this documentary. But ironically, hip-hop fans who will be interested in this subject matter are probably already knowledgeable about freestyling, and would likely be familiar with better and more interesting rhymes, ones that could elicit more provoking thought than these. For what it's worth, this movie is clearly a labor of love, and there's a deep respect and love for hip-hop culture involved in the making of this movie, but unfortunately it doesn't really translate into a very compelling documentary.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Freestyle: The Art of Rhyme",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi263695129",
        "name": "Freestyle: The Art of Rhyme",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzYwMDU2YzgtZWQwYy00Mzk5LTllY2QtZjk0YzdkMmJlM2QxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzYwMDU2YzgtZWQwYy00Mzk5LTllY2QtZjk0YzdkMmJlM2QxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2014-01-17T07:25:21Z",
        "url": "https://www.imdb.com/video/vi263695129/"
    },
    "url": "/title/tt0262424/"
}