{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Molly Ringwald",
            "url": "/name/nm0000208/"
        },
        {
            "@type": "Person",
            "name": "Andrew McCarthy",
            "url": "/name/nm0000530/"
        },
        {
            "@type": "Person",
            "name": "Patti D'Arbanville",
            "url": "/name/nm0001091/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1970,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062678/"
        },
        {
            "@type": "Person",
            "name": "Larry Ketron",
            "url": "/name/nm0450543/"
        }
    ],
    "datePublished": "1988-11-18",
    "description": "A Cincinnati college student breaks off his engagement to his wealthy fiancée after he falls in love with a backwoods Kentucky girl he meets at a party. She claims to be 20 years old, but he learns that she's actually just 16 and ...",
    "director": [
        {
            "@type": "Person",
            "name": "David Anspaugh",
            "url": "/name/nm0000770/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjE4MjgxNjUtM2UwMi00NzdmLTkyZDAtZWZiNTI1ZjBkZWZlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "fiance fiancee relationship,engagement,bikini,redhead,child abuse",
    "name": "Fresh Horses",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "celluloidcity"
        },
        "dateCreated": "2004-01-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095178/"
        },
        "name": "McCarthy and Ringwald: an attempt at a serious story.",
        "reviewBody": "After watching this film I had some questions. What does the title refer to? There are horses in this film but are they fresh? Does it refer to the couple at all? And what does that have to do with the love story? Who comes up with these movie titles? And why?\n\nSilly questions aside, Fresh Horses is a film with an adult story aimed at using the onscreen chemistry of Andrew McCarthy and Molly Ringwald, (who were first paired as everyone knows in the excellent Pretty In Pink) in a serious love story. Ringwald is Jewel, a mysterious country girl, all pink lips and tousled curly hair. She meets Matt (McCarthy) a college upper middle class guy with a pretty stable and boring life. He's engaged to the perfect women, and has your typical annoying university friends. She has a past and a reputation, but he becomes smitten with her and attempts to change his life so they can be together.\n\nAs my Video and Movie Guide said, this film is just an adult version of Pretty In Pink. He's more classy than her, she knows who she is and he has to learn to be worthy of her, not the other way around. I don't know about that judgement. Yes, it is the same couple. Yes, the story is similiar, but with sexual themes. But the more I think about the ending, the scenery and the sets of this film the more its intelligence shines through. The film is about pushing you to change, propelling someone to see their life through other's eyes and making you believe in yourself.\n\nAs someone said in the messageboards, the settings are eerie, and the characterisations are spooky. Viggo Mortensen is great as Green. Ben Stiller, as Matt's friend is weirdly creepy. We never quite know what people's motvations are, and although the dialogue is terribly clunky in moments between the two leads, this is a film that knows it is not formulaic. For the plastic period the 80's, Fresh Horses sits nicely jagged in its themes and story. They should not be all be standard and set."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Cincinnati college student breaks off his engagement to his wealthy fiancée after he falls in love with a backwoods Kentucky girl he meets at a party. She claims to be 20 years old, but he learns that she's actually just 16 and already married.",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1721484057",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjg2NzdhMzMtMDM2Yi00YTI3LTlkNmEtMjcxNTQ0MjcxZWJhXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjg2NzdhMzMtMDM2Yi00YTI3LTlkNmEtMjcxNTQ0MjcxZWJhXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-11T23:59:18.646Z",
        "url": "https://www.imdb.com/video/vi1721484057/"
    },
    "url": "/title/tt0095178/"
}