{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Valérie Lemercier",
            "url": "/name/nm0501256/"
        },
        {
            "@type": "Person",
            "name": "Vincent Lindon",
            "url": "/name/nm0512071/"
        },
        {
            "@type": "Person",
            "name": "Hélène de Saint-Père",
            "url": "/name/nm0756752/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2070,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Friday Night",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032394/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090290/"
        },
        {
            "@type": "Person",
            "name": "Emmanuèle Bernheim",
            "url": "/name/nm0076814/"
        },
        {
            "@type": "Person",
            "name": "Claire Denis",
            "url": "/name/nm0219136/"
        }
    ],
    "datePublished": "2002-09-11",
    "description": "It's Friday night--she's moving in with her boyfriend tomorrow--so she goes out, but gets stuck in traffic--where she meets a handsome stranger.",
    "director": [
        {
            "@type": "Person",
            "name": "Claire Denis",
            "url": "/name/nm0219136/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk4MTE5NzU0N15BMl5BanBnXkFtZTYwNDA3ODk5._V1_.jpg",
    "keywords": "traffic jam,strike,stranger,dinner,sex scene",
    "name": "Vendredi soir",
    "original_info": {
        "id": "Friday Night_2002",
        "name": "Friday Night",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2003-07-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0295743/"
        },
        "name": "Brief encounter during the Paris transit strike.",
        "reviewBody": "Claire Denis sure knows the French woman's mentality. She is very sly in presenting us this story, that on the surface tells us one thing, but deep down, it has nothing to do what we are actually watching.\n\nThe transit strike plot, with Laure sitting in traffic and going nowhere, is played too long. We all get the idea of the boredom and frustration of the driver caught in similar circumstances. That part of the film can drive the viewer nuts, since nothing happens.\n\nLaure doesn't feel any remorse into picking up Jean, who is obviously stranded, or is he?. Their conversation doesn't reveal anything, yet, one can feel where this is leading to: somewhere where Laure and Jean can copulate to their hearts content.\n\nThe clue of what's to come takes place after they have an espresso at the cafe. Jean asks for change to go downstairs to the vending machine for a 4 condom pack. Oh la la... Jean is not a casual sex offender, he must protect himself, as well as the woman he takes to bed. Casual meetings such as these can be very dangerous!\n\nThe scenes in the hotel are well staged. In fact, there is nothing shocking, or done in bad taste. When Laure and Jean are making out, their behavior is very chaste, without French kisses, (I wonder if Pres. Bush would call them Liberty kisses?...) is a let down. But Jean and Laure do it very stylishly and with decorum.\n\nJean, obviously, is not a one-woman man. After all he has more condoms in his pocket and when he is in the pizzeria, he spots another woman who makes it known she wants to play with him downstairs. \n\nAt the end of the film we watch Laure leave the hotel room running into the deserted streets with a grin on her face. She'll go now to her own lover as though nothing had ever happened that night. She is a woman empowered by her own will to have fun, yet not take it too seriously, or hurt anyone. Perhaps she's laughing at her own sense of adventure having done something that perhaps no one will ever know.\n\nBoth of the principals are very effective. Veronique Lemercier and Vincent Lindon play very well together. The director is perhaps telling us that there is still hope for all of us, non movie star types, to have fun and meet a partner for the night, have great sex on the next transit strike, if we are in Paris.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0295743/"
}