{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Salma Hayek",
            "url": "/name/nm0000161/"
        },
        {
            "@type": "Person",
            "name": "Alfred Molina",
            "url": "/name/nm0000547/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey Rush",
            "url": "/name/nm0001691/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 91840,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036374/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Hayden Herrera",
            "url": "/name/nm0380419/"
        },
        {
            "@type": "Person",
            "name": "Clancy Sigal",
            "url": "/name/nm0797397/"
        },
        {
            "@type": "Person",
            "name": "Diane Lake",
            "url": "/name/nm1187860/"
        }
    ],
    "datePublished": "2002-11-22",
    "description": "A biography of artist Frida Kahlo, who channeled the pain of a crippling injury and her tempestuous marriage into her work.",
    "director": [
        {
            "@type": "Person",
            "name": "Julie Taymor",
            "url": "/name/nm0853380/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzUxMTU0ZmEtZWE0Ni00NzJlLThhZTUtNDA1ZDZjZDUxYThiXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_.jpg",
    "keywords": "accident victim,part stop motion animation,physical disability,self portrait,father daughter relationship",
    "name": "Frida",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2002-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120679/"
        },
        "name": "gripping performance by Hayek",
        "reviewBody": "Salma Hayek (uni-brow and all) gives a genuinely great performance as `Frida,' the Mexican artist who is more famous, perhaps, as the wife of Diego Rivera than as a painter in her own right - although Rivera himself always insisted that it was Frida who had the greater talent.\n\nFrida Kahlo was a woman who endured a life of crippling pain caused by a trolley accident in her youth, yet her innate energy, passion and love of life - as well as her enormous abilities as a painter - allowed her to overcome that daunting obstacle to achieve a measure of fame and recognition. What she was not quite so successful in overcoming was her strenuous love/hate relationship with Rivera, which came to occupy her time and her life almost as much as her painting. In many ways, `Frida' is a typical artist bio, highly reminiscent of other recent films in the genre such as `Pollock' and `Surviving Picasso,' both of which also dealt with the serial philandering of their male artist figures. `Frida,' however, since it is focused more intensely on the woman's perspective, offers a few new insights into that seemingly inevitable theme. Frida, in many ways, prides herself on her independent, fiery nature, yet when Rivera becomes a part of her life, she quickly succumbs to his seductive charms. She marries Rivera even though she knows he is constitutionally incapable of remaining faithful to her. Thus, she sets herself up for a life of misery with a man she is utterly incapable of living without. That the relationship is one of utter co-dependency is demonstrated by the fact that Rivera, even after their numerous breakups, keeps coming back to his one true love.\n\nBased on the Hayden Herrera biography, the Clancy Sigal/Diane Lake/Gregory Nava/Anna Thomas screenplay doesn't paint Frida as some sort of passive victim of her own weaknesses nor as some sort of plaster saint martyr who was entirely guiltless in her own troubled life. We see, for instance, the hypocrisy inherent in her own romantic dalliances, principally her bisexual flings with other women and even the affair she conducts with none other than Trotsky himself during the period of his exile in Mexico (right before his assassination). We empathize with Frida because she functions as such a compelling figure in the context of the story, but we are never allowed to forget that she is a flawed human being, as capable of making a mess of her life as any of the men who generally occupy the lead position in these stories.\n\nIf for no other reason, `Frida' is worth seeing for the marvelous sense of history it provides, chronicling the turbulent period of the 1920's and 1930's when socialism was the `in' cause for the art world to rally around - at least until the arrival of Stalin when the pipe dream of a worker's state and a classless society fell victim to the murderous brutality of a regime more totalitarian in nature than the one it had replaced. Director Julie Taymor keeps the political issues of the era front and center, perfectly integrating them with the tumultuous relationship at the story's core. We witness, for instance, Rivera's struggle with Nelson Rockefeller when the latter commissions Rivera to paint a mural in one of his buildings. When Rockefeller, the personification of capitalism, balks at Rivera's glorification of Lenin in the painting, Rivera is forced to reexamine his own commitment to the cause he so vehemently espouses (the film makes an interesting companion piece to `The Cradle Will Rock' from a few years back). We also get to see some of the lip service paid by these artists to the socialist cause, as they live the good life among the elite pampered classes, often at the expense of the very workers whose rights they so loudly proclaim in their work.\n\nAs Frida, Hayek literally carries the film. Tender and vulnerable one moment, she can become fiery and self-confident the next. Hayak also captures much of the excruciating physical torment that Frida was forced to endure during her lifetime - and which often became the central subject of much of her art. Alfred Molina makes of Rivera a fascinatingly understated figure. His seeming world-weariness camouflages a tenderness and ability to love deeply, which, apparently, few in his life - apart from Frida - were ever able to see. Ashley Judd does a nice turn as one of Rivera's socialite devotees and Antonio Banderas makes his mark in his very brief appearance as David Siqueiros, a passionate socialist who accuses Rivera of kowtowing to the powers-that-be whom he claims to despise (Banderas is so good in the role that one regrets he isn't given more screen time). Geoffrey Rush, unfortunately, is not given enough time or good material to make much of an impression as Trotsky.\n\nTaymor has had mixed results integrating Frida's works into the story. The director occasionally dabbles in surrealism by having Frida and Diego literally enter into the world of her paintings. Sometimes it works; sometimes it serves merely as a fancy distraction. Still, Taymor at least deserves credit for boldness in such scenes.\n\nAll in all, `Frida' provides a fascinating portrait of its heroine - and one of the best performances of the year to go along with it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #3",
        "duration": "PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi871341593",
        "name": "Frida",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDVhMDdiOWUtZTAxOS00NTA1LTg1MjItODcwZjlhMzA1N2RhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDVhMDdiOWUtZTAxOS00NTA1LTg1MjItODcwZjlhMzA1N2RhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:22:20Z",
        "url": "https://www.imdb.com/video/vi871341593/"
    },
    "url": "/title/tt0120679/"
}