{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Melanie Kinnaman",
            "url": "/name/nm0455687/"
        },
        {
            "@type": "Person",
            "name": "John Shepherd",
            "url": "/name/nm0791803/"
        },
        {
            "@type": "Person",
            "name": "Anthony Barrile",
            "url": "/name/nm0057450/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 40560,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059493/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108859/"
        },
        {
            "@type": "Person",
            "name": "Martin Kitrosser",
            "url": "/name/nm0457725/"
        },
        {
            "@type": "Person",
            "name": "David Cohen",
            "url": "/name/nm0169308/"
        },
        {
            "@type": "Person",
            "name": "Danny Steinmann",
            "url": "/name/nm0826164/"
        }
    ],
    "datePublished": "1985-03-22",
    "description": "Still haunted by his past, Tommy Jarvis, who, as a child, killed Jason Voorhees, is sent to a secluded halfway house in the countryside, where the killing of a young man triggers a brutal series of murders in the area.",
    "director": [
        {
            "@type": "Person",
            "name": "Danny Steinmann",
            "url": "/name/nm0826164/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTIyOWI5YzEtMWZjZS00MGJmLWJmMzQtOTY1ZjU1YmI3OTVkXkEyXkFqcGdeQXVyMzc1MTc0Mzg@._V1_.jpg",
    "keywords": "jason voorhees character,sadistic killer,child in jeopardy,grindhouse film,murdered with a machete",
    "name": "Friday the 13th: A New Beginning",
    "original_info": {
        "id": "Friday the 13th: Part 5: A New Beginning_1985",
        "name": "Friday the 13th: Part 5: A New Beginning",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2018-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089173/"
        },
        "name": "A new beginning?",
        "reviewBody": "'Friday the 13th' may have been panned by critics when first released but since then it is one of the most famous and influential horror films, the franchise containing one of horror's most iconic villains. The film is popular enough to become a franchise and spawn several sequels of varying quality and generally inferior to the one that started it all of. \n\nThe fifth film in the series 'A New Beginning' is the most maligned 'Friday the 13th' film by critics and fans, although it has garnered a cult following and its fair share of defence over time. To me, 'A New Beginning' is better than its reputation and that it tries to do something different is laudable. Also do not think it's the worst 'Friday the 13th' film. Having said that, the disappointment is understandable. There are good merits here, but it also did fall short to me. \n\nStarting with 'A New Beginning's' strengths, the best things about it are the as ever haunting music score and the terrific performance, both disturbing and moving, of John Shepherd. There are a few darkly funny moments, a few creepy ones and some of the death scenes are creative. \n\nThe nightmare sequences are stylish and as nightmarish as one would hope. It's a pretty decent looking film, not cinematic art (but in all honesty that can never be expected from a 'Friday the 13th' film) but not amateurish.\n\nHowever, there are things that work against 'A New Beginning'. From my understanding, It is not that the film is different in the lack of Jason (this didn't bother me at all and is an insignificant issue), the more tongue-in-cheek tone and the idea it tried to introduce that irked fans, but the generally misguided way it was executed. \n\nMore problematic are the problems as a standalone. The acting is not good (Shepherd is the sole exception), Melanie Kinnaman being awful, and the clumsy and far too simple dialogue, that slips more into vulgar camp than darkly tongue-and-cheek, and the mostly annoying and dull stereotypes passing for characters fare worse (the only one to be interesting and get proper development is Tommy). \n\n'A New Beginning' has the highest body count, and while there are some creative and unsettling deaths (others less so, hurt by gratuity and predictability) it was almost as if there were too many death scenes that gives one not that much time to compose themselves after each one. There is not enough suspense, the creepiness is too far and between and the story is thin and very hackneyed, with one of the series' silliest endings. The mystery elements don't work, being far too obvious, and neither does the identity of the killer, the killings committed by somebody that is not in it much in their real guise and doesn't have much presence.\n\nIn summation, not that bad and not deserving of its black sheep reputation but a long way from being great. 5/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Still haunted by his past, Tommy Jarvis - who, as a child, killed Jason Voorhees - wonders if the serial killer is connected to a series of brutal murders occurring in and around the secluded halfway house where he now lives.",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3232350489",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjMxZDQ0ZjEtODU3YS00M2U1LTk4NGUtNWEzYzA1OGIzNzYxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjMxZDQ0ZjEtODU3YS00M2U1LTk4NGUtNWEzYzA1OGIzNzYxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-09-21T14:15:11.930Z",
        "url": "https://www.imdb.com/video/vi3232350489/"
    },
    "url": "/title/tt0089173/"
}