{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Isaac Stern",
            "url": "/name/nm0827716/"
        },
        {
            "@type": "Person",
            "name": "David Golub",
            "url": "/name/nm0326698/"
        },
        {
            "@type": "Person",
            "name": "Delun Li",
            "url": "/name/nm7077913/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 487,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "G",
    "description": "Isaac Stern's cultural tour of China is seen, with the master violinist performing and mentoring young Chinese musicians. He visits rehearsals of the Peking Opera, meeting with their musicians who use traditional Chinese instrumen...",
    "director": [
        {
            "@type": "Person",
            "name": "Murray Lerner",
            "url": "/name/nm0503635/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk4MzkwMjU0NV5BMl5BanBnXkFtZTcwNTE0MzcyMQ@@._V1_.jpg",
    "keywords": "musician,chinese,cultural revolution,china,country name in title",
    "name": "From Mao to Mozart: Isaac Stern in China",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lor_"
        },
        "dateCreated": "2022-12-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080762/"
        },
        "name": "Entertaining documentary is something special",
        "reviewBody": "My review was written in February 1981 after a screening on Manhattan's UWS: \"From Mao to Mozart\" is an entertaining and perceptive documentary on violinist Isaac Stern's three-week visit to China in June 1979. Filmmaker Murray Lerner, known for his 1967 docu \"Festival\" on the Newport Folk Festival, has recorded the human contact across different cultures that comes out in the faces and musical exchanges of the tour. Net result emphasizes the universality of human beings rather than their obvious differences.\n\nAs guest of the Chinese government, Stern and pianist David Golub visited Peking, Shanghai and other cities, with impressive young native ballet artists, acrobats and musicians all captured on film. The amazing degree of discipline and concentration among young Chinese is evident in every type of activity observed. Arresting travelogue footage of the vast, green countryside and bustling cities is included in the pic for transitions.\n\nThough brief concert performances by the duo are featured, Lerner concentrates on numerous rehearsals and auditions to give a candid view of what amounts to cultural shock. Stern is no diplomat, but his colorful criticisms of the young players' technique and lack of emotion in their playing pays off in priceless lessons from a truly gifted teacher. The reaction of the huge rehearsal audiences and the improvement in the players' work justifies Stern's lack of tact. Throughout, his emotional commitment to music is the film's inspirational hook.\n\nStern and Golub narrate various segments, giving their impressions of the trip, while Tan Shuzhen, deputy director of the Shanghai Conservatory of Music, narrates a most revealing segment dealing with his students. Shuzhen reports on his harrowing 14-month incarceration and other horrors during the Cultural Revolution that started in 1966, and concisely discusses the need for openness in music, which is why the tour and film came about in the first place.\n\nThough ostensibly a music documentary, picture succeeds due to Lerner's visual rendering of human faces. Editing, photography and sound recording are all top-notch. Already nominated, pic looms as a heavy Oscar contender and merits specially-handled commercial bookings based on its entertainment and educational value."
    },
    "url": "/title/tt0080762/"
}