{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marco Leonardi",
            "url": "/name/nm0502813/"
        },
        {
            "@type": "Person",
            "name": "Michael Parks",
            "url": "/name/nm0662981/"
        },
        {
            "@type": "Person",
            "name": "Ara Celi",
            "url": "/name/nm0148043/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12036,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019267/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0870559/"
        },
        {
            "@type": "Person",
            "name": "Álvaro Rodríguez",
            "url": "/name/nm0736155/"
        },
        {
            "@type": "Person",
            "name": "Robert Rodriguez",
            "url": "/name/nm0001675/"
        }
    ],
    "datePublished": "2000-01-18",
    "description": "Set 100 years ago in Mexico, this horror/western is the story of the birth of the vampire princess Santanico Pandemonium.",
    "director": [
        {
            "@type": "Person",
            "name": "P.J. Pesce",
            "url": "/name/nm0675894/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Horror",
        "Thriller",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODg4ZTc3ZmMtY2FiOC00MTI2LWJlZTYtMjc1YmY1YzcxOTAwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "outlaw,wild west,horror western,man tied up,hanging",
    "name": "From Dusk Till Dawn 3: The Hangman's Daughter",
    "original_info": {
        "id": "From Dusk Till Dawn 3: The Hangman's Daughter_1999",
        "name": "From Dusk Till Dawn 3: The Hangman's Daughter",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2010-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120695/"
        },
        "name": "\"You're a monster!\"",
        "reviewBody": "Just like the previous sequel, the third entry of the \"From Dusk till Dawn\" franchise would be another quickly produced straight-to-video sequel that would be somewhat a prequel to the original film. While I didn't think the second entry was as bad that it's usually made out to be, however \"Hangman's Daughter\" is still a definite improvement over \"Texas Blood Money\". In a way it kind of plays out more similar to the original, only this time the carnage is set in the early 1900s (where the Old West was coming to an end) to be finally played out once again in the seamy Mexican tavern that harbours blood-gushing surprises for its guests. For most part this horror western comedy is very well executed, as it's brashly pieced with its admirably crafted make-up FX, slickly directed for its low-scale budget and colourfully acted. The sweeping camera has scope framing the moody, sunbaked landscapes and story dramatics with constant flair with that spaghetti western brutality shinning through. It wears its influences quite proudly too. The mellow story starts of episodic --- focusing on an Civil war hero looking to long for some cause while on the other side is an infamous outlaw with a hypnotic runaway beauty whose father (a hangman) follows their trail. But the two while crossing paths during stages, eventually come to be one when they encounter an orgy of alcohol, sexuality and blood at a desolate inn that just happens to be home for the blood-sucking kind. Strangely enough while nasty and kinetic, I thought it became tiring when the survivors of the feeding work together despite their differences and try to fend off the vampires, as I thought the initial build-up was interestingly offbeat with its dry humour and lasting bite despite the systematic staples. Michael Park's wry character Ambrose Bierce is a fascinating one, as he pretty much soaks it up with little effort in which doing so emits an ambiguously tainted air about him. Marco Leonardi is quite a live-wire as the outlaw Johnny Madrid and his combination with the lovely, if pouty Ara Celi comes off. Temuera Morrison provides aggression and then Lennie Loftin and Rebecca Gayheart give out that twitchy energy as a married religious couple. In support is modest turns by Sonia Braga (who looks great!), Jordana Spiro, Orlando Jones and an always worthwhile Danny Trejo.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi938450457",
        "name": "From Dusk Till Dawn 3: The Hangman's Daughter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTI5MGE5NjYtOWExYy00ZjRmLThlZTQtZWM4YzMxYzJhNzMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTI5MGE5NjYtOWExYy00ZjRmLThlZTQtZWM4YzMxYzJhNzMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:22:31Z",
        "url": "https://www.imdb.com/video/vi938450457/"
    },
    "url": "/title/tt0120695/"
}