{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kathryn Walker",
            "url": "/name/nm0907923/"
        },
        {
            "@type": "Person",
            "name": "Justin Clune",
            "url": "/name/nm1186790/"
        },
        {
            "@type": "Person",
            "name": "Rudy Brooks",
            "url": "/name/nm1186760/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 509,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0159436/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        }
    ],
    "datePublished": "2002-04-29",
    "description": "The Year: 1883. The Place: The Montana Territory. The Challenge: Blizzards, hunger, scorching sun, forest fires, the neighbors, and more ... Three modern families experienced life on the American Frontier. If you think you know ev...",
    "genre": [
        "History",
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWMyMzY3YzUtNTFhOS00ZmQ2LTlmMjctNjBjZjMyZWMwZTQ2XkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "homesteading,frontier,tv mini series,cabin,old west",
    "name": "Frontier House",
    "original_info": {
        "id": "Frontier House_2002",
        "name": "Frontier House",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kurtz9791"
        },
        "dateCreated": "2005-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0320010/"
        },
        "name": "The best show to ever be on the small screen...",
        "reviewBody": "I've spent the last two weeks off and on watching this amazing experience. To slap on the title of 'reality show' would be a disgrace. Few shows, if any, can get so deep as to question our society and our place in the world.\n\nIt starts out simple. You think it's a show about modern day families trying to experience what it was like to live in 1883. But you are wrong. There are three \"families\": The Clunes: A wealthy Malibu family consisting of four children (one of them is a niece) and a father who is smart, but weak. His wife is a drama queen, though has a degree in culinary arts. The Glenns: A middle class suburban family from Tennessee. They are competitive people by nature, and see this as a game. There are two children, and the parents who are having marital problems. The Brooks': They start out as a father and his grown son, but half way through the father leaves to make room for his son's new bride. They are without a doubt the most positive and helpful people on the program.\n\nSo for five months we see them all struggle and work together to prepare for winter. Tears are shed, anger is expressed, and love is shared. There are some funny moments as well as some enlightening. But the show really makes it's point after the families go home.\n\nThe Brooks': They were married on the frontier, but before the show they lived together in Boston and were sharp young people with a good future ahead of them. After leaving the frontier, they are found in Mexico, just drifting through their honeymoon. They state they have been 'gypsies' since their return. Driving from place to place. Sure modern society holds so many more opportunities for them than the frontier did, but they still don't know what they are going to do with their lives.\n\nThe Clunes: They return to find the mansion that was under construction when they left completed. Only, there are so many rooms unused, it seems like a waste. In fact, it all seems like a waste at times.\n\nThe Glenns: The family with marital problems separates upon their return home. The wife turns to the church, while one of her children becomes addicted to video games, a habit that was not in place before the frontier. The father has moved into an apartment in Nashville, and hides there from the world. You can tell he misses the frontier. He says that the 21st century is so empty and hollow, they need to have support groups for victims of the 21st century. Upon further research, I discovered he moved back to Montana.\n\nSo we were conned. Here we thought we were watching an intelligent reality show about people seeing what life was like during another time period. But what they found was that the society we live in now is empty. Sure we have unlimited possibilities, and everything is instant. But is that the route we should be taking?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0320010/"
}