{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Vale",
            "url": "/name/nm0425061/"
        },
        {
            "@type": "Person",
            "name": "Laura Bailey",
            "url": "/name/nm1154161/"
        },
        {
            "@type": "Person",
            "name": "Yui Horie",
            "url": "/name/nm0394679/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5977,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025160/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046382/"
        }
    ],
    "datePublished": "2001-07-05",
    "description": "After her mother's death, Tohru Honda finds herself living with the Sohma family consisting of three cousins: Yuki, the 'prince charming' of their high school, Kyo the hot headed, short tempered outcast, and Shigure the mischievou...",
    "genre": [
        "Animation",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGM1ODM4YTAtMzk3Yi00OGVjLThjMGItN2FlZWFkZTJmYmI5XkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "shoujo,anime animation,human becoming an animal,based on manga,narrated by character",
    "name": "Fruits Basket",
    "original_info": {
        "id": "Fruits Basket_2001",
        "name": "Fruits Basket",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ratboy601"
        },
        "dateCreated": "2003-02-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328738/"
        },
        "name": "An unbelievably(in a good way) believable story!",
        "reviewBody": "In short, \"Fruits Basket\" is the best series I have seen in a long time. It's hilarious, heartfelt, and deep all at the same time. Although the medium is anime(Japanese animation) which I usually tend to think of as quite unrealistic, this is an astoundingly believable story. The writing is some of the best I have ever seen. Let me elaborate for you.\n\n First of all, some background on the series is needed if you've never seen it. The series is based around a girl named Tohru. Tohru's mother died one year before the series began and when we come in on the story(the first episode) her grandfather, whom she'd been living with, is renovating the house. He goes to stay with other family, but asks Tohru to stay with a friend so she won't miss school. Well, not wanting to impose upon her friends, Tohru pitches a tent in the forest. The land she's camping on happens to belong to the family of a classmate named Yuki Sohma. Three cousins, one being Yuki, invite her to live with them. There, Tohru soon learns the dark secret of the Sohma's. They are all cursed to turn into animals of the Chinese Zodiac when embraced by the opposite sex of non-family members.\n\nI have searched for a long time for something like this. This series not only helps me better understand who I am, but who I want to be. The characters are just so very well constructed that I can't help but love every one of them. There is something in every character, a characteristic, like unexplained anger, solemnity and mystery, or silliness that is just too eerily familiar. They remind me of myself. This is something that cannot be explained in words, but only through experience. This series has given me one more step forward towards understanding my life. There is a deep underlying theme to this series, and that is if you just be yourself, you will be fine.\n\nAs for the whole \"cursed to turn into animals\" thing, it may not be exactly \"believable\" as I stated in my summary, but it is an ingenious device that allows the writers to develop a schlew(that's the technical term) of analogies that make you(or me anyway) slap your forehead and go \"Oh my god! That's what I've been trying to figure out about myself forever!\" Well, not literally, but you get the point.\n\nAside from the deep end of it, lets move onto heartfelt. A relationship develops gradually between each character. You don't really even notice just how much you care about this relationship until they threaten to tear it apart once or twice. Out of respect for people who haven't seen it, I'll leave it at that. But I think it is a stroke of genius on the writers part. It makes you realize just how much you care about what's going on, and it keeps you eagerly anticipating the next episode.\n\nAnd, oh yes, for anyone who doesn't get into all of that mushy stuff, and deep philosophical crap, this is also a comedy. This series has made me laugh harder than shows that are meant to make you laugh. And the best part is, the writers know when to be serious, and when to be funny so that they don't ruin something that could've been great. They made darn well sure that this would be great and nothing short of it.\n\nTo sum this up, I laughed, I cried, and then I thought about it. And then I laughed some more. And I recommend \"Fruits Basket\" to anyone. And I wish happiness and enlightenment to anyone who is fortunate enough to set eyes upon this beauty."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Fruits Basket: The Complete Series",
        "duration": "PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2379586841",
        "name": "Fruits Basket: The Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2E1ZGViYTgtYzY0Ni00NDdiLThhZjAtYTcyZWMxYTA0NzA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2E1ZGViYTgtYzY0Ni00NDdiLThhZjAtYTcyZWMxYTA0NzA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-04-07T03:19:44Z",
        "url": "https://www.imdb.com/video/vi2379586841/"
    },
    "url": "/title/tt0328738/"
}