{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ching Wan Lau",
            "url": "/name/nm0490513/"
        },
        {
            "@type": "Person",
            "name": "Francis Ng",
            "url": "/name/nm0628757/"
        },
        {
            "@type": "Person",
            "name": "Amanda Lee",
            "url": "/name/nm0496797/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1226,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Full Alert",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001210/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078888/"
        },
        {
            "@type": "Person",
            "name": "Ringo Lam",
            "url": "/name/nm0482681/"
        },
        {
            "@type": "Person",
            "name": "Wing-Kin Lau",
            "url": "/name/nm0490634/"
        },
        {
            "@type": "Person",
            "name": "Yuen-Leung Poon",
            "url": "/name/nm0690931/"
        }
    ],
    "datePublished": "1997-07-18",
    "description": "Police Inspector Pao is trying to catch Mak Kwan, a gang member who is first arrested, but then escapes from the prison. By chance, Pao realizes that the target of Kwan's gang is the H. K. Jockey Club.",
    "director": [
        {
            "@type": "Person",
            "name": "Ringo Lam",
            "url": "/name/nm0482681/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTM0OTJkZjAtMGIxNi00Y2E1LWJhNWQtYWE5MDM4YzcxMWRmXkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_.jpg",
    "keywords": "revenge,dead partner,hong kong,mafia,escape from prison",
    "name": "Go do gaai bei",
    "original_info": {
        "id": "Full Alert_1997",
        "name": "Full Alert",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "paul_haakonsen"
        },
        "dateCreated": "2012-07-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0134664/"
        },
        "name": "Predictable, yes... but still quite entertaining...",
        "reviewBody": "\"Full Alert\" (\"Go do gaai bei\") is a fairly average movie of its genre, that being an action / drama / thriller movie of cat and mouse chasing between one police man and one criminal.\n\nSure, the story has been used countless times in other movies, and there is nothing really innovating or groundbreaking to be seen, then \"Full Alert\" is actually good entertainment. Why? Well because of the director's hand; Ringo Lam really managed to do a great job with this movie. But of course, the movie was this well-working not only because of the direction, but also by the very convincing and great acting performances by both Ching Wan Lau (playing inspector Pao) and Francis Ng (playing Mak Kwan). It should be said that all people in the movie were actually doing great jobs with their given roles.\n\nThere is just the right amount of action and suspense in \"Full Alert\" to keep it thrilling and interesting from start till end, but of course the acting worked wonders as well. I, personally, liked that the action took place in various places, but especially on the crowded streets of Hong Kong in broad daylight. That is just magnificent.\n\nIf you enjoy these types of crime movies, despite them being predictable to the core, then \"Full Alert\" is well worth checking out, as it has enough action to stand alongside any Hong Kong movie, and a solid storyline to keep the audience hooked. And if you enjoy the Hong Kong cinema of action movies, then you should give \"Full Alert\" a chance. Despite it being from 1997, then it still holds up today.\n\nOn a side note, it is a bit odd that it is only now in 2012 that I have come to know of and see this movie. Probably because I've never been much fan of Ching Wan Lau, even though he did a great job in this movie. Francis Ng, however, well I do like his movies, so it is about time that I got around to watching this movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0134664/"
}