{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tsuyoshi Ujiki",
            "url": "/name/nm0880299/"
        },
        {
            "@type": "Person",
            "name": "Tomorô Taguchi",
            "url": "/name/nm0846630/"
        },
        {
            "@type": "Person",
            "name": "Takeshi Caesar",
            "url": "/name/nm0128378/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1862,
        "ratingValue": 6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066530/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006071/"
        },
        {
            "@type": "Person",
            "name": "Itaru Era",
            "url": "/name/nm1024275/"
        },
        {
            "@type": "Person",
            "name": "Hiroki Yamaguchi",
            "url": "/name/nm0971670/"
        }
    ],
    "datePublished": "1997-12-05",
    "description": "An inexperienced gangster is killed alongside his strong, respected boss and awakens to find a mad scientist has given him a new body made partly of his boss and partly of indestructible bionics.",
    "director": [
        {
            "@type": "Person",
            "name": "Takashi Miike",
            "url": "/name/nm0586281/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Crime",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODI2OGJlZGEtZWQzNC00ZmIyLWJhY2ItMmI1MWM2ZGM3MWJmXkEyXkFqcGdeQXVyMzg2MzE2OTE@._V1_.jpg",
    "keywords": "sex scene,heart transplant,japanese cyberpunk,yakuza,scientist",
    "name": "Full Metal gokudô",
    "original_info": {
        "id": "Full Metal Yakuza_1997",
        "name": "Full Metal Yakuza",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Infofreak"
        },
        "dateCreated": "2004-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0299910/"
        },
        "name": "'Full Metal Yakuza' isn't quite as amazing as Miike's 'Fudoh: The New Generation' or 'Ichi The Killer' but it's still pretty out there and highly recommended to fans of extreme Asian action.",
        "reviewBody": "I've already seen Takashi Miike's 'Fudoh: The New Generation', 'Visitor Q' and 'Ichi The Killer' so I'm prepared for just about anything from this amazingly prolific and eclectic director. But as 'Full Metal Yakuza' is an early Miike movie, made with a small budget for the direct to video market, I expected it to be a throwaway action comedy with little evidence of Miike's future brilliance. However, much to my delight, it actually still managed to surprise me, and despite being a cheap riff on 'RoboCop' (one of my all time favourite movies) Miike doesn't play it safe, and you can see bits of 'Ichi the Killer' in there waiting to burst out. This was Miike's twentieth(!) movie give or take, and despite having already released his breakthrough film 'Fudoh' it was still a long way before he was to be discovered by Western movie buffs in a big way. Miike was mainly working in the direct to video market which at the time gave film makers a lot of creative freedom if they made low budget genre movies that were able to sell a few thousand copies. He certainly took advantage of that freedom as the movie mixes silly comedy, bloody fight scenes, tacky special effects and costumes with a brutal gang rape sequence which Hollywood action directors just couldn't have gotten away with. Miike says he wanted the audience to be confused in how they were supposed to react and I think he succeeds big time! There are a few familiar faces in the cast from other Miike movies and those by Beat Takeshi and Shinya Tsukamoto, but the star Tsuyoshi Ujiki was unfamiliar to me. In Japan he is best known as a rock star with Kodomo Band. Uliki plays Hagane a bumbling low level yakuza who is killed when he gets caught in an assassination attempt on his boss whom he worships. But in fact Hagane doesn't die, he is resurrected by an eccentric scientist who has created a new body for him made out of a combination of metal and spare parts supplied from his dead boss! The rest you just have to see to believe. Hagane is far from your typical Yazuza tough guy, and in many ways you can see his character as being a dummy run for Ichi. 'Full Metal Yakuza' isn't quite as amazing as 'Fudoh' or 'Ichi' but it's still pretty out there and highly recommended to fans of extreme Asian action."
    },
    "url": "/title/tt0299910/"
}