{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gene Hackman",
            "url": "/name/nm0000432/"
        },
        {
            "@type": "Person",
            "name": "Teri Garr",
            "url": "/name/nm0000414/"
        },
        {
            "@type": "Person",
            "name": "Burgess Meredith",
            "url": "/name/nm0580565/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 771,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051510/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019433/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004522/"
        },
        {
            "@type": "Person",
            "name": "Bill Bozzone",
            "url": "/name/nm0102564/"
        }
    ],
    "datePublished": "1988-11-23",
    "description": "In Texas, Floyd is the owner of a decadent bar nearby the coast. He misses his wife Dorothy, who disappeared one year ago, and does not pay attention to the business, giving credit to everybody. His senile father-in-law The Genera...",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Masterson",
            "url": "/name/nm0557751/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTY5YTBjZTQtYTYwYy00MzAxLWI5ZjktYWM1NjQ5ZjRiMDc0XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "barkeeper,old man uses a wheelchair,bar,coast,texas",
    "name": "Full Moon in Blue Water",
    "original_info": {
        "id": "Full Moon in Blue Water_1988",
        "name": "Full Moon in Blue Water",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Baceseras"
        },
        "dateCreated": "2014-11-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095186/"
        },
        "name": "Full Moon in Blue Water",
        "reviewBody": "A wonderful little movie that got overlooked in the distribution mill at the time of its release, \"Full Moon in Blue Water\" is overdue for rediscovery. It has so many parallels to \"Moonstruck\" that one could mistakenly peg it as a copycat, but guess again: \"Full Moon\" was completed before \"Moonstruck\" was ready for previews; the similarities are merely coincidental; and there's no need to choose between the two, when both films are so easy to love. Gene Hackman leads as Floyd, the owner of a rambling, cozy restaurant-shack on the Gulf Coast of Alabama: he's a man emotionally stalled by the disappearance of his beloved wife. She disappeared while swimming and everyone presumes her dead, but Floyd can't accept this; he believes she was drawn away by an undertow and struck her head: that she's wandering now with amnesia but someday will return to him. Business is dwindling at the shack, but he refuses all offers to buy him out: he's keeping the place for Dorothy to come home to. In the meantime Louise (Teri Garr) keeps him company, and wants more, a real commitment from him - her frustration is touching and funny. She can argue down all of his high-flown romantic notions, and his practical objections too, but when he remembers his loss he grows wistful and drifts away where she can't reach him. Their sad-tinged love affair is played out with screwball logic. It's Jimmy (Elias Koteas), a mildly retarded young man who sweeps up around the shack and cares for Floyd's in-and-out senile father (Burgess Meredith), who twists the screw to its tightest, by doing something so ghastly - something that would be absurdly funny if it weren't too appalling for laughter - and then tops even that by springing the worst possible plan to resolve matters, at the worst possible moment. \"Full Moon in Blue Water\" takes a kidding approach to the \"magic\" of romance, but on some level believes in it too; that it's able to keep both attitudes in play at the same time may be the best of what it shares with \"Moonstruck.\" Its special distinctions are worth discovering.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A widowed bar owner with the weight of the world upon him encounters a lonely woman who is determined to change his luck. Many comic moments from the bar's clientele.",
        "duration": "PT33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3756376857",
        "name": "Teaser Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmI3YTNlYTUtZTMwZi00MzQ5LWI4ZWItY2EzOTM2MGNlOTRlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmI3YTNlYTUtZTMwZi00MzQ5LWI4ZWItY2EzOTM2MGNlOTRlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-16T20:48:22.044Z",
        "url": "https://www.imdb.com/video/vi3756376857/"
    },
    "url": "/title/tt0095186/"
}