{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gene Wilder",
            "url": "/name/nm0000698/"
        },
        {
            "@type": "Person",
            "name": "Christine Lahti",
            "url": "/name/nm0001441/"
        },
        {
            "@type": "Person",
            "name": "Mary Stuart Masterson",
            "url": "/name/nm0000524/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1510,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066818/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Bob Greene",
            "url": "/name/nm0338686/"
        },
        {
            "@type": "Person",
            "name": "Norman Steinberg",
            "url": "/name/nm0825799/"
        },
        {
            "@type": "Person",
            "name": "David Frankel",
            "url": "/name/nm0291205/"
        }
    ],
    "datePublished": "1990-09-21",
    "description": "NYC cartoonist Duffy meets the bad cappuccino maker, chef Meg, and falls in love. She moves in with him, marries him - but they have problems having a baby.",
    "director": [
        {
            "@type": "Person",
            "name": "Leonard Nimoy",
            "url": "/name/nm0000559/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIxZTU0YmYtNzAyYi00MjVmLWIzYmMtMTdmNzgwNmFkZGY2XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "baby,chef,cartoonist,fertility clinic,remarriage",
    "name": "Funny About Love",
    "original_info": {
        "id": "Funny About Love_1990",
        "name": "Funny About Love",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oOoBarracuda"
        },
        "dateCreated": "2016-06-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099623/"
        },
        "name": "\"I know my timing stinks but look at this, look at all the stuff I know, isn't that worth something? It's gotta be worth something.\"",
        "reviewBody": "Friend Leonard Nimoy directed Gene Wilder in his 1990 film, Funny About Love. Also starring Christine Lahti and Mary Stuart Masterson, this romantic comedy showed the struggle of the human need to reproduce and the struggles that come with infertility. Funny About Love is nothing spectacular but goes the distance in describing a difficulty felt by 1 in every 8 couples with some humor. Human life is full of decisions, just as it is changing our minds about those decisions, Funny About Love shows this inextricable part of human life through one New York City couple. \n\nDuffy Bergman (Gene Wilder) is on top of the world in his field as a renowned political cartoonist. One night at a book signing he is hosting, he tastes some horrible cappuccino and since \"coffee is very important to him\" he decides he must meet the person responsible for the dreadful cup. When he is taken to her, he is instantly smitten with her beauty and attempts to get Meg (Christine Lahti) to agree to a date with him. Although initially reluctant, Meg is eventually won over by Duffy's lighthearted comedic disposition and agrees. The two eventually marry and decide, in spite of Duffy's reservations to have a child together. After three years of infertility treatment, Meg is dejected and sick of failure and wishes to stop trying to conceive. Never really getting over his uncertainties, Duffy was thrilled with Meg's decision. As Meg's culinary career kicks into overdrive during the respite from attempting to have a child, Duffy begins to actually want to have a baby. This time, it is Meg that is unsure and wants to wait to have a baby. The constant battle of when and if to have a baby proves to be too much for their marriage and the two separate. In their time apart, they both realize what they really want; but can they get what it is they want with each other?\n\nGene Wilder plays the quirky jokester of a cartoonist well, and Christine Lahti plays his lighthearted wife well. The two share a beautiful on-screen chemistry making the otherwise forgettable film more fun to watch. There's nothing really to take away from this story unless you are a fan of one of the principles. The writing struggles through the entire film, being very abrupt in all the right places. I can't understand how Gene Wilder was in this film. The incredibly personal story line of the intense struggle of infertility and in- vitro fertilization after losing his wife the year prior to cancer after experiencing years of infertility. That is the aspect I take most from this film. I gain more respect for Wilder as an actor for being able to endure such a plot that so closely resembles his own life.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0099623/"
}