{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Takehito Koyasu",
            "url": "/name/nm0468729/"
        },
        {
            "@type": "Person",
            "name": "Bridget Hoffman",
            "url": "/name/nm0033977/"
        },
        {
            "@type": "Person",
            "name": "Shin'ichirô Miki",
            "url": "/name/nm0586528/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1009,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "Fushigi Yûgi - The Mysterious Play",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106793/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046382/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071886/"
        }
    ],
    "datePublished": "1995-04-06",
    "description": "A girl named Miaka Yuuki and her friend Yui Hongo are taken into the book called The Universe of the Four Gods. There they battle many hardships including each other in order to become the priestess of Suzaku and Seiryuu and summo...",
    "genre": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWI1YmQ1NTItZTlmMy00MTFlLWJkZWMtM2I0MWQ3NWFlM2VjXkEyXkFqcGdeQXVyMzExODYzNzc@._V1_.jpg",
    "keywords": "isekai,shojo,female frontal nudity,female nudity,female rear nudity",
    "name": "Fushigi Yûgi",
    "original_info": {
        "id": "Fushigi Yugi: The Mysterious Play: Eikoden_2002",
        "name": "Fushigi Yugi: The Mysterious Play: Eikoden",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chibi_noa"
        },
        "dateCreated": "2003-08-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111973/"
        },
        "name": "Not at all that great.",
        "reviewBody": "I've heard so much praise for this series that I decided I have to watch it myself... What better for a fantasy freak like myself, I thought, than an anime with pretty art, an alternative fantasy universe with gods and magic, and a little romance on the side? I was wrong. \"Fushigi Yuugi\" is one of the worst series I've ever watched - I had to quit it halfway, I just couldn't take it anymore.\n\nThe basic story, if not too original, has potential - but it is dealt with in such an annoying and cliche way that it's totally uninteresting. I only kept watching as far as I did because I was interested in what happens to the twins.\n\nThe characters are mostly horrible - the heroine is one of the stupidest, most detestable ever to appear on screen. Sorry Miaka-fans, I just find her to be ditzy, idiotic, dependant and horribly annoying. Her male counterpart is only a little better - after a while you really get sick of the whole \"Tamahome!!!\" - \"Miaka!!!\" recurring motif. Most of the protagonists are not much better, save the wonderful characters of Nuriko and Tasuki, who really don't get enough screen time at all. Mostly I found myself rooting for the bad guys, though they also are led by the uninteresting Nakago, who may seem cool at first, but is really no more than the usual power-crazed maniac. The twins Amiboshi and Suboshi, however, are fascinating and identifiable, and really save the viewer from total boredom. Too bad they don't get that much screen time either.\n\nThe animation is pretty bad, and Yuu Watase's beautiful drawings fail to be transferred onto the screen faithfully. It is a good indication of the animation quality that Hotohori, supposedly the most beautiful man in the world, often looks squashed and deformed and very unappealing.\n\nAll in all, this series is horribly overrated, imho. For GOOD fantasy anime, check out Slayers or, if you're looking for a really fascinating story and gorgeous art, try Utena (which is the best anime ever, imho.)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Pioneer Entertainment",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi162070809",
        "name": "Fushigi Yugi",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGQxMDA0YWYtMzA5Ni00NzhkLWJlNWItNzY4NjdjNzkyMTViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGQxMDA0YWYtMzA5Ni00NzhkLWJlNWItNzY4NjdjNzkyMTViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:14:06Z",
        "url": "https://www.imdb.com/video/vi162070809/"
    },
    "url": "/title/tt0111973/"
}