{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Campitelli",
            "url": "/name/nm1687218/"
        },
        {
            "@type": "Person",
            "name": "Yngwie Malmsteen",
            "url": "/name/nm1315118/"
        },
        {
            "@type": "Person",
            "name": "Joe Satriani",
            "url": "/name/nm0766354/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 219,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094851/"
        }
    ],
    "datePublished": "2004-03-01",
    "description": "The G3 summit rules in favor of the power of rock in the electrifying Live In Denver! Join six-string legends Joe Satriani and Steve Vai with special guest Yngwie J. Malmsteen for a guitar odyssey you'll never forget.",
    "director": [
        {
            "@type": "Person",
            "name": "A. Karim Karmi",
            "url": "/name/nm1514835/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQwODI1NzQxMV5BMl5BanBnXkFtZTcwNjM5MDUyMQ@@._V1_.jpg",
    "name": "G3 Live in Denver",
    "original_info": {
        "id": "G3: Live in Denver_2004",
        "name": "G3: Live in Denver",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tyler_campbell_21@hotmail.com"
        },
        "dateCreated": "2005-04-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0409994/"
        },
        "name": "A Fairly Good Concert...",
        "reviewBody": "Me, a HUGE fan of the 3 guitarists in this DVD, Yngwie, Satch and Vai playing together seemed like an unfathomable combo. The DVD starts with Satch, which was a good performance, but nothing to other Satch Performances (eg. Live in San Fran.) He seemed very tame, nothing super special or anything...and very high....more so at the jam...look at the guy's eyes. Vai's performance was the best of the night (Due to Tony MacAlpine, Billy Sheenan and Dave Weiner backing him up) \"I Know Your Here\" was absolutely AMAZING. The other two performances were good, especially the part where they played each other's guitars. Very Nice. Yngwie's Performance was also very good (Forget what the last guy said about Yngwie's \"Limited Skill\" Satch and Vai even say themselves very few can touch Yngwie. PERIOD.) His performance was really nice, more so at the Acoustic Guitar Solo and Far Beyond the Sun. Tho Yngwie's Flair has DRASTICALLY dropped due to his weight (seriously a Fat Guy who dresses like he is still thin is silly), the kicks and the attitude was kinda lame, and Yngwie's Drummer kinda sucked huge,Yngwie himself was still very good, but anyone who goes to see Yngwie Malmsteen in concert, only come for Yngwie. The Jam was nice, Vai, once again best of the latter with his rendition of \"Little Wing\", Satch's \"Rockin in the Free World SUCKED\". It was very corny and cheese ball and his singing was awful. Sorry, I expected more form the Silver Surfer. Yngwie's \"Voodoo Chile\" was good, tho Yngwie's Chain-Smoking-Blues-Bar Voice didn't do it for me, but still was all right. On the whole, Steve Vai takes the Show on this DVD with help of Sheenan and MacAlpine(who MURDERED Vai in their duel.) Yngwie is Runner up, even if he looks like a silly fat pirate, the guy can play his cholesterol-infested heart out. Yngwie lost A lot of weight so maybe he will return to that cocky, charismatic guy I LOVE. Satch, I love ya, but you were boring this night. Sorry. G3 2003 is still a great buy, so pick it up! 8 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0409994/"
}