{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Holton",
            "url": "/name/nm0392625/"
        },
        {
            "@type": "Person",
            "name": "Adam Baldwin",
            "url": "/name/nm0000284/"
        },
        {
            "@type": "Person",
            "name": "Tom Waldman",
            "url": "/name/nm1369586/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4486,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0432391/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068448/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025618/"
        },
        {
            "@type": "Person",
            "name": "Clive Saunders",
            "url": "/name/nm0766763/"
        },
        {
            "@type": "Person",
            "name": "David Birke",
            "url": "/name/nm0083547/"
        }
    ],
    "datePublished": "2003-05-13",
    "description": "Model citizen, devoted father, loving husband and serial killer John Wayne Gacy - a man with over 30 dead men and boys entombed in the crawl space underneath his family house. Based on a true story.",
    "director": [
        {
            "@type": "Person",
            "name": "Clive Saunders",
            "url": "/name/nm0766763/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2E4ZTFiMzgtYzIyNS00NWQxLWExMDQtNjM2MWQxMmQ5ZjBmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "character name as title,body in a trunk,john wayne gacy character,true crime,crawlspace",
    "name": "Gacy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "liberalblossom15"
        },
        "dateCreated": "2007-03-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0330181/"
        },
        "name": "Whoo, That Smell! Can't You Smell That Smell?",
        "reviewBody": "Having a low budget doesn't always mean having a bad movie, but in this case it does. While other directors use their minimal budget to produce the best film they can, Clive Saunders seems to have blown it all on something, because this film looks like it could have easily been made on $1,000. I found it to be dull, poorly written/acted/directed, and an insult to the intelligence of viewers who have actually done the research on Gacy that these film makers neglected to do.\n\nThe setting is horrible. The movie is supposed to be taking place in Chicago, but the Southern California architecture, mountains and palm trees make it clear that the production never left Los Angeles. The film is supposed to take place in the seventies, but it doesn't give off the authentic feel at all. The script gives one the feeling that it was a first draft whipped up in one weekend and put to film without so much as one editing session. The dialogue is weak and unbelievable in many scenes, and there seemed no basic plot whatsoever. With directing, editing and shoddy camera work such as appears in this film, these people should be banned from ever making films again. Seriously, I could do better with a bunch of friends and a camcorder.\n\nNow, I want to start right off by saying that I did not go into this hoping for blood and guts and gore...what I wanted was to learn a little background on the man himself. Although I love those aspects of horror films, I wanted more of a psychological view of Gacy, and that is what the film failed to deliver. All it managed to do was show scenes of bugs in his crawl space, him going to and from work, him being harassed and beaten up for the money he owes, and the overwhelming emphasis placed on the stench of the decomposing bodies hidden under the house.\n\nWorst of all, Gacy is portrayed as somewhat of a bumbling idiot rather than the scarily intelligent being he was. All of the deaths that are shown seem to have been committed on accident - such as the boy he was drowning in the bathtub when he was interrupted. When the boy fell down dead, he looked like he'd \"made a boo-boo.\"- Not to mention the fact that he would leave dead bodies lying around the house and his roommates wouldn't take any notice. I realize that some people don't make it their business to report suspicious crimes or get involved, but that is just ridiculous.\n\nYes, I will admit that I wanted at least one scene of brutal violence from the film, but only for it to give me a full perspective of Gacy's crimes. I wanted a true story that did the story of the killer justice as well as creep me out, but instead I received this boring mess. Don't do like I did. Spare your intelligence and read up on Gacy instead, I guarantee you that what you read will entertain and scare you more than this film ever could.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0330181/"
}