{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maria Kawamura",
            "url": "/name/nm0442844/"
        },
        {
            "@type": "Person",
            "name": "Naoko Matsui",
            "url": "/name/nm0559471/"
        },
        {
            "@type": "Person",
            "name": "Lisa Ortiz",
            "url": "/name/nm0651184/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 313,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076211/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074495/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047735/"
        },
        {
            "@type": "Person",
            "name": "Hideki Kakinuma",
            "url": "/name/nm0435393/"
        },
        {
            "@type": "Person",
            "name": "Sukehiro Tomita",
            "url": "/name/nm0866742/"
        }
    ],
    "datePublished": "1986-07-26",
    "description": "Galactic war rages between amoeban Paranoids and all-female Solnoids. Solnoid battleship, Star Leaf, with crew of seven is sent to defend Chaos, a planet that's being terraformed. However, they're part of an experiment.",
    "director": [
        {
            "@type": "Person",
            "name": "Katsuhito Akiyama",
            "url": "/name/nm0015425/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Animation",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTNiZDE3NTktYWM0My00ZjNkLWI2MGEtZTFhNWMyMDQwZDFjXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "outer space,endless war,female soldier,clone,experiment",
    "name": "Gall Force: Eternal Story",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vkn"
        },
        "dateCreated": "2002-05-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0158628/"
        },
        "name": "A flawed film with an inspiring message buried in it somewhere.",
        "reviewBody": "Deep in space, a war is being waged between two races. In the red corner, we have the Solnoid race, consisting entirely of women with day-glo hair. The blue corner is graced by the Planoids, who're actually a kind of ooze that inhabits various mechanical 'shells' to get around. These two races are hell-bent on wiping each other out and have been at war for as long as everyone can remember. During a Solnoid/Planoid space skirmish, the Solnoid ship Star Leaf is badly damaged, leaving only seven Solnoids alive on board. Their orders are to head to planet Chaos, which may provide a safe haven for the Solnoid race. Only getting there won't be easy, with their ship pretty much falling apart, and several other dangers menacing them. The Planoids attack en route and manage to get a strange monster on board the Star Leaf, which further menaces the Solnoids. After the long voyage through space, only three surviving Solnoids make it to planet Chaos, where they eventually discover that they've been used as pawns in a plot of epic scope - to create a hybrid between the two races that may bring an end to the constant, and ultimately suicidal war. However, the results of this experiment are not what the top brass expected (it ought to surprise the viewer a fair bit as well), and everything dissolves into fighting again.\n\nThe storyline has a lot of strong points. It tries to point out the insane futility of war and violence, there are plenty of atmospheric moments, with a surprise creation theory and sad/hopeful ending thrown in for good measure. With this sort of plot strength, it ought to be a tremendous film. Alas, due to several flaws it just doesn't make that grade.\n\nThe most obvious shortcoming is the very weak characterisation. Out of our seven Solnoid protagonists, only about two of them show any character trait whatsoever (Rumy is an incompetent whiner, and Lufy is an arrogant butch - hardly fascinatingly rounded characters, in fact). The rest are just a bland bunch who show no distinct personality whatsoever. They really have only their hair colors to distinguish between them. Even Rabby, who gets most of the screen time never becomes more than the one with long, red hair and dangly earrings. If someone asked me to describe her personality, I seriously wouldn't know what to say.\n\nAnd if the characters are mostly dead bland, it knocks away a lot of the story's impact. A lot of them die, which is supposed to be dead tragic, but since almost nothing has been done to make the viewer feel familiar with and sympathetic for most of the victims before their untimely death, it doesn't hit home as hard as it should. Worse yet, a lot of the deaths just seem stupid - \"you know what? I'll just stay behind on this exploding ship and get myself killed so you lot can do a few agonised wails and droopy stares for the next two minutes. Yeah, that seems like a good idea!\" On at least two occasions, one of our heroines 'heroically sacrifices' herself for a reason that appears really stupid and needless. This extends to other plot elements as well - supposedly lethal threats to our heroines turn out to be all mouth and no trousers and emotional scenes are cut short of any impact. Near the end, the Solnoids send their two droids to activate some kind of gizmo that devastates the whole planet, with almost no hint to the viewer as to what that thing is (did it just pop out of nowhere, or the Solnoids put instant-death gizmos on every planet?), or the reasons why they're going so over-the-top with this drastic last resort. More time spent on building up dramatic situations somewhat, and more insistance on the actual plot behind it all besides the brief explanations would've been nice, rather than letting the viewer do so much distilling by himself.\n\nThe dated look and even sound of the film are other flaws that drag down the film's promise. While the animation is fluent enough and some very intricate mecha show up, the character designs are awfully simplistic, with hardly any detail to them at all. Facial expressions of shock, anger or any other emotion become a lot less convincing this way, and the lack of finesse and detail on the characters makes them look almost as bland as they behave. An eye-candy banquet this sure is not - in fact, it looks downright sloppy in places. And the music composer strikes some very wrong notes by mixing in awfully cheesy insert songs here and there (complete with very dull, lengthy 'music clips'). The music in general is often badly out of whack with the tone of the on-screen happening. Seriously, who in their right minds would use a joyful plinkety-plonky music for an aerial dogfight scene?\n\nIt's a shame that such shortcomings stand in the way of an interesting and potentially very deep plot. There are obvious strengths to Gall Force which make it recommendable, but flaws that stick out painfully and will definitely hit a sore spot with many viewers as well. Utter sci-fi diehards may enjoy the film's atmosphere, as well as the hefty borrowing from some big SF names (bit of Alien, bit of Star Wars, and so on - it struck me as rather dopey). It still holds enough interest to be rental-worthy, but do so at your own risk. You may like the good aspects very much, or end up utterly hating it for it's pronounced flaws. The kernel of a strong and tragic story buried in there is worth digging out, if you can muster the effort.\n\n(also note that there have been tons of sequels, and Gall Force does impress when you step back and contemplate the big picture painted by all nine films together - individual installments often don't fare very well, however).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0158628/"
}