{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Darris Love",
            "url": "/name/nm0522307/"
        },
        {
            "@type": "Person",
            "name": "Darontay McClendon",
            "url": "/name/nm0565817/"
        },
        {
            "@type": "Person",
            "name": "Don Cambell",
            "url": "/name/nm0131318/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1107,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003941/"
        },
        {
            "@type": "Person",
            "name": "Steven Wolfson",
            "url": "/name/nm0938443/"
        },
        {
            "@type": "Person",
            "name": "Adam Ripp",
            "url": "/name/nm0728063/"
        }
    ],
    "datePublished": "2001-02-12",
    "description": "When a brutal carjacking yields a videocamera, a teenage boy decides to document his life and the lives of his fellow gangbangers.",
    "director": [
        {
            "@type": "Person",
            "name": "Adam Ripp",
            "url": "/name/nm0728063/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDQzYzdhNGMtMDA1ZS00YTc0LTkyMTktZjJkZDc5YTIxYjU2XkEyXkFqcGdeQXVyMDg1NzEwMg@@._V1_.jpg",
    "keywords": "boy,found footage",
    "name": "Gang Tapes",
    "original_info": {
        "id": "Gang Tapes_2001",
        "name": "Gang Tapes",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chrisparson82"
        },
        "dateCreated": "2001-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0276977/"
        },
        "name": "HOODFELLAS: The raw and uncompromising street film you've been waiting for...",
        "reviewBody": "When Gang Tapes reaches theaters in 2002, stuffy critics will undoubtedly describe it as: \"Blair Witch meets Boyz in the Hood.\" Of course, this description doesn't do justice to Gang Tapes. Directed by Adam Ripp (in his directorial debut), Gang Tapes is far more coherent and engrossing than the dreadful Blair Witch, and succeeds in making the once-potent Boyz in the Hood now look like an after-school special. Like Kids (1995), Gang Tapes pulls no punches. Murders, sodomy, beatings, and drive-by shootings are all shown on camera, albeit in a way which serves the story and is unsensationalistic. So, if Gang Tapes deserves a nickname at all, that name should be \"HOODFELLAS\". The story begins when a young teenager named Kris \"acquires\" a garden variety camcorder from John and Jane Q. Tourist. Armed with his newly liberated camera and tape, young Kris proceeds to document everything: the violent, humorous, tragic, joyous, and sexual moments of his world.\n\nWhile by no means a perfect film, Gang Tapes works well as a minimally plotted study of lost teenaged souls; it also feels like an informal rebirth of Italian neo-realist cinema. There are no \"name actors\" in the film. There is no hot young rapper, no comedian, and no heartthrob to look at. Instead, Gang Tapes offers a cast of mostly non-actors performing with gusto. If you're hoping Gang Tapes will \"let you off the hook\" with wall-to-wall, watered-down pop tunes, forget it. Gang Tapes' soundtrack is hardcore rap, which perfectly accentuates the equally rough-edged events. With a digital camera recording all of the goings-on, there are no Ophulsian tracking shots or lengthy Steadicam moves -- only a handheld look at the brutal concrete jungles of South Central Los Angeles. In Gang Tapes' world, all Hollywood presuppositions are thrown to the wind: even the nice guys get killed. Yet Gang Tapes is not just about brutality. Ripp and co-writer Steven Woolfson carefully examine their characters but don't waste time judging them. Instead, the script subtly addresses issues pertaining to media. For example, when Serial commits his first act of violence after being parolled, he immediately wants to see a replay of his handiwork. This moment is far more telling than all of the heavy-handed (and pedestrian) \"Fifteen Minutes\"(2001), which dealt more centrally with on-camera crimes. Kris's humorous \"test drive\" of the digital camera recalls the joy of David Holtzman's cinematic discovery in the sadly underrated \"David Holtzman's Diary\" (1968). Gang Tapes will undoubtedly incite controversy and divide audiences when it is released: Some will say it is sensationalistic, while others will applaud its raw cinematic power. But, ultimately, it offers first-rate performances, and an effective (if episodic) script. With his directorial debut, Adam Ripp succeeds in creating a sobering look at hell on Earth -- and the lives living in it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Lionsgate Home Entertainment",
        "duration": "PT40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi598278425",
        "name": "Gang Tapes",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmE5MzJmYmUtYjM0NS00ZWM2LWI0MzMtNDM2NmE0N2ZkOTBjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmE5MzJmYmUtYjM0NS00ZWM2LWI0MzMtNDM2NmE0N2ZkOTBjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:14:35Z",
        "url": "https://www.imdb.com/video/vi598278425/"
    },
    "url": "/title/tt0276977/"
}