{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jôji Nakata",
            "url": "/name/nm0620124/"
        },
        {
            "@type": "Person",
            "name": "Johnny Yong Bosch",
            "url": "/name/nm0097765/"
        },
        {
            "@type": "Person",
            "name": "Beau Billingslea",
            "url": "/name/nm0082507/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2593,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "alternateName": "Gankutsuou: The Count of Monte Cristo",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0107303/"
        }
    ],
    "datePublished": "2004-10-05",
    "description": "Trying to escape his uneventful life, Albert, the son of a renowned general from Paris, makes a journey with his friend Franz. During his travels, he meets an immensely wealthy nobleman named The Count of Monte Cristo. Living in l...",
    "genre": [
        "Animation",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTQ2YjRlMGMtMjY1Yy00ZTQ5LWEwZWYtZDA5NTE3NGQ2Mjk2XkEyXkFqcGdeQXVyMTI0MzA4NTgw._V1_.jpg",
    "keywords": "france,outer space,51st century,alternate reality,surrealism",
    "name": "Gankutsu-ô",
    "original_info": {
        "id": "Gankutsuou: The Count of Monte Cristo_2004",
        "name": "Gankutsuou: The Count of Monte Cristo",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ffxi-aion"
        },
        "dateCreated": "2008-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0437719/"
        },
        "name": "The Path to Despair",
        "reviewBody": "Plot: 9.7/10 -- Not having read the novel prior to starting this, I had no idea what to expect. I knew about certain vague details, such as a young man becoming fascinated with Monte Cristo, but that's all.\n\nThe setting was quite a shock, with the story taking place in the year 5053, where as the novel takes place during the 1800's. It was a further surprise to discover the story started on the moon. I do kinda wish the story had been told in the 1800's instead since very few details are given about the futuristic universe and the setting becomes more of a distraction than anything.\n\nIn a nutshell, Gankutsuou is a fairly simple revenge story that's executed extremely well. The Count is kind on the surface, yet you can tell there's a hatred inside him waiting to explode. He manipulates and kills as his plan to bring those who wronged him to despair is slowly revealed. There's a twist added to his character in the form of a sort of pact with the devil - He gained the power to get revenge by giving his soul and body in exchange, meaning he loses his humanity bit by bit while getting his revenge.\n\nIn order to add mystery to the Count's character, the story is not told from his perspective (unlike in the book). Instead, the story is told from the perspective of Albert, a young noble and son of a powerful general. This brings both bad and good points - The good being the added mystery and a different angle on the story, the bad being Albert having the IQ of a dog. I wanted to kill him when he failed to work out that it was in fact the Count pulling the strings behind the awful sequence of events unfolding around him for the 10th time.\n\nThe story was a wonderful ride. A timeless classic with artistic differences, it was executed excellently, at times perfectly. You do have to wait for the 'main event' before you discover just how amazingly well told the story is, the first half in particular being nearly all build up, but I still felt compelled to keep watching even without any major twists/events occurring.\n\nCharacters: 9.3 -- This is a tough one. I liked pretty much the entire cast...apart from the main character, Albert. Although I knew he had to be retarded for the sake of the plot, his stupidity and inability to see the obvious became very annoying. You'd think he'd be able to put 2 and 2 together when the Count just randomly kept appearing and the Count himself had told Albert that there were no coincidences! As I said, I liked the other characters. The Count is easily one of my favourite characters ever, Franz made up for Albert's lack of intelligence by being very bright, Eugene made Albert's character more interesting with their love for one another... Everyone else was great.\n\nArt: 9.7/10, Animation: 9.7/10 -- The first thing that hits you about Gankutsuou is the rather bizarre CG effect clothing and hair has. The effect is hard to put into words; it's as if the character is reflective. It certainly takes a few episodes to get used to it. If nothing else, you have to praise the studio behind Gankutsuou (Gonzo?) for the huge amount of effort they put in.\n\nThe second thing to hit you is the bright range of colours used. If, like me, you went into Gankutsuou expecting to see dark and dull colours you'd be completely wrong since it's anything but dull, vibrant being a much better description.\n\nGankutsuou also has a fair amount of CG outside of the clothing/hair effect, including some epic mecha fights. The CG stuff is stunning at times, almost jaw dropping for a TV series.\n\nOverall, Gankutsuou is a joy to watch...once you get used to it. Production values were clearly not low here.\n\nSound: 9.5/10 -- First of all, let me say that I didn't think very much of the OP or ED. The OP, while fitting, was so dull and slow I had to skip it after watching it once.\n\nThe soundtrack is very high quality, as you'd expect. There aren't too many tracks I'd listen to outside of the series (although there is one AMAZING track), but the music fitted the show like a glove and helped keep the story epic.\n\nI have to mention track 18, one of the best pieces of music I've ever listened to. It was almost orgasmic to listen to when it played during the best episode in the series (strangely enough, episode 18!!!), making it even more thrilling than it was already.\n\nTotal: 9.6/10 Having watched a fair amount of anime, I'm hard to please. Gankutsuou pleased me.\n\nI'm not sure if it's the best anime I've watched, but it certainly had the best episode of anime I've ever watched (episode 18 ), one of the best fights (episode 18 ), one of the best characters (the Count) and one of the best pieces of music (track 18 ). It's, quite simply, a stunning anime that EVERYONE should watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0437719/"
}