{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Zach Braff",
            "url": "/name/nm0103785/"
        },
        {
            "@type": "Person",
            "name": "Peter Sarsgaard",
            "url": "/name/nm0765597/"
        },
        {
            "@type": "Person",
            "name": "Natalie Portman",
            "url": "/name/nm0000204/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 219060,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0084122/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010434/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0118437/"
        },
        {
            "@type": "Person",
            "name": "Zach Braff",
            "url": "/name/nm0103785/"
        }
    ],
    "datePublished": "2004-08-20",
    "description": "A quietly troubled young man returns home for his mother's funeral after being estranged from his family for a decade.",
    "director": [
        {
            "@type": "Person",
            "name": "Zach Braff",
            "url": "/name/nm0103785/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjc5MDE0NjkxOF5BMl5BanBnXkFtZTcwNzA0NTkyMw@@._V1_.jpg",
    "keywords": "funeral,cat,home,actor,pills",
    "name": "Garden State",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rooprect"
        },
        "dateCreated": "2018-03-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0333766/"
        },
        "name": "\"True Stories from Suburbia\"",
        "reviewBody": "\"Garden State\" has a very specific brand of humor that not everyone is going to get immediately. But as writer/director/star Zach Braff says in the bonus interview, \"Is it funny? {Interviewer says yeah} Good. I never know if anyone else is going to find them funny. If nothing else, I'm making a movie that I'll enjoy.\"\n\nAnd that's why this movie works. In comedy, the worst thing you can do is try too hard to be funny. \"Garden State\" falls squarely in subtle, almost deadpan territory... meaning there aren't any big sight gags, slapstick or knockout punchlines. \n\nIn that respect I'd put it in the genre of \"movies like Bill Murray would act in\" except there's no Bill Murray. I'm referring to flicks like Coffee & Cigarettes, Rushmore, Royal Tenenbaums, Life Aquatic, which is essentially saying it's like a Wes Anderson film, or maybe Terry Zwigoff (Ghost World, Art School Confidential). There's a lot of visual storytelling, as in quirky symmetrical shots, stationary cameras on meticulously arranged sets, or a surreal vibe punctated by the camera slowly rising into the sky.\n\nThe story is something like famed French existentialist Albert Camus would write if he did comedy. A late-20s, emotionless, estranged son (Zach Braff) returns to his hometown to bury his mother. He seems devoid of all sentimentality as he wanders around meeting all sorts of crazy (and I mean crazy) characters from his past. Whether he's being nearly shot to death by an overenthusiastic cop, or molested by a hot blonde at a party, his range of emotion barely budges between bored and slightly perplexed. Then he meets his antithesis, a 20-something girl (Natalie Portman) whose range of emotion is somewhere between very amused and insanely happy.\n\nIt's the delightful contrast between these 2 characters, and their great on-screen chemistry, that turns an otherwise brooding sarcastic comedy into a really entertaining treat.\n\nAnother thing that really defines this film is the way every character, even the minor ones who only have 1 scene, are so bizarre and interesting that you feel like an entire movie spinoff could be made of each one. These characters include: 1) the grave digger who makes his real living by doing questionable things at the hardware store; 2) the grave digger's hot mom who is sleeping with her son's sworn enemy from high school; 3) the kid who got rich from inventing \"silent velcro\" and who now spends his time doing absolutely nothing; 4) the West African immigrant who is studying criminal justice and is obsessed with figuring out which dog is pissing on his phone; 5) the strange \"Guardian of the Abyss\" whom I won't spoil for you; and the list goes on.\n\nThe second half of the story focuses on a bizarre suburban quest the 3 main characters undertake, almost like in \"Stand by Me\" but with grownups and maybe a pornographic peepshow or two (btw the location of the climactic scene, \"Kiernan's Quarry\", is a real place--or at least it was until it got filled in & converted to condos a few years ago).\n\nBut as strange and nonsensical as it sounds, these are in fact \"true stories from suburbia\" as Zach Braff says. The entire film is a compilation of stories that happened to him and others in his small Jersey town growing up. \"Garden State\" has a magical way of bringing these seemingly random vignettes to our attention, making us understand the epic nature of obscurity.\n\nSo no, there may not be crazy car chases, bank heists or wacky jewel capers (...oh wait, actually there sorta is 1 wacky jewel caper), this film delivers a really entertaining ride from start to finish."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1873084697",
        "name": "Garden State",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjZjYjA3ZGMtNzcwMC00MDY3LWIyMWQtZTg4NGJlYTA3ZjcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjZjYjA3ZGMtNzcwMC00MDY3LWIyMWQtZTg4NGJlYTA3ZjcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:01:29Z",
        "url": "https://www.imdb.com/video/vi1873084697/"
    },
    "url": "/title/tt0333766/"
}