{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Lorenzo Music",
            "url": "/name/nm0615718/"
        },
        {
            "@type": "Person",
            "name": "Thom Huge",
            "url": "/name/nm0400335/"
        },
        {
            "@type": "Person",
            "name": "Gregg Berger",
            "url": "/name/nm0074185/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12232,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042369/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0173411/"
        },
        {
            "@type": "Person",
            "name": "Jim Davis",
            "url": "/name/nm0204825/"
        }
    ],
    "datePublished": "1988-09-17",
    "description": "Stories about Garfield the cat, Odie the dog, their owner Jon and the trouble they get into, and Orson the Pig and his adventures on a farm with fellow farm animals.",
    "genre": [
        "Animation",
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGQ0ZTc2ZjMtNjE2Mi00NjU3LTkyNDktNDA0NmUwODE1OTZmXkEyXkFqcGdeQXVyODk1MjAxNzQ@._V1_.jpg",
    "keywords": "garfield the cat character,1980s,1990s,male protagonist,slapstick comedy",
    "name": "Garfield and Friends",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Beta_Gallinger"
        },
        "dateCreated": "2009-11-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094469/"
        },
        "name": "Fun and laughter for all ages!",
        "reviewBody": "After the \"Garfield\" comic strip had been appearing in newspapers for ten years and several TV specials based on the strip had been made, Jim Davis' popular cartoon character finally got his own TV series, a Saturday morning cartoon. Unlike some of those cartoons, this one ran for many years. It was one of the shows I used to watch in my childhood, as I was a big Garfield fan at the time. Early in 2005, after I hadn't seen any episodes of the show for a long time and had since gone through adolescenthood, I purchased the Volume 2 DVD set, and really liked what I saw, making it clear that the show isn't strictly for kids. Since then, I've watched all the episodes on all five volumes of the DVD release, which hasn't changed my mind about the show.\n\nEach episode is divided into three different segments (other than the quickies). The first and third segments always feature Garfield, the lazy, overweight, bitter, sarcastic, cynical feline from the strip. He lives in a suburban house with his owner, a dimwitted, clumsy cartoonist who is terrible with women, and a good-natured but not so bright dog named Odie. Garfield loves to eat, sleep, give Jon and Odie a hard time, watch TV, attack the mailman, etc. He has annoyances in his life, such as Odie licking him, Nermal, a kitten who is generally adored by people and gets on Garfield's nerves during his unexpected visits, and Binky the Clown, a goofy clown who appears on TV. Although Garfield is happy with his lazy lifestyle and doesn't like to leave the house much, he often finds himself on adventures, and it's often up to him to solve problems.\n\nThe second full segment of each episode is based on Jim Davis' short-lived, lesser known comic strip, \"U.S. Acres\" (a.k.a. \"Orson's Farm\"). This cartoon involves a group of anthropomorphic animals living on a farm together. The leader is a pig named Orson, a bibliophile who can get carried away with his imagination, but can also do some good with it. Other characters include: Roy Rooster, an obnoxious rooster who loves to play tricks on the other animals; Wade Duck, a cowardly duck who is afraid of just about everything and often runs in terror; Bo Sheep, a surfer dude sheep; Lanolin Sheep, Bo's loud-mouthed sister who loves to disagree with him; Booker, an adventurous chick who likes to try and catch worms, but they always outsmart him; and Sheldon, Booker's brother, who is still in his egg shell, with only his feet sticking out so he can walk. The farm often gets intruders, most notably the Weasel, who tries to steal the chickens and eat them, and Mort, Gort, and Wart, Orson's mean brothers (all bigger than him), who like to come to the farm to try and steal the vegetable harvest! \n\nI don't recall seeing most of the episodes of this long-running show on TV during my childhood, but do remember some of the episodes I've recently revisited on DVD, and it seems they're mostly still entertaining. This includes the episode where Jon gets in trouble with the police for paying in cash instead of using a credit card, which I find funnier now than I used to! There are many episodes I didn't see as a kid which have cracked me up in recent years, with Garfield (often Jon and Odie as well) in some bizarre situations and meeting crazy characters, Jon pathetically trying to impress his date, among other things. Many fans clearly consider the \"U.S. Acres/Orson's Farm\" segments far inferior to the \"Garfield\" ones, but I disagree. I tend to find those very entertaining as well, with some of Orson's fantasies (sometimes a problem for the others on the farm), Roy's pranks, etc. My favourite character in these cartoons is the cowardly Wade Duck, who makes me laugh so hard, though the other characters can be really funny as well! \n\nSadly, Lorenzo Music, who gave Garfield his famous distinctive voice, passed away in 2001 from bone and lung cancer at age 64. Howard Morris, who provided the voice of Wade Duck (a voice which definitely fit the character), lived to be much older than Music, but died in 2005. I think this is a good time for me to say R.I.P. to both of them. Even though this show ended fifteen years ago, it's still memorable with a lot to like. Not all the episodes are that great (which is probably the case with any long-running show), and I don't find most of the things Garfield says at the end of the intro very funny, but overall, it's a great family cartoon show! It can obviously appeal to a lot of kids, and there are also things for adults to appreciate, including some clever satire that kids might not pick up. Forget the recent CGI Garfield, if you want good family entertainment for all ages, \"Garfield and Friends\" could be it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1386807577",
        "name": "Garfield and his Friends:Vol 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGMwOGIwZjUtOWQ1OS00YWRjLWJmZGMtN2Y1OWQ3ZDYwYTM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGMwOGIwZjUtOWQ1OS00YWRjLWJmZGMtN2Y1OWQ3ZDYwYTM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:14:44Z",
        "url": "https://www.imdb.com/video/vi1386807577/"
    },
    "url": "/title/tt0094469/"
}