{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ethan Hawke",
            "url": "/name/nm0000160/"
        },
        {
            "@type": "Person",
            "name": "Uma Thurman",
            "url": "/name/nm0000235/"
        },
        {
            "@type": "Person",
            "name": "Jude Law",
            "url": "/name/nm0000179/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 310138,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010434/"
        },
        {
            "@type": "Person",
            "name": "Andrew Niccol",
            "url": "/name/nm0629272/"
        }
    ],
    "datePublished": "1997-10-24",
    "description": "A genetically inferior man assumes the identity of a superior one in order to pursue his lifelong dream of space travel.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Niccol",
            "url": "/name/nm0629272/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODI3ZTc5NjktOGMyOC00NjYzLTgwZDYtYmQ4NDc1MmJjMjRlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "genetics,future,urine sample,paraplegic,blood",
    "name": "Gattaca",
    "original_info": {
        "id": "Gattaca_1997",
        "name": "Gattaca",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "yusufpiskin"
        },
        "dateCreated": "2020-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119177/"
        },
        "name": "Modern Classic",
        "reviewBody": "A bittersweet fairy tale that dwells on mankind's constant striving for perfection amidst the crushing cruelty of society's prejudices.\n\nGattaca is the perfect specimen. From it's dreamlike frames and sleek neo noir sci fi design combined with it's exquisitely moving score by Michael Laurence Nyman, this is one movie that I have fond memories of.\n\nThe main character Vincent deals with the most primal of fears. Being the unloved child. Being rejected by a lover for not up to thier standards. And being unable to achieve his own dreams due to factors outside his control.\n\nWhile we get the sense that this future dystopian world has not yet started hauling \"imperfect people\" into the gas chambers, you get the idea that it's only going to be a matter of time. Despite the anglo saxony 1950's American dream style decor of the future, you get the feeling that all this \"eugenics\" craze philosophy has left the world deeply lost and unhappy.\n\nIt feels lifeless, sterile and dead. It has lost something but doesn't know what \"it\" is. Even in a world of \"perfect people\" there are always going to be winners and losers and not everyone can be first place. It's impossible.\n\nThis point is perfectly illustrated in Jerome, a eugenics child who tried to commit suicide after winning silver. I'm in the belief that Jerome's story is not an isolated incident, especially in this world. Unable to meet the impossible standards set by the world, people are unable to love themselves or others due to thier lack of perfection. What you get is a world while though outwardly progressive is ultimately worthless. No ephemeral achievement can justify a world in which parents love one child over another due to their genetics, where two brothers must constantly struggle to assert thier worth, or a talented individual is left to live an aimless life because of some genetic flaw the world deemed irredeemable. It's insanity.\n\nThe ending definitely brought tears to my eyes. Many answers are left unanswered and the main cast will never see each other again but that only adds to the film's elegance.\n\nGattaca is one of the greatest films ever made because it is so raw and human. I know I can never shake away that feeling of awe I had while viewing for the first time. A deeply moving film that can never be made again.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A genetically inferior man assumes the identity of a superior one in order to pursue his lifelong dream of space travel.",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3769287961",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDA0N2E4MmMtY2YxOS00NTM5LWI4YTYtNWRmN2RjMDY5MzhlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDA0N2E4MmMtY2YxOS00NTM5LWI4YTYtNWRmN2RjMDY5MzhlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-10-24T19:45:31.482Z",
        "url": "https://www.imdb.com/video/vi3769287961/"
    },
    "url": "/title/tt0119177/"
}