{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tony Banks",
            "url": "/name/nm0052256/"
        },
        {
            "@type": "Person",
            "name": "Phil Collins",
            "url": "/name/nm0002015/"
        },
        {
            "@type": "Person",
            "name": "Mike Rutherford",
            "url": "/name/nm0751986/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 194,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080949/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011026/"
        }
    ],
    "datePublished": "1993-04-06",
    "description": "A concert that was filmed during the tour for Genesis' 1991 album \"We Can't Dance\".",
    "director": [
        {
            "@type": "Person",
            "name": "James Yukich",
            "url": "/name/nm0950819/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAxMTIwOTEwNV5BMl5BanBnXkFtZTcwMTA1NDMyMQ@@._V1_.jpg",
    "keywords": "concert film,live concert",
    "name": "Genesis: The Way We Walk - Live in Concert",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mikerlz"
        },
        "dateCreated": "2013-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0339058/"
        },
        "name": "Absolutely OUSTANDING concert footage!!",
        "reviewBody": "Overall, this is the best Genesis concert video available. Genesis has been my favorite band since I was a little kid back in the 1980's. Like a lot of people I liked their more popular tracks at the height of their fame, but it wasn't until I discovered their whole ridiculously awesome back catalog from the first years with Peter Gabriel fronting the band that I really understood what geniuses they were. The 80's material was mostly good stuff, but their earlier material from throughout the 70's just blew me away... and so began my life-long fandom.\n\nNot every song on this video is one of their best. Hold on my Heart? Ugh, kill me now. I still rate this video 10 stars. The flawless performances of the best tracks on it more than make up for it in spades. The highlight for me is the ~20 minute long \"Old Medley\". It's a nod to their long-time fans, combining some of their best songs from the 70's in one very well-done medley... and I think anybody in attendance at the show who wasn't familiar with the older work probably went out to buy the whole back catalog the very next day after hearing this, judging by the deafening applause.\n\nI know some of the other long-time fans consider this sacrilege, but I think many of Daryl Stuermer's takes on the guitar solos originally performed by Steve Hackett blew away what Steve did. Not every single one, but many. He ROCKS Firth of Fifth and The Musical Box like never before! Other highlights here are Driving the Last Spike, Domino, Jesus He Knows Me (CATCH DARYL'S SOLO IN THIS ONE!!), and Land of Confusion. This concert also features probably the greatest, most effective use of jumbotron screens and lighting that I've ever seen on any concert by any band.\n\nI think the older concert video from 1981, Three Sides Live, has a better setlist overall (In The Cage medley!!!!!) but this one is far more polished. The video and audio quality is also rather poor on Three Sides Live, but it's still another video that every Genesis fan needs to own.\n\nIf you love Genesis, you owe it to yourself to get The Way We Walk if you haven't already. If you are a casual fan, pick it up and you might find that you have been converted into a rabid Genesis maniac. Stop reading this. Go get it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0339058/"
}