{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Ken'yû Horiuchi",
            "url": "/name/nm0394723/"
        },
        {
            "@type": "Person",
            "name": "Nobuo Tobita",
            "url": "/name/nm0864980/"
        },
        {
            "@type": "Person",
            "name": "Naoki Tatsuta",
            "url": "/name/nm0851311/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 257,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "alternateName": "Genesis Climber Mospeada",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047735/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055529/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048904/"
        }
    ],
    "datePublished": "1983-01-02",
    "description": "A warrior named Stig Bernard and a bunch of other rebels and soldiers must fight a deadly alien race and track down their ruler.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYyMTYzNDgzNF5BMl5BanBnXkFtZTcwMDkwMzkyMQ@@._V1_.jpg",
    "keywords": "alien invasion sci fi,female rear nudity,female nudity,anime animation,alien",
    "name": "Kikô sôseiki Mospeada",
    "original_info": {
        "id": "Genesis Climber Mospeada_1984",
        "name": "Genesis Climber Mospeada",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Nic_hse"
        },
        "dateCreated": "2004-05-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0156215/"
        },
        "name": "Not as good as Robotech: The New Generation",
        "reviewBody": "I enjoyed watching the Mospeada series but it's shallow compared to it's Robotech counterpart (Robotech:The New Generation (TNG)). Robotech:TNG is a small part of much larger epic saga. Mospeada on the other hand doesn't have that depth or build up. The plot is very shallow by comparison. Aliens called the Inbit invade Earth and plan to make it their new home. It's a story that's been done to death. At least in Robotech:TNG the reasons and background story of the alien Invid are explained better. In fact the explanation of the Invid invasion is told in the second saga. Long before Robotech:TNG. That's where the Robotech saga shows it's depth over any of the original three Japanese series. There is so much more background story in Robotech. In Mospeada not much is explained about the home world of the invaders. Also the Japanese have a thing for goofy names. Man are their (Mospeada) names horrible! C'mon, Stig Bernard? What the hell kind of name is Stig? Mint Rubble? Houquet Emrose? Geez man. \n\nAlmost all of the Robotech names were big improvements over the originals. Let's compare some of them:\n\nStig (stick) Bernard (Mospeada) - Scott Bernard (Robotech)\n\nMint Rubble (Mospeada) - Annie (Robotech) ('Mint' was a nick name)\n\nYellow Belmont(Mospeada) - Lancer (Robotech)(Yellow Dancer was an alias)\n\nHouquet Emrose (Mospeada) - Rook Bartley (Robotech)\n\nRainy Boy (Mospeada)(Fruity name for a Killer) - Dusty Aires (Robotech)\n\nBatra (Mospeada) (Sounds too feminine for a male. Yep, it's a guy) - Corg (Robotech)\n\n I like the names Rey and Jim Austin from Mospeada. They are two of the few characters they managed to give decent names to. The creators must have been sober when thought these names up. Thank goodness. \n\nThe Robotech actors were great. Couldn't have been better. The Mospeada actors are just what you would expect from Japanese actors. A lot of over acting especially from the women. I'd take the Robotech cast any day over Mospeada's. To correct the previous reviewer: Robotech:TNG is not an 'Edit' of Mospeada. It's has a unique and more complex background story. Robotech:TNG is part of a much larger series and has more depth because of it.\n\nSeriously though it's good series but it doesn't beat the Robotech version in anyway. Mospeada did a horrid job on the names and several other things in the series. It didn't hamper my enjoyment of it because I was able to look past them. If you can't tolerate Japanese actors and the goofy names; check out Robotech instead. I think Robotech improved all of the three original series from which it was based. Especially the plot and characters. There is no contest for me. It's Robotech all the way. Mospeada today is almost forgotten while Robotech is making a come back. Not that Robotech was ever dead. The comics never stopped.\n\nWatch the 86 episodes of the Robotech series first and then hunt down the original 3 series. Beware though. After watching Robotech you may not want to bother to watch the original 3 Japanese series."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Genesis Climber Mospeada",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2364390681",
        "name": "Genesis Climber Mospeada",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjhlMzBhNGUtY2YyMy00Njc5LWEyYmUtZTkzZDUxYTBmMDgxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjhlMzBhNGUtY2YyMy00Njc5LWEyYmUtZTkzZDUxYTBmMDgxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-04T23:42:38.240Z",
        "url": "https://www.imdb.com/video/vi2364390681/"
    },
    "url": "/title/tt0156215/"
}