{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Evgeniy Leonov",
            "url": "/name/nm0503095/"
        },
        {
            "@type": "Person",
            "name": "Georgiy Vitsin",
            "url": "/name/nm0900120/"
        },
        {
            "@type": "Person",
            "name": "Saveliy Kramarov",
            "url": "/name/nm0469434/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12084,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "alternateName": "Gentlemen of Fortune",
    "contentRating": "TV-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0917448/"
        },
        {
            "@type": "Person",
            "name": "Georgiy Daneliya",
            "url": "/name/nm0199381/"
        },
        {
            "@type": "Person",
            "name": "Viktoriya Tokareva",
            "url": "/name/nm0865719/"
        }
    ],
    "datePublished": "1971-12-13",
    "description": "It so happens that peaceful kindergarten teacher is incredibly similar to the terrible villain who stole the helmet of Alexander the Great. And villain's accomplices are unexpectedly similar to children - they also need love and c...",
    "director": [
        {
            "@type": "Person",
            "name": "Aleksandr Seryy",
            "url": "/name/nm0785877/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTRhMGU2MWUtZmY0OS00ZDk2LWJjOGQtMWMxODBkMjU1ZTQxXkEyXkFqcGdeQXVyNjg3MTIwODI@._V1_.jpg",
    "keywords": "criminal,kindergarten,russia,plot,journey",
    "name": "Dzhentlmeny udachi",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "coolbd"
        },
        "dateCreated": "2017-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068519/"
        },
        "name": "Legacy of simple and kind people",
        "reviewBody": "Soldeirs of Fortune is often regarded as masterpiece of Soviet Filmmaking. However, most western viewers usually miss out on the main point that this movie tried to make. Soviet Union has big population of ex-prisoners who viewed themselves as heroes of societies of their time. During early years of Red revolution, people who were released from jails were one of the strongest segments of the \"iron fist\" that were essential to communism forces. The majority (that was target of communism ideology) were simple penniless people who were craving for chance to get a piece of socially acknowledged and legitimate (comparing to rich aristocratic lifestyle) equal way of life. Gentleman of Fortune presents a rich and historically important blend of mix of Soviet propaganda and effort of filmmakers to relate to prevailing audience. I was the among last generation that bears the values of shattered society. \n\nFilmmaking has made a colossal leap in recent couple of decades, from simple relation to the audience, to trackers of trends in popular culture and views. I truly believe that it is important that future film experts would be able to fully comprehend the essence of legacy that was left to us by older generations.\n\nMajority of western viewers will not be able to understand the humor and subtle context references that reflect nowadays dissolved soviet society. Soldiers of Fortune was primarily a comedy movie that was aimed to aggravate feelings of warmth and happiness in their customers. This movie tackles the problems of humanity and affection between individuals inside \"evil\" world of burglars and thieves. However, foreign viewers will be able to comprehend these references only of they have knowledge of culture and habits of filmmakers time. Therefore, as this particular movie is freely accessible in YouTube, I insist that if someone wants to fully interpret this movie, it is important to create special description of context in scenes. I would happily be able to provide these commentaries with possible collaboration of other soviet and post-soviet film experts to allow full experience to viewers of this masterpiece.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0068519/"
}