{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Clinton",
            "url": "/name/nm1093741/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 66,
        "ratingValue": 8.9,
        "worstRating": 1
    },
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU4ODk0NTg1Nl5BMl5BanBnXkFtZTcwMjQyNzYyMQ@@._V1_.jpg",
    "name": "George Clinton: The Mothership Connection",
    "original_info": {
        "id": "George Clinton: The Mothership Connection_1998",
        "name": "George Clinton: The Mothership Connection",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "geezer_ward"
        },
        "dateCreated": "2006-06-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0167955/"
        },
        "name": "Booty-Shaking and Mind-Quaking: HIGHLY RECOMMENDED",
        "reviewBody": "I almost gave this a nine rather than a ten is because the camera work is not the best I've ever seen (but it is FAR from the worst) and you only see the bass player and drummer in brief glimpses of the back of the stage, but this is just TOO AWESOME of a show not to get a ten. Make no mistake, this is P-FUNK. UNCUT FUNK. DA BOMB! If you jam hard enough, the Mothership just may land. If it does, ya better ride! I did. \n\nThis is a concert from Houston (1976). I believe it is \"The P-Funk Earth Tour\". It is apparently after the release of The Clones of Dr. Funkenstein because a number of the songs here are from that album. There are also a number of Funkadelic tunes here. They move back and forth between Parliament and Funkadelic material seamlessly. This show is them right in the midst of a peak period of creativity and tight chops. I have been mesmerized by it since I bought it. I literally can't quit funkin' out to it!\n\nGeorge appears as Lollipop Man, StarChild, The UnDisco Kid, and Dr. Funkenstein. The three guitar players are Michael Hampton, Glenn Goins (who sings his booty off) and the iconic Gary Shider (who also does some NASTY singing). Bernie Worrell is absolutely there, funkin' out. The old Parliaments are there sangin like only they can (Sheik Grady Thomas, Stingray Davis - doin those BAD bass parts - Calvin Simon and Fuzzy Haskins, who goes off during \"Standing on the Verge of Getting it on). Debbie Wright and Jeanette Washington are the female singers and they are incredible, both singing and slinking around the stage. Maceo, Fred, and the horny horns are as horny as ever. I have read that Bigfoot Bailey and Boogie Mosson are on Drums and Bass respectively, but you don't see them. You hear them plenty though. Bootsy is NOT playing with Parliament-Funkadelic on this. He played earlier in the show (not on the DVD) with the Rubber Band and he comes on stage (with about thirty other people) during \"Tear the roof off the sucka\" and he is not playing bass. He is singing and dancing and hitting a cowbell.\n\nSo, in summary, if you are a real fan of anything P-Funk, you MUST get this. If you are interested in seventies funk, you MUST get this. If you want to see a SUPA BAD band putting on a mindblowing show, you should get this. If you like live music, performance art, or just seein a bunch of brothas ridin space ships and wearing outlandish outfits, this is HIGHLY RECOMMENDED.\n\nMake yours the P-Funk, if you want to get funked up!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0167955/"
}