{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Carlin",
            "url": "/name/nm0137506/"
        },
        {
            "@type": "Person",
            "name": "Rocco Urbisci",
            "url": "/name/nm0881759/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2447,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Person",
            "name": "George Carlin",
            "url": "/name/nm0137506/"
        }
    ],
    "datePublished": "1990-06-02",
    "description": "George Carlin brings his comedy back to New Jersey and this time talks about Offensive Language, Euphemisms, They're Only Words, Dogs, Things you never hear, see or wanna hear, Some people are stupid, Cancer, Feminists, Good Ideas...",
    "director": [
        {
            "@type": "Person",
            "name": "Rocco Urbisci",
            "url": "/name/nm0881759/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjFmYmRmNDktNDA1NC00ZDVhLTg1OTEtZmZiMDhhYjA1NDlhXkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "satire comedy,stand up special,tv special,social commentary,comic",
    "name": "George Carlin: Doin' It Again",
    "original_info": {
        "id": "George Carlin: Doin' It Again_1992",
        "name": "George Carlin: Doin' It Again",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nycritic"
        },
        "dateCreated": "2005-11-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0246642/"
        },
        "name": "Comic Genius.",
        "reviewBody": "Only George Carlin could create entire dissertations based on completely surreal situations concocted in his (self-proclaimed) sick mind. Only George Carlin could get away with talking about the issues he tackles and addressing the fact that we the listener, the audience, get offended much too easily -- that we're offense prone.\n\nCarlin talks about the Words that Speak the Truth. Language is big with Carlin and he uses it like swords to attack his audience to not only extract the laughs but to shoot them with what's real and what's not; what we mean to say when we say what we mean. Addressing the uses of \"words you can't call people\" he expertly spews forth a barrage of epithets, which only make us more aware that we may be a little more racist than we would like to think ourselves as. The same time he talks about how our own language has evolved over the years: what once we called trailer homes, now we call mobile homes, partly-cloudy has become partly-sunny, cripples become physically challenged.\n\nIt's sometimes hard to laugh at Carlin. There are moments when instead of laughing, you stop and think: because he's saying the truth, and the truth \"ain't pretty\". The uncomfortable situations we find ourselves in, the ease in which one can offend feminists, the hilarity of rape (and the possibility that one day, instead of being called \"rape victims\" they will be names \"involuntary sperm recipient\" makes our use of political correctness questionable. Carlin has no limits and knows it. And boy, is it an event to watch him regurgitate his furious observations. You gotta love someone this crotchety who sees things in a particular way and who dares to \"go there\" where most comedians, even the hardcore ones, would not.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0246642/"
}