{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Aikman",
            "url": "/name/nm3668983/"
        },
        {
            "@type": "Person",
            "name": "George W. Bush",
            "url": "/name/nm0124133/"
        },
        {
            "@type": "Person",
            "name": "Laura Bush",
            "url": "/name/nm1197615/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 87,
        "ratingValue": 3.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076591/"
        },
        {
            "@type": "Person",
            "name": "Sharon Dymmel",
            "url": "/name/nm1713413/"
        },
        {
            "@type": "Person",
            "name": "Joseph Meier",
            "url": "/name/nm1904365/"
        }
    ],
    "description": "This documentary examines how faith and prayer-based initiatives play into the presidency of George W. Bush.",
    "director": [
        {
            "@type": "Person",
            "name": "David W. Balsiger",
            "url": "/name/nm0051142/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkzNDg4NzkzMl5BMl5BanBnXkFtZTcwMTk0MDcyMQ@@._V1_.jpg",
    "keywords": "the white house washington d.c.,faith,2000s,september 11 2001,united states of america",
    "name": "George W. Bush: Faith in the White House",
    "original_info": {
        "id": "George W. Bushisms_2004",
        "name": "George W. Bushisms",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "M0KUJIN"
        },
        "dateCreated": "2005-10-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0464806/"
        },
        "name": "Delusions of Omnipotence.",
        "reviewBody": "What is this documentary? This is a film that attempts to show that George W. Bush is a man of faith (not a tool of the Christian Coalition) and that his faith in Jesus Christ makes him a strong man and the only right leader in these tumultuous times.\n\nAnd that's it. Without going into my feelings about \"Fahrenheit 9/11\" ,there are two hugely important differences between \"George W. Bush Faith In The White House\" and \"Fahrenheit 9/11.\" In \"Fahrenheit 9/11,\" Michael Moore has incredible impact because HE does not make allegations, he simply replays what Bush and his top aides said and puts forth the evidence we now have to disprove their misstatements and outright lies. That is to say, Moore doesn't damn the Bush Administration; he lets the Bush Administration damn themselves. By contrast, \"George W. Bush: Faith In The White House\" is a group of people (many of them the most reactionary evangelical Christian leaders today) spouting how great and genuine George W. Bush is.\n\nIn short, this documentary is garbage.\n\nI make that statement without any political bias and here's why: this movie is a bunch of crap. First of all, the opposition (those who disagree that George W. Bush is either a man of faith or more than just a tool pushing the agenda of the Christian Coalition) has no say in this movie. Not a single one of the people who have publicly opposed Bush and his faith-based agendas agreed to appear in the movie. Yet, quotes from Al Franken and Richard Gere are used in the movie as the voice of the opposition. The problem is how they are presented. Not a single opposition voice over is done without sounding sniveling or sarcastic. The film immediately illustrates its bias by insulting the opposition in the way it presents their material.\n\nMoreover, this is a factually problematic movie that is only supportable by those who agree with the Bush-style politics. Bush rules using innuendo and threat without having a firm grasp on facts or reality. Similarly, \"George W. Bush: Faith In The White House\" mentions incidents that are bizarre and random without ever being specific enough to be truly credible. For example, the film cites an incident (which I had never heard about) where George W. Bush was approached by a campaign worker while working on his father's presidential campaign. The movie applauds Bush for resisting the temptations of the advance and credits his character and religion (an obvious attempt to contrast with Clinton). The problem is the incident comes across as entirely without credibility as it involves no names, times or other specifics. Instead, it seems like a made up incident used to prove a point. Similarly, the movie shows an incident where a senator solicited Bush for a program and Bush rejected him the moment that the senator tried to show how it would benefit Bush personally. Again, the incident was left too vague to seem real or credible.\n\nMoreover, the Bush administration has done everything possible to disprove the credibility of such an incident. Could any informed viewer truly believe that Bush would reject a proposal because it benefited him when his administration has made so many closed door deals with companies that directly benefit George W. Bush and Dick Cheney? But the thrust of the movie is that George W. Bush is a man of faith and that faith has made him strong. The producers of the film are also hoping it has made the viewer pliable and stupid. Why do I say that? The producers are very careful to arrange incidents out of order so as to make George W. Bush appear as good as possible. For example, they cleverly gloss over his drinking until the age of 40 (completely neglecting his use of CRACK COCAINE in the 1970s!) and then tell how he found faith. The problem is, anyone taking notes will instantly find the hypocrisy of their argument. Why? The movie is honest about dates and it says that George W. Bush quit drinking on his 40th birthday, in July 1986. However, George W. Bush met with Billy Graham and became a man of strong Christian faith in 1985.\n\nSee the problem? This film wants us desperately to believe that George W. Bush's evangelical Christianity saved him from a life of debauchery and drinking and made him into a strong, steadfast, righteous leader, but instead, it shows the opposite. Even Bush's suddenly strong Christian faith could not stop him from drinking. He kept drinking for at least a year after he found God again! And that, then, begs the question: what's to stop Bush from relapsing? If God wasn't enough to make Bush stop abusing alcohol, what's to keep Bush from starting up drinking again when the job gets tough? Moreover, \"George W. Bush Faith In The White House\" is filled with a lot of other very problematic logical fallacies. For example, the movie insists that because George W. Bush is a man of faith, he is trustworthy. One need not go back so far to the Inquisition, but rather to the recent scandals in the Catholic Church to be able to render that argument invalid. The truth is, faith does not equal trustworthiness. Religious leaders and congregates can be exceptionally corrupt, especially in Christianity where God offers absolution and forgiveness. Pardon the possibility of sounding jaded, but when a faith offers the opportunity to clean your moral slate on a weekly basis, it lowers the chance of moral accountability.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0464806/"
}