{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Candace Evanofski",
            "url": "/name/nm0262506/"
        },
        {
            "@type": "Person",
            "name": "Donald Holden",
            "url": "/name/nm0390184/"
        },
        {
            "@type": "Person",
            "name": "Damian Jewan Lee",
            "url": "/name/nm0497081/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8474,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0183097/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060583/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024723/"
        },
        {
            "@type": "Person",
            "name": "David Gordon Green",
            "url": "/name/nm0337773/"
        }
    ],
    "datePublished": "2001-09-28",
    "description": "A group of children, in a depressed small town, band together to cover up a tragic mistake one summer.",
    "director": [
        {
            "@type": "Person",
            "name": "David Gordon Green",
            "url": "/name/nm0337773/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWI1MTU3OWEtYmM3ZS00YmJhLTgxNDgtZWVkNGE3ZjQxMjk1XkEyXkFqcGdeQXVyNjczMzgwMDg@._V1_.jpg",
    "keywords": "superhero,sex scene,teen smoking,president,cigarette",
    "name": "George Washington",
    "original_info": {
        "id": "George Washington_2000",
        "name": "George Washington",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bacchae"
        },
        "dateCreated": "2002-09-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0262432/"
        },
        "name": "immensely subtle, brilliantly realized",
        "reviewBody": "When I first saw \"George Washington\" at the L.A. Independent Film Festival, I remarked to a colleague that I wasn't sure if the film was \"brilliant,\" or if it was \"a student film.\" He remarked, in kind, that \"it was a brilliant student film.\" At the time, I agreed. But after repeated viewings of \"George Washington,\" I think I am starting to encounter its sheer sublime brilliance... and in retrospect, it is one of the most beautifully realized films I've ever seen. As a Southerner, I can't recall a film that has better captured the mood of the rural South. The film's languid pacing--set amidst its plush backdrop of swimming pools, the rusted steel of dilapidated factories, children playing in the sun, immense greenery, and diverse ethnic culture--continually transports me back to the South that I experienced growing up. Its operatic photography mixes a complex cinematic chemistry that, for me, feels more and more like a documentary in tone the more I watch it. Yet for all the film's structural \"looseness,\" there is that one story strand that seems to always hit from an unforeseen angle, which softly jerks you back to the story just as you start to think the film is losing focus. The film's pace seems centered on this hypnotic lulling style: the narrative rope slackens almost to the point of no return, until all of a sudden that rope is pulled taut by its sheer weight. Other reviews here accurately describe what \"George Washington\" is about, so I will defer to them for story description. Unfortunately, in many descriptions here, people (mistakenly) see \"randomness\" in the film's structure. But the story's elements are just so beautifully and intricately weaved that one can actually leave the film truly wondering if there was any structure to it at all. This is absolutely not a \"by chance\" occurance. It is the mystifying brilliance of this classical tale: the languid pacing almost fosters Southern-style \"forgetfulness\" to the point that the story seems to forget about itself and fold inward. All the stories fall into each other so smoothly that it's easy to forget and begin wondering \"what happened?\" But this style is in fact the film's structure, and is absolutely the intended hypnotic effect, which is so reflective of the mood of Southern culture (if I am allowed to state this so broadly). I've now seen the film about ten times, and I can confidently state that \"George Washington\"'s immense subtlety in this regard should not be overlooked. There are many examples of backstory that David Gordon-Green (the writer/director) leaves just underneath the surface, waiting to be found. For example, in the relatively minor scene where George visits his imprisoned father, it's amazing to consider just how much that simple scene reveals of George's strange circumstances. Without being obvious and saying directly to the viewer \"x happened, now y occurs,\" we are all of a sudden introduced to George's complex emotional world. We are given an image (but not an explanation) as to why he now lives with Damascus. What's the backstory here? Did George's father murder his mother? We are told nothing directly. But after the incident with Buddy, George is able to come to some sort of terms with his father--who remains silent, smoking a cigarette behind bars. George tells his father that he once didn't believe him, but now believes him... and loves him. The film's central theme--that of George becoming a hero--is most exemplified in this moment... and is in my estimation the biggest character building moment of the film. In a quick two minute scene (which, action-wise, is relatively forgettable), we all of a sudden encounter George as a growing adolescent in a very complex adult world: as guilty, as scared, as proud, as strong, as knowing, as forgiving. It's as though his conscience were born in that moment of inner conflict, and provides the measure for his becoming a hero later in the film. (As a wise man once told me, one can only become a hero by being, at some point, the opposite of a hero.) I think the typical response that George's heroism is ironic in the film should be discredited by the depth of his character. Far from ironic, he is simply a hero who begins to grasp the price of heroism. \"George Washington\" is rife with little gems like this. So many subtleties abound here, like Nasia's fascinating narration told from the future perfect tense (revealed only once in a phrase halfway through the film)--told as though the story were some sort of Southern archetypal memory. Or Damascus' pre-text for quitting his job, so subtley inserted in the beginning that you forget about it by the time you realize what his phobias are. Or even George's breathtaking \"admission,\" as indicated in the interrogation office through a jerk-reaction sniff that seems to come two paces too late. How much is revealed in that small action! \"George Washington\" is one of the most artful and intricately directed films I've ever seen. It is the kind of film that, like its story, will never crack the (canonical) surface because of its deep subtleties... but which, because of that, is what will always make it shine."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A group of children, in a depressed small town, band together to cover up a tragic mistake one summer.",
        "duration": "PT1M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1369096985",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjQyMWFhNGMtNjU0OS00YTc3LWE1Y2YtNGIzODA3OWZjOTI1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjQyMWFhNGMtNjU0OS00YTc3LWE1Y2YtNGIzODA3OWZjOTI1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-10T23:09:28.782Z",
        "url": "https://www.imdb.com/video/vi1369096985/"
    },
    "url": "/title/tt0262432/"
}