{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        },
        {
            "@type": "Person",
            "name": "Rachael Leigh Cook",
            "url": "/name/nm0000337/"
        },
        {
            "@type": "Person",
            "name": "Miranda Richardson",
            "url": "/name/nm0001669/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35377,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0033472/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043393/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052111/"
        },
        {
            "@type": "Person",
            "name": "Ted Lewis",
            "url": "/name/nm0507794/"
        },
        {
            "@type": "Person",
            "name": "David McKenna",
            "url": "/name/nm0571346/"
        }
    ],
    "datePublished": "2000-10-06",
    "description": "A Las Vegas mob enforcer travels back to his hometown to investigate his brother's mysterious death.",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Kay",
            "url": "/name/nm0443181/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkzMDk3Njg3NF5BMl5BanBnXkFtZTYwNTIzMzU3._V1_.jpg",
    "keywords": "cigarette,body lands on a car,character repeats someone else's dialogue,enforcer,murder",
    "name": "Get Carter",
    "original_info": {
        "id": "Get Carter_2000",
        "name": "Get Carter",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "johnnyboyz"
        },
        "dateCreated": "2010-01-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0208988/"
        },
        "name": "Trite, overplayed, lecturing nonsense which functions only as a guilty, mindless revenge picture.",
        "reviewBody": "Stallone and director Stephen T. Kay's re-imaging of the stunning, 1971 British gangster film Get Carter is a monumental mess on mostly all levels; a wavering, distorted and frankly quite annoying piece that renders what was once scuzzy pulp into polished actioner and slow burning film-noir into loud, messy, flashy nonsense. Some will claim it is Kay implementing his own style onto a set text, but in this case it is a set text that did not need re-imagining combined with a style we don't want to see, while the original did not need an update and certainly doesn't need to be fiddled with in order to act as a directorial calling card for someone who would later go onto have a career in making television shows.\n\nThe 2000 remake of Get Carter begins in its immediacy of establishing some sort of passing of the guard; this by way of briefly playing the old theme tune from the original film over the images before a newer, more contemporary beat kicks in continuing the same basic tone; in a sort of style that sounds like it was spat out of a rave club and landed smack bang on the soundtrack. It's a telling moment; a moment in which the recognition of the old was there, and that this newer version of both the music and film brings everything up to speed for the sake of it. Sylvester Stallone is Jack Carter this time around, a heavy working in Las Vegas more-so London who boards a train in order to travel to Seattle more-so Newcastle in order to attend his brother's funeral. One would hope the distorted, fragmented manner in which Jack's train journey is put across by way of the angles and editing is representative of the character's distorted and wavering emotions as he gradually gets closer to home with the realisation of a sibling's death gradually kicking in, rather than be included for the fact it might, in the maker's eye, 'look cool'.\n\nCarter finds an unnatural manner in being able to waltz around kicking guys' heads in; bullying his way into confrontations with people and evading injury during car chases with more sombre, more down to Earth scenes with Doreen (Leigh Cook), his niece and his brother's daughter. The scenes with Doreen enable Carter to act as some sort of would-be fatherly figure as he attempts to take her under his wing; delivering advice as if it were his brother's own, about life and what to do with it and how keeping on the straight and narrow is important – it's a life lecture from an action lead who, on other occasions when speaking to other characters, tells them: \"Sure it does\" when told that revenge doesn't work and it's implied that it ought to be something to be chased down.\n\nThe film sees Carter visit a whole bunch of misfits, from Alan Cumming's techno-boffin Jeremy Kinnear to Mickey Rourke's porn king-come-businessman Cyrus Paice, an individual who distributes a lot of pornography akin to Caine's version, only because it's now 2000 and it's the 21st Century we've moved into here, everything is done by way of computers and disk drives instead of 8mm film stock. I say the 1971 film was \"Caine's version\", but Michael Caine does actually have a role here, that of Cliff Brumby who you'll remember was tossed over the side of a multi storey car park in the old one by Caine himself. The joke around about the time of the release of this, I'm sure, must've been that Caine is playing the character he tossed away over the side in the original; while in playing a part in the ill-advised remake of Get Carter, thus has now tossed his own career over the side. Fortunatley, this didn't have the ill guided effect on his career it might've done.\n\nSnide jokes aside, the problem that the remake of Get Carter is a dunderheaded, bits and pieces revenge action thriller starring someone whom seems to gradually get less and less interested as the film progresses is just half the issue. It's additionally just too all over the place to get involved in and too wavy in whether it wants to pay a lot of attention the the '71 version or not. Whilst the film attempts to get some sort of dramatic flow to proceedings going, there'll be a scene straight out of the original that'll disrupt its course and make you go to yourself: \"Oh yeah, it's that part.\" or \"Oh look, this is how they're re-imagining this bit.\" which is so distracting and so annoying, completely destroying any sort of dramatic weight the film might have been carrying up to the respective point.\n\nRunning on colourful visuals and really lacking that distinct aura of menace the original certainly carried, 2000's Get Carter is rather a gross misfire. Its want to balance a morality tale with wanting to be faithful and unfaithful in equal measure to the original doesn't sit, while the meek level of substance by way of Stallone life-lectures twinned with the fact what it is that he does is on display just comes across as sanctimonious and stupid – if there was ever a point in which this remake really needed to borrow from the '71 version, then it was with the ending and Carter's overall fate. If director Kay has translated anything, it's that he's translated a once unhinged, crime fuelled revenge tale into an unengaging and soppy series of grumbles, gunshots and girls that does absolutely nothing for its audience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT2M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi550306585",
        "name": "Get Carter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGFlZGQ2MTQtNDMwMS00YjFiLTk3OWItZWI1YzBhZjRmMzk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGFlZGQ2MTQtNDMwMS00YjFiLTk3OWItZWI1YzBhZjRmMzk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-01-23T06:38:26Z",
        "url": "https://www.imdb.com/video/vi550306585/"
    },
    "url": "/title/tt0208988/"
}