{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cameron Watson",
            "url": "/name/nm0914534/"
        },
        {
            "@type": "Person",
            "name": "Anthony Meindl",
            "url": "/name/nm0576879/"
        },
        {
            "@type": "Person",
            "name": "Elaine Hendrix",
            "url": "/name/nm0005006/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 613,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0222357/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034061/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045781/"
        },
        {
            "@type": "Person",
            "name": "Max Mitchell",
            "url": "/name/nm0593592/"
        }
    ],
    "datePublished": "2000-06-17",
    "description": "A wealthy professional gay couple, who wish to adopt children, see their lives turned topsy turvy when they take in two misbehaving brothers, supposedly just for one night.",
    "director": [
        {
            "@type": "Person",
            "name": "Max Mitchell",
            "url": "/name/nm0593592/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE2MTQwNDc5OV5BMl5BanBnXkFtZTcwOTgyNDQyMQ@@._V1_.jpg",
    "keywords": "gay protagonist,male protagonist,male nudity,gay,gay couple",
    "name": "Get Your Stuff",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "soanim8ed"
        },
        "dateCreated": "2003-06-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0218298/"
        },
        "name": "Mix And Match",
        "reviewBody": "What do you get when you mix a successful gay couple with two foster kids from the streets? Well, you could get Get Your Stuff, a cute film about the good times and bad times that might happen if you mix the two mismatched ingredients above. Farce? No, it never reaches that state, but it is frequently funny.\n\nThe story is about Phil (Cameron Watson), a couples counselor and Eric (Anthony Meindl), a lawyer. The two want to adopt a baby (mostly it seems from the prodding of Eric's mom), and are just approved to be foster parents in the meantime. Through some coaxing and borderline blackmailing, they agree to take in T.J. and Brian for one night. That becomes one more night and one more and, well, you get the picture.\n\nThe kids are actually decent actors and, at times, out-act the adults. T.J. (Grady Hutt) is the optimistic one and tries to get his brother to straighten up so they can have a home. Brian (Blayn Barbosa), on the other hand, is not as accepting and wants nothing to do with Phil and Eric until their case worker, Gloria, talks them into working the couple to make themselves more appealing. \n\nThe film deals with all these problems with a light touch -- never wanting to truly offend anyone. So they are played up for laughs; however, the message still gets through. In fact, it takes its toll on Eric who wanted nothing more than a baby and not an entire family of problems and promptly leaves in the film's worst scene that includes Phil screaming and pulling a gun out on his clients and doing the same to Eric as he drives off.\n\nBut that type of scene is, thankfully, not the norm. Most of the picture is feel-good and enjoyable. More so when Kimberly Scott is on the screen. She plays Gloria with sass, determination and heart. The movie is made better by her tough love portrayal -- especially the scenes with the kids. There is one at the beginning of the film where the kids arrive at the house while Phil and Eric are having an anniversary party. Brian goes for the wine and argues that kids in Europe drink it. Gloria responds with, \"They can also speak three languages. When you can speak three languages, then we can talk.\"\n\nGet Your Stuff doesn't set the film world on fire, but it is a fun jaunt. It's something to pass the time in world that touches on reality, but doesn't actually ground itself there.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0218298/"
}