{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vincent Gallo",
            "url": "/name/nm0001252/"
        },
        {
            "@type": "Person",
            "name": "Courteney Cox",
            "url": "/name/nm0001073/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Tambor",
            "url": "/name/nm0001787/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1219,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003942/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Person",
            "name": "Justin McCarthy",
            "url": "/name/nm0565198/"
        }
    ],
    "datePublished": "2002-04-02",
    "description": "He left her for fame.. but wants her back. She still loves him.. but isn't sure she can trust him. Now they both have to face the truth.",
    "director": [
        {
            "@type": "Person",
            "name": "Justin McCarthy",
            "url": "/name/nm0565198/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTllODI5NjAtZjRmMi00MTVjLWEwOGItMmZkMmQzNTE3MDdjXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "nervous breakdown,ex boyfriend ex girlfriend relationship,interview,scandal,talk show host",
    "name": "Get Well Soon",
    "original_info": {
        "id": "Get Well Soon_2001",
        "name": "Get Well Soon",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "eddiez61"
        },
        "dateCreated": "2011-08-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0293176/"
        },
        "name": "A Talk Show Film That Says The Wrong Things.",
        "reviewBody": "I was going to criticize the movie for expecting me to believe that the nasal, twangy Vincent Gallo could ever be a real world talk show star, but then I remembered Conan O'Brien. So I'll criticize this movie for all of it's other unfortunate glaring shortcomings. Firstly, it's way too in love with itself, constantly pausing for us to admire it's daring brilliance and hip, snarky outrageousness. Some people might find it edgy but it's actually a rather staid, unremarkable, conventional study of celebrity life and all the attendant madness. It's more than common knowledge that many, if not most, talented performers are also afflicted with various forms of mental illness. Depression, bi-polar disorder,and even schizophrenia are frequently driving creative stars to exceptional extremes. So this analysis of the successful talk show host Bobby Bishop is redundant. Just witnessing a talk show star's actual performance is in fact a clinical analysis of their pathology. Dave Letterman, for instance, nightly exposes his damaged, twisted psyche to the nation. We are entertained by his otherwise socially aberrant behavior. If, however, we daily had to encounter such a bitter, cantankerous conflicted personality we would most likely move to another state. There's so many stories, many told by Dave himself, of just how antisocial he actually is. But he's managed to direct his neurosis into an entertaining and lucrative direction. And what about Johnny Carson or Jack Parr who we now know were sufferers of bouts of extreme depression? And Regis Philbin? He has admitted the same.\n\nSo exposing mental illness in the entertainment industry is old news, no longer a headline. Nor was it in 2001 when this film was released, but we're expected to be shocked and confused and fascinated by our hero's condition. It's a mildly interesting personal fact, nothing more, if you're judging by society's enthusiastic consumption of the latest varieties of mood elevating medications; we ARE the Prozac nation.\n\nAnyway, Gallo has been in a few very interesting, off beat, challenging, controversial films, normally portraying quirky, troubled somewhat threatening but charismatic types. He's trying it again here, but that personality profile just doesn't work for this role. He comes off so self conscious and distracted that it's impossible to believe he was ever anything but repulsively narcissistic. A true talk show star is able to at least present a credible appearance of interest for others. Even the preposterous Larry King had an uncanny ability to stare his guests straight in the eye while his mind drifted to thoughts of what he'll order at Katz's deli later that evening. Actually, later that afternoon, you know, while they're still offering the early bird special.\n\nSo the love story is interesting, many of the conversations are entertainingly witty and clever, and a few of the situations are comical and original. But the timing is too often way off - stilted, rushed, erratic or rambling - probably because much of it seems improvised. And badly edited. Or rather, overly obviously edited, calling attention to its precious, wacky insouciance. I have never before used that word, insouciance, in writing, but this film demanded it of me. That should tell you just how frustrated I am with this well intentioned, but ultimately fatally flawed bit of stylized indulgence.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0293176/"
}