{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Berenger",
            "url": "/name/nm0000297/"
        },
        {
            "@type": "Person",
            "name": "Martin Sheen",
            "url": "/name/nm0000640/"
        },
        {
            "@type": "Person",
            "name": "Stephen Lang",
            "url": "/name/nm0002332/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29942,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051191/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061612/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Person",
            "name": "Michael Shaara",
            "url": "/name/nm0787033/"
        },
        {
            "@type": "Person",
            "name": "Ron Maxwell",
            "url": "/name/nm0561813/"
        }
    ],
    "datePublished": "1993-10-08",
    "description": "In 1863, the Northern and Southern forces fight at Gettysburg in the decisive battle of the American Civil War.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Maxwell",
            "url": "/name/nm0561813/"
        }
    ],
    "duration": "PT4H31M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjgzNzhlYzEtMzYxYS00MTJkLWIzODUtZGQ3MmFiZDdkMTZiXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "civil war,shot to death,army uniform,man shot to death,dying young",
    "name": "Gettysburg",
    "original_info": {
        "id": "Gettysburg_1993",
        "name": "Gettysburg",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cariart"
        },
        "dateCreated": "2004-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107007/"
        },
        "name": "Long, but Powerful Epic, Filmed on Location...",
        "reviewBody": "GETTYSBURG, based on Michael Shaara's bestseller, \"The Killer Angels\", is a truly remarkable film, in it's clear, if long, presentation of the Civil War's bloodiest, best-known, yet least understood battle, in it's 'humanizing' of the almost legendary characters of the period, and, most amazingly, for being filmed at the actual locations where the actions took place, in Gettysburg, itself. From Little Round Top to Seminary Ridge, you see the events where they actually occurred, 140 years ago. It is a singular achievement, and Ted Turner deserves credit for making it happen.\n\nTwo characters dominate the film; Jeff Daniels, in one of his finest performances, is a likable, totally believable Col. Joshua Lawrence Chamberlain, the Maine ex-schoolteacher who would win the Congressional Medal of Honor; and Tom Berenger, sporting a huge, bushy beard, is a sympathetic 'voice of reason' as Confederate Lt. Gen. James Longstreet, successor to \"Stonewall\" Jackson as Robert E. Lee's field commander. Chamberlain and Longstreet provide the film it's focus, as honorable men attempting to fulfill their duty, while the carnage builds around each of them. \n\nOther memorable performances include Sam Elliott, in a brief but memorable cameo as Brig. Gen. John Buford, the battle-hardened cavalry commander who initiates the battle after guessing the Confederates' objectives at Gettysburg; Richard Jordan, in one of his last appearances before his untimely death, as Brig. Gen. Lewis A. Armistead, facing his best friend in battle; Kevin Conway, as Chamberlain's gruff but likable Irish First Sergeant, Sgt. 'Buster' Kilrain; C. Thomas Howell as Lt. Thomas D. Chamberlain, Joshua's brother, who creates a sense of familial concern for Daniels; and Stephen Lang (who would go on to play Thomas \"Stonewall\" Jackson in GODS AND GENERALS), as an ever-confident, ebullient Maj. Gen. George E. Pickett.\n\nIn the pivotal role of Robert E. Lee, Martin Sheen is less effective, lacking Lee's well-documented charisma, and substituting constant world-weary gazes for characterization. Robert Duvall, who assumed the role in GODS AND GENERALS, would be far more credible as Lee.\n\nThe sheer numbers of the battle are staggering; over 150,000 combatants, with 53,000 dead, more in a single three-day engagement than were lost during the entire war in Vietnam. The armies of actors, extras, and recreators could not nearly match those numbers, yet the film effectively conveys the immensity of the conflict. The tactical errors (Lee's decision, on the third day of battle, to order Pickett's suicidal charge into the Union guns; Meade's decision, drawing the fury of President Lincoln, to allow the Southern survivors to return home without further slaughter, while a humane gesture, probably lengthening the war) are presented within the context of of the overall conflict, providing the viewer with justification for their decisions.\n\nDirector Ronald F. Maxwell presents a complex, fascinating tapestry in GETTYSBURG, and it is not a film you will soon forget!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2779316505",
        "name": "Gettysburg",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzcwMmFmMjEtZWZjZi00Yjk0LWFjZDItMDBlYjE5ZjRlOTkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzcwMmFmMjEtZWZjZi00Yjk0LWFjZDItMDBlYjE5ZjRlOTkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:15:57Z",
        "url": "https://www.imdb.com/video/vi2779316505/"
    },
    "url": "/title/tt0107007/"
}