{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Madeleine Albright",
            "url": "/name/nm1267543/"
        },
        {
            "@type": "Person",
            "name": "Gromo Alex",
            "url": "/name/nm3012563/"
        },
        {
            "@type": "Person",
            "name": "Kofi Annan",
            "url": "/name/nm1108319/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 229,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Person",
            "name": "Greg Barker",
            "url": "/name/nm0994499/"
        }
    ],
    "datePublished": "2004-04-01",
    "description": "Story of Rwandian genocide in 1994, 800.000 people were slaughtered by their own goverment.",
    "director": [
        {
            "@type": "Person",
            "name": "Greg Barker",
            "url": "/name/nm0994499/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Documentary",
        "News"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWFhN2M4ZDctYmNmZS00YTE1LTk4MzktYTRiNjQxZTcwOTBjXkEyXkFqcGdeQXVyMTMwMTg1ODQw._V1_.jpg",
    "keywords": "united nations,rwanda,genocide,africa",
    "name": "Ghosts of Rwanda",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "groggo"
        },
        "dateCreated": "2008-01-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0875882/"
        },
        "name": "A Voyage Into Hell",
        "reviewBody": "This is about the seventh or eighth film I have seen on the Rwandan genocide. It might be the most concentrated and terrifying examination of pure hell on earth that I've ever seen on this subject, or perhaps on ANY subject. If this film doesn't chill you to the very marrow of your being, you need a few blood transfusions.\n\n'Ghosts of Rwanda' does not provide a comprehensive Rwandan background or 'run-up' to the 1994 events. You can see that kind of historical material in 'The Rwanda Series' (1997), a sensitive five-part series produced by Canada's National Film Board.\n\n'Ghosts of Rwanda' focuses almost exclusively on the inexplicable barbarism of the time. It examines the central question of whether the slaughter of the innocents was committed by real people or some sub-species of barely human primordial beings. About a million people, including children and babies, were systematically and casually murdered, mostly through the merciless hacking of machetes through human flesh and bone. \n\nAbout 800,000 minority Tutsis were slaughtered by the majority Hutus. They were hunted down and killed in less than 90 days. Extrapolated over even a short two-year period, it's theoretically possible that about 8 million people could have slaughtered if the carnage had not been halted. \n\nThe images in this film are devastating. I empathized deeply with the utter exasperation of Canadian General Romeo Dallaire, who commanded 'peacekeeping' troops in the country before the genocide. He stayed in the country, desperately calling for troop reinforcements and trying to save lives while the remnants of his 'peacekeepers' were abandoned by his paper-shuffling U.N. superiors in New York. Dallaire, who witnessed unspeakable atrocities up close and far-too-personal, has been credited with saving up to 30,000 Rwandans. But, 13 years later, this provides him with little solace. He still believes (and many agree) that the massacre could have been avoided.\n\nI cannot to this day forgive Bill Clinton, Al Gore (that great PEACE laureate), Madeleine Albright and all those other strident 'defenders' of 'freedom and justice' who knew precisely what was happening and took no steps to influence massive U.N. intervention, which they could have easily done. To exacerbate their crimes (and there's no more appropriate word for it), they flat-out denied that they even knew a genocide was taking place. If you believe that, you've probably already bought that famous bridge in New York City.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "timeRequired": "PT2H",
    "url": "/title/tt0875882/"
}