{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Akio Ôtsuka",
            "url": "/name/nm0960033/"
        },
        {
            "@type": "Person",
            "name": "Atsuko Tanaka",
            "url": "/name/nm0848968/"
        },
        {
            "@type": "Person",
            "name": "Tamio Ôki",
            "url": "/name/nm0645634/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 39159,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Ghost in the Shell 2: Innocence",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049546/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064941/"
        },
        {
            "@type": "Person",
            "name": "Shirow Masamune",
            "url": "/name/nm0794385/"
        },
        {
            "@type": "Person",
            "name": "Mamoru Oshii",
            "url": "/name/nm0651900/"
        },
        {
            "@type": "Person",
            "name": "Richard Epcar",
            "url": "/name/nm0258268/"
        }
    ],
    "datePublished": "2004-09-24",
    "description": "In the year 2032, Batô, a cyborg detective for the anti-terrorist unit Public Security Section 9, investigates the case of a female robot--one created solely for sexual pleasure--who slaughtered her owner.",
    "director": [
        {
            "@type": "Person",
            "name": "Mamoru Oshii",
            "url": "/name/nm0651900/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Animation",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjlkYWVlMjQtMGY3Zi00MWYxLTkxYTItODBkNGUyOWJjMjhjXkEyXkFqcGdeQXVyMTIyNzY1NzM@._V1_.jpg",
    "keywords": "cyborg sci fi,robot sci fi,cyborg,philosophy,cyberpunk",
    "name": "Inosensu: Innocence",
    "original_info": {
        "id": "Ghost in the Shell 2: Innocence_2004",
        "name": "Ghost in the Shell 2: Innocence",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "simon_booth"
        },
        "dateCreated": "2004-11-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0347246/"
        },
        "name": "Pretentious as hell, but undeniably beautiful",
        "reviewBody": "As the saying goes, \"you don't have to have a degree in philosophy to enjoy Ghost In The Shell, but it helps\". Well, I'm sure it's a saying in some circles anyway :) Mamoru Oshii has always been a pretentious director, but also a very talented one. The original Ghost In The Shell and his live-action Avalon in particular can be viewed as much as philosophical essays as they can action-driven films. However, in those two he is content to use the philosophical ideas as a foundation to build the film's story and aesthetics on, as layers to ponder if you are familiar with the ideas and inclined to ponder. In INNOCENCE, perhaps he was afraid people wouldn't understand the philosophical references, so he makes them very explicit - characters respond to almost every event that happens with a quote from Descartes or Milton or some other respected source. In the end one is forced to conclude that this is less to help the viewer understand the philosophical ideas in the film as to make sure everybody knows how well read Oshii is (I don't think the quotes would help anybody understand the ideas that wasn't already familiar with them). In other words, he lays it on a bit too thick for his own good... yet from a first viewing at least the film seems to have less of real substance to say than part 1 or AVALON. Neither of those films presented any real answers or new theories, but they were very effective artistic framings of the questions they addressed at least. INNOCENCE perhaps seems like it's trying to offer answers and explanations for issues that do not really amean themselves to answering, but more to a thorough considering of the questions and an abandoning of pre-conceptions based on a very narrow perspective (that of human existence).\n\nBut, criticisms aside, Oshii also knows that the audience is not really there to hear a lecture on philosophy - they want to be dazzled with the highest possible production values and animation standards, and he does not disappoint. The work from Production IG exceeds even their own incredibly high quality standards, and the soundtrack from Kenji Kawai complements the visuals perfectly. If the scene where the film's title is accompanies a surreal parade through a desolate high-tech urban landscape doesn't send chills down your spine then... well, that's your business, but I am surprised. It has absolutely nothing to do with the plot or any particularly clear point regarding the philosophy, but it's an aesthetic thrill of the highest order. Oshii knows that the viewer is expecting some action with his philosophy too, and the film offers a few scenes of shockingly powerful violence (especially with a big screen and modern cinema sound system). They're inserted almost arbitrarily though (there is an attempt to make one of the middle scenes more meaningful, but the climactic scenes especially have little point except the celebration of destruction). The first film's action scenes were a huge influence on THE MATRIX, and through that film were highly influential on world cinema in general - Oshii probably wanted to make sure his newest and costliest film would not go unremarked on this front too.\n\nConclusion: the film must be admitted as flawed, but what Oshii work isn't?\n\nThe first GITS was the closest to flawless he has come, and part 2 definitely doesn't put him any closer. It does raise the bar aesthetically though, and is the new benchmark for animators to beat."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi447349017",
        "name": "Ghost in the Shell 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzNlZGNmNjMtZjlkNS00MjVmLTg1OTUtZTUxMTM0OWIwNjI3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzNlZGNmNjMtZjlkNS00MjVmLTg1OTUtZTUxMTM0OWIwNjI3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:16:46Z",
        "url": "https://www.imdb.com/video/vi447349017/"
    },
    "url": "/title/tt0347246/"
}