{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Megan Hollingshead",
            "url": "/name/nm0391125/"
        },
        {
            "@type": "Person",
            "name": "Liam O'Brien",
            "url": "/name/nm1240448/"
        },
        {
            "@type": "Person",
            "name": "Yuri Lowenthal",
            "url": "/name/nm0523180/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 91,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0116610/"
        }
    ],
    "datePublished": "2005-08-23",
    "description": "A dominatrix must solve a ghost mystery.",
    "genre": [
        "Animation",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTMwNGMwYTktOWYyNC00NzY1LTllNDItNzI5NGRhZGQ2NDkyXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
    "keywords": "anime animation,female nudity,female rear nudity,dominatrix,ghost",
    "name": "Ghost Talker's Daydream",
    "original_info": {
        "id": "Ghost Talker's Daydream_2005",
        "name": "Ghost Talker's Daydream",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "reviewing_anime_rants"
        },
        "dateCreated": "2020-01-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0896540/"
        },
        "name": "What is Teizokurei Daydream trying to do?",
        "reviewBody": "Note: the following comes from a video review, links on my profile page.\n\nThis daydream's story is told in a sensitive way; can be comedic, but also substantial enough that goes beyond the typical slice of life thresholds that usually consist of most of the story being about a specific objective. The animation is precise about characters' expressions - contrasting hues, and yet subdued, can be bright and yet dark - as it sort of reflects the chaotic narrative that somehow blends well.\n\nIt shows the archetypes of beauty, alongside with what is typically considered to be its opposite - not just architecturally, but with regards to the characters' personalities too - the comedy, along with the more sombre issues. The horizon of the sunset, parallel to the psychological implications of what a past and trauma may bring to the present. It does not have a long runtime but what it does and how it happens is expressed through a variety of ways. It cycles from a detective point of view, when facts are discovered, to then reach the crux of understanding - even if quickly, it does this with a certain verve.\n\nBesides the comedy, and part of which is the aforementioned element of mystery, added in is a softer approach to storytelling, a direction taken which would have been even stronger had it been a longer-term series, an attempt similar to what Natsume's book often comes up with (in this case, a vulgar version of it, which teizoku means). One wonders whether the serious issues are meant to be reflective of how far the comedy itself does go, or perhaps they only do so to counteract each other. It is a mixture that, despite seemingly incongruous, results in a ratio that seems to meld well. A bit of city life, somewhat of a thriller, and one third tragedy, all of which surprisingly balance each other out. In the end it turns out interesting, and one might desire for more."
    },
    "url": "/title/tt0896540/"
}