{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Samuel Bottomley",
            "url": "/name/nm3890987/"
        },
        {
            "@type": "Person",
            "name": "Deborah Wastell",
            "url": "/name/nm8609670/"
        },
        {
            "@type": "Person",
            "name": "Amy Doyle",
            "url": "/name/nm7963775/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35385,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104859/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0541600/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091941/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Dyson",
            "url": "/name/nm0246037/"
        },
        {
            "@type": "Person",
            "name": "Andy Nyman",
            "url": "/name/nm0638762/"
        }
    ],
    "datePublished": "2018-04-20",
    "description": "After receiving a file with details of three unexplained cases of apparitions, skeptical professor Phillip Goodman embarks on a terrifying trip.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeremy Dyson",
            "url": "/name/nm0246037/"
        },
        {
            "@type": "Person",
            "name": "Andy Nyman",
            "url": "/name/nm0638762/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA4OWQ0NGYtNDgxNC00MzI4LTgzNzktYzAxMDcyMGI3OTFmXkEyXkFqcGdeQXVyNTIyODMzMzA@._V1_.jpg",
    "keywords": "violence,ghost,professor,based on play,anti semitism",
    "name": "Ghost Stories",
    "original_info": {
        "id": "Ghost Stories #3_1998",
        "name": "Ghost Stories #3",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheMovieDiorama"
        },
        "dateCreated": "2018-04-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt5516328/"
        },
        "name": "Ghost Stories uses its anthology structure to create chilling thrills.",
        "reviewBody": "British horrors are hit and miss with me, some are excessively uneasy to watch ('Eden Lake') whilst others are suitably atmospheric ('The Descent'). So when I saw the trailer to Ghost Stories, I immediately tempered expectations but what I saw increasingly intrigued me. The end result...was not what I predicted. A professor who takes pride at debunking psychic frauds, is given a task by his role model. He must investigate three unexplainable cases that challenge the existence of supernatural entities. An intriguing premise that will appeal to many, its execution however may not. Structuring its narrative through three short stories, each with a paranormal theme, whilst intertwining the cases into a coherent investigation. Combining real life conditions, such as stress, depression and loneliness, with a ghostly undertone certainly translates \"the brain sees what it wants you to see\" theme very well. The three cases themselves were convincingly atmospheric as they injected much needed chills and thrills to this horror flick. The main story itself, although basic, was ambiguously surreal and will leave you guessing right up to the final reveal. The acting was splendid from the whole cast, particularly Whitehouse and Lawther, hosting an array of British accents. Was it scary? No. Every single scare was accompanied with a piercing loud noise to ensure that you jump. That's not frightening, that's damn irritating! The makeup effects of the poltergeists were lacklustre. The second case should've been much scarier, but instead was rather hilarious. \"Staaay!\"...yeah, I wished you did. Could've enhanced the horror some more. Then we get to the ending, which is possibly one of the surrealist safest endings I've ever seen. The breadcrumbs throughout the film were intelligently positioned, but I feel it followed the same premise as an all too famous 1995 film (I won't say the title, it'll spoil it). The film is intelligently creepy, it's just not scary and it's conclusion didn't deliver any impact for me.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Arch skeptic Professor Phillip Goodman embarks upon a terror-filled quest when he stumbles across a long-lost file containing details of three cases of inexplicable 'hauntings'.",
        "duration": "PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2029303833",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjZmZDc0ZTQtOWRlOC00MDk5LTgzMDYtMmU0NDIyMmJjYWU0XkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjZmZDc0ZTQtOWRlOC00MDk5LTgzMDYtMmU0NDIyMmJjYWU0XkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg",
        "uploadDate": "2018-01-11T14:06:07Z",
        "url": "https://www.imdb.com/video/vi2029303833/"
    },
    "url": "/title/tt5516328/"
}