{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bill Murray",
            "url": "/name/nm0000195/"
        },
        {
            "@type": "Person",
            "name": "Dan Aykroyd",
            "url": "/name/nm0000101/"
        },
        {
            "@type": "Person",
            "name": "Sigourney Weaver",
            "url": "/name/nm0000244/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 423017,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0147858/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012330/"
        },
        {
            "@type": "Person",
            "name": "Dan Aykroyd",
            "url": "/name/nm0000101/"
        },
        {
            "@type": "Person",
            "name": "Harold Ramis",
            "url": "/name/nm0000601/"
        },
        {
            "@type": "Person",
            "name": "Rick Moranis",
            "url": "/name/nm0001548/"
        }
    ],
    "datePublished": "1984-06-08",
    "description": "Three parapsychologists forced out of their university funding set up shop as a unique ghost removal service in New York City, attracting frightened yet skeptical customers.",
    "director": [
        {
            "@type": "Person",
            "name": "Ivan Reitman",
            "url": "/name/nm0718645/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkxMjYyNzgwMl5BMl5BanBnXkFtZTgwMTE3MjYyMTE@._V1_.jpg",
    "keywords": "ghost,ghostbuster,scientist,paranormal investigation team,supernatural being",
    "name": "Ghostbusters",
    "original_info": {
        "id": "Ghostbusters_1984",
        "name": "Ghostbusters",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Old Joe"
        },
        "dateCreated": "2002-10-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087332/"
        },
        "name": "Who ya gonna call? Ghostbusters!",
        "reviewBody": "For it's time, Ghostbusters would have to be a classic. Visiting such realms as the supernatural, is sure not meant to be funny, but this film does stretch that rule a little. Thankfully it does, as it allows those among us (like me), who do not believe in ghost and goblins, to sit back, relax and enjoy the funny antics of these ghost-busting heroes. Although it might be a little dated in the new millennium, 'Ghostbusters' is still one of the 'great comedies of the 1980's' in my view.\n\nWhen the University downsizes the parapsychology department, Doctors Venkman, Stantz and Spengler make the leap from scientists to Ghostbusters, investigators and exterminators of paranormal pests! When the bewitching Dana Barrett discovers her refrigerator has become a portal into the spiritual dimension, our heroes come face to face with an ancient evil force with plans to raise hell in Manhattan.\n\nWhen reviewing a movie, I try to be as fair as I can be. However I feel that by only viewing a movie once, we can not comprehend or appreciate the work that has gone into it, as a lot of work goes into bringing a movie to 'life'. For me that is no more apparent than with this classic hit. The time spent doing the script, special effects, production designs all have their merit and make this movie great. It is not just actors doing their job, as that is only one small part of the movie.\n\nMost of 'Ghostbusters' success must be given to director Ivan Reitman. He did a fabulous job directing the Ghostbusters. I am certain that he left no stone unturned when it came to getting this film right and I am so glad he did. What also made this film more unique was that two of its stars wrote one very very good script. I am of course talking about Dan Akroyd and Harold Ramis. Their originality and comedy on paper, made watching this film a real joy. It is not often that stars write good scripts, but this time these guys got it right.\n\nThe cast that this film has was amazing to say the least. The four Ghostbuster characters were all different, which made them great to watch. I love the way that director Reitman summed up the Ghostbusters. He said of the three main guys that, Bill Murray was the 'mouth' or the smart ass of the film, while Dana Barrett says of Dr Venkman, ' you're more like a game-show host' and I have to agree with that, Dan Akroyd was the 'hands', meaning the person who was very hands-on when came to the ghostbusting, and finally Harold Ramis was the 'Brains' or the smartest one of Ghostbusters. Add in the cheery Ernie Hudson, who played Winston Zeddemore, making them the perfect team.\n\nHowever, the Ghostbusters are a little different when it comes to doing their job. They have funny facilities, which only they could invent, a car that is as wild and conspicuous as its owners are, while the tools that they use to trap there supernatural phenomenon are weird and crazy. I love the traps, 'nuclear accelerators' and other bits and pieces they simply refer to as 'toys', when they are anything but that.\n\nThen take into consideration the other great roles in this film, as without them this film would not be as good. Sigourney Weaver was very 'spiritual' when came to being the normally delightful Dana Barrett. I really enjoyed the onscreen chemistry between her and Bill Murray. Rick Moranis played the moronic '' as only he can. I always think of him as the man from 'Little shop of horrors', but there is no doubting his acting talents. Add in the very 'unusual' and eccentric Receptionist Janine, who was amusingly portrayed by Annie Potts. I love it when she screams 'we got one'. Yet I still say my favourite character in the Ghostbusters, over the silly Venkman (who is second), is the funny ghost Slimer. While Murray is as insane as the ghosts were in this movie, Slimer steals the show in my view. He is wild, 'slimes' people and makes the Ghostbusters all the funnier. Whoever invented Slimer is a genius!\n\nThere are some very funny scenes and lines in this movie. I love how we are introduced to the first ghost in the movie, who is part of the library in New York, then the mayhem and chaos we see slimmer cause in the Hotel is classic cinematography. The Venkman line at the end of the scene is priceless as he says 'we came, we saw, we kicked its ass!' Throw in scenes with the monsters that run around New York terrorising people, the unlocking of ghosts by the Environmental Protection jerk and the Marshmallow Man are all hilarious parts to a movie that is full on from start to the finish.\n\n I wish I had been old enough to see the opening of 'Ghostbusters' in the cinema, as I am sure it would have had a huge cinema release. When I remember the Ghostbusters two things come to mind. One is the hypnotic tune 'Ghostbusters' written and performed by Ray Parker Jnr., and two is that my mother and one of her friends said that they banned their children from viewing such rot. I certainly missed out on seeing many great facets of what the Ghostbusters spawned, such as two ingenious cartoons. I sort of understand what they were on about, but I would have preferred being allowed to watch it and then just forget about it. This film has a lot to like about, it is funny, crazy and a little bit different. If you are yet to see what the great fuss is about the 'Ghostbusters', then please do yourself a favour and pick up a copy today. Yes, they are ready to believe you!\n\nCMRS gives 'Ghostbusters': 5 (Brilliant Film)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Watch the 30th Anniversary Trailer for Ghostbusters.",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2800593945",
        "name": "30th Anniversary Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTgxNTM3MDUxNF5BMl5BanBnXkFtZTgwNDgwMDgxMjE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTgxNTM3MDUxNF5BMl5BanBnXkFtZTgwNDgwMDgxMjE@._V1_.jpg",
        "uploadDate": "2014-07-12T11:06:13Z",
        "url": "https://www.imdb.com/video/vi2800593945/"
    },
    "url": "/title/tt0087332/"
}