{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Morley",
            "url": "/name/nm0605923/"
        },
        {
            "@type": "Person",
            "name": "Maurice Evans",
            "url": "/name/nm0263052/"
        },
        {
            "@type": "Person",
            "name": "Eileen Herlie",
            "url": "/name/nm0379047/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 246,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Gilbert and Sullivan",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103018/"
        },
        {
            "@type": "Person",
            "name": "Leslie Baily",
            "url": "/name/nm0047664/"
        },
        {
            "@type": "Person",
            "name": "W.S. Gilbert",
            "url": "/name/nm0318275/"
        },
        {
            "@type": "Person",
            "name": "Sidney Gilliat",
            "url": "/name/nm0319148/"
        }
    ],
    "datePublished": "1953-09-07",
    "description": "The common career of W.S. Gilbert,a barrister turned comic writer, and Arthur Sullivan, a classic composer turned converted against his will to light music, who wrote fourteen operettas between 1871 and 1896, to great public acclaim.",
    "director": [
        {
            "@type": "Person",
            "name": "Sidney Gilliat",
            "url": "/name/nm0319148/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Biography",
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGIxYmZhYzUtNTJkOC00YTk2LWE0ZDktNTdhNmQ2YmQ5MDI0XkEyXkFqcGdeQXVyMDY4MzkyNw@@._V1_.jpg",
    "keywords": "based on book,gilbert and sullivan characters,arthur sullivan character,w.s. gilbert character,richard d'oyly carte character",
    "name": "The Story of Gilbert and Sullivan",
    "original_info": {
        "id": "Gilbert and Sullivan: The Mikado_1982",
        "name": "Gilbert and Sullivan: The Mikado",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2013-04-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0045839/"
        },
        "name": "For they were such Englishmen",
        "reviewBody": "The film Gilbert And Sullivan came in for much of the same criticism that so many musical biographies coming out of Hollywood did. But when we went to see such work as Till The Clouds Roll By, Words And Music, and Night And Day, we were hardly seeing the real stories of Jerome Kern, Rodgers&Hart, and Cole Porter. Their work is what people went to see those films for and thus it is with Gilbert&Sullivan whom we were lucky to get them working in harness for as much as they did give us.\n\nRobert Morley plays W.S. Gilbert the word half of the duo who started in life as a barrister, but I suspect the law probably bored him and he had a gift with a phrase and turned it into writing lyrics. Morley who was at his best playing such witty people as Oscar Wilde and James Fox was the best possible fit for Gilbert.\n\nArthur Sullivan is played by Maurice Evans who had ambitions to be a serious composer and he did compose some truly serious music like Onward Christian Soldiers for example. But these comic operas did pay the bills. Right at the beginning of the film there is a marvelous bit with Wilfrid Hyde-White who plays the father of Dinah Sheridan whom Evans is courting. She wants to be the wife of a celebrated serious composer, but dad just wants a son-in-law who can pay his own way, he does not want to wind up supporting genius as he put it. Sullivan never did marry, but the author of Onward Christian Soldiers was quite the ladies man including a rather lengthy affair with at least one married woman that went public.\n\nPeter Finch plays D'Oyly Carte their producer who created the light opera company that bears his name and has first call on the works of Gilbert And Sullivan. Finch and wife Eileen Herlie must have felt more like referees than producers as they kept the two working in harness as long as they could.\n\nAnd the heart of this film is the D'Oyly Carte company giving highlights of the various Gilbert And Sullivan comic operas which are loved in every part of the English speaking world. I've seen performances of HMS Pinafore and The Mikado myself and God willing I'll get to see others. The musical numbers are the heart of this film as they are in any American film about one of our persons of music.\n\nThe copy I rented looks like it has been restored, the color is quite nice. Good thing too, because Gilbert And Sullivan and their talent deserve the best.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0045839/"
}