{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emily Perkins",
            "url": "/name/nm0673932/"
        },
        {
            "@type": "Person",
            "name": "Katharine Isabelle",
            "url": "/name/nm0410622/"
        },
        {
            "@type": "Person",
            "name": "Kris Lemche",
            "url": "/name/nm0501210/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49040,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028055/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027876/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078812/"
        },
        {
            "@type": "Person",
            "name": "Karen Walton",
            "url": "/name/nm0910550/"
        },
        {
            "@type": "Person",
            "name": "John Fawcett",
            "url": "/name/nm0269502/"
        }
    ],
    "datePublished": "2001-05-11",
    "description": "Two death-obsessed sisters, outcasts in their suburban neighborhood, must deal with the tragic consequences when one of them is bitten by a deadly werewolf.",
    "director": [
        {
            "@type": "Person",
            "name": "John Fawcett",
            "url": "/name/nm0269502/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Drama",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjY4OWNjYWQtODM2NC00MDk3LTgzMDgtM2QzZWFmYTNlNDk2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "werewolf,full moon,belly button piercing,obsessed with death,coming of age",
    "name": "Ginger Snaps",
    "original_info": {
        "id": "Ginger Snaps_2000",
        "name": "Ginger Snaps",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2003-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0210070/"
        },
        "name": "She's Snapped.",
        "reviewBody": "I grow weary of horror films. I really do. I don't tend to enjoy the majority of serial killer slasher flicks because they're not my piece of cake. One, they don't scare me. Two, the quality of the films has greatly decreased since John Carpenter's \"Halloween,\" and the result is a bunch of recycled slasher hits and their uncountable many sequels, all just replays of the last one. Three, the entire formula is getting old.\n\nThere are bands of teenagers and cult followers who love horror films. I am not one of those (un)lucky individuals. I respect well-made modern horror films, but I yearn for the olden days when horror implied something a little more than just blood-'n-guts-type serial killer movies with unbeatable foes battling virgins and non-virgins in ridiculous situations.\n\nYes, real horror films are truly hard to find nowadays, which is why \"Ginger Snaps\" -- a modestly-scaled Canadian werewolf movie -- succeeds as more than just another crude bit-by-a-werewolf-soon-you're-a-killer-man-beast movie. (Pardon the random and haphazard string of words.)\n\nWerewolf movies are as old as the days. Over the years, with unflattering productions such as \"Wolf\" (1994), the legend and actual horror of werewolfs has decreased and the images of the beasts have turned into some sort of cute, cuddly dog figures.\n\n\"Ginger Snaps\" is one of the darkest werewolf films made, and one of the most realistic, too. It's a story about a teenage girl who acquires the mythical hairraising powers of the species after being attacked and mauled in Canadian woods.\n\nGinger (Katharine Isabelle, who starred in this year's \"Freddy vs. Jason\") is a happy 16-year-old with a low social life status. Her 15-year-old sister, Brigitte (Emily Perkins), is the same way. But one night in the woods outside their home, both girls are attacked by a vicious beast, and soon Ginger starts going through some changes. First it's minor stuff, like hair sprouting in weird places. Then it's strange stuff, like growing a tail.\n\nSoon she's the \"cool girl\" at school, hanging out with the right crowds and so on. Her sister is put off by Ginger's new image, and is uneasy with the new, cruel, cool Ginger, who no longer hangs out with her sister.\n\nBut the changes start to become too apparent, and she begins to gradually evolve into a hairy beast, which threatens not only Brigitte's life, but also those around her, especially after Ginger's blood craving starts to take over her senses. \n\nThe key to this film, I think, is its modest tone. It was a low-budget Canadian werewolf movie -- nothing more -- and it has an ingenuity about it. It's original, to a certain extent, even though the actual premise of werewolves has been used to death over the years.\n\nThis is a fun movie because of its unique view of werewolves. It brings the legend of the mythical beasts closer to reality -- it offers a perspective of what it may truly be like to acquire the abilities of the beast in today's age. Sure, the overall premise may be ridiculous, as werewolves are works of fiction, but if you ever want to know what it may be like -- just for fun -- then check this one out for a good thrill.\n\n4/5 stars.\n\n\n* John Ulmer\n"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1588199705",
        "name": "Ginger Snaps",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTE0MWRlYjctMzM4Ni00ZWNjLWIyZmMtY2I0ZDhjMzk5OTJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTE0MWRlYjctMzM4Ni00ZWNjLWIyZmMtY2I0ZDhjMzk5OTJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:17:33Z",
        "url": "https://www.imdb.com/video/vi1588199705/"
    },
    "url": "/title/tt0210070/"
}