{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cheri Caffaro",
            "url": "/name/nm0128410/"
        },
        {
            "@type": "Person",
            "name": "Duane Tucker",
            "url": "/name/nm0875848/"
        },
        {
            "@type": "Person",
            "name": "Herbert Kerr",
            "url": "/name/nm0449713/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 618,
        "ratingValue": 3.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056850/"
        },
        {
            "@type": "Person",
            "name": "Don Schain",
            "url": "/name/nm0769913/"
        }
    ],
    "description": "A rich society girl is recruited to go undercover and expose a drug/blackmail/prostitution ring in her small town.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Schain",
            "url": "/name/nm0769913/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTRiM2U2MGQtMDZhMi00NjljLWI5MGYtNmI0Nzk2YjM3NGQ4XkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_.jpg",
    "keywords": "rape and revenge,female protagonist,murder of a nude woman,woman fights a woman,character name as title",
    "name": "Ginger",
    "original_info": {
        "id": "Ginger_1971",
        "name": "Ginger",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bbhlthph"
        },
        "dateCreated": "2004-11-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067133/"
        },
        "name": "A guilty pleasure - like the occasional splurge when dieting",
        "reviewBody": "When I reviewed the film 'Christina' for IMDb, I commented that it was very poorly made in comparison with many of the earlier films of the same genre, such as the early 1970's series featuring the female private investigator Ginger. Later thinking back about this spontaneous comment I found it hard to rationalise why I had hated watching Christina, but had enjoyed the Ginger series; and I began to wonder whether this was solely because I was looking back at the latter series, which I have not viewed during the quarter century since they were first released, through the rose coloured spectacles of relative youth. Many of the criticisms I had made about Christina seemed on reflection to have been equally applicable to the Ginger films. These and other films of the same genre were made on a relatively low budget for the sole purpose of bringing in good returns to their promoters; or (if we are more charitable) building up the funds required for the production of a planned future epic or Oscar winner. They are basically simple exploitation movies with an appeal based on sex and violence and with no pretensions to cinematographic significance. The promoters know that the largest cinema audiences consist of young people who typically attend in groups or pairs and who expect an interesting but not memorable screening they can enjoy together. Films such as \"Ginger\" or \"Pepper\" appeal to girls and women because they feature an unusually capable female investigator who can always deal with male colleagues or opponents on a more than equal basis. Their recipe includes enough violence and female nudity to ensure that they have an equal appeal for youths and young men; and they always show respect for the traditional values of Society - the good guys always win out in the end and there is no tolerance of either criminals or revolutionaries. Why then should I remember the Ginger films quarter of a century later, whilst most of the other films of the same genre which I have seen since have now been totally forgotten?\n\nTo answer this question I obtained copies of the first and third of the Ginger films (\"Ginger\" and \"Girls are for Loving\") to watch again, and am now submitting my comments on both to IMDb. These two sets of comments should be regarded as complimentary - probably the main difference between these films is that the first is a typical very low budget production designed to test the market, whilst the third has clearly benefited from rather less financial constraints. In these comments I am limiting myself to generalities when considering 'Ginger', but examining more specific considerations in the case of 'Girls are for Loving'.\n\nViewing these two films for a second time I found it very hard to identify any areas where they are significantly better in quality than 'Christina'. All these films feature violence, nudity and sexually suggestive situations, with no redeeming social message, often to the point where they would be regarded by most viewers as no more than soft porn. They are intended to provide easy viewing but not memorable fare. The Martin and Porter Guide to Home Videos makes the telling comment that it will not describe \"Ginger\" as the best of these three films, but rather as the least repulsive. However the Ginger films are still available as DVD's, and are presumably still selling, over 30 years after they were first released, so I am not alone in remembering them when so many of their later imitators have been totally forgotten. After watching them again I feel certain that this difference is primarily attributable to a much greater tautness in the script. Watching many other similar films, viewers encounter numerous rather boring sequences where they wonder why they are wasting their time watching such trash. Ultimately this leads to a low rating for the film in question. The problem here lies in the direction. Whilst they were no better made or acted, the direction of the Ginger films is such that the story carries the viewer forward from moment to moment in a way which leaves little time for introspection or boredom to develop. In my view this is the reason they have survived whilst so many later films have fallen by the wayside. But their appeal is purely that of a guilty pleasure, re-watching them reminded me of the appeal of splurging on a massive and rich ice cream concoction after a long period of dieting. The only reason why this may be said to be a good thing to do is that, certainly for some people, an occasional indulgence of this kind can be of enormous value in helping them to maintain the ongoing discipline of dieting over an extended period of time.\n\nIf you know that you enjoy this type of occasional indulgence, watch one or more of the Ginger films. You will probably not be disappointed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0067133/"
}