{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emily Perkins",
            "url": "/name/nm0673932/"
        },
        {
            "@type": "Person",
            "name": "Brendan Fletcher",
            "url": "/name/nm0281956/"
        },
        {
            "@type": "Person",
            "name": "Katharine Isabelle",
            "url": "/name/nm0410622/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14468,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028055/"
        },
        {
            "@type": "Person",
            "name": "Karen Walton",
            "url": "/name/nm0910550/"
        },
        {
            "@type": "Person",
            "name": "Megan Martin",
            "url": "/name/nm1325872/"
        }
    ],
    "datePublished": "2004-01-30",
    "description": "Ginger's sister Brigitte, now a werewolf herself, must try to find a cure for her blood lust before the next full moon while hiding out in a rehab clinic from a relentless werewolf.",
    "director": [
        {
            "@type": "Person",
            "name": "Brett Sullivan",
            "url": "/name/nm0837977/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE1MTIxMTc0MV5BMl5BanBnXkFtZTcwOTIxMjUyMQ@@._V1_.jpg",
    "keywords": "canadian horror,female masturbation,group female masturbation,woman interrupted while masturbating,werewolf",
    "name": "Ginger Snaps 2: Unleashed",
    "original_info": {
        "id": "Ginger Snaps 2: Unleashed_2004",
        "name": "Ginger Snaps 2: Unleashed",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kitsune-6"
        },
        "dateCreated": "2004-06-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0353489/"
        },
        "name": "For something that should not be, it justifies its making.",
        "reviewBody": "There are some films that just shouldn't have a sequel.\n\nSo, given that I firmly believe this about 'Ginger Snaps', 'Ginger Snaps Unleashed' clearly had a tough act to follow. And y'know, it didn't do too badly.\n\nSo by now we've all got the plot - Bridgit mainlining wolfsbane to not become like her sister, passes out in the snowy streets after another werewolf attack and wakes up in a rehab centre. Yada yada, this is IMDb, you can look up the plot summary earlier. But the way it develops...OK, it's no way as symbolic as the first film but it's damn logical. It all makes sense in context, right down to the *deeply* messed up ending. Which in some ways is a drawback because it's a little *too* realistic to always engage; it's a bit dull at times, just like rl. And all the characters are 2-dimensional except for Bridget, Ghost, and maybe the creepy Tyler.\n\nBut! Those three? Carry the movie. Emily Perkins is as great as she was in the first film, and Eric Johnson shows us that when it came to Smallville, *Lana* should have left on the bus to go into military. But the real find is Tatiana Maslany, who quite frankly is *terrifying* as Ghost. Which is maybe another criticism; given the ending I shouldn't have worked things out as quickly as I did, but that's not just due to Tatiana, that's also due to other clues in the film. This aside, she rocks as Ghost and it's great to see the kind of character Ghost is lead to the conclusion it does because frankly? Yeah, makes sense. And I really cannot say much more without spoiling it.\n\nSo, in conclusion. A lot of holes, not so special second time round, and too few 3 dimensional characters. But he cinematography is ace and very like the first (which makes sense given this one's director edited the first one, and John Fawcett did some unofficial second unit stuff on here too) and I think it's a film that'll grow on me. It's certainly worth a go - 7 out of 10."
    },
    "url": "/title/tt0353489/"
}