{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Scarlett Johansson",
            "url": "/name/nm0424060/"
        },
        {
            "@type": "Person",
            "name": "Colin Firth",
            "url": "/name/nm0000147/"
        },
        {
            "@type": "Person",
            "name": "Tom Wilkinson",
            "url": "/name/nm0929489/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 79846,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104308/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022758/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022869/"
        },
        {
            "@type": "Person",
            "name": "Tracy Chevalier",
            "url": "/name/nm1256768/"
        },
        {
            "@type": "Person",
            "name": "Olivia Hetreed",
            "url": "/name/nm0381757/"
        }
    ],
    "datePublished": "2004-01-30",
    "description": "A young peasant maid working in the house of painter Johannes Vermeer becomes his talented assistant and the model for one of his most famous works.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Webber",
            "url": "/name/nm0916424/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTU3NTg5NDYtNWNkMC00ODZiLTljZjQtNjZhNjlhNjZiNDBlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "artist's model,painter,johannes vermeer,art studio,master servant relationship",
    "name": "Girl with a Pearl Earring",
    "original_info": {
        "id": "Girl with a Pearl Earring_2003",
        "name": "Girl with a Pearl Earring",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jkeats1"
        },
        "dateCreated": "2004-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0335119/"
        },
        "name": "A Wonderful Film Not Just about Vermeer, but Artistic Motivation",
        "reviewBody": "Johannes Vermeer was a silent man. Being equipped with immense talent, brush and palette, there really was no need for words. Such philosophy is greatly dwelt upon in Peter Webber's adaptation of Tracy Chevalier's novel. \n\nThe film is breathtaking alone in the fact that the production team, led by cinematographer Eduardo Serra, production designer Ben Van Os, and art director Christina Shaeffer, manages to capture Vermeer's filling, oil-based colors, and light into every scene. \n\nThe story is exemplary as well. We are taken into a brief era in Vermeer's life in 17th century Delft. Much of the film's premise is true: Vermeer was a reticent and brilliant painter who attempted to balance his genius and deep-rooted, innate calling to art and solitude with the often overbearing demands of a bourgeoisie, Venetian society, as well as the malignant pressures posted by a sadistic commissioner, and the pressures of being the head of a massive household (when he died in 1675, he left behind his wife and 11 children). \n\nIn 1665, however, he painted a mysterious masterpiece. It's mysterious because much scholarship has since been dedicated to uncovering the identity of the model who posed for it. It has been suggested that the subject is one of his daughters, although this theory is met today with much skepticism. And this is where the film spends most of its fictional focus: that of creating an imaginary story to help speculate on what we know as factual about Vermeer's life. Enter a young, beautiful servant girl, Grit (Scarlett Johansson), who through no fault of her own, finds that her classic beauty attracts Vermeer's sensibilities-as a man and as an artist-to such a degree that he has no choice but to capture her on oil and canvas.\n\nVermeer (Colin Firth) spends a lot of time in this film standing quietly in the shadows and peeking around corners. There's great symbolism in many of these shots-his body is often half-covered, half-exposed, representing the dichotomy he must have felt in his life-that of being in perpetual conflict with his spiritual, artistic longings and the more human qualities of a man.\n\nWhereas Vermeer' silence is a result of his being reluctant to communicate with the external world, mostly due to artistic self-absorption, Griet similarly is cut off from humanity, but rather out of innocence, naivety, beauty, and the unfortunate side effect of being at the low end of a rather oppressive Delft caste system where she has little voice outside of the disturbance her beauty stimulates in others. Together, the two characters find an unspoken solace, a type of kinetic energy that can only be conveyed through Vermeer's art. Indeed, one of the film's more touching moments comes when the artist reveals his portrait of her and Griet replies, 'You've seen into me.' Another memorable moment, if not altogether breathtaking, comes when Vermeer is instructing Griet in how to hold her face at the proper angle in order to catch the appropriate reflection of light on her mouth, and also when he is instructing her in how to mix his paints and their hands, for a split second, brush together. It is in such moments that Firth brilliantly conveys the tormenting dissonance present in a man not in whose base desires are overshadowing his artistic being, but rather the opposite-as a virtuoso experiencing a rare moment of temporary carnal pleasure. \n\nAll philosophy aside, is the film any good? I'd say it's extraordinary, although if you're not one to gravitate toward the biography of an artist, this may not be the film for you. However, I do believe that the human story element her is valuable, entertaining, and worthwhile.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3265593625",
        "name": "Girl with a Pearl Earring",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTdkOWVkZjItNDViYS00NTYwLTkxMGYtYWRkNTYwM2NmY2M2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTdkOWVkZjItNDViYS00NTYwLTkxMGYtYWRkNTYwM2NmY2M2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:02:39Z",
        "url": "https://www.imdb.com/video/vi3265593625/"
    },
    "url": "/title/tt0335119/"
}