{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Isha Koppikar",
            "url": "/name/nm0465929/"
        },
        {
            "@type": "Person",
            "name": "Aashish Chaudhary",
            "url": "/name/nm0996627/"
        },
        {
            "@type": "Person",
            "name": "Amrita Arora",
            "url": "/name/nm1147677/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 376,
        "ratingValue": 3.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0086888/"
        },
        {
            "@type": "Person",
            "name": "Karan Razdan",
            "url": "/name/nm0713615/"
        }
    ],
    "datePublished": "2004-06-17",
    "description": "A man comes between two lesbian lovers, hence forming a triangle with bleak consequences.",
    "director": [
        {
            "@type": "Person",
            "name": "Karan Razdan",
            "url": "/name/nm0713615/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA5NzM4ODUxMzReQTJeQWpwZ15BbWU4MDc2ODc2MTUx._V1_.jpg",
    "keywords": "lesbian,jealousy,controversy,blood,attempted murder",
    "name": "Girlfriend",
    "original_info": {
        "id": "Girlfriend_2004",
        "name": "Girlfriend",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chrysanthepop"
        },
        "dateCreated": "2011-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0414714/"
        },
        "name": "According to Razdan, Lesbianism Is A Result Of Childhood Sexual Abuse...",
        "reviewBody": "Karan Razdan is known for his B-grade films. 'Girlfriend' was one of his attempts to make it into the big league. At that time, skin-show flicks were the trend. If it weren't for the casting of actress Ishaa Koppikar, this would have been just another forgettable B-grader. The direction is sloppy and the writing is pathetic. 'Girlfriend' is offensive to homosexuals and women. The characterization is atrocious. Apparently, according to Razdan, a lesbian is a woman who has been molested as a child and as a result of that, is only sexually attracted to women, and hates anything that has a penis. Continuing by Razdan's logic, a lesbian's girlfriend is pretty much just a pushover repressed woman who sleeps with said lesbian only because she hasn't found the idiot penis who would hit on her with cheesy lines and marry her. Surprise, surprise, the boyfriend turns out to be a neurotic and possessive homophobic git. Oh, and I cannot even find the right words to describe how homosexual men have been portrayed here. The supposed love scene with Koppikar and Arora is so lousily shot that it's laughable rather than erotic. It's funny how the movie tries to make Isha's Tanya the hateful villain but the viewer ends up liking her more than the two other idiots. Special mention goes to the background noise, I mean score, that spoonfeeds the viewer and turns this into a soap opera. Performancewise, only Isha Koppikar stands out as the strong and dominant Tanya while everyone else is ridiculously bad. Not to worry because the badness does inadvertently provide some humour."
    },
    "url": "/title/tt0414714/"
}