{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Feuerstein",
            "url": "/name/nm0275417/"
        },
        {
            "@type": "Person",
            "name": "Amy Redford",
            "url": "/name/nm0714844/"
        },
        {
            "@type": "Person",
            "name": "Dabney Coleman",
            "url": "/name/nm0001056/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 445,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023712/"
        },
        {
            "@type": "Person",
            "name": "Christopher Kublan",
            "url": "/name/nm0473516/"
        },
        {
            "@type": "Person",
            "name": "Daniel Einfeld",
            "url": "/name/nm0251827/"
        }
    ],
    "datePublished": "1999-09-11",
    "description": "Womanizing New York adman attempts to identify the causes of, and find a remedy for, his so-called addiction to sex, in order to win the love of a woman he respects.",
    "director": [
        {
            "@type": "Person",
            "name": "Christopher Kublan",
            "url": "/name/nm0473516/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzQ1YzYwNDQtNWI4ZS00M2I5LWE3NGEtZWM3OTI2NzA2OGIxXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "blonde,female nudity,female topless nudity,female rear nudity,kiss",
    "name": "Giving It Up",
    "original_info": {
        "id": "Giving It Up_1999",
        "name": "Giving It Up",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "abyoussef"
        },
        "dateCreated": "2003-10-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120628/"
        },
        "name": "\"The bastard lovechild of 'Sex & the City' and 'What Women Want.' A quirky, re-inventive entertaining romp!\"",
        "reviewBody": "by Dane Youssef\n\nKublan's \"Giving it Up\" is a movie which is scarce in the indie field. A romantic comedy, rumored to be the worst, sloppiest, unentertaining and most formulaic of the entire genre.\n\nBut very surprisingly, \"Giving it Up\" is a smarter, more-thinking person's romantic comedy. A movie that seems to have filtered out the obnoxious slapstick, trite plot points, dumb characters, monotone dialouge and Julia Roberts and Meg Ryan's routines.\n\nOh, there are quite a few clichés' in this movie, all right. The playboy who's tired of the game and wants to settle down and develop as a person, the bookish love interest who has no patience for his antics, the sexist supporting characters, the geeky best friend, the unobtainable finally obtained... only to realize that...\n\nAnd although it sounds like the storyline from \"What Women Want\" (which also featured Feuerstein), no two movies could possibly be more polar opposite.\n\nBut \"Giving it Up\" is more than that. It doesn't rely entirely on that as so many other rom-coms do.\n\n\"GIU\" is a well-played, thoughtfully-written, smartly conceived look at men, women and their views on sex and relationships.\n\nIn \"Giving it Up,\" a New York advertising executive who specializes in selling sex to sell products is living the \"almost ideal existence.\" He has devoted his life to attracting the opposite sex.\n\nAnd it seems to be working. He has a new stranger in his bed every night. He's making fat cheddar. His hard-nosed, sexist boss (Dabney Coleman \"9 to 5,\" \"Tootsie,\" \"Recess: School's Out\" and \"You've Got Mail\") loves him. His apartment is lavish and full of cosmetics to polish his vessel and keep it clean. And his superhuman libido fuels his creative fires.\n\nEnter his new boss, Elizabeth, who has heard of him and his reputation. She's smart and genuinely attractive. And quite down to earth. Ralph (Mark Feuerstein \"Woman on Top\" and \"What Women Want\"), the playboy in question is instantly smitten with her. But she's heard the word on the street and smiles, giving him the brush off.\n\nRalph is obsessed. He wants her. He can have every woman except the one he truly wants. Ain't it always the way? Ralph's less-lucky-in-love buddy, Peter (Ben Weber-- \"Twister\" and TV's \"Sex in the City\") asks Ralph why? Why does he want to give up the life? Apparently, Ralphie boy feels empty. He decides to \"give it all up.\"\n\nHe's the falling Casanova. He tries to go celibate. He meets up with Elizabeth and informs her of his newfound desire to live a life with something besides sex and even tries to win her over with his outside sex-interests. Like his joy for Billy Wilder's Cary Grant-Audrey Hepburn classic \"Love in the Afternoon.\"\n\nKublan's script is smart in a \"Sex in the City\"-type of way. Full of realistic conversations between men and women about dating, relationships, sex and their own views and look at it all.\n\nThe cast is particularly strong for an independent film. Feuerstein is a real charmer, Weber and James Lesure (From \"For Your Love\") are convincing and likable as his best friends. Ari Larter as the foul and lecherous super-supermodel Amber is also good for a few laughs. Amy Redford is really 100% believable as a smart, intelligent, confident (and beautiful) businesswoman who hates her self a bit for falling for this falling Casanova.\n\nSee it alone for the near Oscar-worthy performance of the magnificent Dabney Coleman, more hard-nosed, sexist and snarling than ever.\n\nIt's worth falling for.\n\n--Having Fallen Himself, Dane Youssef",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0120628/"
}