{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Larry Blackmon",
            "url": "/name/nm10367298/"
        },
        {
            "@type": "Person",
            "name": "Lonnie Blackmon",
            "url": "/name/nm10367297/"
        },
        {
            "@type": "Person",
            "name": "Eric Daniel",
            "url": "/name/nm10367295/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 376,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049068/"
        }
    ],
    "datePublished": "2002-03-10",
    "description": "The story of Troy Kell, a white-supremacist convicted in Nevada at age 18 of first-degree murder and sentenced to life in prison without parole. He was later transferred to a prison in Utah, where he attacked and murdered a black ...",
    "director": [
        {
            "@type": "Person",
            "name": "Marc Levin",
            "url": "/name/nm0505660/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE5MjUzMTQ1OF5BMl5BanBnXkFtZTYwNTk5Mzg5._V1_.jpg",
    "keywords": "murder,las vegas nevada,white supremacist,stabbed to death,racial murder",
    "name": "Gladiator Days: Anatomy of a Prison Murder",
    "original_info": {
        "id": "Gladiator Days: Anatomy of a Prison Murder_2002",
        "name": "Gladiator Days: Anatomy of a Prison Murder",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "a_baron"
        },
        "dateCreated": "2014-03-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0359332/"
        },
        "name": "Gladiator Days: Anatomy Of A Prison Murder",
        "reviewBody": "This disturbing documentary traces the life of Troy Kell from the age of 18 when along with another youth and a teenage girl he murdered a young man in the Nevada Desert, to the brutal murder of a fellow inmate in the Utah State Prison which resulted in his being handed down a death sentence. At the time of writing, Kell is still on death row.\n\nBy his own admission, Kell came from a good family and a fairly comfortable background. He shot James Kelly in the face six times, a crime he attempted to justify. It is conceivable he would have got away with it if the inspiration for the murder, his young girlfriend Sandy Shaw, had not taken friends to view the body instead of their burying it.\n\nWhile serving his life sentence, Kell got into an altercation with another inmate, and ended up ambushing him, stabbing him to death repeatedly, a murder that was caught on camera. The victim was black, and Kell professes to be a white separatist or something of that nature, but whatever his grasp of that ideology, there were no real racial overtones to the murder. Just as sick was his roping in another inmate to assist him with it; Eric Daniels was serving a relatively short sentence for fraud, now, thanks to Kell, he has thrown his life away, and will probably never be released, but like Kell, he made choices.\n\nAs Kell was already serving a life sentence, it was not unreasonable that he should have been sentenced to death. \n\nIt remains to be seen where the gladiator comes in; a better title for the film would be \"Psycho Daze\". Kell was clearly born with a screw loose, having thrown away two men's lives, his own, and wrecked many others. And for what? \n\nThe film crew were given free access to both the prison and Kell, who like the psychopath he is has no remorse for any of his actions, even if at times he professes otherwise.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0359332/"
}