{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matthew Broderick",
            "url": "/name/nm0000111/"
        },
        {
            "@type": "Person",
            "name": "Denzel Washington",
            "url": "/name/nm0000243/"
        },
        {
            "@type": "Person",
            "name": "Cary Elwes",
            "url": "/name/nm0000144/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 137916,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005883/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0174838/"
        },
        {
            "@type": "Person",
            "name": "Kevin Jarre",
            "url": "/name/nm0418883/"
        },
        {
            "@type": "Person",
            "name": "Lincoln Kirstein",
            "url": "/name/nm0457016/"
        },
        {
            "@type": "Person",
            "name": "Peter Burchard",
            "url": "/name/nm0120837/"
        }
    ],
    "datePublished": "1990-02-16",
    "description": "Robert Gould Shaw leads the U.S. Civil War's first all-black volunteer company, fighting prejudices from both his own Union Army, and the Confederates.",
    "director": [
        {
            "@type": "Person",
            "name": "Edward Zwick",
            "url": "/name/nm0001880/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODhlNjA5MDEtZDVhNS00ZmM3LTg1YzAtZGRjNjhjNTAzNzVkXkEyXkFqcGdeQXVyNjUwMzI2NzU@._V1_.jpg",
    "keywords": "american civil war,19th century,black soldier,military uniform,war hero",
    "name": "Glory",
    "original_info": {
        "id": "Glory_1989",
        "name": "Glory",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SteakSalad_101"
        },
        "dateCreated": "2007-03-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0097441/"
        },
        "name": "This is the definition of a truly great war movie.",
        "reviewBody": "To be quite honest, I had low expectations for \"Glory.\" It was just another boring day at school sitting in my history class drawing random drawings in my notebook. Suddenly my teacher says we're going to watch a movie. I wake up from my dreamy state and I decide I'll give it a chance. He loads the VCR tape into the machine and I fix my eyes upon the screen.\n\nI will put \"Glory\" into a few words--this is what every war movie strives to be and beyond. Glory tells the story of a Civil War colonel (Matthew Broderick) who leads the war's first all-black volunteer regimen into battles and discovers along the way he has to confront the moral question of racial prejudice within, and outside of, his regimen.\n\nSo as I'm sitting in history class watching \"Glory,\" I immediately begin to perk up. From the explosive first scene, I was fully awake. My luck skyrocketed when I discovered two of my all-time favorite actors in the film, Morgan Freeman and Denzel Washington. The movie progressed and I found myself becoming yet more and more drawn into the film--not just watching it, but actually EXPERIENCING every ounce of war, prejudice, and moral questions that face the characters in the movie.\n\nWhat's even more, is that you find yourself becoming attached to ALL of the characters--every single black soldier--in some strange way, so strange, that when these men fall in battle you feel a jolt of power inside of you that is converted to emotional sadness in your mind.\n\nThe final scenes in Glory are mesmerizing. No, more than that--utterly spectacular. The final battle scene at Fort Wagner is so amazingly shot you will think you're actually there fighting along with the black regimen. You're not in your seat watching the film--you feel like you're there! The final battle scene is so spectacular, it will easily remain one of the most memorable battle scenes I've ever witnessed in all of film. After watching Glory, you will find yourself truly moved in all ways possible. You will almost feel like a new person.\n\nAll of this paired with a beautiful score by James Horner, Glory is simply one of the best war movies of all-time. Anyone who misses this film is missing out one of the most powerful, moving, and memorable experiences a movie can bring you.\n\nI'm so glad I found myself in history this year.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi732561689",
        "name": "Glory",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2IyMDJkY2EtYjg0MS00ZWYyLWJjYTYtMTQ0YmQ5MjBhN2ViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2IyMDJkY2EtYjg0MS00ZWYyLWJjYTYtMTQ0YmQ5MjBhN2ViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:17:20Z",
        "url": "https://www.imdb.com/video/vi732561689/"
    },
    "url": "/title/tt0097441/"
}