{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Margie Hines",
            "url": "/name/nm0385695/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028853/"
        },
        {
            "@type": "Person",
            "name": "Paul Terry",
            "url": "/name/nm0856056/"
        }
    ],
    "datePublished": "1931-02-22",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Moser",
            "url": "/name/nm0608487/"
        }
    ],
    "duration": "PT6M",
    "genre": [
        "Animation",
        "Comedy",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDZkZTk1OGEtMTc3Ni00MTEyLWE0YzAtNmQ3MGU2NmQ0OWM1XkEyXkFqcGdeQXVyMDU4MTQ0Ng@@._V1_.jpg",
    "keywords": "cardinal direction in title,terry toon",
    "name": "Go West, Big Boy",
    "original_info": {
        "id": "Go West | The Big Store_1940",
        "name": "Go West / The Big Store",
        "year": "1940"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2018-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0146799/"
        },
        "name": "Terrytoons go west",
        "reviewBody": "The Terrytoons are oddly interesting, mainly for anybody wanting to see (generally) older cartoons made by lesser known and lower-budget studios. They are a mixed bag in quality, with some better than others, often with outstanding music and with some mild amusement and charm and variable in animation, characterisation and content. \n\n'Go West, Big Boy' is another 1931 Terrytoon that is decent but unexceptional. It's an uneven cartoon, but has more than enough to it to make it worth a one time watch at least, mainly for anybody striving to see every Terrytoons available like me. Again though that is not the sole reason, there is much more to 'Go West, Big Boy' than that. \n\nIt doesn't start particularly well. The gags are not enough and are not that funny or imaginative with sluggish timing. Everything about the start is very bland and uninteresting.\n\nPretty poor animation doesn't help it, aside from some nice backgrounds the character designs are primitive and crude and the repetition and looping just looks cheap as do the very rushed and unfinished-feeling transitions. The story as ever with Terrytoons is basic and obvious and the cartoon takes on more than they can chew with a few too many ideas and settings.\n\nIt is unfortunate that this is the case, because the second half of 'Go West, Big Boy' really picks up in every regard and gets rid of the false impression set by the start. The character designs are more interesting, especially agreed the vultures. \n\nThe gags are funnier, not hilarious but amusing, better-timed and more inventive. The pace is livelier, there is more charm that is natural and unforced, more risk-taking and characters that hit the right notes without blowing the mind.\n\nBest component is the music, not surprising as it was true for all of Terrytoons' output, which is outstanding. It is so beautifully and cleverly orchestrated and arranged, is great fun to listen to and full of lively energy, doing so well with enhancing the action. The backgrounds are detailed enough and show a studio that were aiming for ambition and succeeding in some aspects.\n\nTo conclude, uneven with a not very good start but ends more than satisfyingly. If you are thinking of bailing early on, stick with it because as you can guess from what has been said in my review it gets better. 6/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0146799/"
}