{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Lau",
            "url": "/name/nm0490489/"
        },
        {
            "@type": "Person",
            "name": "Stephen Chow",
            "url": "/name/nm0159507/"
        },
        {
            "@type": "Person",
            "name": "Man-Tat Ng",
            "url": "/name/nm0628806/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3301,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "God of Gamblers II",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015662/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Lau",
            "url": "/name/nm0311508/"
        },
        {
            "@type": "Person",
            "name": "See-Yuen Ng",
            "url": "/name/nm0628838/"
        },
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        }
    ],
    "datePublished": "1990-12-13",
    "description": "Multi talented Cho wants to learn from the God of Gamblers and contacts his disciple. They are attacked by a crime boss with a plan to misuse GoG's good name to make millions.",
    "director": [
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmNlYzg4MWEtMThjNS00MGUxLTk3YTMtNTNkYTg4MjdmNGM5XkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_.jpg",
    "name": "Dou hap",
    "original_info": {
        "id": "God of Gamblers II_1991",
        "name": "God of Gamblers II",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wittyfuk"
        },
        "dateCreated": "2004-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101763/"
        },
        "name": "The sequel to Chow yun Fats \"God of Gamblers\" & Stephen Chows \"All for the Winners\"",
        "reviewBody": "This is in a way the sequel to Chow Yun Fats \"God of Gamblers\" and Stephen Chows \"All for the Winners\" as it takes the history from both films to make this. Firstly... Chow yun fat is not in this film though there are clips of him taken from other movies as a joke. This film show The Knight of Gamblers (Andy Lau) life after the film \"God of Gamblers\", he is one of the best gamblers in the world and his master has sent him out to the public to do charity work. Meanwhile it shows Stephen Chows characters life after \"All for the Winners\" where he uses his mind powers to help him gamble. It comes to Chow that he should seek to be a disciple of the God of Gamblers, and goes to see if the Knight of Gamblers could help him in this mission. Shortly afterwards another gambler (named Devil of Gamblers) seeking revenge tries to assasinate the Knight of Gamblers and adopt his title for his own benefits. To clear his name the Knight of Gamblers (Lau) and the newly titled Saint of Gamblers (Chow) seek thier way pass many obstacles to give the Devil of Gamblers a match.\n\nThis film his hilarious and is even more hilarious if you have seen \"God of Gamblers\" and \"All for the Winners\". The places that are visited and the people who appear in this film are from its prequels. It is an added bonus when they keep referring to Chow yun fats character and the clips they place in this film which no doubtly are taken from his other films.\n\nI would say this is a brilliant Stephen Chow film, and its great how Andy Lau performs his character in a way where it stay true to the original character but all the while seems to be making fun of it.\n\nExcellent film.... i would give it 8/10!"
    },
    "url": "/title/tt0101763/"
}