{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Ryan",
            "url": "/name/nm0752813/"
        },
        {
            "@type": "Person",
            "name": "Tina Louise",
            "url": "/name/nm0001481/"
        },
        {
            "@type": "Person",
            "name": "Aldo Ray",
            "url": "/name/nm0712731/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1982,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "GP",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020850/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        },
        {
            "@type": "Person",
            "name": "Erskine Caldwell",
            "url": "/name/nm0129708/"
        },
        {
            "@type": "Person",
            "name": "Ben Maddow",
            "url": "/name/nm0534693/"
        }
    ],
    "datePublished": "1958-09-23",
    "description": "In the 1950s, a poor Georgia cotton farmer and his sons search for the gold presumably buried on the farm by their great-grandfather, but problems related to poverty, infidelity, unemployment, and booze threaten to destroy their f...",
    "director": [
        {
            "@type": "Person",
            "name": "Anthony Mann",
            "url": "/name/nm0542649/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzExNmE0MjktN2ZmNS00YTQxLThlMmMtZDBlYTljYWU0YmVhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "search for gold,hairy chest,rural setting,bare chested male,albino",
    "name": "God's Little Acre",
    "original_info": {
        "id": "God's Little Acre_1958",
        "name": "God's Little Acre",
        "year": "1958"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2007-05-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051666/"
        },
        "name": "Walden Family Values",
        "reviewBody": "For whatever reason the producer's decided that God's Little Acre should be set in no specific time rather than in the dust-bowl thirties where and when it belongs, it kept the film from being a great film. It's still a good film to watch, but it misses greatness by a length.\n\nErskine Caldwell wrote this and set in firmly the Depression. And for rural America, the Depression did not begin when the stock market crashed. It began after World War I when the demand for our farm produce dropped with the coming of peace. Agriculture had no price support system then, it was the beginning of the end of the family farm, be it corn or cotton. The stock market crash just exacerbated the situation.\n\nBut this Walden family has its own set of problems starting with the head of the family, Robert Ryan. As Ty Ty Walden, he's digging up the farm rather than working it, looking for some buried gold left from Civil War days. He's got three sons and two daughters and one fetching daughter-in-law, Tina Louise who is married to one son, Jack Lord, but has her heart set on her sister Helen Westcott's husband Aldo Ray.\n\nBefore she was movie star Ginger Grant and a castaway, Tina Louise was quite the sex object, she's also got another son, Lance Fuller all hot and bothered over her. He's gotten away from his family of rustics, he married a wealthy widow who up and died and left him well fixed. Of course he has the least amount of character among the whole bunch.\n\nJack Lord and Vic Morrow are the other sons. Lord in his days before he was telling Danno to book 'em played a lot of nasty types on screen. Here he's not nasty, but he's one powerfully jealous fellow. Fay Spain had a brief career as a young sex pot due to this film as the youngest in the family and one flirtatious young thing. \n\nThis film was loaded with TV stars in the making. Michael Landon has a very nice part as an albino these rustics believe has special powers that can divine where gold is. He's captured by them and put to work tramping all over Ryan's acres looking for the buried gold. He's a true innocent that Fay Spain seeks to seduce while she's still being courted by Buddy Hackett who's a local politician running for sheriff. Michael Landon or Buddy Hackett? I mean, really, who would you choose?\n\nThough some of the left-wing polemics were drained from the film, this was the fifties, Anthony Mann still managed to get his cast to deliver a powerful and entertaining film. \n\nI will say this about the ending, the audience gets the message for sure about what's important in life, but it looks Ryan never will.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In the 1950s, a poor Georgia cotton farmer and his sons search for the gold presumably buried on the farm by their grandfather but problems related to poverty, marital infidelity, unemployment and booze threaten to destroy their family.",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi62898201",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTUyMmZkYWUtMzA2YS00MmRmLTg2MDUtZWRiNTVhZWViNDE0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTUyMmZkYWUtMzA2YS00MmRmLTg2MDUtZWRiNTVhZWViNDE0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-03-03T15:46:35.891Z",
        "url": "https://www.imdb.com/video/vi62898201/"
    },
    "url": "/title/tt0051666/"
}