{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "Greg Kinnear",
            "url": "/name/nm0001427/"
        },
        {
            "@type": "Person",
            "name": "Rebecca Romijn",
            "url": "/name/nm0005381/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26004,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024601/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005596/"
        },
        {
            "@type": "Person",
            "name": "Mark Bomback",
            "url": "/name/nm0093560/"
        }
    ],
    "datePublished": "2004-04-30",
    "description": "A couple agree to have their deceased son cloned, under the supervision of an enigmatic doctor, but bizarre things start to happen several years after his rebirth.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank M. Calo",
            "url": "/name/nm1170765/"
        },
        {
            "@type": "Person",
            "name": "Nick Hamm",
            "url": "/name/nm0358327/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYzNzE3MTg5Ml5BMl5BanBnXkFtZTcwMTIxNDYwNQ@@._V1_.jpg",
    "keywords": "bare chested boy,barefoot boy,camera shot of bare feet,birthday party,blowing out birthday candles",
    "name": "Godsend",
    "original_info": {
        "id": "Godsend_2004",
        "name": "Godsend",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JAKastner"
        },
        "dateCreated": "2004-05-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0335121/"
        },
        "name": "The Moose Hole - Review of Godsend",
        "reviewBody": "We've all lost somebody close to us at some point in our lives whether it be a parent, a grandparent, cousin, a friend, a wife, or a girlfriend, it's happened to everyone. But for a parent to lose a child, especially in the prime of their life, has to be one of the most horrible experiences a parent can endure. The whole concept of the parent outliving the child is just so radically outrageous that no normal human being could ever fathom how such a person would feel, unless they themselves lost a child. In years past, one would lose a loved one, the time of grieving would take its course, and then that would be that. But times have changed and so have the methods of science, where a person would lose a loved one forever now the deceased can be brought back to life through the experimental method of cloning or at least that is the thought. Sounds more like some ungodly science-fiction novel right? Not anymore. Now that scientists have experimented on everything from sheep to mice to rabbits they now want to move on to humans, with some radical and inscrutable groups claiming they have already achieved the unthinkable  the birth of the first clone human being. Sooner or later, the moral convictions of mankind will contend with radical science to determine whether or not man can conquer death.\n\nThe story centers on a couple who decide to take the advice of a radical scientist and have their dead child cloned in order to return to their once happy life. Jesse and Paul may not have the most high paying jobs, the best house, or even the best neighborhood but there is one thing in there life that they would never be able to live without, their son Adam. Things within the Duncan household seem to be looking up with Paul being offered a better job which would require the family to move to a better quality neighborhood. But life takes a tragic turn when, just a day after his eighth birthday, Adam is fatally injured in a car accident and dies practically in his mother's arms. With their whole world turned upside-down and memories of their dead son everywhere in their home, the couple turn to Dr. Richard Wells, a radical genetics researcher, who claims to be able to take cells from the body of their dead son, place them in an egg from Jesse, and produce an identical version of Adam. All the couple would need to do is move into a new house, graciously provide by Dr. Wells himself, and promise not to tell anyone about the controversial procedure they are about to embark on. Once Adam is `re-born', the couple's life returns back to way things were before the accident  that is until young Adam crosses the age at which the original Adam died. From there the child has sleepless nights, a sudden lapse in emotions, and disturbing night-terrors that both frighten and confuse his parents. Could this be their just punishment for venturing into the realm of God or is there something else behind Adam's bewildering behavior? The story of Godsend is nothing more then a half-assed attempt at copying true a horror classic, Rosemary's Baby, and even The Others. What starts out as an intriguing insight into the moral and ethical complications behind the concept of cloning turns into an uneven and flat attempt at cheap thrills that leaves you with more question then when you started with.\n\nThe cast is mainly centered on only four characters and, unfortunately for the film, only one performs up to the standards expected of the movie-going public. Despite the fact that Robert DeNiro's character is a great opportunity for the outstanding veteran actor to add mad-scientist/researcher to his resume, the audience doesn't get as much of him as they would want which is sad since he is the only truly interesting character in the film. The filmmakers could have done a much better job at providing more information on character even if it was just revealed at the end of the film but they don't even do that. It is an absolutely pathetic sight to see the best thing a film has going for it, based on the cast, leave you totally confused based on his actions since no motivation or reasons are given to you for him doing what he has done within the course of the two hour feature. Rebecca Romijn-Stamos, who has really built up her film career over the past couple of years, is once again reduced to the second-hand eye candy is this film, including a scene where she is walking through the house in a white see-through sweatshirt that clearly shows her without a bra, which is just an absolute embarrassment to see in a film now adays  Come on people! Grow up! Greg Kinnear is pretty convincing as Paul Duncan but the character itself is a problem. He's a biologist but it takes him the longest time to figure out the thought that what may be wrong with the new Adam may be in his genes. Where did he get his college degree from? And Cameron Bright, who plays both the original and cloned version of Adam Duncan, attempts to come off as a creepy-cute kid but there nothing creepy or cutesy about him, he's just plain annoying. His `possessed' child voice and deep stares into absolutely nothingness feel like complete rip-offs of classic horror films, and not good ones at that.\n\nOverall, what should be a film attempting to answer the moral and ethical issues brought up the revolutionary concept of human cloning only leaves you with the question of why you would pay eight dollars for an unimaginative and bewildering horror knock-off. Even if you go into this film giving the filmmakers the benefit of the doubt for ripping-off Rosemary's Baby, you'll still have problems with the film's uneven and utterly confusing second half. There are so many things wrong with this film that it is hard to decide where to start. Let's first focus on the reason why the couple would want to clone their son in the first place. The subject is brought up early in the film but the wife refuses to have another child and pushes the husband toward the cloning concept. If they had left it at that then that would be fine but later on in the film they show the couple having sex, before being broken up by the screams of their cloned son. Oh! You're opposed to the having a child through moral methods but not to having the occasional `wink-wink'? Another problem is that the film tends to throw bits and pieces of religion into the film's background (the most obvious being the `Godsend Institute') and yet the question of morals and ethics within a religious context are clearly excluded from almost any conversations. And how unsatisfying and completely confusing can you make an ending for a film that was practically a waste of time to begin with? Somehow the filmmakers managed to screw that up as well (without giving anything away, practically nothing is answered). What prevented this film from getting an absolute failure would have to be its intriguing first half and engaging performance from Robert DeNiro but not even those things can resurrect this beaten and bloody horse picture.\n\nMy Rating: ** out of 5 (Grade: D)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2410283289",
        "name": "Godsend",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDgwYzhlMzEtOTAyNy00MzQyLTlmODMtNTA1YjYzODk1MTA4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDgwYzhlMzEtOTAyNy00MzQyLTlmODMtNTA1YjYzODk1MTA4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:18:28Z",
        "url": "https://www.imdb.com/video/vi2410283289/"
    },
    "url": "/title/tt0335121/"
}