{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Victor Garber",
            "url": "/name/nm0001255/"
        },
        {
            "@type": "Person",
            "name": "Lynne Thigpen",
            "url": "/name/nm0858106/"
        },
        {
            "@type": "Person",
            "name": "Katie Hanley",
            "url": "/name/nm0360088/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3460,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Godspell",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "David Greene",
            "url": "/name/nm0338719/"
        },
        {
            "@type": "Person",
            "name": "John-Michael Tebelak",
            "url": "/name/nm0853659/"
        }
    ],
    "datePublished": "1973-05-31",
    "description": "An adaption of the musical, in a modern-day song-and-dance recreation of the Gospel of St. Matthew.",
    "director": [
        {
            "@type": "Person",
            "name": "David Greene",
            "url": "/name/nm0338719/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2Q5ZWExMDEtOTkzMy00NDJmLTg1MTctNDA5ZjFhMzk1YzNmXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "pop musical,based on off broadway musical,song,singing,singer",
    "name": "Godspell: A Musical Based on the Gospel According to St. Matthew",
    "original_info": {
        "id": "Godspell_1973",
        "name": "Godspell",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aztrshbyz"
        },
        "dateCreated": "2017-06-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070121/"
        },
        "name": "Overdone and cheesy, but quite infectious and full of joy",
        "reviewBody": "Let me start this review by saying that I'm not a Christian and I don't believe you have to be one to enjoy this movie. I first saw Godspell when it was released in the early '70's and have seen it many times since then.\n\nI was having a conversation with a friend recently (he is a pastor) and I told him that I've always felt this movie wasn't made solely for Christians. In the 70's, there were a lot of young people looking for meaning in their lives, and I firmly believe Godspell was partially an attempt to reach out to those folks.\n\nMany reviewers have had issues with the movie - John the Baptist and Judas are played by the same person, and while the crucifixion is addressed, the resurrection is not. Some have called it sacrilegious, others have found it offensive. However, if you were a young person in the 70's who was looking for some direction and wanted to find out about the basic teachings of Jesus Christ, what better way than to see a movie full of catchy pop songs and a cast of joyful young people being brought to him in (then) modern New York? Even if you were already a young Christian, you now had a way to celebrate the teachings of Christ with a style of music you were probably listening to anyway. I absolutely believe that this movie had a relatability that might have been missing in some of these people's lives. Bear in mind that the original stage version was written by a college student working on his masters.\n\nYes, the movie is dated and silly and overacted and hammy in parts. There is a lot of skipping, singing, acting out of parables and dancing going on while most cast members are wearing clownish outfits. All of that being said, I have never seen such heartfelt joy while a message was being given - the cast looks like they are having the time of their lives. The mood does become quite somber and sad towards the end, but the movie ends on an upbeat note of hope.\n\nIf I'm not mistaken, all of the cast members were unknown on the big screen when the movie was released. I think casting unknowns was a good move - I don't think it would have packed the same punch or had the same level of relatability if it had bigger names. \n\nI wanted to make a comment regarding the song \"Beautiful City\". I don't know what the original meaning was for sure, but my take away from it has always been that now that the cast has been taught, they can spread the word to others and help them build a strong foundation that isn't made of alabaster and chrome. Some have thought the song wasn't appropriate for the movie - I guess it all depends on your interpretation. \n\nSo taken in the proper cultural perspective, Godspell is a powerful, uplifting and moving film about the basic teachings and crucifixion of Christ done '70s style. If you think you can get past the few discrepancies and the clownish clothing, it is worth a watch. And, again, you don't have to be a Christian to enjoy it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT4M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4267491097",
        "name": "Godspell",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTZmODQ4ODAtMTgyYi00OTdjLWJkMjQtZmMwZGM5MmE1NDhlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTZmODQ4ODAtMTgyYi00OTdjLWJkMjQtZmMwZGM5MmE1NDhlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-06T17:05:25.207Z",
        "url": "https://www.imdb.com/video/vi4267491097/"
    },
    "url": "/title/tt0070121/"
}