{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Akira Yamanouchi",
            "url": "/name/nm0945562/"
        },
        {
            "@type": "Person",
            "name": "Toshie Kimura",
            "url": "/name/nm0454123/"
        },
        {
            "@type": "Person",
            "name": "Hiroyuki Kawase",
            "url": "/name/nm0442904/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5947,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "Godzilla vs. Hedorah",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Yoshimitsu Banno",
            "url": "/name/nm0052419/"
        },
        {
            "@type": "Person",
            "name": "Takeshi Kimura",
            "url": "/name/nm0454119/"
        }
    ],
    "datePublished": "1972-02-11",
    "description": "An ever evolving alien life-form from the Dark Gaseous Nebula arrives to consume rampant pollution. Spewing mists of sulfuric acid and corrosive sludge, neither humanity or Godzilla may be able to defeat this toxic menace.",
    "director": [
        {
            "@type": "Person",
            "name": "Yoshimitsu Banno",
            "url": "/name/nm0052419/"
        },
        {
            "@type": "Person",
            "name": "Ishirô Honda",
            "url": "/name/nm0393094/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Animation",
        "Action",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjUzNzVlMzUtNDhiMi00MzUzLWE1YjEtY2I5NWJkODU1ODQ5XkEyXkFqcGdeQXVyNTMxMjgxMzA@._V1_.jpg",
    "keywords": "godzilla,smog monster,tokusatsu,water pollution,tentacle",
    "name": "Gojira tai Hedora",
    "original_info": {
        "id": "Godzilla vs. Hedorah_1971",
        "name": "Godzilla vs. Hedorah",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrunoMatteisNumberOneFan"
        },
        "dateCreated": "2001-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067148/"
        },
        "name": "Craziest movie ever!",
        "reviewBody": "Something spooky is happening on the Japanese coast; pollution is killing the fish in the ocean, but it also gives life to a monstrous mutated fish-monster. A professor and his genius kid watch it's destructions on TV, and the kid remarks: \"- Oh, that was a tadpole-monster.\" Japan and the entire world is soon threatened by the unearthly Creature, who's named Hedorah by the Professors kid.\n\nAt the same time a funky teenage assistant of the professor gets drunk at an absurdly psychadellic disco and has visions of all the party-people being mutated fish. Hedorah inhales polluted smoke from factory- chimneys and seem to get high, the kid is psychic and has visions of Godzilla coming to save the world, and the Professor is attacked by the Hedorah underwater and his face gets malformed. Godzilla and the \"Smog Monster\" (as it is sometimes referred to as) start fighting only 25 minutes into the movie. The Hedorah mutates from ocean- dweller, to reptile to flying creature, and experts conclude that \"He\" is probably from a distant Nebula in outer space. Scenes of havoc and the Professor's family is intercut with cartoon- style sequences with strong enviromental messages.\n\nOne scene has the Hedorah flying over a group of people working out, and they turn blue-faced and ultimately into gushy skeletons. A man at a construction site screams out (extremely) loud, and then falls to his death. Hedorah has the ability to corrode metal, and people on TV quarrel intensely on the fate of the planet. The Professors assistant knows the end is near, and has a hippie-styled party on top of a mountain; \"- Let's have fun as we die!!\" The party is interrupted by the space/pollution freak, and most of the kids are melted by its poisonous vomit/droppings when they try to set it on fire.\n\n The Professor's kid has found the solution to defeat the grotesque beast: \"- Dry it - it's only sludge!\", and with the aid of the friendly Godzilla it finally works. Some scenes, as well as the sounds the Hedorah makes are beyond description; like the scene were it's covering Godzilla with its tons of toxic puke, and at the same time \"laughing\" diabolically. There are weird crosscutting throughout, the kid yells \"Papa\" alot and the groovy rock score helps to its remarkably insane mood. The PG- rating should be reconsidered. This one is too dark and demented in so many ways, I don't think a ten year- old should watch it. It's mad nightmarish, art-cinematic style could cause damage.\n\nA TV- reporter calls the Hedorah \"a freak organizm\" - much like this movie itself."
    },
    "url": "/title/tt0067148/"
}