{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hiroshi Ishikawa",
            "url": "/name/nm0411054/"
        },
        {
            "@type": "Person",
            "name": "Yuriko Hishimi",
            "url": "/name/nm0386805/"
        },
        {
            "@type": "Person",
            "name": "Minoru Takashima",
            "url": "/name/nm0847394/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5143,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "Godzilla vs. Gigan",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061231/"
        },
        {
            "@type": "Person",
            "name": "Takeshi Kimura",
            "url": "/name/nm0454119/"
        },
        {
            "@type": "Person",
            "name": "Shin'ichi Sekizawa",
            "url": "/name/nm0782883/"
        }
    ],
    "description": "A manga artist becomes suspicious of his employers when a garbled message is discovered on tape. As he forms a team to investigate, Godzilla and Anguirus set out to help defeat the invaders.",
    "director": [
        {
            "@type": "Person",
            "name": "Jun Fukuda",
            "url": "/name/nm0297974/"
        },
        {
            "@type": "Person",
            "name": "Yoshimitsu Banno",
            "url": "/name/nm0052419/"
        },
        {
            "@type": "Person",
            "name": "Ishirô Honda",
            "url": "/name/nm0393094/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGU4NTI5OTMtNDNjMy00YTQ1LTlhMDctMzhkMzUxYWE4MzI2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTMxMjgxMzA@._V1_.jpg",
    "keywords": "godzilla,kaiju,giant monster,psychotronic film,king ghidorah character",
    "name": "Chikyû kogeki meirei: Gojira tai Gaigan",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vkn"
        },
        "dateCreated": "2001-03-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068371/"
        },
        "name": "Pleasingly surreal, decently action-packed, but a bit flawed nonetheless",
        "reviewBody": "Second only to Godzilla vs Hedorah in terms of weirdness, this Goji flick sees a bunch of aliens trying to conquer the earth using a children's theme park as their base. No, seriously. The bizarre theme of the film also shows in several other ways. The human characters are a bit of an oddball crew. No brave explorers, psychics or secret agents this time. Just a budding manga artist (who comes up with monsters and plots so daft not even Toho could take him seriously), his karate champion girlfriend, a funky hippy and some others. The aliens are their usual ludicrous and badly-dressed selves (they wear orange two-pieces with pink shirts underneath. Heaven help us) and their whole earth conquest plan is utterly ridiculous, of course. Something about an answering machine that can summon two monsters from space, probably. Thing is, all the silliness seems right in place this time, as the whole movie doesn't take itself seriously.\n\nOther good points include Anguillas being quite active, music by good ol' Akira Ifukube, and new baddie Gigan, who really is rather groovy.\n\nBut for all that, there's plenty to dislike as well. Godzilla himself looks terribly messy in this film. Small bits of rubber are litterally falling off him during the fight. The rubber suit was in pretty poor state, apparently. It ends up looking as if Goji's suffering from kaiju-dandruff of some kind. Then there's the disappointing use of stock footage a go-go, which looks very lazy in some scenes. The scene where Anguillas pops up at Sagami bay and then blatantly -runs away- from the puny millitary without even smashing up one single thing is really shameful (and is probably the reason why Anguillas is often regarded as a bit of a wuss). Finally, the only really serious flaw is that the big battle at the end has a poor structure. Godzilla takes a huge beating for about fifteen whole minutes, then somehow decides that enough is enough and begins to kick back with some help from Anguillas (who did fairly little so far). But just then, after a few good smacks, the two nasty monsters just turn tail and run away. Booh. It's doubly disappointing when you consider that a battle between four monsters, Godzilla and Anguillas on one side, and Gigan and Ghidora on the other, could have been so much more, especially with such cool-looking nasties.\n\nSo that leaves a bad aftertaste, but this is still an interestingly strange and silly kaiju movie that should please die-hards of the genre, or people looking for something hilariously odd. Worth watching once, just for it being so loveably off-the-wall, but you can find lots better if you want quality kaiju action.\n\nThe pinnacle of freakiness has to be the scenes where Godzilla and Anguillas -talk- to each other. Not only do we hear some utterly ludicrous distorted voices, but both kaiju are also pretty poor conversationalists (especially Anguillas). Wonder what they talk about when there aren't any big, nasty aliens around?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A manga artist becomes suspicious of his employers when a garbled message is discovered on tape. As he forms a team to investigate, Godzilla and Anguirus set out to help defeat the invaders.",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3575235353",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGNhZjJjMWMtZmVlYS00YjEwLWJmZmUtMmIzNmE4NjVjNjNjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGNhZjJjMWMtZmVlYS00YjEwLWJmZmUtMmIzNmE4NjVjNjNjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-25T22:46:41.829Z",
        "url": "https://www.imdb.com/video/vi3575235353/"
    },
    "url": "/title/tt0068371/"
}