{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Burns",
            "url": "/name/nm0122675/"
        },
        {
            "@type": "Person",
            "name": "Art Carney",
            "url": "/name/nm0138770/"
        },
        {
            "@type": "Person",
            "name": "Lee Strasberg",
            "url": "/name/nm0833448/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3544,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Martin Brest",
            "url": "/name/nm0000976/"
        },
        {
            "@type": "Person",
            "name": "Edward Cannon",
            "url": "/name/nm0134191/"
        }
    ],
    "datePublished": "1979-12-25",
    "description": "Three friends living on the dole decide to rob a bank.",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Brest",
            "url": "/name/nm0000976/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmZmY2E1MzYtOWViOS00MWJjLWE2OTUtMDFlNjQ1ZjY0MzQ0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "man wears eyeglasses,black and white photographs during opening credits,scene during opening credits,crotchety old man,satire comedy",
    "name": "Going in Style",
    "original_info": {
        "id": "Going in Style_1979",
        "name": "Going in Style",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dtucker86"
        },
        "dateCreated": "2003-10-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079219/"
        },
        "name": "George Burns gives a great performance!!!!",
        "reviewBody": "George Burns was truly one of the most amazing entertainers of all time. For almost forty years, he was part of the comedy team of Burns and Allen and then after Gracie passed away, he was forgotten for many years, however, he made one of the most amazing comebacks in Hollywood history when he played Al Lewis in The Sunshine Boys. Can you imagine this amazing achievement? George was 79 years old when this film was made and had never really \"acted\" in the traditional sense of playing an imaginary role, and yet he won an Academy Award for best supporting actor!!!The Book Of Lists mentioned this as one of the most amazing accomplishments ever at an advanced age!!Then George played another great role in the \"Oh God\" series. This man defied belief! Going In Style was in a sense his first \"dramatic\" role and he pulled it off with equal brilliance! Yes this was not a happy film to watch. In fact, I was 11 when my dad took me to see it and he commented that it was basically a very depressing story about three old men waiting to die. George has two fine co-stars in Art Carney and Lee Strasburg (who was one of the most legendary acting coaches of all time). Strasburg's role is small and he dies early on and leaves the show to Art and George. They pull it off wonderfully! It is a joy watching these two old pros at work. I wrote to Art Carney several years ago and asked him what it was like working with George Burns and he told me that George was a joy to work with and a real pro and one of the nicest people he ever worked with! They must have had a ball doing this film and it certainly shows! Even though George masterminded a bank robbery and it showed him holding a gun,it all seemed so innocent and nice. Martin Brest directed this film, he has had a wildly uneven career, but this was one of his outstanding early efforts, he later went on to direct the blockbuster Beverly Hills Cop and also directed the recent bomb of all time Gigli. However, Going In Style is a fine film ,even though its not a happy viewing experience. I think that the saddest scene in the film is where George is looking thru some old photos of himself as a young man and breaks down crying and wets himself. It is a very hard scene to watch indeed."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3864051481",
        "name": "Going in Style",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2UwMGU2MjItZmVkZC00YmFhLTg3NjQtMWYwMGFlOGY5ZTNkXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2UwMGU2MjItZmVkZC00YmFhLTg3NjQtMWYwMGFlOGY5ZTNkXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-01-29T17:03:41.120Z",
        "url": "https://www.imdb.com/video/vi3864051481/"
    },
    "url": "/title/tt0079219/"
}