{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dylan Bruno",
            "url": "/name/nm0116465/"
        },
        {
            "@type": "Person",
            "name": "Laura Harris",
            "url": "/name/nm0364977/"
        },
        {
            "@type": "Person",
            "name": "Simon Rex",
            "url": "/name/nm0005350/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1403,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044574/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031208/"
        },
        {
            "@type": "Person",
            "name": "Justin Zackham",
            "url": "/name/nm0951698/"
        }
    ],
    "datePublished": "2001-08-04",
    "description": "Loner freshman Jake Taylor is forced to join the wildest fraternity on campus...",
    "director": [
        {
            "@type": "Person",
            "name": "Justin Zackham",
            "url": "/name/nm0951698/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTM3ODgxOTYxNV5BMl5BanBnXkFtZTcwMTkwNDAwMQ@@._V1_.jpg",
    "keywords": "big breasts,legacy,brotherhood,heavy drinking,gay character",
    "name": "Going Greek",
    "original_info": {
        "id": "Going Greek_2001",
        "name": "Going Greek",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "agibian"
        },
        "dateCreated": "2003-07-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0263386/"
        },
        "name": "Really funny with excellent pacing",
        "reviewBody": "I had the pleasure of catching this film at a screening in New York and wanted to make sure others got word that this is a film to see. First off, let's have no misconceptions here: Going Greek is not Saving Private Ryan, The Godfather or Gone With the Wind. It is, however, an excellent addition to the genre set by Animal House and further embellished by Porky's and American Pie. Is it an \"important\" film? Of course not, but if you want to laugh A LOT and spend a very amusing 90 minutes with a crisp, well directed and thoughtful film, then check it out.\n\nOther reviewers have said a lot of what I would say, so I won't bore you with repetitive details, but nobody thus far has commented on the pacing of the film. A lot of movies, comedy or otherwise, spend too much time on individual scenes. The special quality of this film, and the effectiveness of Director Justin Zackham (watch for more from this guy) is that the movie drops into each scene, delivers its joke - good or bad - and gets out quickly. The result is that you are never bored. Humor being what it is, you won't be able to satisfy everyone with every joke. Zackham intuitively understands this and makes sure you don't get the chance to get restless waiting for a scene to end. The odds of this are mitigated somewhat as the writing is good enough that most of the scenes are actually really funny.\n\nOverall, this is a film worth seeing. High art it ain't, but good laughs, a well written script and really good directing made it very worthwhile.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0263386/"
}