{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jieh-Wen King",
            "url": "/name/nm0398736/"
        },
        {
            "@type": "Person",
            "name": "Kuei-Ying Hsu",
            "url": "/name/nm0398833/"
        },
        {
            "@type": "Person",
            "name": "Annie Shizuka Inoh",
            "url": "/name/nm0409244/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1821,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "Goodbye South, Goodbye",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025775/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007001/"
        },
        {
            "@type": "Person",
            "name": "T'ien-wen Chu",
            "url": "/name/nm0160883/"
        },
        {
            "@type": "Person",
            "name": "Jack Kao",
            "url": "/name/nm0304709/"
        },
        {
            "@type": "Person",
            "name": "Jieh-Wen King",
            "url": "/name/nm0398736/"
        }
    ],
    "datePublished": "1997-04-12",
    "description": "A glimpse at the lives of two petty criminals in Taipei.",
    "director": [
        {
            "@type": "Person",
            "name": "Hsiao-Hsien Hou",
            "url": "/name/nm0396284/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMxODA1MjUxOV5BMl5BanBnXkFtZTcwMjU4MTEyMQ@@._V1_.jpg",
    "keywords": "taiwan,vomiting,politics,neon sign,cell phone",
    "name": "Nan guo zai jian, nan guo",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zetes"
        },
        "dateCreated": "2001-11-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117151/"
        },
        "name": "\"I'm dying for a change of scenery.\"",
        "reviewBody": "That line is spoken about halfway through Hou Hsiao-hsien's 1996 film Goodbye South, Goodbye by a woman who is thinking of moving to America to help out her sister. Well, the context doesn't really matter. It's just that, when I heard her say that line, I was thinking, \"I'm with you, sister!\" For two months now, on every Friday night save two, I have attended a Hou Hsiao-hsien film. Not one of them has varied from the next more than the slightest iota in style or content. Two were interesting, but flawed: Dust in the Wind and City of Sadness. One was mediocre: Good Men, Good Women. Three were total bores: A Time to Live, a Time to Die, The Puppetmaster, and now Goodbye South, Goodbye.\n\nThe program notes for Goodbye South, Goodbye say this: \"Hou leaves behind his static camera, opting for one that moves restlessly as his characters.\" I want to know what the hell film the person who wrote that was watching. In GSG, Hou follows the same style to a T in around 80% of the film's scenes. Read my review (pan) of The Puppetmaster on IMDb, in which I identify and deconstruct Hou's uninventive cinematic techniques. Every one I point out in that review is used half a dozen times in this film. But wait! The camera does, in the remaining 20% of the scenes, move restlessly: Hou adopts two new techniques here: 1) shots taken from the back of a moving vehicle which either observes another moving vehicle or does not; 2) hand-held sequences. The only thing is that Hou inserts these two variations to his duller-than-paint-drying style so self-consciously that they end up clashing with the more run-of-the-mill scenes greatly. These few scenes are all, with maybe one small exception, merely connecting scenes. Any scene which is important to the \"plot\" or \"character development\" (in scare quotes because Hou doesn't believe in telling a story or building strong characters; or, for completion's sake, in artful shot composition, either) is filmed in the type of static shot that anyone familiar with Hou's films should recognize immediately. Also, in an attempt to bolster (or, more likely, to pretend to bolster) the film's excitement level, Hou inserts loud industrial music. A good song, to be sure, I believe performed by the guy who plays Flatty, but it totally does not belong. What Hou fanatics (I refuse to shorten that word to \"fans\") see as a new shift in his style is nothing more than a pseudo-shift, one calculated to cause the fanatics to believe that he has changed and is thus evolving. No evolution here whatsoever.\n\nIn every medium of art I have examined, I have never come upon an artist so thoroughly and purposefully unengaging as Hou Hsiao-hsien. His goal is clearly to subvert cinematic conventions and expectations, I'm sure, but he's completely forsaken anything at all interesting. Why watch a film if there's not a single worthwhile aspect to offer? My guess is that Hou doesn't even KNOW how to make a film, at least not how to do it well. As he began to make films in the 1980s, Taiwanese and Chinese critics probably identified his style and proclaimed him an auteur. This, I assume, went to his head. As an auteur, he was then compelled to retain his style as tightly as possible. All he knows about auteurs is that they repeat certain aspects of their films, and that auteurists find that interesting. Let's take one common Hou scene: he often depicts characters eating. A different auteur would use an eating scene to bring out aspects of his characters. Take Hitchcock, for instance. Whenever characters in his films eat, it is important. Take Strangers on a Train: Bruno, the villain, orders lamb chops, French fries, and chocolate ice cream for lunch. Quite the lunch! This shows the kind of hedonistic lifestyle he lives. Now take Norman Bates in Psycho, how he is always nervously eating candy, or what he says about how the term \"eating like a bird\" is a falsity, that they really eat \"an enormous lot.\" But when a Hou Hsiao-hsien character eats, he is just eating. Nothing more to it than that. So Hou doesn't retain substance between his films, he only retains content. He uses eating scenes because, well, he used them in his previous films.\n\nNext week, Flowers of Shanghai is playing. It is purported to be Hou's best film. I will see it: hell, if I was the type to be discouraged, I would have only seen one of his films (and, to be truthful, I am perfectly glad that I saw Dust in the Wind and I am actually eager to see City of Sadness again). I hope, I dearly hope, as I have hoped every time I've sat down in the theater, that the Hou film about to be shown will impress the heck out of me. Somehow, I doubt it. Whatever the praise of the next film, I'm just dying for a change in scenery. 5/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0117151/"
}