{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Annie Shizuka Inoh",
            "url": "/name/nm0409244/"
        },
        {
            "@type": "Person",
            "name": "Giong Lim",
            "url": "/name/nm0510533/"
        },
        {
            "@type": "Person",
            "name": "Jack Kao",
            "url": "/name/nm0304709/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1196,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Good Men, Good Women",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025775/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0359612/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064089/"
        },
        {
            "@type": "Person",
            "name": "Bi-Yu Chiang",
            "url": "/name/nm0156949/"
        },
        {
            "@type": "Person",
            "name": "Bo-Chow Lan",
            "url": "/name/nm0484042/"
        },
        {
            "@type": "Person",
            "name": "T'ien-wen Chu",
            "url": "/name/nm0160883/"
        }
    ],
    "datePublished": "1995-12-09",
    "description": "Intended as the concluding film in the trilogy on the modern history of Taiwan began with Beiqing Chengshi (1989), this film reveals the story through three levels: a film within a film as well as the past and present as linked by...",
    "director": [
        {
            "@type": "Person",
            "name": "Hsiao-Hsien Hou",
            "url": "/name/nm0396284/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQzNzkxMjkzN15BMl5BanBnXkFtZTcwOTg3MjAyMQ@@._V1_.jpg",
    "keywords": "film within a film,part of trilogy,flashback,based on novel",
    "name": "Hao nan hao nu",
    "original_info": {
        "id": "Good Men_1995",
        "name": "Good Men",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "PiranianRose"
        },
        "dateCreated": "2005-11-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113256/"
        },
        "name": "Deliberate minimalism from an uncompromising master",
        "reviewBody": "This movie achieved substantial impact on me, in a good way. Firstly, it's the first Hou Hsiou Hsien film that I have been able to sit through in its entirety. As much as I claim to admire film as art, I will not ever consider giving FLOWERS OF SHANGHAI another attempt. Secondly, I now see Hou Hsiou Hsien as one of the most respectable craftsman in cinema, even more admirable than Zhang Yimou from China or my personal favorite, Wong Kar Wai from HK, and I'll give my reasons. Zhang and Wong take risks with their creations, but they are relatively easy to grasp, and even have some entertainment values. For example, Zhang's TO LIVE is an emotionally heavy drama that spans several generations before, during, and after Cultural Revolution. Even if one doesn't have taste for art films, one could enjoy its sheer melodrama. In the case of Wong, his Chungking Express has a huge cult following. It has a sweet touch of spontaneity that makes it watchable to anyone, although the disconnected storytelling could throw some people off.\n\nSo Zhang can do intense drama, and Wong can direct spontaneous acting. Hou Hsiou Hsien (or his colleagues Tsai Ming Liang and Edward Yang), however, is of a different breed. His films (that I've seen anyway) are casual but deliberately never ever strive to be interesting. For example, there's no moody music, showy cinematography, or thought-provoking dialogue to spice things up while you watch a 2-minute long take of people walking. Everything is just as indifferent as it is and nothing more; then it's up to us to give it a meaning -- that is the essence of MINIMALISM which define Hou's body of work. Minimalist cinema is by far the most difficult to grasp and sit through (since \"nothing happens,\" some will understandably accuse), and many viewers detest it with a passion. Whether this style is actually effective I do not know, \"all I know is this: once I was blind and now I can see.\" Good Men Good Women is an eye opener for me.\n\nIn recent years, several well-noted Chinese art house filmmakers have upgraded to generously budgeted blockbusters: Ang Lee with Crouching Tiger, Zhang Yimou with Hero and Flying Dagger, He Ping with Warriors of Heaven & Earth, Fruit Chan with Three Extremes: Dumpling, not to forget Cheng Kaige's special effects fantasy extravaganza The Promise on the way, followed by Wong Kar Wai reportedly to film an American feature The Lady from Shanghai with Nicole Kidman, and words of Hou's Taiwanese colleague Edward Yang to direct an animation produced by Jackie Chan. In such a relaxing trend, will Hou Hsiou Hsien have any surprises for us, or will he continue to explore Taiwan in minimalist glory?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0113256/"
}