{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Elvis Presley",
            "url": "/name/nm0000062/"
        },
        {
            "@type": "Person",
            "name": "Carl Perkins",
            "url": "/name/nm0673897/"
        },
        {
            "@type": "Person",
            "name": "Johnny Cash",
            "url": "/name/nm0143599/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 127,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059925/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142386/"
        }
    ],
    "datePublished": "2001-11-28",
    "description": "The film was to pays tribute to the musicians who formed the foundation of Sun Records and rock and roll. They may not have been famous, but they supported stars like Elvis and Johnny Cash.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Sinofsky",
            "url": "/name/nm0802501/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Documentary",
        "Biography",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzNTgwNjEzMl5BMl5BanBnXkFtZTcwNzY3OTUxMQ@@._V1_.jpg",
    "keywords": "rock music",
    "name": "Good Rockin' Tonight: The Legacy of Sun Records",
    "original_info": {
        "id": "Good Rockin' Tonight: The Legacy of Sun Records_2001",
        "name": "Good Rockin' Tonight: The Legacy of Sun Records",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ccthemovieman-1"
        },
        "dateCreated": "2008-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0302614/"
        },
        "name": "Nice Tribute To The Pioneer Rockers, But Phillips Is A Little Much",
        "reviewBody": "This was a real mixtures of highs and lows, as far as I was concerned. Seeing and hearing rock legends like Elvis Presley, Jerry Lee Lewis and Carl Perkins back in the 1950s was great and might make me buy this DVD. I also thought some of the tribute songs that a few performers did were excellent, too, and featured some unique takes on some of these rock 'n roll standards.\n\nMy only annoyance was listening to Sam Phillips go on and on about what a great pioneer he was in the record business. This man is a real blow-hard, a man with an over-sized ego with run-on sentences about himself. Since this DVD is a tribute to Sun Records, however, Phillips is the key man since he began the company and ran it! His Sun Studios, in Memphis, Tenn., is still famous. This is the studio where those guys mentioned above, and others, got their start. Phillips. Still, less Sam and more singers would have made this documentary more appealing.\n\nIn the meantime, I learned about Sonny Burgess, Billy Lee Riley and a few other \"cats\" from that era that never got publicized as they should but were almost as talented as the big stars.Burgess is still bitter over that, and expresses it a few times on the DVD, blasting Phillips. So, to the documentary's credit, both the good and bad of Phillips are presented.\n\nIt was great to see Scotty Moore and D.J. Fontana, two guys who played with Elvis in his early days. Paul McCartney, Mark Knopfler, Ben Folds, Robert Plant, Jimmy Page, Johnny Halladay, Zucchero, Third Blind Eye, Malcolm Yelvington and Kid Rock all pay their respects to the beginnings of rock and to Sun Records. All in all, it's a nice tribute.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H52M",
    "url": "/title/tt0302614/"
}