{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Warren Mitchell",
            "url": "/name/nm0593803/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Rhys Meyers",
            "url": "/name/nm0001667/"
        },
        {
            "@type": "Person",
            "name": "Celia Imrie",
            "url": "/name/nm0408309/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3018,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        }
    ],
    "datePublished": "2000-06-10",
    "description": "A villain threatens the rise of a new earl in an ancient kingdom.",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcwNjczMDIzMV5BMl5BanBnXkFtZTcwOTA2ODI0MQ@@._V1_.jpg",
    "keywords": "breast feeding,library,ambition,surrealism,tv mini series",
    "name": "Gormenghast",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vox-sane"
        },
        "dateCreated": "2001-06-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0197154/"
        },
        "name": "A Worthy Attempt",
        "reviewBody": "There are few genuinely unique fictional landscapes. Dickens and Wodehouse created their own enclosed worlds, Wodehouse with his own language, as distinct and peculiar as Middle Earth's Elvish. Dickens and Wodehouse called their worlds \"London\" and \"England\" but really both were places of fantasy. Nevertheless, Dickens and Wodehouse are recognizable places, however they twist their realities. Even in labelled fantasy literature too much of what passes as a new world is really a recognizable pastiche of our own.\n\nHowever, there are a few literary works that present fully realized alternate existences: Tolkien's Middle Earth; Herbert's Dune; Peake's Gormenghast; perhaps Donaldson's Mordant. It's difficult to bring these to the screen (\"Dune\" was unsuccessful, for instance) because reading exercises the imagination and all readers have their own ideas of how the worlds should be presented. One can't please everyone.\n\n\"Gormenghast\" is a game attempt at Peake's comic, nightmarish world. Gormenghast is the castle of the Earl of Groan, and in the book it seems to stretch forever, through endless corridors and towers. Though the literary Gormenghast is filled with more distinctive characters than can be presented in a miniseries, one gets the oppressive, cavernous emptiness of Gormenghast. That vast emptiness does not come across very well in the series, but one is left with a sense of the show's hollowness.\n\nSome of the performances are remarkable. Christopher Lee, an actor who has often appeared in materials beneath his talents, is wrapping up his peculiar career with roles as Flay in \"Gormenghast\", Saruman and \"Lord of the Rings\", and a part in the Star Wars saga; and hopefully these will be the fitting reminders of Lee when his multitudinous Dracula flicks are forgotten. Ian Richardson, while an inspired selection for Lord Groan, is a mixed blessing; while is portrayal is wonderful and he makes the best scene moving (when he and Fuchia are planning their library), when he goes away halfway through the series misses his power and presence. John Sessions, a Peake fan, plays one of the few sympathetic characters in the story with a wonderful pinache. Neve McIntosh is by turns funny and heartbreaking and Fuchia. In small parts, Steven Fry is good as Titus' teacher. Spike Milligan has an infinitesimal role as the headmaster, and while it's nice to see him it's clear he won't be doing much more: Pete and Harry are already gone, and Spike doesn't look good, nor does he contribute much. Jonathan Rhys-Meyers would probably be accepted by Peake as Steerpike, and he plays the role as if his life depended on it. Steerpike, the villain, rises to power over Lord Groan and Gormenghast like the American left: promising everything to everyone; preaching about everyone getting along, then behind the scenes quietly setting one group within the family against the other and raising the general level of paranoia until Steerpike is the only person in Gormenghast they trust.\n\nWhile the series does try to do justice to Peake, it falters. Most modern British versions of Dickens' works focus on his darker elements and forget that Dickens is very funny. At times Peake's humor is lost. Also, in the books, Gormenghast is not just a cavernous home, it's also a character. It lives and grows. Sometimes one feels that it thinks. In the series the best scenes are always the intimate ones -- like the one between Fuchia and Lord Groan, or Irma's soiree; the big scenes, where Gormenghast should feel alive make it seem less like a growing tree than a hollow one. The scenes that should be sweeping and big fall flat, and one starts pining for Ian Richardson, even in a flashback, to fill the halls of Gormenghast again with his glory.\n\nIf you're a Peake fan, it's a must-see and a keeper. If you don't know the trilogy, but enjoyed the series, you can extend Gormenghast and find much more by reading the books. In the end, though, \"Gormenghast\" is not for every taste, and is recommended for aficionados and not very inviting for the casual viewer, who probably should be exposed to new worlds of the mind like Gormenghast."
    },
    "url": "/title/tt0197154/"
}