{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Al Green",
            "url": "/name/nm0337585/"
        },
        {
            "@type": "Person",
            "name": "Willie Mitchell",
            "url": "/name/nm0593811/"
        },
        {
            "@type": "Person",
            "name": "Ken Tucker",
            "url": "/name/nm0875914/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 62,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Robert Mugge",
            "url": "/name/nm0611188/"
        }
    ],
    "datePublished": "1984-07-11",
    "description": "The story of R&B singer Al Green, who gave up a successful singing career to become a gospel minister.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Mugge",
            "url": "/name/nm0611188/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2NDU5OTczNF5BMl5BanBnXkFtZTcwNDcwNjMyMQ@@._V1_.jpg",
    "keywords": "soul music,independent film,character name in title",
    "name": "Gospel According to Al Green",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dromasca"
        },
        "dateCreated": "2011-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0163649/"
        },
        "name": "searching for his soul in gospel",
        "reviewBody": "This film is an interesting snapshot of a career that spins already for almost half a century. Born in Arkansas in 1946, Green made to himself a name since the mid-60s on the scene of soul music, which enjoyed a great success and was promoted widely, nationally in the US and internationally together with other trends (like pop, rock and folk) of the musical revolution of the 'flower power' generation.\n\nAnd then, in 1974 the change happened. A personal life incident (described by Green in the documentary film in a different version than the one recorded by other sources like the Wikipedia entry dedicated to the singer) triggered a process of returning to religion, and in only a couple of year we see Green becoming a reverend and buying his own church (this is also described in the documentary).\n\nMore and more gospel takes precedence in his records and performances. The documentary itself includes testimonies by Al Green's musical partners about his beginnings, about the road to success, and his transformation from a soul to a gospel artist. The musical parts are recorded in one of his performances at a military base, and in his own church in Memphis – and this is certainly the most interesting part, as it documents how music becomes part of the religious discourse and ceremonies, and how the word gospel truly merges and combines its two meanings.\n\nAs I said the film was made in 1984, at a time when his life was mostly dedicated to religion and as a singer he was singing only gospel. More than a quarter of century later we know however that as his career continued, Green returned to some of his non-religious songs, in a tentative to regain some of the success of his younger years.\n\nThe 1984 film catches Green at a point in his evolution, which did not follow exactly the expected track. Asked in the film how he sees his life and career 20 or 30 years later, he predicts an universal acceptance of the gospel, and him as a priest of it. It is however more to the non-religious soul music that he is still known today, while the religious fulfillment did not disappear but was pushed back more to the space of his private life.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0163649/"
}