{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tommy Lee Jones",
            "url": "/name/nm0000169/"
        },
        {
            "@type": "Person",
            "name": "Virginia Madsen",
            "url": "/name/nm0000515/"
        },
        {
            "@type": "Person",
            "name": "Colin Bruce",
            "url": "/name/nm0115448/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 968,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051520/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026347/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048667/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Fonvielle",
            "url": "/name/nm0285126/"
        }
    ],
    "datePublished": "1988-08-21",
    "description": "Eddie is a private detective. When a client asks him to help persuade his ex-wife to leave him alone, Eddie says yes. Nothing strange about that ?, well 'ex' refers to the fact that she died 10 years ago. Eddie thinks this will be...",
    "director": [
        {
            "@type": "Person",
            "name": "Lloyd Fonvielle",
            "url": "/name/nm0285126/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ2NjA2NTMwMV5BMl5BanBnXkFtZTcwMDE1MjYyMQ@@._V1_.jpg",
    "keywords": "body of dead female,nude dancing,blonde woman,ghost,private detective",
    "name": "Gotham",
    "original_info": {
        "id": "Gotham_1988",
        "name": "Gotham",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pjmyers"
        },
        "dateCreated": "2001-06-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095246/"
        },
        "name": "An unjustly-neglected American classic of the Inner Landscape.",
        "reviewBody": "What REALLY happens inside a man when he \"falls in love\"? If you want to begin to get a clue, or - better yet - if you are tearfully trying to grasp what on earth has happened to you in particular, you should see \"Gotham\" - again and again. It is an American classic of the Inner Landscape.\n\nI wonder how much idea Tommy Lee Jones and company had of just what they were enacting. Only as much as writer/producer/director, Lloyd Fonvielle, was able or willing to tell them. Siskel & Ebert, etc., totally missed the point. Why? Because people in our culture are not prepared for a movie whose plot/premise barely holds together as a tale of what occurs in the world but which, as an inner story (dream- or myth-like), works quite beautifully. (In that sense the movie's plot is rather like our lives!)\n\nYour enjoyment/comprehension of this movie will be much enhanced if you have at least some familiarity with the Jungian Anima (I mean conceptually - we men all do experientally, although depressingly few know much about, or acknowledge, Her!). If you don't, I don't want to put you off. It will do quite nicely if a woman's image has - in whatever way - just devastated you, or some man you know, inside. I've never seen a movie where this is so graphically depicted. The decline and Fall. \"How will I find you?\" Eddie quaveringly asks. \"Don't worry,\" she wryly replies, \"I'll find YOU.\" Oh, yes.\n\nThis movie is incredibly rich in symbols and insight, and really repays multiple viewings. Even if you don't understand why Eddie's name is Mallard; why Rachel's face has suddenly become chalky white as she turns and emits her spine-chilling anger when challenged by Eddie on a matter of historical accuracy; the Doorman; why it is death to \"sleep with a ghost\"; what the pirate's sword is all about (re-read your Tristan & Isolde, the chapel); why She MUST emerge from the mist, at the brazier, to warn Eddie not to embark on his own destruction, before herself taking the executive role in bringing it about (\"I've KILLED you, Eddieand I'm GLAD I did!\"); the role of the psychic detective (that's you - or could be); the splitting of the male psyche into Charlie and Eddie, as separate disastrous approaches to Her; the jewels (and this IS pretty murky!); the themes of watery immersion, pugilism, paganism vs Christianity, etc., EVEN THENsomething will scratch at you as watch this movie.\n\nAs you can probably tell, I'd love to bend your ears with a full-scale analysis, but the 1000 word limit protects you from people like me! Feel free to e-mail me if you want to talk about Gotham, I never found anyone on my wavelength (what a shock)."
    },
    "url": "/title/tt0095246/"
}