{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Greta Garbo",
            "url": "/name/nm0001256/"
        },
        {
            "@type": "Person",
            "name": "John Barrymore",
            "url": "/name/nm0000858/"
        },
        {
            "@type": "Person",
            "name": "Joan Crawford",
            "url": "/name/nm0001076/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20008,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043612/"
        },
        {
            "@type": "Person",
            "name": "Vicki Baum",
            "url": "/name/nm0062139/"
        },
        {
            "@type": "Person",
            "name": "William Absalom Drake",
            "url": "/name/nm0237033/"
        },
        {
            "@type": "Person",
            "name": "Béla Balázs",
            "url": "/name/nm0049462/"
        }
    ],
    "datePublished": "1932-09-11",
    "description": "A group of very different individuals staying at a luxurious hotel in Berlin deal with each of their respective dramas.",
    "director": [
        {
            "@type": "Person",
            "name": "Edmund Goulding",
            "url": "/name/nm0332539/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxNDc4MDcwNF5BMl5BanBnXkFtZTgwNzY0MjUzMjE@._V1_.jpg",
    "keywords": "baron,hotel,pocketbook,pearl necklace,gambling",
    "name": "Grand Hotel",
    "original_info": {
        "id": "Grand Hotel_1932",
        "name": "Grand Hotel",
        "year": "1932"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lugonian"
        },
        "dateCreated": "2003-02-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0022958/"
        },
        "name": "Hotel Berlin",
        "reviewBody": "GRAND HOTEL (Metro-Goldwyn-Mayer, 1932), directed by Edmund Goulding, from the stage production by Vicki Baum, marks one of MGM's most prestigious projects. Other than being one of those rare films from the 1930s to be frequently revived, if not overplayed, on television over the past decades, it has stood the test of time solely due its impressive all-star cast. Of the five major leading actors, feature billing goes to Greta Garbo, MGM's most important box-office star to date. Unlike other Garbo films, GRAND HOTEL, is not all Garbo. She shares screen time with other top-named MGM performers, ranging from John and Lionel Barrymore, Wallace Beery and Lewis Stone. The only other major actress to appear in this production is the youthful and down-to-earth Joan Crawford, who, in fact, is on screen more than the legendary Garbo. While many might consider Crawford the best of the two female stars, Garbo, who's acting style is somewhat different from the others, should be observed and studied. Her role as Grusinskaya, the Russian ballerina, is performed two ways, that of a lonely, depressed dancer striving for success, then, after encountering the Baron (John Barrymore), becomes full of joy and laughter. Watching this transformation on screen is like seeing the two sides of Garbo.\n\nEdmund Goulding directs this 113 minute drama at a fast-pace, starting its opening with overhead camera shots of numerous switchboard operators connecting the incoming calls, followed by the brief introduction of the central characters conversing on the telephone in the hotel lobby: Senf (Jean Hersholt), the head hotel clerk, awaits the news of his wife who is about to give birth to their child; Otto Kringelein (Lionel Barrymore), a bookkeeper, diagnosed with an incurable disease who quits his job to enjoy his remaining days to the fullest; Preysing (Wallace Beery), a no-nonsense industrialist staying at the hotel to negotiate a business deal with important clients; Suzette (Rafaella Ottiano), the maid to the famous Russian dancer, Grusinskaya, who expresses concern about her employer; Baron Felix Von Greigern (John Barrymore), an adventurer traveling with his Dachshund dog, desperately in need of money to pay off a heavy debt, planning his latest robbery by stealing valuable jewels from the famous ballerina; and Otternschlag (Lewis Stone), a scarred doctor who walks about the hotel lobby, observing the goings on, and reciting to himself quietly, \"Grand Hotel, people come, people go, and NOTHING ever happens!\" \n\nThings start to happen as Flaemmchen (Joan Crawford), a stenographer with ambition, is hired by Preysing as his personal secretary. She soon makes the acquaintance of the handsome Baron and the poorly dressed Kringelein. Later that evening, after the lonely and unhappy Grusinskaya (Greta Garbo) leaves the hotel for the theater, the Baron sneaks into her room from the outside window to rob her. After she returns, the Baron, still there, hides himself, only to take notice that Grusinskaya, unhappy, intends on taking her own life. He suddenly appears, telling her he's one of her biggest admirers. In spite of telling the Baron that she wants to be alone, the Baron remains and confesses everything. How will the Baron be able to get money he so desperately needs? As for the other guests, will Preysing, a married man with two grown daughters who has made Flaemmchen his mistress after working hours, succeed with his business negotiations? Will Flaemmchen continue to get something out of life by not being particular on how she does it? Will Grusinskaya marry her beloved jewel thief Baron or will she go on with her career? Will Kringelein find the happiness he deserves before he succumbs? What will his hotel bill be after checking out from most expensive hotel in Germany? Will that kill him before his illness does?\n\nWhile GRAND HOTEL could have told its stories in separate installments, it's done as one film focusing on separate characters through different time frames. Of the central characters, only Senf, the hotel clerk (Hersholt) is the least important, appearing only in a few scenes unrelated to the plot. Lewis Stone's role is also secondary, but memorable, especially with his opening and closing lines. Wallace Berry, is cast against type, sporting glasses, a short haircut, mustache and the only American actor speaking with a German accent. Lionel Barrymore, sporting a derby, over-sized clothing, thick mustache and glasses, is almost unrecognizable as Kringelein. In fact, he almost comes off best over all the major actors. Although playing a tragic figure, he does have a classic drunken comedy bit, along with a poignant scene where, after winning a large sum of money playing cards, discovers that his wallet containing all his money, is missing.\n\nFortunately, GRAND HOTEL does not play like a filmed stage play. The art deco and luxurious sets are a sight to behold. And why not? The Grand Hotel happens to be the most expensive and luxurious hotel in Berlin. GRAND HOTEL obviously registered well upon its release. It won the Academy Award as Best Picture of 1931/32. In later years, GRAND HOTEL has become imitated and spoofed many times. MGM remade GRAND HOTEL as WEEKEND AT THE WALDORF (1945), modernizing the story to contemporary New York City with World War II background, featuring its top marquee names of the day: Ginger Rogers, Lana Turner, Walter Pidgeon and Van Johnson. It was later adapted into a Broadway musical in the 1990s. Both screen versions are available on video cassette, DVD and Turner Classic Movies cable television. For a good time with a film classic, check in the GRAND HOTEL and see what the stars are doing for the weekend. (****)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this black and white classic drama",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3953263897",
        "name": "Grand Hotel",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTUxNTRiYWMtMTNiZi00OWRmLTk3M2EtZGM1YTA5MzhiNTRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTUxNTRiYWMtMTNiZi00OWRmLTk3M2EtZGM1YTA5MzhiNTRhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-30T04:14:32Z",
        "url": "https://www.imdb.com/video/vi3953263897/"
    },
    "url": "/title/tt0022958/"
}