{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel T. Majetich",
            "url": "/name/nm0538098/"
        },
        {
            "@type": "Person",
            "name": "Coby Jordan",
            "url": "/name/nm0429890/"
        },
        {
            "@type": "Person",
            "name": "Bruce Simballa",
            "url": "/name/nm0799373/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 267,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048902/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142999/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005144/"
        },
        {
            "@type": "Person",
            "name": "Kieth Merrill",
            "url": "/name/nm0581303/"
        }
    ],
    "datePublished": "1984-06-16",
    "description": "Follow the scientific expedition of John Wesley Powell who mapped the canyon and boated the Colorado River rapids into modern times.",
    "director": [
        {
            "@type": "Person",
            "name": "Kieth Merrill",
            "url": "/name/nm0581303/"
        }
    ],
    "duration": "PT59M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIyOTU5MDY4NF5BMl5BanBnXkFtZTcwNDkxNDMyMQ@@._V1_.jpg",
    "keywords": "boat,arizona desert,arizona,river rapids,grand canyon",
    "name": "Grand Canyon: The Hidden Secrets",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zeebya"
        },
        "dateCreated": "2007-08-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087355/"
        },
        "name": "Grand Canyon: The Hidden Secrets",
        "reviewBody": "Some people have expressed disappointment that the IMAX film, Grand Canyon: The Hidden Secrets, did little to feature geology. As a geology buff myself, I can understand. But, there are geology discussions about the canyon all over the place. There is not so much discussion about the human history of Grand Canyon. And that's what this film attempts to serve up: the human history of Grand Canyon. And it does it in a manner that is visually stunning, emotionally compelling, and thoroughly memorable. And the narration, though somewhat Biblical, nevertheless fits the grandeur of the film perfectly: \"There is no time here. Only the endless cycles of life chronicle the passing millenia. Man passes... in a whisper, a mere breath at the edge of eternity. Some live. Some die. Some... just disappear. Some will live forever, and speak in muted silence from the dust.\"\n\nOf course, maybe I'm prejudiced: I have seen the film on screen, literally, more than 500 times. I used to operate the IMAX Theater at Los Angeles's Exposition Park.\n\nThe film does educate, as well as entertain, and it will show you the canyon in a way most of us will never get to see. It stands as well today as it did when it first came out in the mid-1980's. This film, like the canyon it celebrates, is truly timeless.\n\nBut, having said the above, I must offer a strong criticism: I have two versions of the film: the VHS version, which is the same as the original theatrical release, and the newer DVD version put out by National Geographic's IMAX Theater at Grand Canyon. I don't know if Destination Cinema (the film's producer) had any say in this or not, but apparently after Geographic got a hold of it, the film was re-edited, re-narrated, and re-scored. In some respects, it was \"sanitized\" and made to reflect current trends of Political Correctness in a way that is both damaging to the work of art that was the original film, and also dishonoring to the intent of both the filmmakers and the people who really lived the stories we see re-enacted. And, unfortunately, the re-scored music is a pale shadow of the original soundtrack recorded by the London Philharmonic Orchestra. There are several dialogue cuts that are simply unacceptable. For example, in the original, Powell's journal is quoted at a point of reflection and fear about their journey, as he writes: \"Tomorrow we start our way down the great unknown. We have an unknown distance to run, an unknown river to explore. It is with anxiety and misgiving we enter the canyon below. What falls there be, we know not. What walls beset the canyon, we know not. What rapids or dangers, or treacherous disaster awaits us, we know not. But press on.... God willing.\" Well, in the re-edit, they cut out the line \"God willing.\" Now, I know that today's PC people are afraid to mention God in anything, but C'MON! This was a VERY important sentiment for men in the era of the 1860's. How dare anyone remove or sanitize such a line just to appease some PC loudmouths out there because they don't like it? These men, when they set off into that dark gorge, as far as they were concerned, literally were placing their lives and their fate in the hands of God, and we dishonor them and their deeds when we allow revisionists to change their words and feelings. Same thing when speaking of the ancient Anasazi; there's a line they cut... \"Did they not live, and love, and laugh as we?\" Why cut such a thoughtful line? On a more positive note, there is a scene replacement that improves the film. The silly \"Mud Monster\" scene was replaced with a much more interesting scene involving a mountain man's close encounter with a mountain lion! Excellent scene.\n\nNormally when movies are transferred to DVD, they usually add better stuff to round-out the package. They do have a nice, in-depth behind the scenes feature on the making of the film, but that's about it. Overall I must say, the original was great, but with the DVD they blew it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from SlingShot Entertainment",
        "duration": "PT3M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3752460569",
        "name": "Grand Canyon: The Hidden Secrets",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWYyZGEwNzgtMzU5Yy00Y2E3LThjMTctNmI3MTgyMGVlMDg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWYyZGEwNzgtMzU5Yy00Y2E3LThjMTctNmI3MTgyMGVlMDg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:18:59Z",
        "url": "https://www.imdb.com/video/vi3752460569/"
    },
    "url": "/title/tt0087355/"
}