{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Grégori Baquet",
            "url": "/name/nm0052702/"
        },
        {
            "@type": "Person",
            "name": "Alice Taglioni",
            "url": "/name/nm0998117/"
        },
        {
            "@type": "Person",
            "name": "Jocelyn Quivrin",
            "url": "/name/nm0704474/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2344,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065310/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086539/"
        },
        {
            "@type": "Person",
            "name": "Robert Salis",
            "url": "/name/nm0758431/"
        },
        {
            "@type": "Person",
            "name": "Jean-Marie Besset",
            "url": "/name/nm0078811/"
        }
    ],
    "datePublished": "2004-02-04",
    "description": "Paul and Agnes have been going out for quite a while and Agnes is shocked to learn that he'd rather live with two roommates on campus than move in with her. As soon as he meets one of his roommates, Louis-Anault, Paul's behavior c...",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Salis",
            "url": "/name/nm0758431/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0NzQ4NTQ4N15BMl5BanBnXkFtZTcwNDUwOTYyMQ@@._V1_.jpg",
    "keywords": "shower,male full frontal nudity,gay,gay love,female nudity",
    "name": "Grande école",
    "original_info": {
        "id": "Grande Ecole_2004",
        "name": "Grande Ecole",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tevanson"
        },
        "dateCreated": "2004-10-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0340137/"
        },
        "name": "A literary, existential crisis of the soul...and confusing, too!",
        "reviewBody": "\"Grand ecole\" aspires to be the sort of existential drama that the French New Wave directors produced in the 1950s and 1960. It pours race, class, economic status, history and sexuality into a big martini shaker and pours out a heady concoction.\n\nBut just what the film is, in the end, is not clear at all.\n\nPaul is the hunky son of a Marseilles contractor. Raised to be brilliant but also racist (snubbing Arabs) and classist (snubbing blue-collar workers and the poor), Paul is sent to an elite Parisian economics college where he is supposed to learn about management and marketing. But Paul isn't his father's son. He's artistically-minded (which should be your first clue about his inner life) and rejects his father's biases. Soon, Paul has taken up with Agnes, a young woman who is attending the liberal-arts university next door and who is an avid supporter of human rights.\n\nOne of Paul's roommates is Louis-Arnault, a hunky business major with a penchant for water polo (he comes from a legendarily wealthy background) and girls. The other is the materialistic, shallow, rich boy, Chouquet.\n\nPaul has a stunning girlfriend, the beautiful Emeline, who also attends the school of economics. While Louis-Arnault's and Emeline's relationship seems stable and loving, Paul's relationship with Agnes seems a bit rockier. Paul loves Agnes, but is a little emotionally and physically withdrawn from her.\n\nIt's not long before Paul develops an intense homosexual crush on the handsome, athletic Louis-Arnault -- even going so far as to steal his boxers! Then the handsome Arabian blue-collar worker, Mecir, arrives on campus as part of the construction crew renovating buildings on the school grounds. Paul is equally attracted to Mecir.\n\nAgnes is no dummy: She senses Paul's ambivalence and proposes a test. If Paul seduces Louis-Arnault first, Agnes will leave and never say a word. If Agnes seduces Louis-Arnault first, then Paul must give up his homosexual longings and be exclusively heterosexual and monogamous with her.\n\nThe great problem with the film is that it is not entirely clear why Agnes would suggest such a thing. For his part, Paul never agrees to Agnes' plan -- so just what does Agnes think she is doing?\n\nAfter the first hour, Chouquet drops completely out of the picture -- which is frustrating. Mecir figures more and more prominently in Paul's sex life and emotions. But just as the viewer expects religion to become an issue (Mecir is clearly a practicing Muslim), it doesn't.\n\nMuch more satisfying is the film's extensive commentary on the emotional desert that is capitalism, greed and materialism. There is a tremendously important and well-written discussion during the film's climax that is a real wonder. The grand ideas fly fast and furious, and the writing and acting is pure gold there.\n\nFor the most part, however, the film's sexual themes -- which are ostensibly it's raison d'etre -- are muddy. The film's commentaries on race, class, materialism and the burden of history are much clearer and more satisfying.\n\nOverall, the quality of the acting is rather good. Salim Kechiouche is superb, and Gregori Baquet has his moments. Also rising above the fray is Alice Taglioni, who is subtle and powerful as the put-upon Agnes.\n\nThe direction, cinematography and editing are nothing to write home about.\n\nBut \"Grand ecole\" is worth the effort, even if it is ultimately an exercise in frustration."
    },
    "url": "/title/tt0340137/"
}