{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Albert Henderson",
            "url": "/name/nm0376318/"
        },
        {
            "@type": "Person",
            "name": "Michael Sullivan",
            "url": "/name/nm1511554/"
        },
        {
            "@type": "Person",
            "name": "Luana Anders",
            "url": "/name/nm0026035/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1138,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026658/"
        },
        {
            "@type": "Person",
            "name": "Robert Downey Sr.",
            "url": "/name/nm0002049/"
        }
    ],
    "datePublished": "1973-11-08",
    "description": "A strange man named Jesse who can revive life and walk on water comes into a surreal and cruel western town.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Downey Sr.",
            "url": "/name/nm0002049/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYzMjAzOTQ4OF5BMl5BanBnXkFtZTcwNDgwOTcxMQ@@._V1_.jpg",
    "keywords": "acid western,constipation,explosion,father daughter relationship,father son relationship",
    "name": "Greaser's Palace",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kate-84"
        },
        "dateCreated": "1999-06-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068659/"
        },
        "name": "Robert Downey's savagely funny take on the passion and death of Christ is original and thought provoking.",
        "reviewBody": "Jesus comes back to the old west as a 1930's song-and-dance man in a zoot suit and takes on local strongman Mr. Greaser, whose struggles with constipation are painful to witness. I love this film. It will never be selected as entertainment for anyone's church youth group, but its fresh take on Christianity make for a wild and very original ride.\n\nFavorite moments: Lamey Homo protesting his dad, Mr. Greaser's, disciplinary methods, \"I dreamed I was swimmin' in a rainbow and there was millions of babies and they was naked...Dad? I don't want to die any more.\" Dad's response: \"Then behave yourself!\" Sibling rivalry on the part of the Holy Ghost protesting God the Father's refusal to let him take on some of God the Son's perks (like being crucified): \"You'll never know what I can do because you never give me a chance!\" Jesus healing the paralyzed man, who is seen later in the film crying, \"I can crawl again! I can crawl again!\"\n\nIt took me a moment to identify which character was supposed to be Judas, until the woman settler, who goes through so many terrible disasters, began counting out thirty pieces of silverware.\n\nIt is somewhat disjointed, and definitely sacrilegious in spots, but those drawbacks are very minor. This is an original, savagely funny film."
    },
    "url": "/title/tt0068659/"
}