{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Douglas Booth",
            "url": "/name/nm3150488/"
        },
        {
            "@type": "Person",
            "name": "Jack Roth",
            "url": "/name/nm2516193/"
        },
        {
            "@type": "Person",
            "name": "Ray Winstone",
            "url": "/name/nm0935653/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7914,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003548/"
        }
    ],
    "datePublished": "2012-04-01",
    "description": "The orphan Pip becomes a gentleman when his life is transformed by a mystery benefactor.",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTRkYjAyNmEtMzdjMC00MjRhLWJkYjItNTU5OWNlNjc4ODk3XkEyXkFqcGdeQXVyMzA5NjkwNDM@._V1_.jpg",
    "keywords": "pip character,magwitch character,miss havisham character,estella character,herbert pocket character",
    "name": "Great Expectations",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Lejink"
        },
        "dateCreated": "2012-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1949720/"
        },
        "name": "Good \"Great Expectations\".",
        "reviewBody": "The last BBC Dickens' dramatisation broke \"Bleak House\" down into half-hour soap-opera size elements for easy digestion and to sort of tie-in with the original publication of the story in instalments, but here the format reverted to the more traditional one-hour episodes shown over three consecutive nights.You pays your money and while I welcomed the 30 minute novelty was happy this time to sit for longer and take in the master's story over a shorter period.\n\nThere have been so many previous adaptations that any new production has to offer something different, particularly in the scenes meant to grab the viewer's attention, like Pip's first meeting with Magwich and his first visit to Miss Havisham's mausoleum of a house. Both are done very well, particularly Ray Winstone's Magwich rising from the depths of the marshland to confront the terrified youngster while the set-dressing for Satis House certainly conveys the requisite decay and obsolescence of the dwelling-place of its jilted, cold-hearted owner.\n\nIt's really only necessary to film the story here to succeed, so great is the narrative Dickens provides, with his adeptness at furnishing a circular story-line, where nothing and no-one is missed out in the resolution as everyone gets more or less their just desserts. Nevertheless the story-telling is enhanced with excellent performances by its big names, Winstone and Gillian Anderson (who was also in \"Bleak House\"), although the production is less starry than \"Bleak House\", with only David Suchet as the very correct Jaggers perhaps claiming marquee status. That said the rest of the cast are mostly excellent, playing their well-known characters with aplomb, particularly the portrayals of Pip's shrewish sister, redoubtable Joe Gargery and loyal Herbert Pocket. However I sensed some weakness in the casting of the adult Pip and Estella, the former not imposing enough (in fact I preferred the acting of the young Pip), the latter not glacial or even beautiful enough, but they don't fatally wing the story.\n\nThe cinematography is superb, utilising washed-out, almost monochromatic shots to suggest the bleakness of the Dartford Moors and the Thames at the conclusion, while the depiction of the London Gentleman's Clubs as well as the afore-mentioned Satis House are superbly realised. There are many memorable scenes, with Gillian Anderson's inevitable self-immolation perhaps staying longest in the memory. My only other carp would be the occasional \"modern\" vulgarisation of aspects of the story, for example Drummle's taking Pip to a brothel, as if this wonderful story needs \"sexing-up\" in some way, which of course it doesn't.\n\nNevertheless with the promise of a new version of \"Edwin Drood\" to come, this was a very good and occasionally memorable version of a classic story.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Great Expectations",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2110104601",
        "name": "Great Expectations",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmFmZjllNGUtNjIyNC00ZTFkLTkwNGYtMWRmOGE2YTcwYmYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmFmZjllNGUtNjIyNC00ZTFkLTkwNGYtMWRmOGE2YTcwYmYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-09-19T03:17:56Z",
        "url": "https://www.imdb.com/video/vi2110104601/"
    },
    "url": "/title/tt1949720/"
}