{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Mills",
            "url": "/name/nm0590055/"
        },
        {
            "@type": "Person",
            "name": "Valerie Hobson",
            "url": "/name/nm0387753/"
        },
        {
            "@type": "Person",
            "name": "Tony Wager",
            "url": "/name/nm0905697/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25211,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0113550/"
        },
        {
            "@type": "Person",
            "name": "Charles Dickens",
            "url": "/name/nm0002042/"
        },
        {
            "@type": "Person",
            "name": "David Lean",
            "url": "/name/nm0000180/"
        },
        {
            "@type": "Person",
            "name": "Ronald Neame",
            "url": "/name/nm0623768/"
        }
    ],
    "datePublished": "1947-05-22",
    "description": "A humble orphan boy in 1810s Kent is given the opportunity to go to London and become a gentleman, with the help of an unknown benefactor.",
    "director": [
        {
            "@type": "Person",
            "name": "David Lean",
            "url": "/name/nm0000180/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Adventure",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjA1YTQ1NGItZDI0OS00MTFiLTg1NTUtOWViMTg0ZDA4MWMyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "benefactor,orphan,snob,convict,lawyer",
    "name": "Great Expectations",
    "original_info": {
        "id": "Great Expectations_1946",
        "name": "Great Expectations",
        "year": "1946"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Snow Leopard"
        },
        "dateCreated": "2002-05-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038574/"
        },
        "name": "An Excellent Version of the Classic Novel",
        "reviewBody": "Few directors have ever matched David Lean's ability to bring great literary works to life on film, and this is one of his best productions. The Dickens novel itself is so good that even routine film adaptations of it are usually quite watchable, but this version is exceptional, with atmosphere, settings, photography, and characters that do full justice to the original. From the very beginning, with a wonderful realization of the graveyard scene, you are drawn into the world of Pip and the other characters, and feel that you can understand their concerns and dilemmas.\n\nOne of the things that makes \"Great Expectations\" such a classic story is that it adds some real depth to Dickens's usual slightly exaggerated characters, so that they are both memorable and thought-provoking. Characters such as Miss Havisham and Magwitch are interesting in their own right, besides serving as vital influences on Pip's life. Here the fine cast and directing help to realize the potential of the characters, making for an interesting story that also has some things to say. John Mills brings out Pip's innocence and earnestness very believably, and the supporting cast works quite well too. Some of them seem to be almost exactly what Dickens would have envisioned, such as Jean Simmons as the young Estella and Francis Sullivan as Jaggers (a role he also played in an earlier version).\n\nThis is exactly what a film version of a classic book should be, keeping the most important themes and events from the story and using the visuals to bring its world to life. It's an excellent movie that is enjoyable and nicely done in every respect."
    },
    "url": "/title/tt0038574/"
}