{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joey Wang",
            "url": "/name/nm0939153/"
        },
        {
            "@type": "Person",
            "name": "Maggie Cheung",
            "url": "/name/nm0001041/"
        },
        {
            "@type": "Person",
            "name": "Wenzhuo Zhao",
            "url": "/name/nm0158414/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3324,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "Green Snake",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000295/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006356/"
        },
        {
            "@type": "Person",
            "name": "Pik-Wah Lee",
            "url": "/name/nm0497762/"
        },
        {
            "@type": "Person",
            "name": "Hark Tsui",
            "url": "/name/nm0007139/"
        }
    ],
    "datePublished": "1993-11-04",
    "description": "Two snake spirits become human and learn about love and suffering. A monk discovers his own weaknesses and finds that morality is not as simple as he had thought.",
    "director": [
        {
            "@type": "Person",
            "name": "Hark Tsui",
            "url": "/name/nm0007139/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjNhYjVhYTMtOWVlMC00YzAwLWE0Y2QtYjkxYTJlOGNlMmRmXkEyXkFqcGdeQXVyMTAxNDM2MTcz._V1_.jpg",
    "keywords": "snake,monk,snake woman,love,baby",
    "name": "Ching se",
    "original_info": {
        "id": "Green Snake_1993",
        "name": "Green Snake",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vid-10"
        },
        "dateCreated": "2004-06-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106559/"
        },
        "name": "More of a movie, it's a dream",
        "reviewBody": "Two snakes that evolved into women, a tibetan priest, a teacher of poetry and a wonderful frame made up of peach blossom petals, lotus flowers and lanterns lit at night on the river are the ingredients that make \"Green Snake\" a dream-like movie. The story, slow compared to Tsui Hark standards, flows through two paths: on the first one (lighthearted, playful and with a touch of irony which is never unwelcome) we get to enjoy the life of two snake-girls (White Snake, played by Joey Wang, and Green Snake, played by Maggie cheung) who, by stumbling into a village and alluring every one, cause a lot of turmoil among the people's hearts. White Snake, having trained much more than Green Snake and thus having acquired human feelings, actually succeeds in winning the love of the poetry teacher. On another scenario, the tibetan priest lives in a nearby temple, meditating, trying to gain spiritual ascension, helping people whenever they are in trouble and in general doing his best to preserve the natural balance of the world. However, not everything is like it seems at first glance: while the two snake-girls actually show some positive will and determination as they tend sick people, the priest, although he stops tidal waves from flooding the village, never goes down to experiencing the condition of people... and, by acting as judge, risks of falling into the trap of self-esteem and prejudice. Apart from the thoughtfulness it inspires, the movie is unique in fantasy and never ceases to wonder, regardless if it's autumn, winter or spring! 10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0106559/"
}