{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Donald Crisp",
            "url": "/name/nm0187981/"
        },
        {
            "@type": "Person",
            "name": "Laurence Naismith",
            "url": "/name/nm0619802/"
        },
        {
            "@type": "Person",
            "name": "Alex Mackenzie",
            "url": "/name/nm0533260/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1713,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098836/"
        },
        {
            "@type": "Person",
            "name": "Robert Westerby",
            "url": "/name/nm0922589/"
        },
        {
            "@type": "Person",
            "name": "Eleanor Atkinson",
            "url": "/name/nm0040712/"
        }
    ],
    "datePublished": "1961-07-17",
    "description": "The remarkable veritable story of a terrier named Bobby and the enduring friendship he forges with a tenderhearted shepherd known simply as Old Jock---unbroken even by the kindly old man's death.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Chaffey",
            "url": "/name/nm0149548/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzhmNDcwZjYtYWU0My00NzA4LWJjNDEtMWJiODc2NTc3ZTIxXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "animal character name as title,eight word title,shepherd,master,dog",
    "name": "Greyfriars Bobby: The True Story of a Dog",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Atreyu_II"
        },
        "dateCreated": "2011-01-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054944/"
        },
        "name": "One of the best examples of dogs's incredible loyalty",
        "reviewBody": "This Disney oldie was directed by Don Chaffey, the same who directed \"The Three Lives of Thomasina\" and \"Pete's Dragon\" and, like the famous story of Hachiko, is based in a true story, in this case of a Skye Terrier named Greyfriars Bobby that lived in the 19th century (in Edinburgh, Scotland) and became famous for reportedly spending 14 years guarding the grave of his owner until his own death.\n\nIn the film (I'm not sure how it was in real life) Greyfrairs Bobby, despite guarding his owner's grave, doesn't spend the whole time there waiting for him to come back. People feed him well and he gets along beautifully with most everyone, especially children.\n\nThe film was shot in England and Scotland. Its looks very dated but rich cinematography is one of its virtues, thanks to the enchantment and natural beauty of the Scottish scenario.\n\nI noticed that they often use the expressions \"laddie\" and \"lassie\", which are often used by Jock the Scottish Terrier in 'Lady and the Tramp'.\n\nConsidering their roles, most actors are alright. But the star is definitely the little great star. Now, who can that be? That's the doggy, of course!\n\nThe dog is cute and utterly adorable. His loyalty to his owner in life and even long after death is worthy to be considered and admired. Despite being a dramatic film it has some fun moments. The children of the film are all nice and enjoyable.\n\nOverall, a reasonable film, realistic, poignant. Its only let-down is the courtroom scenes and the rather annoying policeman who looked like a caricature of himself.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0054944/"
}