{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chris Ferreira",
            "url": "/name/nm0274298/"
        },
        {
            "@type": "Person",
            "name": "Mackenzie Firgens",
            "url": "/name/nm0278673/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Sun",
            "url": "/name/nm0838938/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4423,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067905/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039900/"
        },
        {
            "@type": "Person",
            "name": "Greg Harrison",
            "url": "/name/nm0365615/"
        }
    ],
    "datePublished": "2000-10-19",
    "description": "An inside look into one night in the San Francisco underground rave scene.",
    "director": [
        {
            "@type": "Person",
            "name": "Greg Harrison",
            "url": "/name/nm0365615/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjk1YTlhZjYtOThjMC00NTAxLTg4MWItNjFiNTExYjdlNDcxXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_.jpg",
    "keywords": "boyfriend boyfriend relationship,gay kiss,bisexual,raver,rave",
    "name": "Groove",
    "original_info": {
        "id": "Groove_2000",
        "name": "Groove",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "edwie"
        },
        "dateCreated": "2004-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0212974/"
        },
        "name": "Not outstanding, but definitely good",
        "reviewBody": "I watched this movie because of a trailer I watched on HBO. Never heard of it before, but it seemed interesting.\n\nPoint is, I loved it to the point of even recording it and recommending it to my friends. I was in the rave scene during the mid 90's, when the likes of Scooter, Faithless, Robert Miles, Mark 'Oh and many others were at their peak.\n\nI truly enjoyed this movie and felt I was there the whole night. This movie is definitely not meant for anyone, much less for those who still don't understand what indie films are about. This was certainly not Arakki or Aranofsky, but I have to commend director Greg Harrison for this piece of work.\n\nThis movie starts with the sound of a modem connecting to the internet... sooooo 1998! It was funny. Then you see all these fast stories about weirdos and their lives.\n\nThe plot was definitely secondary in this movie. I could not care less about Leyla, or Colin, or whoever... But I guess that wasn't exactly the point.\n\nAlthough the party was somewhat different from what I used to go to, its structure was basically the same: Clandestine party, where you need maps and bribe a few guys to know exactly where you're going; the different levels of music throughout the night, from slow-beat clubhouse to orgasmic trance; the amount of drugs, the doped people, the escape from it all.\n\nThere were pointless scenes, like those gay guys trying to get to the party (there was already a gay moment between Colin and that masseuse guy.. poor Harmony!). I recognized Rachel True, the gorgeous girl from \"The Craft\", I had no idea she was on this.\n\nI agree with the one who commented that John Digweed would never play in a party like this.. Actually I laughed when he made his cameo... So what was next? Tiesto? Johan Gielen? Paul Oakenfold?\n\nThis movie was also a reflect of how these parties were about 5-10 years ago. Yes, the electronic scene has become much more commercial, specially in Holland and Belgium. I guess that it's not so special to me anymore, now that virtually everyone has discovered it.\n\nAnd yes, once the party got busted, there's no way they would have gotten away with starting it again!\n\nWhen the party is over, the movie is over, leaving the viewer with the SAME FEELING most ravers had when leaving... \"Now what?\" After an amazing night of \"everything\", you have to realize that it's all over and life must goes on... at least for most of us."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1454047513",
        "name": "Groove",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWU4OTFhYzYtMTYzNi00MmEyLWJhOTgtZTMzZDI2MDVjNGRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWU4OTFhYzYtMTYzNi00MmEyLWJhOTgtZTMzZDI2MDVjNGRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:20:26Z",
        "url": "https://www.imdb.com/video/vi1454047513/"
    },
    "url": "/title/tt0212974/"
}