{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Takashi Sorimachi",
            "url": "/name/nm0815043/"
        },
        {
            "@type": "Person",
            "name": "Nanako Matsushima",
            "url": "/name/nm0559652/"
        },
        {
            "@type": "Person",
            "name": "Shun Oguri",
            "url": "/name/nm1040419/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3807,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055529/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017398/"
        }
    ],
    "datePublished": "1998-07-07",
    "description": "Onizuka, a former delinquent finds himself in the role of a high school teacher, facing students who behave just as he used to. Using unusual methods, he manages to reach through to his students and help them with their problems.",
    "genre": [
        "Drama",
        "Comedy",
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWQ2NDg0ZTgtODZmMS00YzRhLTlkNjktYWQ0OWEwNjNmZTcyXkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "live action remake of anime,teacher student relationship,love,friendship,high school",
    "name": "GTO: Great Teacher Onizuka",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "huj"
        },
        "dateCreated": "2001-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0209631/"
        },
        "name": "GTO is as original as the manga series.",
        "reviewBody": "I was sort of a sceptic when I first heard of this show. The manga series is highly entertaining and full of surprises I was wondering if the TV series can deliver the same punch. And Yes it did. Onizuka, the main character himself, is same kind of badass as he is in the manga, oh, the bilingual (English) version is available for those who are learning Japanese and vice versa.\n\nI will have to say that the TV series is very original. I was hoping that it would follow the manga story line but it didn't, which is a good thing in my opinion, because after the 1st episode, I left my manga aside and I was able to cast away my expectations.\n\nEveryone episode has a point, or moral value that which Onizuka was able to stir up in people's heart. A value in all of us once but long forgotten. But Onizuka, being contrary to societal norm, was able to prevail and bring people back to who they are, via, of course, unconventional means of course. I can not recommend this series enough. But if Japanese is not your first language and you are not fluent in Chinese characters, I then recommend the manga. Watch it, or read it, you won't be disappointed."
    },
    "url": "/title/tt0209631/"
}