{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Russ Little",
            "url": "/name/nm1508059/"
        },
        {
            "@type": "Person",
            "name": "Michael Bortin",
            "url": "/name/nm1507619/"
        },
        {
            "@type": "Person",
            "name": "Timothy Findley",
            "url": "/name/nm2332748/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 458,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0085230/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        }
    ],
    "datePublished": "2005-05-23",
    "description": "A documentary on the curious American domestic terrorist group, infamous for the 1974 kidnapping of Patty Hearst.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Stone",
            "url": "/name/nm0832134/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQwOTczODg0M15BMl5BanBnXkFtZTYwMTE3MDg2._V1_.jpg",
    "keywords": "terrorist,symbionese liberation army,terrorist group,kidnapping,hostage",
    "name": "Guerrilla: The Taking of Patty Hearst",
    "original_info": {
        "id": "Guerrilla: The Taking of Patty Hearst_2004",
        "name": "Guerrilla: The Taking of Patty Hearst",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jarrod76"
        },
        "dateCreated": "2004-07-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0390299/"
        },
        "name": "Fascinating Insight",
        "reviewBody": "I guess enough time has passed that the strange and fascinating case of Patricia Hearst can be looked at from a safe distance; although the recent post 9/11 interest in terrorism puts the Symbionese Liberation Army and their actions into a whole different context.\n\nThis documentary mixes news footage, photographs, tapes recordings and interviews with figures associated with the SLA and the kidnapping of Patty Hearst - yet it has to be said that most of these are marginal figures. Given that most SLA members are now dead, this is unavoidable. The real coup would have been scoring interviews with surviving members Bill and Emily Harris or Hearst herself - although her lack of participation is quite understandable given that her version of the case is already well documented.\n\nThe film comes ready-made with the gripping narrative of a thriller - and proves the cliché correct that truth is much stranger than fiction. It must have been quite an odd case to watch unravel in the media and could only have happened in the 70's. I can't quite see Paris Hilton robbing banks for the poor, somehow....\n\nThe only criticism I would have with the documentary is that plays on the ambiguity of Hearst - the good girl/bad girl, did she or didn't she mythology while conveniently neglecting facts that may have painted her is a more sympathetic light. It's one thing to play tapes of her calling her parents 'pigs' but quite another to fail to mention that all of her communique's were written for her, that she was kept blindfolded for over a month and expected to have sex with SLA members (all within her closet that she was rarely allowed out of). When arrested her IQ had dropped to a near comatose level, she was seriously malnourished and had ceased menstruating. Hardly a cutting revolutionary figure.\n\nAltogether, it is a gripping and often darkly funny insight into one of the strangest cases in pop culture as well as the annuls of crime. It is thorough and impeccably researched. Highly recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H29M",
    "url": "/title/tt0390299/"
}