{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ashton Kutcher",
            "url": "/name/nm0005110/"
        },
        {
            "@type": "Person",
            "name": "Bernie Mac",
            "url": "/name/nm0005170/"
        },
        {
            "@type": "Person",
            "name": "Zoe Saldana",
            "url": "/name/nm0757855/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 44025,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070636/"
        },
        {
            "@type": "Person",
            "name": "William Rose",
            "url": "/name/nm0741740/"
        },
        {
            "@type": "Person",
            "name": "David Ronn",
            "url": "/name/nm0740115/"
        },
        {
            "@type": "Person",
            "name": "Jay Scherick",
            "url": "/name/nm0771065/"
        }
    ],
    "datePublished": "2005-03-25",
    "description": "A young woman, Theresa, brings her boyfriend, Simon, home to meet her parents and surprise them with the news of their engagement. Another surprise: Simon is white.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Rodney Sullivan",
            "url": "/name/nm0838198/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjIyYzBlYmUtYzg1Yy00MDhjLTlmYjUtMTZlMWI0NmFmZTFkXkEyXkFqcGdeQXVyMTEwNDU1MzEy._V1_.jpg",
    "keywords": "family relationships,white male black female relationship,interracial relationship,race relations,father dislikes daughter's boyfriend",
    "name": "Guess Who",
    "original_info": {
        "id": "Guess Who_2005",
        "name": "Guess Who",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2006-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0372237/"
        },
        "name": "an \"edgy\" comedy without the edge",
        "reviewBody": "When it was released in 1967, \"Guess Who's Coming to Dinner\" was acclaimed as a \"breakthrough\" film for its lighthearted, yet serious, depiction of an interracial romance. In the years since, society has moved so far in the direction of acceptance of so-called \"mixed marriages\" that any remake is bound to feel, at least to some extent, superfluous and anachronistic. And that is exactly the case with \"Guess Who,\" a 2005 update whose abbreviated title is only the first of the many changes the filmmakers have rung on the Stanley Kramer original.\n\nThe screenwriters' first alteration involves switching the race roles, so that it is now a black family having to accept a white male as a prospective in-law rather than the other way around. Bernie Mac assumes the Spencer Tracy role as the father whose world is turned upside down when his beloved daughter brings a Caucasian boyfriend (Ashton Kutcher as a white Sidney Poitier) home to meet the family. On the distaff side, we have Judith Scott taking over for Katherine Hepburn as the understanding mother and Zoe Saldana replacing Katherine Houghton as the freethinking daughter.\n\nSince interracial marriage is no longer the hot-button issue it once was, the filmmakers have been forced to inject a number of other non-race-related plot complications into the mix to develop and maintain the conflict and drama. Thus, we have Kutcher trying to hide the fact from both his fiancé and her family that he has recently quit his high-paying job at a prestigious firm and that he may, in fact, be the target of a securities-and-exchange commission probe. Indeed, with Kutcher spending most of his time trying to win over his critical and overbearing future father-in-law, \"Guess Who\" feels more like a remake of \"Meet the Parents\" than of \"Guess Who's Coming to Dinner.\" The real problem with \"Guess Who\" is that it rarely has the courage of its convictions. Having decided to tackle a relatively dicey topic, the film too often drops the issue in favor of scenes that wouldn't pass muster even on a third-rate sitcom. For every scene that is incisive and daring - i.e. Kutcher telling a series of black jokes at the family dinner table - there is another that is pure Hollywood hokum (Mac and Kutcher sleeping in the same bed together, Mac and Kutcher having a go-cart race to determine who has the higher testosterone level and the greater machismo, etc.).\n\nAll of the performers are fine, especially Mac and Kutcher in the lead roles. However, they just haven't been given very sophisticated material to work with here. \"Guess Who\" might have been a better film had it aimed more for genuine, hard-edged satire and less for lowbrow slapstick and predictable romantic comedy sentimentality.\n\nStill, it's been 38 years since \"Guess Who's Coming to Dinner\" first shocked the nation with its in-your-face defiance of miscegenation laws, and the world has since moved on to other issues of social injustice and marital definition. Which is why, in the year 2005, \"Brokeback Mountain\" was a breakthrough film and \"Guess Who\" was not.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2225799449",
        "name": "Guess Who",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2MxNWRmNmMtMmVlNy00ZTk4LWE5YjktZDk0ZDA3ZDgzOGFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2MxNWRmNmMtMmVlNy00ZTk4LWE5YjktZDk0ZDA3ZDgzOGFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:21:20Z",
        "url": "https://www.imdb.com/video/vi2225799449/"
    },
    "url": "/title/tt0372237/"
}