{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "Annette Bening",
            "url": "/name/nm0000906/"
        },
        {
            "@type": "Person",
            "name": "George Wendt",
            "url": "/name/nm0001841/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8957,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054262/"
        },
        {
            "@type": "Person",
            "name": "Irwin Winkler",
            "url": "/name/nm0005563/"
        }
    ],
    "datePublished": "1991-03-15",
    "description": "Returning to Hollywood 1951 after working in France, a movie director meets McCarthyism head-on.",
    "director": [
        {
            "@type": "Person",
            "name": "Irwin Winkler",
            "url": "/name/nm0005563/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2RlN2UxYTAtMzk1Yi00NDdmLWI4NTAtY2Y5MDZmMDA1ZDRhXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "hollywood blacklist,1950s,politician,politics,mccarthy hearings",
    "name": "Guilty by Suspicion",
    "original_info": {
        "id": "Guilty by Suspicion_1991",
        "name": "Guilty by Suspicion",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lizlet101"
        },
        "dateCreated": "2005-10-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101984/"
        },
        "name": "A softer side of history",
        "reviewBody": "This is a fairly good movie. It provides a compelling dramatic struggle and captures the paranoia of an era. However, like many Hollywood movies, it strives more to create a dramatic story than an accurate one.\n\nThis movie was originally to be based on the life of blacklisted writer/director Abraham Polonsky (Force of Evil, Body and Soul). Polonsky was working in France at the time of the HUAC hearings and a friend called to tell him not to come back or he'd be called to testify. He deliberately came back for the express purpose of telling HUAC where they could stick it. This is a good story as an anecdote, but not a great story for a movie.\n\nThe one place in which this movie (and many other movies) softens the history is by making the protagonist politically neutral. It is certainly true that many people accused were not communists or had only attended a meeting out of curiosity, but this is not true for everybody. Many of these people were devout socialists. As Polonsky has said on occasion \"During the Great Depression, anybody with a brain considered Communism. The Capitalist system was BROKE. Communism looked like a smart bet.\" While many of these people reconsidered as the nation returned to prosperity, a large number did not.\n\nMost of the famous Hollywood Ten were still believers in socialism when they were blacklisted. There is no evidence that any of them were spies for the Soviet Union-- many of them had already learned that the USSR was not the socialist paradise they dreamed of-- but they did believe in the writings of Mark and Engels. It is also true that they placed socialist themes in their films. They created gangsters who only cared about money, families screwed over by greedy real estate brokers and poor saps who put it all in the stock market.\n\nHowever, none of this was illegal. They had every right to believe in whatever politics they chose to. They had every right to create these films-- and their movies seemed to have a resonance with the audience. They're lives and careers were destroyed because they held political beliefs that some viewed as threatening.\n\nI also want to point out that Elia Kazan was not the model for this film. Elia Kazan has been repeatedly condemned by Polonsky and others who were blacklisted. He chose to name names and to allow the HUAC to bully him. I don't condemn him for this like other people. As this movie shows, so much was on the line for people who HUAC sets their sights on. Kazan cracked. He failed to be a hero, when the time came. This doesn't mark him a coward, merely something less than a hero. \"On the Waterfront,\" while not a direct explanation of his actions, is an excellent look at his state of mind around that time.\n\nWhile yes, I have not spent much time reviewing this movie, I felt it necessary to set the record straight about history.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0101984/"
}