{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Wild",
            "url": "/name/nm0928349/"
        },
        {
            "@type": "Person",
            "name": "Billie Hayes",
            "url": "/name/nm0370906/"
        },
        {
            "@type": "Person",
            "name": "Lennie Weinrib",
            "url": "/name/nm0918396/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1826,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "TV-Y",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070812/"
        },
        {
            "@type": "Person",
            "name": "Marty Krofft",
            "url": "/name/nm0471897/"
        },
        {
            "@type": "Person",
            "name": "Sid Krofft",
            "url": "/name/nm0471898/"
        }
    ],
    "datePublished": "1969-09-06",
    "description": "The adventures of a boy trapped in a fantastic land with a dragon friend and a witch enemy.",
    "genre": [
        "Adventure",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjFiYzI1OTctZjAzYS00N2Q0LWE5ODUtZTU2ZDIwMTQwNDVjXkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1_.jpg",
    "keywords": "character name as series title,1960s,1970s,h.r. pufnstuf character,campy",
    "name": "H.R. Pufnstuf",
    "original_info": {
        "id": "H.R. Pufnstuf_1969",
        "name": "H.R. Pufnstuf",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "xaa"
        },
        "dateCreated": "2000-11-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063907/"
        },
        "name": "You had to see this as a kid to 'get' it.",
        "reviewBody": "For any adult born after 1970, this series (and the movie that was made from it) will make little sense, if any. Wild, raucous colors, dancing, singing, and an island where everything - yes, EVERYTHING - is alive.\n\nLittle Jimmy, coaxed to Living Island by the evil machinations of Witchy-Poo (the heavy of the series) finds himself in possession of a magic, talking flute, and trapped on an island of talking hats and dragons and witches, all of which he can barely comprehend. To an adult of today, the show simply makes little sense...\n\nAh, but if you saw it as a child, as I did, the show makes perfect sense. First, it's *FUN*. That, indeed, was one of the main points of the show - having fun. Yet, each show attempted to impart (as is typical for children's programming) a moral message. In general, the most common message of the entire series was \"Perseverance\". Keep trying, because though you may fail, if you keep trying, you may succeed in the end. Other lessons imparted by the show include 'Don't steal', 'Don't Lie', and 'Don't be Mean (despite how much fun it may be, you end up hurting others, and that isn't nice).'\n\nAdults today look at the show, searching for depth, perhaps hidden meanings. Well, there *AREN'T* any - what you see is what you get. Cling and Clang have no \"Hidden Meanings\" - they are simply Cling and Clang. The talking flute is just a talking flute, and Jimmy is just a boy who wants to go home.\n\nAlas, the networks decided to cancel the show. In an era where even the most critically acclaimed shows often died due to a slip of a point or two in the Nielsens, H.R. Pufnstuf was not the smash hit the network demanded. Adults of the time simply shook their heads as their children laughed and clapped and sang along with the simple songs, for parents of the time understood the show about as well as they understood the dark side of the moon.\n\nYet, I understood it as a child, as did all my friends of that time. Yes, we sang along with the theme song (which I can still sing today, word for word - it was mercifully short), laughed at the antics of the Living Islanders, booed the evil Witchy-Poo, and deeply felt for Little Jimmy, who sometimes wept for his heartfelt desire to go home. As a child, however, I often found I was jealous, even angry with little Jimmy. Living Island was, in the end, a fantasy paradise (despite Witchy-Poo), and for each moment Jimmy sighed and wished he could go home, I sighed and wished I could be there, on Living Island, instead of in the world of 1969, with it's turmoil and strife that were far beyond the comprehension of a little boy."
    },
    "url": "/title/tt0063907/"
}