{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ryan Dunn",
            "url": "/name/nm0242756/"
        },
        {
            "@type": "Person",
            "name": "Bam Margera",
            "url": "/name/nm0546640/"
        },
        {
            "@type": "Person",
            "name": "Brandon DiCamillo",
            "url": "/name/nm0225164/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4597,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0743710/"
        },
        {
            "@type": "Person",
            "name": "Chris Aspite",
            "url": "/name/nm1069345/"
        },
        {
            "@type": "Person",
            "name": "Bam Margera",
            "url": "/name/nm0546640/"
        },
        {
            "@type": "Person",
            "name": "Brandon DiCamillo",
            "url": "/name/nm0225164/"
        }
    ],
    "datePublished": "2003-06-24",
    "description": "After she breaks up with Ryan, Glauren is rumored to have been hooking up with heavy metal Hellboy. Ryan enlists the help of his friends Valo and Falcone to find out the truth.",
    "director": [
        {
            "@type": "Person",
            "name": "Bam Margera",
            "url": "/name/nm0546640/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzMjEzNzY4NF5BMl5BanBnXkFtZTcwODYxMjMyMQ@@._V1_.jpg",
    "keywords": "sex comedy,crude comedy,crude humor,time lapse photography,scene after end credits",
    "name": "Haggard",
    "original_info": {
        "id": "Haggard_2003",
        "name": "Haggard",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lilian-larwood"
        },
        "dateCreated": "2014-02-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0298656/"
        },
        "name": "A fantastic comedy by some daring performers",
        "reviewBody": "I watched this back in 2006 and I got to say this is one of the funniest films I've seen in such a long time. Bam Margera's (technically) directorial debut known as \"Haggard\" really delivers something special and original to us as it's really a romantic comic tragedy, but made by either Jackass stars or CKY stars (if you're fans with any of them...) Haggard tells the story of Ryan Dunn (playing himself) who gets dumped by the love of his life 'Glauren' for some dude named 'Hellboy' and ever since the devastating news he swears revenge and gets his pals Valo and Falcone to do his dirty word (some of that is pun) at Glauren's house. It's such a ridiculous concept but somehow I have a feeling that we can all relate to this film due to losing someone we love and having mixed emotions over it.\n\nWhat I love about this film is that it's a film clearly made just for fun. Sure it was funded and well planned/structured, however you can tell they had a good time making it and most of the characters are played by either friends or family of Bam's. But there's something personal behind it and I didn't realise until now that the story is based on Ryan's actual love life where something like that actually happened. You really feel sorry for Ryan and his pain behind it all and for that you're keen to know what happens until the very end.\n\nWhat I didn't like about the film and unfortunately this happens a lot. I didn't particularly like the skateboarding montages, and I felt that Bam needed to remind us that they're also skilled skaters as well as actors. Is this CKY I'm watching now or a narrative-film? I'm a massive fan of HIM and thought that the music choice was incredible so there's a positive about those random montages throughout the feature.\n\nOverall a fantastic film about love and anger, dealing with the sadness that we can all relate to if we ever had someone to brake our hearts, but still laugh out loud to those lovable characters who either get p***ed on, smear s*** on the door, videotape girl's under wears in their house.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0298656/"
}