{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Josh Kornbluth",
            "url": "/name/nm0466430/"
        },
        {
            "@type": "Person",
            "name": "Warren Keith",
            "url": "/name/nm0445316/"
        },
        {
            "@type": "Person",
            "name": "Sarah Overman",
            "url": "/name/nm0653895/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1325,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051879/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090772/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027736/"
        },
        {
            "@type": "Person",
            "name": "Josh Kornbluth",
            "url": "/name/nm0466430/"
        },
        {
            "@type": "Person",
            "name": "Jacob Kornbluth",
            "url": "/name/nm0466428/"
        },
        {
            "@type": "Person",
            "name": "John Bellucci",
            "url": "/name/nm0069257/"
        }
    ],
    "datePublished": "2001-01-22",
    "description": "Josh has an offer to \"go perm\" at his employer and the first task is to mail 17 high priority letters....something that seems a little difficult to do.",
    "director": [
        {
            "@type": "Person",
            "name": "Jacob Kornbluth",
            "url": "/name/nm0466428/"
        },
        {
            "@type": "Person",
            "name": "Josh Kornbluth",
            "url": "/name/nm0466430/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU1NTQyNjkwNV5BMl5BanBnXkFtZTcwMDMxNjcxMQ@@._V1_.jpg",
    "keywords": "boss,secretary,office,corporate world,based on monologue",
    "name": "Haiku Tunnel",
    "original_info": {
        "id": "Haiku Tunnel_2001",
        "name": "Haiku Tunnel",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ThurstonHunger"
        },
        "dateCreated": "2004-03-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0273253/"
        },
        "name": "two definitions of mugging",
        "reviewBody": "There's bug-eyed mugging, as in what Josh Kornbluth does a little too much in this film. And then there's the brutal mugging that this film is receiving here in IMDB comments. Ouch.\n\nMuch of the latter seems to stem around some resentment regarding this film and \"Office Space.\" I've not seen the latter yet, but it seems to me \"Haiku Tunnel\" is a total ripoff of \"Magnolia.\"\n\nKidding...kidding. That's my own little inside joke.\n\nAs for the jokes in here, I guess they might be somewhat inside. But I think if you've ever felt a bit like a stow-away on a job, you could connect with some of the alienation that Josh pokes fun at. All of the other characters here really are just foils for Josh, that might bug some folks.\n\nGenerally I found the amateurish charm to work here. I love \"catalog\" humor, and we get some of that early on in regards to types of fellow temps and types of lawyers. Quick flicks through stereotypes work for me usually. The film does slow down (as almost all comedies do) towards the end, when the plot piper must be paid.\n\nAlong those lines, in a bad horror film, I often will want to yell at the screen \"Call the cops...NOW!\" During this film, you will likely reach a point, as my wife and I did, where you will want to scream, \"Mail the damned letters...NOW!\" But we both did laugh throughout this. She especially loved the scene where Josh's boss won't let him quit, especially during Josh's litany of reasons that he is a bad seed.\n\nBut why do so many people, so strongly dislike this film?\n\nIf I squint my memory, I can sort of reimagine Kornbluth as Garfield (the cat, not the president). Maybe that is why some folks find him so patently unfunny. Just thinking about a punchline involving \"Lasagna\" and that comic strip sets my blood to boiling. Could that be it?\n\nOr maybe some of the smirks that Kornbluth lobs towards the camera have the effect on others that a laugh track has on me. This does have a bit of a sitcom feel, but at least it isn't dragged out over 100 episodes. And there are some unique idiosyncratic moments here.\n\nOr perhaps some folks need to be able to identify with the main character in a comedy, and Josh comes across with a little too much self-confidence and well, a little too much self. It's okay for Bill Murray to have too much of the former, just like it's okay for Chris Farley to have too much of the latter. But put them in one body, and look out?\n\nI don't know what it is. But evidently half of you out there really shouldn't see this film. Not even on cable, late at night. I decided to watch this after seeing the trailer along time ago, so maybe look at that first? Or cross-check my other reviews...I recommend this one with a \n\n7/10\n\nPS You can fault Kornbluth's sense of humor, but certainly not his taste in music! Great songs through-out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Sony Pictures Classics",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4255842585",
        "name": "Haiku Tunnel",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWU0MDg2MWYtZGNjYi00MzM5LThmNWItZDVhNWVlMTFmMzc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWU0MDg2MWYtZGNjYi00MzM5LThmNWItZDVhNWVlMTFmMzc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:22:12Z",
        "url": "https://www.imdb.com/video/vi4255842585/"
    },
    "url": "/title/tt0273253/"
}