{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jamie Lee Curtis",
            "url": "/name/nm0000130/"
        },
        {
            "@type": "Person",
            "name": "Busta Rhymes",
            "url": "/name/nm0005354/"
        },
        {
            "@type": "Person",
            "name": "Brad Loree",
            "url": "/name/nm0520562/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 46496,
        "ratingValue": 3.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091393/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0202433/"
        },
        {
            "@type": "Person",
            "name": "Debra Hill",
            "url": "/name/nm0384185/"
        },
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        },
        {
            "@type": "Person",
            "name": "Larry Brand",
            "url": "/name/nm0104487/"
        }
    ],
    "datePublished": "2002-07-12",
    "description": "Three years after he last terrorized his sister, Michael Myers confronts her again, before traveling to Haddonfield to deal with the cast and crew of a reality show which is being broadcast from his old home.",
    "director": [
        {
            "@type": "Person",
            "name": "Rick Rosenthal",
            "url": "/name/nm0742819/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODczZDMxNTMtZDIxOC00YWEzLWJkMmEtZjczNGUwZDA2NTNhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "michael myers,halloween,michael myers character,murder spree,horror icon",
    "name": "Halloween: Resurrection",
    "original_info": {
        "id": "Halloween: Resurrection_2002",
        "name": "Halloween: Resurrection",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "generichorrorfreak"
        },
        "dateCreated": "2010-10-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0220506/"
        },
        "name": "blah",
        "reviewBody": "Halloween: Resurrection starts off on the wrong foot and it's all downhill from there. Sure they found a clever way to undo the closure of Halloween H2O and make it possible to bring Mike up to his old shenanigans, unfortunately that whole segment is hasty and the rest of the movie's garbage. The \"what really happened\" explanation is just a loophole for making a movie that's neither necessary nor any good, and so I present to you Halloween: Resurrection.\n\nI'm not going to write any spoilers about what happens to Laurie, but I think anyone who loves the original Halloween and its characters will think what they did with her in this movie is crap and only put her in here for the sake of having Laurie in it.\n\nThe characters are plastic. Even by the end of the movie when you get to know all of them a little bit, you don't care enough about them to want to see them escape the wrath of Mike Myers. In fact, you'll probably look forward to their demise at his hands. That's how flat and/or despicable these characters are. Even the lead role doesn't have much personality. She's nice and smart and decent, just like Laurie was in fact, but somehow she doesn't have much personality. I don't think her character was developed enough, otherwise she could have made a good heroine. The rest of the characters are people you pretty much hope get killed off, especially the tech lady played by Tyra Banks and most of the kids that tour the haunted house. Obnoxious people, hastily made characters. And Busta Rhymes plays the typical black dude with a boisterous personality. Not a bad acting job, but what a typical cliché character.\n\nThe technology is another factor. Another case of fusing horror with the fancy gimmick of modern technology (or what was modern in 2002 anyways). Just because we have things like reality shows and phone-texting nowadays does not mean it will make a horror movie any scarier, or realistic, or better at all. Having people emailing and playing on their phones and all in the movie takes away from the good old-fashioned terror you get from something as simple as a lurking shadow or the gleam of a butcher knife.\n\nThere's a couple of notably cool things in the movie, like when Freddy dresses up like Mike Myers while Mike is there in the flesh and you see two Mikes walking one behind the other. Well that was more funny than anything. The scene with the bong was funny too. And the murder scenes are alright and in typical Mike Myers fashion, but otherwise Resurrection bombs as a horror film and leaves you yet again with no closure, except this time you wouldn't really want to see another sequel.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1424989721",
        "name": "Halloween: Resurrection",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWMxOTJjOGQtMGI0Ny00NjE2LTk4NzEtMGQwMmUzY2FlODUwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWMxOTJjOGQtMGI0Ny00NjE2LTk4NzEtMGQwMmUzY2FlODUwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:25:20Z",
        "url": "https://www.imdb.com/video/vi1424989721/"
    },
    "url": "/title/tt0220506/"
}