{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jamie Lee Curtis",
            "url": "/name/nm0000130/"
        },
        {
            "@type": "Person",
            "name": "Donald Pleasence",
            "url": "/name/nm0000587/"
        },
        {
            "@type": "Person",
            "name": "Charles Cyphers",
            "url": "/name/nm0194234/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 95114,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        },
        {
            "@type": "Person",
            "name": "Debra Hill",
            "url": "/name/nm0384185/"
        }
    ],
    "datePublished": "1981-10-30",
    "description": "While Dr. Loomis hunts for Michael Myers, a traumatized Laurie is rushed to Haddonfield Memorial Hospital, and The Shape is not far behind her.",
    "director": [
        {
            "@type": "Person",
            "name": "Rick Rosenthal",
            "url": "/name/nm0742819/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjZmYjg0ODctOTIyYy00YzhkLTgyMzEtNjUyY2JiZjVmYzI2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "hospital,serial killer,murder spree,halloween,exsanguination",
    "name": "Halloween II",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "clark-39"
        },
        "dateCreated": "2002-03-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082495/"
        },
        "name": "A very good sequel.",
        "reviewBody": "Halloween 2 is a very worthy sequel to John Carpenter's 1978 classic. From the opening sequence we pick up exactly where the first film left off, making the two movies play like one whole movie in two separate parts. We continue focusing on Laurie Strode from the first scene and stay with her as she is rushed to the local Haddonfield Memorial Hospital. Rick Rosenthal is directing John Carpenter's script this time, and although he doesn't pull off the techniques Carpenter used in the original, he brings in some new ones that work just as well. The nonexistant gore in the original is very present in this one, and the mode of death changes for each victim, unlike the first where Michael only uses his knife and a phone cord. Very tense scenes are set up throughout the movie that make your heart pound (one in particular takes place in the hospital hot tub). Michael seems to be much more angry and dangerous in this one. He's not in the shadows anymore and it seems his mask has changed, but oh well. Overall, Michael is alot creepier and scary in this one. Watch out for him when he scrunches up his mask in anger. Someone should say bravo to Carpenter for setting the movie in a hospital. The long hallway shots and the creepy music make the setting a classic in horror. Michael roams the halls, searching for Laurie (and this time we find out why). Putting all the doctors, nurses, and Laurie in a place with someone like Michael walking around makes you terrified to see what's around the corner. Loomis is back, too, still out to stop him before he kills anymore. Some strange references to Samhain and ancient evil are brought up that rack up the creep-o-meter sky high. Overall, Halloween 2 is not better than the original, but it is by no means worse. Yes, some scenes have no purpose and the plot is nothing exceptional, but for a sequel it's good enough and besides you'll be too involved to care. If you liked the original, watch this one with it together. Although Carpenter and Rosenthal's direction take two different turns, both films are highly entertaining. And scary..."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 2 for Halloween II",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1191948569",
        "name": "Halloween II",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmYxNGRiMmYtZmQwMi00MjM4LThjYjMtODQwOWYxODdlM2QyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmYxNGRiMmYtZmQwMi00MjM4LThjYjMtODQwOWYxODdlM2QyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-04-09T04:31:30Z",
        "url": "https://www.imdb.com/video/vi1191948569/"
    },
    "url": "/title/tt0082495/"
}