{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Atkins",
            "url": "/name/nm0040662/"
        },
        {
            "@type": "Person",
            "name": "Stacey Nelkin",
            "url": "/name/nm0625030/"
        },
        {
            "@type": "Person",
            "name": "Dan O'Herlihy",
            "url": "/name/nm0641397/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 56722,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Tommy Lee Wallace",
            "url": "/name/nm0908890/"
        },
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        },
        {
            "@type": "Person",
            "name": "Nigel Kneale",
            "url": "/name/nm0460600/"
        }
    ],
    "datePublished": "1982-10-22",
    "description": "Kids all over America want Silver Shamrock masks for Halloween. Doctor Daniel Challis seeks to uncover a plot by Silver Shamrock owner Conal Cochran.",
    "director": [
        {
            "@type": "Person",
            "name": "Tommy Lee Wallace",
            "url": "/name/nm0908890/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2YzYjI0MWYtYWUyZS00ZDQ4LWEzN2EtMDU4NDJmNjA2ZWFiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "halloween,stonehenge,factory,northern california,curfew",
    "name": "Halloween III: Season of the Witch",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TOMASBBloodhound"
        },
        "dateCreated": "2004-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085636/"
        },
        "name": "\"A good magician never explains.\"",
        "reviewBody": "Let me begin by saying that I hated this film as a kid. After viewing it the other day on a whim however, I was surprised at how much better I liked it now. The story centers around an evil mask-maker planning to use ancient technology to murder millions of children on Halloween night by selling them masks with a nasty little secret inside. I found the story very interesting, though plenty of plot holes ultimately keep this film from being all it could have been. \n\nThe biggest obstacle in this film's way is the fact that it has nothing at all to do with the other \"Halloween\" films made either before or after it. That's certainly no reason not to give it a chance, though. Perhaps it should have been called only \"Season of the Witch\" or something so as not to anger the purists out there who demand the presence of Michael Myers in anything with the word \"Halloween\" in the title. That said, let's take a look at the good and not-so-good elements of this film, shall we?\n\nLike the previous entries in the series, this film has some creepy and effective music. It is also buffered by some evil synthesizer sounds at every turn. The little jingle set to \"London Bridge\" is annoying, and I'm sure it was supposed to be. \n\nThere are some interesting deaths, to say the least. Early on, we see a robotic henchman pull apart a victim's skull, then blow himself up in a car. One hapless woman gets an energy beam projected through her face, leaving her mouth much larger than normal. (a bug then crawls out of her head, foreshadowing later events) Another man gets his head ripped completely off for threatening to torch the bad guy's factory. Later on, a family is murdered in a test demonstration of what happens when someone wearing one of these masks watches a certain commercial on TV. Bugs and poisonous snakes form inside the mask and attack anyone in the room. It seems the masks have some tiny pieces from one of the blocks from Stonehenge implanted in the factory seal. Something about the commercial triggers the effect within the mask. And just how does this happen, you ask? \"A good magician never explains,\" the mask-maker points out in one scene. Sigh.\n\nSome gigantic holes are present as the story unfolds. Tom Atkins, who plays our hero, has a useless love affair with the daughter of an early victim. If these two are so intent on solving a deadly mystery about the death of her father, and bad guys are all around, would they really stop to have sex? He is also much older than this woman. I guess since Atkins plays a doctor, the young woman finds that sexy. Maybe I'd better go to medical school if I want to score with hot young women when I'm his age. \n\nAnother problem concerns the time that these masks are supposed to go off. We are told by the mask maker that when the commercial airs at 9:00 pm on Halloween night, all the masks will react and kill the children. However, if it's 9:00 in California (where this takes place) it would be 11:00 where I live or midnight on the east coast. Children would mostly be in bed by then! Few parents would allow their kids up that late to watch any \"big give-a-way\". The plan is to wipe out kids all over the country, but it looks like only kids on the west coast would be up when the commercial airs. If there was an explanation about how this problem would be overcome, I missed it. I guess once again, \"A good magician never explains.\"\n\nAnd just how in the hell did this guy steal a piece of Stonehenge, anyway? He admits it was difficult, but again offers no explanation of how it was done!\n\nAnd how many freaking times did the female robot attack Atkins at the end? I lost count. \n\nWell, it's not a total loss. It was a neat idea for a film, but they shouldn't have glossed over so many things. \n\nI'll give it 5 of 10 stars. \n\nHappy Happy Halloween Halloween Halloween Happy Happy Halloween Silver Shamrock!\n\nSTOP IT!!!! STOP IT!!!! STOP IT!!!!!!!!!!!!!!!!!!!!!!!!!\n\nSo sayeth the Hound.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Halloween III: Season of the Witch",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2584388633",
        "name": "Halloween III: Season of the Witch: [Collectors Edition Blu-Ray]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmU0YzFiNmUtZWRkMy00ZDJhLWE0NWYtYWZhNWI0MTgxYTVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmU0YzFiNmUtZWRkMy00ZDJhLWE0NWYtYWZhNWI0MTgxYTVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-10-20T03:17:48Z",
        "url": "https://www.imdb.com/video/vi2584388633/"
    },
    "url": "/title/tt0085636/"
}