{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stephen Cloud",
            "url": "/name/nm1229476/"
        },
        {
            "@type": "Person",
            "name": "Brandy Little",
            "url": "/name/nm0514521/"
        },
        {
            "@type": "Person",
            "name": "Amy Jo Hearron",
            "url": "/name/nm1292639/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 300,
        "ratingValue": 3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0085752/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036554/"
        },
        {
            "@type": "Person",
            "name": "Chris Burdick",
            "url": "/name/nm1321642/"
        }
    ],
    "datePublished": "2003-10-21",
    "description": "It's Halloween and evil forces are about to inflict a scary surprise on 8 college co-eds and their haunted house. Vampires, zombies and pirates are no longer just costumes, but killers that lurk behind every door, hall and tombstone.",
    "director": [
        {
            "@type": "Person",
            "name": "Jon Keeyes",
            "url": "/name/nm0444870/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGM5OGE1MjgtOWNhMi00NWQxLWFlNDYtNzNiZmE5NDgxZGRkXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "pirate,zombie,vampire,halloween costume,halloween",
    "name": "Hallow's End",
    "original_info": {
        "id": "Hallow's End_2003",
        "name": "Hallow's End",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thunderpuppy"
        },
        "dateCreated": "2003-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338088/"
        },
        "name": "Dreadful",
        "reviewBody": "Horror movies can be a lot of fun with low budgets, bad acting, and a bit of panache. I think the film is just missing panache, because, one thuddingly dull scene after another, people make laughably harmless claw-handed grabs at the air. If it weren't so boring, it might be funny.\n\nA horror film can go a long way with a tired concept like \"college kids in a haunted house,\" in much the same way the Evil Dead movies had a lot of fun with a similar standard plotline. Hallow's End, unfortunately, doesn't go a long way. Actually, it doesn't go anywhere. It spends the better part of an hour setting up faceless and anonymous characters with what seem like endless interpersonal drama. I have nothing against character development, not even in a horror movie, but these are strictly one-dimensional characters (the alpha-male, the milquetoast, the... um... throwaway characters that exist mostly for sex scenes.) Spending forty-plus bloodless, droning minutes with them was more horrific than when the bloodshed started.\n\nWell, implied bloodshed anyway. When the college kids turn into whatever they dressed as for their haunted house (one's a vampire, one's wearing O.R. scrubs and some white pancake) they look pretty much the way they did in their amateur haunted house costumes; The Dead Hate The Living, using a similar theme, is a masterwork in comparison. There isn't really any gore to speak of, nor are there any real scares.\n\nI've thought about this one from almost every approach. If it was supposed to be a tight, suspenseful horror movie (which would explain why things moved so slowly), the pathetic sex scenes and cheap monsters would invalidate it. If it was supposed to be a genuine blood & guts horror movie (which would explain the schlock)... where's the blood and guts? And the anticlimax is one of the unexciting endings to a movie I've ever seen. It's the kind of movie that, though it doesn't have a narrator through the film, is bookended by voice-overs because all of the meaningless dialogue just wasn't enough.\n\nThis was a hard one... coming out of it, I wonder if I've just sat through a christian horror film. Maybe the \"I know hell exists\" of the opening wasn't meant that way, but there are some hints (or misdirection-- I'm not sure which). For all the profanity in the film, a line like \"gosh-darnit\" comes off a little absurd, and so does most of the crucifix worshipping, god-fearing, and satan-dreading, especially after some lecherous T&A sex scenes (one heterosexual, one lesbian).\n\nIf it a christian company (Highland Myst's logo even has a bit of a crucifix resemblance), then this film weighs in heavily for the atheist camp. An omnipotent being can't be this bad a filmmaker.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2863005977",
        "name": "Hallow's End",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjBiOGQzYTgtMWZmOS00ZWFjLTlhYTktZmUzODkxYzc3ZWJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjBiOGQzYTgtMWZmOS00ZWFjLTlhYTktZmUzODkxYzc3ZWJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:05:19Z",
        "url": "https://www.imdb.com/video/vi2863005977/"
    },
    "url": "/title/tt0338088/"
}