{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Innokentiy Smoktunovskiy",
            "url": "/name/nm0810550/"
        },
        {
            "@type": "Person",
            "name": "Mikhail Nazvanov",
            "url": "/name/nm0623442/"
        },
        {
            "@type": "Person",
            "name": "Elza Radzina",
            "url": "/name/nm0705952/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2831,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "alternateName": "Hamlet",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0114119/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0533940/"
        },
        {
            "@type": "Person",
            "name": "Grigoriy Kozintsev",
            "url": "/name/nm0468882/"
        },
        {
            "@type": "Person",
            "name": "Boris Pasternak",
            "url": "/name/nm0664985/"
        },
        {
            "@type": "Person",
            "name": "William Shakespeare",
            "url": "/name/nm0000636/"
        }
    ],
    "datePublished": "1964-05-03",
    "description": "After the death of the King of Denmark - Hamlet's father - his brother Claudius ascends the throne, who takes his widow Gertrude as his wife. Hamlet meets the ghost of his father and learns that he was killed by Claudius.",
    "director": [
        {
            "@type": "Person",
            "name": "Grigoriy Kozintsev",
            "url": "/name/nm0468882/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTExMTA0MmEtMDFjZi00MTllLTk4ODEtZjcxOWYyNDhkMmU0XkEyXkFqcGdeQXVyNjg3MTIwODI@._V1_.jpg",
    "keywords": "shakespeare's hamlet,russia,ghost,murder,prince",
    "name": "Gamlet",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Red-125"
        },
        "dateCreated": "2014-03-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058126/"
        },
        "name": "An Elsinore that looks like a castle . . . and a prison",
        "reviewBody": "Hamlet (1964) (original title Gamlet) is a Russian adaptation of Shakespeare's play, directed by Grigori Kozintsev. The film stars Innokentiy Smoktunovskiy as Hamlet, and Anastasiya Vertinskaya as Ophelia.\n\nI saw this movie as part of a Shakespeare in Film honors seminar that I'm auditing. It surprised me that I enjoyed this version of Hamlet so much. After all, it was filmed 50 years ago, in black and white, mainly in Estonia, during a period when the Soviet government was monitoring every frame of every movie for possible deviation from the politically acceptable.\n\nNonetheless, the movie worked for me. Elsinore Castle--artificially constructed, as I learned from IMDb--looked very realistic. Also, the castle had life in and around it. When you think about it, most film Hamlets are shot almost in a vacuum. You don't get any sense that anyone lives in or works in the castle. This Hamlet is the exception-- extras are everywhere, working hard and keeping the castle functioning.\n\nThe acting is generally excellent. I was particularly impressed by Anastasiya Vertinskaya (Ophelia). She went on to become a noted Russian film star. This role was a turning point in her career. She's extraordinarily talented. She acts--and appears--like someone who belongs in the setting. She doesn't have the buffed, \"I am a star\" attitude of many women who play Ophelia.\n\nPrince Hamlet tells us that, to him, Elsinore is like a prison. Kozintsev emphasizes this aspect of the castle. In the beginning of the film, the portcullis closes ominously. Even if you don't know the plot of Hamlet, you know that trouble is ahead after you've seen the first few frames.\n\nSome of he students felt that seeing Shakespeare in translation just doesn't make sense. After all, Shakespeare is the greatest master of the English language. Boris Pasternak apparently translated Shakespeare's language into Russian, but that doesn't help us. I would have thought that the subtitles who have reverted to Shakespeare's English, but they don't. Unless you speak Russian, you have no idea of what the Russian audience is hearing. \n\nDoes that mean that all that's left (for us) is the plot? Some of the students thought so, but I disagree. There's a third element besides language and plot--character. Hamlet, Claudius, Gertrude, Polonius, and Ophelia all have a distinct character, set down by Shakespeare for us to understand and interpret. I think that in this movie, even though we lose language, Kozintsev allows us to see character. So, even without Shakespeare's language, this film has much to offer us. (Music by Dmitri Shostakovich is an added bonus.)\n\nI saw the movie on the small screen, where it worked pretty well. It would work better in a theater. If it's not playing in revival, watch it on DVD. It's definitely worth seeing, and I highly recommend it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0058126/"
}