{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Roy Acuff",
            "url": "/name/nm0010334/"
        },
        {
            "@type": "Person",
            "name": "Tony Bennett",
            "url": "/name/nm0004746/"
        },
        {
            "@type": "Person",
            "name": "Tommy Bishop",
            "url": "/name/nm2200508/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 174,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0627878/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0664753/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071395/"
        },
        {
            "@type": "Person",
            "name": "Colin Escott",
            "url": "/name/nm1660892/"
        },
        {
            "@type": "Person",
            "name": "Morgan Neville",
            "url": "/name/nm1365879/"
        }
    ],
    "datePublished": "2004-06-23",
    "description": "The authoritative documentary on Country Music's most influential figure.",
    "director": [
        {
            "@type": "Person",
            "name": "Morgan Neville",
            "url": "/name/nm1365879/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary",
        "Biography",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTQ3OTZiNTctNTgyYi00MWE2LWFmMmQtYzJlMDJkNTY2NWE0XkEyXkFqcGdeQXVyNjA2OTE5NDI@._V1_.jpg",
    "keywords": "country music,song,singing,music episode,alabama",
    "name": "Hank Williams: Honky Tonk Blues",
    "original_info": {
        "id": "Hank Williams: Honky Tonk Blues_2004",
        "name": "Hank Williams: Honky Tonk Blues",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "st-shot"
        },
        "dateCreated": "2009-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0415490/"
        },
        "name": "Decent bio on the Verdi of country music.",
        "reviewBody": "Mid way through this bio on the greatest C&W singer songwriter of the 20th Century one of the Driftin' Cowboys (band members) mentions that \"Legends in the making don't seem like legends\". Hank Williams meteoric rise and fall at age 29 working outside the maximum exposure arenas of Hollywood and New York left a scant amount of material and archival footage for the makers of this documentary to assemble; but they have done an admirable job in putting together the most credible visual bio on this legendary superstar whose music 55 years later is still covered by major recording artists.\n\nThe self destructive Williams may not have gotten past high school, read War and Peace or Shakespeare but the songs he wrote and warbled with that vulnerable voice (a combination of Acuff and Tubbs) spoke to a vast audience, not only down South but throughout the world. Not bad for a simple country boy. Williams like Presley was heavily influenced by black blues singers, hooking up in the segregated south with a black street musician who also tutored him. First making it big at the Hayloft Jamboree in Shreveport, Louisiana and then onto the Grand Old Opry in Nashville. Hank had his demons however and he wore out his welcome at both venues before he himself wore out and died on New Year's day in 53.\n\nWriter/Director Morgan Neville working with grainy home movies, rare stills and TV footage of Williams performing interspersed with anecdotes of a multitude of Driftin' Cowboys, friends, fellow performers and a very frank widow does a fine job of fleshing out the legend. It's a tragic tale that Neville deftly avoids from becoming overbearingly morose by playing good chunks of Williams tunes and balancing the difficult times with the carefree. Watching Hank perform Hey Good Lookin' on stage is nothing else if not life re-affirming.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H28M",
    "url": "/title/tt0415490/"
}