{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gene Wilder",
            "url": "/name/nm0000698/"
        },
        {
            "@type": "Person",
            "name": "Gilda Radner",
            "url": "/name/nm0705717/"
        },
        {
            "@type": "Person",
            "name": "Kathleen Quinlan",
            "url": "/name/nm0000599/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2855,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Henry Rosenbaum",
            "url": "/name/nm0742132/"
        },
        {
            "@type": "Person",
            "name": "David Taylor",
            "url": "/name/nm0852224/"
        }
    ],
    "datePublished": "1982-06-04",
    "description": "Completely innocent man, Michael Jordon, is drawn into a web of government secrets when a girl carrying a mysterious package gets into a taxi with him. When she's later murdered, Michael becomes the chief suspect and goes on the run.",
    "director": [
        {
            "@type": "Person",
            "name": "Sidney Poitier",
            "url": "/name/nm0001627/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmIyZjZiNDQtMTBjYy00M2EyLTkwZDAtYzY4MGE4YjNkMjQzXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "hotel,on the run,injection,helicopter,rhyme in title",
    "name": "Hanky Panky",
    "original_info": {
        "id": "Hanky Panky_1982",
        "name": "Hanky Panky",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oOoBarracuda"
        },
        "dateCreated": "2016-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0084049/"
        },
        "name": "\"You had lots of chances to run but you didn't, you're still here with me, and I'm glad.\"",
        "reviewBody": "In 1982, Gene Wilder took a break from writing and the director's chair to solely serve as the star of Sidney Poitier's 1982 film Hanky Panky. Pairing with him as a female lead was Gilda Radner. The two first met on the set and love quickly blossomed culminating in a marriage a few years later. It all began on Hanky Panky where the two principles become two people, one wrongly accused of a crime, running from the law together to protect their names and solve a mystery while they're at it. \n\nMichael Jordon (Gene Wilder) is an architect visiting New York on business when he jumps into a cab with a distressed woman, Janet Dunn (Kathleen Quinlan). Through flirting and trying to get Janet to have a drink with him, she tells him she is on the run and asks him to put an envelope into a mailbox for him. Michael obliges and unwittingly puts himself in harms way delivering this package. to try to clear things up, Michael travels back to the hotel she was staying in, only to find her in a scuffle with another man. Being filmed on camera at the scuffle with a gun in his hand, he is believed to be the nefarious character she was fighting with. With everyone chasing him despite his innocence, Michael tries to evade, seeking refuge in the apartment he was staying in while in New York. As he is packing his suitcase in the apartment, a woman Kate Hellman (Gilda Radner) comes in, and believing she is a burglar, Michael fights her until the lights are turned on and the two realize neither is a danger. When the police show up at the apartment, Michael has to leave immediately, and Kate decides to come with him to both aid in clearing his name and investigate her brother's death personally. Neither can expect just what they will have to do to get these goals accomplished, but are in it together, as long as it takes. \n\nIt is almost magical to see a real life romance blossom on-screen. Gene Wilder and Gilda Radner's incredible chemistry is apparent, even if one is only half watching the film. The chemistry is sensational; you can really tell the two are falling in love, and makes Hanky Panky all the more fun to watch. There were also a number of great comedic gags in the film. The scene in which Michael takes over flying a plane is almost as hilarious as the scene in which Michael needs a change of clothes and takes a magic suit and can't find his change on a bus. The comedy was not without its flaws, however. For instance, there is so much going on in the film that not everything gets fleshed out by the film's end. The entire mystery is never solved, or revealed to the audience, so it is a little hard to become too invested in the film. That being so, Hanky Panky is a good Saturday night comedy that you won't regret watching, even if it's only to see Gene Wilder and Gilda Radner fall in love.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3117400089",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmFjZTcxZWEtZDRmNy00MWRiLTgzYWItNjkxY2M4MDNmZjAwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmFjZTcxZWEtZDRmNy00MWRiLTgzYWItNjkxY2M4MDNmZjAwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-26T13:31:38.732Z",
        "url": "https://www.imdb.com/video/vi3117400089/"
    },
    "url": "/title/tt0084049/"
}