{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mia Farrow",
            "url": "/name/nm0001201/"
        },
        {
            "@type": "Person",
            "name": "Dianne Wiest",
            "url": "/name/nm0001848/"
        },
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 72984,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001995/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008432/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "datePublished": "1986-03-14",
    "description": "Between two Thanksgivings two years apart, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWZiNWUwYjMtM2Y1Yi00MTZmLWEwYzctNjVmYWM0OTFlZDFhXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
    "keywords": "thanksgiving,midlife crisis,bad date,reference to cole porter,family relationships",
    "name": "Hannah and Her Sisters",
    "original_info": {
        "id": "Hannah and Her Sisters_1986",
        "name": "Hannah and Her Sisters",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JawsOfJosh"
        },
        "dateCreated": "2002-09-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091167/"
        },
        "name": "Woody's more mature rumination on Manhattan life & love with an impeccable ensemble cast",
        "reviewBody": "While I am a Woody Allen fanatic, I'm not sure if I agree with the minority of Woody fans who claim this is his best film, instead of \"Annie Hall\". Sure, I would be quick to elect \"Annie\" as Woody's best, but then I regard \"Manhattan\", \"Stardust Memories\", \"Crimes & Misdemeanors\", as well as \"Hannah And Her Sisters\", and I become unsure. This is certainly one of Woody's most mature films, and I would freely place it in my top five of Woody's works. It nicely balances comedy with drama, and it also began a new era of high accomplishment for Woody. Functioning as an ensemble drama loosely organized around three sisters, \"Hannah\" chronicles several stories at once. The film has an incredibly warm, intimate feeling about it, as people talk in their earth-toned apartments over J.S. Bach or stroll through the city's crisp autumn air. What rings most true about this film is that it doesn't end quite the way you thought it would (the words \"too tidy\" and \"unpunished\" get unfairly used a lot), yet it ends as it should. \n\n Ironically, Hannah (played by Mia Farrow) doesn't fare too deeply in the film. The eldest of three, she's the family matriarch soothing her aging parents, a showbiz couple reluctantly settling into old age and blaming each other for it. Her husband Elliot (Michael Caine expertly stuttering & flushing) is consumed with guilt over his heavy crush on Hannah's sensuous, down-to-earth sister, Lee. Lee is slowly pulling away from her failing relationship with Frederick (the always excellent Max Von Sydow), a horribly misanthropic curmudgeon whose reliance on her as his last link to humanity becomes suffocating. The youngest sister, Holly (Dianne Wiest - kicking ass as usual), is a nervous, impatient actress whose insecurity and lack of success lead to competing with her best friend April over work and men. Meanwhile, Hannah's ex-husband Mickey (Woody), a severe hypochondriac, is trying desperately to accept his eventual mortality and still find some meaning in life, which it what it seems all the other characters are trying to do. I won't say where the stories are going or where they all end up, but I will say the ensemble cast is all-around great, Michael Caine and Dianne Wiest are definitely the stand-outs here (their Oscars were well-deserved), but Max Von Sydow and Barbara Hershey do quite fine as well. As for Woody - Mickey is the kind of character that fans were probably waiting for him to play for years, and he pulls it off with his classic ticks & twitches. \n\nWoody's evident genius is shown here by juggling the separate stories back & forth so fluidly. Most attention seems to be focused on Elliot and Lee during the first half (both conflicted & confused), while the second half slightly centers around Mickey and Holly (both nervous & unsure). Mickey operates mostly as an outsider and the strength of his story doesn't pertain too much to \"the sisters\" (although there are two hysterical flashbacks sequences, one involving Hannah and the other detailing a disastrous date with Holly). Another masterstroke on Woody's part are the internal voice-overs. Woody is too smart to know that there are certain thoughts a person has that will exist only in their head, and extracting these feelings into some kind of dialogue with another person would seem forced. It's casual pacing, novelistic endeavors, vivid characters, cozy settings, heartfelt music and sharp, candid dialogue are what makes this film hold up beautifully for me after dozens of viewings. It's an absolute Woody Allen film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Orion Pictures",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4155179289",
        "name": "Hannah and Her Sisters",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDNlMDEwZmYtMzc1MC00M2MzLTliODUtMGRkMDQ5MGU1OGNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDNlMDEwZmYtMzc1MC00M2MzLTliODUtMGRkMDQ5MGU1OGNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:22:19Z",
        "url": "https://www.imdb.com/video/vi4155179289/"
    },
    "url": "/title/tt0091167/"
}