{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shintarô Katsu",
            "url": "/name/nm0441526/"
        },
        {
            "@type": "Person",
            "name": "Keiko Aikawa",
            "url": "/name/nm0014554/"
        },
        {
            "@type": "Person",
            "name": "Kazuko Inano",
            "url": "/name/nm0408585/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1233,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Hanzo the Razor: The Snare",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037408/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Kazuo Koike",
            "url": "/name/nm0463521/"
        },
        {
            "@type": "Person",
            "name": "Yasuzô Masumura",
            "url": "/name/nm0557945/"
        }
    ],
    "datePublished": "1973-08-11",
    "description": "During the currency devaluation by the Edo treasury, officer Hanzo deals with a temple priestess who sells her pupils as prostitutes, and a notorious thief who plans to rob the mint.",
    "director": [
        {
            "@type": "Person",
            "name": "Yasuzô Masumura",
            "url": "/name/nm0557945/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGQxZmVkMWYtMGVmOS00NjU1LWI0OGYtNGI5ZTY2ZTg1Mzc0XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "sexploitation film,female nudity,samurai,rape,grindhouse film",
    "name": "Goyôkiba: Kamisori Hanzô jigoku zeme",
    "original_info": {
        "id": "Hanzo the Razor: The Snare_1973",
        "name": "Hanzo the Razor: The Snare",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "asinyne"
        },
        "dateCreated": "2007-12-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0174707/"
        },
        "name": "insanely wild, insensitive, a bit shocking!",
        "reviewBody": "I am a huge Shintaro Katsu fan. He is mostly famous for portraying Zatoichi the blind swordsman in literally dozens of films and television episodes. Katsu is probably one of the greatest actors that ever lived and is absolutely the best action flick icon of all time. Hanzo the Razor is a fairly drastic departure from Zatoichi in many respects. Yeah, both both series of films are Samurai flicks and great ones but the characters and feel is very different. Zatoichi is basically a nice guy...sure hes a gambler, killer, bum, and woman chaser but he actually feels badly after he dices up a horde of bad guys. Hanzo is a lawman...a very dedicated lawman who will literally stop at nothing to do his job. He makes Matt Dillon look like Barney Fife. The Hanzo films are extreme to an outrageous degree. The blood flows like Niagara Falls, Hanzo has no problem torturing folks during interrogations, he does his own autopsies using mostly his fingers, and he his pretty much a rude jerk to everyone he encounters. During the course of this film Hanzo allows himself to be buried alive in order to infiltrate the bad guys' compound, he battles ninjas, hordes of thugs, a satanic witch giving abortions, evil nuns, corrupt government officials, macho samurai, and a gang of gnarly mass murdering thieves.\n\nIf all else fails....threats, torture, insults, etc. Hanzo rapes any woman who withholds information (including the good ones!!???) It seems that Hanzo's reproductive appendage is so enormous that any female will spill her guts to receive more of Hanzo's \"pleasure\" torture. Also nicknamed the \"razor\", our hero is the envy of all the other men in town....not to mention the most feared.\n\nIf you like Samurai flicks and you want something bloody, lurid, and featuring Shintaro Katsu you can't go wrong here. Not for the squeamish or easily offended...not hardly!!! I liked it but even I must say there were numerous scenes where I found myself thinking....you got to be kidding me...he didn't just do THAT????\n\nA real can't miss for fans of Shintaro Katsu or Zatoichi the Blind Swordsman. While Hanzo the Razor is not the friendly blind guy it is fascinating just the same.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0174707/"
}