{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leslie Cheung",
            "url": "/name/nm0002000/"
        },
        {
            "@type": "Person",
            "name": "Tony Leung Chiu-wai",
            "url": "/name/nm0504897/"
        },
        {
            "@type": "Person",
            "name": "Chang Chen",
            "url": "/name/nm0151654/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 31143,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "Happy Together",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074316/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070147/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022114/"
        },
        {
            "@type": "Person",
            "name": "Manuel Puig",
            "url": "/name/nm0700194/"
        },
        {
            "@type": "Person",
            "name": "Kar-Wai Wong",
            "url": "/name/nm0939182/"
        }
    ],
    "datePublished": "1997-05-30",
    "description": "A couple take a trip to Argentina but both men find their lives drifting apart in opposite directions.",
    "director": [
        {
            "@type": "Person",
            "name": "Kar-Wai Wong",
            "url": "/name/nm0939182/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4ODY4MjY2MF5BMl5BanBnXkFtZTcwNTE0MDMzNA@@._V1_.jpg",
    "keywords": "lamp,gay couple,buenos aires argentina,apartment,gay sex",
    "name": "Chun gwong cha sit",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jandesimpson"
        },
        "dateCreated": "2002-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118845/"
        },
        "name": "A study of a traumatic relationship",
        "reviewBody": "\"Happy Together \" is essentially a study of a couple falling in and out of love. Their sex - they are a gay couple from Hong Kong - hardly matters: the film could just as well have been about a straight or lesbian couple. The fact that very near the beginning there is as explicit a scene of male anal intercourse as one is likely to encounter in mainstream commercial cinema is far from gratuitously sensational. As the film is meant to start on a passionate high, this is the most convincing way of doing it - so be it. The director has the integrity not to repeat this for the reason that the couple never quite feel the same about each other again - indeed there is a great deal of alienation. Both have arrived in Argentina in search of work. Although the jobs undertaken by one of the pair, Lai, are fairly menial, first as a doorman at a Tango club and then a kitchen worker, he seems more stable than his companion, Ho, who does little but hustle, gets beaten up fairly early on and spends much of his time in an incapacitated state. In the room they share there is a lampshade depicting the Izuazi Falls. The cascade almost becomes a symbol for the relationship they would ideally like to achieve. Early on they hire a car to look for it but lose their way. After their relationship has finally broken Lai finds it, but as he is alone, the landmark seems sadly lacking in excitement. There is a third main character, a straight guy from Taiwan, who works in the kitchen with Lai. With his amiable self-sufficiency he seems to have been introduced to provide a balance to the angst of the main pair, a device that works well as it reinforces our sympathy for them. \"Happy Together\" looks rough and crude. A hand held camera is used with frenetic nervousness. Sequences of monochrome alternate with scenes that are almost perversely over-coloured. I know it is fashionable to give some films a nightmarish look. Here I found it a distinct stumbling block to be got over for the sake of a work that says so much about loneliness, homesickness and the struggle of people simply to be \"happy together\"."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Kino International",
        "duration": "PT1M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3332768025",
        "name": "Happy Together",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDdlOWViZGItY2Y3Ni00ZTU5LTg0OGEtYWRiYzVmMDE2ZTQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDdlOWViZGItY2Y3Ni00ZTU5LTg0OGEtYWRiYzVmMDE2ZTQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:05:56Z",
        "url": "https://www.imdb.com/video/vi3332768025/"
    },
    "url": "/title/tt0118845/"
}