{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean-Claude Van Damme",
            "url": "/name/nm0000241/"
        },
        {
            "@type": "Person",
            "name": "Lance Henriksen",
            "url": "/name/nm0000448/"
        },
        {
            "@type": "Person",
            "name": "Yancy Butler",
            "url": "/name/nm0000319/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 53213,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049706/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047594/"
        },
        {
            "@type": "Person",
            "name": "Chuck Pfarrer",
            "url": "/name/nm0679326/"
        }
    ],
    "datePublished": "1993-08-20",
    "description": "A woman hires a drifter as her guide through New Orleans in search of her missing father. In the process, they discover a deadly game of cat and mouse behind his disappearance.",
    "director": [
        {
            "@type": "Person",
            "name": "John Woo",
            "url": "/name/nm0000247/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjc5YmU3MjUtNmRhYy00MjQ5LWI1ZTMtOGQzYTE1N2I4ZTEzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "crime boss,organized crime,mercenary,drifter,missing person",
    "name": "Hard Target",
    "original_info": {
        "id": "Hard Target_1993",
        "name": "Hard Target",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DaRick89"
        },
        "dateCreated": "2012-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107076/"
        },
        "name": "Competent action thriller",
        "reviewBody": "As with many action movies, Hard Target's strengths and weaknesses are fairly simple to analyse. It's a competent action thriller, notable for some stylish action scenes that have John Woo's touch; one particularly memorable example is when Chance Boudreaux (Jean-Claude Van Damme) quite literally blasts a bikie thug out a window with a shotgun and a petrol can! These moments pretty much make the film worth seeing by themselves, despite the usual weaknesses in the plotting and JCVD's ever wooden countenance. As JCVD himself noted however, viewers paid the money to see him waste bad guys and he does plenty of this - sometimes in more inventive ways than expected (using snake traps). It very much makes the film worth seeing for action buffs, even though I'm reluctant to give a really high rating based on this alone.\n\nThe plot is not too extraordinary: a homeless veteran gets murdered by a team of mercenaries led by Emil Fouchoud (Henriksen) and Van Cleaf (Vosloo), after which his daughter Nat (Butler) comes looking for him and commissions Boudreaux, a homeless Cajun merchant marine (!) to help her out after he rescues her from marauding thugs, raising the ire of the mercenary team. A few plot holes are obvious (shouldn't this mercenary team have been dealt with a while ago, police strike or not? Why is JCVD made a CAJUN?), but it works well as a vehicle for blowing stuff up and killing people. \n\nThe dialogue is pretty standard stuff: some profanity, some hilariously cringeworthy lines (\"don't worry about Randall; he's all ears!) and some macho stuff. \n\nAs for the acting, the villains are better than the heroes. Of course, when JCVD is your hero, that's bound to be the case, with his unconvincing delivery. He has recently shown that he is capable of acting, but he was a long off that in 1993. Still, English is probably his third language (after French and Dutch); Yancy Butler has no such excuses, being quite wooden in a role that doesn't demand that much. Vosloo and Henriksen are much better though. Vosloo has that quiet menace that always makes him a good villain, while Henriksen goes from menacing and purposeful to merrily nuts as Boudreaux causes him more difficulties than expected. Even Wilford Brimley is amusing as Chance's crazy uncle, reeling off some zany lines. \n\nIn the end, Hard Target is not a great movie, but it's a competent action thriller with some nice stylistic touches from John Woo during the action scenes. Henriksen, Vosloo and Brimley compensate somewhat for JCVD and Butler, but you still shouldn't watch this film for the acting and especially not for the plotting. Action fans generally don't really look for either that much though, so that's alright. Movie- goers looking for a bit more will probably like some of the style, but won't find that much else.\n\n3/5 stars",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2432214553",
        "name": "Hard Target",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGUxYmVmYmMtMjAxMS00MGMzLTk4YzgtZGQzMDJmZWU3NGVlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGUxYmVmYmMtMjAxMS00MGMzLTk4YzgtZGQzMDJmZWU3NGVlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-03-30T04:13:30Z",
        "url": "https://www.imdb.com/video/vi2432214553/"
    },
    "url": "/title/tt0107076/"
}