{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kôichi Yamadera",
            "url": "/name/nm0945290/"
        },
        {
            "@type": "Person",
            "name": "Toshihiko Seki",
            "url": "/name/nm0782841/"
        },
        {
            "@type": "Person",
            "name": "Tarô Ishida",
            "url": "/name/nm0410937/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 267,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Harlock Saga",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056118/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007534/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        }
    ],
    "datePublished": "2001-05-08",
    "description": "Captain Harlock and his friends must recover several stolen pieces of gold before they get turned into a very powerful ring.",
    "genre": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIzOTQ5NTYwN15BMl5BanBnXkFtZTcwMzI2NTAyMQ@@._V1_.jpg",
    "keywords": "outer space,30th century,alien invasion,arcadia,based on manga",
    "name": "Harlock Saga: Nibelung no yubiwa 'Rhein no ôgon'",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wh-3"
        },
        "dateCreated": "2001-08-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0185351/"
        },
        "name": "Welcome, if imperfect, return of the space pirate",
        "reviewBody": "Having first seen Captain Harlock, subtitled, on a Japanese UHF-TV channel here in New York in the late 70's, I was hooked on the highly stylized, sci-fi melodrama. The 42 episode series was quite unlike anything that was on TV at the time and it's unfortunate that it hasn't found some sort of re-release in Japan or here in the U.S. That said, Harlock has been seen here in the US release of the Galaxy Express 999 feature film and the unusual \"Arcadia of my Youth\" which was produced later but is a prequel to the original TV series. One thing to note is that the author of the all of the comic books, TV series and movies is very loose with the chronology and he doesn't mind changing the background stories of the characters to suit the plot of his present project.\n\nThat said, anyone who remembers the original series or the other works will have to accept that two of the recurring characters, in this release, have been changed yet have the same names. This collection of a six episode limited series is loosely based on the Wagner Ring operas and the excellent music heard is either Wagner or very closely based on Wagner. The animation style is very much like the original 1970's series, right down to the sometimes clumsy perspective rendering of the highly detailed spaceships. The story seems to have been patched together rather quickly and there are some large plot holes because of it. A big disappointment is the promised big battle between Harlock's ship, the Arcadia, and the main villain's massive space force. Each episode starts with an opening montage that shows the battle about to start but when we finally get to it in episode six, it doesn't happen. Something else rather interesting happens but no super battle.\n\nIt's great to have Captain Harlock back in series form and many of the qualities that made the original series memorable for me in the late 70's are here too. It's hard to enthusiastically recommend this to anyone who is expecting the usual anime pyrotechnics and bombast. Harlock has always been more of a hard drama. Hopefully we may someday see the original series released on DVD.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Central Park Media",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1823211801",
        "name": "Harlock Saga",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjMwZWJiYmMtMDc2MS00Zjc2LWI5YmMtNDU1MjE0YzM5MjExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjMwZWJiYmMtMDc2MS00Zjc2LWI5YmMtNDU1MjE0YzM5MjExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:23:52Z",
        "url": "https://www.imdb.com/video/vi1823211801/"
    },
    "url": "/title/tt0185351/"
}