{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sharon Stone",
            "url": "/name/nm0000232/"
        },
        {
            "@type": "Person",
            "name": "Connor Matheus",
            "url": "/name/nm0558585/"
        },
        {
            "@type": "Person",
            "name": "Spencer Breslin",
            "url": "/name/nm0107748/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 138,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "TV-Y",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074221/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0728364/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061343/"
        },
        {
            "@type": "Person",
            "name": "Carin Greenberg",
            "url": "/name/nm1740768/"
        },
        {
            "@type": "Person",
            "name": "Jeff Kline",
            "url": "/name/nm0458807/"
        }
    ],
    "datePublished": "2001-12-01",
    "description": "Harold 's a inquisitive 4 year old, and with his purple crayon, he has the power to create a world of his own - just by drawing it. Harold wants to go for a walk in the moonlight, but there's no moon, so he draws one. He has nowhe...",
    "genre": [
        "Animation",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg1MTg5NDUyNF5BMl5BanBnXkFtZTcwMTgwMjcyMQ@@._V1_.jpg",
    "keywords": "color in title,color in series title,character name in series title,drawing,four year old",
    "name": "Harold and the Purple Crayon",
    "original_info": {
        "id": "Harold and the Purple Crayon: The Complete Series_2001",
        "name": "Harold and the Purple Crayon: The Complete Series",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MxMint32e"
        },
        "dateCreated": "2021-10-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283735/"
        },
        "name": "A miniseries filled with the charm and whimsy of childhood",
        "reviewBody": "Many people have seen the classic \"Harold and the Purple Crayon\" short from 1959, distributed by Weston Woods and narrated by Norman Rose. It's nothing particularly outstanding for its time, but being based off the timeless book by Crockett Johnson, it does have its merits. Most notably is the film's minimalist style of outlining Harold's purple drawings on a plain white background with Harold being the only moving element of the film. However, there is one adaptation of Harold that I believe took Crockett Johnson's book to the next level, and far surpasses the simplistic charm of Weston Woods' short.\n\nIn the \"Harold\" miniseries created by HBO Family, Harold's world isn't limited to a single white plane with purple as its only color source (save Harold's blue pajamas). His crayon dimension practically dances across the screen, with vibrant colors, highly imaginative scenery, and musical numbers by Van Dyke Parks that allow for semi-surrealist sequences that are truly a treat to the senses without ever becoming overwhelming or cluttered. Admittedly, allowing every purple-lined object to be in full-color and have freedom of movement is a big departure from the books, but it all works beautifully, and helps to engage even the youngest viewers into the story.\n\nWhat should be emphasized is that this series is meant for the youngest viewers. Each bedtime adventure alternates between long stretches of exploration, calming but engaging narration by Sharon Stone, and the aforementioned songs by Van Dyke Parks, each with plenty for children to see and interact with in their minds. Yet, it should also be emphasized that this show never panders to its parent audience. What impresses me about what HBO did with this miniseries, more than anything, is that they created an innocent and gentle atmosphere that appeals to the child in everyone. There is a soft touch within \"Harold\", a tender, caring embrace that permeates the very being of each episode like a mother's kiss goodnight. There was obviously a lot of care into making Harold's adventures fun and endearing.\n\nAt this point in the review, it has become clear that there are multiple adventures, not just the classic journey, that Harold takes the viewer on. The first episode is an adaptation of the original Harold book, while the twelve episodes after that are entirely new stories created for the miniseries. These twelve adventures have a slightly different feel than the first, but still manage to create dynamic stories worthy of the iconic character. Each features some sort of moral lesson or answers a question that Harold has before bed, with the conflict resolved by problem-solving and always in a gentle manner. An art museum, a giant fish bowl with a mermaid, and a bug-sized garden are just a few of the places that Harold visits, each designed with numerous elements for Harold to interact with. Add a purple crayon that can bring literally anything into existence, and the possibilities become endless. The writers and animators took this mechanic to their advantage, allowing the protagonist to draw anything he might want or need, while allowing the \"natural\" crayon world to take center focus.\n\nTo sum it up, \"Harold and the Purple Crayon\" is a brilliant miniseries with loads of charm, a soothing atmosphere, and a beautiful visual world. For all of you conspiracy buffs who say that Harold never really made it home, the end of every episode proves that to be very wrong. In reality, Harold always comes back to his real-life bedroom, closes his eyes, and drifts off into a peaceful, happy sleep.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Harold & The Purple Crayon",
        "duration": "PT1M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi439205145",
        "name": "Harold & The Purple Crayon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWQxMjRjMWItMDRjMi00NjU5LTllNDQtOWQyNjA0NjhmODc3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWQxMjRjMWItMDRjMi00NjU5LTllNDQtOWQyNjA0NjhmODc3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-10T22:04:48.771Z",
        "url": "https://www.imdb.com/video/vi439205145/"
    },
    "url": "/title/tt0283735/"
}