{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harry Connick Jr.",
            "url": "/name/nm0001065/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 48,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "description": "The New York Big Band Concert features Harry Connick Jr. bringing the sound of the Big Easy to the Big Apple! This special set features 13 performances from his record-breaking 15-night engagement at New York City's Paramount Thea...",
    "director": [
        {
            "@type": "Person",
            "name": "Jill Goodacre",
            "url": "/name/nm0004969/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkzNzI0MDIyN15BMl5BanBnXkFtZTcwMTIyMjUyMQ@@._V1_.jpg",
    "keywords": "live performance,concert film,crooner,character name in title",
    "name": "Harry Connick Jr.: The New York Big Band Concert",
    "original_info": {
        "id": "Harry Connick Jr.: The New York Big Band Concert_1993",
        "name": "Harry Connick Jr.: The New York Big Band Concert",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ccthemovieman-1"
        },
        "dateCreated": "2007-01-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0239028/"
        },
        "name": "Multi-Talented Connick On Disply In this Feel-Good Concert",
        "reviewBody": "This concert turned out to be a very pleasant surprise. If you like an excellent singer and performer and like the brassy sound, you'll love this. I won't got that far because I am not a fan of big band music.....but this was an enjoyable and fun hour of entertainment. The only disappointment was that the DVD wasn't much better quality than the VHS tape.\n\nConnick is a modern-day Frank Sinatra, a guy with a great voice, a cock-sure attitude (but not arrogant), knows how to ad-lib between songs and has a way of making ordinary songs sound extraordinary. He may not be exactly in Sintra's class as a singer but he's a better entertainer, at least in the clowning-around department. Sometimes he clowns around too much, ruining part of a song here and there by getting silly.\n\nWhen he sticks to his music he's amazing, whether he's singing, playing the piano, the drums or anything else. He's multi-talented as you will see watching this hour-long concert. The band isn't bad, either, and shows its stuff in the finale, \"All Of me.\" You see the band members really like the star, too. There is excellent chemistry among all.\n\nIt's just a feel-good, fun concert.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0239028/"
}