{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andie MacDowell",
            "url": "/name/nm0000510/"
        },
        {
            "@type": "Person",
            "name": "Scott Anton",
            "url": "/name/nm0031229/"
        },
        {
            "@type": "Person",
            "name": "Elias Koteas",
            "url": "/name/nm0000480/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6539,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009163/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056755/"
        },
        {
            "@type": "Person",
            "name": "Isabel Ellsen",
            "url": "/name/nm0255284/"
        },
        {
            "@type": "Person",
            "name": "Élie Chouraqui",
            "url": "/name/nm0159402/"
        },
        {
            "@type": "Person",
            "name": "Didier Le Pêcheur",
            "url": "/name/nm0494558/"
        }
    ],
    "datePublished": "2002-03-15",
    "description": "When a Newsweek photojournalist disappears in war-torn Yugoslavia, his wife travels to Europe to find him.",
    "director": [
        {
            "@type": "Person",
            "name": "Élie Chouraqui",
            "url": "/name/nm0159402/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjgzZWZiYTEtN2U5Zi00OGRlLWJjMmItOTFiYzA4N2ViZmQyXkEyXkFqcGdeQXVyODA5MjI2NTk@._V1_.jpg",
    "keywords": "forename in title,two word title,croatian war of independence,vukovar croatia,battle of vukovar",
    "name": "Harrison's Flowers",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "philip_vanderveken"
        },
        "dateCreated": "2005-08-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0216799/"
        },
        "name": "Realistic and not for the faint of heart",
        "reviewBody": "I don't know what it is that made me decide to give this movie a try. All I knew was that this was some kind of war movie from an unknown French director, with Andie MacDowell - not exactly my most favorite actress - and Adrien Brody - who was excellent in \"The Pianist\", but who I didn't see play in any other movie since. Those aren't exactly strong reasons why I shouldn't miss it and yet I was willing to give it a try, probably because I hoped to be surprised by it. And that's exactly what it did.\n\nHarrison Lloyd is a photojournalist who has already won a Pulitzer price with his photographs of several wars. But he now has a wife and two children and he doesn't want to go to another war-zone anymore, because he is afraid that he might die while doing his job. He wants to change jobs, but his boss has given him one last assignment. He'll have to travel to ex-Yugoslavia, where the civil war has just started. What appears to be a small incident at first, quickly proves to be one of the most gruesome wars in recent history and it doesn't take long before Harrison is missing, presumably dead. But his wife Sarah refuses to believe that he's no longer alive and decides to go after him and to look for him. As she penetrates deeper into the war zone, she is confronted with all the horrors that were committed in this war: random executions of soldiers and civilians, rape, snipers, the uncertainty of where and who the enemy is,...\n\nAt first I must say that I didn't like this movie all too much. This seemed to be like yet another Hollywood product about a perfect and happy family who is all a sudden thorn apart by some unfortunate event, who learns to deal with the pain, building up a new life without the missing person and so on, and so on. Nothing new, nothing special. But then it all started to change... a lot. As soon as she is in ex-Yugoslavia, being confronted with all the horrors of that civil war, it was as if I was struck by lightening. Never have I seen so much realistic images in a movie about this war. This started to feel more like a documentary, rather than like a movie. It was all so incredibly realistic and I can't say that they have left anything out. Young children murdered and raped; soldiers and civilians, man and woman, old and young,... executed in front of your eyes; all the explosions and the attacks;... It seems like you're all witnessing it live, as if you are seeing it through the eyes and the lenses of the photojournalists yourself. It was incredible...\n\nThe performances in this movie are more than OK and Andie MacDowell was a pleasant surprise in this one, although I must say that I liked her performance a lot more once she was the journalist in ex-Yugoslavia. Before that I sometimes found her acting a bit too much and quite unrealistic (take for instance the several scenes in which she is constantly falling when she hears bad news). I didn't really have the feeling that the wife of a war photographer, who constantly lives with this kind of uncertainty, would act and react the way she did. But as I said before, I forgot about that as soon as she was in Europe. However, the best performances in my opinion were those of Adrien Brody - who was excellent as the drug using, alcohol abusing and cynical Kyle Morris - and Brendan Gleeson as Marc Stevenson.\n\nIn the end this is a very fine movie about the Yugoslavian civil war. It's too bad that the first part of the movie didn't convince me all that much, because in my opinion it wasn't all that strong, but overall I really liked what I saw. That's why I give this movie a well-deserved 7.5/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When a Newsweek photojournalist disappears in war-torn Yugoslavia, his wife travels to Europe to find him.",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2935800345",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjgzMDA2OWQtZmFkMC00NWNhLWI2ZjYtZGQ4NjRiZmRiNzBlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjgzMDA2OWQtZmFkMC00NWNhLWI2ZjYtZGQ4NjRiZmRiNzBlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-05-27T20:08:29.297Z",
        "url": "https://www.imdb.com/video/vi2935800345/"
    },
    "url": "/title/tt0216799/"
}