{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel Radcliffe",
            "url": "/name/nm0705356/"
        },
        {
            "@type": "Person",
            "name": "Emma Watson",
            "url": "/name/nm0914612/"
        },
        {
            "@type": "Person",
            "name": "Rupert Grint",
            "url": "/name/nm0342488/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 649860,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046151/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0159772/"
        },
        {
            "@type": "Person",
            "name": "J.K. Rowling",
            "url": "/name/nm0746830/"
        },
        {
            "@type": "Person",
            "name": "Steve Kloves",
            "url": "/name/nm0460141/"
        }
    ],
    "datePublished": "2004-06-04",
    "description": "Harry Potter, Ron and Hermione return to Hogwarts School of Witchcraft and Wizardry for their third year of study, where they delve into the mystery surrounding an escaped prisoner who poses a dangerous threat to the young wizard.",
    "director": [
        {
            "@type": "Person",
            "name": "Alfonso Cuarón",
            "url": "/name/nm0190859/"
        }
    ],
    "duration": "PT2H22M",
    "genre": [
        "Adventure",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY4NTIwODg0N15BMl5BanBnXkFtZTcwOTc0MjEzMw@@._V1_.jpg",
    "keywords": "werewolf,rat,magic,wizard,school of magic",
    "name": "Harry Potter and the Prisoner of Azkaban",
    "original_info": {
        "id": "Harry Potter and the Prisoner of Azkaban_2004",
        "name": "Harry Potter and the Prisoner of Azkaban",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "joshuafagan-64214"
        },
        "dateCreated": "2015-09-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0304141/"
        },
        "name": "Best Film of the Series; One of the Best Films of All Time",
        "reviewBody": "I wish Alfonso Cuaron would come back to the franchise. I know that he probably won't, but I still hope. After all, as we float through this empty, depressing world, sometimes all we have is hope. He detached this film franchise from its safe-as-a-CIA-file roots and allowed it to grow wings and fly into a silver ether. To anyone who thinks franchise films cannot be art... check out LOTR. But once you are done, check out this film. It is both ironic and darkly appropriate that this is both the lowest grossing Harry Potter film and the one that many film critic types, such as myself, say is the greatest of the octology.\n\nThe film starts off like do all Harry Potter books and most Harry Potter movies. Potter is at the house of his over-the-top, abusive, Muggle adopted family, getting tormented like he always does. Yes, I know it is explained in detail why he needs to stay with them, but such doesn't make it any less of a poor writing choice. But, when and if I do a full review of the Potter series, I'll go over those kinds of decisions. \n\nI only bring this up because it is a base line for these movies and such something I can use to show why this is the best one. In the Columbus films, it is played with a cheerful exaggeration that reminds me of many of his eighties movies. This is not a bad thing, but it is not brimming with greatness either. In the Yates films, it is downplayed as just a backdrop, a facade, if you will, to more serious matters. Cuaron manages to combine these approaches, which is expected, as both this and GOF are the 'transition movies', while adding both sophistication and a level of charged rawness, which is not expected.\n\nWe get to see Harry's emotional landscape. Fragile but potent, unstable but unyielding, it is a sight to behold, one that belies the simpler character that we got in both the earlier and later movies. If Harry Potter developed along these lines, he might have actually been a great character instead of the flattest one among a crowd of interesting people.\n\nThe scenes are magical, but not in the try-hard way of the first two films. Around the time that I first saw them, I declared myself a true blue of the series. I haven't looked back since. The shots are magical in a way that is both wispy and intense. This is the tone that these movies should have taken, and if they reboot them, something of I am not in favor but something that is a conceivable possibility in today's Hollywood climate, this is the tone I would like them to try to take. Just the thought of that sends chills down my spine. It might even be able to challenge LOTR for the crown of best fantasy series of all time. \n\nAfter that virtuoso opening, I kept waiting to be let down. I never was. Every new character introduced was interesting and every old character they excluded was not missed. The pacing is the best out of the movies; the first two were too slow and the other five were too fast. The plot was more personal to me than the other movies; this is the one movie in which Voldemort does not appear in some form or another. There is no direct end boss and so the plot has to be more creative. And so it is.\n\nOf course, more of the credit for this has to go Mrs. Rowling for writing the book on which this film was based. But the cinematography is all the work of Cuaron's team. And it is the best in the series by far. Not to say that the other movies are poorly shot; this is Britain, after all: things may be bad, but they are never badly done. But while the cinematography of the first few movies would perfectly fit a kid's fantasies, the cinematography of the fourth movie would perfectly fit a high class ball or gala, and the cinematography of the last four movies would perfectly fit a nature doc, the cinematography of this film perfectly fits the franchise. \n\nIt is artful and well-done, but it is not show like an Oscarbaity period piece. The camera feels alive and coated with magic powder. It is exactly how I imagine the heartbeat of a troubled magic society to feel like. The music helps it out. If you listen to Window to the Past and are not sucked into the world Cuaron made for this film, then you just don't have a soul. It is introspective, ambient, immersive, and coated with the kind of cerebral wonder that I think makes life worth living. It is the best tune in the franchise. But do not think it is the only good tune in the movie. Buckbeak's Flight is a good second.\n\nWhile the characters in the series may never be willing/able to turn back time after this movie for reasons cheap and nonsensical and borderline nonexistent, I hope that you will be wiser. Come back in time with me to 2004. And let the emotional waves of this picture overtake you.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2007761177",
        "name": "Harry Potter and the Prisoner of Azkaban",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjA4OTU3ZjctYTBmNi00MTk2LTlhZTgtZWQyMmM1MmI5NmQ1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjA4OTU3ZjctYTBmNi00MTk2LTlhZTgtZWQyMmM1MmI5NmQ1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:23:47Z",
        "url": "https://www.imdb.com/video/vi2007761177/"
    },
    "url": "/title/tt0304141/"
}