{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bryce Johnson",
            "url": "/name/nm0424684/"
        },
        {
            "@type": "Person",
            "name": "Cole Williams",
            "url": "/name/nm0930304/"
        },
        {
            "@type": "Person",
            "name": "Rain Phoenix",
            "url": "/name/nm0681095/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1085,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059047/"
        },
        {
            "@type": "Person",
            "name": "Christopher Munch",
            "url": "/name/nm0618405/"
        }
    ],
    "datePublished": "2004-01-17",
    "description": "Two brothers, 23 and 16, who are both teen idols, come to terms with their dysfunctional family past and deep affection for each other.",
    "director": [
        {
            "@type": "Person",
            "name": "Christopher Munch",
            "url": "/name/nm0618405/"
        }
    ],
    "duration": "PT1H14M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4NTM2NzAyOV5BMl5BanBnXkFtZTgwOTc3ODUzMDI@._V1_.jpg",
    "keywords": "brother brother incest,incest,dysfunctional family,boy band,voice over narration",
    "name": "Harry + Max",
    "original_info": {
        "id": "Harry and Max_2004",
        "name": "Harry and Max",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vertigo_14"
        },
        "dateCreated": "2005-09-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0390080/"
        },
        "name": "So what if it was controversial? (spoilers)",
        "reviewBody": "Yet another overrated Sundance feature. Sure, it may've been controversial (the attempts to shock audiences seems to be the trend of many Sundance competitors), but it was still boring as hell. Two brothers, Harry and Max, spend most of this film trying to figure out what each means to the other and doing so without sparing us of much of the self-indulgence and pretension that many Sundance filmmakers are seem to like to create in abundance.\n\nHarry is a former \"boy band\" performer, his success having all but entirely quelled. He serves as a sort of mentor to his younger brother Max, an up-and-coming \"boy band\" performer. Protective of his curious young brother, Harry spends most of the first half of the film advising Max about the realities of a not-so-fabulous future of fame, whether it be short-lived or not. Harry knows it's a joke, repeatedly testifying that he was only doing what he had to in order to make money, and knows that Max, who admits he can't even sing, may do the same. In the meantime, the parents are either entirely absent or simply at conflict with the boys (mom plays the typical \"boy band mother\" role as Max's manager).\n\nAside from all this brotherly advice, there is the more unusual (and some may say repulsive) incestuous relationship between the two brothers. Max is gay. And, Harry seems...unsure?...at first. And the two always seem to be on emotionally divergent paths, even though Harry think he knows what Max wants, and Max is sort of turned off by a sort of insincerity he may think that Harry exhibits. Whatever. Despite the whole thing being a little too freakish for my tastes, I will say that the amount of time spent on all this going back and forth and trying to \"understand\" one another not only makes an awkward plot, but at times quite a boring one.\n\nIf you've been disappointed with much of the recent Sundance fare before, you're advised to skip this one, especially if you're uneasy with the relationship between Max and Harry because that's the entirety of the plot.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official U.S. trailer",
        "duration": "PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4176066073",
        "name": "Harry + Max",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTgyMjkyMDE1MV5BMl5BanBnXkFtZTgwMzgzNDY1MDI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTgyMjkyMDE1MV5BMl5BanBnXkFtZTgwMzgzNDY1MDI@._V1_.jpg",
        "uploadDate": "2016-11-10T06:24:47Z",
        "url": "https://www.imdb.com/video/vi4176066073/"
    },
    "url": "/title/tt0390080/"
}