{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Yuri Shiratori",
            "url": "/name/nm0794232/"
        },
        {
            "@type": "Person",
            "name": "Hisayoshi Izaki",
            "url": "/name/nm1049977/"
        },
        {
            "@type": "Person",
            "name": "Yû Shimaka",
            "url": "/name/nm0793579/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 207,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007064/"
        }
    ],
    "datePublished": "1999-05-25",
    "description": "Three students, the son of a Catholic priest, the son of a Buddhist monk and the daughter of a Shinto priest are recruited into a haunted high school's \"Holy\" Student Council and given the task of handling the campus's out of cont...",
    "genre": [
        "Animation",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjU3MGViNTUtYmY0Zi00YmY2LTk3YjMtNmU4OGQxMzVkMzExXkEyXkFqcGdeQXVyMTEwNDU1MzEy._V1_.jpg",
    "keywords": "christianity,christian,faith,anime animation,shinto",
    "name": "Haunted Junction",
    "original_info": {
        "id": "Haunted Junction_2000",
        "name": "Haunted Junction",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Fedaykin_Sadako"
        },
        "dateCreated": "2002-04-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0294614/"
        },
        "name": "Oh my God. Great fun!",
        "reviewBody": "I was wary at first of watching this anime series, but I was hooked from the second episode. Haunted Junction is the story of Saito High (a school that sits in the middle of a spiritual junction formed by a Christian church, a Buddist temple and a Shinto shrine) and three of its students. Because of its location, Saito High is a hot-bed of paranormal activity which is studied and controlled by the (Holy) Student Council.\n\nThe (Holy) Student Council is comprised of the reticent Haruto (the Christian, and president), the oft-possessed Kazumi (the Buddist who's in love with Toilet Hanako), and the violent Mitsumi (the Shintoist with a thing for young boys.) Their powers, combined with the badges of the seven school spirits, help to control the forces at work within the school and help all of those, including spirits, who are in need.\n\nAt first, I was unsure about watching this... I don't know why, exactly, I just didn't think I'd like it. I was wrong...I LOVE it. I've seen them all (twelve episodes on two DVDs) about a billion times. It's cute, it's raunchy, it's funny...lots and lots of fun. I highly recommend this series!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0294614/"
}