{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kay Kay Menon",
            "url": "/name/nm1946407/"
        },
        {
            "@type": "Person",
            "name": "Shiney Ahuja",
            "url": "/name/nm1832004/"
        },
        {
            "@type": "Person",
            "name": "Chitrangda Singh",
            "url": "/name/nm1696711/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5034,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063364/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009761/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0282980/"
        },
        {
            "@type": "Person",
            "name": "Sudhir Mishra",
            "url": "/name/nm0592803/"
        },
        {
            "@type": "Person",
            "name": "Shivkumar Subramaniam",
            "url": "/name/nm0837000/"
        },
        {
            "@type": "Person",
            "name": "Ruchi Narain",
            "url": "/name/nm1398739/"
        }
    ],
    "datePublished": "2005-04-15",
    "description": "Set in the backdrop of Indian Emergency 1975, the story revolves around 3 friends whose lives changes drastically after the turn of events.",
    "director": [
        {
            "@type": "Person",
            "name": "Sudhir Mishra",
            "url": "/name/nm0592803/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjkwOTM5OWUtYTQyZC00NmE1LWIyMDEtYzRjNjMzMjM5NjU4XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "friend,1970s",
    "name": "Hazaaron Khwaishein Aisi",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shafi4uf"
        },
        "dateCreated": "2006-04-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0411469/"
        },
        "name": "Refreshingly bold and meaningful",
        "reviewBody": "A few days ago, I watched Sudhir Mishra's Hazaaron Khwaishein Aisi with some friends. I am still thinking of it after more than a week has passed. Rare does it happen that an Indian movie leaves such a lasting impression. It is refreshingly bold in its portrayal of its central characters and the story of their personal journeys in search for their identities.\n\nThe story is set in the early 70's when emergency and pro-poor (naxalite) movement shaped the thoughts and actions of millions of idealistic youth in India. The story deals with three characters- two males and a female, each from a different stratum of Indian society- each with different passions, goals and idealism. It is their story of love, hope and final attainment of their goals.\n\nThe central and most important character is without doubt Chitrangada Singh's Geeta. Her idealism draws her to revolutionary ideas, but she is torn by her need for the softer, more materialistic things of life, for love and a family. This constant pull shapes her life, her choices, and her final destination, depicted touchingly in the end of the movie. She is shown as the most human of all the characters, making her the most believable and most admirable. On one hand, I am in awe of her strength and inner resolve; on the other hand, I feel her suffering and emotional trauma.\n\nKayKay Menon's character Siddharth starts out as a youth of privilege who takes a bold step of fighting for the cause he believes in, leaving behind his only true love. He struggles with the repressive authorities and the demons with in him- his sudden realization that he is after all human in the chase scene, had a dramatic effect on me, suddenly bringing other side of his nature into sharp perspective. His desire to fight out the authorities is derived from his own insecurities about himself. He finds his closure when he accepts his failures.\n\nThe most complex of all these characters is Shiny Ahuja's Vikram. His desire to climb the social ladder is surpassed only by his fiery passion for Geeta. She is the only centrality to his other wise meaningless, high powered, and politically connected life. She makes him yearn for making himself successful, and that is what drives her away from him. His choices can be understood only in the context of the complex and unfulfilled relationship he shares with Geeta. His love is never requited in the true sense of the word. Nevertheless, he is the one who finally brings meaning back into Geeta's life.\n\nTechnically, the movie is very good, with nice camera work and precise scissors of the editor. Some scenes are breathtaking in their beauty. Dialogues are sometimes difficult to understand, but that ends up adding to the over all tension of the movie. A must watch for any lover of good cinema!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Set in the backdrop of Indian Emergency 1975, the story revolves around 3 friends whose lives changes drastically after the turn of events.",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2453585689",
        "name": "Hazaaron Khwaishein Aisi (2003) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjhjNjk3ZTItOTE4NC00ZDJjLTg3OGItNjU4ZjY1YjAyNzNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjhjNjk3ZTItOTE4NC00ZDJjLTg3OGItNjU4ZjY1YjAyNzNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-12-06T03:52:41.593Z",
        "url": "https://www.imdb.com/video/vi2453585689/"
    },
    "url": "/title/tt0411469/"
}