{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Noah Taylor",
            "url": "/name/nm0852965/"
        },
        {
            "@type": "Person",
            "name": "Emily Hamilton",
            "url": "/name/nm0357838/"
        },
        {
            "@type": "Person",
            "name": "Romane Bohringer",
            "url": "/name/nm0001960/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3870,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0033059/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073684/"
        },
        {
            "@type": "Person",
            "name": "Richard Lowenstein",
            "url": "/name/nm0523154/"
        },
        {
            "@type": "Person",
            "name": "John Birmingham",
            "url": "/name/nm0083658/"
        }
    ],
    "datePublished": "2001-08-30",
    "description": "A nightmare chase through hell in a never-ending, unrequited daisy chain of desire...",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Lowenstein",
            "url": "/name/nm0523154/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTc5ZTZkYTQtMWMyNS00NzMxLTlkYmItNWYyZjQ0ZDIzYzNmXkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "australia,brisbane australia,falafel,actress,breakup",
    "name": "He Died with a Felafel in His Hand",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Philby-3"
        },
        "dateCreated": "2002-03-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0172543/"
        },
        "name": "Felafel rolls up housesharing",
        "reviewBody": "Putting John Burningham's best-selling but episodic reminiscences of house-sharing into a watchable feature film was quite a challenge, but a veteran house-sharer, Richard Lowenstein (`Dogs in Space'), succeeds here by having several of the more interesting and bizarre characters follow the narrator (Noah Taylor) from city to city. The felafel, in fact, a throwaway line in the book, is given centre stage, and the result is a well-focused tale of the horrors of house-sharing  it's the `Secret Life of Us' meets `Romper Stomper'.\n\nNoah Taylor is one of those actors who cannot fail if given a goofy role, and here he is perfect as Danny, the aspiring writer roughing it with a collection of druggies, minor criminals, aspiring sorceresses and actors, while trying to evade his creditors and write a prize-winning story for `Penthouse'. Allegedly irresistible to women, he fails badly with his female housemates. As one of them says, incredulously: `Have an affair with you? I'm not a masochist!'\n\nRomane Bohringer gives another strong performance as Anya, a sort of social bomb-thrower with a taste for Druid ritual, who puts any place she joins into an uproar in no time. Then there is Taylor the mad drunk (Alex Menglet), Flip the junkie (a touching performance from Brett Stewart), Nina the terminally vain soap actor (Sophie Lee hopefully not as herself) Iain the doctrinaire socialist (Ian Hughes in Melbourne of course) and Dirk the emerging homosexual (Francis McMahon), amongst others. Some of the landlord's agents do not lack colour either eg Linal Haft's rent collector as gangster in Brisbane.\n\nAll these characters are somehow accommodated in the story, though an early peak (the great bikie party in the Brisbane house) is followed by rather a flat period in Melbourne. Once the circus reaches Sydney, however, things pick up again  perhaps it's the more effervescent air.\n\nThe tropical squalor of the first house, a battered `Queenslander,' reminded me a little of `Praise', a vastly different film in tone, but Danny is not necessarily one of life's defeated, though it seems like that sometimes. This movie has a decidedly upbeat tone; the last place might have been pretty rugged, bet there's always the hope of something more salubrious, or at least of more congenial flatmates. No doubt admirers of the book will take offence at what has been left out, but Lowenstein should be given credit for giving it a cinematic context."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for He Died With A Felafel In His Hand",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2131270169",
        "name": "He Died With A Felafel In His Hand",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjIyMWFkYTItZDhiZS00M2ZjLTg1NzEtZGZlZDQyYmYyZTAyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjIyMWFkYTItZDhiZS00M2ZjLTg1NzEtZGZlZDQyYmYyZTAyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-02-03T06:17:30Z",
        "url": "https://www.imdb.com/video/vi2131270169/"
    },
    "url": "/title/tt0172543/"
}