{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Don Scardino",
            "url": "/name/nm0769135/"
        },
        {
            "@type": "Person",
            "name": "Caitlin O'Heaney",
            "url": "/name/nm0641378/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Kemp",
            "url": "/name/nm0447282/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3923,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Scott Parker",
            "url": "/name/nm0662612/"
        }
    ],
    "datePublished": "1980-08-29",
    "description": "A young bride-to-be is being stalked upon by a serial killer in Staten Island. She gets help from a former lover, but will they manage to escape?",
    "director": [
        {
            "@type": "Person",
            "name": "Armand Mastroianni",
            "url": "/name/nm0557857/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGNlYjk3NmMtNTVlNS00ODg5LWExNmYtNmUyNWZmZTA2MDk4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "serial killer,slasher,low budget film,man murders a woman,stabbing a woman",
    "name": "He Knows You're Alone",
    "original_info": {
        "id": "He Knows You're Alone_1980",
        "name": "He Knows You're Alone",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2008-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080850/"
        },
        "name": "Not a fan of weddings?",
        "reviewBody": "After a death of a young woman in a movie theatre, the pattern continues of a serial killer targeting brides-to-be before the night of their wedding. Amy is the next one who's got the killer's eye and he begins to follow her. She starts picking up on the coincidences and soon worries for her well-being as her big day draws closer. On the case is a cop (who's been after the guy from the very beginning) has tracked down killer's next victim, now it's a matter of time just who gets to Amy first.\n\nStandard post-Halloween low-budget slasher with a smart title that really has no relation to anything in the film, but gains topical interest for being the starting point of a young charismatic (it was there from the get-go) Tom Hanks in a tiny role. Oh my god, oh my god it's Tom Hanks! Hey it's really nothing new, as how many stars have began in low-rent horror films. Now we got that out of the way, let's stick to the movie.\n\nNo surprises, as it's systemically written, but well illustrated and organised in its clichés to keep one amused. There's a nasty, violent side there, but it never goes that far or do anything with an imaginative gist. Instead of being graphic and exploitive, a 'Psycho' vibe melted with 'Halloween' is demonstrated. An old-styling of giving the situations more weight and colour nicely breaks up the stalk n slash elements. The side-story of the cop tracking down the killer is underplayed, but works better for it. While the motive (quite an obvious, if not particularly convincing one) of the bride killer is suggested in a flashback scene or that's what it seems. No hiding the fact who's the killer, as we see him and wielding a blade as he openly takes out his first victim that closely resembles the opening of Wes Craven's slasher hit 'Scream 2 (1997)\".\n\nArmand Mastroianni (The man behind little unknown horror oddities such as 'Cameron's Closet (1989)', 'The Supernaturals (1986) 'and very good 'The Clairvoyant (1982)') fashionably controlled direction is all about placement and build-up, despite the sparse atmosphere and at times mishandled suspense or the lack of it. Few set-pieces work and some neat location choices (carnival setting to morgue), and they come off during the latter end and the pace never slouches within the tight time-frame. Sound FX is effectively sourced and Alexander and Mark Scardion's music score (with a touch of Halloween) packs a sting amongst its unusual cues. The lead heroine comes off well-rounded and enforcers a head of steam thanks to the perky confidence of Caitlin O'Heaney. Don Scardino is likable as her ex-boyfriend who still has feelings for her and Elizabeth Kemp as one of her colourful friends. Lewis Arlt productively gets out a worn-out cop routine and Tom Rolfing's lurking presence makes for a modest killer who's good at slicing and dicing with little to no blood being spilt (truly class- work!) and staring down his victims.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2135867161",
        "name": "He Knows You're Alone",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGQ2NjAwNTUtOTdiZS00NDM0LWJiMGMtY2FjY2VhNDMyZWJlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGQ2NjAwNTUtOTdiZS00NDM0LWJiMGMtY2FjY2VhNDMyZWJlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-19T17:02:59.163Z",
        "url": "https://www.imdb.com/video/vi2135867161/"
    },
    "url": "/title/tt0080850/"
}