{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Basehart",
            "url": "/name/nm0000865/"
        },
        {
            "@type": "Person",
            "name": "Scott Brady",
            "url": "/name/nm0103722/"
        },
        {
            "@type": "Person",
            "name": "Roy Roberts",
            "url": "/name/nm0731507/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6295,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132038/"
        },
        {
            "@type": "Person",
            "name": "John C. Higgins",
            "url": "/name/nm0383421/"
        },
        {
            "@type": "Person",
            "name": "Crane Wilbur",
            "url": "/name/nm0928108/"
        },
        {
            "@type": "Person",
            "name": "Harry Essex",
            "url": "/name/nm0261400/"
        }
    ],
    "description": "This film-noir piece, told in semi-documentary style, follows police on the hunt for a resourceful criminal who shoots and kills a cop.",
    "director": [
        {
            "@type": "Person",
            "name": "Alfred L. Werker",
            "url": "/name/nm0921288/"
        },
        {
            "@type": "Person",
            "name": "Anthony Mann",
            "url": "/name/nm0542649/"
        }
    ],
    "duration": "PT1H19M",
    "genre": [
        "Crime",
        "Film-Noir",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjlhM2QxMTAtNGY4MS00YTBkLTg3MDktOGM0MTAyNDNmYTg3XkEyXkFqcGdeQXVyNTgyNTA4MjM@._V1_.jpg",
    "keywords": "nitroglycerin,nitroglycerine ampoule,arsenal,searching a car,television projector",
    "name": "He Walked by Night",
    "original_info": {
        "id": "He Walked by Night_1948",
        "name": "He Walked by Night",
        "year": "1948"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "annwynn"
        },
        "dateCreated": "2006-06-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0040427/"
        },
        "name": "Corrected facts about \"He Walked by Night\"",
        "reviewBody": "These comments are being submitted by Sgt. Mary Wynn's oldest son, Charles S. Wynn. I do have several additions and corrections regarding your comments about my father. The Walker case was one of several outstanding cases that was investigated by Sgt. Wynn and partners. Over the years, my brother and I would sit and listen to these stories being retold by the officers who worked the case. \n\nComment #1 I can never recall him being referred to as \"Tough Guy.\" Comment #2 The movie, \"He Walked by Night\" was produced by the Eagle Lion Studio. My father was contacted and asked if he would give the technical direction. While doing so, he met a down-and-out actor named Jack Webb. Webb had a ten minute part as a lab technician in the movie and was not depicted as a detective. During one of their conversations, Wynn mentioned to Webb, \"It's a shame they don't have a radio show that depicts the actual policeman and the work that he does.\" At that time, the lead detective show was \"Sam Spade.\" \n\nThey derived the title, \"He Walked by Night,\" to the fact that he committed most of his crimes at night. The film, itself, was not accurate. The use of the storm drains in the City of L. A. was strictly Hollywood. When Walker was captured he was located in a rented bungalow located on Argyle St. in L. A. Three officers, Donohoe, Wynn and Rombo, entered this location at 2:30 A.M. surprising Walker while he slept. A physical confrontation took place. Walker was armed with a machine gun at which time he succeeded in getting the clip into the weapon. Donohoe yelled, \"Shoot him, Marty! He's got the gun!\" Wynn took him down, striking him numerous times over the head with the butt of his 38 revolver. Walker, still struggling and in possession of the gun, Wynn then put the gun to Walker's back and fired twice. It was noted that when Wynn examined his gun, he had cracked the grip of the pistol. When Walker was placed in the ambulance, he asked Wynn, \"Do you have any kids?\" Wynn said, \"Yes, I have two boys.\" Walker replied, \"You're lucky because you came close to not seeing your kids again.\" At that time, he told Wynn, \"they will never execute for this crime and I will live to see the day where I will kill you.\" In 1959, Walker succeeded in escaping from Atascadero. Three days later he was captured. Wynn was forced to strap his 38 again after two years of retirement.\n\nIf you desire any more information regard Sgt. Marty Wynn or the film, please contact me at this e-address."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "This film-noir piece, told in semi-documentary style, follows police on the hunt for a resourceful criminal who shoots and kills a cop.",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2899886873",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWMwZjYyMjItNWZiMS00MjM2LTllZjAtNjMxM2RhMjVlZDA5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWMwZjYyMjItNWZiMS00MjM2LTllZjAtNjMxM2RhMjVlZDA5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-30T20:56:58.318Z",
        "url": "https://www.imdb.com/video/vi2899886873/"
    },
    "url": "/title/tt0040427/"
}