{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "John Erwin",
            "url": "/name/nm0260008/"
        },
        {
            "@type": "Person",
            "name": "Alan Oppenheimer",
            "url": "/name/nm0649178/"
        },
        {
            "@type": "Person",
            "name": "Linda Gary",
            "url": "/name/nm0308881/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19070,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "TV-Y7",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030668/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080248/"
        }
    ],
    "datePublished": "1983-09-26",
    "description": "The most powerful man in the universe, He-Man, goes against the evil forces of Skeletor to save the planet Eternia and to protect the secrets of Castle Grayskull.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODgyYzRhNzAtMTJlNC00OTM0LWI3M2ItNzZjYzYxZmJiOWIyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1_.jpg",
    "keywords": "masters of the universe,warrior,sword,castle,based on toy",
    "name": "He-Man and the Masters of the Universe",
    "original_info": {
        "id": "He-Man and the Masters of the Universe: Season 1: Vol. 1_1983",
        "name": "He-Man and the Masters of the Universe: Season 1: Vol. 1",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie Nuttball"
        },
        "dateCreated": "2003-01-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0126158/"
        },
        "name": "He-Man and the Masters of the Universe - In-depth review!",
        "reviewBody": "As I have said before He-Man and the Masters of the Universe is My all time favorite cartoon or animated series. I still watch it to this day because it is so wonderful in so many ways. I love it for many reasons and here is some of them reasons why! I love it for the calmness it has. It isn't fast paced like today's animated shows. Each episode had its own great story. Each character has an awesome personality, looks, and what have you. The men all have big muscles and the women are so neat looking. I really liked the messages the guys tell the viewers at the end of the shows. I love the totally cool monsters and the wonderful creatures the series has. I also love it for something's I'm sure most or some viewers of the show don't notice and that is the way the characters walk and especially run. I also adore the music. It has such a great score and great beginning and end themes! I just love the fight scenes. They are so real! I love the intro of the series. I can go on and on about this. Now below is an in-depth look at most of the great characters seen the episodes of He-Man and the Masters of the Universe!\n\nNote: What you are about to read here is My opinions on the characters and My opinions only.\n\nThis is not all of the great characters in He-Man and the Masters of the universe but is a guide to show the viewer most of the important heroes and villains in the universe!\n\nThe Heroes - These are the mightiest warriors on Eternia.\n\nPrince Adam/He-Man - Adam has the biggest secret and only four others share the secret: The Sorceress, Man-At-Arms, Orko, and Cringer. Prince Adam acts like a coward in front of his father or always leaves when trouble starts to hide his huge secret. He-Man, the most powerful man in the universe is the Defender of Eternia, a large muscular man of good, he will not kill anyone or anything no matter how evil they are. (But in one episode this changes and I don't want to spoil it for you if you haven't seen it yet.)\n\nCringer/Battle Cat - Cringer, one of the four that knows Prince Adam's secret. The talking fraidy cat who is always thinking of cat naps and food. He would rather eat a big meal than to turn into the huge and mighty green tiger that is known as Battle Cat,He-Man's loyal friend.\n\n Man-At-Arms - The Royal Palace's Man at arms. Duncan is a master of weapons, building machines, vehicles, computers etc. Man-At-Arms is an intelligent person, a very kind man and he is always thinking of others especially his daughter Teela. Man-At-Arms is one of three who knows Prince Adam's and Cringer's secret.\n\nTeela - Duncan's daughter is a beautiful young woman who is captain of the guard. She can take care of herself as she is a skilled warrior but at times she is stubborn. Teela is a very smart woman and she does care for others. Whenever He-Man and Teela are together she wonders where Prince Adam is. What she also doesn't know is that He-Man and the Prince are one in the same!\n\nOrko - The magician from Trolla is clever but clumsy and his magic doesn't always work well on Eternia. Orko is a very loyal companion as he is one of the four who is aware of Adam's big secret.\n\nKing Randor - The King of Eternia and is Prince Adam's father. Randor was once a warrior though older, he still has what it takes to take care of himself and others when the time calls for it. Randor always thinks that his son Adam doesn't take things seriously when something bad happens as he leaves the room and his excuse is always that something has come up. Little does King Randor know that his son has the biggest secret ever and that he is the legendary He-Man!\n\nQueen Marlena - Adam's Mother is older yet a fine looking woman who loves her son but is unaware of his big secret. Your highness is different from the other people on Eternia. What makes her different is that she is from a different planet. Marlena is from the planet Earth. She was in a shuttle and crashed on Eternia and that's how the queen began her new life on a new world for her. She loves Eternia with its great lands, creatures, and peoples but she does miss her home world often.\n\nThe Sorceress - The Sorceress is a very beautiful woman of mystery that lives in Castle Greyskull. She is very powerful in the magical ways and she is able to turn herself into the large falcon Zoar. She talks to Prince Adam/He-Man and Man-At-Arms through thought transfers whenever there is trouble. The Sorceress and Teela has a big secret though Teela only knew it for a limited time that the Sorceress is actually Teela's mother. The magical one did not allow Teela to know about this secret for good reasons.\n\nStratos - The winged warrior of avion is always there for the palace. He is brave and is always willing to help out no matter what the situation is.\n\nRam Man - Like Stratos he is a loyal friend to the palace though he isn't the bravest warrior on the planet. He is a helpful armored human battering ram but his heart is bigger than his brain.\n\nMan-E-Faces - The good spirited person who turned actor. He loves acting with his multiple faces and personalities. Man-E-Faces is a big rough and tough individual.\n\nMekaneck - The heroic human periscope is always on the look out for He-Man and friends. With his mighty golden club, big muscles, and bravery. Mekaneck is a very loyal friend to the Royal Palace.\n\nBuzz-off - Buzz-off, the buzzing spy in the sky if you will is always interested in a good battle and helping out He-Man and others.\n\nFisto - A bearded armored muscular man who has a massive steel hand is a great fighter.\n\nGranamyr - The gargantuan red dragon is one of the oldest living creatures on Eternia that lives at Dark Smoke. He is very wise and powerful in strength and in the magical arts. He is an incredible force to be reckon with! \n\n---------------\n\nThe Foes - These are Skeletor's warriors. They help Skeletor do his dirty work even though he is very powerful he could rule Eternia.\n\nSkeletor - The most evil being on Eternia, Skeletor with his awesome yet scary appearance is not someone to take lightly. The big and muscular blue bodied warrior who has a skull for a face with such a villainous voice knows just about everything there is to know on Eternia but what he doesn't know is Prince Adam's secret and the secrets of Castle Greyskull. He is always after what lies in Castle Greyskull and has come close many times. The scary one lives at Snake Mountain which is a scary place in its own right and you never know what lives around it. He keeps monsters and other creatures locked up in his dungeon to do his bidding. Skeletor is very powerful in the magical arts. It was always rumored that Skeletor is King Randor's brother Keldor. Keldor's description fits but it was never said by the King or anyone else for that matter. Skeletor is really a mystery man but the thing he wants the most is to know the secrets of Castle Greyskull, get rid of He-Man once and for all, be the master on Eternia and, the ruler of the universe!\n\nPanthor - A huge black panther, Panthor is to Skeletor much like Battle Cat is to He-Man. Panthor loves to get into a fight especially with Battle Cat but it seems after the battle is done Panthor always retreats but he does his master well!\n\nBeast Man - The one who can control the creatures on Eternia is always called names by his leader Skeletor. He isn't that intelligent but is very powerful indeed. He has an agenda of being the leader of villainy on Eternia.\n\nMer-Man - The muscular warrior of the ocean who is the master of most of the great water's sea monsters and other creatures is strong and can put up a good fight but at times clumsy. This is what causes him to lose his fights with He-Man as the most powerful man of the universe always throws him in mud.\n\nTrap-Jaw - The menace that is known as Trap-Jaw always has a new weapon for his mechanical arm. His weapons are very powerful and they consist of laser guns, claws, hooks, etc. Trap Jaw's name is perfect for him because of his steel jaw with razor sharp teeth. At one time Trap Jaw almost defeated He-Man with the help of a special object. \n\nTri-Clops - A great warrior who has a three eyes can see through big rocks and walls and among other objects. The muscular henchman of Skeletor is a loyal one at that.\n\nEvil-Lyn - Evil-Lyn, the beautiful witch of darkness is really Skeletor's most loyal warrior and for being a female she gets a lot of results. She rarely takes off her helmet but what is underneath there is short white hair. Evil-Lyn is very powerful in the arts of magic. Like Beast Man She too has her own agenda of being the one to rule Eternia.\n\nWhiplash - The large green warrior with a massive tail is intelligent and clever at hiding tracks and retreating. He is brave and he knows when to quit a fight if he can't handle it any longer. \n\nClawful - He has two extremely strong claws for hands. Clawful, with his mean voice, crustacean/reptilian like appearance makes him a force not to mess with.\n\nKobra Khan - One of the many members of the Snake People, Kobra Khan can do many impressive things such as spray sleep gas through the coat of his neck. He has the knowledge to become a great leader.\n\nWebstor - He is a master of escaping with his big climbing hook. He is really an underrated henchman of Skeletor and isn't give much credit.\n\nFaker - Faker, the evil He-Man that Skeletor created gave He-Man trouble at one time. (Note: The action figure of Faker had orange hair, blue skin and wore Skeletor's armor. In the animated series he looked exactly like He-Man except he has glowing eyes and his voice is lower toned).\n\nJitsu - Like Fisto he has a large hand and he a master on the martial arts.\n\nSpikor - A warrior that has spikes all over his dark colored body. He is another underrated villain of Skeletor's.\n\nTwo-Bad - Two-Bad, the two headed warrior loves strategy but fails at missions.\n\nScreech - The giant mechanical falcon is very dangerous but the huge bird never really completed any of his missions.\n\n-----------------\n\nThe following is My opinion(s)\n\nI think He-Man and the Masters of the Universe is a spectacular animated series and it has always been My favorite. The 1980s produced a lot of great things and this series was one of them. The whole series is priceless in My book and even though there is a new He-Man series currently on television there will never be an animated series like this again."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The most powerful man in the universe, He-Man, goes against the evil forces of Skeletor to save the planet Eternia and to protect the secrets of Castle Grayskull.",
        "duration": "PT1M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3081421593",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmFiMmUwNGMtZjYyNy00NjA2LTgwZjktNTkyZWEzNTg2YmUyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmFiMmUwNGMtZjYyNy00NjA2LTgwZjktNTkyZWEzNTg2YmUyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-09-28T00:02:04.956Z",
        "url": "https://www.imdb.com/video/vi3081421593/"
    },
    "url": "/title/tt0126158/"
}