{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jackie Chan",
            "url": "/name/nm0000329/"
        },
        {
            "@type": "Person",
            "name": "Sammo Kam-Bo Hung",
            "url": "/name/nm0005033/"
        },
        {
            "@type": "Person",
            "name": "Emily Chu",
            "url": "/name/nm0160823/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4916,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "Heart of Dragon",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163276/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069083/"
        },
        {
            "@type": "Person",
            "name": "Barry Wong",
            "url": "/name/nm0938944/"
        }
    ],
    "datePublished": "1985-09-14",
    "description": "Tat, ex SWAT turned CID cop in HK, has a 29 y.o. Disabled brother, behaving like the small boys, he plays with, always getting into trouble. Tat struggles to care for him - at the expense of his cute girlfriend and dreams.",
    "director": [
        {
            "@type": "Person",
            "name": "Sammo Kam-Bo Hung",
            "url": "/name/nm0005033/"
        },
        {
            "@type": "Person",
            "name": "Fruit Chan",
            "url": "/name/nm0150897/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODkzZTBmY2UtMWIzOS00NzVmLWJhNjMtMGIxNDcwNTEyZDJlXkEyXkFqcGdeQXVyNjU5MjcxOTg@._V1_.jpg",
    "keywords": "police officer,brother brother relationship,kidnapping,martial arts,kung fu",
    "name": "Long de xin",
    "original_info": {
        "id": "Heart of Dragon_1985",
        "name": "Heart of Dragon",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "himboy32"
        },
        "dateCreated": "2004-10-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091427/"
        },
        "name": "Excellent Drama and Action From HK's Best",
        "reviewBody": "Heart Of Dragon tells the story of Hong Kong SWAT officer Tat Fung who must juggle a career, a girlfriend and looking after his older brother Do-Do who is mentally retarded. Tat feels he is beginning to lose touch with himself so decides to join the navy, but before he can do that he must straighten things out with both his girlfriend and his big brother.\n\nLet me begin by saying this has to be the best performance in Jackie's prolific career,this is the film which made me take him seriously as an actor. It is such a shame this wasn't a big hit when it first came out.\n\nJackie and Sammo are the best actors in the film. Sammo plays his character with such depth and sensitivity,while Jackie does excellently as the frustrated Tat.\n\nI thought I'd never cry at a Jackie Chan movie but I was wrong. One scene which got me misty eyed was a scene when Do-Do's tutor begins to emotionally abuse him,while Tat listens to what is going on from outside the room.\n\nAnother scene is when Tat finally lets his true feelings for Do-Do come forward anger may be the most raw of human emotions but to let yourself explode like that is very difficult to pull off, but thats not the point I began to cry, it was when Tat goes to his room and Do-Do follows him and apologises for the way he is, I mean wow, talk about emotionally heavy.\n\nMoving on from the emotional side of the film and commenting on the action, this has very little action in it until towards the end which I have to say has one of the best fights in Jackie's career in which he takes on the amazing and brilliant Dick Wei in a one on one brutal marial arts fight. This has to be Jackie at his fastest, they exchange the moves with such quickness I had to go back and watch the fight again once it was over.\n\nI urge any Jackie Chan or Sammo Hung fan who has not yet seen the film to go out and get the DVD you do not know what you are missing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0091427/"
}