{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Robards",
            "url": "/name/nm0001673/"
        },
        {
            "@type": "Person",
            "name": "Eddie Mills",
            "url": "/name/nm0589976/"
        },
        {
            "@type": "Person",
            "name": "Hilary Swank",
            "url": "/name/nm0005476/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 221,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0775023/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0775024/"
        },
        {
            "@type": "Person",
            "name": "Stephen L. Cotler",
            "url": "/name/nm0182855/"
        },
        {
            "@type": "Person",
            "name": "Lanny Cotler",
            "url": "/name/nm0182854/"
        }
    ],
    "datePublished": "1998-04-19",
    "description": "The sawmill Logan is the center to which the small town of Deroy . When the old Logan can not cope with his debts, the life of the whole community is threatened.",
    "director": [
        {
            "@type": "Person",
            "name": "Lanny Cotler",
            "url": "/name/nm0182854/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmQ5YjAxMzYtNzYzZi00NzIwLWI1N2ItZjhkYjg4YzE3MTY0XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "independent film",
    "name": "Heartwood",
    "original_info": {
        "id": "Heartwood_1998",
        "name": "Heartwood",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "peterdao"
        },
        "dateCreated": "2003-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119269/"
        },
        "name": "A must-see for every Hilary Swank fan.",
        "reviewBody": "As this is a movie about a small town, three generations and two lovers, here's how I think the story should be told. Deroy is a California isolated town, the existence of which relies on a lumber mill run by Logan Reeser (seventy-six-year-old Oscar winner Jason Robards). Reeser is a mentor to twenty-six-year old Frank (Eddie Mills) who while being seen as a freak by his family and community, fully shares Reeser's deep-rooted devotion to the giant redwoods. Then summer comes, and Frank finds himself in bliss and trouble when a romance blooms between him and the mill manager's daughter, Sylvia (twenty-four-year-old Hilary Swank, one year before her Best Actress Oscar). The young lovers are temporarily separated, but as old Logan Reeser gets deeper in debt and might have to shut down the mill, Frank and Sylvia devise a clever plan, and together they prove that love and determination can save a town from disaster and be the answer to Reeser's prayers as well...\n\nAlthough the DVD isn't very cool (only chapter selections, no special features) I really enjoy this movie. I love its message regarding environment (similar to what was voiced in such good films as \"Silkwood\", \"A River Runs Through It\", \"Erin Brockovich\"...) Credits should also go to the cinematography and the solid performance of the entire cast, especially Hilary Swank with her incomparable freshness and natural beauty. So if you're tired of movies that offer nothing but senseless violence and obsessive sex crave, get \"Heartwood\" and enjoy this heartwarming love story, as narrated by its main character: \"It started 15 years ago in a forest in my sawmill town, Deroy, population 254, where the trees are more than a livelihood, they're a way of life...\""
    },
    "url": "/title/tt0119269/"
}