{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rasmus Lyberth",
            "url": "/name/nm0527932/"
        },
        {
            "@type": "Person",
            "name": "Vivi Nielsen",
            "url": "/name/nm0631016/"
        },
        {
            "@type": "Person",
            "name": "Niels Platow",
            "url": "/name/nm0686838/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 221,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Heart of Light",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031807/"
        },
        {
            "@type": "Person",
            "name": "Jacob Grønlykke",
            "url": "/name/nm0345026/"
        },
        {
            "@type": "Person",
            "name": "Hans Anthon Lynge",
            "url": "/name/nm0528582/"
        }
    ],
    "datePublished": "1998-01-25",
    "description": "When the humiliation and grief of his eldest son's shooting rampage and subsequent suicide threatens to pull him under, a brokenhearted father (Rasmus Lyberth) leaves his family and tight-knit community and heads into Greenland's ...",
    "director": [
        {
            "@type": "Person",
            "name": "Jacob Grønlykke",
            "url": "/name/nm0345026/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk2MzczMTcyNl5BMl5BanBnXkFtZTYwMzgxMjQ5._V1_.jpg",
    "keywords": "suicide,greenland,murder,death of son",
    "name": "Qaamarngup uummataa",
    "original_info": {
        "id": "Heart of Light_2000",
        "name": "Heart of Light",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "alanjj-3"
        },
        "dateCreated": "1999-09-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0137087/"
        },
        "name": "Nice scenery, not too engrossing",
        "reviewBody": "I saw this at the Danish New Wave series at Lincoln Center. I had always wanted to see a depiction of life in Greenland, and this is it. The program describes the movie in this way: \"The first feature film shot totally in Greenland - which is part of the Kingdom of Denmark - HEART OF LIGHT is the story of Rasmus (played by Rasmus Lyberth, a celebrated Greenlandic singer), a man sinking into a mire created by constant unemployment and alcohol. When one of his sons goes on a killing spree, Rasmus turns inward, searching inside himself for the answers to the tragedy that's become his life. He embarks on an extraordinary journey into Greenland's vast, snowy interior; there, amid the towering blue skies, clear light and mountains of ice, he will re-establish contact with the culture he has lost, finding in tradition the strength to cope with the modern.\"\n\nYes there is nice scenery; yes you will see actual Greenlandish actors depicting life in Greenland. But beyond that the film holds little interest. Rasmus's finding himself is triggered by encountering a wacky mystic amid the snowbanks and glaciers, who reveals something that connects Rasmus with his past. It's a plot device both silly and so-what.\n\nAfter the picture, Rasmus Lyberth, who depicted Rasmus, did some singing, which should have been in the movie to make it more enjoyable."
    },
    "url": "/title/tt0137087/"
}