{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tin Chan",
            "url": "/name/nm8844279/"
        },
        {
            "@type": "Person",
            "name": "Chau Diem",
            "url": "/name/nm8844280/"
        },
        {
            "@type": "Person",
            "name": "Ngo Dinh Diem",
            "url": "/name/nm0628924/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5864,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065894/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000949/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067478/"
        }
    ],
    "datePublished": "1975-11-17",
    "description": "A startling and courageous landmark documentary that unflinchingly confronted the United States' involvement in Vietnam at the height of the controversy that surrounded it.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Davis",
            "url": "/name/nm0205282/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Documentary",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTFiMjEyZWMtZjliOS00NjQ3LWIxZDktYWY2MWJlODQzNDlkXkEyXkFqcGdeQXVyNDYzNTI2ODc@._V1_.jpg",
    "keywords": "national film registry,timeframe 1960s,timeframe 1970s,vietnam,interview",
    "name": "Hearts and Minds",
    "original_info": {
        "id": "Hearts and Minds_1974",
        "name": "Hearts and Minds",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MCMoricz"
        },
        "dateCreated": "2005-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071604/"
        },
        "name": "Difficult, important document of the era",
        "reviewBody": "I'll admit up front that Peter Davis' documentary makes no effort to show the carnage and torture sponsored and perpetuated by the Viet Cong -- and the one substantial time it explores the way South Vietnamese civilians were imprisoned and tortured by their own government (in huge numbers, by the way), the film isn't very clear about who made these arrests. It concentrates almost solely on the inhumanity and pointlessness of our presence there in a pointless war which even our leaders were unprepared to comprehend.\n\nIt's not \"balanced\" within itself, but given the day-to-day barrage of standard media coverage of the Vietnam war during the time the documentary was made, I believe the making of this film represented an attempt to \"balance\" the average American's knowledge of what was really going on and how misrepresented the war was by our government and even by the major media most of the time.\n\nAll that being said, it's a vivid, important part of the mosaic of American war records. The images are enormously powerful, and where occasionally Mr. Davis' juxtapositions seem overtly manipulative, he still is to be praised emphatically for collecting and assembling this material in such a courageous and uncompromising way. It is essential viewing because of the power of its collected imagery and the lessons about America that we still need to learn. 30 years after the Vietnam war ended, there are still too many essential ways in which that conflict is not understood....and the degree to which we cannot seem, as a nation, to learn from the lessons of Vietnam is only too evident in the manner and attitude with which our leaders have handled and carried on the American military action in Iraq. \n\nHaving read a lot of the writings of Vietnam vets over the years about this war, I'm tempted to say that this documentary doesn't go far enough to show the core of absurdity and tragedy at the heart of this war and the way it put young Americans into a hellish situation for no reason and then left them there to be a part of a morally ambivalent, politically and humanly misguided situation, forever disillusioning and haunting an entire generation. But if this film can help younger people to understand just the tip of the iceberg of the enormous tragedy of America's involvement in a pointless 10-year war, then it continues to be worthwhile. \n\nThe film itself does not provide nearly enough \"backstory\" for a student or younger person who did not live through the era. Peter Davis presupposes that the viewing audience knows a lot of things which we knew at the time but which is no longer general knowledge for many viewers. But as a part of an overall attempt (using various sources) to understand that war and its colossal ramifications to our country's self-image, and as a reminder of how easy it is to slip into a tragic imperialism masquerading as some other kind of naive political idealism, it's an essential and vividly effective document of the times for which we owe Mr. Davis a huge debt of gratitude. There is much to be learned from films like this -- including things which our leaders today don't seem to have learned themselves, despite having lived through the Vietnam era.\n\nIt's also important to remember that until the Vietnam war, and later Watergate (reminders of which resonate in the presence in this film of \"Pentagon Paper\"- leaker Daniel Ellsberg), Americans generally believed what their government told them, and didn't think Presidents lied. It may be difficult now to remember there ever was a time when we trusted our government not to be intentionally misleading us, and if Mr. Davis makes a conspicuous effort to emphasize the duplicity of Johnson and Nixon in this documentary, it's probably because it was such a new and unbelievable concept to the overwhelming percentages of Americans before the Vietnam era took place."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Documentary concerning the atrocities of the Vietnam war",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1192690457",
        "name": "Hearts and Minds",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzJkOTBhZGYtNjI4NS00NmUxLWIzYWYtNWNmYjIwZGFiMDRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzJkOTBhZGYtNjI4NS00NmUxLWIzYWYtNWNmYjIwZGFiMDRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-02-28T06:50:18Z",
        "url": "https://www.imdb.com/video/vi1192690457/"
    },
    "url": "/title/tt0071604/"
}