{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Warren Beatty",
            "url": "/name/nm0000886/"
        },
        {
            "@type": "Person",
            "name": "James Mason",
            "url": "/name/nm0000051/"
        },
        {
            "@type": "Person",
            "name": "Julie Christie",
            "url": "/name/nm0001046/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22191,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Elaine May",
            "url": "/name/nm0561938/"
        },
        {
            "@type": "Person",
            "name": "Warren Beatty",
            "url": "/name/nm0000886/"
        },
        {
            "@type": "Person",
            "name": "Harry Segall",
            "url": "/name/nm0781895/"
        }
    ],
    "datePublished": "1978-06-28",
    "description": "A Los Angeles Rams quarterback, accidentally taken away from his body by an overanxious angel before he was meant to die, returns to life in the body of a recently murdered millionaire.",
    "director": [
        {
            "@type": "Person",
            "name": "Warren Beatty",
            "url": "/name/nm0000886/"
        },
        {
            "@type": "Person",
            "name": "Buck Henry",
            "url": "/name/nm0377750/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Fantasy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2NlOGI1YTMtZjk3My00YWY4LWE2ZGUtNzA2Y2E1ZjU0ZTZmXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "quarterback,heaven,angel,back from the dead,remake",
    "name": "Heaven Can Wait",
    "original_info": {
        "id": "Heaven Can Wait_1978",
        "name": "Heaven Can Wait",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "classicalsteve"
        },
        "dateCreated": "2010-02-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077663/"
        },
        "name": "Classic-Style Old-Fashioned Fantasy Film-making Reminiscent of the 1940's and 1950's",
        "reviewBody": "Although made in the very late 1970's, \"Heaven Can Wait\" is really a throwback to a bygone era of fantasy film-making. Hollywood offerings such as \"The Bishop's Wife\" (where Carey Grant plays an angel), \"Angels in the Outfield\", \"It's a Wonderful Life\", and \"Here Comes Mr. Jordan\" (which is actually the inspiration behind \"Heaven Can Wait\") were innocent 100-minute escapist fair whose only mission was to entertain. Some modern offerings include \"Mr Destiny\", \"Maid to Order\", and the TV shows \"The Flying Nun\" and \"Touched by an Angel\". None of these kinds of films have much in the way of cutting social commentary or even ground-breaking cinematic techniques. However, their entertainment value is very high, being nothing but. \"Heaven Can Wait\" is this kind of a movie, maybe the perfect \"chick flick\" as it combines fantasy, football and even a little love story.\n\nThe story is relatively simple: Joe Pendleton (Warren Beatty), a quarterback in the twilight of his career, feels destined to make it to the Superbowl. The LA Rams, his team, are in the playoffs. One day during early-morning training after consuming his liver-and-whey shake, he bicycles into a tunnel where two large vehicles taking both lanes are charging from the other direction of the tunnel. Looks like Pendleton will be playing in a Superbowl coached by Vince Lombardi with George \"The Gipper\" Gipp as one of his teammates. The next thing he knows, he's jogging among clouds with an escort (played by writer-director Buck Henry who also played the hotel attendant in \"The Graduate\") in a suit and tie trying to get him to stop running around. Pendleton is still in his athletic clothes sporting a soprano saxophone and doing push-ups among the fluffy billows. He doesn't quite realize he's died. Or has he? Turns out the escort made a mistake: Pendleton would have survived, perhaps avoided, the collision, but the escort nabbed him from his body before the resolution of the event, relying on \"probability and outcome\", a recurring theme of the movie. Pendleton was not due for many decades.\n\nHis case is taken up by Mr Jordan (James Mason in one of his later roles) a kind of heavenly supervisor who apparently coordinates peoples' souls. Realizing the mistake, Jordan takes Pendleton back to earth to find him a new body so he can live out the rest of his life as he was meant to. The only one available is the body of millionaire Leo Farnsworth who has just been murdered care of his estranged wife and personal assistant, played brilliantly by Dyan Cannon and Charles Grodin. One of the best scenes is when Pendleton reappears as Farnsworth, and Cannon nearly has a conniption. Pendleton, now as stuffy gazillionaire Farnsworth, must forge a way to get back to the Rams in time for the Superbowl.\n\nThe aspect that saves this film from falling too far into sentimental gush or absolute unbelievability is the quality of the acting of the leads (particularly Warren Beatty, Charles Grodin, Dyan Cannon, Julie Christie, James Mason, and Jack Warden as Max, the Rams' trainer) coupled with a fine screenplay. Everything is believable. Certainly the whole concept is just about as far-fetched as the Land of Oz, but you never contemplate that possibility for a moment. For some reason, everything works, and you run with it, not unlike \"It's a Wonderful Life\". As silly and fantastical as it is, the trip is well worth it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2298854937",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTY3ZDEzYTctY2RjYi00MTg0LTgzN2YtNmJjMGM4M2UwNDQ2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTY3ZDEzYTctY2RjYi00MTg0LTgzN2YtNmJjMGM4M2UwNDQ2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-08T21:43:08.831Z",
        "url": "https://www.imdb.com/video/vi2298854937/"
    },
    "url": "/title/tt0077663/"
}