{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joseph Kaufmann",
            "url": "/name/nm0442322/"
        },
        {
            "@type": "Person",
            "name": "Beverly Hope Atkinson",
            "url": "/name/nm0040679/"
        },
        {
            "@type": "Person",
            "name": "Frank DeKova",
            "url": "/name/nm0215308/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3461,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "X",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0084740/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044096/"
        },
        {
            "@type": "Person",
            "name": "Ralph Bakshi",
            "url": "/name/nm0000835/"
        }
    ],
    "datePublished": "1974-02-01",
    "description": "An underground cartoonist contends with life in the inner city, where various unsavory characters serve as inspiration for his art.",
    "director": [
        {
            "@type": "Person",
            "name": "Ralph Bakshi",
            "url": "/name/nm0000835/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Animation",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmE5MWY4ZDItM2JlMS00MzIwLWIyMWQtNTlmOTliNjk4YmQ2XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_.jpg",
    "keywords": "psychedelic image,grindhouse film,harmonica player,harmonica,drawing board",
    "name": "Heavy Traffic",
    "original_info": {
        "id": "Heavy Traffic_1973",
        "name": "Heavy Traffic",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2007-04-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070165/"
        },
        "name": "Bakshi's most personal work is a completely outlandish, crude, overtly abstract New York satire",
        "reviewBody": "Heavy Traffic is, like many of Ralph Bakshi's films, a like it or hate it affair, but for those that respond to it, the film provides many a surprising attack on sensibility, decency, and what it means to get by in urban sprawl. It's almost too personal; one can see Bakshi or friends of his having gone through some of the little things in the lower ranks of New York City's daily life (particularly Brooklyn life) as depicted here. But it's this connection to a personal reality- and then a TOTAL adherence to turning this reality on its head and making it as wild, violent, and sexually deviant as possible- that is the key to the success of Bakshi's film, the best of his I've seen so far. His main character, Michael, is probably loosely based on himself; a young, would-be underground cartoonist who lives with insanely irate parents (Italian father and Jewish mother), and interacts with the neighborhood he's in with a casual attitude and a little reluctance to join in the mayhem that goes on with such kooky cats. Enter in Carole, a black bartender who won't take s*** from anyone, who teams up as a business partner, more or less, with Michael to first get cartoons off the ground, then, so it goes, misadventures in prostitution. It all leads up to an ending that isn't expected, though a sort of double-piling of shock and pleasant surprise.\n\nHeavy Traffic outlays Bakshi's outlook on life in a skill that could be called animated exploitation film-making. However, it's through this overloading of characters *meant* to be unattractive, sexually piggish, wretchedly racist (and, on the other side of the coin, sexist), and violent in the tradition of the Looney Tunes cartoons with the worst taste, that the film gets to the guts of the matter. It's a half-embrace, half-attack on a lack of values in a society, and as Baskhi relishes in his excess, he also is criticizing both himself for lapping it up and those in the neighborhood for being such eccentric mother-f***ers. And, as a satire should be, it's very funny, occasionally uproariously so. Scenes like Michael being pressured to get it on with the girl on the mattress on the roof, and the outcome as a sort of running gag; the scene with the song Mabeline playing, as Baskhi puts out drawings that are without much color, and look incredible for the reason that there's seemingly little effort put into the animation with the random over-the-top sexual positions; the little bits in the feuding with Michael's parents, the mother with her Jewish-star knife-holster and the father with his dedication to the \"Godfather\", who eats little people in his pasta, over anything really with his family; and when Michael presents \"religious\" cartoons to a dying old man, which to any prurient Christian taste is hilariously offensive and, well, cool.\n\nBakshi is so personal at times, with his taste in color schemes, in over-lapping images with film clips, combining live-action and animation (usually with dancing ladies on one side and a lurid little twerp gawking on the other), and even likely real family photos from his own family laid in, that it levels going too far. There's a tendency for self-indulgence, however not always the bad kind, if that makes sense, and one can see how the film can and has been vehemently criticized for what it is really trying to criticize in the film. But deep down, past the creative madman in Bakshi, is also a heart; his film ends on a touching note, as abstraction turns real and a totally live scene reveals another level to Michael and Carol, as real outcasts who are both totally stubborn, and somehow meant for each other. Heavy Traffic is a one-of-a-kind affair, and the kind of under-the-radar act of an outrageous spectacle that it could only be done in the 70s. Grade: A-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An underground cartoonist contends with life in the inner city, where various unsavory characters serve as inspiration for his art.",
        "duration": "PT1M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3001074457",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTIyYjFjY2YtYzhmOC00OGIxLTg2Y2EtZTllMWNjYzY4ZTk0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTIyYjFjY2YtYzhmOC00OGIxLTg2Y2EtZTllMWNjYzY4ZTk0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-11T14:27:46.297Z",
        "url": "https://www.imdb.com/video/vi3001074457/"
    },
    "url": "/title/tt0070165/"
}