{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Melanie Lynskey",
            "url": "/name/nm0001491/"
        },
        {
            "@type": "Person",
            "name": "Kate Winslet",
            "url": "/name/nm0000701/"
        },
        {
            "@type": "Person",
            "name": "Sarah Peirse",
            "url": "/name/nm0670582/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 65148,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046203/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0584456/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065796/"
        },
        {
            "@type": "Person",
            "name": "Fran Walsh",
            "url": "/name/nm0909638/"
        },
        {
            "@type": "Person",
            "name": "Peter Jackson",
            "url": "/name/nm0001392/"
        }
    ],
    "datePublished": "1994-10-14",
    "description": "Two teenage girls share a unique bond; their parents, concerned that the friendship is too intense, separate them, and the girls take revenge.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Jackson",
            "url": "/name/nm0001392/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjUwNGIwNDctZmQ1ZC00YTEzLWI3MzQtZGMyODlmZGU4ZDdhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "fantasy life,sex with a minor,teenage crush,orgy,lesbian",
    "name": "Heavenly Creatures",
    "original_info": {
        "id": "Heavenly Creatures_1994",
        "name": "Heavenly Creatures",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2003-04-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110005/"
        },
        "name": "The Fourth World of the Third Man",
        "reviewBody": "Perhaps the premier concern of modern filmmakers is locating somewhere in the film exactly where the film-making process is. This is often incorrectly called irony, self-reference or the odd construction of reflexivity. I call it 'folding' and it seems to be everywhere and often in rich and engaging forms. Moreover, it seem to be a central concern of the Australian performing arts community. I imagine it can be traced back to a single person in the seventies on Bennelong Point.\n\nSo much of what we have gotten from this tradition has enriched us all, not the least of which are the actresses who master folded acting. That's where we get a portrayal of a character and another simultaneous portrayal of an actor portraying that character. Sometimes the 'character' in these two portrayals isn't quite the same. Three mainstream film actresses today can do this. Two are Australian, and one is Kate.\n\nThis is her first film, and it is no surprise at all that the filmmaker has chosen to build a structure that is a representation and is about representation. The original, true story is about two girls, enwrapped in mutual fantasy, probably enhanced by the flush of sex, whose fantastic adventures get out of hand. From this, Jackson reshapes it all. It is now a film about films. Now the girls' fantasy world is a Camelot driven by forces in film. They write. They sculpt characters, based on film characters. Those film characters come 'alive' and form a world in which the girls live in parallel with the real world. So far so good.\n\nBut Jackson goes further. Some of the film prototypes are simple characters: Mario Lanza-like. Simple glamour with no pretense or irony. But there is the amazing Orson Welles also. Orson is not pretty, he is not direct, he is a folded prototype himself. The two worlds conflict, and that conflict is reflected in each world. In the Borovnian ('borrow'-nian) world, this is a conflict between two clay figures: the Welles and the Lanza, the winner getting to bed and impregnate both princesses. In the 'real' world, the conflict carries over to the two houses, and even within Juliet's house between the bookish metaphysical father and the sexy 'psychologist- but touchy-feely' mother.\n\nWelles was the one who reinvented the ordinary flat world of film into a melange of folding techniques. The film world since the late forties has been a combination of struggles and syntheses between the forth world of Welles and the simple dramatic stage of Griffith.\n\nEven the very young Kate surfs and exploits these levels with aplomb. Even as a teenager she gives us messages from each of these folds - not at precisely the same time as Julianne would later, but strongly nonetheless.\n\nTed's Evaluation -- 3 of 4: Worth watching."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "From his humble beginnings as a gore auteur, to the master innovator of some of Hollywood's grandest spectacles, Peter Jackson has dazzled audiences with his distinct, visionary style for more than 30 years. Through 'Bad Taste' and 'The Frighteners', two 'Lord of the Rings' trilogies and 'King Kong,' IMDb explores the unique trademarks of the Oscar-winning writer and director.",
        "duration": "PT1M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1923201561",
        "name": "A Guide to the Films of Peter Jackson",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjRmMmNmNDEtNTBmYi00NDU4LWIzYmMtNTJjZTFiMGFmZmM0XkEyXkFqcGdeQW1hZGV0aXNj._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjRmMmNmNDEtNTBmYi00NDU4LWIzYmMtNTJjZTFiMGFmZmM0XkEyXkFqcGdeQW1hZGV0aXNj._V1_.jpg",
        "uploadDate": "2018-10-02T16:32:52.763Z",
        "url": "https://www.imdb.com/video/vi1923201561/"
    },
    "url": "/title/tt0110005/"
}