{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stelian Urian",
            "url": "/name/nm2328093/"
        },
        {
            "@type": "Person",
            "name": "Katheryn Winnick",
            "url": "/name/nm0935395/"
        },
        {
            "@type": "Person",
            "name": "Anna Tolputt",
            "url": "/name/nm1335987/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12051,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038165/"
        },
        {
            "@type": "Person",
            "name": "Clive Barker",
            "url": "/name/nm0000850/"
        },
        {
            "@type": "Person",
            "name": "Joel Soisson",
            "url": "/name/nm0812373/"
        },
        {
            "@type": "Person",
            "name": "Carl V. Dupré",
            "url": "/name/nm0243463/"
        }
    ],
    "datePublished": "2005-09-06",
    "description": "Gamers playing a MMORPG based on the \"Hellraiser\" films find their lives endangered after being invited to a rave, the host of which intends to show them the truth behind the Cenobite mythos.",
    "director": [
        {
            "@type": "Person",
            "name": "Rick Bota",
            "url": "/name/nm0098400/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDM2OGViNjAtMmM5OS00YzJiLTgzODItNTZlYzcxNjAyZDUyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "pinhead character,meat cleaver,psychotronic film,2000s,massively multiplayer online role playing game",
    "name": "Hellraiser: Hellworld",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "habib_phil"
        },
        "dateCreated": "2005-09-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0354623/"
        },
        "name": "Cinematic Excrement",
        "reviewBody": "This movie was terrible. I can't believe all the good reviews it got. This is easily the worst movie ever to bear the name Hellraiser, and if it weren't for Lance Henriksen, it wouldn't have even been a 2 in my book.\n\nThe acting ranged from mediocre (Chelsea) to downright abysmal (Jake), with the lone exception being Henriksen in his usual calm and menacing demeanor. The dialogue was clichéd, and Pinhead was turned into a crude mixture of Freddy Krueger and Jason Vorhees. He is supposed to be an arbiter, a ferryman to the other-worldly pleasures of the Hellraiser world, not some mindless killer of teenie-boppers. I couldn't care about any of the characters, which is what so painfully divides this movie from the 1st, which was built upon its characters. This is like Scream, except without any meaningful attempt at suspense or scares. The whole movie was so damn predictable that I was able to call every surprise.\n\nI could tell though, before any of drivel that passed as \"horror\" in a franchise that isn't even supposed to be horror, that this movie would suck based on the Pinhead shirt one of the characters was wearing. That and a guy in a cenobite mask removed all attempts at a dignified motion picture before it even really began.\n\nWhat disappoints me so much though is not the crappy acting, the swiss-cheese plot, or the sheer failure to achieve even mediocrity. Its how far this movie has fallen form the 1st or the 5th. Hell, Deader was worlds better than this, and even 3 and 4 had at least good quotes. This movie is an embarrassment, and Clive Barker should be infuriated at how his once-noble franchise has been mutilated.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0354623/"
}