{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeremy Davies",
            "url": "/name/nm0001111/"
        },
        {
            "@type": "Person",
            "name": "Clea DuVall",
            "url": "/name/nm0245112/"
        },
        {
            "@type": "Person",
            "name": "Allison Smith",
            "url": "/name/nm0807278/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3548,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005228/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048945/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005035/"
        },
        {
            "@type": "Person",
            "name": "Vincent Bugliosi",
            "url": "/name/nm0119514/"
        },
        {
            "@type": "Person",
            "name": "Curt Gentry",
            "url": "/name/nm0313168/"
        },
        {
            "@type": "Person",
            "name": "John Gray",
            "url": "/name/nm0336726/"
        }
    ],
    "datePublished": "2004-05-16",
    "description": "A new take on the Manson Family murders, with a keen focus on Charles Manson himself.",
    "director": [
        {
            "@type": "Person",
            "name": "John Gray",
            "url": "/name/nm0336726/"
        }
    ],
    "duration": "PT2H16M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDYzZDRkMzAtZGI0YS00ZmRhLWI0ZDctY2I1YjRmZDQ4ZGM3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "scene of the crime,murder of a pregnant woman,serial murder,murder,charles manson character",
    "name": "Helter Skelter",
    "original_info": {
        "id": "Helter Skelter: Director's Cut_2004",
        "name": "Helter Skelter: Director's Cut",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "robc-11"
        },
        "dateCreated": "2004-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0383393/"
        },
        "name": "Chilling, Disturbing Remake",
        "reviewBody": "Of all the murder trials in American history, only the Charles Manson case continues to hold fascination thirty-five years after it took place. The original \"Helter Skelter\" film aired on CBS in 1976, and focused mainly on the trial of Manson and his zombie teen girls. It was an excellent TV movie, but we never really got a sense of what life with Manson and his young followers was like. This film takes a different approach by focusing on Manson himself, the young people whose lives were ruined by him, and by depicting the actual murders themselves, which were quite intense for a television film. Jeremy Davies (\"Spanking the Monkey,\" \"Saving Private Ryan\") was deeply scary as Manson. Clea Duvall did a fabulous job as Linda Kasabian, the \"family\" member who witnessed the murders but did not participate. After the murders, we get the sense that Kasabian is really torn up inside and knows that what was happening was very wrong, while other family members laughed and cheered as they watched news reports of the savage killings on television. Another excellent performance was by Whitney Dylan as Sharon Tate, the pregnant actress who was violently butchered by Manson's murderous teen followers. The scene in which she is on the floor dying and asks the killers to please try and save her baby was chilling and almost tear-inducing. We also get an excellent feel of the turbulent atmosphere of the time, 1969, and how the Manson murders brought \"the decade of love\" to a thundering halt. What makes this so sad and scary is that this actually happened. The fact that all-American teens from respectable families fell prey to a maniacal con man and are now spending their lives in prison is a frightening reminder of how young people can so easily be led astray by false prophets who promise the world and eventually can lead you into darkness and tragedy, whether it is 1969 or 2004. This film makes you want to hug and talk to your kids about the evil, dangerous alure of cults and false religions. All of the kids in the Manson family were runaways, and Charlie told them exactly what they wanted to hear and soon had them clinging to his every deceptive word. Manson continues to have a following among young people, thirty-five years after these awful crimes, and that's what is really disturbing. Watch the original 1976 film for an exhaustive dramatization of the trial itself, and see this remake for details of the events leading up to the trial. Way above average for television."
    },
    "url": "/title/tt0383393/"
}