{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Thomas Jay Ryan",
            "url": "/name/nm0752876/"
        },
        {
            "@type": "Person",
            "name": "James Urbaniak",
            "url": "/name/nm0881672/"
        },
        {
            "@type": "Person",
            "name": "Parker Posey",
            "url": "/name/nm0000205/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7451,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0102939/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022461/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050668/"
        },
        {
            "@type": "Person",
            "name": "Hal Hartley",
            "url": "/name/nm0001325/"
        }
    ],
    "datePublished": "1998-06-19",
    "description": "An introverted garbageman writes his thoughts in a notebook after Henry Fool, writer and ex-con, rents the basement and gives him a notebook and the idea. He writes poetry and Henry helps him along.",
    "director": [
        {
            "@type": "Person",
            "name": "Hal Hartley",
            "url": "/name/nm0001325/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzU2ZjU3YzktNzMzNy00MWE0LThiZjMtMmMyYmExNzdlM2E3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "in flagrante delicto,risk taking,promiscuity,garbageman,masturbation",
    "name": "Henry Fool",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jzappa"
        },
        "dateCreated": "2009-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0122529/"
        },
        "name": "An Entirely Personal Film, Created From Scratch.",
        "reviewBody": "What if the mentor who gave you success turned out to be the worst writer you've ever read...and was counting on your newfound influence? What if he married your sister? What if his ego was as big as Montana and at the same time as fragile as glass? How could you ever repay him? How could you ever resolve these questions? Ask Hal Hartley. Or see his movie.\n\nThis independent seriocomedy opens by studying a generally bungling garbageman named Simon Grim. He soon makes perhaps the first friend he's ever made in his life with Henry Fool, a sharply droll scoundrel, though a failure as an author. Henry's giant ego, what with his delusions of literary genius and grandeur, not to mention his comparison between his pedophilia and that of Socrates, justifies his wily, prose-like lines. Henry incidentally exposes Simon to the life of literature, who then writes a profoundly staggering poem, as we judge by the reactions of all who come across even a few lines of it. As Simon is swept up on his rise to the prestigious apex of the most talked-about underground poet in the world, Henry's own endeavors at recognition merely bring about unpleasant dismissal by the very publisher who commits with Simon to issue his already legendary poem.\n\nHartley is a very personal filmmaker. I particularly like a director whose film is entirely owned by him or her, especially one with an unlikely extensive running time like this one. Because his script is entirely his own, and created from scratch, he has actors suggest more than they divulge. Simon is a great poet because of how socially bound he is, never speaking or changing his expression and thus always looking inward, much like great poets have, like Rilke for instance.\n\nHartley wisely doesn't show the poem or the \"confessions\" over which Henry has long toiled. Whether they are good or bad depends on the histrionics of the outside story. They are almost the classic mystery items in so many thrillers and pulpy crime pictures, but to a much superior effect. They are not subsidiary, but vital.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0122529/"
}