{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Henry Rollins",
            "url": "/name/nm0738433/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 73,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Henry Rollins",
            "url": "/name/nm0738433/"
        }
    ],
    "director": [
        {
            "@type": "Person",
            "name": "Modi",
            "url": "/name/nm2147554/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDg2ZTk2MDMtMTQ5NC00YzhmLTkxZjYtOTRmMGJjOTY4YjhiXkEyXkFqcGdeQXVyNzc5MDE5NzY@._V1_.jpg",
    "name": "Henry Rollins: Live at Luna Park",
    "original_info": {
        "id": "Henry Rollins: Live at Luna Park_2004",
        "name": "Henry Rollins: Live at Luna Park",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nixskits"
        },
        "dateCreated": "2009-12-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0810896/"
        },
        "name": "Perform 7 shows a day and don't repeat anything",
        "reviewBody": "Henry didn't actually have that frequent a schedule for the \"Live At Luna Park\" recordings, but hey, if anyone could pull off that kind of performance assault, my money's on this guy! He's on a closer to home setting here, in LA, the location his futon allegedly washed up many years ago.\n\nThis time out, Hank elaborates on the Stepford wives of California freeway hell, not being able to remember Slayer's album title \"Diabolus In Musica\", the similarities between Republicans and the brutes who killed Jesus, the enormous men of Texas, revisiting Washington DC and taking in all that has changed since he left in 1981 and foreigners who bravely try to communicate in English when it might not even be their third language.\n\nPlus, in the greatest special feature ever, a twenty minute tribute to \"a guy I've always measured myself against\", Iggy Pop, who he dually identifies as \"Jim\", the gentleman from Michigan and \"Iggy\", the feral creature that destroys whatever is in his path and gets better as he gets older.\n\nThe crowds in this disc are much smaller than Rollins' other shows caught on tape, lending a more intimate quality to the overall atmosphere. I hope he tries another flurry of gigs around the same locale soon and the results are just as good.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0810896/"
}