{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Henry Rollins",
            "url": "/name/nm0738433/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 137,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0146549/"
        },
        {
            "@type": "Person",
            "name": "Henry Rollins",
            "url": "/name/nm0738433/"
        }
    ],
    "description": "Rock icon Henry Rollins spews truth, hilarity in front of a live audience. Thought/laughs ensue.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Drumm",
            "url": "/name/nm1259307/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAxOTk5OTMtZTQ2MC00YWFjLTk1OTgtZDQxODE0NDA3ZjRiXkEyXkFqcGdeQXVyNzc5MDE5NzY@._V1_.jpg",
    "name": "Henry Rollins: Shock & Awe",
    "original_info": {
        "id": "Henry Rollins: Shock and Awe_2004",
        "name": "Henry Rollins: Shock and Awe",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nixskits"
        },
        "dateCreated": "2009-12-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0810404/"
        },
        "name": "Hank's best so far",
        "reviewBody": "Henry makes no bones about who he offends and if anyone doesn't like it, they should be on the record about why his informed opinions are somehow not on the mark. I've given this a higher rating than the other two Rollins discs I recently commented on because there is less slack between the segments I really enjoyed and the parts that didn't go as far as I wish they had.\n\n\"Shock And Awe\" is no small detour around the George W. Bush camp, it's more like an 18 wheeler driving straight at them, the maniacally laughing driver being none other than Hank, with a look in his eyes that says, \"I don't like the damage you're causing, not just to the USA, but the whole world!\" \n\nThe now history Bush administration has left enormous problems for the next heads of state to cope with and Hank is at his funniest comparing Chuck Yeager, he of the \"right stuff\", with W., he lacking any kind of substantial stuff.\n\nWe also get to hear about Hank's trip for the USO, meeting William Shatner and Ike Turner, confronting a burglar, seeing (and hearing) the human cartoon that is Quentin Tarantino up close, talking to (not hanging up on) telemarketers and explaining just what it is he has in common with the Pope.\n\nWhat's shocking and inspires awe in this day and age is honesty and Rollins has that down to his bone marrow.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0810404/"
}