{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Rooker",
            "url": "/name/nm0740264/"
        },
        {
            "@type": "Person",
            "name": "Tracy Arnold",
            "url": "/name/nm0036657/"
        },
        {
            "@type": "Person",
            "name": "Tom Towles",
            "url": "/name/nm0869981/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 38042,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0159697/"
        },
        {
            "@type": "Person",
            "name": "Richard Fire",
            "url": "/name/nm0278626/"
        },
        {
            "@type": "Person",
            "name": "John McNaughton",
            "url": "/name/nm0573796/"
        }
    ],
    "datePublished": "1990-09-07",
    "description": "Arriving in Chicago, Henry moves in with ex-con acquaintance Otis and starts schooling him in the ways of the serial killer.",
    "director": [
        {
            "@type": "Person",
            "name": "John McNaughton",
            "url": "/name/nm0573796/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2VjMDkzMTUtMDZjZi00YzFlLWE2MzYtNjVhNTkwYzU0YmNkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "murder,incest,serial killer,murderer duo,character name in title",
    "name": "Henry: Portrait of a Serial Killer",
    "original_info": {
        "id": "Henry: Portrait of a Serial Killer_1990",
        "name": "Henry: Portrait of a Serial Killer",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2003-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099763/"
        },
        "name": "The human mind can be pretty disturbing from time to time",
        "reviewBody": "As you probably know, this film is partly based on the confessions of the real Henry Lee Lucas. If you know that and see this movie, you can ask some serious question about how disturbing some of our fellow humans are. This man shows no emotions what so ever. Contact with other people is nearly impossible, no mercy, not wondering whether his victims have a family or how old they are...no nothing. You wonder if he even IS a human, no living creature can be so awful.\n\nSo, if you ask yourself all this during this movie, and I assure you will, you could say it's an excellent film. The mission of the movie itself has succeeded. The ideal atmosphere is achieved in the movie. Dark, melancholic, depressing...Director McNaughton really creates world you don't want to live in. Michael Rooker plays the role of his life and puts down one of the best acting performances ever. Sure, he's never honored with an Oscar or any other important price for his performance, but everyone who sees this movie knows it's true. Actually, when I first saw this film at the age of 9 ( Too young, I know) I thought this actor was in fact a real-life psycho. Henry talks with the same, aggressive tone of voice during the whole movie, his eyes seem to shoot fireballs when the camera looks like in them and his appearance makes you want to puke. Actually this film is pure genius for mainly one reason : you don't have sympathy for any of the characters. Most film, even is the whole cast play villains, there's always one you like. One character you create a sort of band with. In Henry: Portrait of a serial Killer you can only feel hate. Hate and disgust for Henry and for his companion Otis. Heck, you even start to hate the girl... For being so naive that is.\n\nAlthough many persons are killed and many violence occurs, Henry certainly ain't a gore or bloody film. Many things are suggested but not shown, and in this case it's actually more or at least as scary as showing the actual murders. That's a quality you don't see in movies very much. Only the old horror movies from the 30's and 40's could do that. And now also Henry can. I advise everyone to see this movie, if they haven't already. Not just if you're a fan of horror or thrillers, but also if you appreciate good movies in general. Even the most critic movie buffs can only find this film terrific. It was on many many levels a very important film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Henry: Portrait of a Serial Killer - 30th Anniversary",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2733553177",
        "name": "Henry: Portrait of a Serial Killer: 30th Anniversary",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmY1YWFhMTgtMjBjYi00Nzk2LTljYjAtMWEzZWExOWFiZjdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmY1YWFhMTgtMjBjYi00Nzk2LTljYjAtMWEzZWExOWFiZjdiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-11-15T09:11:24Z",
        "url": "https://www.imdb.com/video/vi2733553177/"
    },
    "url": "/title/tt0099763/"
}