{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ray Winstone",
            "url": "/name/nm0935653/"
        },
        {
            "@type": "Person",
            "name": "Joss Ackland",
            "url": "/name/nm0000722/"
        },
        {
            "@type": "Person",
            "name": "Sid Mitchell",
            "url": "/name/nm0593730/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2390,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103289/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0138182/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0160370/"
        },
        {
            "@type": "Person",
            "name": "Peter Morgan",
            "url": "/name/nm0604948/"
        }
    ],
    "datePublished": "2003-10-12",
    "description": "Two part mini-series documenting the stormy thirty-eight-year reign of King Henry VIII.",
    "director": [
        {
            "@type": "Person",
            "name": "Pete Travis",
            "url": "/name/nm0871428/"
        }
    ],
    "duration": "PT3H13M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ0MzE1NTczOF5BMl5BanBnXkFtZTgwNzIwOTkwMzE@._V1_.jpg",
    "keywords": "character name as title,period drama,king henry viii,renaissance,death of queen",
    "name": "Henry VIII",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "didi-5"
        },
        "dateCreated": "2003-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0382737/"
        },
        "name": "unhistorical drama",
        "reviewBody": "Perhaps, like other dramas suggested by historical characters, this version of the story of 'Henry VIII' should be viewed with a high degree of suspicion since most of the events depicted have very little basis in what we know of the complex Tudor monarch.\n\nPutting this reservation aside, there are plenty of opportunities to enjoy this four-hour drama for what it is, largely an entertainment playing on our prejudices and emotions throughout its depiction and treatment of the six wives. Part One wastes far too much time on the courtship between Henry and Anne Boleyn, and then manages to whizz through the circumstances of her downfall in a matter of minutes. This was a huge mistake in my opinion and makes that part of the story extremely confusing.\n\nPart Two obviously spends time on Jane Seymour and Catherine Howard, but again with a large amount of artistic licence - was Jane really a political meddler and did her husband's violence towards her cause her to go into premature birth? was Catherine really a manipulated slut with no mind of her own? The second section of \"Henry VIII\" is more gory than Part One, in particular concerning the execution scenes, and I think this aspect probably worked.\n\nIn the cast, kudos has to go to Ray Winstone in the lead despite the distraction of his East End accent, particularly for his work in the later part of the story. Of the wives, Assumpta Serna is an excellent Katharine of Aragon, giving the role some dignity; Helena Bonham-Carter is ok as Anne Boleyn but irritates at times - she does better in the scenes where she appears vulnerable than when she is feisty, talking-back Anne; Emilia Fox is good as Jane Seymour; Pia Girard has nothing to do as Anne of Cleves (I don't think she even speaks); Emily Blunt is miscast as Catherine Howard; and Clare Holman is effective as Catherine Parr. Others making an impact include David Suchet as Wolsey, Michael Maloney as Cranmer, Danny Webb as Thomas Cromwell, Dominic Mafham as Anne Boleyn's brother; Joseph Morgan as Thomas Culpepper; and Sean Bean as Robert Ashe.\n\nPerhaps a bit of a misfire but a fascinating one."
    },
    "url": "/title/tt0382737/"
}