{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lindsay Lohan",
            "url": "/name/nm0517820/"
        },
        {
            "@type": "Person",
            "name": "Michael Keaton",
            "url": "/name/nm0000474/"
        },
        {
            "@type": "Person",
            "name": "Cheryl Hines",
            "url": "/name/nm0385644/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49013,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008970/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033486/"
        },
        {
            "@type": "Person",
            "name": "Thomas Lennon",
            "url": "/name/nm0502073/"
        },
        {
            "@type": "Person",
            "name": "Robert Ben Garant",
            "url": "/name/nm0304830/"
        },
        {
            "@type": "Person",
            "name": "Alfred Gough",
            "url": "/name/nm0332184/"
        }
    ],
    "datePublished": "2005-06-22",
    "description": "Maggie Peyton, the new owner of Herbie, Number 53, the free-wheelin' Volkswagen bug with a mind of its own, puts the car through its paces on the road to becoming a NASCAR competitor.",
    "director": [
        {
            "@type": "Person",
            "name": "Angela Robinson",
            "url": "/name/nm1286340/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Adventure",
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkwNDI5NDcyMV5BMl5BanBnXkFtZTcwMjg5OTcyMQ@@._V1_.jpg",
    "keywords": "automobile racing,vehicle driving by itself,herbie the love bug character,cindy campbell character,reboot of series",
    "name": "Herbie Fully Loaded",
    "original_info": {
        "id": "Herbie: Fully Loaded_2005",
        "name": "Herbie: Fully Loaded",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hoosierrevue"
        },
        "dateCreated": "2005-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0400497/"
        },
        "name": "Fun if you don't take it too seriously.",
        "reviewBody": "Repeat the following prior to viewing this movie: \"I will suspend my disbelief and dutifully accept all plot devices in order to maintain the sanity that would otherwise escape me were I to process events in the movie from a logical perspective.\" Because yes, Herbie, an old VW Bug, will compete in a NASCAR race and drive sideways on the fence--as seen in the previews.\n\nHaving said that, this movie is quite enjoyable when watched from such a standpoint. It's fun and innocent, but it carries the typical Disney fantastical vibe as well. I sometimes get annoyed with the cheesy ridiculousness of those types of movies, but then again, when I was a kid I thought they were wonderful. So, take that as you will.\n\nMaggie Peyton (Lindsay Lohan) has just graduated from college and is about to happily embark on her new life as an ESPN writer. Her father (Michael Keaton aka The Dark Knight) and late grandfather own Peyton Racing, a NASCAR team in which her brother, Ray Jr.,competes. Unfortunately for the family, Ray Jr. (Breckin Meyer) lacks the racing talent that his father, grandfather and sister possess, and the team is now struggling to keep sponsors from backing out after numerous crashes and defeats on the track. Maggie dreams of racing for the team, but her father desperately wants her to use her college degree and leave the horrible world of racing behind. We're never really told why her father considers professional racing to be so lowly a profession, given that it produces dozens of respectable sports stars and, oh yeah, lots and lots of money; but, again let's stick to the original \"suspension of disbelief\" mantra, and we'll have no trouble with his opinion of the sport. Maggie comes across Herbie and quickly learns that the car has a mind of its own and can magically propel her and her family into fame and fortune on the racetrack.\n\nThe movie is complete with a standard garden-variety villain, Trip Murphy (Matt Dillon), a four-time NASCAR champion, who, despite being competent enough to win the Nextel Cup series four times, cannot keep his mind off an impromptu street race that he lost to Herbie. He acts like a jerk, flings insults at Maggie, and generally struts around like he's better than everyone, thus enabling the audience to despise him. Plus, he was like, totally mean to Herbie and called him a piece of junk! You just don't talk about Herbie like that, and I so kept hoping he'd get his comeuppance in the end.\n\nI did like the movie, however, because from a certain standpoint it is enjoyable to watch. Herbie himself has several humorous moments, and I couldn't help but like him. Given that this wasn't a documentary it's forgivable in its transgressions on reality, which in the end make the movie more entertaining. It's lighthearted and doesn't attempt to beat the audience down with a message (ahem, Sharkboy & LavaGirl). I highly recommend Herbie: Fully Loaded for kids and for those who like cute and wholesome moviesif you're simply looking for a good pick-me up and a fun movie, then this is definitely one that you shouldn't miss.\n\nJust...don't get caught up in the details.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Herbie: Fully Loaded",
        "duration": "PT2M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2241705497",
        "name": "Herbie: Fully Loaded",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODA0NjAzNjQzMF5BMl5BanBnXkFtZTgwNDUxMjcxMDI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODA0NjAzNjQzMF5BMl5BanBnXkFtZTgwNDUxMjcxMDI@._V1_.jpg",
        "uploadDate": "2016-09-29T02:12:12Z",
        "url": "https://www.imdb.com/video/vi2241705497/"
    },
    "url": "/title/tt0400497/"
}