{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin Sorbo",
            "url": "/name/nm0001757/"
        },
        {
            "@type": "Person",
            "name": "Michael Hurst",
            "url": "/name/nm0403628/"
        },
        {
            "@type": "Person",
            "name": "Kevin Smith",
            "url": "/name/nm0808963/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 30544,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108337/"
        },
        {
            "@type": "Person",
            "name": "Christian Williams",
            "url": "/name/nm0003994/"
        }
    ],
    "datePublished": "1995-01-16",
    "description": "Hercules, aided by his best friend Iolaus, goes on many adventures helping people and slaying mythical monsters using his half-god strength.",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTUxZTM5ZWUtNzc3My00ZTAxLWFkZjEtM2FlODQ3MzI3OWRlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "strongman,action hero,hero,greece,deity",
    "name": "Hercules: The Legendary Journeys",
    "original_info": {
        "id": "Hercules: The Legendary Journeys: Season 3_1996",
        "name": "Hercules: The Legendary Journeys: Season 3",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "soupin"
        },
        "dateCreated": "2012-02-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111999/"
        },
        "name": "Ultimate Tongue-in-Cheek",
        "reviewBody": "You mean this show was produced by Sam Raimi? The same horror loving, cheese flaunting, camera angle loving, wire fu abusing, low budget utilizing, Bruce Campbell toting, Ted Raimi killing, Spiderman trilogy directing machine? Yes.\n\nI have to admit, when I first saw this show I thought it was one of the worst shows I had ever seen. It was always on right before the show I would want to see and I would catch glimpses of the cheesy graphics, strange camera angles, insane dialogue, etc. and would laugh at how bad it was. However, the moment I discovered that Sam Raimi produced the show, it was an instant \"OOOOH, so the show is SUPPOSED to be that way!\" and I gave it a chance. The more I watched the show, the more I realized how amazing the show was. While the cheesy graphics were a result of the times and budget (keep in mind, though, that the same company who did the graphics in the show would go on to produce the award winning graphics for Lord of the Rings), Sam Raimi uses his trademark skills to make this show thoroughly entertaining.\n\nThe intentionally over-acted, pun-ridden dialogue, extensively choreographed action scenes, fun costumes, and crazy myth-based story lines make this show a delight, but I think it's the visible enjoyment of the main cast that makes this show really great. Everybody, from the reoccurring characters to the show's main stars are obviously having the time of their lives enjoying every single line and action sequence. It helps that the producers allowed the actors to adlib a lot of the dialogue and physical gags.\n\nAs for the show's cast, I couldn't imagine anyone better to play Hercules than 90's Television's straight lead man, Kevin Sorbo. Sure, he oftentimes just stands there with clothes that conveniently reveal his always sweaty muscular chest, but he fit the role to a T. He did a great job playing the almost sickeningly perfect half-mortal Hercules (something they joke about continuously in the series) and obviously enjoyed himself in the fight scenes. Other notable mentions include Bruce Campbell (of course) whose smarmy portrayal of the King of Thieves is priceless (he even directed a number of the best episodes of the show), Kevin Smith (no, not THAT Kevin Smith) who was priceless as Ares, God of War, reveling in over-the-top testosterone and much improvised humor, and Alexandra Tydings as Aphrodite, God of Love, who played the part of a ditsy blonde perfectly.\n\nHowever, probably THE most talented actor in the Hercules/Xena troupe was Michael Hurst, who portrayed Hercules short and peppy sidekick, Iolaus. In order to be noticed or successful as an actor here IN New Zealand, theater is still the primary form of entertainment. Well before Hercules, Hurst was already a renown New Zealand Shakespearean theater actor, director, producer, dancer, and singer, in addition to a championship fencer and acrobatic stage-fight choreographer. If I could choose anyone to compare this guy to, it'd be Britain's thespian Kenneth Branagh...if he could do gymnastics and was on speed. His energetic talent was so well known in the country that he was literally the first person to be cast in Hercules (BEFORE even Kevin Sorbo got the part as the lead). He stole the show with this energetic and over-the-top acting style for Iolaus and choreographed/performed most of the Hercules/Iolaus fight scenes and stunts. While he never really got a chance to exhibit his true acting prowress due to the light nature of the show, he came close with versatility. Presumably bored with his role, Raimi and the producers found every excuse in the book to allow Hurst to exercise his acting - by the time Hercules ended, he had played about 12 different characters in addition to Iolaus ranging anywhere from a drunken writer to a reoccurring woman dance instructor. There's no question that this show wouldn't have been as successful if Michael Hurst hadn't contributed his talent. I've always been kind of upset that Hurst will never be recognized outside our country (beyond \"that short hyper blonde guy from Hercules\") due to his extensive involvement with New Zealand theater - this guy could have easily gone on to do Broadway in the States or the Royal Shakespeare Company in Britain. However, I'm pleased to hear he still works on Sam Raimi projects when not doing plays, directing episodes for Legend of the Seeker and, more recently, Spartacus - both of which we get down here, yay! So, in sum, Sam Raimi is insane but incredibly brilliant for producing this show. I highly recommend it for those of you that \"get\" Raimi's unique direction or if you have any sense of humor whatsoever. It's extremely addictive. Do NOT take it seriously, or you will be disappointed - it's supposed to be campy. If you are a fan of anything Sam Raimi, entertaining fight sequences, Kevin Sorbo or Michael Hurst (if you happen to be from New Zealand), or enjoy watching actors have WAY too much fun for their own good, then this is a show for you."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Anchor Bay Entertainment",
        "duration": "PT4M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi766312729",
        "name": "Hercules: The Legendary Journeys: Season Five",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGVmYjMzOWUtZWUzNC00YWJmLTkwYWItYThkMDJmYjNlOTZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGVmYjMzOWUtZWUzNC00YWJmLTkwYWItYThkMDJmYjNlOTZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:26:06Z",
        "url": "https://www.imdb.com/video/vi766312729/"
    },
    "url": "/title/tt0111999/"
}