{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Ritter",
            "url": "/name/nm0000615/"
        },
        {
            "@type": "Person",
            "name": "Anne Archer",
            "url": "/name/nm0000271/"
        },
        {
            "@type": "Person",
            "name": "Bert Convy",
            "url": "/name/nm0176622/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1695,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072649/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "AJ Carothers",
            "url": "/name/nm0139218/"
        }
    ],
    "datePublished": "1980-02-08",
    "description": "A struggling actor buying milk stops a robbery while wearing a superhero uniform, promoting a movie. The unknown hero decides to try again. Can he impress his cute neighbor?",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Davidson",
            "url": "/name/nm0203429/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2Q3Mzc1MzEtY2M3Zi00ZDhkLWE3OWYtZDlkZDRkN2RhYTE0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "bare chested male,hairy chest,non comic book superhero,injury,gun",
    "name": "Hero at Large",
    "original_info": {
        "id": "Hero at Large_1980",
        "name": "Hero at Large",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DeanNYC"
        },
        "dateCreated": "2008-06-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080863/"
        },
        "name": "Hero With Heart",
        "reviewBody": "There's a lot going on with \"Hero At Large.\" Notably, this is a film that was, for the bulk of it, made on location in NYC, circa 1979. That fact alone would be enough to recommend it, because it gives you a glimpse into what the city was about at that time, how it looked, what was playing at local movie houses and on Broadway, and what was important to its residents.\n\nBut this film goes well beyond the basics of the setting. And that's due to a meaningful script by A.J. Carothers and a truly remarkable performance by John Ritter.\n\nIn some ways, Ritter's character here is in a similar situation to Dustin Hoffman's character in 1982's \"Tootsie.\" He plays an out of work actor who is desperate to get a part in a play, or even a commercial just to make the rent. When he books the role of Captain Avenger, a comic book hero who is the star of a cheesy live action film, he's not the motion picture actor, he's the stooge signing 8 x 10s outside of the theater dressed in the character's costume, one of dozens of actors playing the part all over town! But on the way home from his gig, when his local grocer gets held up at knife-point, he uses that costume to thwart the street toughs and saves the day! His interest in his next door neighbor, J. (Anne Archer) helps to fuel his heroics, and he finds himself starting to take chances to help people and win her attention and affection, and to make a statement about what's really important.\n\nA surprise is Bert Convy, who was known for his \"nice guy\" image, here goes against type as the sleazy PR manager, who was in charge of both the Captain Avenger film and the Mayoral Campaign of the incumbent, who sees a way of tying the two together, based on the genuine heroics of the actor, that regular guy trying to make people think about a bigger idea(l).\n\nThis is a New York movie, through and through, but it's the heart of the film that makes it special and that's due to John Ritter. His performance is always genuine, never hits a wrong note and is a tribute to the actor himself. It's those elements that take this film to soaring heights! Plus there are cameos by some of the city's longtime television reporters: Who knew that Penny Crone had brown hair at one time? \n\nHero At Large may not be the greatest superhero film ever, but it's better than many that are longer on special effects and much shorter on story.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from MGM",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi191823897",
        "name": "Hero At Large",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjcxZWI4NDYtNjdmOC00N2U1LTg2ZGUtNjBiYTEzOWZkMjgzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjcxZWI4NDYtNjdmOC00N2U1LTg2ZGUtNjBiYTEzOWZkMjgzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-29T03:24:00Z",
        "url": "https://www.imdb.com/video/vi191823897/"
    },
    "url": "/title/tt0080863/"
}