{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steven Keats",
            "url": "/name/nm0444198/"
        },
        {
            "@type": "Person",
            "name": "Carol Kane",
            "url": "/name/nm0001406/"
        },
        {
            "@type": "Person",
            "name": "Mel Howard",
            "url": "/name/nm0397495/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1546,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056954/"
        },
        {
            "@type": "Person",
            "name": "Joan Micklin Silver",
            "url": "/name/nm0798717/"
        },
        {
            "@type": "Person",
            "name": "Abraham Cahan",
            "url": "/name/nm0128605/"
        }
    ],
    "datePublished": "1975-10-15",
    "description": "In 1896, a Russian Jewish woman immigrates to New York's Lower East Side to reunite with her Americanized husband, but has difficulty assimilating.",
    "director": [
        {
            "@type": "Person",
            "name": "Joan Micklin Silver",
            "url": "/name/nm0798717/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDg4NWE3Y2UtM2M1OS00ZjcyLTlkNTQtZjIwY2JiM2IwY2M5XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "1890s,beard,jew,new york city,19th century",
    "name": "Hester Street",
    "original_info": {
        "id": "Hester Street_1975",
        "name": "Hester Street",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Galina_movie_fan"
        },
        "dateCreated": "2007-06-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0073107/"
        },
        "name": "Once Upon a Time On Hester Street",
        "reviewBody": "Joan Micklin Silver's directorial debut is a lovely, funny, warm, and observant historical drama-comedy about Jewish immigrants who left the little shtetl in Russia in the end of the 19th century for the hopes of better life and success in America. The film tells the story of a young couple, Jake (Steven Keats) and Gitl (Carol Kane). The husband came to Lower East End of Manhattan five years before his family and has gladly accepted American way of life making transition from Yankel to a Yankee, losing his beard and side curls on a way to become a real American and falling in love with Mamie Fine, attractive and independent young woman, an immigrant herself. When his wife Gitl and their son Yossi (Joey) arrive from Russia and join him in the flat at Hester Street, Jake is torn between his desire \"to live like educated people in an educated country\" and his wife's quiet but firm holding on to the traditions of Old Country. More likely, their marriage was arranged by their families in Russia and they don't have much in common when they meet after having lived separately in two different worlds for five years. The film concentrates on Gitl, quiet, gentle, pious seemingly fragile and naive young woman with huge dark eyes who has to make very serious decisions about her new life and how to make sense of it. \n\nEverything about this small independent movie is fine - its authentic look that was achieved by beautiful B/W cinematography, its soundtrack that uses the music by Herbert L. Clarke, a composer and famous cornet player; the dialogs in two languages, English and Yiddish, full of very unique humor that still shines. There are no villains in the story and no stereotypes. All characters have one thing in common - one day, they took a chance to start over, to leave their past behind, to movie to the absolutely new unknown world with the different language, customs, traditions, rhythm of life and to try to survive and succeed and not to lose their unique identity. Comic, moving, warm, lyrical, with the loving attention to the smallest details, with the love and understanding for its characters, \"Hester street\" is a perfect example of an independent art movie that was made on the shoe string budget, had difficulties to find distributors, but luckily did not get lost, found its way to the viewers, and brought Jewish ethnicity to the screen. One does not have to be an Art movie buff or an immigrant to enjoy \"Hester Street\". The simple story of a young traditional woman's transformation and coming to terms with her new life can be enjoyed by any viewer regardless their age, gender, or ethnic background.\n\nCarol Cane is fantastic as Gitl and more than deserves her Academy Award nomination for the Best Leading Actress. Doris Roberts (Marie of \"Everybody Loves Raymond\") is equally good as Gitl's and Jake's neighbor, Mrs. Kavisnky who becomes Gitl's friend and adviser.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1035387673",
        "name": "Hester Street",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDMzNzQzMjUtMjFiMC00MTM0LWExOGYtNDQ3OGZmY2QwZmQxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDMzNzQzMjUtMjFiMC00MTM0LWExOGYtNDQ3OGZmY2QwZmQxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-09-10T17:03:15.061Z",
        "url": "https://www.imdb.com/video/vi1035387673/"
    },
    "url": "/title/tt0073107/"
}