{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frances McDormand",
            "url": "/name/nm0000531/"
        },
        {
            "@type": "Person",
            "name": "Brian Cox",
            "url": "/name/nm0004051/"
        },
        {
            "@type": "Person",
            "name": "Brad Dourif",
            "url": "/name/nm0000374/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4306,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056805/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103667/"
        },
        {
            "@type": "Person",
            "name": "Jim Allen",
            "url": "/name/nm0020653/"
        }
    ],
    "description": "When an American human rights lawyer is assassinated in Belfast, it remains for the man's girlfriend, as well as a tough, no nonsense, police detective to find the truth.",
    "director": [
        {
            "@type": "Person",
            "name": "Ken Loach",
            "url": "/name/nm0516360/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmM5YWI3ZDctNGEyYy00NTQ1LWFiOTUtYzlmM2I1Yjk3MzA4XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "operation gladio,mi5,controversy,government cover up,black operation",
    "name": "Hidden Agenda",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cnlawson2004"
        },
        "dateCreated": "2008-09-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099768/"
        },
        "name": "sol1218, you're getting your Labour and Tory leaders thoroughly mixed up!",
        "reviewBody": "Whooaa! Slow down, sol1218 from Brooklyn NY.\n\nThe political scene in the U.K. looked like this: Edward Heath, bachelor leader of the Conservatives, won the election in 1970. He took Britain into the then Common Market in 1973, but called an election in February 1974 when the miners forced him to declare a three-day week.\n\nThe Tory slogan for the election was: Who governs Britain? The result was confused, but the message was fairly clear: Not you, matey. Labour under Harold Wilson took office with a slim majority. Wilson called a second election in October, which he won narrowly, increasing his majority slightly.\n\nHe held a referendum on the Common Market in 1975, which he won by sidelining the extremists of both Left and Right. He ruled until 1976 when he resigned from politics, for reasons which were obscure at the time, but probably because he had been diagnosed with Parkinson's. It is certainly true that the Right plotted endlessly against him.\n\nJim Callaghan, who had been Chancellor, Home Secretary and Foreign Secretary, took over as P.M. and called an election after his full five-year term. (In the U.K. governments normally call elections after four years.) In fact Callaghan was forced to do so because of a move by the Scottish Nationalists. Had he called the election just a year earlier, he stood a good chance of winning, say many pundits.\n\nMeanwhile, the Conservatives had deposed Edward Heath who had lost them two elections, and Maggie Thatcher replaced him as leader. She swept to power in 1979, and as we all know, won the next two elections.\n\nEconomic chaos was the watchword of the day and there were many strikes. The situation in Northern Ireland, which had started simmering with the Civil Rights movement of 1968, gradually deteriorated. The assassinated politician of the film whose name is Nevin, may well represent Airey Neave, a war hero who had escaped from the high-security Colditz Castle, a German-speaking lawyer who had attended the Nuremberg Trials and a hardline Conservative with military and security connections, who was a close adviser of Thatcher. He was blown up outside the House of Commons on March 30, 1979, by the INLA a few weeks before the election.\n\nKen Loach has never made any secret of his sympathies for the Irish cause. His powerful film \"Wind that shakes the barley\", which apparently did not make much money in the U.K., had Conservative politicians fulminating about treason and lack of patriotism because of his portrayal of the brutal Black and Tans. The name was given to the ex-British army personnel and (inaccurately) also to the auxiliaries who were sent to Ireland between 1920 and 1921 to crush the IRA and Sinn Fein, but who also attacked and killed civilians. Historians agree, however, that Loach was pretty accurate in his historical recreation. The film also shows the ruthlessness of Irish-on-Irish killings in the Civil War afterwards.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When an American human rights lawyer is assassinated in Belfast, it remains for the man's girlfriend, as well as a tough, no nonsense, police detective to find the truth.",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1071170329",
        "name": "Original Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmZiN2U5MTAtNzBhZS00MTY1LThjZTgtMjA3NmY5YWIzYTU0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmZiN2U5MTAtNzBhZS00MTY1LThjZTgtMjA3NmY5YWIzYTU0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-11-30T15:41:38.972Z",
        "url": "https://www.imdb.com/video/vi1071170329/"
    },
    "url": "/title/tt0099768/"
}