{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joan Collins",
            "url": "/name/nm0001058/"
        },
        {
            "@type": "Person",
            "name": "Don Ameche",
            "url": "/name/nm0000747/"
        },
        {
            "@type": "Person",
            "name": "Phil Baker",
            "url": "/name/nm0048831/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 64,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040304/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036884/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056447/"
        },
        {
            "@type": "Person",
            "name": "Michael Matessino",
            "url": "/name/nm0558349/"
        },
        {
            "@type": "Person",
            "name": "Kevin Burns",
            "url": "/name/nm0122745/"
        },
        {
            "@type": "Person",
            "name": "Jerry Decker",
            "url": "/name/nm1006259/"
        }
    ],
    "datePublished": "1997-11-18",
    "description": "Joan Collins hosts a collection of film clips, mostly from musicals, that were cut from the released product.",
    "director": [
        {
            "@type": "Person",
            "name": "Shelley Lyons",
            "url": "/name/nm0529163/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Documentary",
        "Comedy",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjc0ODkyMDAwNF5BMl5BanBnXkFtZTYwNTIzMTE5._V1_.jpg",
    "keywords": "archive footage,hollywood,filmmaking,behind the scenes,narration",
    "name": "Hidden Hollywood: Treasures from the 20th Century Fox Film Vaults",
    "original_info": {
        "id": "Hidden Hollywood_1997",
        "name": "Hidden Hollywood",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "t1z2f"
        },
        "dateCreated": "2005-12-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0131423/"
        },
        "name": "great dances",
        "reviewBody": "There are some wonderful dances on these two disks, NOT cut because they were in any way inferior material, but for other less admirable reasons. Well worth getting if you're a dance fan. I forget which are one each disk, but there are: (1) Bill \"Bojangles\" Robinson's two dances deleted from \"Cafe Metropole\". Fox promised to give him a chance to really show what he could do when not dumbing down his dancing to spotlight Shirley Temple, then double crossed him and cut the scenes from the film, apparently afraid that America still wasn't ready to acknowledge mature black talent. The tap scene is classic Bojangles, elegant and precise. But the other scene ... oh brother! he does a tap \"Apache\" dance (that 40s dance form where the man tosses the woman around the stage)! The combination of forms doesn't really work that well, but is worth watching just for its uniqueness. (2) The original \"Shiek of Araby\" scene from \"Tin Pan Alley\", cut because the Hayes office thought the costumes were too revealing. Since the movie isn't currently available for viewing in any form one can't tell how much remains in the released version, but the outtakes are (a) the original harem scene with those scanty see-through costumes (tame by modern standards), a decent production type number, (b) the Nicholas Brothers dancing as djinns: classic high-energy tap in their usual style (but without their usual tuxedos) (c) Betty Grable & Alice Faye also teasingly clad singing \"Shiek of Araby\" with Jack Oakie - fun! (3) Ginger Rogers doing a high energy charleston. I forget what it was cut from - maybe Roxie Hart? - but it shows off her dancing skill. (4) Betty Grable dance outtakes from \"Springtime in the Rockies\". She could also dance better than she's given credit for.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0131423/"
}