{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Radha Mitchell",
            "url": "/name/nm0593664/"
        },
        {
            "@type": "Person",
            "name": "Ally Sheedy",
            "url": "/name/nm0000639/"
        },
        {
            "@type": "Person",
            "name": "Patricia Clarkson",
            "url": "/name/nm0165101/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10825,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046740/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011355/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017323/"
        },
        {
            "@type": "Person",
            "name": "Lisa Cholodenko",
            "url": "/name/nm0158966/"
        }
    ],
    "datePublished": "1998-06-12",
    "description": "A young female intern at a small magazine company and a drug-addicted lesbian photographer slowly fall in love while exploiting each other to advance their respective careers.",
    "director": [
        {
            "@type": "Person",
            "name": "Lisa Cholodenko",
            "url": "/name/nm0158966/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGY4NTRmN2ItMDFkMS00YjY4LWFlZWEtZGFkYjRjODE2OTA4XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "sexploitation,f rated,nudity,mental health,drug overdose",
    "name": "High Art",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "philip_vanderveken"
        },
        "dateCreated": "2005-08-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0139362/"
        },
        "name": "This isn't a typical 'art-movie', just because it talks about an artist.",
        "reviewBody": "A movie with a title like this one is bound to stay unknown and unpopular. Most people don't understand anything about modern art (I'm one of them) and certainly don't want to see a movie about its creation. But somehow I was curious about it, hoping that this movie would explain something about how it all works and that it would give me an insight in this unknown and isolated world.\n\nSyd is the newly appointed assistant editor of Frame magazine, a magazine about art photography, who lives together with her boyfriend in an apartment. When there is a leak in their ceiling, she goes to the neighbors upstairs to complain. But what she didn't know is that this neighbor is no-one else than the talented and once famous photographer Lucy Berliner. Immediately she sees a nice opportunity to boost her career and starts hanging out more with Lucy and her junkie friends, who almost permanently seem to live in Lucy's apartment. She encourages Lucy to shoot new pictures for her magazine, but as they grow closer to each other, Syd's boyfriend becomes more and more jealous and Syd starts to fall in love with Lucy.\n\nWhat I liked about this movie was that it was about a photographer, but that it never felt pretentious. Lucy felt like a normal woman and not like someone who thinks she is better, just because she is an artist. Also the contrast between Syd's relationship with the down-to-earth Lucy on one side and the pretentiousness of Lucy's drug using friends and the editors from Frame on the other, was refreshing. This isn't a movie that beautified the art world, this showed the hard reality. Take for instance the scene in which the head editors - who pretend to know all about photography - never have heard of Lucy Berliner, but don't want to admit that to their pears and therefor start lying or how they aren't interested in the art itself, but only in the money that it will earn for them as they publish it...\n\nAfter I had seen this movie and already had decided what rating I would give it, I went to see on IMDb which rating this movie actually received from others. It struck me that most men seem to hate this movie, while almost all women seem to like it. Perhaps it is because those men hoped to see more of the lesbian relationship between the women (including a steaming sex scene), perhaps it was because they believed this was an 'art movie' (which in reality it isn't). Anyway, I'm a man too, but I liked what I saw. I found the contrasts in the story, the delicate love story,... and especially the ending all very interesting and moving. That's why I give this movie at least a 7.5/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from October Films",
        "duration": "PT1M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi363659545",
        "name": "High Art",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGY3ODE5MzUtNzMwNS00MzIwLWJmMmUtN2RlYzQ3ZTEyYmExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGY3ODE5MzUtNzMwNS00MzIwLWJmMmUtN2RlYzQ3ZTEyYmExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:25:38Z",
        "url": "https://www.imdb.com/video/vi363659545/"
    },
    "url": "/title/tt0139362/"
}