{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin McNally",
            "url": "/name/nm0573618/"
        },
        {
            "@type": "Person",
            "name": "Minnie Driver",
            "url": "/name/nm0000378/"
        },
        {
            "@type": "Person",
            "name": "Mary McCormack",
            "url": "/name/nm0005203/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3634,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018857/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137372/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Person",
            "name": "Kim Fuller",
            "url": "/name/nm0298279/"
        },
        {
            "@type": "Person",
            "name": "Georgia Pritchett",
            "url": "/name/nm0698095/"
        }
    ],
    "datePublished": "2001-10-26",
    "description": "A nurse eavesdrops with a friend on a cell phone conversation that describes a bank heist. She and the friend then conspire to blackmail the robbers for two million dollars.",
    "director": [
        {
            "@type": "Person",
            "name": "Mel Smith",
            "url": "/name/nm0809321/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjVhOTkzMzItNGZkZC00MjE2LTg0YzctZTY2OGEzZDFjMmQwXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "girls with guns,director cameo,london england,satire comedy,blackmail",
    "name": "High Heels and Low Lifes",
    "original_info": {
        "id": "High Heels and Low Lifes_2001",
        "name": "High Heels and Low Lifes",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-11-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0253126/"
        },
        "name": "No proper laughs but has just enough rough energy to make it entertainment for an undemanding evening",
        "reviewBody": "With her arty and selfish boyfriend busy recording digital signals in order to make an audio installation, Shannon goes out for a drunken night with her friend Frances. Coming home later that night they are messing around with the sound recording equipment when they pick up what they believe to be a bank robbery in progress. Trying to report it to a police station snowed under with muggers, pushers and drunken yobs, achieves nothing and the next day they hear on the news that the robbery has taken place. With the telephone number of one of the gang still written on her hand from the recording equipment, Frances comes up with the idea of blackmailing the robbers for a cut of the cash. Unfortunately for her, she forgets that the gang are criminals and soon the stakes are much higher than Shannon or Frances bargained for.\n\nEverything about this film put me off it  the fact that it was a UK comedy, Mel Smith, the cast of British TV comedians and the poor reviews, but anyway I decided to give it a go when it came on television recently. From the very start the plot lacked any sort of credibility, relying on some very forced points to start the story and to keep it moving throughout. At times this is annoying but for most of the film the rough energy of the film just about covers just how very silly it is. The film is meant to be a comedy but it rarely made me laugh, but it did have just enough rough humour to it to make it reasonably enjoyable as a sort of brainless piece of entertainment. Of course it is not a great film but the undemanding viewer will at least find it is easy to watch.\n\nThe cast are a mixed bunch, some of them make the film better but generally the majority are given little to actually do. Driver and McCormack are enjoyable and fun to watch and they make good on what could have been stupid roles. They play it larger than life and, although never funny, are a big part of the film being at least a bit of fun. The support cast throws up a lot of well-known faces from both acting and comedy, but none of them really make a mark other than showing their face. Dyer, Gambon and McNally just show up and do their best but comedians such as Sessions, Williams, Eldon and Simpson don't really have any material to show what they can do. Director Smith makes a cameo and as director he does an OK job without really ever doing anything unique; I suppose he at least makes it look more professional that some British comedies have  shame he couldn't find the laughs.\n\nOverall this is a poor comedy if you are looking for consistent laughs, but it has got just enough rough energy to keep it moving and it never made me feel like the laughs were missing so much as just not there (if you see the difference). Of course it is basic and simple but I was sort of in the mood for that and, meeting it on these terms, it made for passable entertainment but I'll forget it soon enough!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Touchstone Pictures",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi262996249",
        "name": "High Heels and Low Lifes",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmJmNGExMTktN2Y5MS00ZTVkLWE4MDMtY2YyZDUzMzNhOTE2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmJmNGExMTktN2Y5MS00ZTVkLWE4MDMtY2YyZDUzMzNhOTE2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:25:44Z",
        "url": "https://www.imdb.com/video/vi262996249/"
    },
    "url": "/title/tt0253126/"
}