{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jim Caviezel",
            "url": "/name/nm0001029/"
        },
        {
            "@type": "Person",
            "name": "Rhona Mitra",
            "url": "/name/nm0593961/"
        },
        {
            "@type": "Person",
            "name": "Frankie Faison",
            "url": "/name/nm0265670/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9117,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002572/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094922/"
        },
        {
            "@type": "Person",
            "name": "Craig Mitchell",
            "url": "/name/nm0593243/"
        },
        {
            "@type": "Person",
            "name": "Hans Bauer",
            "url": "/name/nm0061829/"
        }
    ],
    "datePublished": "2004-02-19",
    "description": "Rennie Cray (Caviezel) embarks on a bloodthirsty rampage to avenge the death of his wife who was struck down by a serial killer - a man who hunts and kills women using his '72 El Dorado.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Harmon",
            "url": "/name/nm0363553/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Action",
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4ODMxNzEwN15BMl5BanBnXkFtZTYwODcxMjM3._V1_.jpg",
    "keywords": "psychopath,serial killer,obsession,woman in jeopardy,paraplegic",
    "name": "Highwaymen",
    "original_info": {
        "id": "Highwaymen_2004",
        "name": "Highwaymen",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol1218"
        },
        "dateCreated": "2005-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0339147/"
        },
        "name": "He saw her..He toyed with her..He killed her., And then he came after ME!",
        "reviewBody": "**SPOILERS** The movie \"Highwaymen\" that takes place on the wide open roads of California is a fairly entertaining as well as interesting film if you overlook some of the major inconsistencies of it's plot. A homicidal driver Fargo, Clom Feore,who's mode of operations is running down, and killing, young women drives his car into and kills James \"Rennie\" Cray, James Cavlezel, young and beautiful wife Olivia, Guylaine St.Onge,right before his eyes. \n\nTracking the killer down James slam his car into him causing Fargo to lose an arm a leg and an eye. That action also puts James behind bars for three years for vehicular homicide. Out of jail and still looking for his wife's killer James connects a string of hit-and-run \"accidents\" to Fargo and starts to close in on him. Fargo after his accident is more robot then man and as James puts it \"His body is his car\". Fargo begins to play a deadly cat-and-mouse game with James that soon involves Molly, Rhona Mitra, who herself had been traumatized as a little girl when she survived a car accident that killed both her parents.\n\nJames Cavlezel is so glum and serious in the film that he acts as if he on a mission from God to stop and apprehend or kill the mad motorist, Fargo, from his deadly rounds of killing people all over the state. \n\nClom Feore is both weird and terrifying as the machine-like killer who uses his car as an ingenious and effective killing device. This despite his serious disability is more then a match for the entire California Highway Police Department. \n\nRhona Mitra is both pretty and courageous as Molly the person who Fargo has in his sights as his next victim and who's used, somewhat unwillingly, as bait by James to trap and catch him. Frankie Falson is a reluctant hero as State Traffic Investagator Will Macklin who doesn't carry and never shot a gun in his life. It was Will who put the crazed Fargo's rampage of murder on the roads and highways to flaming and bloody end. \n\nThe movies many action scenes, that are really stunning, includes a heart-stopping car and truck smash-up in a traffic tunnel that seemed to have be done without the use of any computer-enhanced special effects, thats so common in movies like \"Highwaymen\" today, that made it all that more startling and effective.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Coming Soon\" please edit out end slate",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2561474841",
        "name": "Highwaymen",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTdhMWZiZmYtMTZjZS00ZWViLTgzOTUtY2NiNDU4MjRiOTQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTdhMWZiZmYtMTZjZS00ZWViLTgzOTUtY2NiNDU4MjRiOTQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:26:59Z",
        "url": "https://www.imdb.com/video/vi2561474841/"
    },
    "url": "/title/tt0339147/"
}