{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Elizabeth Gracen",
            "url": "/name/nm0001286/"
        },
        {
            "@type": "Person",
            "name": "Paul Johansson",
            "url": "/name/nm0424035/"
        },
        {
            "@type": "Person",
            "name": "Patricia Gage",
            "url": "/name/nm0300833/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1306,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014769/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069087/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0040305/"
        }
    ],
    "datePublished": "1998-09-26",
    "description": "A female Immortal and thief tries to redeem herself with the help of an ex-cop.",
    "genre": [
        "Action",
        "Adventure",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzMzOTIwNDQ5MF5BMl5BanBnXkFtZTcwNzQzODkyMQ@@._V1_.jpg",
    "keywords": "frame up,psychotronic series,female immortal,highlander,cyber crime",
    "name": "Highlander: The Raven",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Damien-8"
        },
        "dateCreated": "1998-12-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0144714/"
        },
        "name": "Not even close to Original",
        "reviewBody": "First I must say that I love Elizabeth Gracen acting in general and the way she portrays Amanda is great. But after watching this series I must say she should get an Oscar for holding this show afloat. First the writing is not even close to the standard of the original and I think that she just had more on screen chemistry with Adrian Paul. One of the things people loved to see the sparks fly between Amanda and Duncan. Not Amanda and Nick.\n\nPaul Johansson plays a cop turned sort of renegade after his female partner is killed trying to save Amanda. Then in such he loses his job and now works with Amanda tracking down bad guys.\n\nWhile Elizabeth Gracen still performs well with what limited talent around her this show is not that good. In all truth it borders on being simply bad. Nick (Paul) is not a eye drawing character and you spend most of your time trying to wait until he leaves. The story lines don't make a lot of sense and the only thing that is semi decent is the flashbacks dealing with Amanda (Elizabeth)\n\nWhat the producers of the show should have done is when the new series of movies are made Elizabeth should be written into those. Hopefully Paul will be taken out of the show and the writers can try and take this show in a new direction. Concentrating more on the character Amanda."
    },
    "url": "/title/tt0144714/"
}