{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Lambert",
            "url": "/name/nm0000483/"
        },
        {
            "@type": "Person",
            "name": "Adrian Paul",
            "url": "/name/nm0001600/"
        },
        {
            "@type": "Person",
            "name": "Bruce Payne",
            "url": "/name/nm0668271/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20770,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0069087/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Person",
            "name": "Gregory Widen",
            "url": "/name/nm0927074/"
        },
        {
            "@type": "Person",
            "name": "Eric Bernt",
            "url": "/name/nm0077171/"
        },
        {
            "@type": "Person",
            "name": "Gillian Horvath",
            "url": "/name/nm0395741/"
        }
    ],
    "datePublished": "2000-09-01",
    "description": "Immortals Connor and Duncan MacLeod must join forces against Kell, an evil immortal who has become too strong for anyone to face alone.",
    "director": [
        {
            "@type": "Person",
            "name": "Douglas Aarniokoski",
            "url": "/name/nm0007439/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Action",
        "Adventure",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWMyZDdhNDYtNWE5MS00N2Q5LThmYjMtOGMzZjFmOGIzMWQ3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "1550s,1630s,1620s,1710s,18th century",
    "name": "Highlander: Endgame",
    "original_info": {
        "id": "Highlander: Finale_1995",
        "name": "Highlander: Finale",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Fenris Fil"
        },
        "dateCreated": "2007-12-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0144964/"
        },
        "name": "The nail in the coffin of the already confused Highlander Franchise.",
        "reviewBody": "Unfortunately the \"Highlander\" concept has been heavily tainted by multiple visions from a variety of people and a constant push from the money men to milk it for all it's worth. Each individual addition thus far, while reasonable in isolation managed to damage the overall reputation of this franchise and directly damage the quality of the original classic movie when the whole thing is considered together.\n\nNow what they have done with this fourth movie is created something that can't even stand in isolation and when put together with everything else tears it all to pieces, spits on it and throws it in the bin, just for the sake of giving this particular piece some feeling of importance.\n\nOne of my biggest pet peeves with movie sequels is when the writers of the latest piece decide to essentially re-write the whole thing and ignore where others have taken us up until this point. For better or worse, we have been taken to a point and it is just arrogance to assume you can re-write it all better then those that have gone before, while it shows limited skill to not be able to work inside that framework. There are many ways they could have made a tie in between the TV series and all the movies work, but they chose to make this a partial reboot instead.\n\nThe Critical mistake they made was to belittle the original film. No franchise should dismiss the reason that it is a franchise. Although it would still annoy me, they could have gotten away with the partial reboot, if they had just ignored the 2nd and 3rd movie. They even would have gotten away with not fully following on from the series. But they couldn't resist messing with the original to the point that they almost totally dismissed the events of film as meaningless and so it's no surprise that this has scored the low rating it has here on the IMDb.\n\nI watched the whole of the series as well as all the films and this movie fails to adequately fit in with any of it. One day I hope movie makers will learn that you either need to do a full reboot or get people capable of working with what they already have. Don't just let the new guys mess up everyone that went before them.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Highlander: Endgame: New Cut - DVD",
        "duration": "PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2045746713",
        "name": "Highlander: Endgame",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjVhOTY5YzctNmZkZS00OTExLTk4YTAtNGNhMWZhOGQzMzUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjVhOTY5YzctNmZkZS00OTExLTk4YTAtNGNhMWZhOGQzMzUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:27:00Z",
        "url": "https://www.imdb.com/video/vi2045746713/"
    },
    "url": "/title/tt0144964/"
}