{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Toshir么 Mifune",
            "url": "/name/nm0001536/"
        },
        {
            "@type": "Person",
            "name": "Yutaka Sada",
            "url": "/name/nm0755403/"
        },
        {
            "@type": "Person",
            "name": "Tatsuya Nakadai",
            "url": "/name/nm0619938/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 47035,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "alternateName": "High and Low",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0095216/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Hideo Oguni",
            "url": "/name/nm0644823/"
        },
        {
            "@type": "Person",
            "name": "Ry没z么 Kikushima",
            "url": "/name/nm0452878/"
        },
        {
            "@type": "Person",
            "name": "Eijir么 Hisaita",
            "url": "/name/nm0386750/"
        }
    ],
    "datePublished": "1963-11-26",
    "description": "An executive of a Yokohama shoe company becomes a victim of extortion when his chauffeur's son is kidnapped by mistake and held for ransom.",
    "director": [
        {
            "@type": "Person",
            "name": "Akira Kurosawa",
            "url": "/name/nm0000041/"
        }
    ],
    "duration": "PT2H23M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTI4NTNhZDMtMWNkZi00MTRmLWJmZDQtMmJkMGVmZTEzODlhXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "drug overdose,class differences,house on a hill,detective,rich man",
    "name": "Tengoku to jigoku",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jemmytee"
        },
        "dateCreated": "2004-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057565/"
        },
        "name": "Kurosawa at his best and most subtle",
        "reviewBody": "This is one of those rare movies I had to watch twice to catch all the meaning and beauty of its construction, that is how sleek and polished this film is. The storyline is deceptively simple -- a businessman named Gondo is about to take control of the company he's worked in for years when he's told his son's been kidnapped. It turns out the kidnappers got his chauffeur's son by mistake, but they still want him to pay the ransom. If he does, he will be financially ruined. If he doesn't, he will be reviled. Which will he choose? This makes up the first half of the movie, culminating in a breathtaking scene on one of Japan's bullet trains. The second half is the police search for the kidnapper/murderer and how a case is built that will take him to the gallows.\n\nNow this sounds like your typical cop thriller, the type Hollywood churns out with one hand tied behind its back, but Kurosawa makes it into a meditation on honor and decency, and on how one's choices can lead one to Heaven or to Hell in little steps that seem to be taking you nowhere. Gondo is an honorable man who worked hard to built himself a life of wealth and power. This is no small feat, considering Japan is not known as a society where one can easily change one's station in life, so this adds to his dilemma; he will not only lose his fortune, he will also lose his hard-gained power and respect in the business community, all for a child that is not even his. And not only will he lose but his own wife and son will, as well. But to NOT pay the ransom means he will lose everything in him that is human and decent, and his wife and son will suffer from that, too.\n\nThis is a big deal -- not just in Japanese society but in the world as a whole. It doesn't matter if you live in Nepal or Kenya or Argentina or New York City, when faced with the choice of losing your position in your society or losing your soul, which would you choose? And would you still make that choice knowing that even if the cops catch the bad guy, it will make no difference in your own circumstances? Just a glance at some of the recent stock scandals gives you a good idea of where most people fall in their choices. And even Ed McBain, upon whose novel this movie is based, knew how hard it would be to give up your world for your spirit; his businessman refuses to pay the ransom.\n\nTo me, this movie is Kurosawa at his best and most subtle. Every shot is composed and measured and done just right. Not all films have to have bombs exploding and chase scenes and people going \"Boo!\" to affect you; sometimes just a man riding on a train en route to what he knows will be a catastrophe to him and his world is enough to make you thank the heavens for a story well told.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2921184793",
        "name": "Trailer [OVS]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDhkZmQ2YjYtZmVlOS00Njk3LWIzMjItM2M1ZWZjYmZmZjhmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDhkZmQ2YjYtZmVlOS00Njk3LWIzMjItM2M1ZWZjYmZmZjhmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-02T19:06:17.256Z",
        "url": "https://www.imdb.com/video/vi2921184793/"
    },
    "url": "/title/tt0057565/"
}