{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bing Crosby",
            "url": "/name/nm0001078/"
        },
        {
            "@type": "Person",
            "name": "Grace Kelly",
            "url": "/name/nm0000038/"
        },
        {
            "@type": "Person",
            "name": "Frank Sinatra",
            "url": "/name/nm0000069/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16571,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0235745/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058998/"
        },
        {
            "@type": "Person",
            "name": "John Patrick",
            "url": "/name/nm0665875/"
        },
        {
            "@type": "Person",
            "name": "Philip Barry",
            "url": "/name/nm0058129/"
        }
    ],
    "datePublished": "1956-07-17",
    "description": "With socialite Tracy Lord about to remarry, her ex-husband - with the help of a sympathetic reporter - has 48 hours to convince her that she really still loves him.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Walters",
            "url": "/name/nm0910199/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Comedy",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWM2ODNhOTktMjgzMS00MmNhLTgwOGQtZTBiOGUwZTBjZDI5XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "jazz music,newport rhode island,socialite,remake,based on play",
    "name": "High Society",
    "original_info": {
        "id": "High Society_1956",
        "name": "High Society",
        "year": "1956"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stryker-5"
        },
        "dateCreated": "1999-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0049314/"
        },
        "name": "Sensational ... That's All",
        "reviewBody": "A society wedding is being arranged in Newport, Rhode Island. The beautiful Tracy Lord is to marry George Kitteredge. However, Tracy's ex-husband, the songwriter Dexter Haven, has never stopped loving her and even now has hopes of winning her back. Two journalists, Mike Connor and Liz Imbrie, have arrived to cover the story for 'Spy' Magazine.\n\nDexter has scheduled the Newport Jazz Festival for the same week as the nuptials, and this brings Louis Armstrong (playing himself) to town. The divine Tracy is adored by three men - Dexter, George and Mike Connor. She begins to harbour doubts about her forthcoming marriage...\n\n\"High Society\" is a charming reworking of \"The Philadelphia Story\", the Grant-Hepburn comedy, which was in turn a remodelling of a successful Broadway play. The one great difference with this version is that \"High Society\" is a glorious musical masterpiece. Cole Porter's score has to be one of the greatest collections of songs ever filmed.\n\nGrace Kelly is good as the imperious Tracy. \"I'm a cold goddess,\" she intones, but she thaws spectacularly in the warmth of love. Bing Crosby as Dexter is his usual droll and stylish self. Crosby is a class act who holds the screen with effortless poise and cracks the funnies with sparkling sarcasm. Sinatra is in knockout form. Rarely has that legendary voice achieved the resonant timbre on display here. Satchmo blasts out a couple of breezy jazz numbers, and comments on the action like a latter-day Greek chorus.\n\nThe songs include five all-time classics. \"True Love\" is a gorgeous duet in which Kelly unveils a tuneful if brittle singing-voice. \"Who Wants To Be A Millionaire?\" is rightly world-famous, and is staged here with clever clownage by Sinatra and Celeste Holm (playing Liz). Satchmo's band accompanies Crosby in a swinging \"You Has Jazz\". The showstopper, \"What A Swell Party This Is\", has Crosby and Sinatra at their very best, wisecracking self-referentially as they belt out a gem of a song. My personal favourite, \"You're Sensational\", is beautifully rendered by Sinatra. Watch Frank and Grace in the instrumental break, falling in love with their eyes only.\n\nA confection of sublime music and snappy dialogue, \"High Society\" is shot in bright, eye-catching Technicolor with an attractive pastel blue predominating throughout. A delightful film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A spoiled heiress must choose among three suitors: her jazz musician ex-husband, a stuffy businessman, and an undercover tabloid reporter.",
        "duration": "PT4M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1610202137",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODc0NmJkZTktYTkxZC00ZDY4LWE0MzMtNDgwZjU2ZWQ0NDA4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODc0NmJkZTktYTkxZC00ZDY4LWE0MzMtNDgwZjU2ZWQ0NDA4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-05-02T14:22:23.933Z",
        "url": "https://www.imdb.com/video/vi1610202137/"
    },
    "url": "/title/tt0049314/"
}