{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        },
        {
            "@type": "Person",
            "name": "Verna Bloom",
            "url": "/name/nm0089244/"
        },
        {
            "@type": "Person",
            "name": "Marianna Hill",
            "url": "/name/nm0384494/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 60144,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0102264/"
        },
        {
            "@type": "Person",
            "name": "Ernest Tidyman",
            "url": "/name/nm0862781/"
        },
        {
            "@type": "Person",
            "name": "Dean Riesner",
            "url": "/name/nm0718466/"
        }
    ],
    "datePublished": "1973-04-07",
    "description": "A gun-fighting stranger comes to the small settlement of Lago and is hired to bring the townsfolk together in an attempt to hold off three outlaws who are on their way.",
    "director": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama",
        "Mystery",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGI3YjIyZjYtYzJiNy00NTM4LWEzMmEtMmZiY2VjMjU5MzliXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "anti hero,revisionist western,revenge,small town,rape",
    "name": "High Plains Drifter",
    "original_info": {
        "id": "High Plains Drifter_1973",
        "name": "High Plains Drifter",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2008-07-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068699/"
        },
        "name": "Supernatural Western?",
        "reviewBody": "A lone gunman with no name and seemingly with no past, rides into the dusky town of Lago. The residents of Lago at first view the stranger with suspicion, but when news that some outlaws that are out for blood are on their way to town, they ask the stranger for his help. \n\nThis is Clint Eastwood's first Western film that he directed, and it's clear and evident that the guy not only loves the genre that made his name, he also knows what makes it work. Obviously having worked for Sergio Leone, Eastwood was making notes because High Plains Drifter oozes the mythical aura of many of Leone's finest genre offerings. To which, with thanks, the result is one of the best offerings in the 70s for the Oater enthusiast. \n\nThe film opens with our mysterious drifter slowly coming out of the beautiful sprawling haze and into Lago, it's ethereal, then there's just the sound of the horse breathing and the clop of its hooves that can be heard (the sound mix here is incredible), it's a gloriously mysterious opening that sets the tone perfectly. Yet Eastwood is just toying with us though, for a quick jolt of sex and violence snaps us out of the beatific warmth and into a quite hauntingly cold and morally challenged place. From here on in the stranger will demand all manner of odd things from the residents of Lago, he seems to be toying with them and revelling in their discomfort, with Lago quickly resembling an arid hellhole. You see, Lago has a dark secret, and our mysterious stranger has a purpose, and it's this purpose that makes High Plains Drifter an intriguing and gripping experience. \n\nA well known fact now is that the great man of the genre, John Wayne, wrote Eastwood to strongly complain about his harsh vision of the West, one can only think the Duke failed to grasp the post Vietnam feel of a 70s made Western. It's a great directorial effort from Eastwood, more so when you marry up his acting performance to his directorial duties. Very much the perfect role, it lets Eastwood accentuate his rugged Western leanings. Eastwood would direct the similarly themed Pale Rider in the 80s and then the genre crown topper Unforgiven in the 90s. A Western great in each decade? Well that will always be debatable, but what we do know is that the Western genre was considerably lucky to have had such a man to keep the genre going for the newer interested wanderers into the Wild West. \n\nBeautifully photographed (Bruce Surtees) on the shores of Mono Lake, California, it's a film pungent with sex, sadism, retribution and risks. High Plains Drifter is mystical and magnificent and essential Western fare. 9/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for High Plains Drifter",
        "duration": "PT44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2685577497",
        "name": "High Plains Drifter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2IyMGQ1OTAtZmRiNy00MWY1LTk2YjEtZDM4ODVkZjllN2ZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2IyMGQ1OTAtZmRiNy00MWY1LTk2YjEtZDM4ODVkZjllN2ZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-08-21T04:26:10Z",
        "url": "https://www.imdb.com/video/vi2685577497/"
    },
    "url": "/title/tt0068699/"
}