{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emmanuelle Riva",
            "url": "/name/nm0728938/"
        },
        {
            "@type": "Person",
            "name": "Eiji Okada",
            "url": "/name/nm0645402/"
        },
        {
            "@type": "Person",
            "name": "Stella Dassas",
            "url": "/name/nm0202072/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33618,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "alternateName": "Hiroshima Mon Amour",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048010/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062516/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067278/"
        },
        {
            "@type": "Person",
            "name": "Marguerite Duras",
            "url": "/name/nm0243921/"
        }
    ],
    "datePublished": "1960-05-16",
    "description": "A French actress filming an anti-war film in Hiroshima has an affair with a married Japanese architect as they share their differing perspectives on war.",
    "director": [
        {
            "@type": "Person",
            "name": "Alain Resnais",
            "url": "/name/nm0720297/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzY2NTA1MzUwN15BMl5BanBnXkFtZTgwOTc4NTU4MjE@._V1_.jpg",
    "keywords": "cat,reminiscence,city name in title,post world war two,actress",
    "name": "Hiroshima mon amour",
    "original_info": {
        "id": "Hiroshima Mon Amour_1959",
        "name": "Hiroshima Mon Amour",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "miguel_marques"
        },
        "dateCreated": "2000-12-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0052893/"
        },
        "name": "Deep, beautiful, devastating, extremely personal cinema",
        "reviewBody": "In my previous paper I said that À bout de souffle was an extremely complicated movie. Well, if we compare it to Resnais' Hiroshima, mon amour, it just seems to be a skilled aesthetic exercise. I think Resnais takes a further step in modern cinema intermingling influences from surrealism, modernism and the New Wave of French cinema: intimate topics, deep and changing characters, oneirism, unclear limits between reality and mind. His movie is a skilled masterpiece that really needs to be seen twice since its symbolism and action are extremely interwoven. Personally, I felt somewhat frustrated the first time I saw it. Indeed, I find that Resnais style in this film is too extreme in some ways. He twists action and mixes reality with memories in a way that makes the spectator lose his/her way once and again. On top of that, most usually action is extremely slow -quite the contrary of his colleague Godard- and takes are extremely long. Truffaut did shoot this kind of scenes, but his were also agile, attractive. Resnais is slow, exasperating, boring. We must think however that Hiroshima mon amour is a literary film, a long shot poem. The script is a literary work of art by Marguerite Duras. Indeed, dialogs are like lines in a poem, rhythmically broken, slow, as if they were declaimed instead of simply said. Resnais complements this poetry inserting strongly lyric scenes of the Japanese people and the city of Hiroshima and playing around with meaningful light, as we will see later. In my opinion, the main topic of this film is memories and how a forgotten dark past can shape our present and determine our future. Basically, the film tells the story of a woman who has gone through a painful experience in his youth: she loved a German soldier during the occupation of Nevers, her hometown in France. This caused despise from her family and her community. This is a story that she has not told ever before. But an affair with a Japanese man while she shoots a film in Hiroshima will wake up her memories. The Japanese man recalls her of her first love; let us remember for instance, when she remembers the German man hand when she sees the Japanese's -both of them have a similar hair style and color. At some point in the film, the Japanese will grow more interested in her life in Nevers -he thinks the key to win her love is there- and this will unleash harsh flashbacks in the French woman's memories. She has never told anyone: as she talks out, articulates her memories -while they are at the bar- she will experience very strong feelings. We cannot differentiate what she was feeling at the moment of the story or what she is feeling now, what is a fact and what is a memory. I find very interesting the scene in which they sit together at the bar: at some point she takes the Japanese man for her old love. She begins talking to him as if he was so. Her memories take her over and she talks what she feels, what she remembers. Light effects are magical: she is drowned in brightness while the Japanese man stays in the dark. She talks and talks and Resnais inserts the necessary flashback images. The Japanese at that moment acts as the voice of her own memory: he asks her once and again. Until a point when she suffers so dramatically that the Japanese man, the real one, slaps her in her face to wake her up. Now we find a sharp kind of awakening. While she talked everything was silent. Now, everything sound as what it is: a bar with people chattering and frogs in the dark stream outside. There are four main elements in the film that spin around the life of the French girl, whose name we do not know. Two cities: Nevers and Hiroshima. And two men: the German soldier and the Japanese man. There is a whole system of connections between these four elements in the center of which is her. Resnais uses the powerful image of Hiroshima, the sadness of the place and grief of the people to identify the sadness and grief of the Frecn girl at Nevers. On the other side, the Japanese man reminds her of the German soldier. There is not an exact parallelism between the two cities or the two men, but connections can be made. We must remember the images of the streets in Hiroshima and the images of Nevers -la Place de la République, the churches-, flowing at the same time. The beautiful but empty Loire, the dead fields of Hiroshima. Although we can see some parallelism between the two cities, Resnais ends up the film with a scene in which this relationship seems to be much stronger. 'Toi, ton nom est Hiroshima. - Et toi, ton nom est Nevers, en France'. However, I cannot figure out what is the exact relationship between the two cities: maybe a comparison between grief in the memory and actual grief in the present day. Whatever way it might be, Resnais leaves for us a cryptic, dark ending that we would have to figure out the best we can depending on the elements he has given us in the film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Hiroshima Mon Amour",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3672095257",
        "name": "Hiroshima, Mon Amour",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDYyODhiMTYtMGZjOC00MzA4LTgzZDktOWNjMWM3N2MxZjI2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDYyODhiMTYtMGZjOC00MzA4LTgzZDktOWNjMWM3N2MxZjI2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-12-05T17:15:03.934Z",
        "url": "https://www.imdb.com/video/vi3672095257/"
    },
    "url": "/title/tt0052893/"
}