{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Nicholson",
            "url": "/name/nm0000197/"
        },
        {
            "@type": "Person",
            "name": "Danny DeVito",
            "url": "/name/nm0000362/"
        },
        {
            "@type": "Person",
            "name": "Armand Assante",
            "url": "/name/nm0000800/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23887,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010434/"
        },
        {
            "@type": "Person",
            "name": "David Mamet",
            "url": "/name/nm0000519/"
        }
    ],
    "datePublished": "1992-12-25",
    "description": "The story of the notorious American labor union figure Jimmy Hoffa, who organizes a bitter strike, makes deals with members of the organized crime syndicate and mysteriously disappears in 1975.",
    "director": [
        {
            "@type": "Person",
            "name": "Danny DeVito",
            "url": "/name/nm0000362/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWNlMGRmYmEtZGNiZS00NzdiLTk2ZWUtZjEyY2U3NjM0MGRlXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "mafia,title spoken by character,no opening credits,no title at beginning,watching tv",
    "name": "Hoffa",
    "original_info": {
        "id": "Hoffa_1992",
        "name": "Hoffa",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ElMaruecan82"
        },
        "dateCreated": "2012-12-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104427/"
        },
        "name": "Trucks or Threats? ...",
        "reviewBody": "Life made him famous, but death turned him into a legend. If it weren't for his mysterious disappearance probably due to his connections with the mob, it's doubtful that Jimmy Hoffa, the leader of the most powerful union would have been such a deeply rooted figure in American pop-culture. This posthumous place among the unsolved mysteries of the last century was begging for a movie adaptation, and Danny DeVito's turned into quite an interesting biopic, but strangely enough, it says a lot about the man without saying that much. At the end of the film, I knew some of his achievements, but the motives, the traumas, the obsessions, what makes a character fascinating, were still a mystery. \n\nThis is not to belittle the film's educational value, but I don't think such a complex public figure can be understood if we don't even have some quick glimpses about his past, his background and his family. It's as if Danny DeVito sticked with the public image of Hoffa and didn't give us enough to hook our hearts on outside the Teamster business, which is a pity because Jack Nicholson made the character and gave him such an aura that it genuinely made me curious about the man. Yet, nothing is shared except what he tells his friends, the mob, the journalists, and Bobby Kennedy. I was begging for an intimate moment with his wife, not because \"behind every great men, there's a woman\" but because men do confess to their wives, share with them the off-the-record stuff, but \"Hoffa\" is not in the same caliber than, say, Oliver Stone's \"Nixon\", which is about a no less controversial figure. And I guess I wasn't surprised because I saw the wife in the middle of the film but because she was showed while she was useless plot-wise.\n\nOn the other hand, the film tackles its subject in a very serious and entertaining way that I'm asking myself if DeVito or the screenwriters did have enough material to approach the privacy of Hoffa, maybe they didn't, or maybe they had but they didn't have enough time. The film is more trying to answer to the question of Hoffa's whacking than the typical rise and fall, it's more about the way he became an instrument of the mob with a pragmatic view on the ends- justifies-the mean theory, but we never see how effective they are for the Teamsters. I learned more about the rights and the struggle of truck drivers from the underrated film-noir \"They Drive by Night\" or the thriller \"Wages of Fear\" than \"Hoffa\", which is saying a lot because it had to be about trucks too, Ebert said that DeVito showed a man who was all about trucks, he talked and breathed 'truck', well how about showing these trucks in the first place? The film fails providing insights on the character by focusing too much on the controversy; it doesn't help to get enough perspective. Imagine if \"Nixon\" was only about the Watergate, you wouldn't have known about Nixon AND the Watergate either, DeVito's film lacked focus and scope.\n\nIt's interesting that the film was made in 1992, the same year than another and better biopic, Spike Lee's \"Malcolm X\", the film is three-hour long but takes you from the roots of the leader, when he was a small-time crook to his rise as one charismatic orator. In \"Hoffa\", we never see him driving a truck, nourishing his heart with socialist ideas and revolting against the system. From the beginning, he's like a politician haranguing the comrades. I take it from granted than what he say is true, but it's not about belief, but empathy, the film is not about making Hoffa a good or a bad guy, but letting the viewer figuring out. If he was bad enough (in the \"practical\" meaning) to stick with the gangsters when he became powerful, it would be interesting to see how he started as an idealistic man, and it would make the corruption of his morality more interesting. That's what great biopics are about: evolutions, and never in \"Hoffa\", do we feel that the guy is changing, in bad or good, it doesn't matter, but there's no dynamics whatsoever.\n\nAnd again, it's a pity because the performances are good, I can't believe Nicholson got a Razzie nomination for this, granted it wasn't the best of his career, but he did bring some energy and passion in the character. But what lacked was a structure, a right choice of episodes that would tell us something about a controversial figure. The film is two-hour and fifteen minutes long, I wouldn't have minded it being much longer if it could enlighten me on the private face of Jimmy Hoffa, we're talking about a character played by Nicholson, who's got a great chemistry with his real-life friend Danny DeVito, the film had the potential, the ambition, probably the budget, the writing was good, but the storytelling not so.\n\nStill, for what it is, it's not wasted time, and the film has a solid consistency in it, and at least, it does something that almost redeems the flaws I mentioned: it ends with the best scene, the most memorable one. In terms of shock and emotion, even though we know the story of Jimmy Hoffa, we don't see the ending coming, and it did left me puzzled and shocked when I saw it for the first time. The film needed more moments like this, but all in all, it's a solid drama.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1470955801",
        "name": "Hoffa",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDNkM2Q2NGQtZWU0NS00YWQ4LTg2NmItMTQ4YzM0MTJlY2ZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDNkM2Q2NGQtZWU0NS00YWQ4LTg2NmItMTQ4YzM0MTJlY2ZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:26:22Z",
        "url": "https://www.imdb.com/video/vi1470955801/"
    },
    "url": "/title/tt0104427/"
}