{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Thora Birch",
            "url": "/name/nm0000301/"
        },
        {
            "@type": "Person",
            "name": "Michael Riley",
            "url": "/name/nm0727120/"
        },
        {
            "@type": "Person",
            "name": "Robert Bockstael",
            "url": "/name/nm0090720/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4128,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0123754/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0255518/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052106/"
        },
        {
            "@type": "Person",
            "name": "Ronni Kern",
            "url": "/name/nm0449499/"
        }
    ],
    "datePublished": "2003-04-07",
    "description": "Based on a true story. Liz Murray is a young girl who is taken care of by her loving, but drug-addicted parents. Liz becomes homeless at 15 and after a tragedy comes upon her, she begins her work to finish high school.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Levin",
            "url": "/name/nm0505697/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGMxZTk1NDctY2UwNy00ZDQ0LTg5OGQtNGY1MjU3OTY4MGE3XkEyXkFqcGdeQXVyNTYyNDI4MzY@._V1_.jpg",
    "keywords": "family relationships,homeless teenager,executive produced by subject,school,strong female lead",
    "name": "Homeless to Harvard: The Liz Murray Story",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Xarabe"
        },
        "dateCreated": "2010-01-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338109/"
        },
        "name": "Phenomenal",
        "reviewBody": "I remember hearing about Liz Murray on Oprah back in 2004. I also remember she was the first recipient of Oprah's Chutzpah award and was inspired by her story. Naturally, it was only right of me to be curious about the film made about her life, and since I was not able to see it back then, I decided to fork out the money to buy the actual movie online last year. I'm so glad I did because it truly is one of the most inspirational films I've seen. The film has no pretense about it, it doesn't paint Liz Murray as this big heroine or self-pitying sermonizer, her story just was what it was - she realized her situation and took steps to eventuate to success out of grand resilience. She overcame a great deal of hardship to make it out telling her story to the world. Anecdotes that really convey her situation; about doing her homework on the subway train, juggling twice the amount of course work, trying to deal with her family situation of drug-addicted parents, shoplifting self help books and of course it goes without saying - being homeless.\n\nThe performances are terrific, especially Thora Birch - off the back of her comedic role in Ghostworld - really shows her range here and her portrayal is determinedly solemn. Also, an honorable mention to the girl who plays young Liz.\n\nI'm also glad this story wasn't made into some big Hollywood production - it would have come across too schmaltzy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0338109/"
}