{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ed Peden",
            "url": "/name/nm1160018/"
        },
        {
            "@type": "Person",
            "name": "Ben Skora",
            "url": "/name/nm1160362/"
        },
        {
            "@type": "Person",
            "name": "Diana Peden",
            "url": "/name/nm1161337/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 760,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073211/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0140196/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070646/"
        }
    ],
    "datePublished": "2001-01-25",
    "description": "Documentary look at five unusual homes and the people who built (or adapted) them.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Smith",
            "url": "/name/nm0807687/"
        }
    ],
    "duration": "PT1H6M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgwMzQ0MTcwN15BMl5BanBnXkFtZTcwNjI4MjAwMQ@@._V1_.jpg",
    "keywords": "alligator,bayou,missile silo,treehouse,cat lover",
    "name": "Home Movie",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2008-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0275408/"
        },
        "name": "Sure, this isn't everybody's cup of tea, but I really liked it!",
        "reviewBody": "This is a very simple documentary. There is no narration, so it's up to the homeowners of five very strange houses to show you around their homes. While this no doubt would bore the pants off some people, I found it fascinating for many reasons. First, it was great to see people who had so much passion for life and for their homes--as well as deep senses of contentment about their lives. Second, each of these people was actually pretty fascinating--perhaps not \"normal\", but very fascinating. Being welcomed into their worlds was a nice privilege.\n\nThe five houses consist of a guy who lives in a houseboat and hangs out with gators, an electronic house with tons of push-button gadgets, a family living in an ex-Atlas missile silo, a home completely designed around the many cats of the family and a lady who lives in a tree house in the middle of nowhere in Hawaii. Really interesting people and I would love to see a follow up film showing where they all are now or perhaps highlighting other strange homes.\n\nWell done and a great look at some very passionate and weird folks--and I do mean weird in a generally good way! A great little slice of Americana and an important but seldom talked about part of our history and culture.\n\nBy the way, although his home was the most \"normal\", I think I would have liked to have visited with the houseboat guy the most. What a cool life. The lady in the Hawaiian wilderness was also amazing and I loved how she holds onto life.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0275408/"
}