{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alex D. Linz",
            "url": "/name/nm0513281/"
        },
        {
            "@type": "Person",
            "name": "Olek Krupa",
            "url": "/name/nm0472762/"
        },
        {
            "@type": "Person",
            "name": "Rya Kihlstedt",
            "url": "/name/nm0452748/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 120690,
        "ratingValue": 4.5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073707/"
        },
        {
            "@type": "Person",
            "name": "John Hughes",
            "url": "/name/nm0000455/"
        }
    ],
    "datePublished": "1997-12-12",
    "description": "Alex Pruitt, an 8-year-old boy living in Chicago, must fend off international spies who seek a top-secret computer chip in his toy car.",
    "director": [
        {
            "@type": "Person",
            "name": "Raja Gosnell",
            "url": "/name/nm0331532/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTJhYjVhOWMtYTUyOS00NWM0LThjNzYtZWYxOTkwN2FhODg2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "chicken pox,home invasion,tape over mouth,silicon valley california,silicon valley",
    "name": "Home Alone 3",
    "original_info": {
        "id": "Home Alone 3_1997",
        "name": "Home Alone 3",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Toronto85"
        },
        "dateCreated": "2012-12-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119303/"
        },
        "name": "Home Alone 3",
        "reviewBody": "Home Alone 3 tells a whole different story then the original two. Instead of the McCallisters, we meet the Pruitt family and in particular the main character Alex. A computer chip worth ten million dollars is placed into a toy car by our four villains in an attempt to get through airport security. There is a mix up at the airport, and the toy car ends up in the possession of an older woman who gives it to little Alex as a gift. The four bad guys track the car to a neighbourhood in Chicago and break into a series of houses looking for the chip. Alex (who is HOME ALONE with chicken pox) see's the crooks breaking into the houses an calls the cops, only to look like a prank caller each time. The villains looking for the chip eventually realize that little Alex has it and that's when the fun begins - Home Alone style.\n\nI actually enjoyed Home Alone 3 as a kid and as an adult now. No, it isn't as good as the original films and no Alex Linz is not Macaulay Culkin. But this movie gets points for breaking off from the McCallister storyline. I mean how many times can that family forget the same kid? Young actor Alex Linz who plays Alex in Home Alone 3 does a great job taking on this big role, he manages to not put in an annoying performance like so many child actors can be do these kind of movies. The crooks include three men and one female, and I like that they added a woman into that villain role. They all are good actors and add plenty to this movie.\n\nThe best comedic moments come from the crooks, especially David Thornton as 'Unger'. There are some ho-hum funny moments which fall flat such as the talking parrot and a few scenes with Alex's older brother and sister who \"torment\" him. Another flaw was the actual \"home alone\" bit, and the fact that Alex isn't really home alone as we've seen in the first two films. His mother leaves him for a couple of hours as he recuperates from Chicken Pox, hardly the same as Kevin McCallister went through. And I don't like that it doesn't take place ON Christmas. But those drawbacks don't take away from the whole movie at all. \n\nHome Alone 3 isn't great, but it takes some risks by moving from the original plot and adds some smarts it with the computer chip story. These aren't your simple criminals like the wet bandits were, they are after far more than some jewellery and expensive silverware. I recommend Home Alone 3 for sure!\n\n6/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2796355865",
        "name": "Home Alone 3",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2U4Y2Q2ZjQtYWMzNi00NDQzLWJkNDktYWYyYmM1ZDViYTkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2U4Y2Q2ZjQtYWMzNi00NDQzLWJkNDktYWYyYmM1ZDViYTkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:27:45Z",
        "url": "https://www.imdb.com/video/vi2796355865/"
    },
    "url": "/title/tt0119303/"
}