{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Macaulay Culkin",
            "url": "/name/nm0000346/"
        },
        {
            "@type": "Person",
            "name": "Joe Pesci",
            "url": "/name/nm0000582/"
        },
        {
            "@type": "Person",
            "name": "Daniel Stern",
            "url": "/name/nm0827663/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 372453,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073707/"
        },
        {
            "@type": "Person",
            "name": "John Hughes",
            "url": "/name/nm0000455/"
        }
    ],
    "datePublished": "1992-11-20",
    "description": "One year after Kevin McCallister was left home alone and had to defeat a pair of bumbling burglars, he accidentally finds himself stranded in New York City - and the same criminals are not far behind.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Columbus",
            "url": "/name/nm0001060/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Adventure",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDI1MzM0Y2YtYmIyMS00ODE3LTlhZjEtZTUyNmEzMTNhZWU5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "new york city,home alone,christmas,christmas movie,wish fulfillment",
    "name": "Home Alone 2: Lost in New York",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "learningthelingo"
        },
        "dateCreated": "2010-01-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104431/"
        },
        "name": "Christmas Classic in New York",
        "reviewBody": "Macaulay Culkin – one of the most famous child stars since Shirley Temple – returns as Kevin McAllister in the 1992 nostalgic and sentimental slapstick Christmas classic that has not dated since its original release.\n\nAs the sequel of the highest grossing comedy of all time, Home Alone 2 is one of the biggest Christmas films of the 90s. Along with its predecessor, the story is all about Christmas. While the familiar Christmas vacation is shown as chaotic and stressful, it is the essential family element that brings us back to the films main themes of togetherness and (paradoxically) independence.\n\nBecoming separated from his family once again when leaving for a Christmas holiday, Kevin is left alone to his own devices, this time in New York City and causes chaos and mayhem when he bumps into the freshly escaped \"Wet Bandits\", who are once again, out to get him.\n\nThe original cast return with Culkin in the lead, Joe Pesci and Daniel Stern as the hilariously dumb, yet slightly endearing criminals with a heart of coal and the fantastic Catherine O'Hara as the mum every child wants, played with just the right amount of fear, guilt, determination and love that is needed. Another noteworthy return is the sequel of gangster spoof Angels with Filthy Souls, Angels with Even Filthier Souls (a reminiscent construction of Angels with Dirty Faces with James Cagney.) New characters are brought to life by Tim Curry, Brenda Fricker, Eddie Bracken, Dana Ivey and a young Rob Schneider.\n\nFilm critics such as Roger Ebert gave the film negative reviews and saw it as portraying violence as too cartoonish. Despite this fact, the mainstream popularity of the film saw it as a success and to most children of the 90s, the second instalment in the Home Alone series is often seen as equal in quality if not better than the first.\n\nThis film has been monumental in my life. I cannot remember how I first saw it, but I know that thanks to VHS I watched it a million times. It formed my quintessential idea of New York by using Central Park, Carnegie Hall and the Plaza Hotel as central plot settings. It is as much a Christmas film as it is a New York City film and this familiar touristy promotion shows New York as being a unique \"White Christmas\" town.\n\nSo in the cheery Christmas words of Johnny the Crook from Angels: Merry Christmas you filthy animaland a Happy New Year.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1197259545",
        "name": "Sing Along Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmQ5NGM1NmItNzQ0Zi00NDRkLWJlMDAtNDBiMDIyZjQ0YzRjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmQ5NGM1NmItNzQ0Zi00NDRkLWJlMDAtNDBiMDIyZjQ0YzRjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-09-14T20:56:26.386Z",
        "url": "https://www.imdb.com/video/vi1197259545/"
    },
    "url": "/title/tt0104431/"
}