{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 212,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0268014/"
        }
    ],
    "description": "In this documentary, director and producer Brent Owens takes us to the streets of Hunts Point in South Bronx, for a candid documentary about the local sex workers. We learn about the past, present, and future of the people of the ...",
    "director": [
        {
            "@type": "Person",
            "name": "Brent Owens",
            "url": "/name/nm0654321/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmU2MWJhNWQtYjEzMi00ODUzLThjMjAtZjQzODMxNTYyMjcyXkEyXkFqcGdeQXVyMjI3MDczMjI@._V1_.jpg",
    "keywords": "street prostitution,prostitution",
    "name": "Hookers at the Point",
    "original_info": {
        "id": "Hookers at the Point_2002",
        "name": "Hookers at the Point",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "a_baron"
        },
        "dateCreated": "2015-09-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1407060/"
        },
        "name": "Hookers At The Point",
        "reviewBody": "This is a documentary about street prostitution in one New York neighbourhood, a worm's eye view of selling sex at the bottom end of the market, not that there is a top end. The team talk to a number of prostitutes and others including a man who married one and acts as her pimp. \n\nAs might be expected, this is all very sordid, but the film-makers are non-judgmental. The same cannot be said for the women, who are revisited. One was hoping to retire soon, but the best laid plans of the worst laid...\n\nIf the men behind the camera are non-judgmental, the women are not, including about their own lives. As might be expected, most have their hard luck stories, which tend to be drugs, but there is none of the rubbish that often accompanies these sorts of exposés about being forced into the oldest profession by traffickers or progressing from child abuse. \n\nThis documentary may leave a bad taste in your mouth, but you can take comfort from the fact that the women facing the camera have tasted far worse.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt1407060/"
}