{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Gates",
            "url": "/name/nm0309637/"
        },
        {
            "@type": "Person",
            "name": "Arthur Agee",
            "url": "/name/nm0012932/"
        },
        {
            "@type": "Person",
            "name": "Emma Gates",
            "url": "/name/nm0309558/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 27002,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106797/"
        },
        {
            "@type": "Person",
            "name": "Steve James",
            "url": "/name/nm0416945/"
        },
        {
            "@type": "Person",
            "name": "Frederick Marx",
            "url": "/name/nm0555610/"
        }
    ],
    "datePublished": "1994-10-14",
    "description": "A film following the lives of two inner-city Chicago boys who struggle to become college basketball players on the road to going professional.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve James",
            "url": "/name/nm0416945/"
        }
    ],
    "duration": "PT2H50M",
    "genre": [
        "Documentary",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmNjMTU2MzQtMzNkNy00YjQ1LTg0M2ItMzM2MDYwYmUyMjMyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "basketball,athlete,national film registry,cabrini green homes chicago illinois,basketball movie",
    "name": "Hoop Dreams",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dee.reid"
        },
        "dateCreated": "2005-05-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110057/"
        },
        "name": "A real, human drama",
        "reviewBody": "\"Hoop Dreams\" is a film about real life, because that is what it's exactly about, real life. I feel that I must put a stronger emphasis on the word \"real\" to get my point across. This isn't some hokey, Hollywood drama about living out a dream, but is about two aspiring young athletes rising out of the dredges of the Chicago ghetto life and into the flash and glitter of the NBA.\n\nThough I'm not a hardcore sports fan, nor am I really into movies about sports, but I really admire basketball, as I feel it has a kind of grace and natural balance that's lacking in most other sports this vigorous. That is why I like some of the film's exhilarating on-court action that is interspersed evenly with the human drama.\n\nDirected by Steve James and produced by Frederick Marx and Peter Gilbert, \"Hoop Dreams\" originally began as a 30-minute documentary about rising ballplayers, but the filmmakers quickly saw that 30 minutes was just too narrow a scope for their story. This realization came when they witnessed two teens, William Gates and Arthur Agee, as they both try to join the NBA, much like their idol Isiah Thomas.\n\nIn total, 250+ hours of footage was gathered over the course of a five-year period and then edited into an engaging 171-minute documentary, following the two teens (from ages 14-18), as they attend expensive Catholic schools, go through the rigorous on-court training, meet the demands of their coaches, and live out their dreams. (Director Spike Lee also appears at a training camp and gives some of the aspiring players some less-than-inspiring advice about what their skills mean to the people at the top of the ladder.)\n\nWe watch as their poignant, real-life struggles unfold on the screen, and watch as time after time they get stonewalled by the system of bureaucracy and racism that's meant to be especially hard on two young black boys from the ghetto. They have difficulty with making decent grades, financial issues, preparing for the ACT, sports-related injuries, and must contend with problems at home as well, including trouble with family matters (Arthur's relationship with his father is especially touching and sad; William welcomes a new addition to his family while still in high school).\n\nFor years, success stories, such as \"Hoop Dreams,\" have dominated Hollywood cinema and have won over legions of audiences, but we've never seen anything like this. Gates and Agee are both bright-eyed and ambitious that they're embarking on something that's historically significant to their lives and community.\n\nThis is the best movie about basketball and reality I've seen yet because of the simple fact that it's real; no scripts, no phony Hollywood theatrics, just \"real\" action, drama, and emotions.\n\n10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Cinema",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4121887001",
        "name": "Hoop Dreams",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTlmM2FlZTItOGJjMi00MzRmLTk5NWUtNjlmM2RiNzkyNjEzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTlmM2FlZTItOGJjMi00MzRmLTk5NWUtNjlmM2RiNzkyNjEzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:39:06Z",
        "url": "https://www.imdb.com/video/vi4121887001/"
    },
    "url": "/title/tt0110057/"
}