{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Gough",
            "url": "/name/nm0001284/"
        },
        {
            "@type": "Person",
            "name": "Robin Askwith",
            "url": "/name/nm0039498/"
        },
        {
            "@type": "Person",
            "name": "Vanessa Shaw",
            "url": "/name/nm0790018/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1688,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040551/"
        },
        {
            "@type": "Person",
            "name": "Antony Balch",
            "url": "/name/nm0049577/"
        },
        {
            "@type": "Person",
            "name": "Alan Watson",
            "url": "/name/nm0914489/"
        }
    ],
    "description": "Two British companions who met on a train heading to the rural countryside stay with a bizarre host of characters in a secluded, curious mansion. Unknown to them, there is a sinister secret behind closed doors.",
    "director": [
        {
            "@type": "Person",
            "name": "Antony Balch",
            "url": "/name/nm0049577/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzNmM2FlYTctNmYzMy00YWIwLWIyNjMtNWZkNmVhNjdlYmFjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "male frontal nudity,mad doctor,captive,surgery,mad scientist",
    "name": "Horror Hospital",
    "original_info": {
        "id": "Horror Hospital_1973",
        "name": "Horror Hospital",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BaronBl00d"
        },
        "dateCreated": "2001-05-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070190/"
        },
        "name": "Heads Will Roll",
        "reviewBody": "Not only was Michael Gough in Sleepy Hollow, a film that boasted the tagline \"Heads Will Roll,\" but Gough also stars in this early 70's horror film where decapitation is integral to the plot. So much for two heads are better than one. This film tells the story of some demented doctor that labotimizes young people so as to make them into his puppets. He is in a wheelchair, has a dwarf-servant, a car that has a blade pop out to slice heads off of people, a seemingly neverending supply of killers clad in biker outfits, and a penchant for cracking his metallic-sounding knuckles. Gough uses no restraint at all in his performance as the crazed physician. His rich aristocratic voice adds all the more to his crazed lack of restraint. Gough's performance is larger than life, not necessarily better. The rest of the cast is adequate. Dennis Price, not long before his death, gives a cameo as an effeminate travel agent. The setting in the film is truly nice, and the film has a good flow of action. Some lacking points are the huge holes in the script, the general editing done in the film, and some lacklustre performances in supporting roles. The film is bad, yet one of those bad ones that can be so enjoyable. Should be seen for Gough's over-the-top performance at the very least."
    },
    "url": "/title/tt0070190/"
}