{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlie Sheen",
            "url": "/name/nm0000221/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Bridges",
            "url": "/name/nm0000978/"
        },
        {
            "@type": "Person",
            "name": "Valeria Golino",
            "url": "/name/nm0000420/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 93354,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Jim Abrahams",
            "url": "/name/nm0000720/"
        },
        {
            "@type": "Person",
            "name": "Pat Proft",
            "url": "/name/nm0698493/"
        }
    ],
    "datePublished": "1993-05-21",
    "description": "\"Rambo\" parody in which Topper Harley leads a rescue team into Iraq to save Iraqi war prisoners and all of their previous rescue teams.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Abrahams",
            "url": "/name/nm0000720/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjU2ODlmZWMtODEwZS00NTQ0LTk1ZDYtYzk0ZjE3ZGZhMGM0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "parody,limousine driver,rambo,absurd comedy,hand on someone's leg",
    "name": "Hot Shots! Part Deux",
    "original_info": {
        "id": "Hot Shots! Part Deux_1993",
        "name": "Hot Shots! Part Deux",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheUnknown837-1"
        },
        "dateCreated": "2009-11-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107144/"
        },
        "name": "precisely the sort of comedy that a movie-lover like myself enjoys",
        "reviewBody": "I don't know if I've ever seen a comedy as zany or as randomly silly as \"Hot Shots! Part Deux.\" Then again, I'm not all that familiar with the comedy genre, but I can say that between this movie and its predecessor, every pratfall, every parody, every little joke has been done. Part Deux is even crazier and more random than its nonsensically silly prequel and it's even less intelligent, but strangely enough, it's a lot more enjoyable. I thought the first \"Hot Shots!\" was a promising hit-and-miss satire; Part Deux succeeds.\n\nLike its predecessor, Part Deux sets its plot as a parody of one specific film, but makes satirical parodies of dozens throughout its running time. The first movie was a parody of \"Top Gun\" but made references to dozens of other movies from \"Dances With Wolves\" to \"Gone with the Wind.\" Likewise, the sequel is a parody of \"Rambo III\", but that's just the setup for all of the jokes that follow. Like Rambo, Topper Harley (Charlie Sheen) is retired to the Far East when his former commander (Richard Crenna) comes in and asks him to join a rescue mission to save hostages from Iraqi captors. Sheen at first refuses but when Crenna is captured as he was in \"Rambo III\", Sheen heads in after him along with a misfit group of soldiers. And meanwhile, Admiral Benson (Lloyd Bridges) from the first movie has been promoted to president of the United States and continues his idiotic and incompetent running of the country.\n\nNow this is precisely the sort of comedy that a movie-lover like myself enjoys. Why? Well, not only because it is so zany and buffoonish that one can't help but laugh at it, but because it's like a big mincemeat of movie references. The setup is a parody of \"Rambo III\", but I spotted parodies of \"Casablanca\", \"Platoon\" (which also starred Charlie Sheen), \"Lady and the Tramp\", \"The Wizard of Oz\", \"Terminator 2\" and so on. And just when I thought they were going to between two movies forget to parody \"Star Wars\", sure enough I got my fix for that. And that's not even the limit of it. The movie also makes jokes and points fingers at some of your favorite actors. A brief example is an enemy patrol boat that comes into the shot. The boat's name is \"The Behn Gazaarah\" as a tribute to actor Ben Gazzara. If you've seen lots of movies and you love the movies, this is the comedy for you because you can sit back, relax, have the time of your life laughing, and point your finger at the screen whenever a parody comes up and say \"Yeah, that was from (insert movie title)!\" \"Hot Shots! Part Deux\" opens up with a joke and closes with a joke and at least ninety percent of these are gut-busting in their effect. There are some jokes throughout the film, such as a few of the Saddam Hussein jokes toward the beginning, that were not all that funny, but around and after that were some of the zaniest, silliest, most random pratfalls I've ever seen. But it's also funny because it doesn't just make a simple parody and joke, but keeps pushing it one step ahead. Instead of just simply parodying the spaghetti-kiss scene from \"Lady and the Tramp\", it carries it to the next step with Charlie Sheen pushing a meatball across the plate with his nose and then the scene morphs in a parody of \"Casablanca.\" It's also not just enough for the movie to create a character like Richard Crenna's character in the Rambo series to be Sheen's former commanding officer. But to have Richard Crenna himself play the character and wear the same outfit and the same makeup and speak in the same rhythm and manner.\n\nAnd if there is one other element in this movie that I loved, it was the Lloyd Bridges character. Like the admiral he played in the first \"Hot Shots!\" Bridges plays the president of the United States, Thomas \"Tug\" Benson as simply a complete idiot, somebody so stupid that they could never, in real life, get a job running a grocery store let alone a country. And Bridges looks like he's having a good time playing the character, which in turn makes it very funny for the audience.\n\nIn closing, \"Hot Shots! Part Deux\" is a tremendously enjoyable satirical comedy and precisely the sort of parody that I find entertaining. The key to its success is that it's so unbelievably random and silly and nonsensical. Whereas so many comedies I know try to do the same thing but just fail, it passes with flying colors. This is one funny movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Hot Shots! Part Deux",
        "duration": "PT59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3197736985",
        "name": "Hot Shots! Part Deux",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWFmMWM4ZmMtYzU5MC00NGIwLWIwZTQtMTkwNTUxN2VhOGZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWFmMWM4ZmMtYzU5MC00NGIwLWIwZTQtMTkwNTUxN2VhOGZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-12-12T06:15:16Z",
        "url": "https://www.imdb.com/video/vi3197736985/"
    },
    "url": "/title/tt0107144/"
}