{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Cusse Mankuma",
            "url": "/name/nm0542559/"
        },
        {
            "@type": "Person",
            "name": "Michael Benyaer",
            "url": "/name/nm0073088/"
        },
        {
            "@type": "Person",
            "name": "Adrian Holmes",
            "url": "/name/nm0391738/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 519,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "TV-Y7-FV",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080248/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0237286/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035460/"
        }
    ],
    "datePublished": "2003-07-01",
    "description": "A young teen driver joins an other-dimensional car racing which the mystic Wheel of Power is the prize.",
    "genre": [
        "Animation",
        "Action",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NTExNzI4M15BMl5BanBnXkFtZTcwMDAwMzQyMQ@@._V1_.jpg",
    "keywords": "motorsports sport,cg animation,racing,car,car racing",
    "name": "Hot Wheels Highway 35 World Race",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "donnieskibiski"
        },
        "dateCreated": "2022-11-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0377191/"
        },
        "name": "One of the most interesting movies I have ever watched",
        "reviewBody": "This movie is somehow a chaotic mess and a masterpiece all at the same time. It really brought me back to my childhood with its early 2000s look and feel (mainly due to the fact that was when it was from) however this also made it incredibly difficult to watch for the TWO HOUR RUN TIME. That is one of the most shocking parts of the movie. This movie feels like it could honestly be over in maybe 30 minutes if the pacing was appropriate but it is not in the slightest. The story jumps around continuously and this movie has more abrupt transitions and cuts than Jeffrey Bezos has dollars in his bank account. Every time I begin getting into a plot point a flaming tire flys across my screen and we're on to the next one. Building upon this the movie never really goes anywhere, with a lot of details added in that don't actually have anything to do with the story. The movie also has a very poorly implemented diversity aspect. Unlike some of todays movies that include poorly implemented diversity this one just has a very strange and somewhat unsettling feeling. For example, characters such as the drivers from Puerto Rico and, what I'm assuming is one of the African nations, feel overdone and a little awkward. Although honestly, this could really be said for every character which feels like a in one way or another an over the top stereotype of what they are supposed to represent. For example, the main character Vert feels like an overly done stereotype of the typical Californian surfer and the only woman driver seems to exist just as a companion to some of the other male drivers rather than a true standout character. Looking at this from a motorsports and Hot Wheel lover perspective is also incredibly difficult since, even though it is very obvious this isn't real racing, they stop on track every five seconds making the whole competition aspect of the story not fit at all. With all of the negatives out of the way though, I did actually enjoy parts of this movie. Even though I began playing a game where I refused to look at the remaining runtime of the movie about thirty minutes in, since I was tempted to stop watching every time I realized I was less than halfway through the movie, I had a good time and got invested in the plot every now and then. Honestly for little kids I'm sure this movie would be an amazing watch and actually for the older crowd out there I would still recommend a watch. However if you are part of that older crowd I would highly encourage you to play a drinking game or some other equivalent for every time you see a flaming tire used as a transition or a car be saved by a parachute when it flies off the track. Trust me the movie will become infinitely more better after applying that technique.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi747634969",
        "name": "Hot wheels world race",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzljOTdkZmEtYmIxYS00NjVhLTlkZDctY2IwY2E4MGU3YjRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzljOTdkZmEtYmIxYS00NjVhLTlkZDctY2IwY2E4MGU3YjRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:39:55Z",
        "url": "https://www.imdb.com/video/vi747634969/"
    },
    "url": "/title/tt0377191/"
}