{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lindsay Crouse",
            "url": "/name/nm0001080/"
        },
        {
            "@type": "Person",
            "name": "Joe Mantegna",
            "url": "/name/nm0001505/"
        },
        {
            "@type": "Person",
            "name": "Mike Nussbaum",
            "url": "/name/nm0638276/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23093,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0111219/"
        },
        {
            "@type": "Person",
            "name": "David Mamet",
            "url": "/name/nm0000519/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Katz",
            "url": "/name/nm0441747/"
        }
    ],
    "datePublished": "1987-10-14",
    "description": "A psychiatrist comes to the aid of a compulsive gambler and is led by a smooth-talking grifter into the shadowy but compelling world of stings, scams, and con men.",
    "director": [
        {
            "@type": "Person",
            "name": "David Mamet",
            "url": "/name/nm0000519/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmZiYjEzNWQtZTg1Yi00NWYyLTk5YTMtZmYxNDFhMTFlMjdjXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "surprise ending,autograph,dream,woman smoker,dunhill gold cigarette lighter",
    "name": "House of Games",
    "original_info": {
        "id": "House of Games_1987",
        "name": "House of Games",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ImpQueen"
        },
        "dateCreated": "2004-05-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0093223/"
        },
        "name": "United States of Kiss My Ass",
        "reviewBody": "`The United States of Kiss My Ass'\n\n House of Games is the directional debut from playwright David Mamet and it is an effective and at times surprising psychological thriller. It stars Lindsay Crouse as best-selling psychiatrist, Margaret Ford, who decides to confront the gambler who has driven one of her patients to contemplate suicide. In doing so she leaves the safety and comfort of her somewhat ordinary life behind and travels `downtown' to visit the lowlife place, House of Games.\n\nThe gambler Mike (played excellently by Joe Mantegna) turns out to be somewhat sharp and shifty. He offers Crouse's character a deal, if she is willing to sit with him at a game, a big money game in the backroom, he'll cancel the patients debts. The card game ensues and soon the psychiatrist and the gambler are seen to be in a familiar line of work (gaining the trust of others) and a fascinating relationship begins. What makes House of Games interesting and an essential view for any film fan is the constant guessing of who is in control, is it the psychiatrist or the con-man or is it the well-known man of great bluffs David Mamet.\n\n In House of Games the direction is dull and most of the times flat and uninspiring, however in every David Mamet film it is the story which is central to the whole proceedings, not the direction. In House of Games this shines through in part thanks to the superb performances from the two leads (showy and distracting) but mainly as is the case with much of Mamet's work, it is the dialogue, which grips you and slowly draws you into the film. No one in the House of Games says what they mean and conversations become battlegrounds and war of words. Everyone bluffs and double bluffs, which is reminiscent of a poker games natural order. This is a running theme throughout the film and is used to great effect at the right moments to create vast amounts of tension. House of Games can also be viewed as a `class-war' division movie. With Lindsay Crouse we have the middle-class, well-to-do educated psychiatrist and Joe Mantegna is the complete opposite, the working class of America earning a living by `honest' crime.\n\n The film seduces the viewer much like Crouse is seduced by Mantegna and the end result is ultimately a very satisfying piece of American cinema. And the final of the film is definitely something for all to see and watch out for, it's stunning.\n\nAn extremely enjoyable film experience that is worth repeated viewings. 9/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this suspense thriller",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1275987737",
        "name": "House of Games",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWZmZDJmOTAtOTQ0Zi00M2UxLWJhMDgtM2IyODE2ZTE3MmM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWZmZDJmOTAtOTQ0Zi00M2UxLWJhMDgtM2IyODE2ZTE3MmM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:23:47Z",
        "url": "https://www.imdb.com/video/vi1275987737/"
    },
    "url": "/title/tt0093223/"
}