{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Ryan",
            "url": "/name/nm0752813/"
        },
        {
            "@type": "Person",
            "name": "Robert Stack",
            "url": "/name/nm0821041/"
        },
        {
            "@type": "Person",
            "name": "Shirley Yamaguchi",
            "url": "/name/nm0945354/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3868,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Harry Kleiner",
            "url": "/name/nm0459067/"
        },
        {
            "@type": "Person",
            "name": "Samuel Fuller",
            "url": "/name/nm0002087/"
        }
    ],
    "datePublished": "1955-08-28",
    "description": "Planted in a Tokyo crime syndicate, a U.S. Army Investigator attempts to probe the coinciding death of a fellow Army official.",
    "director": [
        {
            "@type": "Person",
            "name": "Samuel Fuller",
            "url": "/name/nm0002087/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDY4NjgzZmYtMDYyOC00ZWY4LTgzYjktNGUyNDM0NzE5NGRkXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg",
    "keywords": "gangster,tokyo japan,remake,big wheel,pearl dealer",
    "name": "House of Bamboo",
    "original_info": {
        "id": "House of Bamboo_1955",
        "name": "House of Bamboo",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gravity3"
        },
        "dateCreated": "2006-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048182/"
        },
        "name": "A Widescreen Color Noir?",
        "reviewBody": "I vacillate on whether the 20th Century Fox studio claim that HOUSE OF BAMBOO is film noir is really accurate or not. For one thing, it's in color. For another, it's shot in Cinemascope. Also given it's made in 1955, I have to think of it more like a new gas/electric car: it's a hybrid. But unlike most compact hybrids out these days, this one's a full-size truck.\n\nThere are action sequences that feel more like they belong in Frankenheimer's THE TRAIN or Sturges' THE GREAT ESCAPE than in a so called noir picture, but I'm not knocking them. They're well staged, and like the entire film, terrifically photographed. But then there is the use of silhouette and high contrast more akin to noir, and the story too feels more in that vein, although more on the sparse side; certainly not a Raymond Chandler THE BIG SLEEP kind of story! Honestly, I found it no less thin a story than Fritz Lang's THE BIG HEAT. As critical as the story is, if films were only that, I'd just be reading books. What's done visually plays a pretty big part in this format.\n\nSpeaking of the cinematography, some critics have stated the widescreen use is overkill here, but I must beg to differ. With so many modern films shot more and more like television, with only close-ups and two-shots, and barely a moment of establishing frame to see where everything is happening - and with action sequences and dance numbers shooting this way now - it was refreshing for me to see the entire frame used, with characters often at either end, and action allowed to play out wide, without fast moving camera-work to pump it up. Of course the problem is that many will view a DVD of the film now, where wide shots just look far away (unless you've got a large home theater screen). But that's not the fault of the filmmakers - Cinemascope was meant for the big screen.\n\nWhen the camera does move, it's clever work. The blocking is also terrific and surprisingly fresh (or again perhaps just not used anymore and so fresh all over again to my eyes). Some say it's all too tricky, but it's far less tricky than all of the motion-control work we're used to seeing now, and often (in this film at least) more involving. Director Samuel Fuller is doing the right shots at the right time here, and that takes everything on screen up a notch.\n\nI'm not sure why there's criticism over the location, but I found the setting in post-war Japan to be as crucial to HOUSE OF BAMBOO as post-war Vienna was to THE THIRD MAN, or for that matter Monument Valley to a John Ford western. Sometimes the setting becomes one of the characters, which when done right as it is here, can only be a plus for the picture. Fuller puts it all to good use. Perhaps it's the Hollywood techniques brought into play, but I can't think of another picture, including all of Kurosawa's work, that looks exactly like this. I'm not saying it's better, just a different take on the locations, and so enjoyable as such.\n\nI'll make the argument that Kurosawa, for example, would film a Japan he knew, but overlooked images because he was used to them, just like I wouldn't take a picture of the Golden Gate bridge because I live 45 minutes away from it. But Fuller looks at it more like a tourist if you will, and so commits to film here things that are unique or uniquely shot. You have enough of these memorable images and you start to have a memorable film. If this were another kind of film, I might not think all those fascinating shots were of such importance. But if this is trying to be noir, then it's all about the atmosphere that the landscape and settings convey. Noir or not, it truly got me caught up in the story.\n\nI have to admit being swayed by a great score from Leigh Harline (as conducted by none other than Lionel Newman), but that's what a good score should help to do: make a decent film good and a good film great. But I also must admit that if I just look at the pieces of this film, I would never rate it so highly. It's a case, for me at least, of the whole being greater than the sum of its parts, of everything working together just right to make a solid piece of entertainment, noir or otherwise.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this epic drama filmed in Japan",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4008182809",
        "name": "House of Bamboo",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjkwNmIxOGYtMTY5Yy00YTBiLThkYjctZjA2NzgwZTdjZTZmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjkwNmIxOGYtMTY5Yy00YTBiLThkYjctZjA2NzgwZTdjZTZmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T15:24:13Z",
        "url": "https://www.imdb.com/video/vi4008182809/"
    },
    "url": "/title/tt0048182/"
}