{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Stewart",
            "url": "/name/nm0000071/"
        },
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Gregory Peck",
            "url": "/name/nm0000060/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21877,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0110887/"
        },
        {
            "@type": "Person",
            "name": "James R. Webb",
            "url": "/name/nm0916139/"
        },
        {
            "@type": "Person",
            "name": "John Gay",
            "url": "/name/nm0310775/"
        }
    ],
    "datePublished": "1963-02-20",
    "description": "A family saga covering several decades of Westward expansion in the 19th century, including the Gold Rush, the Civil War, and the building of the railroads.",
    "director": [
        {
            "@type": "Person",
            "name": "John Ford",
            "url": "/name/nm0000406/"
        },
        {
            "@type": "Person",
            "name": "Henry Hathaway",
            "url": "/name/nm0368871/"
        },
        {
            "@type": "Person",
            "name": "George Marshall",
            "url": "/name/nm0550892/"
        }
    ],
    "duration": "PT2H44M",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWE0YTcyZjMtZTBhZC00N2YxLTg5ODgtNTkyNDkwMjE2NGM5XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "lebensraum,expansionism,imperialism,manifest destiny,ulysses s. grant character",
    "name": "How the West Was Won",
    "original_info": {
        "id": "How the West Was Won_1962",
        "name": "How the West Was Won",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2006-11-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056085/"
        },
        "name": "\"I Am Bound For The Promised Land.\"",
        "reviewBody": "I still remember seeing How the West Was Won in Cinerama when it made it into general release back in 1962. A motion picture theater equipped for Cinerama is the only way this one should be seen. The formatted VHS copy I watched tonight can't come close to doing it justice.\n\nJames R. Webb's original screenplay for the screen won an Oscar in 1962 and it involves an episodic account of the Presscott family and their contribution to settling the American west in the 19th century. We first meet the Presscotts, Karl Malden and Agnes Moorehead going west on the Erie Canal and later by flatboat on the Ohio River. They have two daughters, dreamy romantic Carroll Baker and feisty Debbie Reynolds. The girls meet and marry mountain man James Stewart and gambler Gregory Peck eventually and their adventures and those of their children are what make up the plot of How the West Was Won.\n\nThree of Hollywood's top directors did parts of this film although the lion's share by all accounts was done by Henry Hathaway. John Ford did the Civil War sequence and George Marshall the sequence about the railroad. \n\nThe Civil War piece featured John Wayne and Harry Morgan in a moment of reflection at the battlefield of Shiloh. Morgan did a first rate job as Grant in his brief cameo and Wayne was playing Sherman for the second time in his career. He'd previously played Sherman in an unbilled cameo on his friend Ward Bond's Wagon Train series. I'm surprised Wayne never did Sherman in a biographical film, he would have been good casting.\n\nIf any of the stars could be said to be THE star of the film it would have to be Debbie Reynolds. She's in the film almost through out and in the last sequence where as a widow she goes to live with her nephew George Peppard and his family she's made up as a gray haired old woman and does very well with the aging. Debbie also gets to do a couple of musical numbers, A Home in the Meadow and Raise A Ruckus both blend in well in the story. Debbie's performance in How the West Was Won must have been the reason she was cast in The Unsinkable Molly Brown.\n\nCinerama was rarely as effectively employed as in How the West Was Won. I well remember feeling like you were right on the flatboat that the Presscott family was on as they got caught in the Ohio River rapids. The Indian attack and the buffalo stampede were also well done. But the climax involving that running gun battle between peace officers George Peppard and Lee J. Cobb with outlaw Eli Wallach and his gang on a moving train even on a formatted VHS is beyond thrilling.\n\nThere is a sequence that was removed and it had to do with Peppard going to live with buffalo hunter Henry Fonda and marrying Hope Lange who was Fonda's daughter. She dies and Peppard leaves the mountains and then marries Carolyn Jones. Lange's part was completely left on the cutting room floor. Hopefully there will be a restored version of How the West Was Won, we'll see Hope Lange and more of Henry Fonda.\n\nAnd it should be restored. All those Hollywood legends in one exciting film. They really don't make them like this any more.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi872791577",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODZjNGRlMTItMmU4MS00NzZkLWJjMjMtMGU3NDI0MDE4ZmQzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODZjNGRlMTItMmU4MS00NzZkLWJjMjMtMGU3NDI0MDE4ZmQzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-08T14:47:36.562Z",
        "url": "https://www.imdb.com/video/vi872791577/"
    },
    "url": "/title/tt0056085/"
}