{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Morse",
            "url": "/name/nm0607666/"
        },
        {
            "@type": "Person",
            "name": "Michele Lee",
            "url": "/name/nm0497891/"
        },
        {
            "@type": "Person",
            "name": "Rudy Vallee",
            "url": "/name/nm0884964/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4943,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011112/"
        },
        {
            "@type": "Person",
            "name": "Abe Burrows",
            "url": "/name/nm0123242/"
        },
        {
            "@type": "Person",
            "name": "Jack Weinstock",
            "url": "/name/nm0918485/"
        },
        {
            "@type": "Person",
            "name": "Willie Gilbert",
            "url": "/name/nm0146902/"
        }
    ],
    "datePublished": "1967-03-09",
    "description": "Armed with the titular manual, an ambitious window washer seeks to climb the corporate ladder.",
    "director": [
        {
            "@type": "Person",
            "name": "David Swift",
            "url": "/name/nm0842582/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Comedy",
        "Music",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc3MDI1ODIwNV5BMl5BanBnXkFtZTcwNjk0ODE0NA@@._V1_.jpg",
    "keywords": "big breasts,cigarette,scene during opening credits,long title,based on broadway musical",
    "name": "How to Succeed in Business Without Really Trying",
    "original_info": {
        "id": "How to Succeed in Business Without Really Trying_1967",
        "name": "How to Succeed in Business Without Really Trying",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "marbleann"
        },
        "dateCreated": "2005-05-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061791/"
        },
        "name": "Much better then I remembered",
        "reviewBody": "I saw this movie on a local PBS station for the first time since it originally came out in the movies. I was only 10 at the time so I didn't get it and I remember not being crazy about it. ALthough the song \"I believe in you\" was a favorite of mine. I actually looked at the TV schedule to see what else was on. And I vowed to change the channel at 12, the coming hour. But a funny thing happened, I forgot about the other movie and I remained glued to the screen and saw it to the end. The movie is about a window washer who pledges to become a CEO within a short time by reading a \"How To Book\", hence the title. How delightful to see Michelle Lee singing..what a voice. I didn't remember her singing I Believe in You. Then we have Robert Morse. I was never a big fan of the slap stick comedy ala Jim Carrey Chevy Chase and Robin Wiliams. Robert Morse could give them all a few lessons on playing broad comedy without going over board. Rudy Vallee and the man who played Big Deal in West Side Story (one of my favorite musicals) were hilarious. He was the nephew of the CEO Vallee so we all know what type of character he was playing. We also have the CEO's bimbo girlfriend who wants to get out of the Secretary pool. She actually is not as dumb as we are suppose to think she is. It was a very upbeat funny movie. And for some reason I believe a lot of people in the business world probably know even less then the Robert Morse character, a window washer Maybe they should read the same type of book he was reading. This musical actually would be good if it was just the story. The book could stand on its own. I felt the same way about Carousel. Which deals with very serious issues. The music adds to the story which IMO separates a OK musicals from a great musical. This is a great musical. Oh beware a few songs were cut for the film. The Broadway musical was almost 3 hours, as a lot are. They have intermissions on Broadway. So they cut musical numbers from movie musicals. They did that with Guys and Dolls, one of the great songs at that. HTSIBWRT they cut the Coffee break scene, a great scene. So just as a caution to people who look at movie versions of Broadway musicals. Don't expect to see/hear all of the songs. It's a dumb practice because there are movies made now which are running 3 hours which have a whole lot less going for them then a Broadway musical.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1590345753",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzJkMzAwMjgtYjk0NS00ZWZlLWE5ZTItYzc1Nzk3YTcxMDdkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzJkMzAwMjgtYjk0NS00ZWZlLWE5ZTItYzc1Nzk3YTcxMDdkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-21T16:38:14.144Z",
        "url": "https://www.imdb.com/video/vi1590345753/"
    },
    "url": "/title/tt0061791/"
}