{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matt Damon",
            "url": "/name/nm0000354/"
        },
        {
            "@type": "Person",
            "name": "Daniel Berrigan",
            "url": "/name/nm0077381/"
        },
        {
            "@type": "Person",
            "name": "Howard Zinn",
            "url": "/name/nm0957016/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 818,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "datePublished": "2004-06-18",
    "description": "The life and times of Howard Zinn: the historian, activist, and author of several classics including \"A Peoples History of the United States\". Archival footage, and commentary by friend, colleagues and Zinn himself.",
    "director": [
        {
            "@type": "Person",
            "name": "Deb Ellis",
            "url": "/name/nm0254788/"
        },
        {
            "@type": "Person",
            "name": "Denis Mueller",
            "url": "/name/nm0611029/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkyNTQzNjE2Nl5BMl5BanBnXkFtZTcwNjA4MzcyMQ@@._V1_.jpg",
    "keywords": "historian,new york city,manhattan new york city,moral responsibility,abuse of power",
    "name": "Howard Zinn: You Can't Be Neutral on a Moving Train",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wrlang"
        },
        "dateCreated": "2006-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0416825/"
        },
        "name": "What does it mean to be American?",
        "reviewBody": "Howard Zinn; you can't be neutral on a moving train is about the life of activist Howard Zinn who dedicated his life to educating people on their rights as human beings and as American citizens by becoming a history teacher. The axiom, those who ignore history are destined to repeat it, is absolutely true. And most Americans have no interest in real history. Rising out of poverty in NYC, Zinn tells of his life through the 30s to his death. He mentions many of the true American struggles like the Ludlow Massacre, where unarmed miners and their families working in company owned world could not get out from under the thumb of business and were massacred by the National Guard during a union strike. Something that most of today's so called American citizens don't seem to mind. An event that never made the news or the history books. In his heyday during the 60s with the racial strife, Zinn was targeted with so many other Americans to be pushed out of America. Something that is also an acceptable notion in the present  America, love it or leave it  an idiots axiom. There are very few people younger than I and very few people in general who can appreciate the life of American's without the rights we are squandering today. Ignorance is bliss. While I admire Zinn's zeal and agree with his impression of America and Americans lack of desire to know, I don't agree with all his attempts to humanize our enemies of the past. I would encourage everyone to admit their ignorance and choke down as much Zinn as they can handle to try and wake them up with another point of view and another set of possibilities.\n\nThe biggest mistake of the protesters of the 60s was that they assumed all Americans were educated about their right to engage in civil disobedience and that the cared about human life in general. Protesters assumed that the troops coming home from Viet Nam understood the wrongness of the war and chose to support it rather than engage in disobedience and risk the penalties. The average American, desiring a wave less and secure existence, had no real concept of any of the inconsistencies the war. They were quite content to kill the farmer that they were told threatened their way of life.\n\nHow many ignorant people today feel that democracy means the American way of life? How many ignorant people today forget  and to the REPUBLIC, for which it stands not the democracy.\n\nHow many ignorant people today can't make the connection between crack use and war? The bottom line  if you don't have enough time to understand to another American's point of view, you don't have enough time to be an American. A country of the people, by the people, and for the people.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0416825/"
}