{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Ferreri",
            "url": "/name/nm1864207/"
        },
        {
            "@type": "Person",
            "name": "George Francom",
            "url": "/name/nm1863867/"
        },
        {
            "@type": "Person",
            "name": "Robert Maheu",
            "url": "/name/nm1868100/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 55,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098567/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Isbouts",
            "url": "/name/nm1090080/"
        }
    ],
    "datePublished": "2004-09-06",
    "description": "A look at the secret life of eccentric billionaire Howard Hughes, as told through Howard's own writing and interviews from personal friend Jack Real, business assistant Robert Mahue, wife Terry Moore and personal assistant George ...",
    "director": [
        {
            "@type": "Person",
            "name": "Bill Schwartz",
            "url": "/name/nm1379005/"
        }
    ],
    "duration": "PT55M",
    "genre": [
        "Documentary"
    ],
    "keywords": "character name in title",
    "name": "Howard Hughes: The Real Aviator",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2006-03-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0449602/"
        },
        "name": "Interesting but I've seen better programs on Hughes",
        "reviewBody": "\"Howard Hughes: The Real Life Aviator\" is an interesting documentary, if not the most scintillating thing you'll ever see. It's hard to make something awful on Hughes, as he was such a fascinating man. So it isn't awful. The conceit of this film is that Hughes tells his own story - it's an actor imitating his voice. Some of the photos and film clips were great, and the interviews were interesting, but I wish Jane Russell and maybe one of his better biographers had been interviewed as well. The impressive thing was how emotional some of the interviewees became when talking about Hughes' dying. The respect and affection people had for this pilot/mogul seems to come across in every documentary I've seen about him.\n\nThe film is too short to spend much time on any one period of Hughes' life and takes some wide jumps - in fact, it gets downright confusing when one minute, he's married to Jean Peters, and a few minutes later, he's marrying Terry Moore - in fact, I'm not even sure of the order.\n\n\"Howard Hughes: The Real Aviator\" was produced in 2004 obviously to jump on the hype of the big-budget \"The Aviator.\" Though the Leonardo DiCaprio-Scorcese project had some inaccuracies, it was tremendously entertaining - frankly, I preferred it to this somewhat dry effort.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0449602/"
}