{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Larry Adler",
            "url": "/name/nm0012196/"
        },
        {
            "@type": "Person",
            "name": "Bobbie Arnstein",
            "url": "/name/nm4514043/"
        },
        {
            "@type": "Person",
            "name": "Joan Baez",
            "url": "/name/nm0001926/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 741,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0283053/"
        },
        {
            "@type": "Person",
            "name": "Brigitte Berman",
            "url": "/name/nm0075731/"
        }
    ],
    "datePublished": "2010-06-05",
    "description": "A look at the battles Hugh Hefner fought over the years against the U.S. government, the religious right, and militant feminists.",
    "director": [
        {
            "@type": "Person",
            "name": "Brigitte Berman",
            "url": "/name/nm0075731/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIyMDI3ODQ0N15BMl5BanBnXkFtZTgwNDU5MzA2MDE@._V1_.jpg",
    "keywords": "female rear nudity,female full frontal nudity,female frontal nudity,playboy,playboy club",
    "name": "Hugh Hefner: Playboy, Activist and Rebel",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanbrn"
        },
        "dateCreated": "2011-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1503776/"
        },
        "name": "Excellent and revealing doc of a legendary and cultural icon who spoke for individual freedom so one had the right for pleasure and expressionism",
        "reviewBody": "If you've read \"Playboy\" you know that it's more than a T@A magazine clearly after reading one can say it's thought provoking and it makes one think. As many articles are one's fighting for freedom and expressing opinions of social, economic, political, and values of advice. Really the magazine educates you and in the meantime your always treated to photos of beautiful ladies. And in a way this doc is a treat as it tells the history of the Playboy empire and showcases the founder the interesting and culture crusader activist Hugh Hefner.\n\nFrom rare vintage footage of Hef's early days growing up director Brigitte Berman shows how eager and hard working that Hef was to express his viewpoints from an early age. From then after a stint at Esquire he with the help of some family money put up his own new magazine titled \"Playboy\". At first in the mid 50's a very controversial time Hefner had to blend the magazine with art, stories of fiction and advice to take away from the nude photos of beautiful women.\n\nYet thru out this doc in interviews with Hef and many others you hear how it wasn't an exploitation of women, but more of an experience of freedom and sexual rights for both men and women. And of course all of that came under attack from the religious right and extreme feminists. Even thru it all Hefner has been under investigation from the federal government yet Hef always fought on winning his court cases proving his photos and literature was often satire.\n\nHef proved as Playboy expanded his launch was super by putting in clubs even having his own jet as the mansion moved from the Windy city to Hollywood, California fun in the sun! Always surrounded with beautiful playmates, and fun and games plus movie night(Hef's a film buff) and lingerie parties! In the meantime on his show \"Playboy After Dark\" Hefner fought for human rights taking on racial issues and the right to freedom of speech as Hef and his performers always took a provocative stance. And Hugh was always the man very flamboyant by dressing in his signature silk robes.\n\nReal treats on this doc are the clips and interviews from his friends, and well known people like Tony Bennet, Pat Boone, Dick Cavett, George Lucas, Jesse Jackson, Bill Maher, Jenny McCarthy, Gene Simmons, and Shannon Tweed. All spoke highly of their friend. Really this doc is revealing it traces the whole history of the Playboy empire.\n\nClearly Hugh Hefner was an extraordinary pop culture icon who spoke for freedom especially he encouraged individuals to feel good about sexual pleasure and to challenge authority and don't be a yes man always question things and think as life is often thoughtful and provocative not only under the sheets, but the world around is interesting too with it's social, political, and economic climates. Hugh Hefner will always be a living legend that changed life, culture, and a person's way of thought as one no longer had to feel dirty about sex, as \"Playboy\" made it an enjoyable pleasure of individualism and a great expression of feel good freedom. This doc really stands up to it's name Hugh Hefner certainly is a true rebel and activist.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A look at the battles Hugh Hefner fought over the years against the U.S. government, the religious right, and militant feminists.",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi43976985",
        "name": "Hugh Hefner: Playboy, Activist and Rebel",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjYyMDQxODI4Nl5BMl5BanBnXkFtZTgwODg5ODUyMzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjYyMDQxODI4Nl5BMl5BanBnXkFtZTgwODg5ODUyMzE@._V1_.jpg",
        "uploadDate": "2010-09-08T10:56:20Z",
        "url": "https://www.imdb.com/video/vi43976985/"
    },
    "url": "/title/tt1503776/"
}