{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ferenc Bandi",
            "url": "/name/nm1235094/"
        },
        {
            "@type": "Person",
            "name": "Józsefné Rácz",
            "url": "/name/nm1234185/"
        },
        {
            "@type": "Person",
            "name": "József Farkas",
            "url": "/name/nm1232374/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3776,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053709/"
        },
        {
            "@type": "Person",
            "name": "György Pálfi",
            "url": "/name/nm0701650/"
        }
    ],
    "datePublished": "2003-11-14",
    "description": "Using almost no dialogue, the film follows a number of residents (both human and animal) of a small rural community in Hungary - an old man with hiccups, a shepherdess and her sheep, an old woman who may or may not be up to no goo...",
    "director": [
        {
            "@type": "Person",
            "name": "György Pálfi",
            "url": "/name/nm0701650/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Crime",
        "Mystery",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg2NDQ3NjE2NF5BMl5BanBnXkFtZTcwNzM3ODkyMQ@@._V1_.jpg",
    "keywords": "no dialogue,old man,hiccup,murder,one word title",
    "name": "Hukkle",
    "original_info": {
        "id": "Hukkle_2002",
        "name": "Hukkle",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "insomnia"
        },
        "dateCreated": "2003-07-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0289229/"
        },
        "name": "hypnotic",
        "reviewBody": "The setting for this most unsettling of films from 27 year old director, Gyorgy Palfi, is a tiny village somewhere in Hungary. The scene is one of bucolic\n\nboredom - at least that's what you might think, if you don't pay attention. We see an old man sitting outside his house: he has the hiccups. We see a girl feeding a dog while listening to music through a headset. Men play a game of skittles. A man herds a pig down a street. Woman busily at work in a clothing factory. A\n\nhusband and wife and their children, sit down to lunch. A mole burrows, and\n\nhens peck for worms. Palfi's camera lovingly observes these rituals of everyday life: farm machinery, insects at work, flowers blossoming, a lone jet fighter screams overhead. Pigs mate, meals are carefully prepared, then hungrily\n\nconsumed. A body lays rotting on the bottom of a lake, while above, a couple\n\nfish for their dinner. A cat dies of poison meant for humans. People die. Funerals are held. There is a serial killer about. There is no dialogue, but the soundtrack teems with a veritable chorus of machinery whirring, bees humming, pigs\n\ngrunting, moles scratching. Never does one's attention flag during the film's economical 75 minutes running time. This is one 'out of the box', allright. 7 out of 10"
    },
    "url": "/title/tt0289229/"
}