{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Saif Ali Khan",
            "url": "/name/nm0451307/"
        },
        {
            "@type": "Person",
            "name": "Rani Mukerji",
            "url": "/name/nm0611552/"
        },
        {
            "@type": "Person",
            "name": "Kirron Kher",
            "url": "/name/nm0451601/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14617,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0077190/"
        },
        {
            "@type": "Person",
            "name": "Siddharth Anand",
            "url": "/name/nm1893457/"
        },
        {
            "@type": "Person",
            "name": "Kunal Kohli",
            "url": "/name/nm0463316/"
        }
    ],
    "datePublished": "2004-05-28",
    "description": "A novel look at the eternal battle of the sexes and the trials and tribulations of Karan and Rhea and their attempts to understand each other.",
    "director": [
        {
            "@type": "Person",
            "name": "Kunal Kohli",
            "url": "/name/nm0463316/"
        }
    ],
    "duration": "PT2H23M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjhkMTdjMTEtZWFkOC00OWQ4LWI4ODYtYjFlYTVlOTk3OTU2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "love,kiss,cartoonist,widow,james bond imitation",
    "name": "Hum Tum",
    "original_info": {
        "id": "Hum Tum_2004",
        "name": "Hum Tum",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Abdulxoxo"
        },
        "dateCreated": "2020-12-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0378072/"
        },
        "name": "emotional charged love story",
        "reviewBody": "Hum Tum follows the encounters of two people who run into each other on several occasions under circumstances ranging from friendly to hostile to loving. Along many years and countless run-ins, the two despise each other, befriend each other, and fall in love with each other.\n\nThe storyline is a bit formulaic and quite predictable, and it drag on and on in some parts. And the jumping \"three years later\" \"six years later\" is a bit much, it's also quite plausible that they meet at different places, after a long time and at right time like that.\n\nThe acting is fantastic; Saif Ali Khan and Rani Mukhurjee did a solid job in the lead roles, they brought both energy and charisma in their performance. They portray the different lifes their characters find themselves in a convincing manner. The supporting characters are okay, Kirron Kher did a good as the goofy but supportive mother of Rhea, Rishi Kapoor as the somewhat estranged father is well-acted but I'm not a fan of the character, there's something off about him and I find him somewhat unlikable.\n\nThe soundtrack is amazing, very catchy songs, especially the one with the film's title - Hum Tum. the production design is top-notch, some exotic locations and beautiful sceneries, some rain and snow here and there to add more dramatic effect.\n\nThe cinematography is excellent; some good camera angles and panning during tense or emotional moments like the scene where after they fight in the bar, the camera tilts downward and slowly moves back as she walks out of his life, and creating distance between them, both figuratively and literally.\n\nThe animation that comes in unannounced at times is frustrating, and I'm not sure why they even spent money on it. The character design is awful, they look like something straight out of Ben 10. I'd have preferred if they left it out but still it was fun.\n\n All in all, Hum Tum is a beautiful, emotional charged love story, with some likable performances and good production value. I had a good time watching it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2017965849",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQ4Nzc1NzE1MF5BMl5BanBnXkFtZTgwODkwMTQ3OTE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQ4Nzc1NzE1MF5BMl5BanBnXkFtZTgwODkwMTQ3OTE@._V1_.jpg",
        "uploadDate": "2016-08-16T06:45:13Z",
        "url": "https://www.imdb.com/video/vi2017965849/"
    },
    "url": "/title/tt0378072/"
}