{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Mia Farrow",
            "url": "/name/nm0001201/"
        },
        {
            "@type": "Person",
            "name": "Sydney Pollack",
            "url": "/name/nm0001628/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29998,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008432/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005883/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "datePublished": "1992-09-18",
    "description": "When their best friends announce that they're separating, a professor and his wife discover the faults in their own marriage.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWIxODI3MzktYmM2Ni00ZTY2LThmZWMtYjc0MjliZTZiM2I3XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "marriage,mockumentary,panties,prostitute,nipples",
    "name": "Husbands and Wives",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Galina_movie_fan"
        },
        "dateCreated": "2004-09-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104466/"
        },
        "name": "Is Such Thing as Perfect Relationship Possible? How to Find and to Keep It?",
        "reviewBody": "Woody Allen makes good, very good, and excellent films.\n\nHusbands and Wives is a very good film with excellent performances. It is not a comedy but rather a dramedy that explores marriages and relationships of four main characters. It has several funny moments and dialogs (it is Allen after all) but it has disturbing and sad scenes, too.\n\nWhen Jack and Sally (Sidney Pollack and Judy Davis) announce that they're separating, this comes as a shock to their best friends Gabe and Judy (Allen and Farrow). They start to reevaluate their own marriage only to find out that it is not as perfect as they thought. Very soon Jack and Sally, and then Gabe and Judy start to meet new people - young, bright, and attractive. They all hope that new is better, and for some of them it is true while the others come to understanding that true love involves loving another's imperfections even when very well aware of them. \n\nThis film is for all husbands and wives, lovers, and partners around the world. It is for couples who've been in a relationship for a month, a year, or decades. It is for singles who are ready or who think they want to enter a relationship. It is also for people who don't. All of us have been or may find ourselves in a situation or relationship or having a conversation like the ones in the Allen's film. All of us think and talk about love, trust, understanding, fidelity, sex, and yes - marriage. \n\nThe best scenes of the film belong to Allen and Farrow. Some of their conversations in the movie probably reflect the situation in their own relationship that ended soon after the film was made. It is the last film Allen made with Farrow. \n\nJudy Davis played the role of her carrier practically stealing the film. I was shocked to find out that she received all possible Critics Awards that year and lost Best Supporting Oscar to Marisa Tomei. I love Tomei's performance in My Cousin Vinny (1992) but nomination itself would've been enough. Davis was the Best Supporting actress (I saw all films with nominated performances). Sidney Pollack (The Oscar winning director of Out of Africa and two times nominee for Tootsie and They Shoot Horses, Don't They?) and Liam Nisson were wonderful. I did not like Juliet Lewis at all. What she did adorably in Cape Fear with De Niro for ten minutes scene, she tried to stretch for over an hour here - did not work, IMO.\n\nI like \"Husbands and Wives\" - it was interesting to watch, and it left me thinking if such thing as perfect relationship is ever possible, and what it would take to not only find it but to keep it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for the Woody Allen film",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1846413081",
        "name": "Husbands And Wives",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2QwNzQ4MWEtMmJhMS00NDUyLWI2Y2UtMGNlZmMzZjk0YjI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2QwNzQ4MWEtMmJhMS00NDUyLWI2Y2UtMGNlZmMzZjk0YjI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:24:36Z",
        "url": "https://www.imdb.com/video/vi1846413081/"
    },
    "url": "/title/tt0104466/"
}