{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nick Bagnall",
            "url": "/name/nm0046757/"
        },
        {
            "@type": "Person",
            "name": "Karl Geary",
            "url": "/name/nm0311297/"
        },
        {
            "@type": "Person",
            "name": "Adam MacDonald",
            "url": "/name/nm0531595/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1365,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040556/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059559/"
        },
        {
            "@type": "Person",
            "name": "Christopher Ames",
            "url": "/name/nm0024686/"
        },
        {
            "@type": "Person",
            "name": "Carolyn Shelby",
            "url": "/name/nm0790960/"
        }
    ],
    "datePublished": "2001-07-18",
    "description": "A dramatization of the early years of the hard rock band, Def Leppard, the group faces both success and personal tragedies such as drummer, Rick Allen losing his arm in a car accident and guitarist Steve Clark's alcohol addiction.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Mandel",
            "url": "/name/nm0541677/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAyMzAwODYwOV5BMl5BanBnXkFtZTcwNjYxNjcyMQ@@._V1_.jpg",
    "keywords": "car,band,rock band,alcoholism,britain",
    "name": "Hysteria: The Def Leppard Story",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "avidicon"
        },
        "dateCreated": "2001-07-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0280754/"
        },
        "name": "As heartfelt as tv allows",
        "reviewBody": "Contrary to what mtv and radio will have you believe, most 80's hard rock bands had musical ability behind the image. It is nice to see a story that pays respect to a stand out band in this genre of music.\n\nDef Leppard has persevered through so much adversity, that there probably isn't another band who deserves a movie more. Of course there is more to their history than two hours could capture, but resolution was reached even with the events being rushed.\n\nSolid acting made for believable portrayals and in various emotion. This is impressive as most of the actors didn't quite resemble the characters they played. This movie would be better suited for at least an R rating due to the wild parties this band is notorious for, but was handled probably as good as can be in considering tv standards.\n\nThe perks about having a non-theatrical release is that it presented a lot of new faces that most likely wouldn't get these roles because of the Hollywood bureaucracy that lately only caters to trendy actors and pop stars of the moment. It also brought back another actor in Anthony Michael Hall who played Def Leppard's producer John \"Mutt\" Lange.\n\nIn proving their abilities, this may be the movie that establishes these new actors as the next big wave of movie stars. Also the maturity Hall showcased in his role will hopefully gain him a widely known reputation as a versatile actor.\n\nOverall, this movie was enjoyable and may gain cult status similar to that of This Is Spinal Tap with the exception being that instead of laughing at the band, we will be cheering for them."
    },
    "url": "/title/tt0280754/"
}