{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Tweedy",
            "url": "/name/nm1186492/"
        },
        {
            "@type": "Person",
            "name": "John Stirratt",
            "url": "/name/nm1218017/"
        },
        {
            "@type": "Person",
            "name": "Leroy Bach",
            "url": "/name/nm1218482/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2159,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063938/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058752/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076286/"
        }
    ],
    "datePublished": "2002-06-21",
    "description": "First-time filmmaker and award-winning photographer Sam Jones documents the recording of Wilco's album, \"Yankee Hotel Foxtrot.\"",
    "director": [
        {
            "@type": "Person",
            "name": "Sam Jones",
            "url": "/name/nm1215448/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE0NTY2NTg1MV5BMl5BanBnXkFtZTcwMzk5NzIzMQ@@._V1_.jpg",
    "keywords": "record company,songwriter,rock music,recording studio,musician",
    "name": "I Am Trying to Break Your Heart",
    "original_info": {
        "id": "I Am Trying to Break Your Heart: A Film About Wilco_2002",
        "name": "I Am Trying to Break Your Heart: A Film About Wilco",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MitchellXL5"
        },
        "dateCreated": "2003-06-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0327920/"
        },
        "name": "gray",
        "reviewBody": "I can't see anyone who isn't a Wilco fan finding this that interesting, though I would recommend it to anyone who is curious just for the music. There's a lot of great music in here, and the footage of the earlier stages of Yankee Hotel Foxtrot shows the how lovely all the songs are on that album, in the early stages and in their current form. And while I would agree that the film does hinge on hero worship, it doesn't make the portrayal of band dynamics less interesting to a fan. The fact is, it became obvious to me before the Heavy Metal Drummer scene that Jay Bennett is an enormously talented but really really grating, brow beating individual who is very hard to work with. I also think that after several decades, people should get over the fact that rock and roll isn't a communist collective, most bands have one or two figureheads, or centers to the wheel as Tweedy would have it, and that's just part of the bargain of being in a band. If Bennett ever thought that he was equal to Tweedy in Wilco, then it's an example of the fishbowl he put himself in. Here on the outside, it's always appeared to be Tweedy's band and it's always seemed to work that way. The after interviews with Bennett betray his ego and miscomprehension of his role. Maybe that's Tweedy's fault for never expressing it well. It seemed to me like everyone in the band was just sick of the guy. Equally, the manager's job isn't to question Tweedy's moral processes, his job is to serve the interests of Wilco, and he seems to do it well. He actually seems to put the band before the business in many ways and that's good for the band. So, sure, the movie is one-sided, and it could be a much better, much more insightful movie, but just because it is one sided, I don't think that means that the one side is always wrong about everything. And Jay Bennett makes some correct points, too. But that's just life. The film may be in stark black and white, but we all know that life is really gray, it's just Sam Jones hasn't realized it yet."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "First-time filmmaker and award-winning photographer Sam Jones documents the recording of Wilco's album, \"Yankee Hotel Foxtrot.\"",
        "duration": "PT2M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2410463769",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTBiYjM4N2YtZmM0MS00NjJkLTlkMDktNDgyNDY1M2Q2ODIzXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTBiYjM4N2YtZmM0MS00NjJkLTlkMDktNDgyNDY1M2Q2ODIzXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-04-20T22:55:30.131Z",
        "url": "https://www.imdb.com/video/vi2410463769/"
    },
    "url": "/title/tt0327920/"
}