{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Tibber",
            "url": "/name/nm0862539/"
        },
        {
            "@type": "Person",
            "name": "Jim Caviezel",
            "url": "/name/nm0001029/"
        },
        {
            "@type": "Person",
            "name": "Joan Plowright",
            "url": "/name/nm0687506/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7826,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073388/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022137/"
        },
        {
            "@type": "Person",
            "name": "Anne Holm",
            "url": "/name/nm1230593/"
        },
        {
            "@type": "Person",
            "name": "Paul Feig",
            "url": "/name/nm0082450/"
        }
    ],
    "datePublished": "2004-12-03",
    "description": "A twelve-year-old boy escapes from a Bulgarian Communist concentration camp and sets out on a journey to reach Denmark.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Feig",
            "url": "/name/nm0082450/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc0MDI3MzgwN15BMl5BanBnXkFtZTcwOTQ2MTcyMQ@@._V1_.jpg",
    "keywords": "year 1951,man wears eyeglasses,first airplane ride,pack,calico cat",
    "name": "I Am David",
    "original_info": {
        "id": "I Am David_2004",
        "name": "I Am David",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2006-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0327919/"
        },
        "name": "Two Halves",
        "reviewBody": "This is the sort of film that claims merit in allowing you to see a bad situation work out in tear-induced happiness. Its a sort of enigma why there is a market for these; I suppose we all carry unresolved injustices in our hearts and like to see the promise of them resolved. In getting this, we gloss over the mechanics. For instance this has gotten an award from some morality institute though you'd be hard pressed to find anything or character in it that is actually an exemplar.\n\nThere's determination, and there's resolution, and somehow we superimpose admiration on the participants.\n\nThe really fascinating thing about this is that it really is two films: a long first part, followed by a quite different second part.\n\nThe first part follows a boy's escape. There actually is little to say other than this small bit, he escapes, and continues escaping.\n\nThe second part finds him with Joan Plowright and takes us to the resolution.\n\nThese two parts are from completely different cinematic worlds. It is true that many movies are remembered only for their ending and viewers will forgive all sorts of clunks in the journey if they recall the end fondly. But this first part clunks like old ball bearings in soup. There's one unnecessarily improbable escape after another. Each one adds nothing, except to underscore the difficulty of what our hero is doing. But that difficulty gets undermined at every turn. He never seems hungry, in pain, in the least uncomfortable. He always \"gets away.\" None of the characters or places touch him in any way.\n\nIt seems as if the writer is putting us through this long process for only one reason, so that we can get a large number of flashbacks, each one revealing a little more of what becomes the real story. I'm prepared for indirect narrative; its an amazingly effective tool that I study. Here, we sort out the sense of the thing as he does.\n\nBut the container of this first part is so sickly sweet almost every viewer will give up, unless you live in a world of Sunday School cartoons.\n\nThe second part is as competent as the first is incompetent. Here, we harvest all the information we have been given in the flashbacks. Plus we have a real actor involved instead of folks who believe beatified shining is acting.\n\nHere;s where we get three twists in the narrative, one large. And there's the hint that our boy is an illicit child, and the complications that brings. Its almost enough to make this watchable. But that first part puts us in a prison we cannot escape.\n\nTed's Evaluation -- 2 of 3: Has some interesting elements."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Lionsgate",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi732823833",
        "name": "I Am David",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjUzMDcwNGQtMTA3ZS00Nzc1LThlNmYtODM3MGYwYjVjZDBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjUzMDcwNGQtMTA3ZS00Nzc1LThlNmYtODM3MGYwYjVjZDBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:29:36Z",
        "url": "https://www.imdb.com/video/vi732823833/"
    },
    "url": "/title/tt0327919/"
}