{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Romola Garai",
            "url": "/name/nm0304801/"
        },
        {
            "@type": "Person",
            "name": "Rose Byrne",
            "url": "/name/nm0126284/"
        },
        {
            "@type": "Person",
            "name": "Bill Nighy",
            "url": "/name/nm0631490/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7714,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059198/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0186065/"
        },
        {
            "@type": "Person",
            "name": "Dodie Smith",
            "url": "/name/nm0807977/"
        },
        {
            "@type": "Person",
            "name": "Heidi Thomas",
            "url": "/name/nm0858912/"
        }
    ],
    "datePublished": "2003-08-08",
    "description": "A love story set in 1930s England that follows 17-year-old Cassandra Mortmain, and the fortunes of her eccentric family, struggling to survive in a decaying English castle.",
    "director": [
        {
            "@type": "Person",
            "name": "Tim Fywell",
            "url": "/name/nm0299563/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWQxZDUyODctMDc0Ni00OTgwLWIxZWItZWFkZWFkZDU3OWQ3XkEyXkFqcGdeQXVyNzQ5MzY0NjM@._V1_.jpg",
    "keywords": "timeframe 1930s,female nudity,female topless nudity,suffolk england,year 1936",
    "name": "I Capture the Castle",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lawprof"
        },
        "dateCreated": "2003-08-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0300015/"
        },
        "name": "A Weird Family, Devilish Comedy, Roiling Drama",
        "reviewBody": "How many viewers of \"I Capture the Castle\" have a legal background and understand the humor underlying the family name of the central characters, \"Mortmain?\" Literally, \"mortmain\" means \"Dead Hand\" and in law it denotes the attempt of a person to control his property postmortem. The humor here is that the paterfamilias, James Mortmain (well played by Bill Nighy) is a dried up author who hasn't penned a word since a successful novel of twelve years past. He claims to be working on a new book, an assertion that may be face-saving but is of dubious credibility. James has a past that the family neither wishes to remember nor can face seeing its reappearance (can't reveal what that is, can I?).\n\nWhen still at the top of his game Mortmain and his then wife (who later dies, no foul play here) and his two little girls stumbled upon a rodent infested castle which he leased.\n\nJump quite a bit ahead to a now remarried Mortmain who lives in the still unrestored castle with his new, young, artist wife, Topaz (the beautiful, funny and accomplished Tara Fitzgerald) and his two teenage daughters, an appropriately mischievous little son and a sort of retainer in farm clothes, young Stephen.\n\nThe family is now, as the English say, \"on their uppers.\"\n\nRose (Rose Byrne) is a gorgeous redhead solely obsessed with marrying out of the castle into the squirearchy or at least the solvent. Younger sister Cassandra (Ronola Garai) is engagingly wise, funny and bewildered at the changes that overtake her family when two young Americans succeed to the ownership of a manor that encompasses the castle (for which rent is long overdue). The sisters' close, interdependent relationship is warmly portrayed.\n\nSo Rose pursues one of the Americans, Cassandra deals with first love, spurning one suitor while secretly pining for another. An interweaved subplot has Topaz and then Cassandra desperately acting as James's muse, seeking to ignite what may well be the drenched sparks of a one-novel author.\n\nAs would be expected of a drama set in England in the 1930s before the hideousness of war returned are the inevitable class clashes, both economic and trans-Atlantic. What would a film like this be without a formal dining room scene replete with persiflage and the ominous threat of words said that can not be retracted?\n\n\"I Capture the Castle\" has a strong cast but Cassandra is the centerpiece as she shows developing resolve and growth. Her appeal is irresistible. She's the younger sister many have fantasized but few have had. Ms. Garai is marvelously believable.\n\nYes, the film is in the Merchant/Ivory and Masterpiece Theatre vein but what's wrong with that? I liked most of the characters and rooted for calm but troubled Cassandra and frenetic but basically good Rose.\n\n7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Extra (Clip) from Sony Pictures Home Entertainment",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1504575769",
        "name": "I Capture The Castle",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDAyMmFhNTMtYTAxNC00NjE4LWI1ZGYtOTliYTA5Nzg2MWFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDAyMmFhNTMtYTAxNC00NjE4LWI1ZGYtOTliYTA5Nzg2MWFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:29:49Z",
        "url": "https://www.imdb.com/video/vi1504575769/"
    },
    "url": "/title/tt0300015/"
}