{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Denise Richards",
            "url": "/name/nm0000612/"
        },
        {
            "@type": "Person",
            "name": "Dean Cain",
            "url": "/name/nm0001002/"
        },
        {
            "@type": "Person",
            "name": "Karen Cliche",
            "url": "/name/nm0166566/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2433,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0112300/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094479/"
        },
        {
            "@type": "Person",
            "name": "Cara Lockwood",
            "url": "/name/nm1757249/"
        },
        {
            "@type": "Person",
            "name": "Eric C. Charmelo",
            "url": "/name/nm0153338/"
        },
        {
            "@type": "Person",
            "name": "Nicole Snyder",
            "url": "/name/nm1709372/"
        }
    ],
    "datePublished": "2004-09-13",
    "description": "Denise Richards plays Lauren, a divorced wedding-planner who falls for the groom-to-be (Dean Cain).",
    "director": [
        {
            "@type": "Person",
            "name": "Kelly Makin",
            "url": "/name/nm0538614/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWY2ZWZlMDctNWQ2MC00ZjdkLTkwYzktY2RjMTBkZTYwNGUxXkEyXkFqcGdeQXVyMjczOTU2NTI@._V1_.jpg",
    "keywords": "fast motion scene,time lapse photography,wedding,wedding coordinator,mistaken identity",
    "name": "I Do (But I Don't)",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "danic"
        },
        "dateCreated": "2004-10-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0420683/"
        },
        "name": "A More Enjoyable Version of \"The Wedding Planner\"",
        "reviewBody": "I wasn't expecting to enjoy this offering of Lifetime nearly as much as I did. Okay, it was far from original in plot, but these days, most things in entertainment are recycled to some extent. Admittedly, \"I Do But I Don't\" doesn't even try to disguise that it's heavily recycled, and I think the movie is better off for that unapologetic attitude. Otherwise it would just feel like movie plagiarism, instead of what it is. (Note Title) And if you saw the previews, you would have been able to guess it would be like the \"The Wedding Planner\" so you shouldn't be disappointed by that.\n\nAlmost all the characters feel real in this story. Good acting and a decent script is what accomplishes this, I think. Lauren (Denise Richards) character comes off as endearing and sympathetic, and I found myself rooting for her, even though I knew that everything would work out for her in the end. (They usually do in these kinds of movies.) Her leading man, Nick (Dean Cain) pulled of being the perfect guy without being nauseating. I thought their chemistry together was good enough to please, but not enough to thrill...which would have been nice, but not necessary. Lauren's friend and sister worked well in their role, and served their intended purpose. Lauren's mother was a bit domineering, but her intentions were pure, and when push came to shove, she could back her daughter up, and back off...so that relationship was both frustrating, and touching. As far as Darla went, her character is one that I changed my opinion about a few times in the movie, which offered the rare surprises in this movie, and kept up the pace.\n\nOne character that was handled badly was Lauren's ex-husband, Brad. He was too obviously a plot device to make Nick look better, and to create problems. He's so much of a jerk, you can't believe she'd ever be brain dead enough to be with him in the first place, nor does he seem to have any qualities that would mask, or compensate for his patronizing attitude of her, or how self-absorbed he is. It would have been much more interesting if the marriage falling apart hadn't been all his fault, and that although she was determined to go through with the divorce, there would be some lingering regret.\n\nAlso, the love scene between Lauren and Nick bothered me. It was very sweetly handled, and very tame. (An eight year old could watch it.) But despite that, it shouldn't have been in the movie. The two lovers barely know each other. What kind of message does that send? \"Sleep with a man you barely know on your first date...and no harm done?\" Besides, it would have been much more effective if they just kissed, and held hands, and got to know each other a bit more than they did. And no matter how sweet, the love scene had no real sizzle, it would have been just as well. (The dance scene between them was more erotic.)\n\nBut all in all, I really liked it. Despite it's predictable nature, it managed to stay fresh and charming, and I wouldn't mind seeing it again. It's rare for me to find something so unabashedly romantic that doesn't prompt gag reflexes.\n\n8/10"
    },
    "url": "/title/tt0420683/"
}