{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kim Basinger",
            "url": "/name/nm0000107/"
        },
        {
            "@type": "Person",
            "name": "Vincent Perez",
            "url": "/name/nm0001641/"
        },
        {
            "@type": "Person",
            "name": "Liam Aiken",
            "url": "/name/nm0014582/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4742,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012600/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029177/"
        },
        {
            "@type": "Person",
            "name": "Kuki Gallmann",
            "url": "/name/nm0302990/"
        },
        {
            "@type": "Person",
            "name": "Paula Milne",
            "url": "/name/nm0590360/"
        },
        {
            "@type": "Person",
            "name": "Susan Shilliday",
            "url": "/name/nm0793463/"
        }
    ],
    "datePublished": "2000-05-05",
    "description": "A bored Italian socialite (Kim Basinger) abandons her jet-set lifestyle for the rigors and rewards of rural Kenya in this true story, based on the best-selling memoir by Kuki Gallmann. Directed by Hugh Hudson (Chariots of Fire).",
    "director": [
        {
            "@type": "Person",
            "name": "Hugh Hudson",
            "url": "/name/nm0399853/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Adventure",
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGQyODhhN2QtNTM4Ni00YmI0LWI2NjctM2Y1OWU2NzkwZDc0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "kenya,ranch,italian,snake,dream",
    "name": "I Dreamed of Africa",
    "original_info": {
        "id": "I Dreamed of Africa_2000",
        "name": "I Dreamed of Africa",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "elizabethbennett"
        },
        "dateCreated": "2003-02-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0167203/"
        },
        "name": "I could relate....",
        "reviewBody": "I caught this movie on Bravo last night and I asked myself why I never saw it earlier. It was a true story about an Italian socialite named Kuki Gallman. The movie begins with her out on the town with friends and they have a car accident. As Kuki was recovering from the accident, she begins to wonder if there is any purpose in life out there and if so, what is it? It was like the accident was a major turning point, wake-up call or something that made her yearn for something more than what she had. She falls in love and marries this man who is going to Africa to live on a ranch. Kuki remembered learning about Africa as a child and against her mother's better judgement, she packs up herself and child and moves to Kenya. We see that she is going through many transitions and adjustments from the gleeming socialite to the devastating wiles of Kenya. We hear her say that she wondered what she had gotten herself in to. This was a woman who was chasing poachers, caring for a ranch and having to do a lot on her own as her husband was gone often, nothing that she had grown acustomed to in Italy. However, we saw her grow as a person and as she was growing, she was fufilling what she desired, life with a little bit of meaning. It was tragic when her husband and son both died and so close in time. However, it is people like Kuki who should be appreciated as they work for the good of others and try to make this world a better place. I saw the differences in Kuki from beginning to end as she dealt with frustrations, growing pains and all ingredients that prepare us for our purpose out there. Something I can completely relate to at this point in my own life. \n\nI thought the acting was great, Kim Basinger did an exceptional job. I thought the music was great; I liked the version of \"The Rivers of Babylon\" and the shots of Kenya that are breathtaking. I have two friends from Africa and my mother did some mission work there three years ago so I have learned about some of the culture and way of life there. Africa is dry and hot but beautiful as well. Kudos to all involved in this movie and to Kuki Gallman for sharing her story."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Pictures",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1571684633",
        "name": "I Dreamed of Africa",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2JkNGFlM2MtZjk3MC00ZTgwLWI0ZmMtOWRiOGM5MTgwNDY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2JkNGFlM2MtZjk3MC00ZTgwLWI0ZmMtOWRiOGM5MTgwNDY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:29:53Z",
        "url": "https://www.imdb.com/video/vi1571684633/"
    },
    "url": "/title/tt0167203/"
}