{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Master P",
            "url": "/name/nm0005290/"
        },
        {
            "@type": "Person",
            "name": "Anthony Johnson",
            "url": "/name/nm0424513/"
        },
        {
            "@type": "Person",
            "name": "Gretchen Palmer",
            "url": "/name/nm0658252/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2354,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028078/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021945/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150372/"
        },
        {
            "@type": "Person",
            "name": "Master P",
            "url": "/name/nm0005290/"
        },
        {
            "@type": "Person",
            "name": "Leroy Douglas",
            "url": "/name/nm0235156/"
        },
        {
            "@type": "Person",
            "name": "Carrie Mungo",
            "url": "/name/nm2168359/"
        }
    ],
    "datePublished": "1998-05-27",
    "description": "Two small-time scam artists, Black and Blue, sell boomboxes and broken TVs from their van in a parking lot. When a shipment of cellular phones comes to them by mistake, they soon find themselves targeted by the FBI and gangsters.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Martin",
            "url": "/name/nm0552786/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzEwMTM2ZTktODk0Ni00MTYxLWEwZmYtZTRiOWQzYWI2NzAxXkEyXkFqcGdeQXVyODg2MjMxMTc@._V1_.jpg",
    "keywords": "fbi federal bureau of investigation,face mask,profanity,female frontal nudity,gangster",
    "name": "I Got the Hook Up",
    "original_info": {
        "id": "I Got the Hook Up_1998",
        "name": "I Got the Hook Up",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2003-02-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0131436/"
        },
        "name": "Dire `comedy' from a man on an ego trip",
        "reviewBody": "Black and Blue are two street hustlers who run a ghetto superstore. When they take delivery of a load of mobile phones they think they have it made and start selling them like hot cakes. However when their phones interfere with a radio broadcast, sending details of a money stash out over the air, the two men become the target of a local criminal. Meanwhile the mobile phone company are investigating the new numbers when Black's girlfriend Lorraine is unable to keep them all covered.\n\nI watched `Barbershop' a few days ago and gave it a bad review, however now that I've seen this I feel I may have been harsh. This film is awful - yet more cheap crap banged out by No-Limit to try and add to Master P's bank book without any thought of quality control - how very like everything he does! The plot is, well, non-existent. It is merely a series of stupid jokes and scenes with little cohesion. The whole thing seems to be put together for two reasons, 1) to feed Master P's ego and 2) the mis-belief that black people want to see Ricki Lake characters.\n\nAn example of 1) is the way that the film goes into a playas club at one point, to allow our `heroes' to be surrounded by naked black girls - why? I have no idea but P seems to be having fun. The second thing is seen all through the film in that every character is a joke - a real annoying joke. Squealing and swearing non-stop every character is irritating and unlikeable and, true to form, any white person is a racist (who is brought low by a black man) or a snivelling nerd. Such lazy writing is just plain annoying and it doesn't work.\n\nWorst of all is the fact that none of it is funny - none. I half smiled twice at the rapid mouth action of Blue but that was forced on my side. P is an awful actor - I saw him mugging in Dark Angel as well, but here he is worse. He seems to believe that he just needs to swagger and mumble to look cool and he is sadly mistaken. He just looks like a stereotype which I suppose he is - everything about his bling-bling lifestyle is just one big cliché that he brings nothing new to. Johnson is a little better because he makes fun of himself more than P does but even this is lazy swearing and mugging stuff. The rest of the cast is made up of `big-booty' type actresses who are sexy but no more than that and are just like you'd see on Jerry Springer - really lazy stuff guys.\n\nOverall if you want a lazy, clichéd film that is full or stereotypes, swearing and cheap jokes but lacking a single laugh then this is the film for you. I think anyone who thinks they have seen a lame comedy should watch this film just to see how bad a bad comedy really is."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Two small time scam artists, Black and Blue, sell boom boxes and broken TVs from their van at the parking lot. When, by mistake, a shipment of cellular phones gets to them, it doesn't take long before FBI and gangsters are after them.",
        "duration": "PT38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3113403161",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTc4OTY0NDAtMzc2ZC00MmZkLWJjOTEtMGVhYzA4OGI1NjM4XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTc4OTY0NDAtMzc2ZC00MmZkLWJjOTEtMGVhYzA4OGI1NjM4XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-04T19:47:42.915Z",
        "url": "https://www.imdb.com/video/vi3113403161/"
    },
    "url": "/title/tt0131436/"
}