{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Todd Bridges",
            "url": "/name/nm0004775/"
        },
        {
            "@type": "Person",
            "name": "Jose Rosete",
            "url": "/name/nm1352774/"
        },
        {
            "@type": "Person",
            "name": "Carl Washington",
            "url": "/name/nm0913409/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 729,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0097664/"
        },
        {
            "@type": "Person",
            "name": "Eduardo Quiroz",
            "url": "/name/nm0704390/"
        },
        {
            "@type": "Person",
            "name": "Jose Quiroz",
            "url": "/name/nm0704398/"
        }
    ],
    "datePublished": "2005-08-16",
    "description": "Jimmy and his friends are on a serious mission to party. But in their desperate pursuit of a good time, they are led on a wild cross-town series of hilarious misadventures where they get dissed and ripped off and doused by one ser...",
    "director": [
        {
            "@type": "Person",
            "name": "Eduardo Quiroz",
            "url": "/name/nm0704390/"
        },
        {
            "@type": "Person",
            "name": "Jose Quiroz",
            "url": "/name/nm0704398/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2ODQ5OTA3M15BMl5BanBnXkFtZTcwNDM3MTAzMQ@@._V1_.jpg",
    "name": "I Got Five on It",
    "original_info": {
        "id": "I Got Five on It_2005",
        "name": "I Got Five on It",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "brian-maniotis"
        },
        "dateCreated": "2006-03-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0462351/"
        },
        "name": "Looks like the Quiroz Bros. Will be Lucky If They Even Survive.",
        "reviewBody": "There are no excuses for crap like this. \n\nThis is my pick for the worst movie I've ever seen.\n\nAlthough a lot of people tend to consign some pretty bad films to be \"The worst movie they've ever seen\" this is (in my opinion) the worst movie that exists in the free world today. \n\nThe saddest part about this movie is that any intent to make it seem funny or comedic, is outweighed by the fact that all the \"jokes\" are nothing but ill-conceived, perverted snaps bouncing back and forth between the characters in this film. \n\nYou could strap a viewcam to a unmanned rollerskate, and send it rolling downhill only to let it crash into a series of garbage cans and it would make more sense (after editing) than this...\"movie?\" I'm sorry I can't even call this a movie. \n\nSeriously, this isn't one of those funny/terrible films, believe me, I'm more open-minded about what others see as crap...but I GOT FIVE ON IT is restless crap. I've seen Rock N' Roll Frankenstien believe me, that is one of the worst movies, but at least it's hilarious. \n\nThe Quiroz Bros. should consider the fact that it's more important to eat than make garbage like this. This is a waste of money that could very well bankrupt the Bros. if more films like this persist; it could make survival very difficult for them.\n\nThis film should be illegal in a minimum of 40 states. The Plot didn't exist, I forgot what it might have been just based on my boredom alone.\n\nI've come to the conclusion that watching what the people do in this film is comparable to spending an evening alone with the driving instructor who failed you on your first road-test. \n\nThis movie is an instant lobotomy for anyone who wants it."
    },
    "url": "/title/tt0462351/"
}