{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Schwartzman",
            "url": "/name/nm0005403/"
        },
        {
            "@type": "Person",
            "name": "Jude Law",
            "url": "/name/nm0000179/"
        },
        {
            "@type": "Person",
            "name": "Naomi Watts",
            "url": "/name/nm0915208/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 65296,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028932/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102795/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0238006/"
        },
        {
            "@type": "Person",
            "name": "David O. Russell",
            "url": "/name/nm0751102/"
        },
        {
            "@type": "Person",
            "name": "Jeff Baena",
            "url": "/name/nm1337885/"
        }
    ],
    "datePublished": "2004-10-22",
    "description": "A husband-and-wife team play detective, but not in the traditional sense. Instead, the happy duo helps others solve their existential issues, the kind that keep you up at night, wondering what it all means.",
    "director": [
        {
            "@type": "Person",
            "name": "David O. Russell",
            "url": "/name/nm0751102/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTk5YmEwOTMtZjIzOC00MjFhLWFhN2ItNDgzZDhhYjVjOWRjXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "coincidence,father daughter relationship,cleavage,environmental activism,businessman",
    "name": "I Heart Huckabees",
    "original_info": {
        "id": "I Heart Huckabees_2004",
        "name": "I Heart Huckabees",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "iainwatson"
        },
        "dateCreated": "2005-04-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0356721/"
        },
        "name": "A Existential Trip Through Life",
        "reviewBody": "Albert Markovski (Jason Schwartzman - Rushmore) is an urban guerrilla. A freedom fighter against Urban Sprawl and Corporate-sponsored Over-Development. At least this is how he likes to think of himself. In reality he's a self-obsessed insecure neurotic, and his environmental action group 'Open Spaces' is having little success in the face of their nemesis, the Huckabees corporation. That is until Brad Stand (Jude Law) steps in. As the caring face of Huckabees he sets up a co-operative group with 'Open Spaces' and shows that corporate entities and environmental groups can work together for the good of the community.\n\nAgain, that's how Brad likes to think of his work but he's not a happy man. His mental wellbeing is unravelling, his home life is not good, and his work is beginning to suffer. His wife is Dawn Campbell (Naomi Watts - Mulholland Drive), she is the gorgeous face, body and voice of the Huckabees corporation. That is until she discovers that life is meaningless, we are all simply atoms caught up in a never-ending cycle, and identity is an illusion.\n\nShe discovers this through the work of Bernard (Dustin Hoffman) and Vivian (Lily Tomlin), a husband and wife existential detective agency. They are hired by Albert to investigate why he feels so empty in his life, and to answer his number one question - what is the meaning of life. They observe him 24 hours a day and investigate all other relationships in his life. This leads them to Dawn, who starts wearing dungarees and a babies bonnet after their \"treatment\".\n\nMeanwhile Tommy Corn (Mark Wahlberg - Boogie Nights) is a client of Bernard's and Vivian's agency. He is going through a crisis. An ex-pupil of Bernard and Vivian's, a Russian Nihilist Existentialist called Caterine Vauban (Isabelle Huppert) has sent him her book, on why Nihilism holds the answers he seeks. He comes to believe this is correct and Bernard and Vivian believe he needs the help of an \"existential partner\" and introduces him to Albert. He try's to convince Albert Nihilism is the way forward, but Albert falls in love with Caterine and finds out it isn't.\n\nBeing billed as an \"Existential Comedy\" I've been meaning to see 'I Heart Huckabees since it was originally released about 6 months ago, but never got round to it. Totally kicking myself now cause it was absolutely superb. Awesome soundtrack, inventive and original cinematography, some amazing performances and most importantly a great story. Directed and co-written by David O. Russell (along with Jeff Baena) who last gave us 'Three Kings', the well-received anti-war comedy drama set in the first Iraq war. I personally didn't think 'Three Kings' lived up to the hype, an enjoyable film sure, but not particularly ground breaking or terribly thought provoking.\n\n'I Heart Huckabees' blows 'Three Kings' away, the dialogue has so many levels it's hard to peel them away, but as Bernard teaches \"it's all connected\". The soundtrack is from the always-awesome Jon Brion who has given us the great music to some of the best films of recent years such as 'Magnolia', 'Punch Drunk Love' and 'Eternal Sunshine of the Spotless Mind'. The performances are powerhouses, Law and Watts both standing out as two of the finest young actors in the world today. Watts steals the show thought, surpassing her turn in one of my all-time faves, 'Mulholland Drive'. The film's main theme is one of anti-corporatism, but it isn't so pervasive as to effect the overall upbeat feeling of enlightenment and acceptance the film immerses us in.\n\nThe best part of the film for me was the inventive use of the visuals to perfectly illustrate scientific and philosophical ideas. It's pure eye candy, sections of the film peeling away, mixing with other areas of the screen to form new pictures, showing us how everything can be deconstructed. We are all the same. It's all just atoms, identity is an illusion, we are all connected.\n\n'I Heart Huckabees' is released on DVD in the UK today.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1605239065",
        "name": "I Heart Huckabees",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2YyMjIzMzYtZGUxOC00ZGFjLTg5MmEtMzUyYzI5ZTE5ZDA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2YyMjIzMzYtZGUxOC00ZGFjLTg5MmEtMzUyYzI5ZTE5ZDA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:29:56Z",
        "url": "https://www.imdb.com/video/vi1605239065/"
    },
    "url": "/title/tt0356721/"
}