{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wendy Hiller",
            "url": "/name/nm0384908/"
        },
        {
            "@type": "Person",
            "name": "Roger Livesey",
            "url": "/name/nm0515193/"
        },
        {
            "@type": "Person",
            "name": "George Carney",
            "url": "/name/nm0138791/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9156,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103153/"
        },
        {
            "@type": "Person",
            "name": "Michael Powell",
            "url": "/name/nm0003836/"
        },
        {
            "@type": "Person",
            "name": "Emeric Pressburger",
            "url": "/name/nm0696247/"
        }
    ],
    "datePublished": "1947-08-09",
    "description": "A young Englishwoman goes to the Hebrides to marry her older, wealthier fiancé. When the weather keeps them separated on different islands, she begins to have second thoughts.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Powell",
            "url": "/name/nm0003836/"
        },
        {
            "@type": "Person",
            "name": "Emeric Pressburger",
            "url": "/name/nm0696247/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTM0OTRiYjktMTNjZi00NzVhLWIzYmQtZDQyYzk4NTE5NzRmXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "hebrides,naval officer,scotland,sea storm,scottish hebrides",
    "name": "I Know Where I'm Going!",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nk_gillen"
        },
        "dateCreated": "2004-06-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0037800/"
        },
        "name": "Love in the Highlands",
        "reviewBody": "The title \"I Know Where I'm Going\" refers to a declaration made by the film's heroine, a middle-class English girl (acted by Wendy Hiller) who's determined to get to the top of the social rung by any means legal. She has just become engaged to Sir Robert Bellinger, one of the country's richest industrialists. She knows where she's going all right: To the Scottish isle of Killoran, where her future as Lady Bellinger is to be confirmed in matrimony.\n\nYet Killoran may as well be the planet Mars. No matter how hard she tries, she just can't get there. At first, it's only the foggy weather that prevents her from ferrying across to Gretna Green. Then the fog is cleared away by gale-force winds. Later though, it's as if the atmosphere itself, something in the old castle legends and superstitions that conspire to keep her away from everything she's wanted. Yet she is stubborn, even bribing a boy to pilot a small boat to Killoran in the midst of a huge squall - a move that proves nearly fatal. She's determined to get \"where she is going,\" but she's turned away once again -- by the elements as well as the realization that she has become emotionally attached to a young naval officer on leave (Roger Livesey).\n\nThis is a tightly written and performed effort. There isn't a single wasted motion. The images are memorable too. Pamela Brown, plays the poor huntress Catriona, silhouetted against the gray Northern sky with a shotgun in one hand, the other hand tethered to a leash restraining her dogs as they make their way up a brae; Finley Curray's weather-beaten face in close-up says more about his salty character than his sage dialogue; and there's an amusing cameo by a pre-teen Petula Clark, reading Edmund Spenser at the breakfast table. Just the sort of ironic juxtaposition one might expect from this movie's masterful director, Michael Powell."
    },
    "url": "/title/tt0037800/"
}