{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bibi Andersson",
            "url": "/name/nm0000761/"
        },
        {
            "@type": "Person",
            "name": "Kathleen Quinlan",
            "url": "/name/nm0000599/"
        },
        {
            "@type": "Person",
            "name": "Ben Piazza",
            "url": "/name/nm0681319/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1452,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064409/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0764047/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010693/"
        },
        {
            "@type": "Person",
            "name": "Joanne Greenberg",
            "url": "/name/nm0338534/"
        },
        {
            "@type": "Person",
            "name": "Gavin Lambert",
            "url": "/name/nm0483149/"
        },
        {
            "@type": "Person",
            "name": "Lewis John Carlino",
            "url": "/name/nm0137573/"
        }
    ],
    "datePublished": "1977-10-29",
    "description": "A disturbed, institutionalized 16-year-old girl struggles between fantasy and reality.",
    "director": [
        {
            "@type": "Person",
            "name": "Anthony Page",
            "url": "/name/nm0656108/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjE0OWUyMjYtOTQ4ZC00NzM0LTk3NjktOWE0YmI2OWYxM2JhXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg",
    "keywords": "schizophrenia,female protagonist,teenage girl as protagonist,teenage protagonist,psychiatric hospital",
    "name": "I Never Promised You a Rose Garden",
    "original_info": {
        "id": "I Never Promised You a Rose Garden_1977",
        "name": "I Never Promised You a Rose Garden",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "moonspinner55"
        },
        "dateCreated": "2009-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0076172/"
        },
        "name": "Devastating, complicated, harrowing...not an easy movie to like, but impossible to dismiss",
        "reviewBody": "Hannah Green's popular book has become first-rate medical drama despite echoes of other hospital horror shows (which are probably unavoidable) and many disturbing, alarming episodes which cause a general lack of relief to be intensely felt. Kathleen Quinlan is remarkable in a unheralded tour-de-force playing schizophrenic, suicidal young woman admitted into a mental institution by her parents. Quinlan's Deborah Blake is not an innocent lamb being tossed to the lions--she's as deeply troubled and psychotic as the other inmates--yet her doctor (a warm, compassionate Bibi Andersson) detects a core of sound reasoning to Deborah's manner, and works carefully on rescuing the girl from the demons who plague her. Deborah's fantasy world, which takes place in what appears to be a prehistoric civilization of Indian mystics, seems wildly overwrought at first (and we never do uncover the connection between Deborah and these tribal warriors and lovers); however the structure of the film is quite linear and, as we move from one chapter to the next, we can sense what drives this girl to self-destruction without a lot of technical jargon. Supporting cast is also strong, particularly Norman Alden as a kind orderly and Martine Bartlett (who played the mother in \"Sybil\") as a resident hysteric. Sylvia Sidney, as a returning patient who didn't make it on the outside, is typically a wonderful performer, yet she's never quite convincing in this part; her trained, poised style of acting tends to clash with the unbridled crazies who wander up and down the halls. Also, there's a small leap forward in time near the end which is momentarily confusing--perhaps another sequence with Andersson might have helped to prepare viewers for Blake's tentative recovery. Otherwise, a gut-wrenching achievement: unblinking, hard to watch on occasion, but undeniably potent and well-made. *** from ****",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0076172/"
}