{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Irene Dunne",
            "url": "/name/nm0002050/"
        },
        {
            "@type": "Person",
            "name": "Barbara Bel Geddes",
            "url": "/name/nm0000895/"
        },
        {
            "@type": "Person",
            "name": "Oskar Homolka",
            "url": "/name/nm0393028/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5700,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041421/"
        },
        {
            "@type": "Person",
            "name": "DeWitt Bodeen",
            "url": "/name/nm0090840/"
        },
        {
            "@type": "Person",
            "name": "John Van Druten",
            "url": "/name/nm0886668/"
        },
        {
            "@type": "Person",
            "name": "Kathryn Forbes",
            "url": "/name/nm0285361/"
        }
    ],
    "datePublished": "1948-03-17",
    "description": "A young writer recalls her ups and downs of growing up as one of four children to Norwegian immigrant parents in 1910s San Francisco.",
    "director": [
        {
            "@type": "Person",
            "name": "George Stevens",
            "url": "/name/nm0828419/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTczODkyMDktMzE2MS00NGQyLWI1YjYtMWYyZTYzNTg0ZTM5XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "car,gourmet,period drama,female protagonist,timeframe 1910s",
    "name": "I Remember Mama",
    "original_info": {
        "id": "I Remember Mama_1948",
        "name": "I Remember Mama",
        "year": "1948"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ed-Shullivan"
        },
        "dateCreated": "2016-03-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0040458/"
        },
        "name": "This film invites you to reminisce about your own families struggles, resilience and relationships",
        "reviewBody": "I Remember Mama was released 68 years ago and although Mrs. Shullivan and my own mother have been deceased for quite some time, we could not help but draw comparisons between our own mothers and the role of Irene Dunne who plays the family matriarch Mama Hansen. The story follows Mama and Papa Hansens' immigration from Norway to San Francisco and where they struggle week by week, pay day to pay day, to raise their four children who range in age from 8 to 18. \n\nEvery Saturday morning Mama's ritual would be to corral her family around the kitchen table and distribute Papa's weekly pay amongst the most critical bills that they had to pay such as their rent to their landlord, groceries, the children's clothing needs and education for books and writing material. Every week Mama would comment \"Good we have enough money this week so there is no need to have to touch our bank account\". Mama and Papa also retained what they called their \"little bank\" which held a few coins in a metal tin which periodically they would need to resort to in an effort to make ends meet each week.\n\nAnyone who lived through the baby boomer years of the 1940's – through the 1960's would understand that \"getting by through compromise and doing without\" was a way of life whereas children of today call it \"get it, buy it, and pay for it later\". Mrs. Shullivan and I thoroughly enjoyed this films story which was narrated by the Hansen's eldest daughter Katrin, played by Barbara Bel Geddes. Of course this was a simpler time in the early 1900's and one of the great Directors of all time George Stevens, stuck to the script and allowed his audience to enjoy a simpler time in American history and the daily living rituals of an immigrant Norwegian family that extended to three Aunts (Jenny, Sigrid and spinster Trina played by Ellen Corby) and one gruff Uncle Kris (played superbly by Oskar Homolka) who was both feared and respected. \n\nThe four children loved their parents immensely and although they suffered financially through hard times their strength was in the extended family unit comprised of the Hansen's three Aunts, one young cousin, and one gruff Uncle Kris who owned his own car and who had a female companion who was a mystery woman which was reflected by the family always wondering if she was Uncle Kris's housemaid or his wife? Of course the Hansen's needed to take on a boarder (my own family had two boarders in the 1950's) who always committed to paying his board the following week. In lieu of payment the boarder Mr. Hyde (played by Cedric Hardwicke) would read classic novels out loud to the family each night with so much passion and emotion that it inspired the eldest daughter Katrin (played by Barbara Bel Geddes) to want to become an author herself. \n\nThroughout the film we see the families reliance on Mama Hansen to provide strength, a positive attitude and most especially hope to the Hansen clan. Near the end we come to realize that Mama was telling a white lie to her children, and if you have not shed a tear or two by this point in the film then I can only assume you were born after year 2000 when hardship is an unknown term to many. Mrs. Shullivan and I truly loved this film and directors such as George Stevens who directed I remember Mama rank right up there with the very best directors such as Frank Capra, John Ford, and George Cukor.\n\nIf you want to see a film that allows you to reminisce about your own childhood and relationship with your extended family then this film will be sure to bring back some of your old memories to the forefront with the narration by then 26 year old actress Barbara Bel Geddes who explains her upbringing and the loving relationship she shared with her siblings, her father, and most importantly her Mama played with such love and thoughtfulness as only actress Irene Dunne could have accomplished. Be prepared to shed a few tears. I rated it a strong 8 out of 10 for director George Steven's unique ability to take the simplest of story lines, that being an early 1900's immigrant families daily struggles that are conquered through the family bond.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1500495641",
        "name": "I Remember Mama",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDk2NmM0YjgtNDhhOC00NzNhLTg3NWMtMWJlZGRjOTJlNWY3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDk2NmM0YjgtNDhhOC00NzNhLTg3NWMtMWJlZGRjOTJlNWY3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-01-28T17:04:58.128Z",
        "url": "https://www.imdb.com/video/vi1500495641/"
    },
    "url": "/title/tt0040458/"
}