{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Culp",
            "url": "/name/nm0191685/"
        },
        {
            "@type": "Person",
            "name": "Bill Cosby",
            "url": "/name/nm0001070/"
        },
        {
            "@type": "Person",
            "name": "George Newbern",
            "url": "/name/nm0627624/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 364,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037022/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069999/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0235905/"
        },
        {
            "@type": "Person",
            "name": "Morton S. Fine",
            "url": "/name/nm0277643/"
        },
        {
            "@type": "Person",
            "name": "David Friedkin",
            "url": "/name/nm0295053/"
        },
        {
            "@type": "Person",
            "name": "Michael Norell",
            "url": "/name/nm0635260/"
        }
    ],
    "datePublished": "1994-02-03",
    "description": "Time passes and things change. So have Scott and Robinson. Scott has become a college professor and Robinson holds a high enough position with the S.S.A.. Actually, their children are now the agents. It's their first mission, and ...",
    "director": [
        {
            "@type": "Person",
            "name": "Jerry London",
            "url": "/name/nm0518719/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Adventure",
        "Comedy",
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAwOTU5Nzg5NF5BMl5BanBnXkFtZTcwNjk4MzMyMQ@@._V1_.jpg",
    "keywords": "spy,tv series reunion,sequel",
    "name": "I Spy Returns",
    "original_info": {
        "id": "I Spy Returns_1994",
        "name": "I Spy Returns",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bemanning-1"
        },
        "dateCreated": "2006-04-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110094/"
        },
        "name": "Affectionate Homage to a Classic Series",
        "reviewBody": "This flick is PRICELESS. I'm in the after glow here from watching it three times.\n\nI'm taking back my rental and getting my own copy.\n\nI'm going to go out on a limb here and guess that Culp & Cosby are really syrupy in love with each other in real life, because that's the sense I get from the whole project. Their chemistry is spot on and genuinely heart warming.\n\nCosby is credited as one of the Exec. Producers which means he partly bank rolled it, which is really nice, because it's really a lovely send off and tribute to a great, classic series and a rare chance for the actors to pay homage to Kelly and Scotty.\n\nThe humor is terrific. Culp and Cosby spend some quality time together--making fun of each other and their age mercilessly. But, in a sweet, affectionate way.\n\nYou feel all their history, and their regard for one another. Their initial meeting after 25 years is PRICELESS!!! The duo pokes fun at the way the spy biz and world has changed. Kelly's gone right along with it, adapting computers and gadgets while Scott has settled into his comfy professorship, complete with elbow patches on a tweed jacket. There are some cute gags which play upon Kelly and Scotty's style.\n\nIf Sheldon Leonard had planned this as a pilot for a new series, I think George Newbern has a James Spader thing going on. As Kelly's son he just didn't have the charisma to pull it off, but the casting makes perfect sense for the reluctant spy. I'd like to see Vincent Ventresca as the Kelly character, or Joseph Culp, who is the spitting image of his father. Salli Richardson is very good, but she's no Cosby replacement. But, that's immaterial. I just enjoyed the whole movie.\n\nThe dialogue is well written and the ad libs are always enjoyable. Even the villain, Jonathan Hyde as Cesar Baroodi, has some priceless lines.\n\nThere's a nod to the \"locked room\" scenarios that Kelly & Scotty always ended up in. They just kicked it up a notch and it gave them something to play off of. The Head of Field Ops just doesn't look so formidable under those circumstances.\n\nNobody loves and respects these characters and I Spy like Culp & Cosby. Watch and ENJOY the masters at work and play.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0110094/"
}