{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Pat Morita",
            "url": "/name/nm0001552/"
        },
        {
            "@type": "Person",
            "name": "Trevor Morgan",
            "url": "/name/nm0605080/"
        },
        {
            "@type": "Person",
            "name": "Pam Dawber",
            "url": "/name/nm0001118/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 735,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045895/"
        },
        {
            "@type": "Person",
            "name": "Mark Sanderson",
            "url": "/name/nm0761808/"
        }
    ],
    "datePublished": "2001-04-05",
    "description": "Four young boys find a shipwrecked Japanese sailor during World War II and struggle with the decision to save him.",
    "director": [
        {
            "@type": "Person",
            "name": "Bob Clark",
            "url": "/name/nm0163706/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Family",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5MDY1MTc4NF5BMl5BanBnXkFtZTcwMzI5ODMyMQ@@._V1_.jpg",
    "keywords": "boy,shipwrecked,japanese,asian american,12 year old",
    "name": "I'll Remember April",
    "original_info": {
        "id": "I'll Remember April_1999",
        "name": "I'll Remember April",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "HogarthHughes"
        },
        "dateCreated": "2006-09-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0155754/"
        },
        "name": "Great childhood adventure",
        "reviewBody": "This is a well-crafted and pleasant film - telling the growing up of four American childhood friends just after the attack on Pearl Harbour. While the four friends are consumed by playing being soldiers, a Japanese submariner washes ashore their beach. Initially thinking to become heroes, the boys detain the seriously wounded soldier. But is he truly an enemy of everything they hold dear?\n\nReally fulfilling my admittedly optimistic expectation, April did not only turn out to be a wonderful tale of youth friendship, but also a pretty nice drama as well. The film - during many moments - brought back memories of Richard Donner's (and as far as I'm concerned Spielberg's) The Goonies. Growing up with friends, participating in a grand and exciting adventure, trying to do good. This is what April is about as well. While not ignoring to include sentimental scenes, the film skillfully prevents presenting huge clichés. The moments that were supposed to be powerful in the film work well. And besides being enjoyable and powerful, the film also manages to supply an important and true message as well.\n\nThe casting could not have been more wonderful. We are given a cast of four great kids, including a very impressive Trevor Morgan and star-becoming Haley Joel Osment. Morgan absolutely shines as the kid who's dealing with some scars of war, and he is fantastic in more than just a couple of scenes. He makes one very moving sequence in the film work truly well. Osment is giving a solid yet relatively small show as well - his character is of less importance in this story, but he's indeed rather memorable as Morgan's buddy.\n\nWhile the story basically centers around the four boys and their Japanese 'prisoner', there are powerful other characters around as well. One of the boys' relatives, played by the late and wonderful Pat Morita, and Morgan's character's father have good screen presence.\n\nAs mentioned, April is a coming of age story packed with some dramatic elements, yet it remains light and easily viewable. Backed by a decent enough score, the film manages to touch the heart without any doubt. Probably Morgan's best role as a child actor, and one of Osment's cool early appearances on the silver screen, I'll Remember April is a must-see for fans of the genre. Growing up couldn't have been more fun.\n\nHighly recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0155754/"
}