{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Valerie Bertinelli",
            "url": "/name/nm0000933/"
        },
        {
            "@type": "Person",
            "name": "Barry Bostwick",
            "url": "/name/nm0000960/"
        },
        {
            "@type": "Person",
            "name": "Francesca Annis",
            "url": "/name/nm0000768/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 478,
        "ratingValue": 7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057017/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044096/"
        }
    ],
    "datePublished": "1987-03-01",
    "description": "Maxi Amberville tries to save the magazine empire her father built, but her treacherous uncle stands in her way.",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMxOTI5MDk2NV5BMl5BanBnXkFtZTcwMzA3ODgxMQ@@._V1_.jpg",
    "keywords": "gay,new york city,womens magazine,pinball machine,family relationships",
    "name": "I'll Take Manhattan",
    "original_info": {
        "id": "I'll Take Manhattan_1987",
        "name": "I'll Take Manhattan",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "marcin_kukuczka"
        },
        "dateCreated": "2009-03-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092378/"
        },
        "name": "I'll Rate MANHATTAN...that Wondrous TV Series of Long Ago 5/10",
        "reviewBody": "\"I'll Take Mahnattan\" based on the novel by Judith Krantz was one of the first American movies that one could watch on Polish TV in the 1980s. No one seemed to understand fully the highlighted social situations of the New York and New Yorkers depicted here: rat race of wild capitalism, magazine empire, luxury...who could get its idea in the gray communist times of the late 1980s? Polish reality differed so much that owning big private properties or running individual businesses were entirely alien.\n\nYet, what mattered was its \"American character\" (for us anything to do with the 'promised land' of America). As a child, I remember people flocking to see MANHATTAN (as everyone called it) on Sunday evenings humming the melody of the title song. It was indeed a 'dream of a boy and girl' unfulfilled, an 'isle of joy' as the title song says, the 'joy' unreachable. They were all so much absorbed by the strange fate of Maxi Amberville (Valerie Bertinelli), a true businesswoman and a good daughter of her wealthy father that you could openly say: \"Tell me, what other TV series compares with this one?\"...perhaps ESCRAVA ISAURA or RICH MAN POOR MAN, but indeed not many. What was so special about it?\n\nEverything! Scenes and characters observed attentively remained in memory for good. These were Zachary Amberville (Barry Bostwick) who people sympathized with and whose tragic death saddened most audience to tears; Maxi (Valerie Bertinelli) was perceived as a vital young lady whose radical decisions and assertive behavior appeared to people as something absolutely new and challenging to follow; Maxi's handsome husband Rocco with whom lots of Polish girls fell in love as with most Italian macho; finally, the wretched character of a womanizer and a Cain-like brother Cutter (Perry King), for all, the true villain... Therefore, if you had asked someone in Poland in 1989 to rate MANHATTAN on the scale of 1-10, no one would have hesitated to say 10/10...masterpiece!\n\nNow, when watching MANHATTAN 20 years later and having achieved a much wider film experience, there seems to be nothing 'wondrous' about it. It is just an average TV series that, unfortunately, has lost most of its interest, action appears to be slow-paced, some performances are clichéd and some parts of script are, so seriously to say, rubbish. Cutter Amberville (Perry King), being the villain of the story but at the same time one of the characters people pay their greatest attention to, appears to lack continuity: once we see him young, once old - when he kills his brother, he has some gray hair; yet, after his brother's funeral, he plays golf and looks as young as he looked at the beginning of the story. However, the case of Cutter is forgivable due to King's good acting. Yet, the character of Lili Amberville has been ruined by the two actresses, first Georgia Slowe and then Francesca Annis. While Ms Slowe is unconvincing in her role, Ms Annis gives hardly any insight into her character's contradiction. Barry Bostwick attempts to give a genuine performance; yet, much slips through his fingers. Valerie Bertinelli is better in the role of Maxi: too much chaotic and talkative sometimes, but not bad... yet far from something that would deserve particular attention.\n\nBesides, the soap opera elements are clearly noticeable here, which makes MAHHATTAN a sort of movie ambitious movie buffs will probably dislike. Sex, money, jealousy, marital treason, quarrels, silly talks of young girls, marriage and divorce, life as adventure in Monte Carlo. One of the most typical soap opera element is, I think, the focus on Justin's character: his homosexuality used as a means for deceit and revenge of others. On the one hand, his character seems to be ridiculed through kitschy script; on the other hand, it seems to be promoted through his assertiveness. The end seems to justify the means of immorality, which is another aspect of sheer soap opera. However, thank goodness it only seems to...\n\nLet me praise something about MANHATTAN or, in other words, find something valuable about it that people must have seen then and can notice nowadays. It is the aspect for which we can be grateful to Judith Krantz but, at the same time, be glad that the producers of the novel adaptation did not skip: family presentation with a wonderful insight into marriage. At the same time, the stories develop such dilemmas as huge wealth leading to 'race of jealousy' among people, hatred leading to wretchedness of fratricide, children as a saving goodness of marriage, love of life as a defeating force against all fear of blindness or other disabilities. The abortion that Cutter offers Lili Amberville is rejected by her and the birth of a child never makes her regret that decision. That is great about MANHATTAN and makes it a TV series, despite everything else, worth seeing.\n\nSo, you probably wonder why I rate this TV series from a bit different perspective. Having a pretty unique experience with this story and some very personal memories I identify with it, I don't attempt to praise it as people in Poland did years ago nor criticize it thoroughly. With an objective eye, I recommend you to see it and try to find something positive about it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0092378/"
}