{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joaquin Phoenix",
            "url": "/name/nm0001618/"
        },
        {
            "@type": "Person",
            "name": "Antony Langdon",
            "url": "/name/nm0486018/"
        },
        {
            "@type": "Person",
            "name": "Carey Perloff",
            "url": "/name/nm4239082/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23123,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0310867/"
        },
        {
            "@type": "Person",
            "name": "Casey Affleck",
            "url": "/name/nm0000729/"
        },
        {
            "@type": "Person",
            "name": "Joaquin Phoenix",
            "url": "/name/nm0001618/"
        }
    ],
    "datePublished": "2010-09-16",
    "description": "Documents Joaquin Phoenix's transition from the acting world to a career as an aspiring rapper.",
    "director": [
        {
            "@type": "Person",
            "name": "Casey Affleck",
            "url": "/name/nm0000729/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTM3M2Q0ZDgtZTE5Ny00MGNmLWJjNjYtY2RkOGJkY2Y3ODE3XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "actor,barack obama character,cinema unawarerite,mockumentary comedy,found footage",
    "name": "I'm Still Here",
    "original_info": {
        "id": "I'm Still Here . . . Damn It!_1999",
        "name": "I'm Still Here . . . Damn It!",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "durrien"
        },
        "dateCreated": "2010-09-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1356864/"
        },
        "name": "Shift Happens",
        "reviewBody": "This is a very good movie, but it may not be obvious at first. Our present culture is enamored with spectacle over substance, so I can see why its cursory glance would miss a deeper story being told. It is the story of each of us.\n\nOn the surface of things, the movie comes across as a bit voyeuristic. The stereotyped perspective of celebrity life is interesting enough (or not). It is both titillating and uncomfortable to peek behind the veil of someone's raw and intimate life, to have such a personal journey on public display.\n\nThe long title for the movie reads, \"I'm Still Here: The Lost Years of Joaquin Phoenix.\" Truly, if we are lucky, we are all works in progress. What is the nature of our identity? What individual and shared narratives have we embraced to define our lives? When those stories unravel at the seams, come crumbling down, what remains?\n\nThere has never been a line blurring fiction from non-fiction. It is all fiction, always. The stories we tell ourselves, and others, are both real and imagined. They give shape and trajectory to our lives. Yet, we are simply an expression of circumstance and happenstance -- trying to carve meaning out of our fleeting experience, to connect a constellation of moments and memories into some discernible picture.\n\nWe want to believe, in our hearts, that we are special: the mountaintop waterdrop. Rather, we are part of a greater ocean of being, the depths of which we cannot even dimly fathom. Some people go their entire lives without wondering who they are, or how they are called to contribute to the world. Many people are happy enough with the surface show, oblivious to the mystery and reality of their authentic selves. It takes effort to reveal the treasures within. Why bother.\n\nWe want our lives to have the benefit of a movie. We want everything somehow to come together, to make sense, to have resolution, a happy ending, triumph, victory! In short: to affirm our desires and imaginings. But life is not like that. It is a messy, desultory business. In the person, in the example, of Joaquin Phoenix, we witness the everyday phenomenon of going to pieces, without falling apart.\n\nAs Joaquin says at the top of the movie, he wants to be seen for whom he is, just that. All of it, the good and the not-so-good. From this place, there is the genuine possibility to grow and to become. Truthfulness is the foundation of all virtues. Everything is built on this honest open humanity.\n\nAfter the fiction of one's self- and culturally imposed identity is obliterated, we can pick our way among the ruins and begin again. The inner and outer forces that have come together to define us -- in a very real sense, to imprison us -- no longer hold their narrative sway. The movie ends on this baptismal note, with a new beginning, a rebirth. Each, in our own way, is reminded: Free thyself from the fetters of the world, loose thy soul from the prison of self. Seize thy chance, for it will come to thee no more.\n\nWith a wink and a nod, the movie is complete with cast and writing credits, made under the banner of They Are Going to Kill Us Productions. As self-involved as the movie may first appear, we can be forgiving of its conceit or deceit. This is cinema verite (no accents), as the camera is pointing to truth, without the story itself having to be true. \"I'm Still Here\" carries the double meaning for this universal and particular process of sacrifice, discovery and spiritual maturation.\n\nIn life, when all is said and done, we don't know quite what we have lived through, or what we have wrought. The curtain falls. Someone else takes the stage. A new story begins. Round and round it goes. If we could see the end in the beginning, perhaps we would not lament, but rejoice, in the journey."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A documentary on Joaquin Phoenix's transition from the acting world to a career as an aspiring rapper.",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1742407193",
        "name": "I'm Still Here",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTY5ODY0MTE4NV5BMl5BanBnXkFtZTgwMTI4MDIzMzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTY5ODY0MTE4NV5BMl5BanBnXkFtZTgwMTI4MDIzMzE@._V1_.jpg",
        "uploadDate": "2010-08-19T08:19:24Z",
        "url": "https://www.imdb.com/video/vi1742407193/"
    },
    "url": "/title/tt1356864/"
}