{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frank Langella",
            "url": "/name/nm0001449/"
        },
        {
            "@type": "Person",
            "name": "Daniel von Bargen",
            "url": "/name/nm0901926/"
        },
        {
            "@type": "Person",
            "name": "Rosanna Arquette",
            "url": "/name/nm0000275/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 487,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Person",
            "name": "Bruce Wagner",
            "url": "/name/nm0905818/"
        }
    ],
    "datePublished": "1998-09-03",
    "description": "Nearing his 60th birthday, a movie producer discovers that he may have less than a year to live as a result of inoperable cancer. The effects of his disease take the toll on him and his distressed wife. However, his dysfunctional ...",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Wagner",
            "url": "/name/nm0905818/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwMDA2MjUyOV5BMl5BanBnXkFtZTcwNzIyNTUyMQ@@._V1_.jpg",
    "keywords": "ex husband ex wife relationship,father daughter relationship,adoptive father adopted daughter relationship,father son relationship,dying",
    "name": "I'm Losing You",
    "original_info": {
        "id": "I'm Losing You_1998",
        "name": "I'm Losing You",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "matt-201"
        },
        "dateCreated": "1999-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0142393/"
        },
        "name": "Oncoglamorama",
        "reviewBody": "Bruce Wagner's Hollywood novels have a particular horror-movie frisson: a can't-turn-the-page-but-can't-stop-turning tension. A dark bill of goods read by a sardonic M.D. to a terminal patient, the typical Wagner story is L.A. loserdom braced onto a Renaissance canvas--a gossipy Movieline-magazine horror story given epic proportions. Wagner so loathes the calmly powerful, not-so-bright people who thwart him that he visits every kind of calamity on them--crack-induced strokes, cancer, AIDS, tabloid sex-torture. It's as if the power of his imagination and the boil of his frustration crashed into each other and made a monster hybrid--insider bitterness raised to a Mailerian scale, where the felicities of a crashed deal take on the properties of the goings-on in a Nazi death camp, or a terminal ward. A blurb in the jacket for Wagner's masterly \"Force Majeure\" read, \"Wagner lavishes on Hollywood the kind of attention that novelists once lavished on sex, or the Second World War.\" Ain't it the truth: Wagner turns bellyaching into high opera.\n\nWagner's 1996 novel \"I'm Losing You\" was described by John Updike as \"inhabiting a universe so cratered it's hard to turn the pages.\" The novel is a Boschian cry of despair from the bowels of Century City. In his new movie version, that Munchian shriek is turned into a soft, Cronenbergian whisper. The has-beens and never-weres of Wagner's ultimate dystopian L.A. are viewed not with sadomasochistic coolness here, but with gentleness and, dare I say it, love. There's nothing sentimental in this picture, and not a frame that isn't perfumed by death, but there is a quality that took me off guard. I'M LOSING YOU is a reminder, almost inaudible in this cratered blockbuster universe, of the humanistic potential of movies--the possibility of art as a guide for human beings to navigate their way out of hopeless predicaments. The insider edge is off the movie; unlike the book, it isn't about the perfectly poised name-drop. The movie might as well be taking place in Ohio: the substance of it is in its insight into beleaguered characters trying to buttress themselves with fame and money against catastrophes that claim the Hot 100 and Joe Nobody alike.\n\nWagner has assembled the strongest ensemble cast since BOOGIE NIGHTS. Rosanna Arquette is a strange overlap of the luminous and the feral as an art evaluater who makes a melodramatic discovery about her roots that leads to a reconnection with a mystical Jewish practice. Andrew McCarthy, as a fallen eighties actor, goes places you wouldn't imagine him capable of--he suggests a warmer, less remote Edward Norton. As a fortyish Hollywood rich kid who's HIV-positive, Elizabeth Perkins fairly scorches a hole in the movie--the rage of a magnificent woman pushed out of the box before her time lights up every scene she's in. And Amanda Donohoe, Buck Henry and Laraine Newman all have potent brief moments.\n\nThe pitfall to Wagner's genius is generally that he uses his gift for conjuring catastrophe only cruelly--it sometimes feels as if there's no possible response to his books except to faint. Here, he's put that talent to use: he questions the tactics we use to deal with the undealable. In a stroke of ill fortune endemic to the characters in Wagner's books, I'M LOSING YOU was released on the same day as EYES WIDE SHUT and THE BLAIR WITCH PROJECT. I can only hope someone within the sound of my voice will see this beautiful, almost-great movie before, like its characters, it passes into the ether."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sterling Home Entertainment",
        "duration": "PT1M59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1537736985",
        "name": "I'm Losing You",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDA1OWM4MTQtN2YxZS00YmVmLThiMmYtMjUwYmQ2MDJmNzlmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDA1OWM4MTQtN2YxZS00YmVmLThiMmYtMjUwYmQ2MDJmNzlmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:11:35Z",
        "url": "https://www.imdb.com/video/vi1537736985/"
    },
    "url": "/title/tt0142393/"
}