{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "D.J. Vivona",
            "url": "/name/nm0900381/"
        },
        {
            "@type": "Person",
            "name": "Ramona Midgett",
            "url": "/name/nm0585599/"
        },
        {
            "@type": "Person",
            "name": "Angela Zimmerly",
            "url": "/name/nm0956665/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 685,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0078121/"
        },
        {
            "@type": "Person",
            "name": "Eric Stanze",
            "url": "/name/nm0822855/"
        }
    ],
    "datePublished": "1999-08-18",
    "description": "An alternate reality encased in ice, a woman who is turned into a dimension-hopping assassin, and a wizard's apprentice who is so evil he is a common enemy to the angels in heaven and the devils in hell.",
    "director": [
        {
            "@type": "Person",
            "name": "Eric Stanze",
            "url": "/name/nm0822855/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0MTMyMDY5OV5BMl5BanBnXkFtZTcwMTIwNjAzMQ@@._V1_.jpg",
    "keywords": "alternate reality,wizard,hell,angel,dark ages",
    "name": "Ice from the Sun",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "almaric"
        },
        "dateCreated": "2000-02-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0151022/"
        },
        "name": "A visually stunning micro-budget treat",
        "reviewBody": "ICE FROM THE SUN, directed by Eric Stanze, is easily the most visually stimulating movie I have seen in some time. It's just amazing to look at. Stanze paints images that are some of the most fulfilling I've seen and they leave you craving more. What's unbelievable is that he accomplished this on the micro-budget level and may have just raised the levels for all of us.\n\n With this expressionistic tale, style and form play more important roles than content and story. Stanze mixes formats, image textures, and sounds to create some of the most effective horror film atmosphere since Sam Raimi with the original EVIL DEAD.\n\nThere isn't so much a plot as a premise which allow events to unfold. A figure known as The Presence, who was once a wizard's apprentice, has become an entity so powerful and bloodthristy that both the angels in Heaven and demons in Hell fear him. He reigns in a dimension found within magical ice scraped taken form the face of the Sun.\n\nA young woman, Alison, is resurrected after taking her life in order to assassinate The Presence. She is instructed that while she journeys to confront The Presence, there will be 6 other mortals brought to this realm. Their roles are to die and Alison is ordered to not interfere. After all, everyone has a reason for thier existence.\n\nThe stories of The Six make up the bulk of the film. Each character is dealt scenarios that mirror their personalities. A vain woman who uses looks and sex is literally turned into a dog and put out of her misery. Fortunately Stanze sees to it that the rest of the movie isn't so O'Henry-esque and that the scenes are more of a chance to explore human nature.\n\n I do want to pass along a note of warning, this film is graphic. Either extreme gore or abundant nudity populate almost every scene. While none of the images are designed to arouse, they nevertheless leaves the viewer breathless, amazed, and transfixed."
    },
    "url": "/title/tt0151022/"
}