{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tadanobu Asano",
            "url": "/name/nm0038355/"
        },
        {
            "@type": "Person",
            "name": "Nao Ômori",
            "url": "/name/nm1071413/"
        },
        {
            "@type": "Person",
            "name": "Shin'ya Tsukamoto",
            "url": "/name/nm0875354/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 57637,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Ichi the Killer",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008801/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047487/"
        },
        {
            "@type": "Person",
            "name": "Sakichi Sato",
            "url": "/name/nm0766499/"
        },
        {
            "@type": "Person",
            "name": "Hideo Yamamoto",
            "url": "/name/nm1152460/"
        }
    ],
    "datePublished": "2001-12-22",
    "description": "As sadomasochistic yakuza enforcer Kakihara searches for his missing boss he comes across Ichi, a repressed and psychotic killer who may be able to inflict levels of pain that Kakihara has only dreamed of achieving.",
    "director": [
        {
            "@type": "Person",
            "name": "Takashi Miike",
            "url": "/name/nm0586281/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDZmOWE3M2YtMDNkNC00YzFmLTljZTItNTk3NTlkODIxNGE3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "pain,face cut off,extreme film,masochist,misanthropy",
    "name": "Koroshiya 1",
    "original_info": {
        "id": "Ichi the Killer_2001",
        "name": "Ichi the Killer",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aliasanythingyouwant"
        },
        "dateCreated": "2005-11-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0296042/"
        },
        "name": "Commitment to Sadism",
        "reviewBody": "Takashi Miike is a committed sadist; he doesn't just play around with gruesome imagery, he immerses himself in it. Depictions of mutilation, decapitation, and just about every other outrage human beings can perpetrate on other people's bodies (and some they can't, at least not in a universe where the laws of physics as we know them are observed) have become common-place in movies and on television - half the TV shows in prime-time feature corpses in various states of dismemberment, decomposition and God knows what - but these endeavors only employ sadism as a hook, drawing in adult audiences with the promise of seeing something freakish and mortifying. These works are not involved with sadism the way Miike's are, do not take the same insane relish in inventing new tortures, new forms of mortification. Looked at in this light, Miike's Ichi the Killer represents some kind of high-water mark; it strives for a level of sadistic glee above what even most Japanese shockers do (and there are some shockers out there), and achieves what amounts to masterpiece status. Of course the word \"masterpiece\" is employed in strictly relative terms here; Ichi the Killer is not my idea of a masterpiece in the true sense, is not even my idea of what makes for good viewing, but one must acknowledge what Miike has created - nothing more or less than a classic in the field of shock cinema.\n\nIt's inevitable that such a film would be based on a manga (that's a Japanese comic book for those of you not up on dork-culture (anyone reading this review who feels the need to fill me in on the history of manga, by way of explaining to me how they are not simply \"comic books,\" need not bother, for I do not care)), which are apparently viewed as inspiration treasure-troves among those fascinated by nihilism, flesh-mortification, misogyny and the eternally mysterious, ritual-happy world of the Yakuza. Ichi the Killer gives us all of the above in spades. Its title character is a kind of demented anti-super-hero, a dopey, quivering, brainwashed wreck of a kid bent on ridding the world of all bullies, who dresses up in a nutty Darth-Vader-type outfit (sans mask) equipped with retractable blades that spring out when he performs his martial arts maneuvers, neatly slicing and dicing anyone who gets in the way (Ichi is rather indiscriminate about who he kills; we're led to believe that he has been programmed by his vengeful handler to murder only bad guys, but apparently the programming is a bit dodgy). A regular movie would show Ichi lopping people's heads off, severing the occasional jugular, but Miike is not content with such pedestrian amusements, and pushes things to such outrageous levels that our only sane reaction is to laugh. Miike fills whole rooms with dismembered bodies, spilled guts, blood, decapitated heads, achieving a level of carnage so over-the-top that it becomes surrealist comedy, Ichi a figure not of pity or menace but high sadistic hilarity, a murderous, brainwashed Jerry Lewis. As funny as Ichi is, however, he is not the funniest character in the movie; that distinction belongs to Kakihara, a Yakuza whose favorite pastimes are, in order, inflicting pain on other people, and inflicting pain on himself. Kakihara is a bod-mod freak; his face is covered with strategic scars, his body adorned with tattoos, but his most outrageous mods are the slashes in his cheeks, through which he exhales puffs of cigarette smoke, and which allow him to perform feats of mastication unheard of in human history. The acts of mutilation carried out by people on others in Ichi the Killer are scarcely more outrageous than those carried out by Kakihara upon himself; he feels compelled at one point to slice the end of his own tongue off (the ring through the end of it makes a nice handle to hold while doing the slicing; clever boy, that Kakihara).\n\nIf this all sounds like too much - well, it is, and that's kind of the point. Miike, like many of his brethren in Asian film, is obsessed with shock-effects, with pushing outrage to a level heretofore unseen in cinema, and by virtue of films like Ichi the Killer has become the godfather of the form. Sure, there are moments of Ichi the Killer where Miike wants us to be touched - he shows Ichi being nice to a little kid, encouraging us to see Ichi as some poor fool with a kindly heart whose brain has been led astray by evil forces - but Miike is only really serious about visualizing torture, mutilation and extreme bod-mod activities as bloodily as possible. Ichi the Killer is a compendium of outrage, and it succeeds only as long as it's delivering on its promise of ever-more-brutal tortures, ever-more-insane forms of self-inflicted harm. It is, of course, a reprehensible movie filled with simulated acts of violence so sick as to make even battle-hardened extreme-cinema fans squirm in their seats, but it's done with so much humor, so much gleeful flair, that you can't help being taken in by it. Its attitude toward existence is purely nihilistic, but damned if it doesn't have fun exposing the essential cruelty of life, the animal nature of human beings. Miike is one sick puppy, but he seems aware of how sick he is, and doesn't try to dress up his outrages with a lot of pretty visual effects or Hollywood-style gloss. Miike is something of a minimalist when it comes to the camera; he tends just to point it and shoot, punctuating the action with stylistic flourishes rather than drowning his movies in style. It isn't even cinema itself that Miike seems primarily interested in, it's the chance to realize his twisted fantasies. He gets away with it because, unlike a lot of would-be sadists, he owns his fantasies, and seems to acknowledge his own twistedness."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2669525017",
        "name": "Ichi the Killer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjU2YzBkYmEtZjM0OC00MzM2LWEzNTEtZmRlNDkyMDJlYThiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjU2YzBkYmEtZjM0OC00MzM2LWEzNTEtZmRlNDkyMDJlYThiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2018-03-21T17:49:35Z",
        "url": "https://www.imdb.com/video/vi2669525017/"
    },
    "url": "/title/tt0296042/"
}