{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chihiro Suzuki",
            "url": "/name/nm0840555/"
        },
        {
            "@type": "Person",
            "name": "Shinpachi Tsuji",
            "url": "/name/nm0875320/"
        },
        {
            "@type": "Person",
            "name": "Sayaka Ôhara",
            "url": "/name/nm1360441/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 794,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "alternateName": "Ichi the Killer: Episode 0",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028938/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0097219/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000246/"
        },
        {
            "@type": "Person",
            "name": "Sakichi Sato",
            "url": "/name/nm0766499/"
        },
        {
            "@type": "Person",
            "name": "Hideo Yamamoto",
            "url": "/name/nm1152460/"
        }
    ],
    "datePublished": "2002-09-27",
    "description": "Animated prequel to Ichi the Killer (2001), focusing on the origin story of the psychopathic killer Ichi.",
    "director": [
        {
            "@type": "Person",
            "name": "Shinji Ishihira",
            "url": "/name/nm2500877/"
        }
    ],
    "duration": "PT46M",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWEwMDRiMTEtOWMxYS00ZmE2LTlmZWItZmNkMzc0Nzc2ODViXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
    "keywords": "false friend,psychopath,sadomasochism,wetting oneself,good versus evil",
    "name": "Koroshiya 1: The Animation Episode 0",
    "original_info": {
        "id": "Ichi the Killer: Episode Zero_2002",
        "name": "Ichi the Killer: Episode Zero",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2008-02-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0362808/"
        },
        "name": "definitely NOT for kids, first off, and with its flaws, but I liked it in its demented way",
        "reviewBody": "Keep this in mind: this isn't some of the slightly more sanitized Adult Swim material on Cartoon Network. Ichi the Killer Episode 0 is hardcore anime, meant for probably some of the sickest f****s digging around for whatever they can in the most gritty video bins in some dump of a store. In its 40 minute running time the filmmakers backtrack into the life of Ichi, the memorable sadist from Takashi Miike's film. It's basically all about Ichi coming back from repressed teenage years where he's got the mind of a six year old trapped in a body that's half psycho-libido, and half just psycho killer, the two merging most of the time. Ichi is, of course, trained this way, or rather controlled by forces that use him as a killing machine. But we also see a side to an anti-hero that we might never ever see, which makes him so much of a crazy bird that we almost try and move away from the screen as killings go on, loaded with harsh sexual connotations that would probably scar for life some small children if seen.\n\nIt's a violent, insane spectacle, filled with the kind of imagery that only comes out of a comic book that has the reputation to still shock in the 21st century. Lots of sick martial arts moments tinged with just that extra over-the-top belt of surreal mania, as Ichi cries and cries and grows aroused all the more from one killing to the next. I recommend it probably more to those who would already be seeking out anime that's a little more than what would usually be used to seeing; the drawbacks are kinda glaring for most though, including an overbearing soundtrack (sometimes used would have been alright, but this constant starts to take a toll on the narrative, and such awful techno-pop carp), and an ending that seems to cut short just as a whole other narrative seems to start up. It goes without saying I can't see why a show like this wouldn't be picked up - you'd need an exec with the guts of a Tarantino or, for that matter Miike, to see it through without damning the creators to hell and starting a religion to repress this trash. But as trash it is, there's some art stuck in the middle: abstractions done and fashioned as if out of the most deranged fever dream ever conceived in anime.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0362808/"
}