{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kieran Culkin",
            "url": "/name/nm0001085/"
        },
        {
            "@type": "Person",
            "name": "Susan Sarandon",
            "url": "/name/nm0000215/"
        },
        {
            "@type": "Person",
            "name": "Jeff Goldblum",
            "url": "/name/nm0000156/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33946,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026841/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013156/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061179/"
        },
        {
            "@type": "Person",
            "name": "Burr Steers",
            "url": "/name/nm0824882/"
        }
    ],
    "datePublished": "2002-10-04",
    "description": "A young man's peculiar upbringing renders him unable to competently cope with the struggle of growing up.",
    "director": [
        {
            "@type": "Person",
            "name": "Burr Steers",
            "url": "/name/nm0824882/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjcxMjdmZGUtNDIwYS00YjQ5LWI1ZTctYjRlM2NkMTViNDAzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "mistress,sex in bed,panties pulled down,pink panties,black panties",
    "name": "Igby Goes Down",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "intuitive7"
        },
        "dateCreated": "2002-10-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0280760/"
        },
        "name": "Brilliant Filmmaking and Acting",
        "reviewBody": "Ten out of ten. One of the greats, with memorable characters you'll think about for days. This great film got caught in MGM/UA distribution purgatory. If it could have busted out of the indy circuit from day one and gotten into general release, it would have been favorably compared with \"The Graduate\" and Kieran Culkin's performance with Dustin Hoffman's debut performance in that Mike Nichol's classic. MGM/UA blew it.\n\nCulkin is a great young player with a look and resources evoking both Hoffman and Robert Downey. He's naturalistic and great to watch. Smart, funny, urbane writing by first time director Steers is never \"on the nose\". Yet underneath the evasive, sarcastic stripped down dialogue he pulls hard hitting emotions from his ensemble. Not a false or wasted scene and more than a few really powerful ones. Every player is at the top of their game, from Kieran Culkin to Amanda Peet, Jeff Goldblum to Susan Sarandon, Bill Pullman to Claire Danes to Ryan Phillippe. They're obviously guided by a director who knows how to work with an ensemble to get an overall tone.\n\nIgby is the anti Ferris Beuhler - a smart wanna be who's wise mouth and attitude usually piss off those around him - his mother, his brother, his godfather. Torn between those who don't get him and those who do (Peet, Danes), Igby paints all his relationships with the same sarcastic brush, his vulnerability only busting out when he's pushed to the limit. Culkin's perfomance is not to be missed. The key women, Sarandon, Peet and Danes all play fully formed characters. Goldblum is perfect for his role, his usual facile acting style well suited to the South Hampton prince he plays; his best turn in years.\n\nSeers has style and flow, and his final cut is aided by the excellent music choices he and his music supervisor, Nick Harcourt arrived at. Cameron Crowe couldn't do better. The Igby soundtrack is tres alt moderne and every cut is great.\n\nWarning: Actors are blocked (brilliantly) for wide screen format. So this film will suffer from TV / video screen ratios as the Graduate does. Either go see it in the theater NOW or wait for letterbox!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3614359833",
        "name": "Trailer [EN]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2MyYjhjZTQtZWFiZC00ZDA2LTgyOWUtNmZmYTI3ODRmZTUyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2MyYjhjZTQtZWFiZC00ZDA2LTgyOWUtNmZmYTI3ODRmZTUyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-01T14:16:25.231Z",
        "url": "https://www.imdb.com/video/vi3614359833/"
    },
    "url": "/title/tt0280760/"
}