{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gabriella Pallotta",
            "url": "/name/nm0657915/"
        },
        {
            "@type": "Person",
            "name": "Steve Cochran",
            "url": "/name/nm0168215/"
        },
        {
            "@type": "Person",
            "name": "Alida Valli",
            "url": "/name/nm0885098/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5082,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "alternateName": "Il Grido",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079510/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011338/"
        },
        {
            "@type": "Person",
            "name": "Michelangelo Antonioni",
            "url": "/name/nm0000774/"
        },
        {
            "@type": "Person",
            "name": "Elio Bartolini",
            "url": "/name/nm0059026/"
        },
        {
            "@type": "Person",
            "name": "Ennio De Concini",
            "url": "/name/nm0208086/"
        }
    ],
    "datePublished": "1958-10-09",
    "description": "A man wanders aimlessly away from his town, away from the woman he loves, emotionally and socially inactive.",
    "director": [
        {
            "@type": "Person",
            "name": "Michelangelo Antonioni",
            "url": "/name/nm0000774/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzk1OWFkNzAtNWRmOS00YjZhLTk4NTYtNDY3YzMwYzAwY2NlXkEyXkFqcGdeQXVyMzk4OTI2MjM@._V1_.jpg",
    "keywords": "italy,adultery,daughter,death,husband wife relationship",
    "name": "Il grido",
    "original_info": {
        "id": "Il Grido_1957",
        "name": "Il Grido",
        "year": "1957"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2013-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050458/"
        },
        "name": "Depressing and slow but still quite good.",
        "reviewBody": "Some folks watching \"Il Grido\" might be surprised to see some Americans in this Italian film. In the 1950s and 60s, quite a few Italian directors (such as Antonioni and Fellini) cast Americans and had them dubbed into Italian. Most were second and third tier actors at the time (such as Steve Cochran, Richard Basehart and Anthony Quinn) but later even some big name stars performed in the Italian films (such as Burt Lancaster). I think the reason they did this was to attempt to increase the marketability of the movies outside of Italy--and these stars would help.\n\nThe film begins with Irma (Alida Valli) learning that her husband is dead. He apparently has been gone for many years and the interim she's been living with Aldo (Steve Cochran). They even have a child together. Here's the odd part, however, now that she knows she's a widow, she tells Aldo to leave! He is not at all happy and eventually he disappears along with his daughter. For the rest of the film, Aldo and his daughter move from town to town. However, Aldo has difficulty connecting with other women and he rejects opportunity after opportunity for relationships. Instead, he remains socially isolated and depressed.\n\nOverall, you'll probably find this film a bit slow and depressing. While this is usually a big turn-off, it actually works here. Director Antonioni wants to create a depressing portrait of a lost man and does it quite well. The simple piano score sure helps with this. Not a film for everyone but exceptionally well made.\n\nBy the way, at one point in the film, you see folks saying they caught a couple porcupines and were going to eat them. These actually were hedgehogs--you never would hold porcupines the way they did nor do I think you'd eat them! This is simply a mistranslation.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0050458/"
}