{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Susannah York",
            "url": "/name/nm0948772/"
        },
        {
            "@type": "Person",
            "name": "Rene Auberjonois",
            "url": "/name/nm0041281/"
        },
        {
            "@type": "Person",
            "name": "Marcel Bozzuffi",
            "url": "/name/nm0102566/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7252,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056805/"
        },
        {
            "@type": "Person",
            "name": "Robert Altman",
            "url": "/name/nm0000265/"
        },
        {
            "@type": "Person",
            "name": "Susannah York",
            "url": "/name/nm0948772/"
        }
    ],
    "datePublished": "1972-12-18",
    "description": "A schizophrenic housewife kills off each of her terrorizing apparitions, unsure if these demons are merely figments of her imagination or part of reality.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Altman",
            "url": "/name/nm0000265/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjA1OTNhZWUtNjU2ZS00N2FiLTg3MDItYzFiOTZjNWJhNWE4XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "delusion,schizophrenia,husband wife relationship,mental breakdown,adultery",
    "name": "Images",
    "original_info": {
        "id": "Images_1972",
        "name": "Images",
        "year": "1972"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Galina_movie_fan"
        },
        "dateCreated": "2006-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068732/"
        },
        "name": "A brilliant and disturbing journey inside one woman's mind",
        "reviewBody": "\"Images\" is another great movie from the master of the living paintings, Robert Altman. It is a brilliant, scary, beautiful, and very disturbing journey inside one woman's mind that was leaving her as the movie progressed. What we saw was not a ghost story but a very real descent to the world of nightmares and monsters that would not stop torturing the struggling and guilty mind for a second. \n\nSusannah York as Cathryn, a young, beautiful writer who tries to finish a children's book in a remote country home is simply breathtaking. She carries the movie (which only has five characters) almost by herself and being present in every scene, she is equally sympathetic and frightening. In his interview on DVD, Altman mentioned that he had started making the movie in Milan with Sophia Lauren. As much as I admire Lauren, I don't see anyone other than York playing Cathryn. While watching her, I kept thinking of her Alice in Pollack's They Shoot Horses, Don't They? (1969). Alice, one of the participants and victims of a killing dance marathon, loses her mind by the end of the movie and the scene where she breaks down mentally, was heartbreaking. Altman himself reminded me of the witches from Shakespeare's Macbeth that would throw all kinds of ingredients in their cauldron. The director mentioned how he would add the new details to the script as the real life situations changed: York was writing the children's book about Unicorns at the time - we can hear the long parts of her book in the background. I am not too crazy about the book but the idea seems to be brilliant. York had informed Altman that she could not make the movie because she was pregnant but Altman just decided to add her pregnancy to the script. There is some dry humor in the movie - all five characters have the first names of the actors who played them: Susannah played Cathryn and young Cathryn Harrison plays a girl named Susannah, Rene Auberjonois, Marcel Bozzuffi, and Hugh Millais played three men in Cathryn's life - Hugh, the husband, Rene - the neighbor, and Marcel, her dead lover (who was quite alive for a dead man, at least in her memory). John Williams wrote an absolutely unforgettable score for the film (it is not a melody, rather some strange, persistent, scary, and disturbing sounds - very experimental at the time, it is still quite unusual). \n\nAs for its visual site - the film that was made during one wet November in Ireland is brilliantly dark and hypnotizingly beautiful. I am jealous of everyone who was able to see it in all its glory on the big screen at the theater - it would be impossible to forget. \n\n8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Schizophrenic housewife, engulfed by terrorizing apparitions, kills off each, unknowing if these demons are merely figments of her hallucinatory imagination or part of reality.",
        "duration": "PT3M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3599745305",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk4NDJiYWMtY2ExYy00Y2Q5LWExZDMtMWI4YjI3MjQ4YTQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk4NDJiYWMtY2ExYy00Y2Q5LWExZDMtMWI4YjI3MjQ4YTQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-13T13:42:13.077Z",
        "url": "https://www.imdb.com/video/vi3599745305/"
    },
    "url": "/title/tt0068732/"
}