{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Juliette Binoche",
            "url": "/name/nm0000300/"
        },
        {
            "@type": "Person",
            "name": "Samuel L. Jackson",
            "url": "/name/nm0000168/"
        },
        {
            "@type": "Person",
            "name": "Brendan Gleeson",
            "url": "/name/nm0322407/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2826,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "In My Country",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094865/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049118/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021568/"
        },
        {
            "@type": "Person",
            "name": "Antjie Krog",
            "url": "/name/nm1310451/"
        },
        {
            "@type": "Person",
            "name": "Ann Peacock",
            "url": "/name/nm0668754/"
        }
    ],
    "datePublished": "2004-05-07",
    "description": "A journalist and a poetess meet during the hearings of South African Truth and Reconciliation Commission.",
    "director": [
        {
            "@type": "Person",
            "name": "John Boorman",
            "url": "/name/nm0000958/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzM5MDg1NjIxMl5BMl5BanBnXkFtZTgwODkyNDM2MTI@._V1_.jpg",
    "keywords": "watching tv,washington post,fire in a trash can,interracial romance,victim",
    "name": "Country of My Skull",
    "original_info": {
        "id": "In My Country_2004",
        "name": "In My Country",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SingleSimonSays"
        },
        "dateCreated": "2004-02-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0349260/"
        },
        "name": "Political drama goes romantic",
        "reviewBody": "Country of My Skull had its world premiere at the 2004 Berlin Film Festival.\n\nOne of the most eagerly awaited films of the year, coming from veteran director John Boorman, has turned out to be a major disappointment. In retrospect it is not hard to see why, it should have been predicted, but the fascinating subject matter made it seem like Boorman was going to give us that rare treat - a balanced political drama, with insight and intelligence.\n\nThe problems with Country of My Skull all originate with the screenplay. It is loosely based on the novel of the same name by Antjie Krog. However Krog's novel was a non-fiction account of South Africa's Truth and Reconciliation Commission (TRC) set up in the aftermath of Apartheid. The screenplay by Ann Peacock is a mere fiction where a lacklustre romance takes precedence over the main events.\n\nSamuel L Jackson stars as Langston Whitfield a New York Times journalist who has been sent to South Africa to write a feature on the TRC. Here he meets Afrikaans poet and Journalist Anna Malan played by Juliette Binoche. At first the pair clash over their very different attitudes but as the real life accounts of torture and suffering inflicted during the Apartheid regime are recounted their attitudes towards each other soften and they fall in love even though both are married.\n\nThis is my biggest issue with the film. Peacock and Boorman for some utterly unknown reason have seen fit to invent a romance between the protagonists. This fictional romance muddles the intent of the film and belittles the very serious nature of a body such as the Truth and Reconciliation commission. I also have problems with the use of the American journalist. While he is obviously used in the screenplay as an outsider to explain the aim of the TRC to us, the uninitiated viewers, his reaction to what he is hearing is hard to credit.\n\nMalan and Whitfield spend the first part of the film literally sparring over every aspect of the TRC. To him, any commission that doesn?t punish the perpetrators of such crimes is worthless, while for her reconciliation is more important. She is horrified by what she hears about a country she is passionate about. This should make for very interesting drama. However the dialogue between the pair is utterly ridiculous and often sounds more like two politically correct politicians than supposedly intelligent journalists. It is idealistic, unnatural and even risible.\n\nAs part of his assignment Whitfield tracks down the Apartheid police chief De Jaeger played by Brendan Gleeson. Whitfield conducts a series of interviews with this man, which are meant to illustrate the pure evil of the Apartheid regime, however the character as written by Peacock and played by Gleeson is more like an out and out Nazi baddie than a credible perpetrator of such crimes. Boorman has spiced these interviews throughout the film. They are distracting and somewhat simplistic.\n\nAll too often the film takes pedestrian material and adorns it with simplistic political motives. The use of a flat tyre and a local bar give Malan and Whitfield a chance to spend time together and soften towards each other as they embark on an affair which becomes the centre of the film. It is hard to credit that this would happen. Why Boorman and Peacock have done this is beyond me. The type of audience that would see this movie surely does not need romance to actually enjoy a film.\n\nThe only place the film scores any kudos is in the courtrooms of the TRC where horrifying evidence is recounted to a nation. However as the other parts of the film are so weak it is easy to be cynical about these sequences as they seem over manipulative and again badly written dialogue is a major stumbling point. Their content is however undeniably powerful.\n\nJackson and Binoche, fine actors when given the correct material, struggle with unforgiving roles. Both characters are under-written and remote. Jackson?s change of heart about events is hard to credit. Binoche struggles with an Afrikaans accent (sometimes doing surprisingly well for someone who is not a native English speaker). However her character is not well defined and is constantly laden down with the worst dialogue.\n\nCertainly Boorman and Peacock?s intentions were genuine, but the screenplay should have focused entirely on the TRC, allowing the drama to emanate from that. Instead we are given a rather insipid love story that reduces the impact considerably. In doing this Boorman has failed to use his excellent cast to anything like their full potential and has undermined the whole project. A lot more work on the screenplay and this had the makings of a wonderful film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2057830681",
        "name": "In My Country",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2ZmYjg5ZGItYjAxNS00NTkxLWEyYWQtZWFmMmI5NTVmZmRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2ZmYjg5ZGItYjAxNS00NTkxLWEyYWQtZWFmMmI5NTVmZmRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:11:56Z",
        "url": "https://www.imdb.com/video/vi2057830681/"
    },
    "url": "/title/tt0349260/"
}