{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Wood",
            "url": "/name/nm0939888/"
        },
        {
            "@type": "Person",
            "name": "Peter Connolly",
            "url": "/name/nm1618723/"
        },
        {
            "@type": "Person",
            "name": "John Chadwick",
            "url": "/name/nm1616480/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 288,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "1985-02-24",
    "description": "Over six hour-long programs, Michael Wood marshals the disparate strands of evidence to present as fully rounded a portrait as possible of both the historical and the legendary city of Troy, its central place in Western culture, a...",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUzNjgyMjAwNF5BMl5BanBnXkFtZTcwMTQ0MjUyMQ@@._V1_.jpg",
    "keywords": "trojan war,iliad,ancient history,ancient troy,archaeology",
    "name": "In Search of the Trojan War",
    "original_info": {
        "id": "In Search of the Trojan War_2004",
        "name": "In Search of the Trojan War",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "winandine"
        },
        "dateCreated": "2004-09-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0409571/"
        },
        "name": "Archaeological Search for the Truth Behind the Iliad",
        "reviewBody": "Friend rented this DVD from a local eclectic video shop. The title made it sound very dry, but we started with the special feature of Michael Wood's commentary on the making of the original television series. His enthusiasm was contagious, and the series proved to be very satisfying.\n\nWood started in Berlin where some artifacts from Troy remained after the devastation of World War II. From there he traveled to the Mediterranean, Turkey, and Wales to explore how much truth was in the oral story told by Homer in the Iliad. Even for non-archeology buffs, Wood brings to life the heartbreak and duplicity of Schliemann, the first to excavate (and possibly destroy portions of) Troy. This is followed by Wilhelm Dörpfeld, Schliemann's heir, who explored further around the site, exposing what might be the Troy described by Homer. Thirdly discussed is the influential Britan, Arthur Evans, who unearthed Minos at Minos at Knossos. Lastly, we learn about Carl Blagan, an American who extracted further evidence from Troy.\n\nThis series includes a fascinating look into a young science, archeology, and the role that speculation and interpretation plays in archaeological investigations. It is interesting to hear that some of Wood's speculation has since become accepted as a probable historical version.\n\nI was a little disappointed that the series did not venture further into the 'cracking' of the Linear B hieroglyphics. However, it does a great job of proving that the Iliad was based upon fact: There was a Trojan society, and that for example, Hector and Paris were real people. From the written history of the Hittites, we gain a tantalizing first- and second-hand documentation of Greek and Trojan history. Who knew that cuneiform writing could be so interesting?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0409571/"
}