{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sam Neill",
            "url": "/name/nm0000554/"
        },
        {
            "@type": "Person",
            "name": "Jürgen Prochnow",
            "url": "/name/nm0001638/"
        },
        {
            "@type": "Person",
            "name": "Julie Carmen",
            "url": "/name/nm0138388/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 72992,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Person",
            "name": "Michael De Luca",
            "url": "/name/nm0006894/"
        }
    ],
    "datePublished": "1995-02-03",
    "description": "An insurance investigator begins discovering that the impact a horror writer's books have on his fans is more than inspirational.",
    "director": [
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjNkMWVkYTUtYzUwZi00ZWI1LTg3MzktZjVkNDQxZjFhOTY1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "fantasy becomes reality,small town,insanity,monster,novelist",
    "name": "In the Mouth of Madness",
    "original_info": {
        "id": "In the Mouth of Madness_1995",
        "name": "In the Mouth of Madness",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2007-08-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113409/"
        },
        "name": "Changing the Reality",
        "reviewBody": "The efficient and skeptical freelance insurance investigator John Trent (Sam Neill) is hired by the publisher Jackson Harglow (Charlton Heston) to find where the famous writer Sutter Cane (Jürgen Prochnow) might be. After writing a series of best-sellers in the horror genre, affecting the reason and causing disorientation, memory loss and paranoia in the readers, Sutter has simply vanished near the release of his new novel, \"Horror in Hobb's End\". There is a mass hysteria of his anxious fans waiting for the new release, and John believes that his disappearance is a strategy of marketing. John follows his instincts and travels with Cane's editor, Linda Styles (Julie Carmen), to New Hampshire seeking for the apparently fictional town of Hobb's End. While driving along the night, Linda reaches the Hobb's End, and John discloses that Sutter Cane has unleashed a powerful evil force in the black church of the mysterious town, and his twisted imagination is changing the reality and perception of those that read his novels.\n\n\"In the Mouth of Madness\" is a journey to fear and madness through the darkness of a twisted mind of a writer. This story follows the style of \"Twilight Zone\" and actually shows how a writer with the support of the media is able to manipulate hearts and minds. Further, there is a certain criticism in the values and standards of the society where those who think differently or have a different behavior are outcast or even considered crazy. John Carpenter is one of my favorite directors and Sam Neil is perfect in the role of a skeptical man, used to find schemes and con everywhere, having difficulties to accept what is happening. The conclusion is very dark and without perspective to mankind. My vote is seven.\n\nTitle (Brazil): \"À Beira da Loucura\" (\"On the Edge of Madness\")\n\nNote: On 23 June 2015 I saw this movie again. Note: On 20 September 2020 I saw this movie again.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Amazon Original \"Carnival Row\" channels the best aspects of horror-legend HP Lovecraft for a twisty whodunnit fairytale. On this spoiler-filled IMDbrief, we break down how Season One of \"Carnival Row\" gets Lovecraft right and what \"critch\" to expect in Season Two.",
        "duration": "PT3M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1739308825",
        "name": "How \"Carnival Row\" Gets Lovecraft Right",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTEzYTg0NjItODVkZS00ZGM1LTkzMDYtMjEwMTMyNDFkNjk0XkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTEzYTg0NjItODVkZS00ZGM1LTkzMDYtMjEwMTMyNDFkNjk0XkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg",
        "uploadDate": "2019-09-12T00:32:57.592Z",
        "url": "https://www.imdb.com/video/vi1739308825/"
    },
    "url": "/title/tt0113409/"
}