{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Henry Darger",
            "url": "/name/nm1503462/"
        },
        {
            "@type": "Person",
            "name": "Dakota Fanning",
            "url": "/name/nm0266824/"
        },
        {
            "@type": "Person",
            "name": "Larry Pine",
            "url": "/name/nm0683978/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2207,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032062/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0115510/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002222/"
        },
        {
            "@type": "Person",
            "name": "Henry Darger",
            "url": "/name/nm1503462/"
        },
        {
            "@type": "Person",
            "name": "Jessica Yu",
            "url": "/name/nm0950506/"
        }
    ],
    "datePublished": "2008-03-29",
    "description": "A documentary on Henry Darger, visionary artist, janitor, and novelist.",
    "director": [
        {
            "@type": "Person",
            "name": "Jessica Yu",
            "url": "/name/nm0950506/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUwMjU5MTk0Nl5BMl5BanBnXkFtZTcwOTM0NjcyMQ@@._V1_.jpg",
    "keywords": "poverty,artist,recluse,chicago illinois,art",
    "name": "In the Realms of the Unreal",
    "original_info": {
        "id": "In the Realms of the Unreal_2004",
        "name": "In the Realms of the Unreal",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "F Gwynplaine MacIntyre"
        },
        "dateCreated": "2005-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0390123/"
        },
        "name": "Whose little girl are you?",
        "reviewBody": "THIS REVIEW CONTAINS CONTENT WHICH SOME READERS MAY FIND SEXUALLY DISTRESSING.\n\nHenry Darger (1892-1973) remains the most startling exemplar of 'outsider art': art created by an individual who has absolutely no contact with the formal art world. Darger, a native of Chicago, suffered an extremely abusive childhood ... in which he was institutionalised in an asylum for feeble-minded children, even though he may have been of above-average intelligence. He spent almost his entire adult life as a janitor in a Catholic hospital, never earning more than $25 weekly. During these decades, he obsessively attended Mass thrice daily (four times on the Sunday) and typed a 15,000-page novel which nobody has read in its entirety. (I've read four pages of the impenetrable typescript which resides at the American Museum of Folk Art: that's all I could manage.) What has brought Darger so much posthumous attention is his artwork: obsessive drawings of little girls, brightly coloured, on long sheets of butcher's paper. Many of Darger's girls (traced from better artists' work) wear elaborate frocks. Others, drawn free-hand by Darger, have bizarre animal appendages: butterfly wings, rams' horns. Speaking of appendages: many of these little girls are naked ... and they have little-boy penises. Darger's murals and his multi-volume novel document a fantasy realm in which heroic little Christian girls are eternally at war with pagan soldiers.\n\nJessica Yu's documentary 'In the Realms of the Unreal' (a shortened version of the title of Darger's novel) attempts to make sense of Darger's life, art and obsessions. Darger was not precisely a recluse: he appeared in public but interacted very little. Because Yu has no footage of Darger, and only a handful of photographs of him, she resorts to re-enactments. We keep hearing a male voice-over that purports to be Darger, speaking about himself. Only in the end credits do we learn that this is an actor (Larry Pine), reading fictionalised narration scripted by Yu. The immensely talented child actress Dakota Fanning also narrates: the decision to use a little girl for this task is exactly right, and Fanning reads her material splendidly ... but Yu has written text for her which sounds improbably mature from such a young narrator.\n\nYu interviews a surprisingly large number of the very few people who actually knew Darger. (They disagree on how to pronounce his name.) I agree with the interviewee who theorises that Darger drew penises on his little girls because he was entirely innocent (and ignorant) of the female anatomy, and he sincerely believed that little girls' sexual equipment looked like little boys'. Many of the little girls in Darger's art (and in his novel) are tortured or brutally murdered by men in military uniforms with mortarboard hats, yet it's clear that Darger's sympathies are with the little girls. He seems to be repelled, not aroused by the violence which he fictionally inflicts on them.\n\nI thought I knew all the weird stories about Darger, but this documentary springs a new one. Apparently, when Darger was alone in his bedsit, he was overheard through the walls by his landlords and the other boarders: having loud arguments with himself, speaking in different voices and accents, sometimes in unknown languages. It wouldn't surprise me if Darger had multiple personalities. Also, I hadn't known (until I saw this film) that Darger's imaginary world was so detailed that he kept lists of the casualties on his fictional battlefields, and financial accounts of the warfare's expenses ... both of these figures exceeded the thousands of millions!\n\nI was intrigued to learn that the Chicago-born Darger attempted to reinvent himself as Henry Dargarus, native of Brazil (where the nuts come from). This behaviour is absolutely typical of someone who experienced long-term sexual abuse in childhood, and who desires a new identity as a means to blot out those memories.\n\nFor most of his life, Darger lived in one room of the house of Nathan Lerner, an aspiring artist in his own right who ultimately made his impact in the art world as the curator of Darger's work. Lerner's widow is interviewed here. Yu mentions that the Lerners eventually subsidised Darger's rent, but doesn't mention that they later made a fortune by auctioning many of Darger's girlscapes after his death.\n\nFilmmaker Yu scrupulously documents Darger's obsessions. One of these was for weather patterns, specifically storms. (Darger was present when a cyclone levelled an Illinois town in 1913.) Another of his obsessions was rather odder. In 1911, a five-year-old Chicago girl named Elsie Parobek was abducted and strangled; the case remains unsolved. Darger was in Chicago at the time, age 19, and he obsessed over this girl for the rest of his life. Some Dargerphiles theorise that he may have killed her. But there is no evidence for that, and Yu's film commendably sticks to the known facts.\n\nWas Darger a paedophile? From what I've read, I believe that he was sexually aroused by little girls (and may have wanted to *be* one), but that his desire to protect girls (including Parobek) was sincere, and that he would have been genuinely repelled by the thought of sexual activity with children. We can't know for sure, but Darger was almost certainly a virgin when he died, precisely one day after his 81st birthday.\n\n'In the Realms of the Unreal' uses several gimmicky visual devices. The decision to make animated cartoons from several Darger murals is a good one, and the stiff-legged 'lazy' animation technique used here is appropriate to the material. Less commendable is Yu's decision at several points to use new artwork that paraphrases Darger's themes; audiences will mistake these images for actual Darger artwork. I'll rate this powerful documentary 8 points out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Wellspring",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3232629017",
        "name": "In the Realms of the Unreal",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTE3ZDhkZGQtMWMxMS00MjU4LWJjZGYtMzA5YzMwMzY5NzhjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTE3ZDhkZGQtMWMxMS00MjU4LWJjZGYtMzA5YzMwMzY5NzhjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:33:22Z",
        "url": "https://www.imdb.com/video/vi3232629017/"
    },
    "url": "/title/tt0390123/"
}