{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cynthia Khan",
            "url": "/name/nm0451195/"
        },
        {
            "@type": "Person",
            "name": "Hiroshi Fujioka",
            "url": "/name/nm0297800/"
        },
        {
            "@type": "Person",
            "name": "Stuart Ong",
            "url": "/name/nm0950954/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 522,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "In the Line of Duty III",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020462/"
        },
        {
            "@type": "Person",
            "name": "Kiu-Ying Chan",
            "url": "/name/nm1045012/"
        }
    ],
    "datePublished": "1988-09-23",
    "description": "Genji Nakamura and his soul-mate and partner Michiko Nishiwaki are thieves for the notorious Red Army terrorist organization in Japan. After pulling off the jewelry heist of the century (in which dozens of people get killed includ...",
    "director": [
        {
            "@type": "Person",
            "name": "Arthur Wong",
            "url": "/name/nm0938939/"
        },
        {
            "@type": "Person",
            "name": "Brandy Yuen",
            "url": "/name/nm0950710/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWUxZGFjNzMtYzEwNC00ODM4LWE5NjEtNjJkY2E2MjBlNGE4XkEyXkFqcGdeQXVyMTc3MjY3NTY@._V1_.jpg",
    "keywords": "girls with guns,pantyhose,woman rips open her skirt,female police officer,pantyhose legs",
    "name": "Huang jia shi jie zhi III: Ci xiong da dao",
    "original_info": {
        "id": "In the Line of Duty 3_1988",
        "name": "In the Line of Duty 3",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "paul_haakonsen"
        },
        "dateCreated": "2022-05-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095337/"
        },
        "name": "Rather generic late 1980s Hong Kong action movie...",
        "reviewBody": "I have to say that this 1988 Hong Kong action movie titled \"Huang Jia Shi Jie Zhi III: Ci Xiong Da Dao\" (aka \"In the Line of Duty III: Force of the Dragon\") was a pretty generic late 1980s Hong Kong action movie. But hey, at least you know what you are getting here if you opt to sit down and watch this movie.\n\nWriter Kiu-Ying Chan churned out a fairly generic storyline for this movie, and it felt more like a collection of random action scenes put together and then directors Arthur Wong and Brandy Yuen laced a narrative upon those action scenes. I felt like the storyline was lacking greatly in contents, and the movie felt sort of half-hearted.\n\nThe character gallery in \"Huang Jia Shi Jie Zhi III: Ci Xiong Da Dao\" was incredibly one-dimensional. I have to admit that I didn't invest anything into any of the characters, as they were generic, lacking depths or personalities, and essentially were all one and the same. And this was a major hindrance for the overall enjoyment of the movie.\n\nIt should be noted, however, that \"Huang Jia Shi Jie Zhi III: Ci Xiong Da Dao\" does have an okay cast ensemble. The leading performances were adequate, but the movie does have a treat for fans of the Hong Kong cinema, with appearances from Paul Chun, Dick Wei, Sandra Kwan Yue Ng, Eric Tsang and Richard Ng.\n\nThere is a good amount of action in the movie, and that definitely helps to make the movie bearable to sit through, along with the appearances of some very familiar faces on the cast list.\n\nWhile I managed to sit through \"Huang Jia Shi Jie Zhi III: Ci Xiong Da Dao\", I was only mildly entertained. This is not an outstanding movie in the Hong Kong action genre, and most definitely not from the late 1980s. This is the type of movie that you watch once and never again. And believe it or not, then now in 2022 was the first time I watched this movie, much less even heard about it.\n\nMy rating of \"Huang Jia Shi Jie Zhi III: Ci Xiong Da Dao\" lands on a generous four out of ten stars.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0095337/"
}