{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tatsuya Fuji",
            "url": "/name/nm0297686/"
        },
        {
            "@type": "Person",
            "name": "Eiko Matsuda",
            "url": "/name/nm0559405/"
        },
        {
            "@type": "Person",
            "name": "Aoi Nakajima",
            "url": "/name/nm0620026/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21468,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "In the Realm of the Senses",
    "contentRating": "X",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048010/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000552/"
        },
        {
            "@type": "Person",
            "name": "Kôji Wakamatsu",
            "url": "/name/nm0906709/"
        },
        {
            "@type": "Person",
            "name": "Nagisa Ôshima",
            "url": "/name/nm0651915/"
        }
    ],
    "datePublished": "1977-04-01",
    "description": "A passionate telling of the story of Sada Abe, a woman whose affair with her master led to an obsessive and ultimately destructive sexual relationship.",
    "director": [
        {
            "@type": "Person",
            "name": "Nagisa Ôshima",
            "url": "/name/nm0651915/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTg4MGY0YjMtN2Y2MC00MjQ4LTk5MzEtNDdkZjliMGZmMDU0XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "sexual obsession,erotic asphyxiation,outdoor sex,possessive love,female full frontal nudity",
    "name": "Ai no korîda",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Infofreak"
        },
        "dateCreated": "2001-10-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074102/"
        },
        "name": "Overshadowed by the pointless \"art\" versus \"porn\" debate!",
        "reviewBody": "'Empire Of The Senses' is one of the least seen and much debated movies of the Seventies. \"Least seen\" because in many countries, including the one I live in, it has been banned, or only available in censored versions for many years. This movie divides people - those that like it hail it as ART, those that don't dimiss it snobbishly as PORN. Both camps are fooling themselves! 'Empire Of The Senseless' is BOTH. \n\nIs it \"serious\"? Yes. Is it voyeuristic and prurient? Yes. Is it a masterpiece? Not quite. Is it worth watching? Very much so. In fact I'd say it was essential viewing for anyone interested in extreme or taboo-breaking movies. \n\nThe Seventies were the decade where the boundaries of screen sex, violence and disturbing imagery were repeatedly stretched. Peckinpah's 'Straw Dogs' and 'Bring Me The Head Of Alfredo Garcia', Bertolucci's 'Last Tango In Paris', Scorsese's 'Taxi Driver', Kubrick's 'A Clockwork Orange',were all milestones, and the the art movies of Herzog, Warhol, Pasolini, and Jodorowsky battled it out with the horror and exploitation of Russ Meyer, Dario Argento, John Waters,and David Cronenberg. Add to that the unexpected crossover success of 'Deep Throat' and the very existence of shockers like 'Ilse, She Wolf Of The SS' and 'Cannibal Holocaust', and what do you get? The artificial and meaningless divisions of genres, \"high art\" vs \"trash\", new ways of thinking vs new ways of making money, it was all on the table. For one brief decade it looked like a brave new world.\n\n Then everything that was gained was lost - Spielberg and Simpson/Bruckheimer cleaned up (financially and aesthetically), and things have never been the same since. Watch 'Empire Of The Senseless' with that in mind. It may be flawed - you'll be alternatively fascinated and bored - but it is an important movie from an important period in movie history."
    },
    "url": "/title/tt0074102/"
}