{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Meg Ryan",
            "url": "/name/nm0000212/"
        },
        {
            "@type": "Person",
            "name": "Mark Ruffalo",
            "url": "/name/nm0749263/"
        },
        {
            "@type": "Person",
            "name": "Jennifer Jason Leigh",
            "url": "/name/nm0000492/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25148,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010568/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022869/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027008/"
        },
        {
            "@type": "Person",
            "name": "Jane Campion",
            "url": "/name/nm0001005/"
        },
        {
            "@type": "Person",
            "name": "Susanna Moore",
            "url": "/name/nm0601912/"
        },
        {
            "@type": "Person",
            "name": "Stavros Kazantzidis",
            "url": "/name/nm0443613/"
        }
    ],
    "datePublished": "2003-10-31",
    "description": "New York City writing professor, Frannie Avery, has an affair with a police detective who is investigating the murder of a beautiful young woman in her neighborhood.",
    "director": [
        {
            "@type": "Person",
            "name": "Jane Campion",
            "url": "/name/nm0001005/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjc5NzdiMjYtMWE5NC00MWEzLThiNmYtZjE4MjllZjgwYTU5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "blow job,oral sex,fellatio,black panties,lust",
    "name": "In the Cut",
    "original_info": {
        "id": "In the Cut_2003",
        "name": "In the Cut",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "squirrelsatemynuts"
        },
        "dateCreated": "2005-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0199626/"
        },
        "name": "Mediocre film; amazing sound design and nude scene",
        "reviewBody": "\"In the Cut\" features solid acting and a nice color scheme but is mostly unremarkable in terms of story, script and visuals. Savvy viewers will recognize most of the plot elements and characters from other recent thrillers. The film does, however, have two remarkable elements: an amazing 5.1-channel sound mix and a nude scene that is notable not for its pornographic or fantasy-fulfilling qualities but for its stark realism.\n\nAnyone who appreciates film sound should watch (or rather, listen to) \"In the Cut\" because it's one of the few existing films that uses 5.1-channel sound for more than SFX gimmicks or making sure the Dolby Digital logo appears on its DVD case. The film creates real ambiance and mood with its sound mix, which helped suck me into the story world and get a sense of the characters' environment. I first noticed this when Frannie descends the stairs in the restaurant (just before she sees the mysterious villain). As she walks through the noisy crowd and down the stairwell, the conversations, bustling and other background fade from the front to rear channels and mix with her footsteps as she descends. This, to me, is much more elegant use of 5.1-channel surround than sticking a few whizzing noises in the rear channels when a spaceship flies off the top edge of the frame. \"In the Cut\" makes full use of its available channels, which is more than 99% of high-budget films can say.\n\nThe other piece of the film that stuck with me was the nude scene with Frannie and Malloy that follows their inevitable hook-up. It's so rare to see a Hollywood nude scene that features characters just lounging with nothing on and in such an unromantic setting. It's especially amazing with an established star like Meg Ryan. There are no mysterious L-shaped sheets to hide their bodies but there is also no sense that Campion left them nude to attract voyeurs to her film. The characters don't assume erotic poses; they simply act as if they've already seen what they have to show each other, as most people do after sex. I don't often praise realism in films, especially stupid thrillers, but this scene stood out as much as the excellent sound design. If only the rest of the film could live up to those standards.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT1M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3062956313",
        "name": "In the Cut",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjEwMDlmNzctN2Y4Mi00MjdmLWJkMjAtYzU4ZmUyYjU5YTI2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjEwMDlmNzctN2Y4Mi00MjdmLWJkMjAtYzU4ZmUyYjU5YTI2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:44:27Z",
        "url": "https://www.imdb.com/video/vi3062956313/"
    },
    "url": "/title/tt0199626/"
}