{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Diana Rigg",
            "url": "/name/nm0001671/"
        },
        {
            "@type": "Person",
            "name": "Pamela Brown",
            "url": "/name/nm0114386/"
        },
        {
            "@type": "Person",
            "name": "Gwen Watford",
            "url": "/name/nm0914220/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 293,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060242/"
        },
        {
            "@type": "Person",
            "name": "James Costigan",
            "url": "/name/nm0182689/"
        },
        {
            "@type": "Person",
            "name": "Rumer Godden",
            "url": "/name/nm0323869/"
        }
    ],
    "datePublished": "1975-02-27",
    "description": "A well-to-do London businesswoman gives up her comfortable life, including the man who loves her, to become a cloistered Benedictine nun.",
    "director": [
        {
            "@type": "Person",
            "name": "George Schaefer",
            "url": "/name/nm0769615/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAwOTQ4Mzg1M15BMl5BanBnXkFtZTcwOTU1NzUxMQ@@._V1_.jpg",
    "keywords": "nun,priest,monk,catholic priest,bishop",
    "name": "In This House of Brede",
    "original_info": {
        "id": "In This House of Brede_1975",
        "name": "In This House of Brede",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shrine-2"
        },
        "dateCreated": "2000-09-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0073160/"
        },
        "name": "A different kind of challenge",
        "reviewBody": "Diana Rigg made a peerlessly suave secret agent. For the 60's British TV series \"The Avengers,\" she never won a single Emmy (They always went to Martin Landau's wife-at-the-time Barbara Bain for \"Mission Impossible.), but there was no one who matched the simmering confidence and shimmering elegance of Mrs. Emma Peel. No matter what the challenge put before her, Rigg remained unshaken.\n\n\"In This House of Brede\" posed a much different challenge than the ones to which Rigg was accustomed: doffing the miniskirts and knee-length boots and playing a woman who had lost both husband and daughter and decides to leave her successes in the workplace for life as a Benedictine nun. Her Dame Philippa is well-schooled (She already knows Latin before entering the convent.); experienced in the business world (So she intimidates Dame Agnes (Pamela Brown), one of the senior nuns who feels her advanced age poses a serious problem at being settled in the cloister.), and very determined (although she has barely recovered from the loss of her daughter in a car accident). The superior of Brede who encouraged Philippa to consider religious life dies as she enters the postulancy. She's lucky, however, that the congregation has the good sense to elect a kind, fair-minded woman (Gwen Watford) to lead them, and help Philippa through the most trying times of her novitiate. It's the challenge to form a loving, but disinterested life at Brede that threatens to capsize Philippa's hard-earned equanimity, when a beautiful, young prospect (Judy Bowker who was equally as captivating in \"The Shooting Party\") arrives. Memories of her daughter well up to recall feelings she thought she had put behind her years ago.\n\nIt's easy to become impatient with this movie's prudence; the in-fighting and petulance among the nuns are dispelled without much fuss. \"In This House of Brede\" never makes much of these women's triumphs. To find any dramatic tension, you need to look to Rigg's pale, drawn face or Brown's wide, but tired and stricken eyes. Yet the combination of this even mindedness and struggle is simultaneously calming and tonic. The gaggle of giggling novices Dame Philippa ushers back to their native Japan bring a sense of renewed hope to the order. Even Dame Agnes with her rankled nerves, and hurt feelings, and petty jealousies finds peace in the end. It gives the rest of us cause for celebration: that, with God's help, any of us can conquer ourselves--and, we hope, as these women do--elegantly.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0073160/"
}