{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel Day-Lewis",
            "url": "/name/nm0000358/"
        },
        {
            "@type": "Person",
            "name": "Pete Postlethwaite",
            "url": "/name/nm0000592/"
        },
        {
            "@type": "Person",
            "name": "Alison Crosbie",
            "url": "/name/nm0188949/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 178633,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019015/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Gerry Conlon",
            "url": "/name/nm0174840/"
        },
        {
            "@type": "Person",
            "name": "Terry George",
            "url": "/name/nm0313623/"
        },
        {
            "@type": "Person",
            "name": "Jim Sheridan",
            "url": "/name/nm0006487/"
        }
    ],
    "datePublished": "1994-02-25",
    "description": "A man's coerced confession to an I.R.A. bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Sheridan",
            "url": "/name/nm0006487/"
        }
    ],
    "duration": "PT2H13M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmYyOTgwYWItYmU3Ny00M2E2LTk0NWMtMDVlNmQ0MWZiMTMxXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "prison,father son relationship,based on true story,wrongfully convicted,wrongfully convicted of murder",
    "name": "In the Name of the Father",
    "original_info": {
        "id": "In the Name of the Father_1993",
        "name": "In the Name of the Father",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oneflewovertheapocalypse"
        },
        "dateCreated": "2004-04-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107207/"
        },
        "name": "Powerful and Touching",
        "reviewBody": "Name of the Father came out one year before The Shawshank Redemption and is bar none the better film. Shawshank is a great film but Name of the Father has more of human story to it. Daniel Day Lewis is a great actor with more potential now than he did when he won his first Oscar for My Left Foot and since then he has never starred in a film which he has acted badly in. Some of the stories have not been amazing but his acting makes up for it. This was the second time That Daniel Day Lewis and Jim Sheridan have come together to make a film. In all they have done three but Name of the father is by far the best. Pete Postlethwaite is another example of fine acting as he is the best actor in England since who ever was the last greatest actor.\n\nDaniel Day Lewis plays Gerry Conlon who is a seventies hippie who doesn't want to grow up. He has had so many troubles at home his father\n\nGiuseppe played by Postlethwaite decides to pack him off to London for his own safety and not become a lost soul amongst the troubles in Belfast. But when Gerry gets there he might as well wish he never went there in the first place as the trouble from Belfast follows him and before you know it a bomb goes off in a pub near to where he is staying and is not long arrested for the bomb along with his friends and family including his father.\n\nFrom there we are taken into this grieving story of strength, hope, tragedy and family. The story between father and son in jail is more touching and compelling than any love story you will ever see because these two men who have never really seen eye to eye are forced to confront each other's feeling and face up to where they stand in the world. Also Pete Postlewaite reminds me of my own father and my grandfather and yours two. He plays Giuseppe so well so would have thought he was the old guy living next door to you or the man you look up to as a father and spend time with as a granddad. What you have to remind yourself is that the movie is a true story of the Guilford Bombing and the men who paid the price for it. Whether or not you believe Gerry and Giuseppe were guilty of the Guilford Bomb is not the case in the film as it's more about the characters and there trials and tribulations.\n\nOne film that will always be remembered in my mind about making a difference with your life not matter where you are in the world."
    },
    "url": "/title/tt0107207/"
}