{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Incubus",
            "url": "/name/nm1687848/"
        },
        {
            "@type": "Person",
            "name": "Brandon Boyd",
            "url": "/name/nm1179503/"
        },
        {
            "@type": "Person",
            "name": "Michael Einziger",
            "url": "/name/nm1178434/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 237,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136438/"
        }
    ],
    "datePublished": "2004-11-23",
    "description": "Recorded at one of America's most legendary outdoor amphitheaters, Incubus Alive At Red Rocks finds the California quintet performing their biggest hits plus cuts from A Crow Left Of The Murder, including Megalomaniac and Talk Sho...",
    "director": [
        {
            "@type": "Person",
            "name": "Zane Vella",
            "url": "/name/nm1576931/"
        }
    ],
    "duration": "PT2H27M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ1MzEzMDg4N15BMl5BanBnXkFtZTcwNzU1MzE2MQ@@._V1_.jpg",
    "keywords": "live performance,concert film,non fiction",
    "name": "Incubus Alive at Red Rocks",
    "original_info": {
        "id": "Incubus: Alive at Red Rocks_2004",
        "name": "Incubus: Alive at Red Rocks",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jordanapfelbaum"
        },
        "dateCreated": "2005-09-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0456071/"
        },
        "name": "Best of the three DVDs",
        "reviewBody": "Only one word can describe this DVD: energetic. The third DVD by Incubus is by far the best of the bunch and it really shows how much Incubus has evolved. If you couldn't make it to one of the concerts in 2004 don't miss this DVD. When the concerts starts up you can hear the buzz of anticipation and it gives you the feeling that something big is about to happen. The wispy beginning to Megalomaniac begins and then the stage just blooms into a ball of energy. Couldn't ask for a better opening to a concert. Most of your radio favorites are here and the remix of Drive really breathes new life into an already \"stellar\" song. ACLOTM is well represented and the slower songs on the album are used to give a great change of pace to the concert. Any fan of SCIENCE will be happy to know that Idiot Box, ACSOG, and Vitamin are all done in outstanding fashion. Vitamin stands out with its drum sequence performed by Jose, Ben, and Brandon. Kilmore also has a great solo in ACSOG and its worth repeating the song a couple of times just see it again. The DVD is very versatile because of its set list, if you want to rock out to Pistola or just chill and listen to Here In My Room this DVD can accommodate you. The DVD has a few special features including concert visuals that are kind of a trip but appropriate for each song. Do yourself a favor and watch the DVD and share it with someone you love.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0456071/"
}