{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Colin Vint",
            "url": "/name/nm1033477/"
        },
        {
            "@type": "Person",
            "name": "Christopher Heyerdahl",
            "url": "/name/nm0382216/"
        },
        {
            "@type": "Person",
            "name": "Smriti Mishra",
            "url": "/name/nm0592801/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 231,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0147269/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012180/"
        },
        {
            "@type": "Person",
            "name": "Keero Singh Birla",
            "url": "/name/nm1204232/"
        },
        {
            "@type": "Person",
            "name": "Jim Corbett",
            "url": "/name/nm0179170/"
        }
    ],
    "datePublished": "2002-06-14",
    "description": "Follow in the footsteps of Jim Corbett, the famed English hunter-naturalist, as he races to save an Indian village from the terror of a man-eating tiger. Along his journey he expresses his passion for tigers and explores the issue...",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Neibaur",
            "url": "/name/nm0624589/"
        }
    ],
    "duration": "PT42M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzUzNjQ2NDE1OV5BMl5BanBnXkFtZTcwNjE2MjczMQ@@._V1_.jpg",
    "keywords": "tiger,imax",
    "name": "India: Kingdom of the Tiger",
    "original_info": {
        "id": "India: Kingdom of the Tiger: IMAX_2002",
        "name": "India: Kingdom of the Tiger: IMAX",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2022-04-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0325618/"
        },
        "name": "Tiger kingdom",
        "reviewBody": "2002's 'India: Kingdom of the Tiger' is one of several documentary short films presented in IMAX. These short films are mostly quite interesting, but their overall quality is most worthwhile if flawed. The effects have also varied. India is a fascinating place that should be visited more in nature documentaries in my view, as there are many locations used frequently and India is not used enough, and tigers are very interesting and majestic looking animals that are highlight attractions at my local zoo.\n\n'India: Kingdom of the Tiger' is another one of the very worthwhile but could have been a lot better considering the potential kind of documentaries. It's mostly well made and narrated and the tiger footage is amazing, but the use of effects vary, it could have been more equally balanced and the non-animal scenes didn't always engage as much. Plenty of things to like here in 'India: Kingdom of the Tiger', but there was definitely room for improvement.\n\nAm going to start with the good. On the most part, 'India: Kingdom of the Tiger' looks great. The scenery is enough to take the breath away and the intimacy of the vibrant cinematography worked very well. The tiger is very imposing and the whole story with the tiger is very investable and has a wide mix of emotions.\n\nReally enjoyed learning about the history of India and was very educated, plenty of things that were new to me. The information for these scenes is informative and not too cute, juvenile or over-serious. The narration itself engages and enough to make one eager to learn more about India, while the Jimmy Corbett character is empathetic and knowledgeable.\n\nDid think however that 'India: Kingdom of the Tiger' could have been more balanced. There is a little much of the historical stuff and not enough about the tiger, while the narration delivery is fine some of the writing could have dialled back on the over-explaining. Some of the back and forth is on the jumpy side and if the documentary was a longer length it would have felt more cohesive.\n\nLike almost all the IMAX nature documentaries, this did feel too short. This was something that needed at least an hour with the amount of content it has and it could have had more of the tiger story to fill the time. The music is a little intrusive at times and the effects didn't seem necessary and a bit too reliant upon.\n\nIn summary, somewhat underwhelming but definitely worth a look. 6/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0325618/"
}