{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlie Bass",
            "url": "/name/nm3675180/"
        },
        {
            "@type": "Person",
            "name": "Rodney Blake",
            "url": "/name/nm1803005/"
        },
        {
            "@type": "Person",
            "name": "Dane Bowman",
            "url": "/name/nm1440936/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 363,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0110507/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0268089/"
        },
        {
            "@type": "Person",
            "name": "James Twyman",
            "url": "/name/nm1442975/"
        },
        {
            "@type": "Person",
            "name": "Neale Donald Walsch",
            "url": "/name/nm1443058/"
        }
    ],
    "datePublished": "2005-01-28",
    "description": "Indigo is a film about loneliness, redemption, and the healing powers and grace of the new generation of Indigo (psychic and gifted) children being born into the world. Although the story is fictional, the emotions and actions of ...",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Deutsch",
            "url": "/name/nm0222104/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDcxNTk0MDAzNF5BMl5BanBnXkFtZTcwNzY1MTgyMQ@@._V1_.jpg",
    "name": "Indigo",
    "original_info": {
        "id": "Indigo_2003",
        "name": "Indigo",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sweetemotions10"
        },
        "dateCreated": "2005-02-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0379322/"
        },
        "name": "A Celebration of Indigo Children and the new phenomenon of heightened consciousness in children.",
        "reviewBody": "I have known of the story of the Indigo Children for quite some time now, and I have run across cases that seem genuine as well as cases that seem fraudulent. This movie is the latter. Riding the success of the far better \"What the Bleep do We Know?\" \"Indigo\" jumps on the new-age bandwagon by making a film, essentially, about super-children. This is not the purpose of the idea of Indigo Children.\n\nThe Indigo Children are a new wave of children enjoying a maturity and a sensitivity unusual even in most adults. These children are great teachers, and they bring a childlike innocence back to the idea of wisdom. It is refreshing to see wisdom untainted by a jaded adult perspective in these children.\n\n\"Indigo,\" however, with its ludicrous plot and its poor acting, never substantiates any of its information. It merely tells us the story of a super-child who has control over everything. Ironically, the idea of control over anything is contrary to the very idea of wisdom. The filmmakers will tell you, before the film, that it was not dumbed down. I equate this with Nixon telling us he wasn't a crook. The film is completely dumbed down.\n\nI love the story of the Indigo Children, and I cannot do anything but hope that most of the cases are true, because, if they are, these children represent a new wave of society that is very promising. \"Indigo,\" however, represents one of the worst and most misrepresentative films I have ever seen. I was expecting a semi-documentary, looking at real cases of Indigo Children and the parents and guardians who have lived with them. Alas, this was not the case. I actually almost walked out, and I have never walked out or even considered walking out on a film before. I hope, for all of our sakes and for the reputation of Indigo Children, most people will give this one a pass.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Spirit Song Media",
        "duration": "PT1M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3297837337",
        "name": "Indigo",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTM5NTg3MTgtMTNjZC00MDk3LTgyZTktZDNmZDlhYzE0MDFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTM5NTg3MTgtMTNjZC00MDk3LTgyZTktZDNmZDlhYzE0MDFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:44:59Z",
        "url": "https://www.imdb.com/video/vi3297837337/"
    },
    "url": "/title/tt0379322/"
}