{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harrison Ford",
            "url": "/name/nm0000148/"
        },
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Alison Doody",
            "url": "/name/nm0233145/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 765754,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071326/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Boam",
            "url": "/name/nm0090151/"
        },
        {
            "@type": "Person",
            "name": "George Lucas",
            "url": "/name/nm0000184/"
        },
        {
            "@type": "Person",
            "name": "Menno Meyjes",
            "url": "/name/nm0583675/"
        }
    ],
    "datePublished": "1989-05-24",
    "description": "In 1938, after his father goes missing while pursuing the Holy Grail, Indiana Jones finds himself up against the Nazis again to stop them from obtaining its powers.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Spielberg",
            "url": "/name/nm0000229/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2Q0ODg4ZmItNDZiYi00ZWY5LTg2NzctNmYwZjA5OThmNzE1XkEyXkFqcGdeQXVyMjM4MzQ4OTQ@._V1_.jpg",
    "keywords": "holy grail,father son relationship,indiana jones character,united states of america,revolver",
    "name": "Indiana Jones and the Last Crusade",
    "original_info": {
        "id": "Indiana Jones and the Last Crusade_1989",
        "name": "Indiana Jones and the Last Crusade",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Smells_Like_Cheese"
        },
        "dateCreated": "2003-11-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0097576/"
        },
        "name": "The best of the Indiana Jones trilogy",
        "reviewBody": "Indiana Jones, the man, the legend, the whip. Everyone I know has seen at least one of the Indiana Jones movies and usually Raiders of the Lost Ark is their favorite. Now I loved Raiders of the Lost Ark, I also really loved Temple of Doom even though it gets a lot of hate for it's darkness. But The Last Crusade is my favorite of the trilogy and the strongest in my opinion. For goodness's sake we have Sean Connery as Indiana's father, how could we get any better than that? I love his way of saying \"Junior!\", always gets me in a good chuckle. Harrison Ford still has that same Indy charm that swoons the ladies, the adventure that captivates the guys and takes us on an incredible journey that we'll never forget.\n\nIn 1938, Indiana finally recovers the Cross and donates it to his friend Marcus Brody's museum. Indiana is later taken to the residence of wealthy businessman Walter Donovan, who informs him that his father has vanished while searching for the Holy Grail, leaving behind partial directions from an incomplete stone tablet along with his diary containing his life's work on the Grail. Indiana and Marcus travel to Venice to investigate Henry's disappearance, meeting up with his colleague Elsa Schneider. Discovering catacombs beneath the library where Henry was last seen, Indiana and Elsa find the tomb of Sir Richard, a knight of the First Crusade who is buried with a complete version of the tablet. Indiana finds his father, only to be betrayed by Elsa, who reveals that she and Donovan are working with the Nazis to find the Grail. The Nazis steal the Grail diary and capture Marcus in Iskenderun, where he was sent with pages from the diary to seek the protection of Sallah. The Joneses manage to escape the castle and follow the Nazis to Berlin, where they recover the diary from Elsa. The Joneses, Marcus and Sallah arrive to find that the Nazis are unable to pass through three \"trials\" of God. After Indy's father gets shot, he doesn't have much of a choice as to pass the trials and choose the correct cup to save his father's life.\n\nIndiana Jones and the Last Crusade is one of my favorite movies of all time, it's just a flawless movie that will always be timeless. My future kids will watch these movies, they're just a lot of fun. Who said archeology can't be fun? This also has one of the most exciting chase scenes of all time, Indiana is trying to rescue his father and a friend from a Nazi tank and he is on a horse, a brutal fight ensues and was just so exciting to watch. I've watched this movie since I was a little girl and I still watch it with pleasure today, even with my friends we love watching Indiana and his adventures. They're an absolute blast and if you haven't seen Indiana Jones and the Last Crusade, please take the first opportunity you have to watch it, it's a great movie.\n\n10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount",
        "duration": "PT2M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2007669529",
        "name": "Indiana Jones and the Last Crusade",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjA0OTY4N2ItMGRlMi00MTNiLWE2NmMtM2VmYjExYzcwMTFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjA0OTY4N2ItMGRlMi00MTNiLWE2NmMtM2VmYjExYzcwMTFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-12-29T06:15:53Z",
        "url": "https://www.imdb.com/video/vi2007669529/"
    },
    "url": "/title/tt0097576/"
}