{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Woods",
            "url": "/name/nm0000249/"
        },
        {
            "@type": "Person",
            "name": "Mercedes Ruehl",
            "url": "/name/nm0001689/"
        },
        {
            "@type": "Person",
            "name": "Lolita Davidovich",
            "url": "/name/nm0000357/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3773,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005861/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0119040/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069634/"
        },
        {
            "@type": "Person",
            "name": "Abby Mann",
            "url": "/name/nm0542631/"
        },
        {
            "@type": "Person",
            "name": "Myra Mann",
            "url": "/name/nm0542898/"
        }
    ],
    "datePublished": "1995-05-20",
    "description": "Lawyers and the media argue the alleged child abuse at the McMartin preschool in Manhattan Beach, California.",
    "director": [
        {
            "@type": "Person",
            "name": "Mick Jackson",
            "url": "/name/nm0413875/"
        }
    ],
    "duration": "PT2H11M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmYyMDc0ZTktNDUwMS00MzNkLTg3MjgtODQyZTQ5ZjNmZmU2XkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "reference to pubic hair,suspected child abuse,false accusation of child molestation,justice,alleged pedophilia",
    "name": "Indictment: The McMartin Trial",
    "original_info": {
        "id": "Indictment: The McMartin Trial_1995",
        "name": "Indictment: The McMartin Trial",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Alex-372"
        },
        "dateCreated": "2001-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113421/"
        },
        "name": "Important Movie",
        "reviewBody": "Indictment is a movie showing how untested pop psychology and bad (circular) reasoning can still produce witch hunts in this day and age, and an appeal to both the viewer and the public in general to always keep a critical eye towards the facts like a laser beam.\n\nNor was this case a one-off. In fact, when I saw the announcement for this movie, I thought it was about the \"Little Rascals Day Care Center\" in Edison, NC. Only a year before the McMartins were released from jail, an almost cloned incident happened in Edison, when the owner, Robert Kelly jr. and his wife were charged with massive child abuse - as well as satanism, cannibalism, abductions... they were also accused of taking the children along in space ships, killing animals, sacrificing babies in the middle of the day care center during open hours, etc (although no children were ever reported missing). There too, the case started out with a single vindictive mother with an agenda of her own, and was built upon \"recovered memories\", etc.\n\nHowever, unlike the McMartins, who spent up to half a decade in jail awaiting trial, the Kelly's were actually convicted and sentenced to twelve consecutive life sentences. Their convictions were later quashed on appeal.\n\nWhat is also shown out in this movie is the way \"true believers\" think. Kee, played by the gorgeous Lolita Davidovitch, doesn't look for corrobable evidence, but simply affirmation of her already drawn up conclusions. Here is where the circular thinking comes in. When a child is asked if it has been abused, and the answer is yes, then it must be telling the truth. However, if the answer is no, then something must be keeping them from telling the truth, in this case, \"they're in denial\". And so they will be cojoled, even threatened, until the answer is yes. They how's, when's and even who's are less important, and as a result many of testimony becomes fantastical, even impossible. Or, to quote from an article on False Memory Syndrome:\n\n\"When the victim responds, \" but I get along fine with my parents, they aren't perverts\". - the trusted advisor responds, \"Wow, they must have been really horrible for you to have repressed it that deep. If you won't recall, you won't get better.\" \"\n\nAlso, Gerardo and OJ trial regular Ira Reiner (who gravely described OJ's gloves as \"loosely fitting, working man's gloves\") don't come off very well at all, not surprisingly.\n\nNor have these modern witch hunts limited themselves to North America - there have been similar mass arrests after allegations of satanic abuse in the north of Scotland, recently in the UK the daily mail undertook a campaign of publicly naming child molesters, many of whom were confused with other people, one man had a neckbrace like one of the men in the newspaper and needed police protection after both his and his neighbors house had been stoned, and a PEDiatrician needed protection after children had painted \"PEDo\" on her house. Nor is mass hysteria and mass psychology limited to child abuse - recently in Holland a scuzzy politician tried to whip up public support by claiming as \"outrageous\" the number of middle aged citizens of Maroccan and Turkish descent claiming disability - totally and conveniently ignoring the fact that among the physically demanding and dangerous industries, like steel, chemicals, and the cleaning industry, these groups were hugely over represented in the decades after WWII and still are today.\n\nThis movie is an indictment of mass hysteria, and is an appeal for every citizen to think for him or herself, and be very critical, even cynical of whatever news is presented to them on a platter every night at six.\n\nSee it."
    },
    "url": "/title/tt0113421/"
}