{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tony Leung Chiu-wai",
            "url": "/name/nm0504897/"
        },
        {
            "@type": "Person",
            "name": "Andy Lau",
            "url": "/name/nm0490489/"
        },
        {
            "@type": "Person",
            "name": "Leon Lai",
            "url": "/name/nm0481709/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13995,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "Infernal Affairs III",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030333/"
        },
        {
            "@type": "Person",
            "name": "Alan Mak",
            "url": "/name/nm0538320/"
        },
        {
            "@type": "Person",
            "name": "Felix Chong",
            "url": "/name/nm0159039/"
        }
    ],
    "datePublished": "2003-12-12",
    "description": "Months after the events of the original film, Ming suspects a police superintendent as being a new mole for the triads, while years earlier, Yan embarks on his first mission.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Lau",
            "url": "/name/nm0490487/"
        },
        {
            "@type": "Person",
            "name": "Alan Mak",
            "url": "/name/nm0538320/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTZkODlhMzItNmFlMC00MTkyLTljMzgtMzgwZDBhNjU2OGRhL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "criminal syndicate,gangster,hong kong,mob boss,mobster",
    "name": "Mou gaan dou III: Jung gik mou gaan",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sensationaldrama"
        },
        "dateCreated": "2003-12-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0374339/"
        },
        "name": "Tying up loose ends--for the fans.",
        "reviewBody": "While in the U.S. the 3rd movie of anything is suppose to be the large-scale, big-budget, battle-destruction-galore ending to a series, Infernal Affairs 3 shamelessly does the opposite and delivers an introspective look devoid of any \"battle\" scene at all. Now that IA has become somewhat of a cult following (ironically the story is not meant to go any further) it seems fitting that we are delivered a film as if the cutting-room floor pieces were placed together from the previous two movies and sequenced for the conclusion.\n\nThe story attempts to elaborate the most important details of the series and not presenting them in sequence, only a handful of present scenes exist which each are periodically given a large delve into the past. IA 3 explores what happened leading up to many scenes in the first Infernal Affairs which is really pretty neat for anyone who watches movies and seen the first. As a result its a jumble and mix of scenes giving you dates of when they occur (sometimes eliciting humor) and glimpsing every single character in the series as if they were the past but really filmed new for the movie. And in this way follows Yan and Ming's characters as they progress to their fates.\n\nBut it seems perhaps that by doing so, the movie is simply what was left out in the first film and anyone new to the series will obviously not understand the significance of what is going on other than the artsy cinematography of white-washed cool hues, steady camera work, and continual sponsorship of devices and products. This also includes the chaotic, dizzy feeling of progressing back and forth sometimes not knowing when you are (as with scenes that occur in Ming's mind only). Perhaps only the avid movie goer will realize Mo Gan Do 3 is a representation of hell in a high-tech world, the redemption of Yan and Ming's fall into insanity. But most will be confused about why until they see it all."
    },
    "url": "/title/tt0374339/"
}