{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edison Chen",
            "url": "/name/nm0155211/"
        },
        {
            "@type": "Person",
            "name": "Shawn Yue",
            "url": "/name/nm1284845/"
        },
        {
            "@type": "Person",
            "name": "Anthony Chau-Sang Wong",
            "url": "/name/nm0938893/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18764,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Infernal Affairs II",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029982/"
        },
        {
            "@type": "Person",
            "name": "Alan Mak",
            "url": "/name/nm0538320/"
        },
        {
            "@type": "Person",
            "name": "Felix Chong",
            "url": "/name/nm0159039/"
        }
    ],
    "datePublished": "2003-10-01",
    "description": "In this prequel to Mou gaan dou (2002), Chan Wing Yan has just become an undercover cop in the triads while Lau Kin Ming joins the police force. Both the triads and the police find an enemy in a rival crime boss.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Lau",
            "url": "/name/nm0490487/"
        },
        {
            "@type": "Person",
            "name": "Alan Mak",
            "url": "/name/nm0538320/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWZjMjgxYTctNjRhMi00NDFkLWI1MDctMmM5MWQyZmRkOWE4L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "hong kong,1990s,mobster,neo noir,police",
    "name": "Mou gaan dou II",
    "original_info": {
        "id": "Infernal Affairs II_2004",
        "name": "Infernal Affairs II",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Griffin-15"
        },
        "dateCreated": "2003-10-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0369060/"
        },
        "name": "Outstanding and Recommended",
        "reviewBody": "After phenomenal success of \"Wu Jian Dao (2002)\" (or IA for short), a lot of hypes generated around when next two movies in the series are announced. I tend to ignore them and do not expect anything about IA2. Before I got into the cinema, \"how would the screenwriters present this time,and how would they connect the characters between them?\". After the movie, I would say I am not disappointed.\n\nLike IA, this is also a drama about clashes of characters, not in the form of breath-taking kung fu / wire-work actions we find in traditional Hong Kong cop movie, but starting from their own desire, intentions, hate and positions. If you are looking for a non-stop action flick, I am afraid IA2 would not fulfill you.\n\nBut unlike last year's blockbuster, the main theme of IA2 is about the rise and fall of a great gangster family Ngai, other than about the police. The difficult part in making a prequel lies in the fact that as audiences all know too well the new appearences would drop-out one way or the other and the characters from IA must be okay. So the story does not waste efforts in describing most of the adventures, rather, concentrate on how these events shapes things to come. It is sure to the scriptwrites' credits and this alone casts a strong contrast to prequel movies like \"Star Wars: Attack of the Clones\" (2002).\n\nMoreover, it is not surprising for many audiences relating this with similar movies like \"The Godfather\". I am not comparing them here, but rather I would point out that the actor Francis Ng, who plays the new gangster head of Nagi family, runs the show. He plays a young, well-educated, cool,calculating, witted, cruel, cunning -- and unpredictable leader. As some critics say, a CEO-style triad boss. On the other hand, he successfully shows Ngai is actually a passionate man whose family comes first. On the other hand, late gang leader is screened for one shot only (pun intended), his character is only reflected, not by flashbacks, but by short monologues recited by Ng. It is a quite demanding job and I would say Ng has done a really good job here.\n\nSpeaking of characters, another drift from IA, and many other traditional movies in the genre, female character actually plays \"real\" effects. Mary, played by Claudia Lau, is the closest girlfriend of Sam Hung. She is not just a powerless, declorative character. Like many female in the course of human history, she is the ignition point of the whole storm.\n\nIf the audiences has not forgotten IA actually hints that Inspector Wong (played by award-winning Anthony Wong) and Sam Hung (played by also award-winning Eric Tsang) have known each other for a long time. IA2 unveils their long-time mutual respects, and how all these change as the story flows along. Anthony Wong still delivers a high standard of acting just like in IA and how he plays the 3 ups-and-downs of Inspector Wong is simply terrific. On the contary, gangster Hung, Wong's arch-enemy in IA, is much lighter and more human. As with Wong, this character experiences changes which shapes of what to be seen in IA. However, I find the last party scene is unnecessary and does not seem to connect with the firece and uncanny Hung we used to know.\n\nRelatively, the other major characters seems week. Mainland actor Jun Wu, plays another inspector who is a close partner with Wong. I could see the actor tries. Unfortunately, Wu's character is just too flat. His friendship and his clashes with Wong could not mark strong impressions among the audiences. I have a (probably false) feeling that this character is created to be destroyed and it is a waste of Wu's talents.\n\nThe actors portriating the young Wing-yan Chan (by Shawn Yu) and Kin-ming Lau (by Edison Chan) would be the weakest link in IA2. Except for a few scene, Edison puts up a regular expression of somewhat between arragonce and anger. For example, towards the end of airport scene, Lau would have a mixed feeling of guilt, anger, loss and vengence. This is an important scene for Lau's self-centered character, however, the actor simply fails to convince me.\n\nThe same goes to Shawn. He fails to play as someone who is torn between his role as a \"policeman\" and a triad member, his loyalty and duty. Most of the time, he just plays plain and \"flat faced\". To be fair, he gets a tad better towards the end of the movie as his character begins to merge with the character in IA.\n\nNonetheless, young actors weight must less as the others.\n\nSpeaking about continuity, IA2 does not fail in providing bits and pieces about the backstory of IA. And it is not hard for anyone to catch the images of other minor characters from IA. However, I have a few issues.\n\nFirst, in IA, we see Hung was an ambitious and man of vision, that is why he implants many moles in the police department in the first place. However, the initial character of Hung seems too soft and passive. Why does he stand by Ngai in the time of crisis? We could not see his importance rises afterwards. Why didn't he use the chance and take out his opponents or expand his influence in the triad, then? Was he just covering himself for his long-term plan?\n\nAlso, why Wing-yan Chan remains in the end, even in light of his well-known ties with the Ngai family? How come does he becomes a subordinate of Keung? In IA, the position of Keung and Yan seems to have switched.\n\nApart from some goofs (accuracy of shooting from a paper bag, ignorance of emptied handgun and way of corspes could be burnt to ashes), the run of the movie stops rather abruptedly twice as timeline transits from year 1991 to 1995 and from 1995 to 1997. The effects on and changes of characters are not appearent so it leaves the audiences with a lot of imaginations and mental exercises. (Not that I hate mental exercises, it is rare for Hong Kong movies to make me enjoy doing so) I think the director could handle the storytelling a bit better smoother and tighter.\n\nDespite of cliches, IA2 delivers a more powerful drama than the original. The acting, directing and many other technical aspects are top notch. The scriptwriters are very clever in telling from the other side of the theme and breaks away the shadow casted by the successful predecessor.\n\nLooking forward to see the real \"final\" this December.\n\n8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0369060/"
}