{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Spencer Tracy",
            "url": "/name/nm0000075/"
        },
        {
            "@type": "Person",
            "name": "Fredric March",
            "url": "/name/nm0545298/"
        },
        {
            "@type": "Person",
            "name": "Gene Kelly",
            "url": "/name/nm0000037/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 31181,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136675/"
        },
        {
            "@type": "Person",
            "name": "Nedrick Young",
            "url": "/name/nm0949917/"
        },
        {
            "@type": "Person",
            "name": "Harold Jacob Smith",
            "url": "/name/nm0808414/"
        },
        {
            "@type": "Person",
            "name": "Jerome Lawrence",
            "url": "/name/nm0492823/"
        }
    ],
    "datePublished": "1960-08-30",
    "description": "Based on a real-life case in 1925, two great lawyers argue the case for and against a Tennessee science teacher accused of the crime of teaching evolution.",
    "director": [
        {
            "@type": "Person",
            "name": "Stanley Kramer",
            "url": "/name/nm0006452/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjcwZjhlZmEtNjg3ZC00OTEwLWFjY2MtMDg2OTQwZWJmMGM3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "religion versus science,courtroom drama,lawyer,evolution,scopes monkey trial",
    "name": "Inherit the Wind",
    "original_info": {
        "id": "Inherit the Wind_1960",
        "name": "Inherit the Wind",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2010-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053946/"
        },
        "name": "a film (sadly) very relevant in current times, but also watchable for its towering stars",
        "reviewBody": "Sometimes a film becomes dated over time, that it lacks relevancy due to the way its filmed and its content. But in the case of Inherit the Wind, Stanley Kramer's production in terms of acting and staging is dated, but the themes are sadly still painfully relevant. Evolution vs. Creationism is still a hot button topic, though of course it shouldn't be (and the Supreme Court has ruled against Creationism as unconstitutional), but maybe even more shocking is to see the town of Hillsboro and how it could be like some small towns in America, mostly the South and the Midwest. One wonders if the mob could be as large and howling and fervent today as it was in Hillsboro (or how it was during the actual Scopes-Monkey trial in the 1920's).\n\nBut what stays most passionate about the film, and also at its most flawed, is its conviction about the issue. Kramer is a right director for this material, if not the best. It's full of passionate speeches- it could also be said 'preachy' not too ironically enough in some scenes- and blazing courtroom scenes that are not very realistic (the way the lawyers speak and speechify to the jury and the people in the courtroom and, of course, the audience in the theater), but somehow they're highly enjoyable. This doesn't mean the writing in the film is always great, or all of the characters. But the film is compulsively watchable 'issue' film-making, self-important but full of poignant touches.\n\nThe wisest choice that Kramer made, akin to what he did with The Defiant Ones, is put BIG actors in these BIG roles. Chiefly these are for Henry Drummond, the defense attorney played by Spencer Tracy, and the prosecutor Matt Brady played by Federic March (or rather, devoured by March). Like Frost/Nixon, the film becomes really as much about these two men, two old characters who have known each other over the years and have a real respect/hate relationship with one another (see the scene where they're on the rocking chairs to see their connection). So throughout the film, while the issue of evolution vs creationism is brought simmering to a boil, Tracy, a sensational actor, has to try to keep up with March who is so over the top that he cracks the ceiling with a sledgehammer.\n\nBest of all is to see their showdown when Drummond puts Brady on the stand, a theatrical gesture but in keeping with the fact of the case (William Jennings Bryant really was called to stand during his own trial), and in having these two actors yell and stare and make big gestures at each other. If nothing else, it's worth it to watch the film for these two, though I might consider Tracy the winner overall, while March gets points in individual scenes, like when he grandstands towards the end when the case is dismissed (also when he stands up for the girl Rachel Brown when she is \"damned\" by her father, but as a calculating move to get her on the stand).\n\nWhich brings me to some of the flaws in the film. Kramer has a lot that he wants to say as a filmmaker, but he doesn't know how to tweak anything down past it being super theatrical. It would've helped, for example, to cut just a little of the dialog, some of the pompous exchanges between characters (albeit some of the dialog is actually pretty funny, mostly when Gene Kelly's reporter disses Brady). Another problem was Rachel Brown, who firstly is concocted as a contrivance (hey, let's make the daughter of the evangelical reverend also the fiancé of the science teacher), but more-so that she's just a lame character, poorly written like many characters end up being in Kramer films, if not anywhere near as bad as the daughter in Guess Who's Coming to Dinner. And the last little moment of the film, when Drummond puts together two specific books together, is a completely tasteless gesture, meant to appease both the believer and non-believer sect after what was a satisfactory ending between Tracy and Kelly where the former tells off the latter.\n\nBut faults aside, the film does carry some legitimate power, and if nothing else I would watch it again just for the scenes between the two big stars. It's an actor's picture as much as a \"message\" picture, and as the themes carry some strong weight for discussion, not to mention the impressive semi-frightening sight of the Hillsboro religious mobs, it's really the actors who make it a (near) must-see.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A powerful and provocative re-creation of the most titanic courtroom battle of the 20th Century, starring Spencer Tracy...\n\nDescribed by Steven Spielberg as \"one of our great filmmakers, not just for the art and passion he put on screen, but for the impact he has made on the conscience of the world\", the films of producer and director Stanley Kramer (The Defiant Ones, Guess Who's Coming to Dinner) frequently confronted social issues considered too controversial for the major studios. In INHERIT THE WIND he tackled the creationism vs. evolution debate.\n \nWhen a teacher in a small Tennessee town is brought to trial for teaching Darwinism, attorney Henry Drummond (Spencer Tracy, Bad Day at Black Rock) faces off against fundamentalist leader Matthew Harrison Brady (Frederic March, Dr. Jekyll and Mr. Hyde) in an explosive battle of beliefs.\n \nAlso operating as a searing critique of McCarthyism, INHERIT THE WIND was nominated for multiple Academy Awards, and is rightfully recognised as one of the most entertaining, and provocative films of its era. Eureka Classics is proud to present INHERIT THE WIND for the first time on Blu-ray in the UK in a special Dual Format edition.",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi138065945",
        "name": "INHERIT THE WIND (Eureka Classics) New & Exclusive HD Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk0OGE0MjAtYmUzZi00ZGI4LWI0OGEtZmVkM2U2NTUxMzY0XkEyXkFqcGdeQXVyMTg2NTc4MzA@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk0OGE0MjAtYmUzZi00ZGI4LWI0OGEtZmVkM2U2NTUxMzY0XkEyXkFqcGdeQXVyMTg2NTc4MzA@._V1_.jpg",
        "uploadDate": "2018-03-01T16:49:00Z",
        "url": "https://www.imdb.com/video/vi138065945/"
    },
    "url": "/title/tt0053946/"
}