{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leslie Cheung",
            "url": "/name/nm0002000/"
        },
        {
            "@type": "Person",
            "name": "Karena Kar-Yan Lam",
            "url": "/name/nm1157324/"
        },
        {
            "@type": "Person",
            "name": "Maggie Poon",
            "url": "/name/nm0690951/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1827,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "Inner Senses",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0089465/"
        },
        {
            "@type": "Person",
            "name": "Chi-Leung Law",
            "url": "/name/nm0492305/"
        },
        {
            "@type": "Person",
            "name": "Tung-Shing Yee",
            "url": "/name/nm0232504/"
        },
        {
            "@type": "Person",
            "name": "Sin Ling Yeung",
            "url": "/name/nm0946042/"
        }
    ],
    "datePublished": "2002-03-28",
    "description": "Yan is haunted by fleeting images of what she believes to be dead people. Soon, her suspicions are confirmed when her therapist Jim begins seeing the same things and the two begin to unravel a mystery that leads to a forgotten past.",
    "director": [
        {
            "@type": "Person",
            "name": "Chi-Leung Law",
            "url": "/name/nm0492305/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Crime",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTAwMTk2YmYtNWFiYS00YjAwLThiNGYtMTlmYmVlNzRjNDBjXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "disturbed person,mysterious person,psycho killer,underwater scene,vision",
    "name": "Yee dou hung gaan",
    "original_info": {
        "id": "Inner Senses_2002",
        "name": "Inner Senses",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "praxis18"
        },
        "dateCreated": "2003-07-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0316023/"
        },
        "name": "Leslie Cheung's last great performance.",
        "reviewBody": "`Inner Senses' is another great horror movie to come out of Asia in recent years. However, it suffers from a certain lack of originality. Its basic premise imitates that of `The Sixth Sense' i.e. psychiatrist tries to help troubled person who sees dead people. The horror scenes in the last minutes of `Inner Senses' also borrows heavily from Japan's `Ring'. Such weaknesses aside, `Inner Sense' is certainly an intelligent horror movie, much more so than my other Asian favourite to come out in 2002, `The Eye'. While `The Eye' goes all out to scare audiences, `Inner Senses' prefers to make audiences think beyond what they are witnessing on the screen. In what is probably his last great performance, Leslie Cheung is Jim, a psychiatrist who works in a mental hospital. Jim is an atheist who places his faith in science and has no time for superstitious nonsense, including religion. As he states in his lecture at the beginning of the movie, `ghosts' are all in the mind, the result of the mind putting together various randomly accumulated information about a society's superstitions. He agrees to take on a client as a favour for a colleague. Karena Lam is Yan, a troubled girl who claims to see dead people. She lives in terror of the strange visitors who visits her apartment, especially her kindly (but somewhat mentally unbalanced) landlord's long dead wife and child. She plasters all her glass windows and mirrors in her apartment with newspapers to avoid seeing `things'. Jim works hard to free Yan of her fears and successfully convinces her that none of her visions are real. They are the result of her loneliness, troubled childhood, failed relationships, overactive imagination and neighbours' pranks. But once Yan is freed of her visions, Jim starts to see a dead teenage girl himself . she hums a strangely familiar tune, giggles at some secret joke, and follows him around. He has flashbacks about his teenage years and sleepwalks looking for something from the past . something so terrible that he has buried the memories in unreachable places in his mind. Yan has to help him figure out what it is before his visions destroy him. `Inner Senses' will have audiences thinking long after the end of the movie. Although `ghosts' do make multiple spine-tingling appearances in `Inner Senses', we are not told unequivocally that they are, in fact, ghosts. The protagonists' experiences can rightly be attributed to their fractured mental conditions. Leslie Cheung and Karena Lam both give outstanding performances as flawed people coping with inexplicable and terrifying events. The last minutes of `Inner Senses' eerily foreshadow Leslie Cheung's suicide in 2003. The Chinese movie world has lost a great entertainer, but his memory will remain with us."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "aka: Yee do hung gaan hv Post",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3769499929",
        "name": "Inner Senses",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzAyZjZmNTEtMGM4My00MjMzLWEyNTItZTkxMGJmYmE3NWZiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzAyZjZmNTEtMGM4My00MjMzLWEyNTItZTkxMGJmYmE3NWZiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:34:04Z",
        "url": "https://www.imdb.com/video/vi3769499929/"
    },
    "url": "/title/tt0316023/"
}