{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 89,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009247/"
        },
        {
            "@type": "Person",
            "name": "Douglas Brooks West",
            "url": "/name/nm0922048/"
        }
    ],
    "datePublished": "2002-09-04",
    "description": "It is the second largest of the world's great religions, and the fastest growing. Its name comes from the word for peace, yet to many Westerners it is synonymous with terror. INSIDE ISLAM lifts the veil of mystery surrounding a mi...",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Hufnail",
            "url": "/name/nm0400308/"
        }
    ],
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ1NjY4MzA5NF5BMl5BanBnXkFtZTcwNzQ0OTEyMQ@@._V1_.jpg",
    "keywords": "islam,christianity,judaism,reference to adam and eve,reference to noah",
    "name": "Inside Islam",
    "original_info": {
        "id": "Inside Islam_2002",
        "name": "Inside Islam",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wrlang"
        },
        "dateCreated": "2006-11-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0356743/"
        },
        "name": "one of the better Islamic documentaries",
        "reviewBody": "The History Channel's Inside Islam is about the history of Islam in the world. I've watched a few documentaries on Islam and found this one to be the most palatable. Some of the previous ones said things comparable to Islam inventing the internet. While there is no doubt in my mind that many great scholars would choose a religion as depicted in this film, I feel the film is one sided. It actually took to task the fact that Jews, Christians, and Muslims all pray to the same God, so their fighting each other is like brothers who won't talk to each other of some childish spat. I think they should have also compared the Jewish, Christian, and Islamic fundamentalist so it is also obvious that each church has their own zealots. A must watch for most Americans and people who know nothing about Islam but what the press tells them. On second thought, I'm not sure if anyone who trusts the press to get accurate information is intellectually mature enough to get anything out of this film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0356743/"
}