{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maurice LaMarche",
            "url": "/name/nm0005606/"
        },
        {
            "@type": "Person",
            "name": "Bettina Bush",
            "url": "/name/nm0079354/"
        },
        {
            "@type": "Person",
            "name": "Jim Byrnes",
            "url": "/name/nm0126325/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 263,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "TV-Y7",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018052/"
        },
        {
            "@type": "Person",
            "name": "Josh Lobis",
            "url": "/name/nm1118845/"
        },
        {
            "@type": "Person",
            "name": "Eric Lewald",
            "url": "/name/nm0506718/"
        },
        {
            "@type": "Person",
            "name": "Jean Chalopin",
            "url": "/name/nm0150058/"
        }
    ],
    "datePublished": "2002-10-13",
    "description": "Inspector Gadget is back in an all-new animated movie. Gadget is still a klutz and Dr. Claw has a vicious new plan.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Maliani",
            "url": "/name/nm0539516/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWFkNTMwOTUtNmJlYi00OWJhLWFkYjctODJkZTBkMGIwODY0XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_.jpg",
    "keywords": "inspector gadget character,superhero,2000s,superhero action,superhero sci fi",
    "name": "Inspector Gadget's Last Case: Claw's Revenge",
    "original_info": {
        "id": "Inspector Gadget's Last Case_2002",
        "name": "Inspector Gadget's Last Case",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stopthemachine"
        },
        "dateCreated": "2006-06-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338130/"
        },
        "name": "Even Penny and Brain Couldn't Save Uncle Gadget This Time",
        "reviewBody": "Inspector Gadget was probably my all-time favorite 80's cartoon. I enjoyed both the first and second seasons of the series as well as 1992's Christmas special \"Inspector Gadget Saves Christmas\". Some Gadget fans are quick to criticize the second season (1985) of the show, but they need to compare it to DiC's 2002 release of \"Inspector Gadget's Last Case: Claw's Revenge\" for then, they will find the second season to be absolute gold.\n\nBeing a Gadget fan, I couldn't resist the opportunity to see the animated Inspector Gadget in something that wasn't Gadget Boy-related. I purchased the film, and I swore to myself that I'd be objective; I knew that sometimes artistic liberties would be taken from the original series. I was not even prepared for what I was about to watch.\n\nThere was barely a shred of the original show still intact.\n\nHere is a short list of just some of the cons for this movie: *The humor is non-existent from the original series.\n\n*Penny and Brain (originally having a nearly equal part in the series as Gadget) are missing from the action for fifteen to twenty minute intervals.\n\n*The original music by Saban & Levy is not there, and the score that exists is sub-par. (Understood that Saban has his own production company now, but at least \"Inspector Gadget Saves Christmas\" had good music, even without Saban.) *Don't expect to see any of Gadget's gadgets which made the show so endearing, such as gadget-copter, gadget-brella, gadget-mallet,gadget-coat (which actually was used but it was not even called the same thing), as well as his standard other hat and hand gadgets. In this movie, his gadget legs were telescopic instead of springs. That kind of stuff annoys true fans of the show, and simply aren't necessary to change.\n\n*The gadgetmobile from the original series is now a fast-talking, supposedly \"hip\" convertible. All the fans from the original series enjoyed the gadgetmobile transforming into the gadget van and vice versa.\n\n*Chief Quimby is now very short-tempered and even mean to Gadget. He was always grumpy in the original series, but this pushes the situation a bit much.\n\n*Penny no longer has a computer book.\n\nAre there any positives to this movie? OK, here goes...\n\n*Maurice LaMarche does a good job of taking over for the great Don Adams as Inspector Gadget.\n\n*In one scene, Chief Quimby alludes to an actual villain from the cartoon series: the Great Wambini (classic \"Gadget\" villain from the second season, voiced by Louis Nye).\n\nLooking for more redeeming factors for this movie? Well, you're out of luck. Life is about making choices and living by those choices. Most situations in life have a purpose even if it is to teach a lesson. The lesson learned here: keep to the original formula! \"If it ain't broke, don't fix it.\" True Gadget fans should steer clear from this movie; you will surely be disappointed.\n\nHopefully, DiC and Shout! Factory will continue to release more of the original series after the 2006 release of \"Inspector Gadget: The Original Series, Volume 1,\" containing the first 22 episodes of the series. As a true Gadget fan, lover of 80's animation and many of DiC's programs, I urge you the viewer to purchase \"Inspector Gadget: The Original Series, Volume 1\" and \"Inspector Gadget Saves Christmas\" DVD's which are excellent and sure to bring back good memories.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0338130/"
}