{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Diane Keaton",
            "url": "/name/nm0000473/"
        },
        {
            "@type": "Person",
            "name": "Geraldine Page",
            "url": "/name/nm0656183/"
        },
        {
            "@type": "Person",
            "name": "Kristin Griffith",
            "url": "/name/nm0341562/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20189,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008432/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100349/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "datePublished": "1978-10-06",
    "description": "Three sisters find their lives spinning out of control in the wake of their parents' sudden, unexpected divorce.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTcxMjBiYTUtZmUyNy00YjkyLTg3NTEtNDE0N2MxNTY3NjUwXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "no music,disillusionment,three sisters,sibling rivalry,attempted rape",
    "name": "Interiors",
    "original_info": {
        "id": "Interiors_1978",
        "name": "Interiors",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secondtake"
        },
        "dateCreated": "2011-01-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077742/"
        },
        "name": "A large ensemble cast, written, filmed, and directed with quiet force....",
        "reviewBody": "Interiors (1978)\n\nThis is one of those dark, serious, realistic personal dramas that critics shook their heads at in 1978. It wasn't because it wasn't good--it's frankly a brilliant combination of the big three: acting, writing, photography. It was because it was directed (and written) by Woody Allen. And Woody Allen is funny, right? Critics at the time, however, to their credit, gave the film a fair reading, and for three brilliant excerpt of period reviews, I recommend the Wikipedia entry on the movie.\n\nSo watch this film thinking it's by someone else, if you have to. take it in on its own subtle terms as three sisters watch their own deficiencies bloom when their parents abruptly separate. There is some familiar territory here, actors Allen has turned to many times (including Diane Keaton, of course, who he was once, in 1970, involved with). The world is one that might actually be parallel to his own, not Jewish New York but rather a highly educated literary set with money and ambitions, but deeply steeped in the arts. \n\nIn short, \"Interiors\" was and is appreciated but always with a feeling that it isn't quite complete, that it isn't what it could have been. It's easy to see that it is unremittingly dour, almost to perversion. And you might say that it plays the Bergman card too hard without overt appropriation (which makes it merely derivative, that worst of echoes). It is fair, I suppose, to say that Allen really has succeeded, but not in the remarkable ways he had succeeded so clearly in his earlier films, including his previous nugget, \"Annie Hall,\" which is in my view his first true drama, but which has the benefit of also being funny.\n\nOr you can just sit back and take it in for what it does do so well, letting the interior lives of these people seem as shattered and pathetic as they really seem. The photography by Gordon Willis is admirable for being beautiful and inventive without being distracting. Allen and Willis make clear this intention with opening shots, a series of fixed camera views of rooms, and then views out windows, all framed with classic proportions, but sequenced to pull you in. But look how often the camera follows two people as they walk and talk, either up close in front of them, or along the beach through an irregular snow fence. Its pace and \"tastefulness\" of the photography almost seems designed by one of the main characters, the troubled interior decorator mother played with uncanny effectiveness by Geraldine Page.\n\nExpect nothing in particular here except a tour-de-force that works on its own depressing terms.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2658451737",
        "name": "Trailer [EN]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjA2YjU5MzUtOWQxNS00ZTlmLWIwOTEtMjZiYTZlYTZhZmJiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjA2YjU5MzUtOWQxNS00ZTlmLWIwOTEtMjZiYTZlYTZhZmJiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-01-14T20:56:58.451Z",
        "url": "https://www.imdb.com/video/vi2658451737/"
    },
    "url": "/title/tt0077742/"
}