{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lillian Gish",
            "url": "/name/nm0001273/"
        },
        {
            "@type": "Person",
            "name": "Robert Harron",
            "url": "/name/nm0366008/"
        },
        {
            "@type": "Person",
            "name": "Mae Marsh",
            "url": "/name/nm0550615/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16004,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "Intolerance",
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054813/"
        },
        {
            "@type": "Person",
            "name": "Hettie Grey Baker",
            "url": "/name/nm0048512/"
        },
        {
            "@type": "Person",
            "name": "Tod Browning",
            "url": "/name/nm0115218/"
        },
        {
            "@type": "Person",
            "name": "D.W. Griffith",
            "url": "/name/nm0000428/"
        }
    ],
    "datePublished": "1917-06-15",
    "description": "The story of a poor young woman separated by prejudice from her husband and baby is interwoven with tales of intolerance from throughout history.",
    "director": [
        {
            "@type": "Person",
            "name": "D.W. Griffith",
            "url": "/name/nm0000428/"
        }
    ],
    "duration": "PT2H43M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTc0YjA1ZjctOTFlZi00NWRiLWE2MTAtZDE1MWY1YTgzOTJjXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "babylon babylonia,paris france,jerusalem,multiple time frames,partially lost film",
    "name": "Intolerance: Love's Struggle Throughout the Ages",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jkogrady"
        },
        "dateCreated": "2002-11-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0006864/"
        },
        "name": "The Greatest Movie of all time... almost",
        "reviewBody": "I first saw this picture as a teenager some thirty years ago. I had no idea what to expect; all I knew was the famous still of Belshazzar's feast which has become one of the best known icons depicting the extravagance of crazy old Hollywood. But I was astounded and bowled over by what I saw. I will make no attempt at a plot synopsis here, since several other reviewers on this site have done so. Most readers already know that Griffith set out to tell four separate stories, laid in four widely spaced historical periods, and that he intercut freely between them, increasing the tempo as the film proceeded, and attempted to bring all four to a climax simultaneously. Clearly he bit off more than he, or anybody, could chew; but the fact that the limits of what cinema could do were being pushed so hard so early is what fascinated me then, and still fascinates me now. I wish to heaven that college film courses would just blow off \"Birth of a Nation\" and consign it to the oblivion it largely deserves, and show \"Intolerance\" instead, for this indeed is Griffith's monument, despite its poor state of repair; and at the risk of being technical I would like to address this. I have noticed that the one negative comment running most consistently through the reviews posted on this website is the relative lack of weight given to the French and Judaean sequences relative to the Modern and Babylonian narratives. This is largely the fault of the movie's checkered preservation history. When \"Intolerance\" failed to make huge sums at the box office, Griffith released the Babylonian and Modern stories as individual features in 1919, reshooting some scenes along the way. He cut up the original negative (gasp!) to do this, and by the time he decided to reassemble the whole movie in 1926, it turned out that all the king's horses and all the king's men couldn't quite put Humpty Dumpty back together again. There was never a shooting script, or a written continuity; Griffith kept the whole thing in his head, and moreover could never stop tinkering with it while it was in release! Consequently, while the Babylonian and Modern stories have survived largely intact, the French and Judaean episodes were depleted by about half. So when we see it now we must recognize that we are viewing a broken sculpture. The movie is a restorer's nightmare; almost a third of its 2000- plus shots exist in variant versions, and the captions were rewritten more than once. But, broken as it is, it's still magnificent. There has never been, and will never again be, anything like it. It has all of Griffith's inconsistencies: subtle and naturalistic acting from Mae Marsh and Robert Harron as the luckless couple in the Modern Story are seen cheek by jowl with outrageous mugging by Walter Long as the Musketeer of the Slums, or Josephine Crowell's Catherine de Medici in France; but no masterpiece on this scale is ever consistent, after all. I love Connie Talmadge's Mountain Girl from Babylon; smart, funny and crazy. Other favorites: Tully Marshall as the villainous Priest of Bel; Seena Owen as the Princess beloved, my personal nomination for Most Fabulous Body of the Hollywood 1910s, never mind the deranged costumes; Alfred Paget as a genuinely humane Belshazzar; Howard Gaye as a believable and totally unforced Jesus. Everything the silent screen of 1916 could do, good, bad, subtle, overblown, crazy or glorious is embodied here; and Griffith never rode so high again. The most satisfactory version currently available, in my opinion, is the Kino on Video edition on vhs and dvd, the one illustrated when you first call the picture up on this site. There are some problems and a few missing bits that I take exception to, but overall this is the version that first time viewers should try."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Intolerance",
        "duration": "PT42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3214715673",
        "name": "Intolerance",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjdmYjMzMDUtMDVkMC00MDBhLWE0ZDgtMzIyYTFmZWVmYWMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjdmYjMzMDUtMDVkMC00MDBhLWE0ZDgtMzIyYTFmZWVmYWMwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2014-02-02T07:36:21Z",
        "url": "https://www.imdb.com/video/vi3214715673/"
    },
    "url": "/title/tt0006864/"
}