{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yûki Amami",
            "url": "/name/nm0023858/"
        },
        {
            "@type": "Person",
            "name": "Atsuro Watabe",
            "url": "/name/nm0913777/"
        },
        {
            "@type": "Person",
            "name": "Eugene Harada",
            "url": "/name/nm0361720/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 859,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023391/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012762/"
        },
        {
            "@type": "Person",
            "name": "Masako Bando",
            "url": "/name/nm0051760/"
        },
        {
            "@type": "Person",
            "name": "Masato Harada",
            "url": "/name/nm0361735/"
        }
    ],
    "datePublished": "2001-01-27",
    "description": "Akira, the young new schoolteacher in town falls for secretive Miki, an older woman who takes care of her family's urn that supposedly holds a forest wolf-spirit, inugami. People soon start disappearing and the town blames Akira.",
    "director": [
        {
            "@type": "Person",
            "name": "Masato Harada",
            "url": "/name/nm0361735/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk3MjI5MDAzMl5BMl5BanBnXkFtZTcwMTAwMDcyMQ@@._V1_.jpg",
    "keywords": "mother son sex,female rear nudity,youth restored,death,legend",
    "name": "Inugami",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oowawa"
        },
        "dateCreated": "2007-10-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0277044/"
        },
        "name": "the Oedipus myth resurfaces in rural Japan",
        "reviewBody": "Yes, this beautifully filmed fable would have delighted Sigmund Freud. If you are really uncomfortable with the theme of incest, albeit unwitting, do not watch this movie, because it is central to the plot. As in Oedipus Rex, a grim fate hangs over and destroys the hapless characters involved. It is fascinating to watch this archetypal drama playing out in the context of a superstitious Shinto world view.\n\nBut this is not the only theme driving this complex drama. The interplay of the traditional and the modern is consistently in the forefront, and the film sees the good and the bad in both. The irreplaceable art of Japanese paper-making, which is shown in some detail, comes out of the same traditional culture that fosters destructive superstitious beliefs. Similarly, the forces of \"progress\" and modernity work for both good and bad purposes. A plan is afoot to cut down the beloved forest to make way for a big modern country resort, destroying what is good in the traditional culture (including the paper-making art); and yet the modern spirit of reason seems to be the only hope for freeing these villagers from the destructive superstitious beliefs that enslave them. The traditional world of Shinto is full of ghosts and deities, of beauty and horror, and it does not easily coexist with modernity. Nothing is simple here.\n\nThese are some of the themes at play in this complex fable. The film invites repeated viewings. There is much to see: it is very beautiful, and the acting is excellent. It is full of surprises, and is highly entertaining. When you watch, be careful to note the family connections of the characters. The family tree is important. Director Masato Harada has created something memorable and unique, and it cannot be easily classified in one genre or another.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0277044/"
}