{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liv Tyler",
            "url": "/name/nm0000239/"
        },
        {
            "@type": "Person",
            "name": "Jennifer Connelly",
            "url": "/name/nm0000124/"
        },
        {
            "@type": "Person",
            "name": "Joaquin Phoenix",
            "url": "/name/nm0001618/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13354,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003687/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Sue Miller",
            "url": "/name/nm2911434/"
        },
        {
            "@type": "Person",
            "name": "Ken Hixon",
            "url": "/name/nm0387025/"
        }
    ],
    "datePublished": "1997-04-04",
    "description": "Two working class brothers court three wealthy and beautiful sisters in a small Illinois town.",
    "director": [
        {
            "@type": "Person",
            "name": "Pat O'Connor",
            "url": "/name/nm0640466/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTY0YWM0MDgtYjE2Yi00ZWExLWE0M2MtN2U3YzRjMWNjMjExXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_.jpg",
    "keywords": "1950s,sex scene,female frontal nudity,working class,female rear nudity",
    "name": "Inventing the Abbotts",
    "original_info": {
        "id": "Inventing the Abbotts_1997",
        "name": "Inventing the Abbotts",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2001-05-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119381/"
        },
        "name": "Engaging Drama From Pat O'Connor",
        "reviewBody": "The lives of two brothers living in a small town in Illinois are profoundly affected by an alleged incident which took place even before one of them was born, in `Inventing the Abbotts,' directed by Pat O'Connor. The Abbotts are one of the wealthiest, most respected families in Haley, Illinois; Lloyd Abbott (Will Patton) is a successful businessman who, along with his wife, Joan (Barbara Williams), has raised three daughters, the oldest of whom, Alice (Joanna Going), is about to be married, while the youngest, Pamela (Liv Tyler), is about to graduate from high school. The Holts, on the other hand, are from the other side of the tracks, and Helen Holt (Kathy Baker) has had to raise her boys on her own. John (Billy Crudup), the oldest, was two-years-old when his father was killed in an accident, while Helen was pregnant with his brother, Doug (Joaquin Phoenix). There's no mystery about what happened in the accident; the bone of contention concerns what happened afterwards-- at least in the eyes of John, even all these years later as he is about to enter collage. \n\n\tJohn and Doug's father, it seems, had been business partners with Lloyd Abbott, but after his death, a patent that Mr. Holt owned somehow ended up in Lloyd Abbott's name, making him a wealthy man, while the Holt's ended up in their current state of affairs-- not exactly poor, but barely making ends meet. And since his youth, John has been fixated with the Abbotts, especially their daughters, and one in particular, Eleanor (Jennifer Connelly). But as with most things involving an obsession, it only put John on a lifelong emotional road to nowhere.\n\n\tTold from Doug's point of view, the story becomes a lesson in life; when to leave the baggage of things best forgotten behind and move on. Phoenix gives an affecting performance as Doug, who has an on-again-off-again relationship with Pamela, the one sister who is, `Just there,' as she says (according to her, Alice is the `good' one, Eleanor the `bad'). He captures that sense of being at an age when uncertainty is the only absolute, and you feel his need to search and seek out that toe-hold on life that is often elusive to the young. There's an understated ring of truth in his portrayal that adds that depth which makes his character credible, and one to whom it is easy to relate.\n\n\tCrudup delivers, as well, with a performance wound in introspective tension so tightly that there are moments when it seems almost tangible. He carries a burden-- that from which his obsession was born-- and it shows. John has so much going for him (the love of his mother and brother; good looks; intelligence), that watching him suffer so emotionally-- even at arm's length-- is sad to see, especially in light of the fact that it is so unnecessary. Still, some of his actions (especially one late in the film) are intrinsically almost too brutal to forgive; only so much, after all, can be buried amid rationalization. In the end, you feel for him, but only so far; and then you are compelled to do what he could not-- you move on.\n\n\tAs Pamela, Liv Tyler turns in a reserved performance that captures something of that same sense of confusion reflected in Doug's character. A bit more grounded, perhaps, but there is still that `searching' going on within her. Connelly, meanwhile, gets into her role as the'bad' sister with relish, exuding a self-assured sexual tension qualified with just enough restraint to make Eleanor a memorable and effective character. Going does a nice job, also, though by the nature of her character alone, she is bound to be somewhat overshadowed by Tyler and Connelly.\n\n\tThe supporting cast includes Michael Sutton (Steve), Alessandro Nivola (Peter), Shawn Hatosy (Victor) and Michael Keaton as the narrator. An engaging and often poignant drama, `Inventing the Abbotts' puts love, loss and confusion (one might say the mainstays of life) into perspective, and illustrates that how we deal with it all is not necessarily a matter of individual choice. Some, in fact, just may have to invent whatever it is they need to hang onto. At one point in the film, Doug says of his brother, `If the Abbotts hadn't existed, John would've invented them.' And maybe that's the way it is; taking life as it comes and dealing with it the best way you know how. I rate this one 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1368523033",
        "name": "Inventing the Abbotts",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2FiNWNhMWQtNmJjOS00MGE4LTlhMzAtZjI4M2E2NWQxYjUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2FiNWNhMWQtNmJjOS00MGE4LTlhMzAtZjI4M2E2NWQxYjUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:46:16Z",
        "url": "https://www.imdb.com/video/vi1368523033/"
    },
    "url": "/title/tt0119381/"
}