{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jouko Ahola",
            "url": "/name/nm0014261/"
        },
        {
            "@type": "Person",
            "name": "Tim Roth",
            "url": "/name/nm0000619/"
        },
        {
            "@type": "Person",
            "name": "Anna Gourari",
            "url": "/name/nm1139465/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4418,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039268/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069314/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037091/"
        },
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "datePublished": "2002-01-17",
    "description": "A Jewish strongman performs in Berlin as the blond Aryan hero Siegfried.",
    "director": [
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "duration": "PT2H13M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY3MDcxMzQ4MV5BMl5BanBnXkFtZTcwMzI2NzAwMQ@@._V1_.jpg",
    "keywords": "strongman,jewish,blacksmith,rabbi,poland",
    "name": "Invincible",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2005-12-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0245171/"
        },
        "name": "Had potential but doesn't hang together like it should and has too many poor or average aspects",
        "reviewBody": "Zishe is a Jew living in Poland and working with his family as a blacksmith. When a fight breaks out in a local restaurant, Zishe uses his impressive strength to fend off his attackers but finds himself facing a bill for the damage. To make the money to cover the cost, Zishe enters a local circus to challenge the resident strongman. Easily winning, he draws the attention of a talent scout who offers him the chance for more work in Germany. Despite the reservations of his parents, Zishe travels to Berlin where he joins the high-class show of mystic Hanussen. Playing to mostly film stars and members of the ascending Nazi party, Zishe plays the role of an Aryan strongman. Initially happy to do so, the deception and denial of self gradually eats at him as he performs on stage.\n\nI may not be the most cine-literate person in the world but I know enough to give any film from Werner Herzog a try to see what happens. With this film I was interested from the very start as it throws up an interesting \"true\" story that I had never heard before. It opens well but it only manages to hang together until the middle of the film, at which point the direction of the story starts to badly waver and, with a mostly amateur cast and some clunky dialogue, it cannot do anything to really turn it around. After a while it does become dull and rather aimless which was a shame given the potential that it showed early on. The problems of narrative will probably worry Herzog's fans less than the casual viewer though but what will surprise them is how visually ordinary it all is. It all looks good and has some nice use of locations but generally it lacks imagination or the flair for the unusual, with only the out-of-place use of the crabs sticking in the mind as an image.\n\nThe cast are mixed, with some good performances and some terrible ones. Ahola falls somewhere in the middle; he is not the most expressive man in the world but he has a good presence and his gentle strongman performance works for the majority  it is only in the latter stages where more is asked of him where he comes up wanting. Roth is impressive of course and he does add a much needed professionalism into the film when given the chance. The rest of the cast are mostly average at best  not a major problem but few people will defend the bland and flat deliveries of people like Gourari and Wein  both of whom come over as if they would struggle to read a traffic sign in a convincing manner.\n\nOverall this is an OK film at best  starting with potential but fading away long before the end. The performances are mostly average but what is more surprising is that Herzog doesn't really make the film his own  some of it looks interesting but it lacks the visual style that I had hoped for and it doesn't offer a great deal in its place."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi799998233",
        "name": "Invincible (2001)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODQzNWUxZjYtMzhhMC00YmRiLThjZmYtNTVlYTgwODcxM2JkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODQzNWUxZjYtMzhhMC00YmRiLThjZmYtNTVlYTgwODcxM2JkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:35:10Z",
        "url": "https://www.imdb.com/video/vi799998233/"
    },
    "url": "/title/tt0245171/"
}