{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Iron Maiden",
            "url": "/name/nm1442043/"
        },
        {
            "@type": "Person",
            "name": "Bruce Dickinson",
            "url": "/name/nm0225503/"
        },
        {
            "@type": "Person",
            "name": "Dave Murray",
            "url": "/name/nm1201359/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2221,
        "ratingValue": 9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035780/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011390/"
        }
    ],
    "datePublished": "2002-08-20",
    "description": "Live concert on the back of 'Brave New World' album, showing why they're one of the greats, performing many hits from their long career, a band at its peak.",
    "director": [
        {
            "@type": "Person",
            "name": "Dean Karr",
            "url": "/name/nm0440061/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI1OTIwMjU4NV5BMl5BanBnXkFtZTYwNjk1ODM5._V1_.jpg",
    "keywords": "concert film,rock musician,guitar,english,brazil",
    "name": "Iron Maiden: Rock in Rio",
    "original_info": {
        "id": "Iron Maiden: Rock in Rio_2002",
        "name": "Iron Maiden: Rock in Rio",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2007-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0280898/"
        },
        "name": "Effective concert film for the casual metal fan",
        "reviewBody": "To mark the release of their new (at the time) album \"Brave New World\", heavy metal group Iron Maiden took their show to approximately ¼ million people live in Rio de Janeiro. Now, I'm not a Maiden fan although I do know a couple of their bigger hits. Mainly a lot of metal sounds the same to me but the odd time I have been to a metal concert I have found that it works well for me in a crowd. So why did I watch this film then? Well partly out of interest  I knew it is so highly rated on this site because it had been viewed by fans and I was curious as a casual viewer.\n\nHowever my main reason for watching it was because earlier this week I watched Alice Cooper live in 1975 and enjoyed seeing the clichés that Spinal Tap spoofed being presented as real. However it did make me think about how stadium rock has grown from there to where it is now  and Iron Maiden are a fine example of what it means today. So where Cooper had people dressed in monster suits running over his stage, Maiden have a massive wicker man and hundreds or thousands of people in a state of the art show. Of course it helps to be a fan but if you do like metal even slightly then this gig is roundly good  you don't really need to specifically like Iron Maiden.\n\nFor the casual viewer the gig is impressive anyway because of the scale of it but it did also give me enjoyment in seeing the modern rock clichés being played out (and I don't mean clichés in a negative way). So we get sweat, big hair, the wide-foot guitar playing stance and so on. It all suits the atmosphere of energy and friendly aggression from the crowd and I found the music more enjoyable than I probably would if I had just been listening to the studio album. The band themselves may be clichés but they do have great stage presence  Dickinson in particular runs the stage well and seems able to control a crowd this size.\n\nOverall then, understandably popular with fans but interesting enough for the casual viewer. The stadium rock clichés are in full effect and the heavy metal tracks all work well within the context of a massive crowd. I probably enjoyed it more due to the juxtaposition with the Alice Cooper concert but it is still an effect concert film."
    },
    "url": "/title/tt0280898/"
}