{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Patrick Caddell",
            "url": "/name/nm0128082/"
        },
        {
            "@type": "Person",
            "name": "Ann Coulter",
            "url": "/name/nm1326010/"
        },
        {
            "@type": "Person",
            "name": "Susan Estrich",
            "url": "/name/nm1136015/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 105,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "datePublished": "2004-05-05",
    "description": "ICON...OR IDIOT? The most controversial political commentator of our day, Ann Coulter has sparred with Katie on the \"Today Show,\" faced down Alan Dershowitz on \"Geraldo\" and sparked stormy confrontation on scores of college campus...",
    "director": [
        {
            "@type": "Person",
            "name": "Elinor Burkett",
            "url": "/name/nm1754444/"
        },
        {
            "@type": "Person",
            "name": "Patrick Wright",
            "url": "/name/nm1752974/"
        }
    ],
    "duration": "PT40M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "keywords": "punctuation in title,question in title",
    "name": "Is It True What They Say About Ann?",
    "original_info": {
        "id": "Is It True What They Say About Ann?_2004",
        "name": "Is It True What They Say About Ann?",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Anonymous_Maxine"
        },
        "dateCreated": "2006-08-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0431153/"
        },
        "name": "If you can't say anything nice, write a lot of books about it.",
        "reviewBody": "I'll tell you my problem with Ann Coulter. It's not so much that she disagrees politically with me or even that she condemns so many things that I believe in or just the way I see the world, it is that she cannot disagree with people like me in a civil way. So much of her platform is about how liberals are so childish and can't disagree with people on the right without reducing their argument to some goofy religious nonsense, they can't be friends with people on the right, they can't over look their differences with people on the right and just act like adults. Has she read any of her own books? \n\nPeople like Susan Estrich and especially Bill Maher appear in this documentary to talk about how great Ann Coulter is because she has different views than they do but they are still friends with her. Interesting, because while this does speak highly of Estrich and Maher, the liberals in the situation, incidentally, the rest of the film is composed of footage of Coulter spouting hatred and prejudicial nonsense about liberals as though they were all copies of the same person. Odd that she would accuse liberals of being intolerant and childish, and then so incontestably describe herself through interviews and speeches as being exactly that herself.\n\nThe amount of prejudice and blanket observations made about liberals is an interesting illustration of Coulter's massive hypocrisy, which might be rivaled only by that of her colleague, Rush Limbaugh, who has for years yammered on about how we need to clean up our streets, throw drug addicts in prison and throw away the key and whatnot. In her defense, at least she stays somewhat away from the naked, unapologetic racism of people like Michael Savage. Somewhat.\n\nI will say this in favor of Ann Coulter, she certainly knows what she believes and she will not alter her beliefs for anyone or for any reason. I actually do respect that a lot, because I have definitely been put off by the flip flopping that I have seen in politicians on both sides. Coulter doesn't however, plan on ever running for office, and thank god. That would be like Michael Moore running for elected office, an equally frightening prospect. \n\nMaybe I can put my thoughts in perspective in this way. Michael Moore is a left wing lunatic, and Ann Coulter is a right wing lunatic. They are essentially playing the same role on different teams. But I'll tell you the difference between them, and it's an important one. Michael Moore finds corruptions and lies and hypocrisies and other problems among Republicans, and he blows them wildly out of proportion and takes them out of context in order to further his own agenda. Ann Coulter, on the other hand, INVENTS lies and hypocrisies and other problems among Democrats and liberals, and blows them wildly out of proportion and takes them out of context to further her own agenda. \n\nNow, that's kind of a loose statement when I say further her agenda, because her agenda is really nothing more than getting attention. She is a shock jock exactly like Howard Stern, who openly admits that she comes up with the most shocking thing she can think of and then pushes the envelope even further. What validates her, frighteningly enough, is that she really believes all of this stuff she says, which she just admitted is the most extreme thing she can come up with. \n\nThe problem is that she structures her arguments in a way that is impossible to take seriously on any intellectual level. Her arguments all too often take the form of stupid jokes aimed at getting a laugh and cheap approval from her audience, who just want to hear someone say something mean about the other side into a microphone. \n\n\"Some illegal aliens were detained after September 11. Some were detained so long they had to drop out of flight school altogether.\"\n\nThis quote comments on her utter disdain of illegal aliens in a pretty disturbing way, because she is showing her contempt for them as human beings, not as illegal citizens. She disregards them as though they don't exist because they don't have passports, and then gets a good laugh by suggesting that all illegal aliens are terrorists. And the laugh that she gets in response speaks volumes about her fans. \n\nIt's really sad that Coulter is so over-flowing with hatred, it's kind of depressing to see someone like her pretend that she enjoys her criticism, because if you watch her reactions as she is faced with fans who ask her to sign their TRAITOR t-shirts or their copy of Mein Kampf, it becomes increasingly clear that she doesn't enjoy it. I guess because my views are so different, on some deep level I find it hilarious that she tries so hard to pass it off like she enjoys and is even amused by the negative reactions that she generates. It is truly pathetic, why say something like that in the same documentary that so clearly shows otherwise?\n\nAt any rate, my biggest problem with her is that she makes that idiotic claim that so many on both sides have made, \"so-and-so hates America.\" And it's not even just Michael Moore, it's LIBERALS. She literally states that half of America hates America. This might be the dumbest political statement ever made. \n\nNote: Coulter signs a liberal college student's t-shirt with the charming phrase \"Have fun in Guantanamo.\" A STUDENT. \n\nAnn Coulter doesn't hate America. She hates Americans.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0431153/"
}