{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean-Paul Belmondo",
            "url": "/name/nm0000901/"
        },
        {
            "@type": "Person",
            "name": "Charles Boyer",
            "url": "/name/nm0000964/"
        },
        {
            "@type": "Person",
            "name": "Leslie Caron",
            "url": "/name/nm0001989/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4960,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "Is Paris Burning?",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012478/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060884/"
        },
        {
            "@type": "Person",
            "name": "Larry Collins",
            "url": "/name/nm0172468/"
        },
        {
            "@type": "Person",
            "name": "Dominique Lapierre",
            "url": "/name/nm0487535/"
        },
        {
            "@type": "Person",
            "name": "Gore Vidal",
            "url": "/name/nm0000683/"
        }
    ],
    "datePublished": "1966-10-26",
    "description": "August 1944. The Allies are approaching Paris and resistance groups within the city start to plan an uprising against the Germans. However, Hitler wants the city destroyed if it looks like the Allies will take it.",
    "director": [
        {
            "@type": "Person",
            "name": "René Clément",
            "url": "/name/nm0167496/"
        }
    ],
    "duration": "PT2H53M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDA4MjAyOWQtYzg3Yi00ZWMyLWI1YTEtNzJlMjllNTA5MmE2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "year 1944,1940s,allies,nazi general,french military",
    "name": "Paris brûle-t-il?",
    "original_info": {
        "id": "Is Paris Burning?_1966",
        "name": "Is Paris Burning?",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2006-06-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060814/"
        },
        "name": "What is France Without Paris?",
        "reviewBody": "About 350 years earlier Henry of Navarre had captured just about all of France, but Paris and had been ruling as Henry IV for about five years but he decided he wasn't really king without his capital. He converted to the Catholic religion and Paris became united with the rest of the country. Henry decided that Paris was indeed worth a mass.\n\nFast forward to 1944. Maybe militarily Paris wasn't worth that much in defeating Hitler, but for the morale of a people being liberated from a brutal conqueror it was invaluable. When the forces of the Resistance in its many branches could no longer be contained with Allied armies only days from Paris, battle plans got changed and a Free French Division under General Phillippe Leclerc went in and helped the Resistance take the city.\n\nParis brule-t-il is the French cinema's answer to The Longest Day. It is dotted with cameos from French, German, and American film players and makes very effective use of newsreel footage blended into the finished product. You really do think you are watching an actual filmed record of the events as they happened.\n\nThe lead in this film is German actor Gert Frobe, better known to audiences as James Bond nemesis Goldfinger. The film opens with him being given command of the city by Hitler himself and given very specific orders to destroy the city before it was recaptured.\n\nFrobe knows it and finally admits that the war is lost. He's concerned about what history will think of him should he do this terrible thing. He gets a direct order from Hannes Messemer playing Alfred Jodl and a reminder of what Hitler does to those who disobey him. Frobe's character General Von Choltitz died shortly after this film debuted and Jodl was executed after being tried at Nuremberg. \n\nJean-Paul Belmondo, Alain Delon, Jean-Pierre Cassel, Yves Montand are all playing roles of Resistance members. Leslie Caron has a poignant small part as a woman trying unsuccessfully to get her husband freed before the Nazis ship him off to Germany before retreating. \n\nAmericans in this film are Kirk Douglas as General Patton, Glenn Ford, as General Bradley and Robert Stack as General Siebert. Those three were put in briefly to insure some American box office in a French story. Funny no one thought of Douglas for the Patton biographical film classic four years later.\n\nOrson Welles has a much bigger part as the Swedish consul general in Paris who negotiates between the Nazis and the Resistance before the Free French Division arrives. Another one of those brilliantly executed parts by Welles he did to get money for his own projects.\n\nDirector Rene Clement really made the people of Paris the star of this film. It is their tribute picture and a terrible reminder to people in every nation what it is like to live under a tyranny.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT7M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4144021017",
        "name": "Bande-annonce [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWYyYzkwZTEtOTI4YS00NzFjLWI0ZmYtM2E1N2RiYTk2ZmNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWYyYzkwZTEtOTI4YS00NzFjLWI0ZmYtM2E1N2RiYTk2ZmNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-06T10:57:48.268Z",
        "url": "https://www.imdb.com/video/vi4144021017/"
    },
    "url": "/title/tt0060814/"
}