{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Malcolm McDowell",
            "url": "/name/nm0000532/"
        },
        {
            "@type": "Person",
            "name": "Talisa Soto",
            "url": "/name/nm0000650/"
        },
        {
            "@type": "Person",
            "name": "Bruce Ramsay",
            "url": "/name/nm0708873/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 926,
        "ratingValue": 2.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Peter Koper",
            "url": "/name/nm0465756/"
        },
        {
            "@type": "Person",
            "name": "Tim Southam",
            "url": "/name/nm0816074/"
        }
    ],
    "datePublished": "2000-11-14",
    "description": "Stranded on a deserted island, a group of people struggles to survive against a swarm of supernatural flies.",
    "director": [
        {
            "@type": "Person",
            "name": "Tim Southam",
            "url": "/name/nm0816074/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjQ3OTc0OTI3NF5BMl5BanBnXkFtZTcwMDQ3NzYxMQ@@._V1_.jpg",
    "keywords": "cgi effects,killer fly,stranded on an island,real estate tycoon,new york cop",
    "name": "Island of the Dead",
    "original_info": {
        "id": "Island of the Dead_2000",
        "name": "Island of the Dead",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol1218"
        },
        "dateCreated": "2005-04-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0157836/"
        },
        "name": "Dead in the water",
        "reviewBody": "**SPOILERS** Sargeant Melissa O'Keefe,Talisa Soto,of the NYPD Missing Person Bureau sets out for Hart Island with a burial unit of convicts to find and identify a young girl. The girl is believed to have be buried on the island's Potters Field and Melissa, who was abundant as an infant herself, has this strong identification with missing persons. Melissa wants at least to have them identified, when found, so that she can put their friends and relatives to rest by not wondering if their alive or dead. \n\nAt the island there's a ground-breaking ceremony for a low-rent housing project, Hope City, with the city's mayor and multi-billionaire real estate tycoon Rupert King, Malclom McDowell. The hosing development is being built to keep the riff-raft off the city streets and hide them away there from the public for strictly \"humanitariam\" purposes. The fact is that King has other purposes for bringing the city's unwanted there and it's for him getting rich by using them as experiments for the pharmaceutical companies that he owns. \n\nYou have to have a real strong stomach to sit through this film with people getting attacked by these super flies who not only infect them with their eggs but who cause their victims to burst open and decompose within minutes. The grossed out scenes in the film have countless maggots crawling out of the infected peoples corpses. The mad and arrogant King had been planing to do this for years by using Hart Island as a laboratory and the use poor and unwanted as guinea pigs. Now with him in trouble financially, he had six major failures in a row, this project The Hope City Devlopment will put him back on top but the over one million bodies buried in Potters Field have other ideas for King and their not very pleasant. It's too bad that almost everyone on Hart Island gets eaten from the inside out by the fly hatching maggots with the person that they were really after Rupert King getting his at the very end. \n\nEven though the movie was anything but rational and coherent,especially after some thirty minutes into it, it did for a time hold your interests. The cast also did a much better job then the flimsy material that they were saddled with. There was also the very effective and eerie atmospherics of the spooky Hart Island and Potters field that at times made your flesh crawl. But the plot fell apart with the flies becoming more and more unbelievable as they just seemed to come and go, as if they were out to lunch. Making it possible for those on the island to predict just when it was safe to go outside and eventually escape by boat.One of the most ridicules scenes I've ever seen in a movie is when King is attacked by millions of killer flies and to keep them away from him he blasts away at them with his handgun.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from A-Pix Entertainment",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1471086873",
        "name": "Island of the Dead",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmUzNWE1ZDctMWE4Yi00MmZmLTg3OGItODc5NDFlZWNhNzQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmUzNWE1ZDctMWE4Yi00MmZmLTg3OGItODc5NDFlZWNhNzQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:35:34Z",
        "url": "https://www.imdb.com/video/vi1471086873/"
    },
    "url": "/title/tt0157836/"
}