{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Lau",
            "url": "/name/nm0490489/"
        },
        {
            "@type": "Person",
            "name": "Tony Ka Fai Leung",
            "url": "/name/nm0504899/"
        },
        {
            "@type": "Person",
            "name": "Paulyn Sun",
            "url": "/name/nm0837282/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 799,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Island of Greed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003221/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0096034/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056958/"
        },
        {
            "@type": "Person",
            "name": "Johnny Mak",
            "url": "/name/nm0538332/"
        },
        {
            "@type": "Person",
            "name": "Man-Keung Chan",
            "url": "/name/nm0151013/"
        },
        {
            "@type": "Person",
            "name": "Jesse Hung",
            "url": "/name/nm2641141/"
        }
    ],
    "datePublished": "1997-12-23",
    "description": "Island of Greed is a 1997 Hong Kong action crime thriller film directed by Michael Mak and starring Andy Lau and Tony Leung Ka-fai. The film is set and filmed in Taiwan and deals with corruption in the Government of the Republic o...",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Mak",
            "url": "/name/nm0538328/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Action",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTAxODU1MDk2MV5BMl5BanBnXkFtZTcwOTMzMjUxMQ@@._V1_.jpg",
    "keywords": "corruption,mayor,strangled to death,dog,bus explosion",
    "name": "Hei jin",
    "original_info": {
        "id": "Island of Greed_1997",
        "name": "Island of Greed",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Libretio"
        },
        "dateCreated": "2005-02-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0156588/"
        },
        "name": "Disappointing crime drama, despite its large-scale ambition",
        "reviewBody": "ISLAND OF GREED (Hei Jin)\n\nAspect ratio: 2.39:1 (Anamorphic)\n\nSound format: Dolby Digital\n\nA Taiwanese special agent (Andy Lau) goes on the trail of a Triad gang leader (Tony Leung) who attempts to bribe his way into political office.\n\nLarge-scale blockbuster from director Michael Mak, unusual for its up-front exploration of Triad involvement in Taiwanese politics. Stand-out action set-pieces include a chaotic shoot-out in a crowded marketplace between Lau's men and a group of would-be assassins, and a large-scale riot on the streets of Taipei as taxi drivers stage a huge strike commissioned by Leung for nefarious purposes. Look out, too, for an audacious sequence in which Lau and his cohorts struggle to prevent a character from being attacked by snapping Alsatians, though this scene is compromised by images of horrific animal cruelty (chickens are dragged behind speeding vehicles and savaged by the rampaging dogs, for real), resulting in this scene being completely removed from British prints.\n\nThe narrative unfolds at such a breakneck pace, it's often difficult to keep tabs on proceedings, and the film will leave some viewers trailing in its headlong wake. Leung is terrific as the vicious gangster stifled by circumstances beyond his control, and weary of his arrogant superiors, and Pauline Suen (\"Love and Sex of the Eastern Hollywood\") is equally strong as his sexy but ill-bred wife, all too aware of her intellectual limitations but desperate to support her husband's political ambitions. Sadly, Lau is rather anonymous in a role which gives him virtually nothing to do, and his character barely registers as a presence. Given its setting, the film was recorded in sync-sound Mandarin and dubbed into Cantonese for its Hong Kong theatrical release - stick with the original.\n\n(Mandarin dialogue)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0156588/"
}