{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kenneth Tobey",
            "url": "/name/nm0864851/"
        },
        {
            "@type": "Person",
            "name": "Faith Domergue",
            "url": "/name/nm0231409/"
        },
        {
            "@type": "Person",
            "name": "Donald Curtis",
            "url": "/name/nm0193321/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5899,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015756/"
        },
        {
            "@type": "Person",
            "name": "George Worthing Yates",
            "url": "/name/nm0946753/"
        },
        {
            "@type": "Person",
            "name": "Harold Jacob Smith",
            "url": "/name/nm0808414/"
        }
    ],
    "description": "A giant, radioactive octopus rises from the Philippine Trench to terrorize the North American Pacific Coast.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Gordon",
            "url": "/name/nm0330036/"
        }
    ],
    "duration": "PT1H19M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIwMzI0NDI2NV5BMl5BanBnXkFtZTgwNjU5MzU5MTE@._V1_.jpg",
    "keywords": "radiation,creature feature,psychotronic film,octopus,giant octopus",
    "name": "It Came from Beneath the Sea",
    "original_info": {
        "id": "It Came From Beneath the Sea_1955",
        "name": "It Came From Beneath the Sea",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dodonna"
        },
        "dateCreated": "2003-06-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048215/"
        },
        "name": "A decent, but slooow giant monster flick.",
        "reviewBody": "I've been a fan of Ray Harryhausen since I was old enough to appreciate movies, so I bought the DVD of \"It Came From Beneath the Sea\" even though I hadn't seen the film in many years. Having rewatched it, I have to admit that it's perhaps the least of his film accomplishments.\n\nOnce again, the atomic bomb provides the justification for another giant monster, though, despite what has been inaccurately reported elsewhere, the octopus in the film has not been mutated by radiation. It's simply a very large example of its kind that was living at the bottom of a deep ocean trench. When atomic testing made it radioactive, it couldn't effectively hunt because other sea creatures could somehow sense its presence. Therefore, it came to the surface in search of food.\n\nOne of the major problems with this film is that while an octopus makes a decent giant monster, it completely lacks the personality of some of Harryhausen's other creatures. Furthermore, it is confined to the sea--and, by extension, the shoreline--limiting its ability to go on a proper rampage.\n\nEven at 79 minutes, the film moves very slowly until the climax. The opening sequence, in which the beast attacks a submarine captained by Kenneth Tobey's character, goes on for several very long minutes of inconsequential naval dialogue.\n\nThe lethargic pacing extends to the plot as well. The team of scientists assigned to determine what attacked the sub take a full two weeks to identify it as an octopus.\n\nAn odd love triangle of sorts pads the running time. Faith Domergue--who is presented as a modern feminist despite her tendency to scream on cue--seems just as interested in Tobey's navy man as she does in her fellow scientist. The two men acknowledge the triangle, but neither seems at all competitive about it.\n\nDomergue is one of the best things about the film. She's credible as both scientist and sweater gal, and is a good example of the increasing role of female characters in science-fiction films of the period.\n\n Once the octopus attacks in earnest, things pick up quite a bit, and Harryhausen's effects--including stop-motion-animated building demolition--are quite effective. While this is definitely a lesser effort for him, he still shows what he can do with a small budget and a relatively uninteresting monster."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1236205849",
        "name": "It Came from Beneath the Sea",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWVmYzljZjAtMjRiOS00MTc0LWEwN2EtYWQ2MWM4Njc3NmM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWVmYzljZjAtMjRiOS00MTc0LWEwN2EtYWQ2MWM4Njc3NmM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:35:37Z",
        "url": "https://www.imdb.com/video/vi1236205849/"
    },
    "url": "/title/tt0048215/"
}