{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clark Gable",
            "url": "/name/nm0000022/"
        },
        {
            "@type": "Person",
            "name": "Sophia Loren",
            "url": "/name/nm0000047/"
        },
        {
            "@type": "Person",
            "name": "Vittorio De Sica",
            "url": "/name/nm0001120/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2922,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029180/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Melville Shavelson",
            "url": "/name/nm0789520/"
        },
        {
            "@type": "Person",
            "name": "Jack Rose",
            "url": "/name/nm0741439/"
        },
        {
            "@type": "Person",
            "name": "Suso Cecchi D'Amico",
            "url": "/name/nm0147599/"
        }
    ],
    "datePublished": "1960-08-07",
    "description": "Days before his wedding, a Philadelphia lawyer travels to Naples in Southern Italy to settle the estate of his late brother, only to find that he has an Italian nephew who is being cared for by his maternal aunt, a cabaret singer.",
    "director": [
        {
            "@type": "Person",
            "name": "Melville Shavelson",
            "url": "/name/nm0789520/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGY1NTY3NDgtOWRkMS00MjU1LWFiMWMtMGJhODg2OTI2ZjY2XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "capri italy,tourist,uncle,aunt,nephew",
    "name": "It Started in Naples",
    "original_info": {
        "id": "It Started in Naples_1960",
        "name": "It Started in Naples",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "theowinthrop"
        },
        "dateCreated": "2005-09-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053957/"
        },
        "name": "The Education of an Ugly American",
        "reviewBody": "This is the penultimate film of the career of Clark Gable, and his last comedy. He is a Philadelphia lawyer named Michael Hamilton, who is about to marry a suitable middle aged woman at home (we never see her), and must delay the marriage while he goes to Naples to settle the estate of his long estranged brother. He is unaware of the details, but his brother was never a hard headed, hard working type - and he had fled to Italy, where he seems to have drowned in an accident. Mike discovers his brother was out fishing with his wife when a sudden squall upset the boat and drowned them. He also discovers his brother lived up to his reputation as a ne'er-do-well by specializing in making great fireworks, and left a little boy named Nando (Marietto). But Nando's mother had a sister named Lucia (Sophia Loren) who appears at a local Capri nightclub. Mike and Lucia find themselves at odds about Nando's present and future lifestyle: Mike wants the boy brought up in America, while Lucia wants him in a happier, earthier life in Italy. Soon Nando, Lucia, Mike, and Mike's lawyer Vitale (Vittorio De Sica) manage to bring the blood uncle and blood aunt into a closer and closer relationship. Eventually they fall in love.\n\nGable's performance was similar to a middle class \"Ugly American\" as in the contemporary novel and the movie with Marlon Brando. Mike is a successful lawyer, and he wants his brother's son to get the breaks he needs in good schools and with a normal home. He cannot believe that the little fellow is not degenerating, but is actually in a loving household with Lucia. In the first third of the film Gable makes a lot of snide comments about the easy take it life style he sees around him in Italy. It is only gradually that he realizes that the Italians can be serious when they want, and that there is nothing wrong (as he eventually admits) to being an elderly carriage driver singing \"So Long to Sorrento\" for his fares' amusement. He also can see that his first choice for marriage is even stuffier than he is, or that there were some really unattractive aspects in his fellow American tourists (witness that final scene in the railway car he is leaving Naples in).\n\nLucia is also an interesting character - she mistrusts Americans (as her song \"Americano\" spoofs their foibles), but her own ambitions for success mirror the type of work ethic that is part of the American persona. She also is a realist - she insists that Nando speak English at home, rather than Italian. The reason (aside from the obvious screenplay reason of allowing the audience to understand the conversation) is that English is the international tongue of the modern age. If Nando is to succeed, he has to speak English well. Her affection for her nephew is deep - to the point that she is willing to even consider losing him for his own good.\n\nNando is trying to find a balance between his aunt and uncle. He loves the aunt, and gets to really like Mike, but he can't understand why Mike can't only leave him with Lucia, and then occasionally visit. When Mike and Lucia become an item (or appear to be one), well that's fine too - they can take up where his parents left off. But he is capable of knowing if something is going wrong. When Mike says he wants to talk to him \"man to man\" Nando's face drops, and he says he never likes it when he hears \"man to man\".\n\nVitale is an interesting supporting character. As the lawyer for Mike's brother he is obliged to tell him what the deceased's estate was (mostly fireworks and Nando). He begins processing Mike's legal moves to get custody of Nando away from Lucia. Lucia confronts Vitale, calling him a traitor to Italy for helping an American steal her nephew, and calling him a pig (as his looks at the sumptuous Lucia/Sophia Loren reveal). His helpless reply is that a man can be both a lawyer and a pig. In the end, in the courtroom, he is so twisted by his loyalties that he cannot give Mike a coherent (or even fair) defense. One can understand his dilemma.\n\nIt is a sweet comedy, that holds up very well. It makes one wonder if Gable would have continued in roles like this one had he not died so soon after THE MISFITS.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1917763097",
        "name": "It Started in Naples",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWNjMWM0MTktZDU4Mi00ZGQ1LTliNDgtZjAwMjkzYjJlZDk4XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWNjMWM0MTktZDU4Mi00ZGQ1LTliNDgtZjAwMjkzYjJlZDk4XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-29T17:02:37.272Z",
        "url": "https://www.imdb.com/video/vi1917763097/"
    },
    "url": "/title/tt0053957/"
}