{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jodie Foster",
            "url": "/name/nm0000149/"
        },
        {
            "@type": "Person",
            "name": "Lou Hall",
            "url": "/name/nm1705642/"
        },
        {
            "@type": "Person",
            "name": "Reena Sands",
            "url": "/name/nm1703484/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 146,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132064/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0132065/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027228/"
        }
    ],
    "description": "Feature-length documentary deals with homeless women, once secure in their middle-class status, who through divorce, misfortune, or circumstances were reduced to living on the street.",
    "director": [
        {
            "@type": "Person",
            "name": "Michèle Ohayon",
            "url": "/name/nm0644977/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM2NTM0MTEzOV5BMl5BanBnXkFtZTcwMjg4NzUyMQ@@._V1_.jpg",
    "keywords": "divorce,single parent,claim in title,single mother,homelessness",
    "name": "It Was a Wonderful Life",
    "original_info": {
        "id": "It Was a Wonderful Life_2002",
        "name": "It Was a Wonderful Life",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cmm957"
        },
        "dateCreated": "2008-05-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107232/"
        },
        "name": "heartbreaking",
        "reviewBody": "This film has haunted me since I saw it. The film explores the everyday realities of the working poor (and even the middle and upper middle class) who have slipped through the cracks and ended up the hidden homeless. It shows in brutal detail the reality of life in a car, where even showers (let alone work) are a difficult luxury to obtain. It was made in 1992 (during a recession), so I only wish there was an update since the real estate boom in California--and how it affected the women in this population.\n\nThe film also painstakingly depicts the flimsiness of bureaucratic programs/solutions to aid these women and those like them, as well as the ways that government policies actively antagonize these situations . Especially painful is the part on Section 8 housing subsidies--when one of the women calls to inquire and finds that not only are there no applications being accepted, but there is also a waiting list of 3+ years for those who have already applied. And the problem of finding a landlord who will accept the vouchers.\n\nPerhaps the most disturbing aspect of the movie is that it did not seem that the filmmakers either 1) helped the women along, even though they were so obviously in need or 2) paid them for their participation. These are women who seem to be only a few hundred dollars or a security deposit away. And yet they are taking the time to participate in the film. I would assume that Jodie Foster and Melissa Etheridge were paid for their participation. It is not stated, but the summations of the women's situations at the end of the film seems to strongly suggest that they were left on their own again. Also, definitely get to the end of the credits for more information. Though it was made in 1992, I just wish there was some way I could reach out and help these women.\n\nI highly recommend this film. It just stays with you.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0107232/"
}