{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Stewart",
            "url": "/name/nm0000071/"
        },
        {
            "@type": "Person",
            "name": "Donna Reed",
            "url": "/name/nm0001656/"
        },
        {
            "@type": "Person",
            "name": "Lionel Barrymore",
            "url": "/name/nm0000859/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 468986,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0196361/"
        },
        {
            "@type": "Person",
            "name": "Frances Goodrich",
            "url": "/name/nm0329304/"
        },
        {
            "@type": "Person",
            "name": "Albert Hackett",
            "url": "/name/nm0352443/"
        },
        {
            "@type": "Person",
            "name": "Frank Capra",
            "url": "/name/nm0001008/"
        }
    ],
    "datePublished": "1947-01-07",
    "description": "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Capra",
            "url": "/name/nm0001008/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Drama",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjc4NDZhZWMtNGEzYS00ZWU2LThlM2ItNTA0YzQ0OTExMTE2XkEyXkFqcGdeQXVyNjUwMzI2NzU@._V1_.jpg",
    "keywords": "small town life,christmas,alternate history,guardian angel,angel on earth",
    "name": "It's a Wonderful Life",
    "original_info": {
        "id": "It's a Wonderful Life_1946",
        "name": "It's a Wonderful Life",
        "year": "1946"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2005-12-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038650/"
        },
        "name": "\"To My Big Brother George, The Richest Man In Town\"",
        "reviewBody": "I've always thought that the reason It's A Wonderful Life has had such enduring popularity is that more than in any other film it shows what can be the value of a single individual and the contribution to the greater good they can make.\n\nGeorge Bailey as portrayed by James Stewart is the kind of every man hero we can all identify with. He's got the every day problems to be sure, raising and providing for a family, but he's got bigger problems than that. Fate has made him the rallying point of opposition in his small town of Bedford Falls to the \"richest and meanest man in town\", embodied in Lionel Barrymore.\n\nIt's a real David vs. Goliath battle. Barrymore seems to have unlimited resources at his disposal. Samuel S. Hinds as Peter Bailey put it so well to him in asking what are you doing all this for? Barrymore does have more money than he could ever possibly use. A little charity wouldn't hurt him.\n\nRemember the basic plot outline. A whole lot of people in Bedford Falls one post World War II Christmas Eve see that their friend George is toting a heavy load of mysterious origins. Their prayers reach the heavens where an angel is dispatched to aid.\n\nBut before Henry Travers the angel arrives, he's given the story of George Bailey's life. And we see the kind of struggles he's had, the sacrifices he's made for the good of a whole lot of others. We've also seen a greedy and grasping Potter, grabbing everything that George Bailey cannot save. \n\nSomething happens that day before Christmas through no fault of his own, Bailey is in big trouble. It's driven him to the brink of despair. That's why the angel is sent down. He shows him the alternate universe that would have been had he never existed. It's something each and every one of us should try to do, step outside ourselves see just what our contributions can be.\n\nBut I think what Frank Capra is trying to say in this greatest of his films is that having done that and we realize we haven't contributed to the greater good of humankind, we resolve to do so. It's a simple, but profound lesson.\n\nWhat if Potter got the same opportunity? In a sense Charles Dickens did just that in A Christmas Carol. Would Lionel Barrymore change? It's an interesting point of speculation.\n\nIn addition to those cast members already mentioned a whole group of players who worked with Capra before grace this film. Add to that some others and you have a perfectly cast feature picture.\n\nDonna Reed has an interesting part as well. Your choice of mate is real important in life. Had she not been as loving and supportive to George Bailey, he might very well have taken a different route in life. Mary Hatch Bailey became a signature part for her, more identified than her role in From Here to Eternity which got her an Oscar. It certainly was the basis for her TV series.\n\nWhen Todd Karns who plays Harry Bailey toasts his brother he's saying that the riches of the world are not necessarily things that can be quantified. Your life is not measured in material things, but in how you use the material things given you. \n\nAnd that universal lesson will be taught into eternity as long as It's A Wonderful Life is shown every year. Wouldst we all learn it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT1M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1101988121",
        "name": "It's a Wonderful Life",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmUyMzVmNjgtMWQ1MS00OTkwLWEzMTktOTFlYmRiNmE1MWZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmUyMzVmNjgtMWQ1MS00OTkwLWEzMTktOTFlYmRiNmE1MWZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:35:46Z",
        "url": "https://www.imdb.com/video/vi1101988121/"
    },
    "url": "/title/tt0038650/"
}