{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Roberts",
            "url": "/name/nm0000616/"
        },
        {
            "@type": "Person",
            "name": "Gregory Harrison",
            "url": "/name/nm0002129/"
        },
        {
            "@type": "Person",
            "name": "Margaret Cho",
            "url": "/name/nm0158632/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3139,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062371/"
        },
        {
            "@type": "Person",
            "name": "Randal Kleiser",
            "url": "/name/nm0459170/"
        }
    ],
    "datePublished": "1996-03-22",
    "description": "Nick \"Eric Roberts\", is nearing the end of a 3-year battle with AIDS and makes arrangements to die. He hosts a party to say goodbye to friends and family. His ex-partner, Brandon \"Gregory Harrison\", attends and things get complica...",
    "director": [
        {
            "@type": "Person",
            "name": "Randal Kleiser",
            "url": "/name/nm0459170/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjU0YjM4NzktNDJlZi00ZmNjLWI1MWQtOTIxMDI4NWY0NGYwXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "suicide,aids,homosexual,ex boyfriend ex boyfriend relationship,architect",
    "name": "It's My Party",
    "original_info": {
        "id": "It's My Party_1996",
        "name": "It's My Party",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "GranDiva"
        },
        "dateCreated": "2000-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113443/"
        },
        "name": "Um, taken as what it is, and not what I think it should be . . .",
        "reviewBody": "Come on, folks, let's cut a guy some slack. The fact that Randal Kleiser could get this film made at all is a major accomplishment. That he could get the cast he did, and get them all to accept scale is another point in his favor.\n\nFor the record, It's My Party is a film-filtered version of actual events in Randal Kleiser's life (Kleiser corresponds to Brandon, Gregory Harrison's character), in much the same way that Kleiser's earlier film, Summer Lovers, is a film-filtered (and re-gendered, to be sure) version of an earlier period in Kleiser's life. The film reduces several years of the central gay relationship to about two. Various art works attributed to Nick in the film are actually works created by Kleiser's late lover. And yes, the party that the film centers on actually took place, though certainly (one hopes) not as melodramatically.\n\nI have to say, I agree that quite a few characters could have been left on the cutting-room floor without marring the film, but at the same time, many of those \"superfluous\" characters were played by actors who were working virtually for free because they wanted to be involved in the project.\n\nThe black comedy in a couple of the scenes was a device that was used to lighten things (however inappropriately, though, is a matter of personal taste) before the heavier side of the film kicked in, more or less a structural device, evidenced by the fact that it didn't return later.\n\nThe notion that this film is not an accurate representation of the sequence of events involved in PML is certainly valid, but how often does film or theater get terminal disease completely right? As I mentioned earlier, this was an eight year relationship timeline shortened to about 26 months, and all presented in less than 2 hours. There are going to be things missing. Kleiser hit the high points -- the fact that Nick's vision is starting to go, something very much feared in a visual artist.\n\nTaken as a whole, I loved the film. Of course, when I first saw it, I was sitting in a theater full of gay men, lesbians, and their closest friends on a rainy afternoon . You try watching this film under circumstances like that and still come out unaffected."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Nick \"Eric Roberts\", is nearing the end of a 3-year battle with AIDS and makes arrangements to die. He hosts a party to say goodbye to friends and family. His ex-partner, Brandon \"Gregory Harrison\", attends and things get complicated.",
        "duration": "PT2M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi336904985",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTUwMmMyMGEtNmIzZi00MTY3LTk3ZjQtYTg2YjA5MmM0YjEzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTUwMmMyMGEtNmIzZi00MTY3LTk3ZjQtYTg2YjA5MmM0YjEzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-21T19:48:18.233Z",
        "url": "https://www.imdb.com/video/vi336904985/"
    },
    "url": "/title/tt0113443/"
}