{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tim Robbins",
            "url": "/name/nm0000209/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Peña",
            "url": "/name/nm0001615/"
        },
        {
            "@type": "Person",
            "name": "Danny Aiello",
            "url": "/name/nm0000732/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 111654,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094459/"
        },
        {
            "@type": "Person",
            "name": "Bruce Joel Rubin",
            "url": "/name/nm0748022/"
        }
    ],
    "datePublished": "1990-11-02",
    "description": "Mourning his dead child, a haunted Vietnam War veteran attempts to uncover his past while suffering from a severe case of dissociation. To do so, he must decipher reality and life from his own dreams, delusions, and perceptions of...",
    "director": [
        {
            "@type": "Person",
            "name": "Adrian Lyne",
            "url": "/name/nm0001490/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTg5MTMyNjktNTZhOC00MGFlLWFlMTMtZGU2MjE3OWQ3NjJkXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "soldier,vietnam,new york,delusion,conspiracy",
    "name": "Jacob's Ladder",
    "original_info": {
        "id": "Jacob's Ladder_1990",
        "name": "Jacob's Ladder",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "travisyoung"
        },
        "dateCreated": "2008-07-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099871/"
        },
        "name": "More than a movie",
        "reviewBody": "Jacob's Ladder is a superbly crafted film that transcends mere entertainment and becomes an experience much greater than the sum of its parts. When you watch movies such as this, you are unleashing very powerful forces that short circuit your natural ability to remain in control. Much akin to narcotic addiction or hypnotism, upon first viewing you will be unable to think, act, or even believe apart from the intense feelings Jacob's Ladder inspires.\n\nTim Robbins is Jacob Singer, a warm and genuinely likable Vietnam veteran who, in spite of earning an advanced doctoral degree, chooses to find employment working for the U. S. Postal Service. We learn in bits and pieces as the plot unfolds that his service in Vietnam included a very frightening battle, and the events set in motion on that fateful day parallel what could be his descent into madness.\n\nJacob's life suddenly begins to resemble Hell. He is literally chased by confusion, fear, and death, he sees unbelievably terrifying images, has horrific experiences that whether real or imagined are too frightening to bear alone. His only comfort comes in the form of the woman he lives with, Jezzie (the late Elizabeth Peña), and his chiropractor, Louis (Danny Aiello). Each of these people's relationships with Jacob represent more than just the roles they fulfill in his life-they are absolute forces at battle for his sanity, and possibly even his soul.\n\nHis torment begins to include the past as well, the undeniable love he still has for his ex-wife and painful memories of his son Gabe, who died tragically in an accident (played by a young Macauley Culkin). As all these elements of the past, present and future collide in shocking hallucinations, Jacob slowly begins to suspect he could be the victim of a secret Army drug experiment gone terribly wrong.\n\nWith a haunted desperation, he embarks on a journey to find out what on earth happened to him-only his visions / flashbacks / flashforwards have become so delusional that reality and fantasy are hopelessly interwoven and nothing is as it seems. All that is decipherable is good and evil, life and death. And at the end of his nightmare, all he has to do is choose.\n\nThat's all I will share of the story. I'm not going to do you the disservice of spoiling the experience this movie is. Suffice it to say, there is much more to know, and nothing left to tell.\n\nMeanwhile, there is not enough that can be said of Robbins' performance. Although he has had \"more important\" film roles, never before or since has Robbins portrayed naked human emotion so effortlessly and without artiface; though this will not be his most remembered role, it is his personal best to date. Also in top form is director Adrian Lyne. Likewise, Jacob's Ladder is by far his personal best, though he may remain better known for his other more commercially successful films, such as Fatal Attraction and 9 &1/2 Weeks.\n\nJacob's Ladder is not a horror movie as some may deduce; It is human drama, masterfully disguised as a supernatural thriller. The basic elements of Jacob's Ladder have been plundered several times over the past few decades by technicians such as as Shyamalan who aspire (but fail) to be artists, and franchises like The Conjuring that aspire (but fail) to be art. We have been suckered by flashy films with clever plot twists that cheat us on story, characters, and technical excellence, and in so doing we have lost the discovery of real feelings while the lights flicker before us.\n\nFilms such as Jacob's Ladder are set apart from the rest of the pack because you don't just watch stuff like this, you feel it too.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT1M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2761031961",
        "name": "Jacob's Ladder",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjgyOTI1NDItNTViNS00ZjkzLWE0YTQtNDVjZjE2ZTI4ZTRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjgyOTI1NDItNTViNS00ZjkzLWE0YTQtNDVjZjE2ZTI4ZTRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:48:40Z",
        "url": "https://www.imdb.com/video/vi2761031961/"
    },
    "url": "/title/tt0099871/"
}