{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Caruso",
            "url": "/name/nm0000325/"
        },
        {
            "@type": "Person",
            "name": "Linda Fiorentino",
            "url": "/name/nm0000400/"
        },
        {
            "@type": "Person",
            "name": "Chazz Palminteri",
            "url": "/name/nm0001590/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13194,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079716/"
        },
        {
            "@type": "Person",
            "name": "Joe Eszterhas",
            "url": "/name/nm0000390/"
        }
    ],
    "datePublished": "1995-10-13",
    "description": "A bright assistant D.A. investigates a gruesome hatchet murder and hides a clue he found at the crime scene. Under professional threats and an attempt on his life, he goes on heartbroken because evidence point to the woman he stil...",
    "director": [
        {
            "@type": "Person",
            "name": "William Friedkin",
            "url": "/name/nm0001243/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTcwZDIyMDEtN2Q4MS00ZTIxLWEwMjMtM2I5NWViOTNjMGRhXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "female full frontal nudity,hit by a car,rear entry sex,oral sex,serial killer",
    "name": "Jade",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "carnivalofsouls"
        },
        "dateCreated": "2004-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113451/"
        },
        "name": "Underrated, but still not one of Friedkin's best...",
        "reviewBody": "To say Friedkin's career has had its ups and downs is an understatement, his eighties filmography inarguably has enough bombs to sink a oil tanker. Yet eschewing their performances at the box office, many of his films yearn to be rediscovered, from \"Cruising\" to \"Deal of the Century\" to \"Rampage\". Let's not kid ourselves, \"Jade\" is not a great film, and this is the fault of one man and one man alone - Joe Esterhas. If trash had a messiah, it would be him. For a fleeting moment in the nineties, Esterhas was paid by the bucketload to write formulaic movies for guys, and the erotic thriller has him to thank for its continuing lugubrious existence. \"Jade\" is interesting however, it is an erotic thriller without the erotic part. While Paul Verhoeven filled \"Basic Instinct\" chock full of the sleaze he had become renowned for, Friedkin's films are notable for primarily dealing with male characters, and are subsequently about as erotic as as a bowl of cereal. \"Jade\" is not about sex; it is about sexual jealousy. The talent of Linda Fiorentino cannot be underestimated here, giving depth to a part that amounts to no more than a typical male fantasy - part good girl, part whore - that's right, it's \"Crimes of Passion\" without Anthony Perkins and his bag of dildos. The leads are well cast and all give adequate performances, and Friedkin throws in all his usual directorial touches (subliminal images and, you guessed it, yet another bloody car chase). \"Jade\" is an enjoyable film, with delightfully silly twists and over-the-top violence (come on, you know you want to see Angie Everhart get run over again), and is given some class from it's cast and director, but, in the end, proves itself to be a guilty pleasure that makes one feel more guilt than pleasure."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3406803993",
        "name": "Jade",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzVlYmM3NmQtMjgyMC00YzE1LThjZTQtZmMyYjQwY2E3ZjM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzVlYmM3NmQtMjgyMC00YzE1LThjZTQtZmMyYjQwY2E3ZjM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-06-03T21:32:01Z",
        "url": "https://www.imdb.com/video/vi3406803993/"
    },
    "url": "/title/tt0113451/"
}