{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Byron Coley",
            "url": "/name/nm1454200/"
        },
        {
            "@type": "Person",
            "name": "Calvin Johnson",
            "url": "/name/nm0424701/"
        },
        {
            "@type": "Person",
            "name": "Barry Hansen",
            "url": "/name/nm0360676/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 301,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0111370/"
        }
    ],
    "description": "\"The longest-running, weirdest, loneliest enigma in popular music is a guy from Texas who calls himself Jandek.\" Jandek on Corwood is the 89-minute documentary that explores this man, his world and his music.",
    "director": [
        {
            "@type": "Person",
            "name": "Chad Freidrichs",
            "url": "/name/nm1454445/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAyNjAxNTY2M15BMl5BanBnXkFtZTgwMjIxMDA2MDE@._V1_.jpg",
    "keywords": "outsider,houston texas,reclusive musician,recluse,musician",
    "name": "Jandek on Corwood",
    "original_info": {
        "id": "Jandek on Corwood_2003",
        "name": "Jandek on Corwood",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "snowboarderbo"
        },
        "dateCreated": "2005-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0381287/"
        },
        "name": "Great job, guys",
        "reviewBody": "I first discovered Jandek last fall. I stumbled across something on a website that led me to something else that led me to something else... and eventually I tripped over Jandek.\n\nHis story intrigued me enough to find some of his music, which intrigued me even more. Like so many others I couldn't stop thinking \"who IS this guy and what the hell is he all about?\" The enigma factor definitely puts a different type of spin on his music, and after listening to quite a bit of it, I decided I was a fan.\n\nHere's why: Jandek's music is not all bad, some of it is quite good, and there are occasional random moments of transcendence that are SO good, it's worth putting up with everything else. It's a lot like life.\n\nAnd that's the heart of it, right there. Jandek's music is almost unbelievably expressive. Because of a distinct lack of context, tho, it's not always clear what he is expressing or why. This allows each listener to make very personal, unique interpretations and thus the music becomes memorable.\n\nThis film's success lies in the filmmakers understanding their subject matter and having the good sense to explore this nuance not just about the music, but about the man who makes it.\n\nThrough interviews with aficionados, popular music scholars and a small number of people who have actually spoken with Jandek, this film tells us what is known about him and what is thought about him. Eventually we get a clear picture of what Jandek has done, and we form a hazy picture of who Jandek might be. I thought it was great that they made no attempt to get Jandek on camera. It showed a lot of respect for the subject, over and above respect for the subject matter.\n\nThere is also a ton of Jandek's music in the film and in the bonus material on the DVD. The DVD packaging is very stylish. The special features material offers an unexpurgated, uncut version of 1 of Jandek's 2 interviews (with John Trubee, no less).\n\nI highly recommend this film.\n\nTo Chad Friedrichs & Paul Fehler: great job, guys.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0381287/"
}