{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eileen Walsh",
            "url": "/name/nm0909626/"
        },
        {
            "@type": "Person",
            "name": "Rhys Ifans",
            "url": "/name/nm0406975/"
        },
        {
            "@type": "Person",
            "name": "Patsy Kensit",
            "url": "/name/nm0000475/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 360,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "Janice Beard",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103757/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007263/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021568/"
        },
        {
            "@type": "Person",
            "name": "Ben Hopkins",
            "url": "/name/nm0394114/"
        },
        {
            "@type": "Person",
            "name": "Clare Kilner",
            "url": "/name/nm0453270/"
        }
    ],
    "datePublished": "2000-05-05",
    "description": "Janice's father dies of a heart attack during her birth, causing her mother to plunge into a post-natal, post-mortem agoraphobic depression that endures for 23 years.",
    "director": [
        {
            "@type": "Person",
            "name": "Clare Kilner",
            "url": "/name/nm0453270/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYxNTk5NDM2Nl5BMl5BanBnXkFtZTcwNzE0MjQyMQ@@._V1_.jpg",
    "keywords": "title directed by female,independent film,character name in title",
    "name": "Janice Beard 45 WPM",
    "original_info": {
        "id": "Janice Beard: 45 WPM_2003",
        "name": "Janice Beard: 45 WPM",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Tintin a Tokyo"
        },
        "dateCreated": "2000-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0209055/"
        },
        "name": "Hilarious, quirky, light Brit movie.",
        "reviewBody": "I saw Janice Beard yesterday at the 2000 Tokyo International Film Festival and took part in the Q&A section with the director Clare Kilner afterwards.\n\nLike the other reviewer has said, Janice Beard: 45 Words Per Minute isn't an especially profound film, but it is good fun and it is better than the majority of what passes through the cinemas.\n\nIn the film, Janice Beard is a 20 something young woman whose life began unusually when her father died in childbirth. This causes her mother to be the world's first sufferer of post-natal-post-mortem syndrome. She has never left the house since her daughter's birth, and Janice spends her entire life concocting stories to entertain her mother and entice her into the world. Like the director, I've also known adult compulsive liars and think they're not generally sympathetic people. However, the explanation provided to us of her mother's illness succeeds in endearing Janice The Underdog to the audience.\n\nIn the hope of being able to find and pay for a cure for her mother, Janice, equipped with her minimum level 45 words per minute typing rate, leaves Scotland for temp work in London. To some degree this reflects the experience of the director/writer Clare Kilner who has said the idea for the movie came to her while doing temp work - being in but not part of the work place and being able to observe others closely from that unique position.\n\nJanice ends up working at a British car manufacturer (this is a work of fiction after all) through her school friend - the one who was faking a seizure at the beginning of the film to get Mrs Beard out of bed. The car company is about to launch its make or break product and tension in the office is high when Janice joins the typing pool headed by beautiful, bitchy Julia (Patsy Kensit).\n\nFrom there on in it's a story about Janice toning down her outlandish stories (or living up to them - the salsa dance scene) and fitting in with the typing pool women, and finding someone along the way in the shape of Sean (Rhys Evans from Twin Town [http://us.imdb.com/Title?0120394] and Notting Hill [http://us.imdb.com/Title?0125439]). It's not Janice' fault there's industrial sabotage afoot and she's caught in the middle.\n\nThis is a really good, light and enjoyable film. If a director's first film most embodies the nature of their work to come then I look forward to seeing more of Clare Kilner's work. Answering questions on stage after the movie she was lovely.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0209055/"
}