{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Toni Collette",
            "url": "/name/nm0001057/"
        },
        {
            "@type": "Person",
            "name": "Gotaro Tsunashima",
            "url": "/name/nm1059630/"
        },
        {
            "@type": "Person",
            "name": "Lynette Curran",
            "url": "/name/nm0192852/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6598,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071294/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043597/"
        },
        {
            "@type": "Person",
            "name": "Alison Tilson",
            "url": "/name/nm0863485/"
        }
    ],
    "datePublished": "2003-09-25",
    "description": "Against the background of an Australian desert, Sandy, a geologist, and Hiromitsu, a Japanese businessman, play out a story of human inconsequence in the face of the blistering universe. The end of the journey leaves no one capabl...",
    "director": [
        {
            "@type": "Person",
            "name": "Sue Brooks",
            "url": "/name/nm0112262/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODI3MWUwY2UtZGRhNi00ODU3LWI0OTYtY2Y4NTNlYTRiZjU1XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "australia,japanese,australian,sexual desire,sex in bed",
    "name": "Japanese Story",
    "original_info": {
        "id": "Japanese Story_2003",
        "name": "Japanese Story",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Philby-3"
        },
        "dateCreated": "2003-10-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0304229/"
        },
        "name": "Story for both of us",
        "reviewBody": "This is as much an Australian story as a Japanese one. We are not about to turn Japanese, but our close economic relationship over the last 50 years has to some extent transcended the cultural gap that divides us, and the bitterness of World War 2. On one level, this is a very personal story of two people from different cultures who become closer than they might have imagined. On another level it examines two very different cultures tied together by economic necessity. These themes are played out in a truly awe- inspiring ancient landscape, which, as others have remarked, is a character on its own.\n\nI've not been to the Pilbara, but I've been to places like it elsewhere in Australia, and they tend to have the effect of reminding you of the fragility of your existence. The Aborigines (represented here by only a gas station attendant) regarded themselves as belonging to the land and here you can see why. It's not clear what Tachibana Hiromitsu, the rich businessman's son, is looking for in the desert, but he certainly feels its power. Just why Sandy the tough female geologist comes to harbour tender feelings towards him is not evident either; perhaps it's the mothering instinct at work- he's not an adaptable kind of guy and perhaps she senses his vulnerability.\n\nApart from the firm refusal to turn this film into a romantic comedy, despite some `When Harry Met Sally' moments, there are several other things going for it. First there is Toni Collette's entirely convincing performance which overcomes some weaknesses in the storyline (and improbabilities in her character). She has a lot of ground to cover, from boredom to hilarity, from dislike to intimacy, and from terror to melancholy.\n\nSecond, the cinematography fully exploits the scenery without detracting from the story. Much of `Japanese Story' was filmed around Port Headland in the Pilbara, but it's not a tourist brochure. Third, even the minor parts are played with precision (eg John Howard as the BHP man and Yukimo Tanaka as Tachibana's wife). It's difficult to judge just how effective Gotaro Tsunashima is  you'd need to be Japanese, I guess, and anyway the script is from an Australian, Alison Tilson. To my eyes he seems real enough, if we accept he's from a very privileged and sheltered background. It's interesting that Sandy seems to be the initiator of their intimacy (he doesn't resist!).\n\nI think this film would hold up well anywhere. It has more than the usual emotional content for an Australian film, an intriguing and poignant story, good acting, and it's not too long. The admission price is also considerably cheaper than an air ticket to Port Headland."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Against the background of an Australian desert, Sandy, a geologist, and Hiromitsu, a Japanese businessman, play out a story of human inconsequence in the face of the blistering universe. The end of the journey leaves no one capable of going back to where they started from.",
        "duration": "PT2M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1209320217",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjg3NGNmYWUtNzdiMi00ZDgwLThkYzItYWI2OTY1ZjEwZGVhXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjg3NGNmYWUtNzdiMi00ZDgwLThkYzItYWI2OTY1ZjEwZGVhXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-21T21:38:54.297Z",
        "url": "https://www.imdb.com/video/vi1209320217/"
    },
    "url": "/title/tt0304229/"
}