{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Roy Scheider",
            "url": "/name/nm0001702/"
        },
        {
            "@type": "Person",
            "name": "Lorraine Gary",
            "url": "/name/nm0308882/"
        },
        {
            "@type": "Person",
            "name": "Murray Hamilton",
            "url": "/name/nm0358069/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 80174,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019166/"
        },
        {
            "@type": "Person",
            "name": "Peter Benchley",
            "url": "/name/nm0001940/"
        },
        {
            "@type": "Person",
            "name": "Carl Gottlieb",
            "url": "/name/nm0331956/"
        },
        {
            "@type": "Person",
            "name": "Howard Sackler",
            "url": "/name/nm0755274/"
        }
    ],
    "datePublished": "1978-06-16",
    "description": "Police chief Brody must protect the citizens of Amity after a second monstrous shark begins terrorizing the waters.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeannot Szwarc",
            "url": "/name/nm0844358/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Adventure",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2U1MWE1NTMtYjQ2ZC00MTFmLWFmYjItODMyNGYxOTAyZmEzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "giant shark,wet t shirt,fictional town,shark,beach",
    "name": "Jaws 2",
    "original_info": {
        "id": "Jaws 2_1978",
        "name": "Jaws 2",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jiangliqings"
        },
        "dateCreated": "2001-05-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077766/"
        },
        "name": "Pacing could have been more tight, but it's often suspenseful and exciting.",
        "reviewBody": "*** out of ****\n\nAs a sequel to an immensely popular classic, Jaws 2 had a lot to live up to, and while it doesn't reach the level of sheer terror of the original, it's still effective in creating thrills, some scares, and excitement. The biggest flaw is the pace, since the scenes on land drag on over and over. These moments hurt an otherwise entertaining and often fun motion picture.\n\nThe plot is mostly a re-hash of Jaws. It even takes place in the same town, Amity. It's been years since the first shark was killed and Chief Martin Brody (Roy Scheider) begins to have his suspicions of another great white in the vicinity when two divers are reported missing, a boating accident that results in the mysterious disappearance of a mother and daughter, and a killer whale washed ashore with large bites all over it. Brody voices his beliefs to the mayor (Murray Hamilton), who, along with real estate developer Glenn Petersen (Joseph Mascolo), disregard this because of the current production of a hotel on the beach. \n\nBrody's constant paranoia of the situation eventually gets him fired. Meanwhile, his two sons, Mike and Sean, sneak off to sail with a group of other teens. When another shark attack occurs and is confirmed, Brody sets off to find his sons before it's too late. \n\nI've heard a lot of interesting things involving the making of this sequel. Apparently, Spielberg and Dreyfuss were interested in returning, but couldn't due to their filming of Close Encounters. The original story was supposed to be more character-oriented, without as much focus on the teens in peril, but when Spielberg had to back out the studio executives got nervous and went with Szwarc to make a more formulaic and \"effective\" sequel. Roy Scheider would be the only big star from the original who would return.\n\nI'm a huge admirer of Steven Spielberg's film, and it would be hard for any other director to equal, much less surpass, his filmmaking techniques. Director Jeannot Szwarc does an overall solid job here. He knows what made the first film effective and holds off long camera shots of the shark for a while (in my opinion, maybe a little too long). The beginning of the film does a nice job of creating interest and a good set-up is appreciated. However, this set-up goes on a little too long. A half-hour would have been just fine, but Szwarc takes nearly 75 minutes for the film to focus on the shark hunting down the sailing teens. \n\nYou may wonder why I voice my complaint for this when in the original the shark didn't make it's first full appearance until near the end. Well, in that film's case there were three great characters (only one of whom returned) and some classic suspense sequences to crank up the tension (Dreyfuss and Scheider's exploration of the abandoned boat, anyone?). While Szwarc should be noted for trying to build up momentum, he slows down everything a little too much and thrill seekers looking for non-stop action may find it disappointing, and it might be more up their alley to look for Deep Blue Sea (which is considerably faster moving, though is an overall weaker film).\n\nIt is initially interesting to see how this sequel builds up its story with such scenes as the examination of a dead killer whale and a diver who runs into the shark, and it is quite entertaining to revisit Amity again, but Brody's constant back and forth debates with the town committee get tiresome after awhile. We know he's right and they're wrong and the film makers should have realized that these arguments get old quickly. To be fair, Scheider's performance does put in a bit more tension into these scenes, but it takes something more clever than that to keep things moving at a brisk pace.\n\nThe film does finally get moving in the last 35 or so minutes, and it's in those moments that make the film the overall effective sequel it is. The constant shark attacks deliver the goods. Szwarc knows how to milk tension into these scenes and doesn't disappoint. The finale is particularly an exercise in creating seat-gripping suspense. It's almost a match for the conclusion to Jaws. The final showdown between Brody and the shark is just as memorable and edge-of-the-seat as his final confrontation with the other great white in the original. John Williams' score is as effective as ever and serves to heighten the tension factor by a notch.\n\nAdmittedly, there are some implausibilities abound. Great whites aren't nearly that aggressive and for one that eats as much as it does, it's really quite hungry. The shark even pulls down a helicopter in one scene to presumably eat the pilot (In the TV version, there's an added scene of the shark trying to chomp the pilot). Brody's plan to kill the shark relies on quite a bit of luck, though I won't complain as much about this since it is the film's highlight sequence and is an example of masterful direction.\n\nMost people tend to ridicule the visual effects in the Jaws series. In my opinion, they're more effective and significantly better than CGI renditions of animals seen in the more recent thrillers like Deep Blue Sea, Anaconda, and Lake Placid. Szwarc's high angle shots of the great white are the best, evoking a sense of terror by just looking at the top of this ferocious animal. With an animatronic shark, it's not nearly as mobile as what can be rendered by computer technology, but it beats having the animal look like a refugee from a video game. There are also other things that set this film above those aforementioned movies, such as restraint, seriousness, and no annoying over-reliance on mostly unfunny self-deprecating humor.\n\nTo mention how effective the script is would probably be a moot point. Anybody watching this movie wants to see it for the shark attacks. Howard Sackler and Carl Gottlieb do a reasonable job of repeating what was successful in the original story without completely ripping it off. This time around, there's no compelling monologue like Robert Shaw's retelling of the fate of the men on the U.S.S. Indianapolis, but the screenwriters can be credited for not writing any laughably ludicrous dialogue. When the stranded teens argue, everything they say is reasonable within the context of the situation they're in.\n\nThe film's performances are overall decent. Roy Scheider has always been one of my favorite actors; he's easily the best here and is very good as the man determined to save his sons. Martin Brody is still by all means a great character, and Scheider's portrayal of him as an everyman caught up in a terrifying situation makes it extremely easy to sympathize with him. Lorraine Gray is decent as his wife and though she gets more screen time than before she's still not given a chance to fully flesh out her character. And, boy, we all saw her character develop in Jaws the Revenge, but we all know how that turned out. Murray Hamilton and Joseph Mascolo are appropriately sneaky and sly as the town mayor and real estate developer. They're really not so much people as they are those who have to be wrong all the time. It's a cliche, and it's not as effective as it was in Jaws. I can't really say which actor who portrays the teens does the best job. They're all fairly equal and they are pretty good at not annoying us, which makes it easier to feel for them when the shark attacks begin.\n\n It's basically like this: when the film takes place on land, it's sometimes slow-moving and not always interesting. When it's on water, it's often exciting and tense, with suspense that sometimes equals the original. It's definitely not as great a thriller as Jaws, but it is a worthy sequel and certainly is better than the likes of Deep Blue Sea, Anaconda, and Lake Placid."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi337427993",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGQ3ZTM4M2MtYzY0Ny00ZmY5LTliYTgtYjZmYWU5ZDFiNTMwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGQ3ZTM4M2MtYzY0Ny00ZmY5LTliYTgtYjZmYWU5ZDFiNTMwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-01T11:39:47.996Z",
        "url": "https://www.imdb.com/video/vi337427993/"
    },
    "url": "/title/tt0077766/"
}