{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Mewes",
            "url": "/name/nm0582939/"
        },
        {
            "@type": "Person",
            "name": "Kevin Smith",
            "url": "/name/nm0003620/"
        },
        {
            "@type": "Person",
            "name": "Ben Affleck",
            "url": "/name/nm0000255/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 157354,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007545/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Kevin Smith",
            "url": "/name/nm0003620/"
        }
    ],
    "datePublished": "2001-08-24",
    "description": "The comic \"Bluntman and Chronic\" is based on real-life stoners Jay and Silent Bob, so when they get no profit from a big-screen adaptation, they set out to wreck the movie.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Smith",
            "url": "/name/nm0003620/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2EyYWEwZmQtZWU0Yy00M2Y3LThiZTktOTQxZDUxY2ZjOTYwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "silent bob character,female gang,studio lot,timeframe 2000s,jay and silent bob",
    "name": "Jay and Silent Bob Strike Back",
    "original_info": {
        "id": "Jay and Silent Bob Strike Back: Bonus Material_2001",
        "name": "Jay and Silent Bob Strike Back: Bonus Material",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JehuDVD"
        },
        "dateCreated": "2001-10-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0261392/"
        },
        "name": "CU Film Critic takes on \"Jay and Silent Bob Strike Back.\"",
        "reviewBody": "Whether or not you enjoy `Jay and Silent Bob Strike Back' is going to depend a lot on whether or not you enjoy director Kevin Smith. I, for one, think the guy is a genius. If you don't mind my lauding his name, read on. First, a little background for the uninitiated.\n\nKevin Smith's movies (Clerks, Mallrats, Chasing Amy, Dogma, and now JSBSB) are a world created by the director himself, in the sense that all are interconnected by characters, plot points, and subtle references. The one constant, though, is the entity known as Jay and Silent Bob, a pair of pot dealers who have more or less spent their entire lives standing in front of the Quik-Stop convenience store. Jay (Jason Mewes) is the long-haired guy we all knew in high school, his endless stream of four-letter epithets almost endearing because the goofy guy just doesn't know any better. Silent Bob (played by director Kevin Smith), Jay's self-described `hetero life-mate' stands by without speaking a word and provides some sort of moral counterpoint for the duo.\n\n In Smith's `Chasing Amy,' Banky and Holden (Jason Lee and Ben Affleck, respectively) created a comic book entitled `Bluntman and Chronic,' based on their real-life buddies Jay and Silent Bob. Fast-forward to `Jay and Silent Bob Strike Back.'\n\nBanky has sold the rights to his comic to Miramax pictures, leaving Jay and Silent Bob in the dark about the business deal. Jay and Bob, with help from Holden, discover via the Internet (`What's the Internet?' asks Jay) that a movie based on them is about to start production. Realizing that they won't see a dime of the money, and even more upset by their defamation on Internet message boards, they decide to truck across the country to stop the film from being produced.\n\nIt's important to note that while the comedy is crude, slapstick, and even resorts to fart jokes, it's not dumb comedy, it's satire at it's finest, reminiscent of such self-deprecating masterpieces as `Pee-Wee's Big Adventure' and `Blazing Saddles.' After the fairly serious `Chasing Amy' and the spiritually overtoned `Dogma,' we see that Smith has decided to get together with his buddies and put together one big inside joke. Fortunately, he's decided to let a few of us in on it. The viewer's enjoyment of the movie is going to depend completely on his or her knowledge of Smith's previous films and characters.\n\n Smith's friends show up in cameos, from Chris Rock to Will Ferrell to Alanis Morrissette to Carrie Fisher to Mark Hamill (Smith is an infamous Star Wars fanatic). You can literally see a man's childhood dream coming true when at one point, Smith's Bob gets to carry on a lightsaber duel with Hamill.\n\nLocal interest: In one of the many subplots, a group of female jewel thieves bring Jay and Silent Bob to our very own Boulder, Colorado, to steal a monkey from a medical testing facility. `Jay and Silent Bob Strike Back' is a comedy, and doesn't try to be anything else. The only thing I felt was missing was one of Jason Lee's inspired monologues bitterly bemoaning the state of society. Some of Shannon Elizabeth's screen time could have been cut, I felt, in favor of some trademark Smith dialogue.\n\nSmith now intends to focus his time on more dramatic pursuits, and we are given this as the fifth and last film in his so-called `Jersey Trilogy.' The bottom line is, Smith loves his fans, and this film was created for the loyal. A fitting send-off for Jay and Silent Bob, this film gets an `A-.'"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Miramax",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2045313305",
        "name": "Jay and Silent Bob Strike Back",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmJiNWExM2EtMjFiNS00ZDY2LWE3YjgtN2ViNzAwZjMzMmE4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmJiNWExM2EtMjFiNS00ZDY2LWE3YjgtN2ViNzAwZjMzMmE4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-06-30T03:21:08Z",
        "url": "https://www.imdb.com/video/vi2045313305/"
    },
    "url": "/title/tt0261392/"
}