{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Prashanth",
            "url": "/name/nm0695286/"
        },
        {
            "@type": "Person",
            "name": "Aishwarya Rai Bachchan",
            "url": "/name/nm0706787/"
        },
        {
            "@type": "Person",
            "name": "Nassar",
            "url": "/name/nm0621937/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3746,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059292/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0440645/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0300974/"
        },
        {
            "@type": "Person",
            "name": "S. Shankar",
            "url": "/name/nm0788171/"
        }
    ],
    "datePublished": "1998-04-24",
    "description": "The father of twin brothers wants to get them married to only twin sisters. But one of the brothers falls in love with a woman does not have a twin sister.",
    "director": [
        {
            "@type": "Person",
            "name": "S. Shankar",
            "url": "/name/nm0788171/"
        }
    ],
    "duration": "PT2H55M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjQ2NjhmMmItMDFmZC00ODg4LTlkYjEtMDZkOGI5OWYxY2VjXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_.jpg",
    "keywords": "twin,deception,twin brother,airport,wedding",
    "name": "Jeans",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2012-12-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0151121/"
        },
        "name": "Silly but enjoyable.",
        "reviewBody": "Here in the States, we don't get a ton of Indian films though, fortunately, Netflix has a decent selection. One problem I have when watching the film, however, is that although most Indian films we get have musical numbers, OFTEN the songs themselves are without captions--meaning we aren't exactly sure WHAT they are singing!! This is really annoying and I hope that they catch on and start captioning them fully--and unfortunately \"Jeans\" is yet another film without captioned songs.\n\n\"Jeans\" is one of Aishwarya Rai Bachchan's first films and her co-star is Prashanth--who plays BOTH identical twin brothers, Vishvanath and Ram Mohan (this is how they are listed in the credits on IMDb, but in the translation I saw it was Vishu and Ramu). Considering how complicated it was to film it this way (particularly in dance scenes where BOTH danced together), you wonder why they didn't get real identical twins to play the roles! Regardless, the plot is quite enjoyable but also incredibly stupid--the sort of thing that is familiar to old American sit-coms but which is hard to sustain for a three hour film.\n\nThe film begins in the United States. An Indian family has brought their whiny grandmother to the States for brain surgery. Things get royally screwed up and the family doesn't know what to do--thank goodness a nice young Indian doctor is there to help them out of their predicament. Later, when they are about to return to their country, the granddaughter (Aishwarya Rai Bachchan) realizes she's fallen in love with the doctor. Here is the complication--although her family heartily approves of the marriage, his father doesn't. His reason is bizarre and you'll just have to see about this yourself. Suffice to say that he'll only approve if his son marries a woman who has a twin sister who can marry the doctor's twin brother! But she has no sister--and the grandmother comes up with an idea straight from a bad comedy--have Rai Bachchan pretend to be TWO GIRLS--both twins! It naturally leads to all sorts of confusions and silly situations and by the end, the truth comes out and the marriage looks like a no-go. What are the young lovers to do?! If you are looking for a believable film or one that is cerebral, then you should keep looking. As for me, I could suspend disbelief and just enjoy the film. My feeling, though, is that the film was at its best when it focused on romance and slipped a bit when Rai Bachchan became two people. There are a few weird and enjoyable songs (such as the one with a T-Rex and skeletons) and the film is never dull. Worth seeing but not among the cast's best films.\n\nBy the way, despite what they showed in the film, there is no University of Los Angeles. The closes they have us UCLA--not ULA. Also, throughout the film, they show scenes of Los Angeles interspersed with Las Vegas-- cities 265 miles apart!! Perhaps folks back in India won't notice this but most Americans would! Later, in another song, they bounce from Los Angeles to New York to the Grand Canyon!! I've seen this sort of strange geography in a few other Indian films--such as another of Aishwarya Rai Bachchan's Tamil films, \"I Have Found It\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Jeans Trailer",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2951461401",
        "name": "Jeans Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTkzMDY3ZjktY2UyMy00Yzk2LWE5YmEtZThjNTU5YmNkMWIyXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTkzMDY3ZjktY2UyMy00Yzk2LWE5YmEtZThjNTU5YmNkMWIyXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-11-24T14:08:41.750Z",
        "url": "https://www.imdb.com/video/vi2951461401/"
    },
    "url": "/title/tt0151121/"
}