{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Laurent Faucheux",
            "url": "/name/nm1089669/"
        },
        {
            "@type": "Person",
            "name": "Jean-Michel Jarre",
            "url": "/name/nm0418882/"
        },
        {
            "@type": "Person",
            "name": "Dominique Mahut",
            "url": "/name/nm0537269/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 120,
        "ratingValue": 8,
        "worstRating": 1
    },
    "description": "Jean Michel Jarre's outdoor concert in Moscow 1997.",
    "director": [
        {
            "@type": "Person",
            "name": "Aubrey Powell",
            "url": "/name/nm0694023/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGZhNWEzZTgtZGNmMy00MjYxLTkzYjgtM2UxOGQ1OWQ1NDM0XkEyXkFqcGdeQXVyNTgxMDA5Mw@@._V1_.jpg",
    "name": "Jean Michel Jarre: Oxygene in Moscow",
    "original_info": {
        "id": "Jean Michel Jarre: Oxygene Moscow: The Portrait_1997",
        "name": "Jean Michel Jarre: Oxygene Moscow: The Portrait",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "binkym"
        },
        "dateCreated": "2002-02-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0301469/"
        },
        "name": "The most extraordinary concert film ever!",
        "reviewBody": "This extraordinary concert took place at Moscow state University in Lenin Hills, Moscow, to celebrate Moscow's 850th birthday. A grand explosion of music, lasers, fireworks, singing, dancing and orchestration, it'll make you envy Muscovites (more than a million of whom turned out for the show) for having received such a magnificent spectacular birthday. Featuring the Ex-Red Army Choir, Bolshoi Dancers, and the Bolshoi Kids Choir, as well as the Russian Knights aerobatic team doing stunts in Sukhoi 27s, and even astronauts from the Mir Space Station, it is almost too amazing for words. I dare you to watch it and not choke up.\n\nBecause the music is most excellently recorded, you can even play it while doing other things as if it were a regular CD, but the images (especially the ones projected onto gigantic buildings) are so striking, you'll be constantly finding yourself stopping to look at the TV. (Playing it on your computer outfitted with a DVD player will solve your having to make a lot of trips to the TV.)\n\nJarre just keeps getting more amazing with age, and with technology. Watching him play a \"harp\" made of laser lights is so exciting, your heart might burst out of your chest.\n\nWe can only hope that one day soon he'll do a concert for us Americans, perhaps to commemorate 9/11/01.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0301469/"
}