{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "James Nesbitt",
            "url": "/name/nm0626362/"
        },
        {
            "@type": "Person",
            "name": "Gina Bellman",
            "url": "/name/nm0069109/"
        },
        {
            "@type": "Person",
            "name": "Denis Lawson",
            "url": "/name/nm0493200/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7600,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023675/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094929/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Person",
            "name": "Steven Moffat",
            "url": "/name/nm0595590/"
        }
    ],
    "datePublished": "2007-08-04",
    "description": "London, 2007. Tom Jackman is the only living descendent of Dr. Jekyll and Mr. Hyde. He has made a deal with his dark side: a body share. What Mr. Hyde doesn't know is that Tom has a family. There is a wife and two children that he...",
    "genre": [
        "Crime",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUzMjkzNDY0MF5BMl5BanBnXkFtZTcwNDQyMzA1MQ@@._V1_.jpg",
    "keywords": "character name as series title,dr. jekyll and mr. hyde characters,surname as series title,slasher horror,tv mini series",
    "name": "Jekyll",
    "original_info": {
        "id": "Jekyll & Hyde_1990",
        "name": "Jekyll & Hyde",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cchase"
        },
        "dateCreated": "2007-08-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0497298/"
        },
        "name": "\"Daddy's Home...\"",
        "reviewBody": "As much as I tend to be an Anglophile when it comes to all things British in the cinema and on TV, I know that just because the actors have plummy accents it doesn't necessarily make something good. However, I'm glad to discover that BBC America's new series is a welcome exception to that rule.\n\nWhen a post-modern adaptation of \"classic\" material such as this is attempted, the filmmakers had better bring something fresh and different to the table, if they expect the project to make an impression beyond the first moment or two. And luckily, \"JEKYLL\" has a real asset in James Nesbitt's tour-de-force portrayal of Dr. Tom \"Jackman\", the 'hero' of the piece who is sharing his mind and body grudgingly with the absolutely amoral and insane \"Mr. Hyde\". Blessedly, Nesbitt chose to take the Spencer Tracy route with this version, relying more on acting ability than cheap prosthetics, (though there are some makeup effects used very sparingly, which makes them that much more gruesome when they appear.)\n\nThis take is part-mystery, part-conspiracy thriller and part-psychological drama, which at times hints that it might even be headed into old \"X-FILES\" territory. It is fascinating to try and second-guess Steven Moffat's excellent script, but just when you think you know where it's going, the plot line swerves in another direction, but not with such unexpectedness or contrivance as to make you want to turn it off and ditch the whole thing. (Too bad I can't say the same thing about \"LOST\".)\n\nI'm coming up on the last couple of episodes, and I'm hoping that it will be back for another installment, if things don't get wrapped up towards the end. Nesbitt, whose work I've never seen before, is outstanding, and he's backed by a terrific supporting cast, especially a nearly unrecognizable Denis Lawson, whom I only ID'ed thanks to IMDb.\n\nIf you haven't been following this on Saturdays on BBC America, be sure to catch it when it becomes available on DVD.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3817996569",
        "name": "Jekyll",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTc0Yjc4ZjQtYTRhZS00ZGI3LTk0YzctMmU1NjJmNDlmYjRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTc0Yjc4ZjQtYTRhZS00ZGI3LTk0YzctMmU1NjJmNDlmYjRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:49:39Z",
        "url": "https://www.imdb.com/video/vi3817996569/"
    },
    "url": "/title/tt0497298/"
}