{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "James Nesbitt",
            "url": "/name/nm0626362/"
        },
        {
            "@type": "Person",
            "name": "Gina Bellman",
            "url": "/name/nm0069109/"
        },
        {
            "@type": "Person",
            "name": "Denis Lawson",
            "url": "/name/nm0493200/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7600,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023675/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094929/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Person",
            "name": "Steven Moffat",
            "url": "/name/nm0595590/"
        }
    ],
    "datePublished": "2007-08-04",
    "description": "London, 2007. Tom Jackman is the only living descendent of Dr. Jekyll and Mr. Hyde. He has made a deal with his dark side: a body share. What Mr. Hyde doesn't know is that Tom has a family. There is a wife and two children that he...",
    "genre": [
        "Crime",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUzMjkzNDY0MF5BMl5BanBnXkFtZTcwNDQyMzA1MQ@@._V1_.jpg",
    "keywords": "character name as series title,dr. jekyll and mr. hyde characters,surname as series title,slasher horror,tv mini series",
    "name": "Jekyll",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kate_Dammit_Run"
        },
        "dateCreated": "2007-08-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0497298/"
        },
        "name": "Great",
        "reviewBody": "Great show. James Nesbitt is mesmerizing as BOTH Tom Jackman, a modern day Dr Jekyll, and Mr Hyde his vicious alter ego. This show is part sci-fi, part psychological drama, part conspiracy actioner. It's not perfect. The American accents are atrocious and some of the explanations and conspiracy elements are a bit weak, but it's riveting TV.\n\nJames Nesbitt plays Tom Jackman, a British doctor who discovers that he changes into someone else. That someone else is Mr Hyde, a superhuman driven to indulge his impulses. As one character says \"Hyde is a child with all the urges and needs of a grown man.\" Jackman seems to be the descendant of Henry Jekyll, who was the real life inspiration for the Robert Louis Stevenson story. This is despite the fact that Jekyll had no known descendants, and apparently died a virgin. Jackman himself had no known parents, being found abandoned at a train station and raised in foster care. That's the basis for a somewhat intiguing mystery and a sometimes disappointing conspiracy plot as Jackman is targeted by a powerful multinational corporation.\n\nBut the real attraction here is Nesbitt and the interaction between the Jackman and Hyde personalities. Nesbitt, who will be familiar to British, and some American viewers, from the show Murphy's law, and the film Bloody Sunday, shines here and gets to show off the full range of his acting chops. When he's Jackman he's a somewhat nebishy man who loves his family so much that he leaves them in order to isolate them from Hyde. It's a very real and dramatic performance. As Hyde he is all flamboyance a swaggering bon vivant who could have stepped out of a Broadway show, except for the fact that his shirt is covered in blood and he could turn violent at any moment. Nesbitt doesn't play Hyde as a macho bully, but rather as someone even more dangerous, a creature with no boundaries, driven only by passion, whether that's for food, sex, or violence. The interplay between these two aspects of Nesbitts performance is a joy to behold.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3817996569",
        "name": "Jekyll",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTc0Yjc4ZjQtYTRhZS00ZGI3LTk0YzctMmU1NjJmNDlmYjRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTc0Yjc4ZjQtYTRhZS00ZGI3LTk0YzctMmU1NjJmNDlmYjRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:49:39Z",
        "url": "https://www.imdb.com/video/vi3817996569/"
    },
    "url": "/title/tt0497298/"
}