{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Cruise",
            "url": "/name/nm0000129/"
        },
        {
            "@type": "Person",
            "name": "Cuba Gooding Jr.",
            "url": "/name/nm0000421/"
        },
        {
            "@type": "Person",
            "name": "Renée Zellweger",
            "url": "/name/nm0000250/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 273353,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005883/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035761/"
        },
        {
            "@type": "Person",
            "name": "Cameron Crowe",
            "url": "/name/nm0001081/"
        }
    ],
    "datePublished": "1996-12-13",
    "description": "When a sports agent has a moral epiphany and is fired for expressing it, he decides to put his new philosophy to the test as an independent agent with the only athlete who stays with him and his former colleague.",
    "director": [
        {
            "@type": "Person",
            "name": "Cameron Crowe",
            "url": "/name/nm0001081/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTM0ZWNmZTUtOTVkZS00MTZiLTg3M2QtZjA0Y2RmOWM1NWEyXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "agent,sports agent,football,football player,single mother",
    "name": "Jerry Maguire",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "classicalsteve"
        },
        "dateCreated": "2007-08-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116695/"
        },
        "name": "Agent Seeks Something Higher -- Possibly Cruise's Best Film",
        "reviewBody": "At the 1997 Academy Awards, host Billy Crystal referred to the characters played by the five Best Actor nominees (of which Tom Cruise was one) as being \"a burned guy, a mentally-challenged guy, a mentally-abused guy, a paralyzed guy, and an agent. And four out of the five are treatable.\" Of course Crystal was jokingly referring to the Agent as being beyond help. Among the figures of sports and entertainment, agents are often regarded as the necessary evil of the industry often with reputations as being the sleaziest of VIP's, just-above used car salesmen. Their antics which require a high-level of tough negotiations are sometimes seen as money-gouging and materialistic. In the film \"Jerry Maguire\", Tom Cruise decides to wear the shoes of a sports agent and walk around in them for just over two hours.\n\n\"Who am I, and what am I doing?\" Jerry Maguire asks when he realizes his sports agency, SMI, tries to cover up the darker aspects of professional sports. His answer is inspiring, transcendent, and detrimental. He mistakenly writes down his inspired thoughts and submits them to his colleagues for suggesting the agency concentrate better on fewer clients. For his inspiration, he loses his place at his agency and many of his highest-paying clients to his rival Bob Sugar. Subsequently, he also loses his attractive but shallow fiancé. Maguire is forced to try and live his dream of being more caring and receptive towards the needs of his clients rather than just being there to get a slice of his athlete/clients' multi-million-dollar paychecks. In a particularly poignant sequence, he retains his client Frank \"Cush\" Cushman who is a leading contender in the NFL draft through a handshake with his father, played by Beau Bridges. However, on draft day, he learns through an unexpected phone call that his rival Bob Sugar, through deception, convinced Cushman to sign with him instead. Now, Maguire has retained only Tidwell, and he must create his new agency from the ground up with only a single client as his starting point.\n\nSo the question asked of the movie is: Can a sports agent find a more meaningful, possibly spiritual, life and still acquire the high-paying clientèle? And maybe even more to the point, can an agent make a difference beyond just being a high-powered money negotiator? \"Jerry Maguire\" is a thoroughly entertaining riches-to-rags-to-transcendence story of a fantasy sports agent trying to find a deeper purpose to an otherwise materialistic existence.\n\nThe film works at almost all levels, particularly because of the dynamism of Tom Cruise and Cuba Gooding Jr. in an Academy Award-winning performance, playing the only client willing to stay with Maguire. Part of the story is Maguire's journey from the purely material to a deeper and more-satisfying existence. Rod Tidwell (Gooding), wide receiver for the Cardinals, is a strange opposite to Cruise but has a similar problem. Tidwell is a devoted father and husband, emotionally involved with his family but does not quite give that same heart on the football field. The story becomes about both characters finding something deeper in their place in the world, Gooding giving what he gives to his family to his team, and Cruise giving to his clients and co-worker/lover Dorothy Boyd his love and attention. Renee Zellweger plays Dorothy Boyd in a passionate and sensitive performance that will definitely bring tears. Zellweger's son becomes an important character and also an inspiration to Cruise to find the deeper and more sensitive part of himself.\n\nIn the materialistic world of late 20th-century America, \"Jerry Maguire\" is a breath of fresh air. A rare story produced by the money-obsessed film studios about the dangers of losing oneself for the sake of self-promotion and monetary gain. An interesting statistic has emerged of late regarding a high number of American businessmen on their deathbeds who begin regretting the direction and purpose of their lives. \"Jerry Maguire\" offers an alternative, although probably few in his position would find the wisdom to change course. But since you can't take it with you, life is about what you leave behind.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2527247897",
        "name": "Jerry Maguire",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2E4YTVlYjgtZDk5My00MDk1LThlMjEtMzVlZTcxYmZmYWVhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2E4YTVlYjgtZDk5My00MDk1LThlMjEtMzVlZTcxYmZmYWVhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-05T17:05:12.220Z",
        "url": "https://www.imdb.com/video/vi2527247897/"
    },
    "url": "/title/tt0116695/"
}