{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Uri Baruch",
            "url": "/name/nm3137294/"
        },
        {
            "@type": "Person",
            "name": "Avinoam Danin",
            "url": "/name/nm3138834/"
        },
        {
            "@type": "Person",
            "name": "Luciano DeSilva",
            "url": "/name/nm7886282/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "genre": [
        "Documentary"
    ],
    "name": "Jesus and the Shroud of Turin",
    "original_info": {
        "id": "Jesus and the Shroud of Turin_1999",
        "name": "Jesus and the Shroud of Turin",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SimonJack"
        },
        "dateCreated": "2013-09-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1294507/"
        },
        "name": "Interesting film on an intriguing subject",
        "reviewBody": "Most people have heard of the Shroud of Turin, though many may not know anything more about it than its name. The shroud, housed in a church in Turin, Italy, is regarded by some as the burial linen that wrapped the body of Jesus Christ after his death nearly 2000 years ago. The shroud bears an image of the front and back of a middle-aged man who was killed by crucifixion. It has been one of the most studied, puzzling and controversial artifacts of history. \n\nThis 52-minute documentary made for TV gives a good thumbnail history of the shroud and its legendary origin. The film is mostly about the efforts of scientific teams to determine the source of the image and the origin of the shroud. Beginning in 1978 and continuing today, research has not been able to determine this. Just when one research effort seems to find part of an answer, new technology arrives that throws the earlier \"evidence\" in doubt. This film includes interviews with scholars, Catholic and Jewish leaders, and scientists in various fields. \n\nChristians, Jews and Muslims alike should find this film interesting. Those who enjoy scientific studies and research to solve mysteries should find the film enjoyable.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt1294507/"
}