{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sanjay Suri",
            "url": "/name/nm0839634/"
        },
        {
            "@type": "Person",
            "name": "Rahul Bose",
            "url": "/name/nm0097893/"
        },
        {
            "@type": "Person",
            "name": "Juhi Chawla",
            "url": "/name/nm0004487/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2105,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0109068/"
        },
        {
            "@type": "Person",
            "name": "Sujoy Ghosh",
            "url": "/name/nm1223910/"
        },
        {
            "@type": "Person",
            "name": "Milap Zaveri",
            "url": "/name/nm1179457/"
        },
        {
            "@type": "Person",
            "name": "Suresh Nair",
            "url": "/name/nm1330994/"
        }
    ],
    "datePublished": "2003-06-20",
    "description": "This is a story about love, friendship and music. Two copywriter brothers have lost in pop music contest called Jhankaar Beats for the last two years. They take the help of an apprentice to compete in a music contest.",
    "director": [
        {
            "@type": "Person",
            "name": "Sujoy Ghosh",
            "url": "/name/nm1223910/"
        }
    ],
    "duration": "PT2H23M",
    "genre": [
        "Comedy",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjZkZjU1NTAtMWI0Zi00ZWI5LWE0OTMtMTI1M2Y5ZjMwZGM2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "advertising,pregnant wife,music contest,divorce,condom",
    "name": "Jhankaar Beats",
    "original_info": {
        "id": "Jhankaar Beats_2003",
        "name": "Jhankaar Beats",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kunalsen_7684"
        },
        "dateCreated": "2007-03-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0347278/"
        },
        "name": "Brilliant Film",
        "reviewBody": "Jhankaar Beats, a film by a debut director Sujoy Ghosh is a witty, intelligent, charming and fun film about 3 couples- essentially representing 3 stages of any couple's life- Couple 1: Sanjay Suri and Juhi Chawla are this much in love couple who are expecting their second child. Couple 2: Rahul Bose (brilliant in his role of Rishi) and Rinke Khanna who play an estranged couple on the verge of divorce- much of their story is told in flashbacks. Couple 3: Shayan Munshi (a quite capable debut turn by him in the role of the bumbling, underconfident Indraneel- bordering on Saif's character of Sameer in Dil Chahta Hai with which this film draws a ready and obvious comparison almost instantaneously) and playing his love interest is a rather beautiful Riya Sen who plays the bimbette to near perfection and initially does not reciprocate Indraneel's affection for her. How he wins her over forms one of the most interesting subplots towards the middle of the movie The story is essentially of these 2 friends, Sanjay (lead vocalist) and Rahul (drummer), trying to win a rock contest named \"Jhankaar Beats\" having lost on previous 2 occasions. Later, in their pursuits, they're joined by Indraneel (guitarist)who also happens to be their boss' son. Apart from the contest, they have to manage their love lives, family lives, complaining neighbours, a demanding boss, an ad campaign for condoms and unscrupulous competition from corporate sharks and other rock bands. In the end, they manage to win the contest and their dream comes true. What works very well for the film is its economical storyline, fine characterisations, great music (especially Suno Na and Tu Hai Aasman Mein). The film is also an ode to RD Burman and is fraught with trivia about him and also, interesting albeit colloquial anecdotes about Sholay and condoms. Go figure!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0347278/"
}