{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Billy Cox",
            "url": "/name/nm0184929/"
        },
        {
            "@type": "Person",
            "name": "Jimi Hendrix",
            "url": "/name/nm0001342/"
        },
        {
            "@type": "Person",
            "name": "Larry Lee",
            "url": "/name/nm0497720/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 520,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "description": "Live At Woodstock features all of the existing film footage from Jimi's unforgettable August, 1969, Woodstock concert newly re-edited and presented uninterrupted in its original performance sequence.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Wadleigh",
            "url": "/name/nm0905579/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTA3MzE3OTA1Nl5BMl5BanBnXkFtZTcwMjUwMTEzMQ@@._V1_.jpg",
    "keywords": "woodstock,live performance,concert film",
    "name": "Jimi Hendrix: Live at Woodstock",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chevick_1776"
        },
        "dateCreated": "2007-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0836665/"
        },
        "name": "This is history, a great documentary with excellent sound and video.",
        "reviewBody": "As a child, I enjoyed music which was popular about 10 years before my time. I first became cognizant of my taste in music around 1974 and growing up through the eighties my peers and I always lacked that video connection to music. We might have gotten a news story, or an appearance on SNL or the tonight show, but the quantity and frequency of contact with our musical heroes through moving pictures was clearly lacking.\n\nWhen I bought this video I expected to see... well... you know, Hendrix playing at Woodstock. This is much more than I had expected. We are so fortunate today to be able to obtain the quality and quantity of video footage you will see in this DVD. The first disc contains a short documentary about the whole Woodstock scenario told from the perspectives of many of Jimi's people and some who organized the show. It explains how Hendrix came to play there, what he and his band did in the days prior to the show and how the show progressed resulting in Hendrix's final appearance on the Monday morning. The actual concert footage is presented in brilliant color, great sound and unbelievable video quality. His energetic performance fulfills all the efforts that were made to qualitatively document it.\n\nThe second disc contains the whole show again but including one or two songs not included in the first disc and is interspersed with black and white TV video of the show from another camera present that day. This footage is carefully synchronized to the high quality audio track and cuts in between footage from the color cameras. \n\nLastly the cost was incredible. Ten dollars for two DVDs so rich in history. If you like Hendrix or are intrigued in any way by the culture of the sixties or of The Woodstock show, buy this DVD.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0836665/"
}