{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adrienne Barbeau",
            "url": "/name/nm0000105/"
        },
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        },
        {
            "@type": "Person",
            "name": "Nick Castle",
            "url": "/name/nm0145309/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 180,
        "ratingValue": 7,
        "worstRating": 1
    },
    "datePublished": "2004-03-23",
    "description": "Chronicles the work of cult director John Carpenter through interviews with him and his associates, with emphases on the earlier work.",
    "director": [
        {
            "@type": "Person",
            "name": "Garry S. Grant",
            "url": "/name/nm1087792/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjg1NTQ1YmEtZjE5Yy00OGQzLTk4NzYtMjcyYjBkZTAwNGMyXkEyXkFqcGdeQXVyNDMxMTc5OTE@._V1_.jpg",
    "name": "John Carpenter: Fear Is Just the Beginning... The Man and His Movies",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2008-10-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1121029/"
        },
        "name": "Decent Doc",
        "reviewBody": "John Carpenter: Fear is Just the Beginning (2004) \n\n*** (out of 4)\n\nInteresting but short documentary on the life and career of horror master John Carpenter. The documentary skips over films like Elvis but many of his horror classics are discussed. If you've ever read an interview about Carpenter or listened to one of his commentaries then you aren't going to learn too much here but if you're new to his work then this would be a great place to start when going into his work. We get interviews with Jamie Lee Curtis, Kurt Russell, George Romero, Alice Cooper, Adrienne Barbeau, Debra Hill and Peter Fonda among others. We get some nice stories from John about his obsession with Hawks, Wayne and various westerns as well as getting to see a few brief clips from some of his USC student films. Again, those who know the man's work isn't going to learn anything new here but if you've got time to kill then this isn't too bad."
    },
    "url": "/title/tt1121029/"
}