{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Berenger",
            "url": "/name/nm0000297/"
        },
        {
            "@type": "Person",
            "name": "Luke Perry",
            "url": "/name/nm0000580/"
        },
        {
            "@type": "Person",
            "name": "Burt Reynolds",
            "url": "/name/nm0000608/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 764,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0069955/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045255/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080288/"
        },
        {
            "@type": "Person",
            "name": "Frederick Manfred",
            "url": "/name/nm1540255/"
        },
        {
            "@type": "Person",
            "name": "Larry McMurtry",
            "url": "/name/nm0573505/"
        },
        {
            "@type": "Person",
            "name": "Diana Ossana",
            "url": "/name/nm0652223/"
        }
    ],
    "datePublished": "2002-08-24",
    "description": "The three Hammett brothers are caught in a conflict that escalates rapidly and the old farmers facing against new farmers who have settled in the green grasslands.",
    "director": [
        {
            "@type": "Person",
            "name": "David S. Cass Sr.",
            "url": "/name/nm0003180/"
        }
    ],
    "duration": "PT4H",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmE3ZjcyMzktZmU1NC00ZTM0LTgxNDAtZjBhY2I2MGY1MmU4XkEyXkFqcGdeQXVyMTgwNzM3MTE@._V1_.jpg",
    "keywords": "wine,woman smokes a cigar,man tied up,hanging,saved from hanging",
    "name": "Johnson County War",
    "original_info": {
        "id": "Johnson County War_2001",
        "name": "Johnson County War",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bobster36"
        },
        "dateCreated": "2004-12-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0280264/"
        },
        "name": "Entertaining but not accurate.",
        "reviewBody": "I enjoyed the movie for its entertainment value. But a movie titled The Johnson County War should endeavor to tell the story of its namesake. Especially since it is not a well known event and viewers are likely to accept the movie as historically accurate.\n\nThe basics are intact. The cattle barons declared war on the small ranchers over the issue of open range. The small ranchers were liberally declared rustlers in order to justify prosecuting them with extreme prejudice. A small army of mercenaries was hired to do the dirty work. Those familiar with the history of the Johnson County War know that a rancher named Nate Champion stood off the mercenary army in his cabin for a considerable length of time.\n\nThe movie takes that event and fictionalizes it with Tom Berenger's Cain Hammett making that stand instead of Nate Champion. The details of that fight are fairly accurate. But Berenger's character is fictitious, with subplots about brothers and spouses. It is not Nate Champion by another name. So it makes little sense to me to make a movie about a historical event and pretend that it happened to someone different. Kind of like Custer's Last Stand with some fictitious guy named Clyde Smith as the leader of the Cavalry instead of Custer.\n\nThe movie makes for a good western. But Nate Champion's story is entertaining in itself. Christopher Walken portrayed him in Heaven's Gate, which is also about the Johnson County War. But in that movie, director Michael Cimino took the names of Jim Averill and Ella Watson, two small ranchers hanged early in the dispute, and assigned them to the Marshall portrayed by Kris Kristofferson and the prostitute portrayed by Isabelle Huppert.\n\nThe Johnson County War is a little known and interesting part of American history. Too bad that movie makers play so fast and loose with the facts.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0280264/"
}