{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Affleck",
            "url": "/name/nm0000255/"
        },
        {
            "@type": "Person",
            "name": "Mark Hamill",
            "url": "/name/nm0000434/"
        },
        {
            "@type": "Person",
            "name": "Richard Herd",
            "url": "/name/nm0378800/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13534,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0129164/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027541/"
        },
        {
            "@type": "Person",
            "name": "Eugenia Bostwick-Singer",
            "url": "/name/nm0098316/"
        },
        {
            "@type": "Person",
            "name": "Raymond Singer",
            "url": "/name/nm0802027/"
        },
        {
            "@type": "Person",
            "name": "Joe Stillman",
            "url": "/name/nm0830294/"
        }
    ],
    "datePublished": "2000-11-07",
    "description": "A prophet who has the ability to interpret dreams is sold into slavery in Egypt, where people learn of his gifts.",
    "director": [
        {
            "@type": "Person",
            "name": "Rob LaDuca",
            "url": "/name/nm0480349/"
        },
        {
            "@type": "Person",
            "name": "Robert C. Ramirez",
            "url": "/name/nm0708371/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Animation",
        "Adventure",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWEzMzg4M2EtYjhmMS00NGYzLWJiZTgtNTg3MGMzOTIxMDAxXkEyXkFqcGdeQXVyNjExODE1MDc@._V1_.jpg",
    "keywords": "wolf,slavery,egypt,four word title,direct to video",
    "name": "Joseph: King of Dreams",
    "original_info": {
        "id": "Joseph: King of Dreams_2000",
        "name": "Joseph: King of Dreams",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2010-01-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0264734/"
        },
        "name": "A very pleasant watch, but I don't think it is as good as The Prince of Egypt",
        "reviewBody": "Joseph:King of Dreams is a very pleasant direct to video film. Like Prince of Egypt, this is also based on a story from the Bible. However, while this is worth watching and underrated I think too, I don't think it is as good as Prince of Egypt. I have to be fair though, considering how superb Prince of Egypt was, for that movie is one of the most evocative, compelling and stirring animated movies ever, this film had a lot to live up to. In general, this does a more than acceptable job at telling the story from the Bible.\n\nThe film's criticisms are very few. The story while quite faithful to the story is a little choppy in places, but manages to be compelling enough in others. In its defence though, I have always felt the biblical story one of the less interesting stories in the Bible, but that is probably just me. There are also one or two moments when the character development is a little shallow, primarily with Joseph's brothers-Joseph was a very convincing and fleshed out protagonist- and the ending is perhaps abrupt. All these problems are probably disadvantaged by one major factor, the film for me is too short.\n\nHowever, there is so much to recommend. The animation is superb, the background art is audacious, and the fluidity of the character movements is evident. I loved the look of Joseph's coat, and how the animators animated his dreams. I also think the music is under-appreciated, as I really liked the songs. You Know Better Than I is my favourite, and I may have a confession, I have a slight preference to the songs here than I do to the Andrew Lloyd Webber musical. The characters are good, Joseph is convincing as a protagonist, especially in the latter half of the film, and Asenath is one of the more vivacious female characters in a non-Disney animated movie. She reminds me a bit of Tzipporah and Chel. And the voices were well done, quite the opposite. I don't normally care for Ben Affleck, but he wasn't that bad here. Going on a tangent, people complained of Matt Damon being dull in Spirit and I not only really liked the film but I thought Damon was good. If I had any thoughts on who voice acted better, I think Affleck was slightly better. Jodi Benson proves what a wonderful voice actress she is by providing a strong and emphatic persona for Asenath, and Mark Hamill is great as Judah.\n\nIn conclusion, this is a good film, not perfect, but it is underrated. 7/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT1M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2056454425",
        "name": "Joseph: King of Dreams",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTM3NDg1NjUtMDc5NS00OTE0LWI5MmUtZGE0Nzc2YTY5Nzg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTM3NDg1NjUtMDc5NS00OTE0LWI5MmUtZGE0Nzc2YTY5Nzg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:51:28Z",
        "url": "https://www.imdb.com/video/vi2056454425/"
    },
    "url": "/title/tt0264734/"
}