{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liam Neeson",
            "url": "/name/nm0000553/"
        },
        {
            "@type": "Person",
            "name": "Steve Atteberry",
            "url": "/name/nm1863432/"
        },
        {
            "@type": "Person",
            "name": "Nancy Holler Aulenbach",
            "url": "/name/nm0042036/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 528,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053632/"
        },
        {
            "@type": "Person",
            "name": "Jack Stephens",
            "url": "/name/nm0827041/"
        }
    ],
    "datePublished": "2001-03-09",
    "description": "Meet Dr. Hazel Barton and Nancy Aulenbach. These women are compelled to push their limits in hostile environments. They are cavers who risk fatal danger for the thrill of discovery. Barton and Aulenbach are extreme athletes and ex...",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Judson",
            "url": "/name/nm0431971/"
        }
    ],
    "duration": "PT39M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM0OTAzMzI1OV5BMl5BanBnXkFtZTcwMjY0MDYyMQ@@._V1_.jpg",
    "keywords": "cave,imax,spelunking,cave diving",
    "name": "Journey Into Amazing Caves",
    "original_info": {
        "id": "Journey Into Amazing Caves: IMAX_2001",
        "name": "Journey Into Amazing Caves: IMAX",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "christian94"
        },
        "dateCreated": "2001-05-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0270444/"
        },
        "name": "Taking IMAX to new heights by going down below",
        "reviewBody": "By far the most involving IMAX movie ever. It takes you to some of the most far-reached and hazardous place on Earth and makes you feel like you are actually there.\n\n(Enough with the corny stuff and on with the good part)\n\nThis documentary not only educates, but takes upon itself to share with the audience the passion, the danger, and the excitement of extreme speleology. A task that is accomplished in one swift stroke. The voyage takes us with experts Hazel Barton and Nancy Aulenbach to rocky caves in the Grand Canyon, icy caves in the Groenland and underwater caves in the tropics, in search of \"extremophiles\" (meaning love of the extreme), which are microorganisms which reside in once thought to be inhabitable habitats.We soon understand that they are themselves extremophiles, as they deeply love what they do and are always ready to embark on one perilous mission after the other. They risk their lives on numerous occasions and show courage and devotion in the name of science... and hey, because it's a lot of fun!!\n\nThe camera work is impeccable and makes maximum use of the IMAX technology to immerse the viewer in the fantastic experience. The directing is of high quality and creates a mood, a feel and a pace that keeps you captivated throughout. Stephen Judson, the director, utilize all the tools to make you part of what happens and make you understand the drive and desire that push those people to such limits. They come up with a perfect mixture of wonder, learning, adventure and tension.\n\nThe aesthetic composition of the visual arrangements recaptures admirably the natural splendor of the exotic surroundings. The flowing narration is combined with sincere and appropriate dialog (I don't think there exists one superfluous comment in the whole movie)\n\nFrom beginning to end the feature never falters, and when you start to feel the fantastic journey skillfully build to the ending, you are suddenly struck with fondness and admittedly yearn for more. That's when it gets even better! It ends perfectly.\n\nTo see in original IMAX projection, preferably.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Journey Into Amazing Caves",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3202679065",
        "name": "Journey Into Amazing Caves",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjdjNmIzOWQtM2Y0NS00NWQxLThlNzYtYjg2YWI2OWNjMTgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjdjNmIzOWQtM2Y0NS00NWQxLThlNzYtYjg2YWI2OWNjMTgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-05-29T20:59:26Z",
        "url": "https://www.imdb.com/video/vi3202679065/"
    },
    "url": "/title/tt0270444/"
}