{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Spencer Tracy",
            "url": "/name/nm0000075/"
        },
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Richard Widmark",
            "url": "/name/nm0001847/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 79161,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0160497/"
        },
        {
            "@type": "Person",
            "name": "Abby Mann",
            "url": "/name/nm0542631/"
        },
        {
            "@type": "Person",
            "name": "Montgomery Clift",
            "url": "/name/nm0001050/"
        }
    ],
    "datePublished": "1961-12-18",
    "description": "In 1948, an American court in occupied Germany tries four Nazis judged for war crimes.",
    "director": [
        {
            "@type": "Person",
            "name": "Stanley Kramer",
            "url": "/name/nm0006452/"
        }
    ],
    "duration": "PT2H59M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDc2ODQ5NTE2MV5BMl5BanBnXkFtZTcwODExMjUyNA@@._V1_.jpg",
    "keywords": "war crimes trial,nuremberg trials,allies occupation of germany,war crimes court,nuremberg germany",
    "name": "Judgment at Nuremberg",
    "original_info": {
        "id": "Judgment at Nuremberg_1961",
        "name": "Judgment at Nuremberg",
        "year": "1961"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbill-74877"
        },
        "dateCreated": "2017-09-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055031/"
        },
        "name": "Fantastic acting, script, and direction in a thought-provoking movie",
        "reviewBody": "Outstanding film. Star-studded with several fantastic performances. Highly emotional given the subject matter, but presented in a very intelligent, balanced way. I was struck at once by that, and by how well director Stanley Kramer gives us both sides of the argument – and avoids simply paying lip service to the defense of the German judges on trial. Maximilian Schell is brilliant as the defense attorney, well worthy of his Oscar, and is forceful and compelling in his arguments. There are also so many brilliant scenes. Spencer Tracy walking in the empty arena where the Nazi rallies were held, with Kramer focusing on the dais from which Hitler spoke. The testimony of Montgomery Clift and Judy Garland, both of whom are outstanding and should have gotten Oscars. Burt Lancaster in the role of one of the German judges, the one tortured by his complicity, knowing he and others are guilty. The devastating real film clips from the concentration camps, which are still spine tingling despite all we 'know' or have been exposed to. Marlene Dietrich as the German general's wife, haunted but expressing the German viewpoint, one time while people are singing over drinks. Her night stroll with Tracy, as she explains the words to one song, is touching. It just seemed like there was just one powerhouse scene after another, and the film did not seem long at all at three hours. Heck, you've even got Werner Klemperer and William Shatner before they would become Colonel Klink and Captain Kirk! In this film, the acting, the script, and the direction are all brilliant, and in harmony with one another.\n\nAs for the trial itself, the defense argument was along these lines: they were judges (and therefore interpreters), not makers of law. They didn't know about the atrocities in the concentration camps. At least one of them saved or helped many by staying in their roles and doing the best they could under the heavy hand of the Third Reich. They were patriots, saw improvement in the country when Hitler took power, but did not know how far he would go. If you were going to convict these judges, you would have to convict many more Germans (and where would it stop?). The Americans themselves practiced Eugenics and killed thousands and thousands of innocents at Hiroshima and Nagasaki. The one small weakness I found was that the defense never makes the simple argument that these judges were forced to do what they did, just as countless others in Germany were, and would have been imprisoned or killed themselves had they not complied. Anyone who's lived under a totalitarian regime may understand, or at least empathize.\n\nI'm not saying I bought into these arguments or that one should be an apologist to Nazis, but the fact that the film presented such a strong defense was thought provoking. How fantastic is it that Spencer Tracy plays his character the way he does – simply pursuing the facts, and in a quiet, thoughtful way. It's the best of humanity. How heartbreaking is Burt Lancaster's character, admitting they knew, admitting their guilt, knowing that what happened was horrible and that they were wrong, and yet seeking Tracy's understanding in that scene in the jail cell at the end – intellectual to intellectual - and being rebuked. Even a single life taken unjustly was wrong. Had the Axis won the war, I don't know which Americans would have been on trial for war crimes for the fire bombings of Dresden and Tokyo, or for dropping the atomic bombs, but the film makes one think, even for a war when things were seemingly as black and white as they could ever be. The particulars of this trial were fictionalized, but it's representative of what really occurred, and it transports you into events 70 years ago which seem so unreal today – and yet are so vitally important to understand, and remember.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this wartime drama",
        "duration": "PT3M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi296224025",
        "name": "Judgment At Nuremberg",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjFjMGQ4MjQtYTI5YS00NjczLTliMTAtMzBjMTA0MTRkYjg1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjFjMGQ4MjQtYTI5YS00NjczLTliMTAtMzBjMTA0MTRkYjg1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-11-01T04:32:45Z",
        "url": "https://www.imdb.com/video/vi296224025/"
    },
    "url": "/title/tt0055031/"
}