{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbara Barrie",
            "url": "/name/nm0057363/"
        },
        {
            "@type": "Person",
            "name": "Bob Dishy",
            "url": "/name/nm0228336/"
        },
        {
            "@type": "Person",
            "name": "Edie Falco",
            "url": "/name/nm0004908/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1084,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039690/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022461/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002342/"
        },
        {
            "@type": "Person",
            "name": "Eric Mendelsohn",
            "url": "/name/nm0578857/"
        }
    ],
    "datePublished": "1999-10-06",
    "description": "A lonely, talented teacher enjoys a flirtation with the (married) principal of the school, who returns her affections but is hampered by his family members. An eclipse enables the teacher and principal to steal several more fleeti...",
    "director": [
        {
            "@type": "Person",
            "name": "Eric Mendelsohn",
            "url": "/name/nm0578857/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgyNjE5OTk4MV5BMl5BanBnXkFtZTYwODYwOTk4._V1_.jpg",
    "keywords": "former classmate,place name in title,city name in title,teacher,filmmaker",
    "name": "Judy Berlin",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "luca-33"
        },
        "dateCreated": "2001-05-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0181618/"
        },
        "name": "The Neglected Gem of 2000",
        "reviewBody": "This is the neglected gem of last year, and in my estimation the best film of the year.\n\nThink of it as a middle-class Ice Storm, but while the upper-class suburbanites of Ice Storm were too distant and unreal to care about, the middle-class lives depicted in Judy Berlin are very real and both heart-breakingly sad and genuinely funny (without caricature or directorial mocking). I've often heard the phrase laughing through tears, but never experienced it until seeing this film. \n\nThe performances are without exception incisive and dead-on. Of particular note: the counterpoint of Aaron Harnick's sad, lost David and the open-faced lifeforce that is Edie Falco's Judy; Barbara Barrie's portrait of a loving schoolteacher -- with an edge; Bob Dishy's sullen and conflicted Arthur, among the most subtle work in this usually comic actor's long career; and Madelyn Kahn in her final film role, touching and hilarious (as always) as a housewife on the verge of a nervous breakdown. Her scene when she encounters her psychiatrist while aimlessly wandering the streets during the eclipse, and manages to offer him words of comfort, is the film's defining moment -- a film of beautifully etched characters behaving in very real yet very surprising ways in moments of conflict filled with shades of gray.\n\nSpeaking of which, the film is shot brilliantly in black and white to point up both the beauty and the horror of this suburban landscape.\n\nHowever did this film languish on a shelf for two years? If film scripts were eligible for Pulitzer Prizes, Eric Mendelsohn's would have surely been a contender."
    },
    "url": "/title/tt0181618/"
}