{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        },
        {
            "@type": "Person",
            "name": "Jason Robards",
            "url": "/name/nm0001673/"
        },
        {
            "@type": "Person",
            "name": "John Gielgud",
            "url": "/name/nm0000024/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1862,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071222/"
        },
        {
            "@type": "Person",
            "name": "Robert Furnival",
            "url": "/name/nm0299058/"
        },
        {
            "@type": "Person",
            "name": "William Shakespeare",
            "url": "/name/nm0000636/"
        }
    ],
    "datePublished": "1970-02-21",
    "description": "The growing ambition of Julius Caesar is a source of major concern to his close friend Brutus. Cassius persuades him to participate in his plot to assassinate Caesar, but they have both sorely underestimated Mark Antony.",
    "director": [
        {
            "@type": "Person",
            "name": "Stuart Burge",
            "url": "/name/nm0121169/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjAxNzA1ZjEtNzZhNi00ZmM0LWExOWMtMmRkZWE1ZTQ4NTIwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "bare chested male,hairy chest,julius caesar character,mark antony character,brutus character",
    "name": "Julius Caesar",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kayaker36"
        },
        "dateCreated": "2009-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065922/"
        },
        "name": "Modest Production in Some Ways Superior to the Brando Version.",
        "reviewBody": "By now in his late forties and sporting an obvious, bright red hairpiece, Charlton Heston seemed an odd Antony when first seen. But Heston remained fit all through his long career. While he does not as much look the part, his Marc Antony provides a sturdy center for this second filming of the Shakespeare tragedy. Also, Charlton Heston had a scholarly side unusual for a Hollywood actor. He clearly gave much thought to this portrayal which on the whole is better than the misplaced Method emoting of Marlon Brando's Antony, some seventeen years earlier. \n\nFeaturing a mixed cast of British and American actors, the result is mainly predictable but some surprises and disappointments also feature. One disappointment is Gielgud as Caesar. Sir John was a veteran Shakespearian by 1970 with a fine voice and tons of dignity. Yet at sixty-six he was a touch too old for the part. More to the point, the effete Gielgud lacked the masculine force to play this virile ex-general whose battlefield victories were said to be matched only by his conquests in the bedroom. \n\nOne surprise is the subtle portrayal of the conspirator Casca by American Robert Vaughan. \"Sour\" Casca, the cynical observer, is a minor character but sharply drawn and Vaughan makes him come alive during his few minutes on stage. Jill Bennet is sympathetic as the prophetic wife of Caesar but in the role of Brutus' wife the well-born Portia, Diana Rigg at age thirty-two looks luscious and is simply superb--Shakespeare in the finest style. Another veteran Shakespearian, Richard Johnson, is nearly as good as the jealous, manipulative Cassius.\n\nJason Robards plays Brutus like a wooden Indian for the first two acts. In the third act however--that is, after Brutus and Cassius have fled Rome--he seems to grow in the part and his acting gains conviction. \n\nThe importance of the plebeians to the play was understood by this director, who cast the roles carefully.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0065922/"
}