{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tunde Adebimpe",
            "url": "/name/nm0011758/"
        },
        {
            "@type": "Person",
            "name": "Hippolyte Girardot",
            "url": "/name/nm0320762/"
        },
        {
            "@type": "Person",
            "name": "Raul A. Reyes",
            "url": "/name/nm1053118/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1458,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013919/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002948/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063919/"
        },
        {
            "@type": "Person",
            "name": "Joel Hopkins",
            "url": "/name/nm0394199/"
        },
        {
            "@type": "Person",
            "name": "Iain Tibbles",
            "url": "/name/nm0975140/"
        }
    ],
    "datePublished": "2001-11-09",
    "description": "A young Nigerian man on the verge of being in an arranged marriage, suddenly questions his situation after an encounter with a stunning Latin woman, who is also about to be married.",
    "director": [
        {
            "@type": "Person",
            "name": "Joel Hopkins",
            "url": "/name/nm0394199/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYyNzk1MDEwMF5BMl5BanBnXkFtZTcwMDg5OTYyMQ@@._V1_.jpg",
    "keywords": "based on short film,airport,niagara falls,arranged marriage,interracial romance",
    "name": "Jump Tomorrow",
    "original_info": {
        "id": "Jump Tomorrow_2001",
        "name": "Jump Tomorrow",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kylopod"
        },
        "dateCreated": "2005-10-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0273300/"
        },
        "name": "An overlooked gem",
        "reviewBody": "My first viewing of \"Jump Tomorrow\" was a rare instance when I knew I was going to love a film as soon as I saw the first shot, which depicts nothing more unusual than a bespectacled man being fitted into a suit. From the man's stiff posture and timid face it is obvious that he's very shy and passive. I immediately realized that I was seeing a good actor who was able to suggest an entire personality while hardly doing anything, indeed barely moving at all.\n\nThe name of the actor is Tunde Adebimpe, and I am astonished that he is not more famous. Apparently, this is one of the only films he's ever acted in, other than the short college film it's based on, in which he played the same character. Primarily, he's an animator rather than an actor. But the performance he gives in this film is nothing short of remarkable. And it is in the course of an extremely creative and quirky little movie that brings surprising life to an old formula.\n\nThe plot is simple: George, an American from a Nigerian immigrant family, is about to marry a childhood friend, and on the way to the wedding he falls for a Spanish woman, Alicia. If that premise sounds hopelessly familiar, the movie finds just about every possible way to make it seem fresh and original. While the beginning and end stick pretty closely to the conventions of the genre, the events in between manage to take some very interesting turns. The film is like one of those magical rooms that's much larger on the inside than on the outside.\n\nWhen you hear the premise you might be led to assume, as I first did, that this is merely another ethnic comedy about someone who's expected to marry within the culture but ends up falling for someone of another ethnicity and at first the family objects, but eventually everyone comes around and learns a valuable lesson about cultural tolerance. While some of those films are enjoyable in their way, this patronizing approach is all too common in the movies, where the formula is always about whether some \"exotic\" culture is willing to adapt to Western norms that are inevitably deemed superior. Thankfully, \"Jump Tomorrow\" is not in that tradition at all. In fact, it deals surprisingly little with ethnicity, even though all the major characters are either non-white or non-American. By the middle of the film, you're likely to forget that it's even about an interracial relationship, because that point is never dwelt upon. George's family naturally expects him to marry the woman he grew up with, and the reason he's going along with their plans has nothing to do with some antiquated family betrothal custom: it is simply because he's such a passive and accepting individual.\n\nAdebimpe plays the character to such perfection that some of the movie's laughs come simply from the nuances of his voice and gestures. His lines reflect an understanding of these subtle traits, as when he casually observes that \"My face doesn't make sense without glasses.\" Comedy usually depends on frustrating a character's expectations, and \"Jump Tomorrow\" is no exception. I just don't believe I've ever seen in any other comedy a character quite like George, who wants nothing more than to blend in and be invisible, to avoid making waves. But he's inevitably humiliated in a hilarious sequence involving a woman named Heather Leather (the name still cracks me up), in an ill-advised scheme by his friend Gerard to make Alicia jealous. The event takes place at a hotel with a love motif and a variety of strange furniture, including a bathtub in the form of giant champagne glass. Without ever quite descending into surrealism, these scenes play like a tribute to several comic filmmakers from Blake Edwards to Woody Allen.\n\nBut George has a very basic dignity that grows on you as the film progresses. Gerard has his own problems, and indeed the movie's title refers to George's words when talking his friend out of suicide. Gerard calls it \"the best talk-down speech I've ever heard,\" and I'd have to agree.\n\nAs in most romantic comedies, the rival love interest is a douche bag. But in \"Jump Tomorrow,\" even this character is given so many quirky and eccentric traits that he seems an original creation. He's a British professor who practices taekwondo in the rain, gives Alicia an engagement ring made of bone, and refers to her family as \"fascinating.\" We are tempted to wonder what she, a hopeless romantic, sees in him. That is a question we've all asked many times, both about movies and about real life.\n\nAt one point, Gerard gets into an argument with the professor over whether the French language is obsolete. This is one of many amusing scenes that deal with the theme of language differences. In an attempt to impress Alicia, George tries to learn Spanish by listening to travel audio-cassettes picked up at a local convenience store and by watching Spanish soap operas. Of course, he never gains more than a beginner's proficiency in the language, but in his fantasies he can speak the language fluently. The movie spoofs Spanish soaps in a handful of scenes in which he imagines himself as a character in one of these shows. Then there is Alicia's deaf-mute grandfather who takes an immediate liking to George, giving a wonderful performance without words and helping to highlight the movie's theme that commonality transcends language. \"Jump Tomorrow\" is a small masterpiece that I have made it my mission to make known to other movie lovers.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0273300/"
}