{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gillian Chung",
            "url": "/name/nm1239735/"
        },
        {
            "@type": "Person",
            "name": "Charlene Choi",
            "url": "/name/nm1218953/"
        },
        {
            "@type": "Person",
            "name": "Shawn Yue",
            "url": "/name/nm1284845/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 249,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "Just One Look",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047933/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0297233/"
        },
        {
            "@type": "Person",
            "name": "Kam-Hung Yip",
            "url": "/name/nm0948134/"
        }
    ],
    "datePublished": "2002-09-19",
    "description": "Best friends start kung fu lessons after they spot the master's beautiful daughter.",
    "director": [
        {
            "@type": "Person",
            "name": "Kam-Hung Yip",
            "url": "/name/nm0948134/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjc0ZDY3YzAtMDE1MS00OGIxLWE5NDEtZmE4MWZhYTJlNmNjXkEyXkFqcGdeQXVyMTE1NjY2NTE@._V1_.jpg",
    "name": "Yat luk che",
    "original_info": {
        "id": "Just One Look_2002",
        "name": "Just One Look",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "leekandham"
        },
        "dateCreated": "2003-03-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0348448/"
        },
        "name": "Don't judge a cover",
        "reviewBody": "They say never judge a book by its cover, and the truth could be said of the DVD I bought. This film is marketed on the kerch-ing value of the bubblegum popstars, TWINS, Gillian Chung and Charlene Choi. On the front is the picture of the cheery quartet bathed in a scene of primary colours in what looks like a film containing significant amounts of childish comedy. But so, so wrong was I to believe it, thankfully.\n\nSet in 70s Hong Kong, Just One Look actually tells of Fan (Shawn Yu), whose policeman father commits suicide in a cinema toilet, but Fan believes he was murdered by a gangster nicknamed 'Crazy' (Anthony Wong). Ten years later Fan contemplates avenging his father's death. Meanwhile, he and best friend Ming (Wong Yu Nam), who are movie fans and sell their family wares outside the local cinema, decide to enlist for kung fu lessons after spotting the master's beautiful daughter (Charlene Choi). But Fan falls for a mysterious girl who lives in the countryside (Gillian Chung).\n\nIt's a tough job trying to condense the story into one paragraph, given that there is so much that goes on in the film. And that's really its problem. The story is original and great, but it hasn't been adapted well into a screenplay. It has much of the novel-ish feel about it, giving a stop-start feeling to the film. The overall plot is often too sidelined in favour of the moment, and that's especially the case in Fan's vengeance which is forgotten for the best part of the film. But, overall, it is actually good story with plenty of depth and subtext, something I find a rarity in HK films.\n\nThe film is otherwise well made. I'm impressed by Shawn Yu's ability to hold the main role. Wong You Nam does well to provide the partnership (although his acting feels a little bit raw). With regard to the TWINS factor, I have mixed feelings about their appearance. Charlene Choi is no doubt a natural actress. This was the first time I've seen Gillian Chung, but I was not disappointed. We don't see bubblegum acting that is the trademark of their pop. But for me the casting of the TWINS in their characters is perplexing. To be honest, they aren't central characters really, and are there as love interests for Fan and Ming. But given TWINS are such superstars in Hong Kong, I'm disappointed that their parts were much more significant and I'm sure most TWINS fans would be disappointed because of their smaller parts. And if that wasn't enough the IIB category rating restricts some younger fans from seeing the film (almost akin to the All Saints movie, Honest, getting an 18 rating in the UK). Meanwhile, Anthony Wong is at his best in this film.\n\nJust One Look is one of those films that I think is a good effort and isn't too bad. But what stops me from saying it's excellent is that there is so much more that the makers could have done with the film. It never fulfilled its potential. It may be harsh of me to say that, given that the quality of what Just One Look has is already way beyond most films, but it is a little disappointing that it never pushed fully to the boundaries. There was so much more in the story and the film, I'm just sorry that it just didn't appear on screen.\n\nMeanwhile, I feel the marketers of this film really needs to respect the film and their makers. To use another saying, in the case of the cover of the DVD, the shoe doesn't fit. TWINS are no doubt a huge franchise to exploit, but this film wasn't about TWINS. It's a good film with decent acting and a enjoyable performance. It verged more towards the art-house, independent film genre than most mainstream films do. Sadly, the packaging is misleading.\n\nFor me, I'd love to see more of the young talent on show here. Best of luck to them!\n\nOverall, one to watch for the new talent.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0348448/"
}