{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jim Belushi",
            "url": "/name/nm0000902/"
        },
        {
            "@type": "Person",
            "name": "Christine Tucci",
            "url": "/name/nm0875684/"
        },
        {
            "@type": "Person",
            "name": "James Handy",
            "url": "/name/nm0359695/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4806,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023827/"
        },
        {
            "@type": "Person",
            "name": "Steven Siegel",
            "url": "/name/nm0797017/"
        },
        {
            "@type": "Person",
            "name": "Scott Myers",
            "url": "/name/nm0616851/"
        },
        {
            "@type": "Person",
            "name": "Gary Scott Thompson",
            "url": "/name/nm0860155/"
        }
    ],
    "datePublished": "1999-12-12",
    "description": "In this sequel to the action comedy K-9, Detective Mike Dooley and his trusty canine companion Jerry Lee get two new partners - a Doberman Pincher named Zeus and his new trainer.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles T. Kanganis",
            "url": "/name/nm0304395/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2ODkxNDI5Nl5BMl5BanBnXkFtZTcwMDU2MDQyMQ@@._V1_.jpg",
    "keywords": "stuffed animal toy,photography,talking through a door,slimehouse,police officer attacked",
    "name": "K-911",
    "original_info": {
        "id": "K-911_1999",
        "name": "K-911",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-10-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0177876/"
        },
        "name": "Dumb, cheap, careless, lazy but slightly enjoyable if you're in a really, really, really, REALLY undemanding mood",
        "reviewBody": "Dooley and Jerry Lee are still on the force when they have a rough two weeks of almost being killed  ending in a huge gunfight where they fail to catch the suspect because they are out of shape. They are given new partners in Welles and her über-hound Zeus. Despite the misunderstandings and Jerry Lee's crisis of confidence they start to hunt down the man who burns with anger against Dooley.\n\nI wanted to hate this, I must admit. I thought this was going to be rubbish and that I wouldn't get though 5 minutes. I was right, in that it has plenty of flaws, but it was still diverting enough to be slightly enjoyable. The plot is Stupid (note the capital S!), some nonsense about a killer after Dooley because of a bad book review. The way they track him down is dumb and if you want to follow the movie I suggest you give logic and reason the night off. The action scenes are rubbish, be it a rocket launcher attack or a massive shootout where no-one (NO-ONE) gets hit at all. I know it's a kids movie but this is too much.\n\nThe comedy is basic but at least it isn't just a retread of all the dog versus man jokes. It's still a love/hate buddy cop thing thought and it gets pretty tiresome after a while. Belushi tries hard but he's no Bill Murray. He simply can't carry the movie and his clowning is a bit much. Tucci is too straight laced and her \"Dutch\" is a joke. The dogs are OK but really lack character and I could only ever see them as well trained animals and not in terms of personalities or characters.\n\nThe film sets out it's production values from the first 5 minutes onwards. At the start we see Dooley get out of the shower. He is naked from the waist up but in the mirror behind him it is clear that he is wearing underwear! How did they miss this mistake!!!! It is repeated all the way though with tonnes of continuity mistakes  I never notice goofs in movies but here they are everywhere and really obvious. It's not a big problem but it does show how cheap this film is and how little care was put into it.\n\nOverall this made me laugh a few times but mostly AT the film and not WITH it. Belushi tries hard but the material is poor and the production values are so low that it's obvious that no-one wanted to make a good film  but just make a cheap film that would make a small profit on video and TV. Like I said, if you're in a silly mood, drunk, high or just a really undemanding (or dumb) person then you'll love this. If you're normal then you may just be able to stand it for 90 minutes but will struggle to use the word `enjoyed' when you tell your friends about it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3918725401",
        "name": "K-911",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTc1YTM0ZjQtMDExNy00OWFiLWEyZjYtNzMxYjI3MGJmMzJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTc1YTM0ZjQtMDExNy00OWFiLWEyZjYtNzMxYjI3MGJmMzJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:53:23Z",
        "url": "https://www.imdb.com/video/vi3918725401/"
    },
    "url": "/title/tt0177876/"
}