{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hilary Howard",
            "url": "/name/nm0962239/"
        },
        {
            "@type": "Person",
            "name": "Mitchell Riggs",
            "url": "/name/nm0726708/"
        },
        {
            "@type": "Person",
            "name": "Anthony Leslie",
            "url": "/name/nm0962282/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 226,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0090342/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075324/"
        },
        {
            "@type": "Person",
            "name": "Josh Apter",
            "url": "/name/nm0032567/"
        },
        {
            "@type": "Person",
            "name": "Hilary Howard",
            "url": "/name/nm0962239/"
        },
        {
            "@type": "Person",
            "name": "Anthony Leslie",
            "url": "/name/nm0962282/"
        }
    ],
    "datePublished": "2001-04-21",
    "director": [
        {
            "@type": "Person",
            "name": "Josh Apter",
            "url": "/name/nm0032567/"
        },
        {
            "@type": "Person",
            "name": "Peter Olsen",
            "url": "/name/nm0647776/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcyMjE0NjM0Nl5BMl5BanBnXkFtZTcwMzM1ODAyMQ@@._V1_.jpg",
    "keywords": "man urinating outside,cheating wife,husband wife argument,marijuana,hitchhiker",
    "name": "Kaaterskill Falls",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-06-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283429/"
        },
        "name": "Nice scenery and Mrs. Hoek was kinda cute",
        "reviewBody": "Well, the scenery's nice. I live in New York City and I'm an avid hiker. I often go to the areas where Kaaterskill Falls was filmed, in and around the Catskill Mountains. The opening of the film has some nice cinematography of the roads in the area, and the final sequence has some nice cinematography of hiking areas. \n\nThat's surprising, because the cinematography in the rest of the film, as well as the dialogue, the majority of the performances, the story and so on all suck.\n\nAs many have noted, Kaaterskill Falls is something of a remake of Roman Polanski's 1962 film, Nóz w wodzie (Knife in the Water). I haven't seen the Polanski film yet, but I'd imagine that there has to be more to it than there is here.\n\nKaaterskill Falls is very easy to state in a nutshell, because a nutshell is all there is. A wife, Ren (Hilary Howard), and her husband, Stimpy--er, uh, Mitchell (Mitchell Riggs), are traveling to a cabin in the Catskills to make a baby. They see a hitchhiker, Lyle (Anthony Leslie), and Ren impulsively decides to pick him up. The guy says he can't find a place to stay. Stimpy impulsively decides to let him stay with them. Flirtations and jealousies ensue. They go out hiking together the next day. And you can fill in the last sentence.\n\nOne problem with Kaaterskill Falls is that it's one of far too many films made in the wake of The Blair Witch Project (1999) with the belief that merely having a camera and a couple warm bodies will produce a good film. I'm not much of a fan of The Blair Witch Project, and I wasn't much of a fan of the film that precipitated it, The Last Broadcast (1998). The Blair Witch Project has also spawned a festering mound of copycat crap, such as The Black Witch Project (2001), Back Woods (2001), and on and on. But it's not that I hate all films in that vein. Both Open Water (2003) and Incident at Loch Ness (2004) are masterpieces in my view, for instance.\n\nBut a good film requires technical competence and decent performances. Not every actor is skilled at improvisation. Even those skilled at it can't always be \"on\"--just look at the hit and miss nature of Christopher Guest's films. Directors Josh Apter and Peter Olsen have their cast improv most of Kaaterskill Falls, and the result is that 80% of the film is a trio of talking heads spouting banal nonsense. Worse, you can often transparently see the cast attempting to stretch or twist conversations around to just keep them going, to just say something. How about writing some plot next time, guys? There's a reason I don't routinely knock on the doors of Joe Schmoes begging to see their home videos from birthday parties.\n\nSince a feature film currently needs to be about 90 minutes long, the \"talking heads spouting banal nonsense in the cabin\" segment goes on for about an hour. And when I say \"talking heads\", I'm being literal. I've only rarely seen directors more fond of close-ups. Apter and Olsen will routinely zoom in (often blurrily) to chins far enough that an actor's eyes are cut off. To make up for that, they'll next fill the screen with the actor's eyeball. Or nostril. Or cheekbone. During one five-minute segment of non-stop chatter between the three leads, they mostly leave the camera on Ren so that her whole face fills the screen. I guess Apter and Olsen went on a beer run. Even though there was often no plot, some medium and wide shots would have been nice to break up the monotony.\n\nAnd it gets worse. They routinely use sound continuity that goes way against the grain of visual continuity in that they have an actor talking for a few moments while we're looking at that actor without his or her lips moving. It's like they're trying to create a stoner freak-out moment--one of those woozy, the-world-is-taffy brain-jams where everything starts going out of sync. What that has to do with the story or tone of the film, I don't know. Kaaterskill Falls isn't exactly Head (1968), or even the drug scene from Killing Zoe (1994). In the same vein, they repeatedly use \"skip editing\". That's where a cut goes from the actor talking to the same actor talking a few moments later, saying something a bit different, in a different position in the frame, etc.--the effect is like an LP record skipping. That's an interesting effect but an hour of it is too much.\n\nApter and Olsen also have a number of technical problems, such as sound and lighting. The opening scene has horrid sound, and they even note as much on the commentary track. Fellows, if you didn't fix the sound with your ADR, try it again, and remix it. Hire a competent sound engineer (I work at a reasonable rate, by the way) and do it again. Don't just release it even though it's crappy. The lighting during the night scene was also horrible. I know it's supposed to be dark, but the audience needs to see _something_.\n\nThe last half hour is \"talking characters spouting banal nonsense on a hiking trail\". This section is a bit better, but I think part of it was my attraction to the scenery. That shows just what a bad decision it was to leave the talking heads in a cabin with particleboard walls for an hour. There's also a smidgen of plot in the last section. Still, that was only good enough to bring my score back up to a 3.\n\nThe Blair Witch Project wasn't that great. It was a success because of the ingenious marketing campaign. Let's stop trying to copy its \"formula\" and get back to creating worthwhile artworks.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Wellspring",
        "duration": "PT1M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3062890777",
        "name": "Kaaterskill Falls",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDVlOTcyYjAtYjgyZi00NjMwLTg5OGUtYjBmZmE0OGE3NjU5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDVlOTcyYjAtYjgyZi00NjMwLTg5OGUtYjBmZmE0OGE3NjU5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:41:21Z",
        "url": "https://www.imdb.com/video/vi3062890777/"
    },
    "url": "/title/tt0283429/"
}