{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shah Rukh Khan",
            "url": "/name/nm0451321/"
        },
        {
            "@type": "Person",
            "name": "Kajol",
            "url": "/name/nm0004418/"
        },
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 51878,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0078768/"
        },
        {
            "@type": "Person",
            "name": "Karan Johar",
            "url": "/name/nm0424103/"
        },
        {
            "@type": "Person",
            "name": "Sheena Parikh",
            "url": "/name/nm1099235/"
        }
    ],
    "datePublished": "2001-12-14",
    "description": "After marrying a poor woman, rich Rahul is disowned by his father and moves to London to build a new life. Years later, his now-grown younger brother Rohan embarks on a mission to bring Rahul back home and reunite the family.",
    "director": [
        {
            "@type": "Person",
            "name": "Karan Johar",
            "url": "/name/nm0424103/"
        }
    ],
    "duration": "PT3H30M",
    "genre": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTQ5Nzc3NzAtMzZlMS00ZWJjLWIxMGMtNDU4ZTQ1NmNjMjc5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "love,melodrama,marriage,funeral,wealth",
    "name": "Kabhi Khushi Kabhie Gham...",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tarynblake"
        },
        "dateCreated": "2005-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0248126/"
        },
        "name": "I adored this movie!",
        "reviewBody": "I absolutely adore this movie. I borrowed it from an Indian friend and first of all fell IN LOVE with Hrithrik Roshan. Not even the bootleg tape I had could hide his beauty. I think I watched the movie 3 times in one week! Seeing as how the film is 3 1/2 hours long, that's saying a lot.\n\nAs always, Sharukh Khan is a pleasant diversion on screen. Kajol's character was a lot of fun too. It's nice to see a girl with spunk get her man! Nearly all of the songs and choreography were stellar. I will most definitely buy this one.\n\nLike some of the other reviewers mentioned, there is definitely some over-acting but those few moments of suffering are rewarded with a variety of eye-candy. This film is definitely worth watching.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Yashvardhan Raichand lives a very wealthy lifestyle along with his wife, Nandini, and two sons, Rahul and Rohan. While Rahul has been adopted, Yashvardhan and Nandini treat him as their own. When their sons mature, they start to look for suitable brides for Rahul, and decide to get him married to a young woman named Naina. When Rahul is told about this, he tells them that he loves another woman by the name of Anjali Sharma. Yashvardhan decides to meet with the Sharma family, and finds out that they are middle-classed, unsophisticated, and will not be able to it into his family circle, as a result he refuses to permit Rahul to marry Anjali. A defiant Rahul decides to leave, gets married to Anjali, without his foster parents blessings, and re-locates to London, England, where Anjali's unmarried sister, Pooja, also lives. Rohan, who was studying in a hostel, returns home to find that Rahul is no longer living with them, and he also discovers that while outwardly his dad is not interested in seeing Rahul get back, Nandini wants the family back all together for all happy and sad moments. Rohan also misses Rahul a lot, and decides to travel to London in order to try and get Rahul to return home. Yashvardhan, is unable to prevent this, and as a result Rohan does travel to London, meets with Rahul, Anjali, and Pooja. The question remains will the hurt and sorrow that Rahul experienced with his foster parents be erased and enable the family to be reunited, or will Rahul forget about the past, and continue to live his life without getting back to his roots and the family who brought him up, leaving Rohan to return alone?",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2627582745",
        "name": "Kabhi Khushi Kabhie Gham trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDdjOWZhNDYtYjcwYi00ZTBiLTk5ZDctN2NjMDI2NDlhMTk3XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDdjOWZhNDYtYjcwYi00ZTBiLTk5ZDctN2NjMDI2NDlhMTk3XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-06-06T09:48:22Z",
        "url": "https://www.imdb.com/video/vi2627582745/"
    },
    "url": "/title/tt0248126/"
}