{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kirsten Dunst",
            "url": "/name/nm0000379/"
        },
        {
            "@type": "Person",
            "name": "Anjelica Huston",
            "url": "/name/nm0001378/"
        },
        {
            "@type": "Person",
            "name": "Richard Harris",
            "url": "/name/nm0001321/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4097,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "Kaena: The Prophecy",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040000/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047476/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077108/"
        },
        {
            "@type": "Person",
            "name": "Patrick Daher",
            "url": "/name/nm1668145/"
        },
        {
            "@type": "Person",
            "name": "Chris Delaporte",
            "url": "/name/nm1065068/"
        },
        {
            "@type": "Person",
            "name": "Tarik Hamdine",
            "url": "/name/nm1065397/"
        }
    ],
    "datePublished": "2003-06-04",
    "description": "On the distant planet Axis, rebellious, high-spirited teenage girl Kaena defies the High Priest and her people's ancestral beliefs to take a perilous journey and discover what dark secrets lie beyond the clouds.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Delaporte",
            "url": "/name/nm1065068/"
        },
        {
            "@type": "Person",
            "name": "Pascal Pinon",
            "url": "/name/nm0969927/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Animation",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxNTUwMzk0MF5BMl5BanBnXkFtZTYwODE3MTY2._V1_.jpg",
    "keywords": "ancestral beliefs,cg animation,secret,cloud,mortal danger",
    "name": "Kaena: La prophétie",
    "original_info": {
        "id": "Kaena: The Prophecy_2003",
        "name": "Kaena: The Prophecy",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Psiju"
        },
        "dateCreated": "2006-03-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0297753/"
        },
        "name": "Not a CGI revolution, but not terrible.",
        "reviewBody": "KAENA isn't bad, but it is just not what is considered \"ground-breaking,\" and there are many who claim it is. It's impressive considering that it was done on a low budget and dreampt up by people who at the beginning of the project had very little knowledge of film-making. KAENA is a great example of how a little resourcefulness can pull the rabbit out of the hat, but overall it certainly is not a revolution in CGI animation.\n\nThis is why it is not a CGI revolution: -Sometimes they had to cut corners by reducing the frame rate to 12 FPS. Ugh. I would've just cut the shots out altogether.\n\n-The character models often did not deform right. For example, if a human model lowered his arm, the skin would fold like clothing. Sometimes this would lead to noticeable distortions in the characters. Maybe they didn't care too much for painting skin weights properly.\n\n-The animation was very linear in some places. Objects and characters would basically switch between poses one at a time, a problem especially noticeable when characters are talking. You can almost see the animators pulling the sliders for their blend shapes! Here's an \"O\", here's an \"M\"...\n\n-Weight and inertia problems. Often people and objects did not move as they should under certain stress conditions. For example, Kaena landing on the floor after a very long jump. Not enough emphasis was put into the animation to make her landing credible. Or, when a huge sap monster stomps around, the camera shakes, but it does not seem as though the monster has as much mass as the screen area he occupies suggests. This happens so often, it's hard to buy into most of the character movements throughout the film.\n\n-The texturing was really monotonous. Most of the humans were very smooth-skinned, the wood texture for the roots was used too much (why couldn't they have something grow ON the roots? Or at least do something to give the surfaces more detail...it's almost as if they made a single NURBS surface for the floor in some shots), and sometimes, bump mapping was used very little on surfaces that were immediately noticeable to the viewer. It serves for some really dull and monochrome backgrounds.\n\n-Design inconsistency. This is a huge problem. Some humans looked more proportionately accurate than others, for example, Kaena had a somewhat realistic human body design, and others would be drawn more distorted, like cartoons. In addition, the sap monsters have really detailed models and effects, where many human characters were smooth or cartoon-like. The animation was also inconsistent this way-- sometimes Kaena would have more expression in her face than her body, and sometimes it'd be the opposite. It's almost as if, wow, many different artists worked on this film (but, we aren't supposed to know that, right?).\n\n-Motion blur. Please, if you aren't going to use deformations, turn up the motion blur. It seems as if the animation is STROBING. It would really help in those low frame rate shots.\n\nBut... there are some good things about the art of Kaena. The fluid effects were nicely done (although they did not often interact well with other objects), the lighting was well done, in somewhat of a chiaroscuro fashion, and some of the models are convincing; mainly the sap monsters because of their amount of detail. Bravo in these respects.\n\nOn the whole, I'd give the film a 6. It is impressive that so much was created with so little (they should get some sort of award for their resourcefulness, actually), but in the end, it doesn't come close to rivaling the big-wigs of America and Japan, and it's astonishing that people continue to boast otherwise about this film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2828009753",
        "name": "Kaena: The Prophecy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjNkODcwZmEtZTJmZi00N2Y5LWI1MWEtOTg0YmZiYjk5OTQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjNkODcwZmEtZTJmZi00N2Y5LWI1MWEtOTg0YmZiYjk5OTQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:41:23Z",
        "url": "https://www.imdb.com/video/vi2828009753/"
    },
    "url": "/title/tt0297753/"
}