{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ryô Hirohashi",
            "url": "/name/nm1209923/"
        },
        {
            "@type": "Person",
            "name": "Kaori Mizuhashi",
            "url": "/name/nm0594646/"
        },
        {
            "@type": "Person",
            "name": "Mai Nakahara",
            "url": "/name/nm1555635/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 37,
        "ratingValue": 6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0117822/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107303/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0151454/"
        },
        {
            "@type": "Person",
            "name": "Jun'ichi Satô",
            "url": "/name/nm0766218/"
        },
        {
            "@type": "Person",
            "name": "Reiko Yoshida",
            "url": "/name/nm1027089/"
        }
    ],
    "datePublished": "2004-09-24",
    "description": "The \"Fool\" has named Rosetta as the new Lead Star of Kaleido Stage. It is now Sora's turn to assist Rosetta for her new performance \"The Princess and the Fool\" like the way Layla assisted her.",
    "director": [
        {
            "@type": "Person",
            "name": "Yoshimasa Hiraike",
            "url": "/name/nm2171750/"
        },
        {
            "@type": "Person",
            "name": "Jun'ichi Satô",
            "url": "/name/nm0766218/"
        }
    ],
    "duration": "PT25M",
    "genre": [
        "Animation",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTVjM2JmNWUtODczYy00ZDZjLTljNmQtZjUyZTYzNTY5YjMxXkEyXkFqcGdeQXVyMjQ0OTA1Nzc@._V1_.jpg",
    "keywords": "anime animation,oav",
    "name": "Kaleido Star: Aratanaru Tsubasa Extra Stage - Waranai Sugoi Ohimesama",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "julianbarbie"
        },
        "dateCreated": "2023-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt6264836/"
        },
        "name": "I hate this OVA",
        "reviewBody": "I saw this anime for the first time in my country when I was little and I had fun with this anime and I saw that everything was perfect, but I cried when I saw the tragedies of all the circus artists and that is why now I understand why those artists always fought each other them, besides I don't have fun with that filler of the circus and I wouldn't be pacifist with those loser and grumpy artists. Besides, those artists demand a lot from me that I stay with them, because it would be a funny show to make people laugh at us because they tell me that they would not work if I did not stay with them and that is why I do not want to have those losing artists. That's why I don't recommend this anime for family. I hate this silly OVA because has such mediocre padding.\n\nIn addition, my family has told me that the circus is perverse and mediocre, this anime also has a very exaggerated padding. That's why I don't recommend this OVA. I don't want to be an artist and I don't want to work in a circus because all those artists don't want me to return to my family and be in my country, so it's not suitable for the family. Also I don't need to be so pacifist with those artists and I don't want to have friends who are such grumpy artists, and I don't want to stay with those circus jobs that don't suit me. Also I prefer I have never wanted to have friends as artists and I will never be so perfect for the circus, and then you will regret being in the circus. I don't adore Kaleido Star.\n\nThe ova has a lot of clumsiness with the characters and also Rosetta Passel disappoints Sora Naegino for not doing the silly princess play, that's why Rosetta Passel runs away from the Kaleido stage, later that night Sora Naegino and her friends go looking for her because They also don't want Rosetta Passel to return to Paris, because they did the same with Sora Naegino. And in the end they didn't put on the show of Sora Naegino and Rosetta Passel performing. This ova is the dumbest of all and should never be dubbed into languages, and should never be the final chapter with this ova.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt6264836/"
}