{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Teresa Izewska",
            "url": "/name/nm0412748/"
        },
        {
            "@type": "Person",
            "name": "Tadeusz Janczar",
            "url": "/name/nm0417361/"
        },
        {
            "@type": "Person",
            "name": "Wienczyslaw Glinski",
            "url": "/name/nm0322895/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7669,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016599/"
        },
        {
            "@type": "Person",
            "name": "Jerzy Stefan Stawinski",
            "url": "/name/nm0824046/"
        }
    ],
    "datePublished": "1957-04-20",
    "description": "In 1944, during the Warsaw uprising against the Nazis, Polish Lieutenant Zadra and his resistance fighters use Warsaw's sewer system to escape the German encirclement.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrzej Wajda",
            "url": "/name/nm0906667/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzNlNGY1NjktNmVjYy00NWZkLWFjNjgtZDNhZmY1N2ZlOTQ5XkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_.jpg",
    "keywords": "warsaw poland,year 1944,warsaw uprising,resistance,polish military",
    "name": "Kanal",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Goodbye_Ruby_Tuesday"
        },
        "dateCreated": "2008-09-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050585/"
        },
        "name": "Watch this film closely in the last hours of heroes lives...",
        "reviewBody": "Did Andrzej Wajda predict the modern horror film? Or was he merely acting on--and manipulating--our fear of the big, scary monster? There are many shots in KANAL where the camera will simply stay on a passageway seconds after the survivors leave the shot. As a modern audience who has lived through horror films, we expect a Nazi or a monster to slip into the frame in the background, but it never does. KANAL truly is a horror film, but what's unbearable to us and the sturdy group of Resistance fighters isn't the Nazis above the sewers or the metaphorical monster, but it is the solitude and emptiness that drives them to insanity, death or a bitter end.\n\nKANAL is Andrzej Wajda's dirty, bloody valentine to the heroes of the 1944 Warsaw Resistance as the film follows the last hours of a band of heroes in their ultimately futile attempt to escape the Nazis through the labyrinth of underground sewers. We are first introduced to them as strong, willful humans trying to survive in a world that's falling to ruins (One could also argue that Andrzej Wajda also created the first post-apocalypse film). They laugh, they love, they play music in the last happy moments of their lives. After they enter the sewers, we expect and want them to come out even more strong-willed than ever--how many people can face dead bodies floating in the water of a dirty sewer with the same calm defiance? But as time goes on and the group gets separated, it becomes more and more inevitable that these heroes are not meant for a Hollywood's movie's happy, redemptive ending.\n\nAndrzej Wajda, like Roman Polanski, was a real survivor of the Nazi invasion of Poland during WWII, and both became filmmakers who brought their experiences to films, as Polanski did with Oscar-winning THE PIANIST. However, Polanski's film, though absolutely profound, doesn't have Wajda's eye for details--the scenes of ruined Warsaw, for example, seem almost CGI'ed and it's obvious that he's trying to go for more, while Wajda will focus solely on the dirty ground, the debris blowing in the wind, or the flames of a burning building in the background. With Wajda, less is much more effective. If there is a situation more dirty, awful, lonely, scary or haunting than these people making their way through the labyrinths, I have yet to see it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0050585/"
}