{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rajesh Khanna",
            "url": "/name/nm0004435/"
        },
        {
            "@type": "Person",
            "name": "Asha Parekh",
            "url": "/name/nm0661239/"
        },
        {
            "@type": "Person",
            "name": "Prem Chopra",
            "url": "/name/nm0159159/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1063,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064267/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0148522/"
        },
        {
            "@type": "Person",
            "name": "Vrajendra Gaur",
            "url": "/name/nm0310170/"
        },
        {
            "@type": "Person",
            "name": "Gulshan Nanda",
            "url": "/name/nm0620786/"
        }
    ],
    "description": "A runaway bride promises her dying widowed friend that she will assume her identity and look after her infant child.",
    "director": [
        {
            "@type": "Person",
            "name": "Shakti Samanta",
            "url": "/name/nm0759662/"
        }
    ],
    "duration": "PT2H47M",
    "genre": [
        "Drama",
        "Family",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmZkYmZmN2YtOTNkNC00NTg5LWJlM2UtZjg2MWRlMGY2N2FiXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "train,widow,betrayal,assumed identity,love",
    "name": "Kati Patang",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "g_aparna"
        },
        "dateCreated": "2015-06-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065936/"
        },
        "name": "A woman cannot forget her first love is a total myth!",
        "reviewBody": "A female is deeply in love with a male. Female role played by Asha Parekh and male role – the role of first lover – Prem Chopra.\n\nPrem is actually in love with sexy siren Bindu (had Bindu taken birth in the 1990's – she would have been the most sought after heroine in the Bollywood film industry – Sunny Leone could not have made even an entry!). But Prem was a good actor – so he duped Asha by his lovey-dovey talks and Asha was deeply-2 in love with Prem. So you also know folkswhen a villainous male is in love and has managed to dupe a female to the extent that she readily runs away from home on her wedding day..also means that she probably had 'done that' – yea – I am talking about the process of copulation ..fornication – whatever you may call!!\n\nAnyway, Prem throws her out and now Asha had nowhere to go – she could obviously not go back home – her groom got the shock of his life (Rajesh Khanna) – when he came all ready to take home a pretty bride but had to go back empty handed!\n\nShe boards a train and heads for an unknown destinationtrain meets with an accident (look at her lifegosh! what an adventurous turning point) – her friend dies along with her husband leaving her child behind. Asha pretends to be that friend of hers and reaches her in-laws house (apparently the in-laws had never seen their daughter-in-lawlike they had thrown out their son because he had married against their wishesbut child birth sort of changed their opinion about them – no no – no cell phone of Facebook at that time folks – that images were easily available).\n\nLong story short – Asha meets Rajesh Khanna – OK – Rajesh had not seen her picture – like in the US, you have blind datesin India, we have blind marriages! He had just gone to the house – mounted on a horse – only to know that the bride had run away – so he went back home – never bothered to look at her picture also!) Call it decree of fate – Rajesh gets drawn to the widow (Asha was pretending to be a widow remember)- and eventually they get married! Wow! Happy ending!\n\nConclusion – Bollywood tried to make the Indian females understand that they may sleep around with just anyone who catches their fancy – coz. eventually, they will get married to the Hero! The daft category of females are still trying the funda outand causing misery to themselves as well as the society!!\n\nSo a woman can forget her 1st love after all - see Asha did forget all about Prem Chopra na....so chill!! (esp. for the dumb girls who cling to a single love affair all their life and live is sheer misery!)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The festival of colours wouldn't be complete without the perfect dance playlist for your Holi party. That's why we're taking a look back at some of our favorite films that sparked the popularity of these danceable Holi numbers.",
        "duration": "PT1M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1553776665",
        "name": "Movies With Songs That Celebrate Holi",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzUyYTkzMGEtOWE3Yi00NTZiLWFjMTktZWE5ODE1ODExNjQwXkEyXkFqcGdeQWplZmZscA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzUyYTkzMGEtOWE3Yi00NTZiLWFjMTktZWE5ODE1ODExNjQwXkEyXkFqcGdeQWplZmZscA@@._V1_.jpg",
        "uploadDate": "2021-03-25T00:52:09.370Z",
        "url": "https://www.imdb.com/video/vi1553776665/"
    },
    "url": "/title/tt0065936/"
}