{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Patricia Routledge",
            "url": "/name/nm0746151/"
        },
        {
            "@type": "Person",
            "name": "Clive Swift",
            "url": "/name/nm0842578/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey Hughes",
            "url": "/name/nm0400616/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16726,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "1990-10-29",
    "description": "A snobbish housewife is determined to climb the social ladder, in spite of her family's working class connections and the constant chagrin of her long suffering husband.",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjllOWNhYTktMTdmNy00Y2FjLTlmZGMtMmY5ZGZlYzYwZjJlXkEyXkFqcGdeQXVyNjc4NTExMTk@._V1_.jpg",
    "keywords": "british humor,unseen character,pompousness,english,pretentiousness",
    "name": "Keeping Up Appearances",
    "original_info": {
        "id": "Keeping Up Appearances_1990",
        "name": "Keeping Up Appearances",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hyperexcel"
        },
        "dateCreated": "2003-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098837/"
        },
        "name": "excellent British comedy",
        "reviewBody": "The dry humour of the Brits has no problem mixing up the slapstick in Keeping Up Appearances, a delicious series poking fun at the social graces of upper crust English society in the eyes of a lowly middle-class British wife.\n\n Patricia Routledge can't be more perfect as Hyacinth Bucket, the charming and altogether frightening definition of an English lady, despite her mediocre financial status. The series follows her incessant efforts to make a name for herself as a social elite, inviting neighbors and important townsfolk over for \"candlelight suppers,\" among other social events she so daftly names. Of course, the whole Hyacinth image wouldn't be nearly as funny unless the hysterical supporting cast weren't there to ground Mrs. Bucket (pronounced \"Bouquet\") in her place. Her working class sisters, the hussy Rose and the meek Daisy are perfect as Hyacinth's inescapable link to mediocrity. The image is complete with Daisy's slob of a husband Onslo, who dispenses his frank advice with racous results. Rounding up the innocent bystanders of Hyacinth's misadventures are her nervous neighbor Elizabeth and her brother Emmitt, but most of all Hyacinth's whipped yet sardonic husband, Richard, whom you can't help but pity and root for at the same time.\n\nThis is a British comedy to end all comedies. The chances for conflict between Hyacinth's goal as a social mistress and her bourgeois reality are infinite, and the laugh track doesn't lie when Hyacinth is caught between a rock and a hard place - more often literally than figuratively. If you aren't a fan of Brit comedy, you may only be able to stomach a few episodes before the formula seems to wear. However, a true social connoiseur of such a series would scoff at the idea. :-)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2381757977",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDFkZTgxNWYtMTkwYS00NWY4LThlMDEtMDY4M2IzMTI2ZDY4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDFkZTgxNWYtMTkwYS00NWY4LThlMDEtMDY4M2IzMTI2ZDY4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-04-14T11:10:37.476Z",
        "url": "https://www.imdb.com/video/vi2381757977/"
    },
    "url": "/title/tt0098837/"
}