{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Keith Carradine",
            "url": "/name/nm0001018/"
        },
        {
            "@type": "Person",
            "name": "Annette O'Toole",
            "url": "/name/nm0001578/"
        },
        {
            "@type": "Person",
            "name": "Brendan Fletcher",
            "url": "/name/nm0281956/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 340,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001673/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0237007/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039572/"
        },
        {
            "@type": "Person",
            "name": "Gerald Di Pego",
            "url": "/name/nm0224187/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth George Speare",
            "url": "/name/nm9368160/"
        }
    ],
    "datePublished": "1997-01-05",
    "description": "In this gripping coming of age survival saga, a colonial family seeks a new life in the uncharted Maine wilderness in 1768. Their hopes, dreams, and survival are put to the supreme test when 13-year-old Matt is left to protect the...",
    "director": [
        {
            "@type": "Person",
            "name": "Sheldon Larry",
            "url": "/name/nm0488688/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0Mzg0ODE4MV5BMl5BanBnXkFtZTcwOTI1MzA0MQ@@._V1_.jpg",
    "keywords": "based on children's book,historical drama,13 year old boy,year 1763,1700s",
    "name": "Keeping the Promise",
    "original_info": {
        "id": "Keeping the Promise_1997",
        "name": "Keeping the Promise",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "deexsocalygal"
        },
        "dateCreated": "2021-07-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119454/"
        },
        "name": "Great historical drama",
        "reviewBody": "If you like period dramas this is for you. Like Little House on the Praire this will take you on a journey in the good old days through rough wild territory with a family of 5. This is the story of a married couple with 3 kids in Pennsylvania in the time when people were just arriving in America. The father buys some land in Maine he goes out there with his oldest son to claim it. They work together to quickly put up a cabin. It's interesting to watch them cut down trees with a handsaw & build the cabin all by themselves. The father has to leave the boy of 11 there by himself so he can go get the mom & other 2 kids & bring them back. He leaves the boy the gun & says he'll be back as soon as possible, in about 2 months. But when the family start out to the cabin in Maine the mom & the littlest baby get the fever. They have to stop traveling & rest to get better. The mom gets well enough to travel again & they set out to catch the next ship out. But the captain of the ship won't let them on board with the fever so they are forced to make the trip on foot with 1 horse & a small buggy. The baby ends up dying. The poor boy is back in Maine all alone & has no idea why his family doesn't show up. He keeps track of time by putting notches in stickes. Each notch is a day, each stick is a week. A bad guy comes knocking at the door & he foolishly lets him in & allows him to sleep inside. When the boy wakes up the man has left with his gun. Now he has no way to get any meat to eat. This movie is really good because you get to see what an experience it was to live back in the days when people were just coming to America. And this poor boy is all alone waiting for his family. And the family knows their boy needs them & they're doing the best they can to get to him. There's more adventures with bad guys & the boy runs into indians. I highly recommend this movie if you like this kind of thing. I loved it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0119454/"
}