{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harry Lennix",
            "url": "/name/nm0502015/"
        },
        {
            "@type": "Person",
            "name": "Vanessa Williams",
            "url": "/name/nm0001853/"
        },
        {
            "@type": "Person",
            "name": "Don Allison",
            "url": "/name/nm0021431/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 173,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053559/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0229063/"
        },
        {
            "@type": "Person",
            "name": "Art Washington",
            "url": "/name/nm0913398/"
        }
    ],
    "datePublished": "2002-02-11",
    "description": "New Yorker Adam Clayton Powell Jr. (Harry J. Lennix) becomes a congressman and condemns all forms of segregation and discrimination.",
    "director": [
        {
            "@type": "Person",
            "name": "Doug McHenry",
            "url": "/name/nm0570408/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwMjYwMTMxM15BMl5BanBnXkFtZTcwNjQ2MTMyMQ@@._V1_.jpg",
    "keywords": "politician",
    "name": "Keep the Faith, Baby",
    "original_info": {
        "id": "Keep the Faith_2002",
        "name": "Keep the Faith",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dahotwings"
        },
        "dateCreated": "2002-02-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0251568/"
        },
        "name": "A solid, sympathetic portrait of the controversial Congressman (retitled \"Keep the Faith, Baby\"",
        "reviewBody": "I caught \"Keep the Faith, Baby\" in a preview screening in a college auditorium with comments by Powell's son, New York State Assemblyman Adam Clayton Powell IV, who was one of the film's producers and worked for 10 years to get it made. Not surprisingly, it's a sympathetic portrait of the controversial Congressman who was the nation's foremost black leader during the late 1940s and through the 1950s. Nevertheless, it doesn't flinch from dealing with the tough parts of Powell's career -- his failed marriages, his flamboyant personality, his censure by his fellow Congressmen, who stripped him of his committee chairmanship. They're all there, albeit in soft focus and a favorable light.\n\nTold in flashback from the end of Powell's life (he died in the early 1970s), it holds together well as a dramatized semi-documentary, but sometimes is hard-put to give all the details of his eventful career their due. Harry Lennix seems to be a near-perfect Powell, projecting his charisma, his passion and quite a few of his mannerisms. I'm surprised he's not better known (he has a bit part in \"Collateral Damage\"). The star turn, however, belongs to Vanessa Williams as Powell's glamorous second wife, the jazz singer Hazel Scott. Nitpickers may note that casting for a couple of the historic portrayals, like Lyndon Johnson and Robert F. Kennedy, could have used better impersonators. This won't ever hit the moviehouses (it was made for Showtime), but check it out when it turns up on TV or at Blockbuster. It's well worth your time to get acquainted with this man who was a major figure in the mid-20th century fight for civil rights and social justice, a man who now is mostly forgotten. I saw it with an audience steeped in black history, including several people who had seen and heard Powell when he was alive, and they liked it a lot.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0251568/"
}