{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Heidi Albertsen",
            "url": "/name/nm1144767/"
        },
        {
            "@type": "Person",
            "name": "Roger Bilham",
            "url": "/name/nm1146622/"
        },
        {
            "@type": "Person",
            "name": "Jacob Kyungai",
            "url": "/name/nm1145660/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 179,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0147264/"
        },
        {
            "@type": "Person",
            "name": "Mose Richards",
            "url": "/name/nm0724255/"
        }
    ],
    "datePublished": "2002-03-01",
    "description": "Join a band of trekkers as they journey through rugged terrain and extreme conditions to look out from Africa's highest point in David Breashears' mountain adventure, Kilimanjaro: To the Roof of Africa.",
    "director": [
        {
            "@type": "Person",
            "name": "David Breashears",
            "url": "/name/nm0106451/"
        }
    ],
    "duration": "PT40M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyODk0OTIzMV5BMl5BanBnXkFtZTcwODI2MDkxMQ@@._V1_.jpg",
    "keywords": "imax",
    "name": "Kilimanjaro: To the Roof of Africa",
    "original_info": {
        "id": "Kilimanjaro: To the Roof of Africa: IMAX_2002",
        "name": "Kilimanjaro: To the Roof of Africa: IMAX",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dougemmett"
        },
        "dateCreated": "2002-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0288593/"
        },
        "name": "Kilimanjaro is an exciting Imax with a hint of reality TV...",
        "reviewBody": "Kilimanjaro, the newest David Breashears (Everest) Imax film, documents the journey of 7 individuals, from various backgrounds and ages, as they challenge themselves in hopes of summiting the largest free-standing mountain in the world. The Imax is a little like National Geographic meets Survivor. At first you're awed by the natural beauty of Kilimanjaro and then, slowly, the film weaves in the story of the adventurous group and their expedition, lending a more human aspect to the documentary. The film is beautifully photographed and scored and the editing is top-notch. As the stories unfold, a type of picture-in-picture is used to show the climber speaking (in the foreground) as he or she is hiking in the background, utilizing the giant dome of the Imax theatre. This is an interesting and creative feature that lends a hand to the narration of Kilimanjaro. Overall, this film is very inspiring to the average Joe, delivering the message that although the climb to Kilimanjaro's summit is no picnic, it is however, possible (50% success rate). Kilimanjaro is a great addition to Breashears' already impressive library. -Doug Emmett"
    },
    "url": "/title/tt0288593/"
}