{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Uma Thurman",
            "url": "/name/nm0000235/"
        },
        {
            "@type": "Person",
            "name": "David Carradine",
            "url": "/name/nm0001016/"
        },
        {
            "@type": "Person",
            "name": "Daryl Hannah",
            "url": "/name/nm0000435/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1131920,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019267/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086625/"
        },
        {
            "@type": "Person",
            "name": "Quentin Tarantino",
            "url": "/name/nm0000233/"
        },
        {
            "@type": "Person",
            "name": "Uma Thurman",
            "url": "/name/nm0000235/"
        }
    ],
    "datePublished": "2003-10-10",
    "description": "After awakening from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her.",
    "director": [
        {
            "@type": "Person",
            "name": "Quentin Tarantino",
            "url": "/name/nm0000233/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzM3NDFhYTAtYmU5Mi00NGRmLTljYjgtMDkyODQ4MjNkMGY2XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "revenge,female protagonist,female warrior,original story,female bare feet",
    "name": "Kill Bill: Vol. 1",
    "original_info": {
        "id": "Kill Bill: Vol. 1_2003",
        "name": "Kill Bill: Vol. 1",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Old Joe"
        },
        "dateCreated": "2004-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0266697/"
        },
        "name": "Kill Bill is one of the brashest, boldest and bloodiest movies I have ever seen, so look over your shoulder, because........... 'Here comes the bride, with only one thing on her mind, a roaring rampage of re",
        "reviewBody": "It has been six years since we have seen a movie from one of the world's most talked about directors, Quentin Tarantino, but the wait for me, has been worth the while. Tarantino can now add the martial arts masterpiece 'Kill Bill' to his resume, a film that left me speechless after I had seen it. It certainly is one intense, hateful movie, containing some of the greatest sword fighting sequences ever filmed in a movie. Tarantino has made KB with class, precision and close intense attention to every detail. But, what else should we expect from a movie freak, like Quentin Tarantino?\n\nAn entire wedding party is slaughtered during a dress rehearsal in a rural chapel: the pregnant woman in the blood-splattered wedding dress is Black Mamba, better known as 'The Bride'. The assassin, Bill, and his circle known as 'The Vipers' leave 'TB' for dead, however she was merely comatose. Four years later, 'TB' suddenly awakes from her coma, ferociously focused on one mission, to seek revenge on her former master. One by one, she will kill the various assassins. She is saving Bill for last.\n\nI am not sure where I want to start with my review of Kill Bill. I love parts of it, but then find other parts to be extremely difficult to watch. Quentin Tarantino has written and directed another powerful piece of cinema, in a way that only he could. This time we see more violence, the action and the result of that violence, with it being a bit over-powering in the end. But without the violence, KB would have not been the movie it was.\n\nThis time Tarantino has not focussed on the dialogue in this movie, when it came to writing its script, more he wanted to show what the characters he had created, and why they were in the position they were in. For me I can appreciate both aspects of what Tarantino shows, as he can express himself either visually or with dialogue.\n\nThe other part I like about KB is the way Tarantino dedicated the movie to certain aspects of cinema history. To quote Quentin he said Kill Bill is 'my yakuza movie, my samurai movie, my spaghetti western movie', and it was quite clear for me how passionate Tarantino was in showing these parts. However it was also so much more, with one of the great sections of the movie being presented in Japanese animation. I also believe that there was a clear reference to black and white movies and silent movies, as KB had these sections a few times. I also feel that Tarantino is in some way trying to show his appreciation to Pulp Fiction, the movie that made him successful, via KB. If this is true, I do not feel it is gloating, rather I give Tarantino great praise, because some movie makers ignore the movies that give them success, but not here.\n\nWhile 'KB' has some interesting characters, none are what I would call 'likeable'. 'The Bride', aka Black Mamba (Uma Thurman) is a girl totally driven by the desire to get revenge. Thurman really suits her part well, as she not only looks attractive, but is really believable as this American martial arts tough girl. Helping 'TB' on her quest is Samuri sword expert Hattori Hanzo (Sonny Chiba). This character brings a very oriental feel to the movie, something I liked. The bickering with his assistant was fun to see being played out.\n\n'The Deadly Viper Assassination Squad' are the cruel callous people who inflict horrific harm on 'TB'. Bill (David Carradine) is their leader, a person we only hear and see in hand gestures, which is reminiscent of Marsellus Wallace in Pulp Fiction. Bill still has a very strong presence in the film, even though we never see him. Under Bill are killers like O-Ren Ishii, aka Cottonmouth (Lucy Liu), whose introduction, via the Japanese Animation, was great. Under Cottonmouth is her personal assistant, lawyer and translator, Sofie Fatale (Julie Dreyfus), who was present at the slaughtering of 'TB'. When 'TB' sees Sofie once again, she is pretty bitter about what Sofie let have happen to her. What we hear has happened to Sofie at the hands of 'TB', is truly unbelievable.\n\nAnother of Cottonmouth's women is a little girl, Go Go Yubari (Chiaki Kuriyama), who is more deadly than she looks. Her school girl sound and look is very interesting, while her confrontation with 'TB' highly entertaining. Then there is the evil nurse, Elle Driver, aka Californian Mountain Snake (Daryl Hannah), who shows very little emotion towards 'TB', other than hate. Vernita Green (Vivica A Fox) is another woman that 'TB' has on her hit list. Her demise was highly entertaining to say the least, again reminiscent of Pulp Fiction.\n\nAll the scenes with fighting in KB are a highlight for me, especially the sword fighting, as they are so fun and intense, with the last hour of the movie purely exhausting, with the final showdown between 'TB' and Cottonmouth & co. being terrific. The middle section of film was also great, as it tells the majority of the KB Vol. 1 story, although parts are pretty disturbing.\n\nKill Bill is another film by Quentin Tarantino, where I have to say it was 'exceptionally well made'. There is a scene in Volume 1, which reminded me of 'Matrix Reloaded'. Now I have heard that Tarantino hates the Matrix franchise, and you can see what he is making a stand against, film's laden with SFX. KB is 'not guilty' of being that. The violence is very graphic in KB, but at certain times the violence was 'laughable', as it seemed to look deliberately fake. But perhaps I am wrong? Volume 1 ended at a good point, setting up the conclusion, Volume 2 beautifully. So Kill Bill: Volume 2, get here, A.S.A.P.\n\nCMRS gives 'Kill Bill: Volume 1': 4.5 (Very Good - Brilliant Film)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #1, post",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3102711321",
        "name": "Kill Bill: Vol. 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDFjYTYwNmMtY2YwMi00YmVhLTlhOTItMWE1MmQ2N2MyMDgwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDFjYTYwNmMtY2YwMi00YmVhLTlhOTItMWE1MmQ2N2MyMDgwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:31:19Z",
        "url": "https://www.imdb.com/video/vi3102711321/"
    },
    "url": "/title/tt0266697/"
}