{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christy Carlson Romano",
            "url": "/name/nm0005579/"
        },
        {
            "@type": "Person",
            "name": "Will Friedle",
            "url": "/name/nm0295115/"
        },
        {
            "@type": "Person",
            "name": "Nancy Cartwright",
            "url": "/name/nm0004813/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4701,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030830/"
        },
        {
            "@type": "Person",
            "name": "Bob Schooley",
            "url": "/name/nm0774792/"
        },
        {
            "@type": "Person",
            "name": "Mark McCorkle",
            "url": "/name/nm0566407/"
        }
    ],
    "datePublished": "2005-04-08",
    "description": "Kim's heart is quickly captured by the new boy, Eric, who soon becomes her boyfriend. Unknown to Kim, her best friend and sidekick, Ron has developed stronger feelings toward her.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Loter",
            "url": "/name/nm0521425/"
        }
    ],
    "duration": "PT1H11M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWM2MmQ1MjQtYmUwOS00YzIwLTkzNDUtYjEwMmNmYzYzMDM0XkEyXkFqcGdeQXVyOTM1Njc1ODM@._V1_.jpg",
    "keywords": "2000s,superhero,kim possible character,boy girl relationship,superhero action",
    "name": "Kim Possible: So the Drama",
    "original_info": {
        "id": "Kim Possible Movie: So the Drama_2005",
        "name": "Kim Possible Movie: So the Drama",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ddey65"
        },
        "dateCreated": "2005-04-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0446724/"
        },
        "name": "Everything Kim/Ron Shippers wanted it to be(*POSSIBLE SPOILERS*)",
        "reviewBody": "Even before Season #3, many fans of Kim Possible have been anxiously awaiting the chance for Kim and sidekick Ron Stoppable to go from friends to G-rated teenage lovers, as most shows on The Disney Channel tend to do. But while the promos for this second(not first) animated TV-Movie made it look more dramatic than expected, it's just toned down enough for a Disney movie. And like \"Kim Possible: A Stitch in Time,\" Drakken's evil plot involved the defeat of Kim, along with world conquest.\n\nKim just saved the world from another one of Dr. Drakken's evil plots... or so she thinks. All she really saved was Nakasumi(possibly voiced by Clyde Kusatsu) from a potential kidnapping. Unfortunately, she's the only member of the Middleton Maddog cheerleading squad without a date for the prom, and as far as she's concerned her sidekick's not exactly boyfriend material. Enter a new boy named Eric(voiced by \"Phil of the Future's\" Ricky Ullman), who our Kimmie-cub suddenly has the hots for. As soon as Ron realizes this, he becomes severely jealous of the new boy. Since this is television, Ron's suspicions about Kim's new beau turn out to be right on the money, because Eric's got a dirty little secret... no he's not a junkie or a closet homosexual, but let's just say he's fake and evil. Meanwhile, Drakken acquires Ron's favorite restaurant chain Bueno Nacho and does away with Naco night, replacing it with a toy in a kiddie meal that every kid wants... the very type of toy Kim was used in to market McDonald's Happy Meals in real life two or three years earlier. Ah, but what nobody realizes until it's too late is that these toys are rigged with super cyber-technology developed by Kim's dad, and stolen by Drakken to be used for(you guessed it) world conquest. As expected from most series-based movies, it has additional CGI-animation to distinguish it from the existing series, but the CGI is a little more impressive than in \"A Stitch in Time,\" even if it's more noticeable than in the first movie. The fight sequences are far more violent than the existing series, and it's a good thing it's just a cartoon, because in some of the fights, the cast would've actually been killed. Still, the idea that Eric would be evil is too much of a cliché for me. I would've liked it better if Eric had been a nephew of Drakken reluctantly being misused for an evil plot against Kim, having to fight both of them off, all the while explaining to Kim that he's nothing like his mad uncle, and then broke up with her over her lifestyle and association with Ron. Now *that's* drama. Then again, perhaps that's stepping too far into Aaron Spelling territory. Another thing it has is a great deal of background music -- so much so that when the closing theme \"Could it Be,\" by Christy Carlson Romano, was released in the fall of 2004, one would have the mistaken impression this was going to be a musical, like the EVEN STEVENS episode \"Influenza: The Musical.\" I've got a feeling she might've also secretly provided the voice of the lounge singer who sang \"Someone for Me,\" at a resort owned by Big Daddy Brotherson, who appeared in the episode \"Number One.\" Okay, so the movie is predictable, but it has a few surprises here and there.\n\nThis movie was intended to be the final episode, but sadly Disney scrambled the last eleven or twelve episodes out of the order that Mark McCorkle, Bob Schooley, and Steve Loter wanted. As a result, we saw new episodes taking place AFTER \"So the Drama\" aired. Compare this to MTV, who while offering only half of a sixth season to Glenn Eichler for DARIA, forcing him to truncate the show with five, at least allowed him to use his story arc as he intended. On the other hand, while the DVD of IICY? was edited severely, the upcoming one of StD will be extended. Doesn't seem fair in either case, but for adventure, laughs and a little bit of drama, this movie might be for you.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #1 Post",
        "duration": "PT56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1574895897",
        "name": "Kim Possible: So the Drama",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzY3NzU3MWQtYzJiZS00MDBiLTljYTgtYjY0M2U5ZjY0MmRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzY3NzU3MWQtYzJiZS00MDBiLTljYTgtYjY0M2U5ZjY0MmRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-08-04T03:27:41Z",
        "url": "https://www.imdb.com/video/vi1574895897/"
    },
    "url": "/title/tt0446724/"
}