{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dennis Price",
            "url": "/name/nm0696866/"
        },
        {
            "@type": "Person",
            "name": "Alec Guinness",
            "url": "/name/nm0000027/"
        },
        {
            "@type": "Person",
            "name": "Valerie Hobson",
            "url": "/name/nm0387753/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 38294,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040024/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0179865/"
        },
        {
            "@type": "Person",
            "name": "Roy Horniman",
            "url": "/name/nm0395170/"
        },
        {
            "@type": "Person",
            "name": "Robert Hamer",
            "url": "/name/nm0357607/"
        },
        {
            "@type": "Person",
            "name": "John Dighton",
            "url": "/name/nm0226538/"
        }
    ],
    "datePublished": "1950-06-14",
    "description": "A distant poor relative of the Duke D'Ascoyne plots to inherit the title by murdering the eight other heirs who stand ahead of him in the line of succession.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Hamer",
            "url": "/name/nm0357607/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjc1Yzc0ZmItMzU1OS00OWVlLThmYTctMWNlYmFlMjkxMzc0XkEyXkFqcGdeQXVyNTA1NjYyMDk@._V1_.jpg",
    "keywords": "actor playing multiple roles,great britain,prison,murder,jealousy",
    "name": "Kind Hearts and Coronets",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmOtaku"
        },
        "dateCreated": "2005-08-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041546/"
        },
        "name": "Wickedly clever",
        "reviewBody": "Robert Hamer's 1949 film \"Kind Hearts & Coronets\" is the epitome of British humor, from start to finish. Louis Mazzini (Price) is a descendant of the D'Ascoyne family, a family of royals, but unfortunately his mother has been disowned by the family for taking up with and marrying Louis Mazzini Sr., an Italian singer whom the family highly disapproves of. When Mazzini Sr. meets an untimely death early in young Louis' life, he sees his mother struggle to give him everything he needs, so after she dies, he vows revenge. He decides that he will get his birthright and become the Duke of Chalfont, except he has to get through the eight people ahead of him (all members of the D'Ascoyne family are played by Alec Guinness) who are in line for the title. Meanwhile, while he is calculating how he is going to commit cold-blooded murder to knock off each heir, he carries on a sort of double affair with Sibella (Greenwood), a woman who he has been enamored with since they were children and is now married to a former classmate of theirs, and Edith (Hobson), the young widow of one of the D'Ascoyne heirs that Louis offs. The story is told in flashbacks as Louis sits in a jail cell, awaiting his execution and writing his memoirs.\n\nThis was one of the most clever and wickedly funny films I had seen in a long time. I honestly had no idea what to expect from it when I started watching; I only knew that it was an IMDb Top 250 film and it starred Alec Guinness. I didn't have a clue that it was going to turn out to be one of the greatest examples of British comedy I've seen this side of Monty Python. The gags in the film are so dry and subtle (at one point, Louis causes an explosion that means the demise of one of the D'Ascoyne heirs, yet when it goes off while he and the heir's wife are sitting in the garden having tea, neither of them even flinch, and she doesn't notice something is wrong until she actually turns around and sees the plumes of black smoke) and the theme so dark that it could theoretically be easy to forget that one is actually watching a comedy. There are no sight gags, double takes or high hilarity present, which makes this film all the more appealing, because it elicited huge laughs without stooping to typical elements of comedy.\n\nI thought that Guinness was going to be the breakout guy in \"Kind Hearts and Coronets\", and believe me, it's certainly noteworthy to see him dressed in drag as Lady Agatha, but the real star of the film was the fantastic Dennis Price. He plays Louis with the slick charm of a Rex Harrison, but it is clear that his heart and temperament is far more nefarious than anything Harrison could drum up, even when he was plotting to kill his wife in \"Unfaithfully Yours\". When he utters lines like \"The next morning I went out shooting with Ethelred - or rather, to watch Ethelred shooting; for my principles will not allow me to take a direct part in blood sports\" when he has not only already killed several, but is planning on killing Ethelred himself, his aplomb yet sincere delivery is comic gold.\n\nI really enjoyed \"Kind Hearts and Coronets\" and sincerely hope that even though it seems to be slipping more and more to the bottom of the IMDb Top 250 list after an initial strong appearance, its placement on the list will make more people seek it out. Frankly, I had never heard of the film before seeing it appear on the list, and I consider myself to be fairly adequate in my knowledge of classic film. And you'd be hard pressed to find a better classic film comedy than this one; it is ahead of its time in its clever wickedness. I would be willing to bet the Coen Brothers are fans of this film. 8/10 --Shelly",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Anchor Bay Entertainment",
        "duration": "PT2M57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi93389081",
        "name": "Kind Hearts and Coronets",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTAwZTYyYjAtODdiOS00NWI3LWI1YmQtZmE1ODZmZGY5YjBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTAwZTYyYjAtODdiOS00NWI3LWI1YmQtZmE1ODZmZGY5YjBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:42:41Z",
        "url": "https://www.imdb.com/video/vi93389081/"
    },
    "url": "/title/tt0041546/"
}