{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alan Bates",
            "url": "/name/nm0000869/"
        },
        {
            "@type": "Person",
            "name": "Geneviève Bujold",
            "url": "/name/nm0000991/"
        },
        {
            "@type": "Person",
            "name": "Pierre Brasseur",
            "url": "/name/nm0105482/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4174,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "King of Hearts",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029934/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026336/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014311/"
        },
        {
            "@type": "Person",
            "name": "Daniel Boulanger",
            "url": "/name/nm0099429/"
        },
        {
            "@type": "Person",
            "name": "Maurice Bessy",
            "url": "/name/nm0078883/"
        }
    ],
    "datePublished": "1967-06-19",
    "description": "During World War I, a British private, sent ahead to a French town to scout for enemy presence, is mistaken for a King by the colorful patients of an insane asylum.",
    "director": [
        {
            "@type": "Person",
            "name": "Philippe de Broca",
            "url": "/name/nm0003606/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTM4OTk1NTAyN15BMl5BanBnXkFtZTcwMjU2NjE2NA@@._V1_.jpg",
    "keywords": "france,password,general,brothel,prostitute",
    "name": "Le roi de coeur",
    "original_info": {
        "id": "King of Hearts_1967",
        "name": "King of Hearts",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmFlaneur"
        },
        "dateCreated": "2001-09-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060908/"
        },
        "name": "Cult film which needs to be seen more",
        "reviewBody": "De Broca's delightful and surreal anti-war fantasy quickly attained a cult status when it was first released, but in recent years it has dropped more and more out of sight. A shame, because it is a charming film, the whimsical, romantic nature of which is entirely French. Even though the underlying message, that of preferring one kind of insanity to another is a simple, absurdist one, the viewer is still carried along by the Gaullic charm of it all.\n\nAs the much-put-upon martial ornithologist, It's not just because Bates is the only English member of the cast that one is aware of some awkwardness in his casting. For English cinema goers in particular, familiar with his career, his usual jocular masculinity is hard to reconcile with an child-like character, swept along by events. Those who remember Bates and Oliver Reed wrestling nude in 'Women in Love' (1962) from the same period, or his cocky Vic in 'A Kind of Loving' (1962), may bulk at Bates portraying such a confused innocent. Having said that, Bates' actual performance is balanced and restrained, all of a piece with the rest of the cast.\n\n'King of Hearts' is primarily an ensemble piece. Many of the film's most delightful moments spring from the fancy-filled and flirtatious lunatics who quickly fill the streets, shops and occupations left by the fleeing villagers, their interaction with each other, and Plumpick. This world of fantasy is curtailed by the village walls, which physically as well as mentally encircle their environment. Outside is reality (no matter how ludicrously it is presented), conflict, death. Inside the walls is harmony of sorts, life celebrated. This distinction between outside and inside is made clear in the film. As soon as Plumpick attempts to ride a horse back into the real world for help, the music and the mass accompaniment of him by the inmates has to end until he is obliged to return.\n\nAs the 'King of Hearts' Plumpick is at the center of his motley 'people', as well as of Coquelicot's (Geneviève Bujold) affections. Once he awards himself his name, in a panic and on the run, his 'subjects' call out for him. He is promptly 'crowned' (both by banging his head, inducing his initial confusion, and though acquiring his 'kingship'). He is awarded a bride, and accepted as an unique traveller into the society of the amiably mad. Their acceptance of him anticipates the final scene of the film, when a chastened Plumpick re-admits himself into their company, having rejected the larger insanity of warfare.\n\nIt's fitting in a way that the least successful parts of the film lay outside of the village, where comic stereotypes replace whimsy and the comedy is drawn with much broader strokes. In particular Colonel MacBibenbrook (Adolfo Celi, better known as Emil Largo in 'Thunderball') is uncomfortably close to parody, and his part would have been much better cast with an actor like Trevor Howard who could excel with a line in ironic bombast. The Germans fare no better and, although amusing and lightweight in their capers, one misses the delicacy with which the lunatics are portrayed. One suspects that De Broca associates more with the geniality of the insane, as we all do given the options, and this sympathy is reflected on screen\n\nTellingly, the lunatics are not completely oblivious to the hostile world which surrounds them, although they are content to ignore the immediate threat of destruction and Plumpick's warnings. At the end of the film, once the opposing forces have symbolically destroyed themselves, Marcel says:'I'm tired of this game, let's go back to our rooms'. With deliberate sadness, they divest themselves of their play robes and return to their asylum, a divestment scene at the same time quiet, serious and eminently sane. It is clear that they are mad - but not crazy."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "During World War I, a British private, sent ahead to a French town to scout for enemy presence, is mistaken for a King by the colorful patients of an insane asylum.",
        "duration": "PT1M57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2838479641",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDliNTY2NDctMGQ3YS00NTg1LThlMzAtNDE0MTdmMjc2MzY3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDliNTY2NDctMGQ3YS00NTg1LThlMzAtNDE0MTdmMjc2MzY3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-19T21:20:59.737Z",
        "url": "https://www.imdb.com/video/vi2838479641/"
    },
    "url": "/title/tt0060908/"
}