{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Saif Al-Warith",
            "url": "/name/nm3749668/"
        },
        {
            "@type": "Person",
            "name": "Waj Ali",
            "url": "/name/nm5400084/"
        },
        {
            "@type": "Person",
            "name": "Nathan Ampofo",
            "url": "/name/nm3835240/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 165,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "alternateName": "King Lear",
    "creator": [
        {
            "@type": "Person",
            "name": "William Shakespeare",
            "url": "/name/nm0000636/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey of Monmouth",
            "url": "/name/nm8077276/"
        }
    ],
    "datePublished": "2014-05-18",
    "description": "An aging King invites disaster when he abdicates to his corrupt, toadying daughters and rejects his one loving, but honest one.",
    "director": [
        {
            "@type": "Person",
            "name": "Sam Mendes",
            "url": "/name/nm0005222/"
        },
        {
            "@type": "Person",
            "name": "Robin Lough",
            "url": "/name/nm0521730/"
        }
    ],
    "duration": "PT3H30M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWM0MDkwYjgtOWYxYy00MzBkLWE0MzktYWI4YmIyOWQ5OTRkXkEyXkFqcGdeQXVyMjI2NzcyODc@._V1_.jpg",
    "keywords": "king lear character,live performance,shakespeare's king lear,actor recreates his stage role,actress recreates her stage role",
    "name": "National Theatre Live: King Lear",
    "original_info": {
        "id": "King Lear (Masterpiece Theatre)_1998",
        "name": "King Lear (Masterpiece Theatre)",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ArminCallo-PalmSprings"
        },
        "dateCreated": "2014-05-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3704248/"
        },
        "name": "KING LEAR - National Theatre Live",
        "reviewBody": "SAM MENDES & SIMON RUSSELL BEALE TEAM UP TO DELIVER SPINE-CHILLING KING LEAR FOR NATIONAL THEATER LIVE By Armin Callo, InFlux Magazine Arts & Theater Contributing Editor\n\nThe partnership of actor Simon Russell Beale, described by The Independent as \"the greatest stage actor of his generation\", and theater and film director Sam Mendes, Cabaret; American Beauty; Road To Perdition; Skyfall, go back some 25 years. For 2014, they reunite to deliver a chillingly-memorable KING LEAR at the Olivier Theatre for National Theater Live.\n\nTo bring a fresh perspective to this new production, both actor and director mill both military history and medical science. The setting of this LEAR is modern yet nondescript. England is a totalitarian state, run by a tyrannical Lear, supported by numerous supernumeraries all dressed in militaristic gray flannel. \n\nAs the play opens, Lear's premature decision to divide his kingdom among his three daughters -- subject to a self-serving insistence to pit one daughter against the other in their prophesied love for their father – becomes a high-state occasion, complete with UN-like dais and microphones. Under Mendes' daring direction, intimate occasions like this take on the mantle of a public address. And as such, this production triumphantly magnifies the tragedy so inherent in LEAR, considered Shakespeare's most successful tragedy.\n\nYes, die-hard Shakespeare enthusiast will take issue with a number of this production's bold deviations. Nonetheless, these bold choices are effective and bring fresh points of view to this often-staged play. I, for one, applaud Mendes's brilliance in showing Lear graphically and violently kill The Fool on stage under his fit of madness. After all, Shakespeare's text simply stops the mention of The Fool after Lear succumbs to madness, implicitly reminding us that the voice of wisdom and reason, as personified by The Fool, is now useless and irrelevant after Lear's descent into madness.\n\nIn Lear's bellicose England, Mendes initially shows a highly-controlled militaristic state. Lear is clearly in control, holding a tight grip on both state and family. After his folly of renouncing his crown and dividing England equally between Goneril and Regan, or more accurately in this production between Albany and Cornwall, the country of England falls to ruin and chaos. And now, madness ensues, not only for Lear but also for the English state. Salvation is now only possible from outside England, specifically from France and the exiled Cordelia. \n\nSimon Russell Beale is brilliant as Lear. His transformation from bullish dictatorial King to roaming madman -- and eventually to sensitive father seeking reconciliation -- is both polished and raw. Ranting his kingdom away to his two elder daughters, Lear's behavior is so bombastic and repulsive that you can almost understand why Kate Fleetwood's Goneril and Anna Maxwell Martin's Regan have lost patience with him. His insanity is often harrowing to watch. Then, when all is lost and surrender inevitable, Russell Beale mines the sensitivity of the soul. Delicate, fragile, and oh so moving. In his final scenes, dressed only in a hospital gown and eventually coming to his senses before the devastating death of Cordelia (played by a deeply moving Olivia Vinall), Russell Beale is at his best. The acting is beautifully achieved. He delivers Lear's heart-rending speeches (\"let me not be mad\") with heart and soul. And his physical acting is so pointed, so studied, complete with facial grimace and finger twitches, that we can see the pay-off from his study of dementia from his nephew in medical school.\n\nThe supporting cast is equally fine. Standouts include Stephen Boxer as The Earl of Gloucester; Kate Fleetwood as Goneril; Anna Maxwell Martin as Regan; Olivia Vinall as Cordelia; Sam Troughton as Edmund; and Adrian Scarborough as The Fool. All stellar examples of why no one does Shakespeare like the British.\n\nAt 3 ½ hours in length, KING LEAR is always a challenge. However, this production dazzles and zips through at a speedy rate. Anthony Ward's production design speeds the evening along, moving from stripped-down contextual sets to a most-effective use of a stage revolve marked with a symbolic cross. Yes, X marks the spot. The spot for a most engaging evening of classical theater. Not to be missed. \n\nCheck the website of National Theater Live for details about US showings and for a cinema broadcast near you.\n\nArmin's Grade: A+"
    },
    "trailer": {
        "@type": "VideoObject",
        "duration": "PT1M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4159226137",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWMxN2U3Y2QtMDYzNi00MmRmLWE1ZGQtNzY0YmJiZDk4OWVmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWMxN2U3Y2QtMDYzNi00MmRmLWE1ZGQtNzY0YmJiZDk4OWVmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-25T22:19:15.467Z",
        "url": "https://www.imdb.com/video/vi4159226137/"
    },
    "url": "/title/tt3704248/"
}