{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frank Sinatra",
            "url": "/name/nm0000069/"
        },
        {
            "@type": "Person",
            "name": "Tony Curtis",
            "url": "/name/nm0000348/"
        },
        {
            "@type": "Person",
            "name": "Natalie Wood",
            "url": "/name/nm0000081/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1686,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0139578/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0868220/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009940/"
        },
        {
            "@type": "Person",
            "name": "Joe David Brown",
            "url": "/name/nm0113872/"
        },
        {
            "@type": "Person",
            "name": "Merle Miller",
            "url": "/name/nm0588959/"
        }
    ],
    "datePublished": "1958-06-28",
    "description": "Toward the end of World War II, two American soldiers fighting in Southern France become romantically involved with a young, American woman. Her background will reveal more about them than her.",
    "director": [
        {
            "@type": "Person",
            "name": "Delmer Daves",
            "url": "/name/nm0202681/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Action",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUzNTQ1NzEwM15BMl5BanBnXkFtZTcwMDYzNzA2NA@@._V1_.jpg",
    "keywords": "bare chested male,male in a shower,homosexual subtext,scene during opening credits,two men in love with the same woman",
    "name": "Kings Go Forth",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2006-10-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051819/"
        },
        "name": "The Great Champagne Offensive",
        "reviewBody": "Kings Go Forth is one of, maybe the only, film about the Allied offensive in Southern France in late summer of 1944. Several divisions who were fighting in Italy under Mark Clark were sent to invade France from the south. The action as compared to the larger shows movie east from Normandy and north up the Italian peninsula was light as the Germans were retreating to protect their own borders. It was called the champagne offensive because it was as you see it with Frank Sinatra and Tony Curtis, fighting one minute, and on a weekend pass the next.\n\nFrank Sinatra narrates the story with him as one of the protagonists. He's an army lieutenant and he's just gotten some replacements for his company, one of them being Tony Curtis. Curtis is a spoiled rich kid, a real smooth operator. But he turns out to be a good soldier and he and Sinatra become friends despite Sinatra being an officer and Curtis non-com. \n\nThen the two of them get interested in the same girl, Natalie Wood. She's an American expatriate living with her widowed mother, Leora Dana. Her father was a black man and they left the United States many years before to escape ruling prejudices. Ironic that they escape to France and then France gets occupied by the real prejudice merchants.\n\nThe film is divided equally, half of it concerning the war and half of it dealing with the romantic triangle. For the second time in his career, the first being in Sweet Smell of Success, Tony Curtis plays a heel and does it well. Curtis was really coming into his own as a player and not just a pretty face. Kings Go Forth was filmed on the heels of his Oscar nominated performance in The Defiant Ones.\n\nFrank Sinatra gives one of his best screen performances in Kings Go Forth. None of the hipster slang, not the nebbish of his forties musicals, Sinatra plays a really good man trying to deal with his own inner conflicts about what he's been brought up to believe and the feelings he has for Wood. It's something different and Sinatra does it well.\n\nNatalie Wood was as beautiful as they come and Leora Dana as her mother who's seen too much of the world and is determined to protect her daughter has some of her best screen moments. Tony Curtis liked working with Natalie Wood very much in the films they made together, but he does mention in his autobiography it would have really been great if someone like Dorothy Dandridge had been cast in her role. It might have made Kings Go Forth better remembered today, as much as classic as Guess Who's Coming To Dinner.\n\nElmer Bernstein did the film score and one of the themes was given a lyric by Sammy Cahn and became the song Monique after Natalie Wood's character. Frank Sinatra made a hit record of it though it is only heard instrumentally in the film. It's one of his loveliest ballads.\n\nViewers should see the film before hearing Sinatra's record of it. The whole premise of the film is the plain Sinatra and the smooth Curtis competing for Wood. You hear old Blue Eyes sing Monique and you'll find it hard to believe why he didn't just sing that song. \n\nWhy Natalie would have melted right away in his arms.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Toward the end of World War II, two American soldiers fighting in Southern France become romantically involved with a young, American woman. Her background will reveal more about them than her.",
        "duration": "PT3M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3418275865",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDU3OGM2ODktOWE2NS00YjZhLTg3NzAtNTJhZjQwOTQxMzIzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDU3OGM2ODktOWE2NS00YjZhLTg3NzAtNTJhZjQwOTQxMzIzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-03-03T13:24:14.057Z",
        "url": "https://www.imdb.com/video/vi3418275865/"
    },
    "url": "/title/tt0051819/"
}