{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Yancey Arias",
            "url": "/name/nm0034733/"
        },
        {
            "@type": "Person",
            "name": "Brian Benben",
            "url": "/name/nm0000903/"
        },
        {
            "@type": "Person",
            "name": "Bobby Cannavale",
            "url": "/name/nm0134072/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1165,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001322/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036483/"
        },
        {
            "@type": "Person",
            "name": "David Mills",
            "url": "/name/nm0589957/"
        }
    ],
    "datePublished": "2003-02-02",
    "description": "A drug cartel leader and his family try to keep what is \"rightfully\" theirs.",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU2OTUxMjgwOV5BMl5BanBnXkFtZTcwMjA3MjUyMQ@@._V1_.jpg",
    "keywords": "husband wife relationship,drug cartel,drug trafficking,brother brother relationship,drug enforcement",
    "name": "Kingpin",
    "original_info": {
        "id": "Kingpin_2003",
        "name": "Kingpin",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Astraether"
        },
        "dateCreated": "2004-02-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0324865/"
        },
        "name": "An Excellent Series, but Where's the Rest?",
        "reviewBody": "As a fan of \"The Sopranos,\" I was perhaps a little reluctant to watch \"Kingpin,\" since I felt that nothing could really surpass \"The Sopranos\" in my affections. Nonetheless, a friend had bought me the miniseries DVD for my birthday, so with no other excuse at hand, I watched it.\n\nAnd I loved it. There are only six episodes, each an hour long, but it took me only 'til about the second before I was hooked. The acting is excellent, and I'm left wondering why I haven't heard of or seen these actors before. Each character was sympathetic and interesting; even the ones you're probably \"supposed\" to hate, and it was difficult deciding who exactly to root for. I especially liked the relationship between Miguel and his brother, Chato -- one of trust and closeness instead of the deceit and backstabbing that's all too common in shows along the same lines.\n\nAgent Flores and Miguel's wife, Marlene, were also both very appealing, as strong, independent female characters who have their own complexities and motivations, rather than being overshadowed by the male characters. And I can't forget the particularly comic relationship between the doctor played by Benben, and his \"thug\" friend, Junie. The show provided a number of unexpected and unique twists on an old theme.\n\nUnfortunately, for whatever reason, the show never took off. Maybe it was too expensive to produce, maybe it didn't get enough support from NBC, or maybe (and I hope this isn't the case), it slipped because it was not a predominantly white cast; most of the characters were Hispanic/Latino. That seems a particular shame, if it is the reason \"Kingpin\" never succeeded, since its cast was truly talented and I would have liked to see some of those actors get a definite career boost.\n\nStill, at least it's available to rent, and I highly recommend giving it a shot. Even if you're a hardcore \"Sopranos\" lover, like I am, don't let the comparison deter you! They're similar in that they're about criminal families, but they each have a very different feel and flavor, and you'll only be robbing yourself of something new to enjoy.\n\nI just wish there were /more/ of it to enjoy!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Kingpin",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4202806297",
        "name": "Kingpin",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmE4MmNiZjctMGRmNS00ZTUxLTk1MGYtMGI3ZDQ4ZjM0OWMzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmE4MmNiZjctMGRmNS00ZTUxLTk1MGYtMGI3ZDQ4ZjM0OWMzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-22T21:31:16.960Z",
        "url": "https://www.imdb.com/video/vi4202806297/"
    },
    "url": "/title/tt0324865/"
}