{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Shatner",
            "url": "/name/nm0000638/"
        },
        {
            "@type": "Person",
            "name": "Tiffany Bolling",
            "url": "/name/nm0093147/"
        },
        {
            "@type": "Person",
            "name": "Woody Strode",
            "url": "/name/nm0834754/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5534,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0645282/"
        },
        {
            "@type": "Person",
            "name": "Richard Robinson",
            "url": "/name/nm0733015/"
        },
        {
            "@type": "Person",
            "name": "Alan Caillou",
            "url": "/name/nm0128845/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey M. Sneller",
            "url": "/name/nm0811072/"
        }
    ],
    "description": "In rural Arizona, countless killer tarantulas are migrating through a farm town, killing every living thing in their path. The town's veterinarian will do everything in his power to survive the onslaught.",
    "director": [
        {
            "@type": "Person",
            "name": "John 'Bud' Cardos",
            "url": "/name/nm0004616/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmY4Yjk4M2MtMTUyYi00YWNmLTkxNmMtY2M3N2Y2NzU2MGM4XkEyXkFqcGdeQXVyNjUwMzI2NzU@._V1_.jpg",
    "keywords": "arizona,aviation,tragic event,murder of a woman,woman wears eyeglasses",
    "name": "Kingdom of the Spiders",
    "original_info": {
        "id": "Kingdom of the Spiders_1977",
        "name": "Kingdom of the Spiders",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thesar-2"
        },
        "dateCreated": "2009-11-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0076271/"
        },
        "name": "Spiders, Man!",
        "reviewBody": "When I was a kid, I remember vividly seeing all of the movie Kingdom of the Spiders, but to date, I only remember certain scenes. Also, I remember as a whole, it freaked me completely out.\n\nSure, I had and still have arachnophobia, so since most horror movies, especially the haunted house/ghost stories of late, don't scare me, I'll always turn to these (Eight Legged Freaks, for example) no matter how preposterous just to get a little (or a lot) frightened. The producers/writers/directors aren't stupid; they know what audience (ME) would be freaked out.\n\nYes, Kingdom of the Spiders is an absolute B-movie, but honestly, it wasn't all that bad. Of course we're given the typical corny explanation: insecticides have killed off all of the tarantulas normal meals, so they've mutated, tolerated each other (which apparently, they're quite anti-social) and now are moving on to larger prey. To me, a non-scientist/biologist/spider-doctor, that doesn't really make much sense: all prey is gone, so the population multiples a thousand fold? Get past that, and the fairly slow opening hour with Shatner doing his typical womanizing and you're in for a treat. I can see what scared me as a kid, when they finally revealed the little killers in masses.\n\nPicture it: Camp Verde, AZ. Small (in this movie pintsize) western town. A prize cow dies somehow and owner is worried just about being \"quarantined\" by the town's vet doctor, Shatner. In comes a potential love interest all the way from Tempe (in reality, it would take probably 2-3 hours max to make the trip, but they make it seem like it's a trek (yeah, I had to toss a Shatner-term in) from NYC.) She's concerned about the 5x lethal venom from spiders.\n\nThrow in some anti-pesticide speeches, and more animals die. I guess the tarantulas were too timid for humans, or they simply ran out of animals as they started with the livestock/pets first. Soon, the people are attacked and like all of the \"When-Animals-Attack\" films, a group of diverse survivors hold up in a cabin to wait out the onslaught.\n\nNow, I've been to Camp Verde, not in 1977, per se. I actually arrived in AZ in 1981, but nevertheless, I've visited it, and it didn't look anything like the movie's version. In fact, I recall, in the early 80s that they had actual working phones, not 1920 phone props. Nevertheless, this obvious Jaws/The Birds-rip-off does have its effectiveness. And a seriously disturbing, open-ended finale. I loved the final shot.\n\nNot for everyone, Kingdom of the Spiders is still recommended for those wanting a B-Movie scare out of those eight legged freaks. In reality, it's a helluva lot better than most spider-ambush movies made since.\n\n(Side Note: I love the Stolen-Star Wars poster's tagline above a tortured man with a torch: \"A Wild Science Fiction Nightmare.\" Let's dissect all that. It doesn't take place in space, nor is there any real war (the humans were no match for the tarantulas.) No one had a torch, though someone seriously tries to get away by shooting a gun. It's never really wild – if you see the town, the wildest thing that could happen some actually driving from Colorado for their annual fair. Science Fiction? OK, that one is where someone should draw the line and actually sue for false advertising, though George Lucas probably was prepped for the look of the poster. And finally, nightmare. OK, that one I would agree. You get even one of the 50,000 tarantulas used on meFreddy would have enough ammo for my next three nightmares.)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Kingdom of the Spiders",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1645195545",
        "name": "Kingdom of the Spiders",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTViNmFiZTMtYWI1YS00YjUwLWE4MjMtZTcyNmVjZDE1ODNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTViNmFiZTMtYWI1YS00YjUwLWE4MjMtZTcyNmVjZDE1ODNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-04-10T04:35:19Z",
        "url": "https://www.imdb.com/video/vi1645195545/"
    },
    "url": "/title/tt0076271/"
}