{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Olga Yukina",
            "url": "/name/nm0950827/"
        },
        {
            "@type": "Person",
            "name": "Tatyana Yukina",
            "url": "/name/nm0950828/"
        },
        {
            "@type": "Person",
            "name": "Tatyana Barysheva",
            "url": "/name/nm0054718/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1396,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Kingdom of Crooked Mirrors",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0114114/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0533670/"
        },
        {
            "@type": "Person",
            "name": "Lev Arkadyev",
            "url": "/name/nm0035026/"
        },
        {
            "@type": "Person",
            "name": "Vitali Gubarev",
            "url": "/name/nm0345518/"
        }
    ],
    "datePublished": "1963-08-28",
    "description": "Olya and Yalo save the people of the looking glass from lies.",
    "director": [
        {
            "@type": "Person",
            "name": "Aleksandr Rou",
            "url": "/name/nm0745498/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmNlMTMwNDktOGNmMy00OTI1LTkzYmQtZTI3MzJkZjA3NzdjXkEyXkFqcGdeQXVyMzY1MzQyOTY@._V1_.jpg",
    "keywords": "mirror world,twin,fairy tale,russia,mirror",
    "name": "Korolevstvo krivykh zerkal",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "levelclearer"
        },
        "dateCreated": "2016-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0145033/"
        },
        "name": "What happens exactly when you crack a can of grandma's jam.",
        "reviewBody": "Well, I watched this movie many times so I think I can better explain what it is all about. Olya the girl in the beginning of the movie features her personal weaknesses, or bad habits, or let's call it sins. She is craving for grandma's jam so much, that she discards grandma's word no to touch the jam, and breaks the can as she tries to eat some. Also Olya is recreant, lazy, irresponsible, sweet-tooth to the extent of forgetting about more important things. In other words Olya features a number of bad habits typical for children of her age. And through possession of these bad habits she becomes attracted to the fairy-tale surreal world of \"Kingdom of crooked mirrors\" which in fact is some kind of anti-world where all inhabitants bear reversed names to be read backwards to understand the true nature of the character. The kingdom is ruled by bizarre and evil characters featuring different animals like Parrot, Adder, Falcon, Toad (all shall be read backwards), and in fact represent a fake and gullish monarch Parrot, and three ruthless, cunning and power loathing tycoons: Toad, Adder and Falcon, who really rule the Kingdom. Played by people dressed and made up accordingly. In order to cement their power over the Kingdom they lean upon what probably should be described as total and systematic lying, or people's mass misinformation, by producing and disseminating only crooked mirrors. For this end they arrested the mirror-maker Friend who refused to produce crooked mirrors. So the CMK world represents where do Olya's weaknesses or bad habits would finally take her if not eradicated timely and properly. During her trip in the Kingdom Olya is accompanied by her mirror twin Yalio, who has no bad habits, but acts accordingly to her age. The main goal is to free the mirror-maker Friend from the Death Tower, which means the end of the Kingdom of Crooked mirrors. Olya has to overcome her own weaknesses and bad habits on her way to the goal, otherwise the ruling of Adder, Falcon, and Toad will never end. It is important to understand that in the USSR production of movies was controlled by Art councils, so the final product is kinda a balance between the movie director and Art council, therefore something resembling propaganda can sometimes be expected. But if you understand the entire story and the plot, you will see that Kingdom is a materialization of one's bad habits taken to the logical absolute to show to kids how important is to take an active and firm position in life and to stick to the truth, that in adult life you will have to take an active position, you will have to distinguish your friends from enemies, and you will have to act accordingly. Well, from the point of view of Adder, Falcon, and Toad this must be a very dangerous propaganda.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0145033/"
}