{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liam Neeson",
            "url": "/name/nm0000553/"
        },
        {
            "@type": "Person",
            "name": "Laura Linney",
            "url": "/name/nm0001473/"
        },
        {
            "@type": "Person",
            "name": "Chris O'Donnell",
            "url": "/name/nm0000563/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49968,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028932/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102795/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107069/"
        },
        {
            "@type": "Person",
            "name": "Bill Condon",
            "url": "/name/nm0174374/"
        }
    ],
    "datePublished": "2005-01-07",
    "description": "A look at the life of Alfred Kinsey, a pioneer in the area of human sexuality research, whose 1948 publication \"Sexual Behavior in the Human Male\" was one of the first recorded works that saw science address sexual behavior.",
    "director": [
        {
            "@type": "Person",
            "name": "Bill Condon",
            "url": "/name/nm0174374/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA0MjA1MjA4MDNeQTJeQWpwZ15BbWU3MDQxMDQ2MjE@._V1_.jpg",
    "keywords": "sexuality,character name as title,surname as title,lgbt plus,male full frontal nudity",
    "name": "Kinsey",
    "original_info": {
        "id": "Kinsey_2004",
        "name": "Kinsey",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "seaview1"
        },
        "dateCreated": "2004-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0362269/"
        },
        "name": "Kinsey enlightens a controversial subject",
        "reviewBody": "Writer/Director Bill Condon does a thoroughly detailed, fascinating study of the life of famed sex researcher Alfred Kinsey in the drama, Kinsey. What would on surface seem unfilmable is done with great sensitivity and honesty.\n\nCondon knows how to tell stories about real people (Gods and Monsters), and here is a life filled with curiosity and far reaching accomplishment.\n\nRaised in a repressed family dominated by a stern father, Kinsey is portrayed as an isolated teen who rebels against not only his father, but against sexual convention. As a science instructor in college, he meets a student who becomes his wife. As other students look more and more to him for sexual advice, his original interest in insect studies changes to sex adviser and ultimately sex researcher. His team of assistants and even their wives become involved in the research. As Kinsey's study requires sample interviews across the country, a diverse, amazing discovery of sexual habits and statistics are revealed. The study ultimately becomes published in a groundbreaking best seller amid a swell of damnation from the public.\n\nCondon interweaves the science with the human element in a very intelligent screenplay. It is remarkable that such a coherent storyline emerges from a multitude of scientific and news sources. The movie also says a lot about the state of the country at a time in mid twentieth century America when the Red Scare was in full swing and the populace was guided by the morals and sensibilities of its time. Kinsey's relationship with his wife is the thread that ties the film together thematically. She essentially becomes the barometer for his work and his shortcomings. Here is a man who was brilliant and at the same time fallible.\n\nThere is no epilogue at film's end as might be expected for a biography, but it is a nice touch for a film that tries to approach its subject with freshness and reverence. The set design and costumes are all authentic in period flavor, but the film seems to be focused not on marking the precise year but depicting an era or time. Do stay for the amusing end credits which show a veritable Noah's Ark of animals in their glory. \n\nLiam Neeson is very good as the obsessed scientist who tries to conduct meaningful, quantifiable research while reconciling the emotional toll on his marriage and his friendships. Laura Linney is in fine form as the supportive wife who observes and then participates in her husband's venture.\n\nAs his research assistants, Timothy Hutton, Chris O'Donnell, and Peter Sarsgaard round out a very strong ensemble cast. In fact, these fine actors are almost wasted in supporting roles. John Lithgow is pitch perfect as Kinsey's cruel, insensitive father. There is a nice, near cameo appearance by Lynn Redgrave (Gods and Monsters) as the last interview of Kinsey, and she resonates in her brief appearance.\n\nIn keeping with the subject matter, there is graphic dialogue and sexual depictions, but there is nothing exploitive or without narrative purpose here. It is interesting to note that this film is coming on the heels of a moralistic backlash of media content and permissiveness. By showing how well-intended human studies into formerly taboo subjects helped to enlighten and reexamine human behavior, Kinsey proves to be the right film for the right time."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2224292121",
        "name": "Kinsey",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjMyNjcwODktYjI3MC00ODVmLTlkOTktMmI5NDYyNzVhYjljXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjMyNjcwODktYjI3MC00ODVmLTlkOTktMmI5NDYyNzVhYjljXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:55:26Z",
        "url": "https://www.imdb.com/video/vi2224292121/"
    },
    "url": "/title/tt0362269/"
}