{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vivek Oberoi",
            "url": "/name/nm1059103/"
        },
        {
            "@type": "Person",
            "name": "Isha Sharvani",
            "url": "/name/nm1690618/"
        },
        {
            "@type": "Person",
            "name": "Antonia Bernath",
            "url": "/name/nm1553405/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1415,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Sachin Bhowmick",
            "url": "/name/nm0080432/"
        },
        {
            "@type": "Person",
            "name": "Farrukh Dhondy",
            "url": "/name/nm0223585/"
        },
        {
            "@type": "Person",
            "name": "Subhash Ghai",
            "url": "/name/nm0007131/"
        }
    ],
    "datePublished": "2005-01-21",
    "description": "A man befriends and protects a British girl from a group of nationalists that want England to hand India back to them. They fall for each other, but the man is due to marry.",
    "director": [
        {
            "@type": "Person",
            "name": "Subhash Ghai",
            "url": "/name/nm0007131/"
        }
    ],
    "duration": "PT2H51M",
    "genre": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODA4ZGZiMGEtMTA2My00OTQ3LWFmMTYtMTZmODI5ZjM4M2ZiXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_.jpg",
    "keywords": "reference to krishna the hindu deity,interracial romance,british,india,love",
    "name": "Kisna: The Warrior Poet",
    "original_info": {
        "id": "Kisna: The Warrior Poet_2005",
        "name": "Kisna: The Warrior Poet",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mideleon"
        },
        "dateCreated": "2005-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0396690/"
        },
        "name": "Hasn't Bollywood learned from Lagaan?",
        "reviewBody": "While I am a Bollywood aficionado, I do feel Hindu commercial cinema could stand to improve the quality of their output while still maintaining those fundamental elements that make Bollywood so much fun. Such an effort would help to widen the commercial appeal of these films to western audiences while still allowing them to be what they should be first and foremost, that is a national product for Indian audiences. KISNA is prime example of a film that could have followed the example of the brilliant LAGAAN and broken borders, but instead falls into the same \"might have been\" category as so many other Indian musicals. \n\nThere is a lot to like about KISNA. The story is interesting and one that would appeal to audiences not particularly familiar with the Bollywood genre, the characters are intriguing, the songs are above average, and best of all, the movie is shot with an eye for the spectacular. But despite all of this, the director fails at pulling it all together despite having all the elements for a real classic. Apparently the film was written, produced and directed by a single person, but I'm sure a little oversight and collaboration would have helped. I suspect this director was a bit full of himself as evidenced by the final image of the film being of himself sweeping his arm out over a vast valley where the movie was shot as if to say, \"this film is all mine!\" \n\nKISNA is bound to be compared to LAGAAN and with good reason. Both films are concerned with the British Raj and both depict a love triangle between an Indian man and woman and the British woman who comes between them. Yet whereas LAGAAN had a light fairy-tale feel to it, KISNA is all drama and action. This is not necessarily a problem, except it's executed with a heavy hand from the start. The worst parts, however, are the repetitive action sequences which are basically the same situations played out over and over again. By the third time the young British woman is carried away by a bad guy you sort of hope she doesn't come back. As well, some of the stunts are merely implied by camera work rather than actually shown which feels a bit like a cheat and takes some of the excitement away.\n\nStill, if you want an excuse to see KISNA, the musical numbers certainly fit the bill. The cinematographer and dance choreographer do an exquisite job fueling the numbers with vibrance and excitement and some of the sequences are simply stunningly beautiful. There is, however, one very unfortunate exception. During one number which really should have been a touching song of unexpressed feelings by one character for another quickly devolves into the most absurd display of tasteless pop pandering I've seen in a Bollywood film in quite sometime. Rather than a deserted church in 1947 India, we are transported into something akin to a Mariah Carey music video replete with glowing motion trails and video generated rainbows. I half expected to see a unicorn fly across the screen followed by a VH1 logo. \n\nAs for the actors, most do exceedingly well in their roles. Although I was less impressed with the young British woman due to her overly-dramatic takes, I suspect it was the director who pushed for this style. I'm sure the actress had a better performance that remained untapped. \n\nThough nowhere near the pinnacle of LAGAAN, KISNA is worth a trip to the cinema if only to admire the wonderful musical numbers and also to ponder what this film \"might have been\" if it had been in the hands of a more capable director."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1382987801",
        "name": "Kisna: The Warrior Poet (2005) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzE5OGFlYWItZTFmNi00ODM1LWJlOGQtZWQ0OTUwMTlmOThjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzE5OGFlYWItZTFmNi00ODM1LWJlOGQtZWQ0OTUwMTlmOThjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-04-21T12:31:44Z",
        "url": "https://www.imdb.com/video/vi1382987801/"
    },
    "url": "/title/tt0396690/"
}