{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Schwimmer",
            "url": "/name/nm0001710/"
        },
        {
            "@type": "Person",
            "name": "Jason Lee",
            "url": "/name/nm0005134/"
        },
        {
            "@type": "Person",
            "name": "Mili Avital",
            "url": "/name/nm0000815/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5359,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080130/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021729/"
        },
        {
            "@type": "Person",
            "name": "James Frey",
            "url": "/name/nm0294580/"
        },
        {
            "@type": "Person",
            "name": "Doug Ellin",
            "url": "/name/nm0254120/"
        }
    ],
    "datePublished": "1998-02-27",
    "description": "Writer Jay and womanizing sportscaster Max have been friends since birth. Jay introduces his editor Samantha to Max and they hit it off. Max wants Jay to try to seduce Sam to test her before their wedding.",
    "director": [
        {
            "@type": "Person",
            "name": "Doug Ellin",
            "url": "/name/nm0254120/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2UxYjFlOWQtMDhmOC00Mjc2LWI0YjMtOTEyM2JkZWM4NTA2XkEyXkFqcGdeQXVyNDAxNjkxNjQ@._V1_.jpg",
    "keywords": "rubbing hair over man's body,comic relief,cheating fiancee,cheating girlfriend,dominatrix",
    "name": "Kissing a Fool",
    "original_info": {
        "id": "Kissing a Fool_1998",
        "name": "Kissing a Fool",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tim_buk2"
        },
        "dateCreated": "1999-08-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120723/"
        },
        "name": "I was the fool for watching this...",
        "reviewBody": "The story opens with a bride and groom kissing at their marriage service but you only get to see the face of the bride. This is a clue for us. We are going to have to figure out as we watch the film which guy is going to end up being the groom. The picture on the front of the video box has already showed us a bride being kissed from one side by Schwimmer and simultaneously from the other by Lee so we know the race for romance is going to be between the two of them. (This release, with Dutch subtitles, has a different picture to the US video/ IMDb picture.)\n\nYet in the first five minutes Linda the publisher tells us, not once, but twice that she introduced the bride and groom. We cut to a flashback of her introducing the two of them to each other, just in case we still don't get it. Then within another five minutes Jay the writer (Lee) is introducing Sam, his editor (Avital) to Max the sports caster and general foul-mouthed ignoramus (Schwimmer). IF the publisher is telling us the truth, doesn't this just kinda rule Max out of the contest for the first person to kiss the bride? Or have I missed something here?\n\nThis film is about as predictable as trying to guess which kind of white meat will feature most often on Thanksgiving dinner tables this year. I'll tell you; it will be turkey. And this movie sure is one.\n\nBut it is not just the plot and direction that are hugely lacking. Schwimmer is totally unbelievable and badly miscast as Max. His mouth moves, the words come out, but they lack any conviction whatsoever. The character of Jay the writer is such a whiney loser (with possibly the worst hairstyle in recent movie history) that I began to dread every screen appearance he made. He seemed to communicate in a series of whinging questions: \"What are you doing here?\" \"So what??\" \"And??\" I have absolutely no idea why the two of them were friends; they had nothing in common and were always bitching at each other. The script was very weak in places: Jay's explanation of why he had introduced Max to Sam provoked for me the biggest guffaw of the film (one of the very few). Best part of the film? The Harry Connick Jr. song over the opening credits.\n\nOverall, it gets a 3; a waste of my time and money - it was I who was the FOOL for not reading Roger Ebert's review BEFORE going to the video shop. If you are looking for a nice romantic comedy get While You Were Sleeping, The Philadelphia Story, As Good As It Gets or anything else on the IMDb list of top 50 Romance films.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2727608601",
        "name": "Kissing A Fool",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2I1ZWMxYmItOGJjNS00MjcyLTgzMTctNDA0OTYyNzRmYWFlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2I1ZWMxYmItOGJjNS00MjcyLTgzMTctNDA0OTYyNzRmYWFlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:55:47Z",
        "url": "https://www.imdb.com/video/vi2727608601/"
    },
    "url": "/title/tt0120723/"
}