{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Brent Barrett",
            "url": "/name/nm0057076/"
        },
        {
            "@type": "Person",
            "name": "Rachel York",
            "url": "/name/nm0948757/"
        },
        {
            "@type": "Person",
            "name": "Nancy Kathryn Anderson",
            "url": "/name/nm1409641/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 242,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066897/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052417/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104946/"
        },
        {
            "@type": "Person",
            "name": "Sam Spewack",
            "url": "/name/nm0818416/"
        },
        {
            "@type": "Person",
            "name": "Bella Spewack",
            "url": "/name/nm0818415/"
        },
        {
            "@type": "Person",
            "name": "William Shakespeare",
            "url": "/name/nm0000636/"
        }
    ],
    "datePublished": "2003-02-26",
    "description": "A live performance of the 1999 revival, taped in London in the theatre in which it was staged, and in front of a live audience.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Hunt",
            "url": "/name/nm0402383/"
        }
    ],
    "duration": "PT2H27M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQyOTI4MjYzOV5BMl5BanBnXkFtZTcwMzI0MjQyMQ@@._V1_.jpg",
    "keywords": "based on broadway musical,filmed play,stage performance,based on stage musical based on stage play,based on stage musical",
    "name": "Kiss Me Kate",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lovesclassics"
        },
        "dateCreated": "2003-05-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0353628/"
        },
        "name": "The definitive production and performances by the leads!",
        "reviewBody": "This is a glorious production of \"Kiss Me, Kate.\" Rachel York and Brent Barrett each bring an underlying tenderness to their characters that makes you ache to see them get back together in the end. Sure, they rant and rave and fight like wildcats, but never do you forget that they love each other. Too many productions of this very funny show make the leads one dimensional and totally unlikable, acting as if they hate each other. This production, directed and performed throughout with tremendous energy and skill, is first and foremost a love story. Everything else - the tongue-in-cheek humor, singing, dancing, orchestration, and even slapstick - is consistent with the passion that emanates from the two leads.\n\nAnd the two leads are superb. Rachel York has a vocal range that is unequalled in musical theater today. She sings her torchy version of \"So In Love\" with a heartbreaking sincerity, then belts her \"I Hate Men\" with raucous wild abandon. She then reaches the stratosphere with her amazing coloratura soprano in her screamingly funny rendition of \"Kiss Me, Kate.\" Brent Barrett proves to be her match every step of the way. He infuses his \"Were Thine That Special Face\" and reprise of \"So in Love\" with absolute adoration, but also demonstrates unbridled machismo in \"I've Come to Wive It Wealthily in Padua\" and \"Where Is the Life That Late I Led.\"\n\nThe entire cast keeps up with the pace set by York and Barrett. The show never lets down, and everyone seems to be having great good fun with the unrepressed music and lyrics of Cole Porter. This PBS version of \"Kiss Me, Kate\" will undoubtedly prove to be a classic, with the performances by Rachel York and Brent Barrett considered definitive. This Broadway revival will be the standard against which all other Kates are sure to be measured. It's a winner.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "timeRequired": "PT2H27M",
    "url": "/title/tt0353628/"
}