{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Morgan Freeman",
            "url": "/name/nm0000151/"
        },
        {
            "@type": "Person",
            "name": "Ashley Judd",
            "url": "/name/nm0000171/"
        },
        {
            "@type": "Person",
            "name": "Cary Elwes",
            "url": "/name/nm0000144/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 76677,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030480/"
        },
        {
            "@type": "Person",
            "name": "James Patterson",
            "url": "/name/nm0666248/"
        },
        {
            "@type": "Person",
            "name": "David Klass",
            "url": "/name/nm0458318/"
        }
    ],
    "datePublished": "1997-10-03",
    "description": "Police hunting for a serial kidnapper are helped when a victim manages to escape for the first time.",
    "director": [
        {
            "@type": "Person",
            "name": "Gary Fleder",
            "url": "/name/nm0001219/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE2MWE1ZDYtNjNkYS00YjZmLWJkZjctOTYzYTVjMDFiN2M5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "detective,kidnapping,escape,serial killer,tied to a tree",
    "name": "Kiss the Girls",
    "original_info": {
        "id": "Kiss the Girls_1997",
        "name": "Kiss the Girls",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jzappa"
        },
        "dateCreated": "2010-05-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119468/"
        },
        "name": "A Sufficient Mainstream Psychological Cop Thriller with Particularly Good Lead Performances",
        "reviewBody": "In this modest enough psycho-thriller, once more Freeman plays a policeman on the path of a perverse serial killer, and again the shade is bottomless and the antagonist is ingenious and the atrocities are intended to convey some sort of perverted meanings. Though as commercial and formula-driven as it is, the movie's not a rehash but a fertile piece, based on a Patterson book about a criminal who, the Freeman character perceives, is not killing his quarries, but accumulating them. Often said by moviegoers to be the actor whose presence has the most authority of any of his generation, Freeman has an exceptional bearing on the screen, a particular determination that we believe. He never looks or sound like he's pretending. He never gives a superficial, obvious or distracted impression, and even in movies that aren't that good, he's not guilty by association: You feel he's genuine even as a film may capsize around him.\n\nFreeman plays Patterson's pet character Alex Cross, a forensic psychologist with the Washington, D.C., police, who becomes entrenched in a chain of kidnappings in North Carolina. When his own niece is taken, he flies there and calls on the police department, where he's kept waiting for hours until he ultimately barges into the office of the chief. The victims are being taken by a man who inscribes himself \"Casanova,\" and one of his victims is found dead tied to a tree and \"left for the critters to find.\" Cross questions why there aren't more bodies, and speculates that Casanova is a collector who kills only when he believes he needs to. His niece and her fellow captives must still be alive somewhere. His hypothesis is certified by what comes of extraordinarily sexy local doctor Ashley Judd, who also gives the sometimes humdrum drama a helping of forceful energy.\n\nAnd what Freeman brings to all of his scenes is a really specific thoughtfulness. He doesn't just listen, he appears to cogitate what he is told, to gauge it. That masterful attribute begets a funny outcome, when other actors will tell him something and then stop to see if he trusts it. And Judd shows us such a boldly defined personality, which makes their dialogue scenes, after she's been developed for awhile, engrossing.\n\nKiss the Girls was directed by Gary Fleder, whose first feature, Things to Do in Denver When You're Dead, boasted skill but too much artifice. Here he's more careful and restrained, with a story where the shades and details are as chilling as anything else. Here as in Seven, we get a steady feeling of not being able to see everything we believe we want to, as in a chase through the woods which Fleder makes effectively tense through its efficient use of space, never revealing the distance between victim and pursuer.\n\nWhen the film is over and we know all of its enigmas, there's one we'd like to know more about: What precisely are particulars of the histrionics between the two most nefarious characters? But being left with such a wringer is much more fulfilling in a way than being given the explanation in the conventional fast-sketch Freudian description. What we're also left with is the genuine feeling of having met two authentically defined people in the leads. Freeman and Judd are so good, you almost wish they'd chosen not to make a thriller at all, had just discovered a way to create a drama really sinking their teeth into their characterizations. All things considered, I would've preferred that movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0119468/"
}