{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jennifer Westfeldt",
            "url": "/name/nm0922724/"
        },
        {
            "@type": "Person",
            "name": "Heather Juergensen",
            "url": "/name/nm0432013/"
        },
        {
            "@type": "Person",
            "name": "Tovah Feldshuh",
            "url": "/name/nm0271165/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17102,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028932/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063291/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032165/"
        },
        {
            "@type": "Person",
            "name": "Heather Juergensen",
            "url": "/name/nm0432013/"
        },
        {
            "@type": "Person",
            "name": "Jennifer Westfeldt",
            "url": "/name/nm0922724/"
        }
    ],
    "datePublished": "2002-04-05",
    "description": "A woman searching for the perfect man instead discovers the perfect woman.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Herman-Wurmfeld",
            "url": "/name/nm0379237/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGZkYWY5NzEtZmYwYi00NGMyLWEyZjAtMjQ4NTZjNzQ3NGMzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "blind date,lesbian,sexual awakening,based on play,character name in title",
    "name": "Kissing Jessica Stein",
    "original_info": {
        "id": "Kissing Jessica Stein_2002",
        "name": "Kissing Jessica Stein",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2005-12-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0264761/"
        },
        "name": "Nothing special but still quite sweet",
        "reviewBody": "Jessica is Jewish, uptight, slightly neurotic and single. Everyone around her is married, dating, pregnant or something and she has to take grief from her family who want to see her \"happy\". Try as she might she can't find a guy that she likes enough to see twice. So when she sees an advertising from a woman looking for company she strangely finds herself responding and turning up to meet the bisexual Helen. The easy chat they have overcomes Jessica repulsion at the whole idea and soon they have become more than just friends. However can Jessica accept the truth herself far less be honest with others.\n\nThis is a strange mix of a film that mostly does enough to work. In some ways it seems to be a quirky independent film but in many ways it is just an OK mainstream comedy. Jessica herself seems to be a strange mix between the neurotic side of Woody Allen, the quirky side of Ally McBeal and the female side of Bridget Jones. It is a strange mix but it more or less works as a piece of entertainment even if it isn't as sassy and fresh as it thinks it is. The relationship between Jessica and Helen is delivered in a pacey fashion that doesn't quite ring true due to the lack of depth to it but it does enough to keep things moving along. Laughs are not that common but the general amusing air carries it along and, although the romance is basic and the characters thin, they it is easy viewing and they still engage if you are in an undemanding mood.\n\nWestfeldt overplays her neurotic character a little bit but she just manages to keep her convincing. She has an easy chemistry with Lake which really helps cover up the lacking material they both have to deal with; it helps that they wrote it and were probably very in touch with what they were trying to do, even if they didn't necessarily do what they could have done. The rest of the cast pretty much match them in turning in workable but unspectacular performances  not their failing but more to do with the fact that the script is breezy and light and not something a lot of depth can be brought out of. Herman-Wurmfeld's direction matches the light material and keeps it breezy.\n\nOverall this is a pretty sweet little film although not as fresh and fun as it thinks it is. The two leads could have done more as writers but they do have a good feel for the material and their performances help cover the material. Not many laughs or insights but it is consistently amusing and nice enough to be worth watching if you are looking for something undemanding."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1636892953",
        "name": "Kissing Jessica Stein",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjI5MDA4ODAtNzdjNS00ZmUxLThjMjktMjUzMTk5ZjE2Mjk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjI5MDA4ODAtNzdjNS00ZmUxLThjMjktMjUzMTk5ZjE2Mjk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:43:45Z",
        "url": "https://www.imdb.com/video/vi1636892953/"
    },
    "url": "/title/tt0264761/"
}