{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kôji Yakusho",
            "url": "/name/nm0945131/"
        },
        {
            "@type": "Person",
            "name": "Ken Watanabe",
            "url": "/name/nm0913822/"
        },
        {
            "@type": "Person",
            "name": "Yumi Asô",
            "url": "/name/nm0039604/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 57,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0477824/"
        },
        {
            "@type": "Person",
            "name": "Haruhiko Arai",
            "url": "/name/nm0032816/"
        },
        {
            "@type": "Person",
            "name": "Tooru Shirakawa",
            "url": "/name/nm1196427/"
        }
    ],
    "datePublished": "1998-06-06",
    "description": "Tetsuro Haga is a troubled gangster, living under the assumed identity Ise for ten years, to escape jail for gunning down his cruel adoptive father. His life begins to unravel when a journalist following him takes an interest in t...",
    "director": [
        {
            "@type": "Person",
            "name": "Kichitarô Negishi",
            "url": "/name/nm0624377/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjQyNDA3Y2YtNjEzOS00MDEzLWFiNjUtOGJhMDdjZTdiYTYzXkEyXkFqcGdeQXVyOTg2Mzg5NTM@._V1_.jpg",
    "keywords": "murder,revenge,divorce,divorce papers,patricide",
    "name": "Kizuna",
    "original_info": {
        "id": "Kizuna_1998",
        "name": "Kizuna",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sharptongue"
        },
        "dateCreated": "2013-09-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0322977/"
        },
        "name": "Frustrating to begin with",
        "reviewBody": "The first half of Kizuna is rather confusing and dull. Most puzzling of all, the first hour is not very well acted either. Koji Yakusho has been Japan's top actor for the past 20 years, and was already at the top of his game around this time, especially having starred in the international smash hit Shall We Dance two years earlier. The great Koji appears bored with the role, and the introduction of half a dozen other important characters, which should have enriched proceedings, becomes an exercise in head-shaking.\n\nIt perhaps doesn't help that Koji is playing a fairly unsympathetic character. The support actors seem to warm up faster than Koji, and are mostly fairly convincing by the half-way mark. Shortly after, Koji seems to switch on, fairly suddenly, and the movie dramatically improves as a result. The plot threads come together nicely, the pace quickens, the violence and gore increases (it was already pretty high !), nearly all the characters become more desperate as the pressure mounts.\n\nIf not quite gripping, the second half is highly watchable and the conclusion satisfying.\n\nI can't honestly say what could be done to improve the first half of Kizuna, but I certainly would not have stuck with it, had there been a lesser actor in the lead. Therefore, if you are new to the great Koji, start with another of his many fine films, and catch up with Kizuna later.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0322977/"
}