{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leon Niemczyk",
            "url": "/name/nm0631102/"
        },
        {
            "@type": "Person",
            "name": "Jolanta Umecka",
            "url": "/name/nm0880840/"
        },
        {
            "@type": "Person",
            "name": "Zygmunt Malanowicz",
            "url": "/name/nm0538931/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22620,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Knife in the Water",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051785/"
        },
        {
            "@type": "Person",
            "name": "Jakub Goldberg",
            "url": "/name/nm0325228/"
        },
        {
            "@type": "Person",
            "name": "Roman Polanski",
            "url": "/name/nm0000591/"
        },
        {
            "@type": "Person",
            "name": "Jerzy Skolimowski",
            "url": "/name/nm0804592/"
        }
    ],
    "datePublished": "1963-10-28",
    "description": "A couple pick up a hitchhiker on the way to their yacht. The husband invites the young man to come along for their day's sailing. As the voyage progresses, the antagonism between the two men grows. A violent confrontation is inevi...",
    "director": [
        {
            "@type": "Person",
            "name": "Roman Polanski",
            "url": "/name/nm0000591/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWFiZTk3MzQtZGQ1YS00ZGNhLTg3NTctYzJkMDYzNGI4NjA3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "hitchhiker,competitiveness,masculinity,alpha male,male pride",
    "name": "Nóz w wodzie",
    "original_info": {
        "id": "Knife in the Water_1962",
        "name": "Knife in the Water",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2005-01-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056291/"
        },
        "name": "Lubricated Blade",
        "reviewBody": "There is nothing more thrilling than discovering a natural filmmaker for the first time. There are only so many, and you can only have menarche once. Its an introduction into another life.\n\nI first saw this in 1965 at the Orson Welles Cinema near Harvard Square. We were told it was made behind the backs of Iron Curtain thugs, only surviving because of international attention. (I wouldn't meet Tarkovsky or Kieslowski until later.) And that it was made by the fellow who had made the striking \"Repulsion,\" which at that time was anticipated but yet unseen in the States.\n\nI've since learned some striking things: that both Polanski and his co-writer wanted to play the hitchhiker and indeed it is Polanski's voice. And that the mistress who seems only half alive was in fact played by a non-actress they found by looking at swimming pools. Also that the situation was suggested by a long planned and discussed Orson Welles project (\"The Deep\") that was started after this and never completed. \n\nThe writing is good of course, especially the central image the title denotes, but the camera finds the perfect place always. It is like Altman's camera (after this) that discovers the action rather than, say Spielberg's where the action is obviously happening in such a way to be cleanly seen by the camera. And so much harder on a boat!\n\nBut the interesting thing about such an introduction to a filmmaker is the relationship that follows: we know certain things about how he thinks and sees. We expect the conversation to continue and mature over the years. And what a rocky ride this man has taken us on, through perfectly created worlds (in which I include \"Ninth Gate\") but also through pure dreck and rank sentimentality (both of which tag \"The Pianist\").\n\nSometimes he's internal to the narrative, even the charmed actor. Sometimes he is outside the narrative, pulling strings (as with this film) but sometimes it is clear he never got out of bed.\n\nAs with Kubrick and so many others, you really must start at the beginning, which essentially means here.\n\nTed's Evaluation -- 3 of 3: Worth watching."
    },
    "url": "/title/tt0056291/"
}