{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ed Harris",
            "url": "/name/nm0000438/"
        },
        {
            "@type": "Person",
            "name": "Gary Lahti",
            "url": "/name/nm0481635/"
        },
        {
            "@type": "Person",
            "name": "Tom Savini",
            "url": "/name/nm0767741/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5086,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163936/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0822775/"
        },
        {
            "@type": "Person",
            "name": "George A. Romero",
            "url": "/name/nm0001681/"
        }
    ],
    "datePublished": "1981-04-10",
    "description": "A medieval reenactment troupe struggles to maintain its family-like dynamic amid pressure from local authorities, interest from talent agents, and their \"King's\" delusions of grandeur.",
    "director": [
        {
            "@type": "Person",
            "name": "George A. Romero",
            "url": "/name/nm0001681/"
        }
    ],
    "duration": "PT2H26M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzI0NTUzOTAtNjkxYy00OWY4LWE2NjAtYjdkYjdhMmI2NGRlXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "tenor,baritone,friends who live together,fu manchu moustache,voice impersonation",
    "name": "Knightriders",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "krasnegar"
        },
        "dateCreated": "2001-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082622/"
        },
        "name": "Fighting the Dragon",
        "reviewBody": "Sometimes it's too long.\n\nSometimes it's just right.\n\nBut even when i watch it and say -Yup, too long!- i can never decide what to cut.\n\nI love to put this on for people who have never seen it and have no idea of what they're in for -- the careful arrangements, compositions and camerawork of the opening sequence, as the King and his Queen tarry a while in the (probably enchanted) woods, in the lovely golden sunlight, then dress themselves, he girds on his armor, he mounts his mighty steed (shot composed so that we see only his torso, the steed being out of shot at the bottom), she mounts side-saddle on the pillion...\n\nAnd BARRROOOOMMMM!!!! that huge bike roars into life and the camera pulls back as we see them ride away...\n\nIt's almost as much of a jolt as the narrow-to-wide cut at the beginning of \"Road Warrior\"... and just as important to see (if possible) on a big screen the first time.\n\nKings and queens, knights and heroes; a wizard... even a faithful Indian companion; it's all here.\n\nAction, adventure, humor, treachery and heroism -- all here.\n\nLove and hate, jealousy and heart break? Present and accounted for.\n\nBad guys get theirs, hero vindicated in the end? What do you think?\n\nAnd incredible, incredible action work. This film equals or even surpasses \"The Road Warrior\" in its motorcycle work. I'm still not sure if the final stunt is faked or whether they actually did it -- either way, my hat's off to the people who put it on the screen.\n\nEd Harris, as King Billy, whose vision forms the kingdom, whose unhealing wound signifies danger ahead, and whose malaise may well doom the kingdom, is brilliant.\n\nBrother Blue as Merlin is indescribable -- but in a good context.\n\nPatricia Tallman, who has gone on to a dual career as actress and stuntwoman (recurring on \"Babylon 5\" as telepath \"Lita\" and doing stunts in the film \"Long Kiss Goodnight\") has what i believe is her first screen appearance, playing a townie girl who is temporarily admitted into the kingdom's magic, but must eventually go home if only to tell the world what she's seen, is good...\n\nTom Savini as Morgan, the villain (hiss, boo) is Jes' Fine...\n\nI have always described this film as the one film i know of that gets the closest to the truths that underlie the King Arthur legends..."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Knightriders",
        "duration": "PT3M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1960947993",
        "name": "Knightriders",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzgyYjdkZDMtMWY4Ny00MDE2LWFjZWMtMTRmY2VhNmI5MDk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzgyYjdkZDMtMWY4Ny00MDE2LWFjZWMtMTRmY2VhNmI5MDk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-03-18T04:35:46Z",
        "url": "https://www.imdb.com/video/vi1960947993/"
    },
    "url": "/title/tt0082622/"
}