{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brian Bloom",
            "url": "/name/nm0089141/"
        },
        {
            "@type": "Person",
            "name": "Kimberly Rowe",
            "url": "/name/nm0746557/"
        },
        {
            "@type": "Person",
            "name": "John Doe",
            "url": "/name/nm0230335/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 288,
        "ratingValue": 4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0628069/"
        },
        {
            "@type": "Person",
            "name": "Craig J. Nevius",
            "url": "/name/nm0627537/"
        }
    ],
    "datePublished": "1999-06-08",
    "description": "Two paranormal scientists attempt to document the spirits which reside at Hillside House. They track down the murderer of a little boy, whose ghost is still alive. What they don't realize is that by discovering the murderer, they ...",
    "director": [
        {
            "@type": "Person",
            "name": "Mitch Marcus",
            "url": "/name/nm0546153/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk3MjM1NjUxN15BMl5BanBnXkFtZTcwODYzNjMyMQ@@._V1_.jpg",
    "name": "Knocking on Death's Door",
    "original_info": {
        "id": "Knocking On Death's Door_1997",
        "name": "Knocking On Death's Door",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pleiades10"
        },
        "dateCreated": "2001-03-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0191235/"
        },
        "name": "Very tense parapsychological thriller.",
        "reviewBody": "My wife and I stumbled across \"Knocking on Death's Door\" last night while flipping the channels, but we found it captivating enough that we stayed with the film right up to the closing credits. We missed the first few minutes, so some establishing facts and character development were probably lost, but the story goes like this. Brian Bloom and Kimberly Rowe play newlywed parapsychologists whom move into a well-known \"haunted house\". Various ghostly phenomena begins to occur, such as a piano playing \"London Bridge is Falling Down\" by itself (and it's NOT a player piano), chalk slowly scrapes on the basement floor to gradually reveal more and more information on the ghost's history, camera lenses ice over, and so on. The spectral activity becomes focused on the moments when the young couple make love, as if the ghost (or ghosts) have developed a crush on Rowe's character. What follows is a tense thriller with anything from fair and campy special effects at times to excellent and chilling visuals in others that will leave you at the edge of your seat. (Luckily for the viewer, there are much more of the latter than the former.)\n\nDavid Carradine and Kimberly Rowe play their roles quite well, emoting an uneasy sleaziness (in the case of Carradine), or a gentle inquisitiveness (Rowe) that lend credibility to the storyline. Brian Bloom, playing Rowe's husband, and the recipient of much of the ghostly violence (he is thrown against a wall by unseen forces when he hugs his wife...) seems to be the weak link as the actors go. Sometimes Bloom appears disinterested, other times he seems to be somewhat \"medicated\", but that doesn't detract from the overall enjoyability of the film.\n\nAlso notable is the eroticism displayed early on. The intimate scene between Bloom and Rowe is playful and loving, and Rowe truly has a breathtakingly beautiful body. A later scene wherein the two newlyweds are in separate rooms and Rowe pleasures herself as she watches her husband disrobe on camera is at once lovely and wildly erotic.\n\nI have a feeling that had this movie been released in the early to mid 80's, it probably would've become one of the early \"Amityville Horror\" sequels, but even without a movie franchise tie in, \"Knocking on Death's Door\" is clever horror with good twists and a tense atmosphere that slowly builds throughout the whole film. Strongly recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0191235/"
}