{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jennifer Baxter",
            "url": "/name/nm0062752/"
        },
        {
            "@type": "Person",
            "name": "Dennis Hopper",
            "url": "/name/nm0000454/"
        },
        {
            "@type": "Person",
            "name": "Vin Diesel",
            "url": "/name/nm0004874/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 24319,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093776/"
        },
        {
            "@type": "Person",
            "name": "Brian Koppelman",
            "url": "/name/nm0002718/"
        },
        {
            "@type": "Person",
            "name": "David Levien",
            "url": "/name/nm0505522/"
        }
    ],
    "datePublished": "2002-10-11",
    "description": "The wannabe sons of mobsters go to a remote town in the Midwest, and get themselves into more trouble than anyone could anticipate.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Koppelman",
            "url": "/name/nm0002718/"
        },
        {
            "@type": "Person",
            "name": "David Levien",
            "url": "/name/nm0505522/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM0OTA1NzY2Ml5BMl5BanBnXkFtZTYwMDI4NDU3._V1_.jpg",
    "keywords": "tough guy,light airplane,prejudice,profanity,anti hero",
    "name": "Knockaround Guys",
    "original_info": {
        "id": "Knockaround Guys_2002",
        "name": "Knockaround Guys",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "siciliangirl_02"
        },
        "dateCreated": "2003-04-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0211465/"
        },
        "name": "Watch Your Back",
        "reviewBody": "Patience is the key element in watching a mafia movie. \"Knockaround Guys\" didn't require any patience for me, and I was hooked at the first scene. This movie gives a formal description of friend and enemy. Who exactly is the real \"bad guy\" in a mafia movie? In most mafia movies it is quite obvious who the bad guy is, but this one will keep the viewer guessing. Berry Pepper plays the son of a well-known gangster. He, however, does not want to follow in the footsteps of his father. Peppers character's name is Matty Demaret, and he wants to be a sports caster. He has no luck finding a job because people know of his father's past. So, after a bombing interview , Matty decides that working for his father may be the only way for him to make a living, but Matty's father and uncle beg to differ. They believe Matty doesn't have what it takes to be in the mafia. After he convinces his father that he's got what it takes, his father gives him a job. Matty tells his father that he and his friend Johnny Marbles (Seth Green) will go out on their mission to collect money. Marbles flies planes, so he will be able to fly to collect the money. He was given strict orders to come straight back to Matty with the cash, but Marbles gets side tracked. He stops to get gas at a small airport, and leaves the bag unattended. The bag ends up getting into the hands of the sheriff, and he wants to keep the money for himself. Matty then calls his other two friends in to help. Chris Scarpa (Andrew Davoli)who is a sweet talking mob wanna be, and Taylor Reese (Vin Diesel) is the only one is the whole movie who actually looked and acted like a real gangster. The four boys travel to a small town in hopes of finding the money. Matty knows that if he doesn't get that money back, his father will be dead, and he will be a failure. This movie makes the viewer not want to take their eyes off the screen. I was very surprised at who was the real bad guy behind the plot. I think that anyone who watches this movie will be shocked at all the twist and turns. I would recommend this movie to anyone, because it was very easy to follow. I enjoyed this film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from New Line Home Entertainment",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3001352473",
        "name": "Knockaround Guys",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDQ2MzEzNTAtMWM1ZS00MjQwLTllZTktODhhMTAwMGM2MjhkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDQ2MzEzNTAtMWM1ZS00MjQwLTllZTktODhhMTAwMGM2MjhkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-05-29T21:08:44Z",
        "url": "https://www.imdb.com/video/vi3001352473/"
    },
    "url": "/title/tt0211465/"
}