{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Scott Cohen",
            "url": "/name/nm0169753/"
        },
        {
            "@type": "Person",
            "name": "John Stamos",
            "url": "/name/nm0001764/"
        },
        {
            "@type": "Person",
            "name": "Annabeth Gish",
            "url": "/name/nm0001272/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1093,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0097508/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033860/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0097789/"
        },
        {
            "@type": "Person",
            "name": "Greg Lombardo",
            "url": "/name/nm0518454/"
        },
        {
            "@type": "Person",
            "name": "Neil Turitz",
            "url": "/name/nm0877123/"
        }
    ],
    "datePublished": "2004-04-20",
    "description": "In this male-centric take on contemporary relationships, three guy friends look for love and commitment. One of them gets seduced by a vamp who ends up stealing his wife away from him.",
    "director": [
        {
            "@type": "Person",
            "name": "Greg Lombardo",
            "url": "/name/nm0518454/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYwODM4Mzc3Nl5BMl5BanBnXkFtZTcwMzAyMDAzMQ@@._V1_.jpg",
    "keywords": "cheating husband,love triangle,cheating wife,lesbian affair,mistress",
    "name": "Knots",
    "original_info": {
        "id": "Knots_2004",
        "name": "Knots",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2005-02-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0361805/"
        },
        "name": "Dave is boring, Greta is sexually confused, but their friends help out!",
        "reviewBody": "(Titled \"Sex, Love, & Lies\" on network TV.) The story starts with Dave (Scott Cohen) and Greta (Annabeth Gish), somewhat stale in their marriage, moving to a different apartment in New York. Dave thinks that he paid the movers too much, this place isn't that big once all their things are in it, a strong hint of hopelessness. But he is a straight-arrow faithful guy who loves his wife, but monthly sex with Greta has lost its magic. A host of other old and new friends enter the fray to help Dave and Greta figure it all out, in this very offbeat comedy. Many will not enjoy the loose play with conventional morals. SPOILERS FOLLOW. Dave catches the eye of pretty attorney, Lily (model Paulina Porizkova), but introduces her to friend Jake, and when Lily resists Jake's dinner invite, Dave suggests he and Greta go too, and Lily agrees. At dinner, when Greta seems to object that Dave was out with \"the boys\", Lily suggests a \"girls night out.\" Later, Dave comes home early to find Greta and Lily in bed, nude! Dave is rightly upset and baffled, the three guys get together to figure out what to do, but Dave is surprised to have divorce papers served to him at work. Angrily, he goes to Lily's law office, and after some histrionics kisses her, and they have wild sex on her desk! Loose lips Jake encounters Emily (Tara Reid) at a bar, tells her about his friend Cal (John Stamos) and his wild sex between meetings with his fiancée, who happens to be Emily. Emily shows up at Cal's, finds a woman, decks Cal -- twice. The three women get together to figure things out. Other things develop and, when Dave goes home to get some things, Greta shows up, they talk, the passion returns, they have the best sex ever, Dave thinks things will be OK between them, but in bed Greta says, \"I'm a lesbian.\" They all go on to Cal and Emily's wedding, after Cal promised fidelity and signed a pre-nup that would give Emily 70% if he cheats on her. But Dave knows (photos of Cal and Lily) Cal can't, and speaks up to halt the wedding. Lily calls Jake so he can comfort and leave with Emily. Dave and Greta sit in a pew and talk, \"Friends?\" \"Friends.\" \"Good\", says Greta, \"because I'm pregnant.\""
    },
    "url": "/title/tt0361805/"
}