{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Nana Patekar",
            "url": "/name/nm0007113/"
        },
        {
            "@type": "Person",
            "name": "Tabu",
            "url": "/name/nm0007102/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 679,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0601433/"
        }
    ],
    "datePublished": "1999-08-13",
    "description": "Major Ajit is sent to nab ex-Army officer Colonel Sodhi, who is hiding in the guise of Devraj Hathoda.",
    "director": [
        {
            "@type": "Person",
            "name": "Mehul Kumar",
            "url": "/name/nm0474837/"
        }
    ],
    "duration": "PT2H30M",
    "genre": [
        "Action",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTM4YjIxYzQtZmE4Ni00NTFjLWJhZjktNTgzNWZkY2U0YzNkXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "keywords": "patriot,evil politician,punching bag,investigation,disguise",
    "name": "Kohram",
    "original_info": {
        "id": "Kohram_1999",
        "name": "Kohram",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nadkarnisumeet"
        },
        "dateCreated": "2022-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0213775/"
        },
        "name": "Bachchan aur Nana ki takkar!",
        "reviewBody": "Kohram review :\n\nDirector Mehul Kumar had already announced Aey Watan Tere Liye with Amitabh Bachchan even before their Mrityudaata (1997) released. However post its debacle, Mehul Kumar shelved Aey Watan Tere Liye which had Dimple Kapadia, Arshad Warsi and Karisma Kapoor in key roles. He then reworked on the same script and thus, was born Kohram where Amitabh Bachchan and Nana Patekar worked together for the first time.\n\nThe plot revolving around an ex army man (Bachchan) trying to assassinate the super corrupt Home minister (Danny) disguising himself as a commoner with investigating officer Nana on his trail offered nothing new in terms of content except for the superbly executed confrontation scenes between Amitabh and Nana Patekar and the climax which offered a unique solution to tackle the corrupt politicians.\n\nKohram gave the much older Nana Patekar a chance to groove with the lovely Tabu playing a corrupt cop who falls for Patekar's Bengali moshai character. Their naughty romance was quite liked by the audience at Geeta Cinema, Worli where I saw the film in its first week. The patrons were cheering loudly as Tabu literally pulls an awkward Nana in to her bath tub. \"Paagal hua deewana hua\" song follows with Nana dancing in a hilarious manner!!\n\nWhile the focus was on Amitabh Bachchan- Nana Patekar takkar, Mehul Kumar couldn't do justice to the other seasoned stars like Jackie Shroff, Jaya Pradha and Ayesha Jhulka who came and went in a blink. Particularly, Jaggu Dada was severely shortchanged in the movie. I wanted to see more of Ayesha as well but the film offered no scope to her beyond a dance number with Mukul Dev.\n\nWith all its pros and cons, Kohram was a decent one time watch and a timepass fare which became special only as it starred the two great legends together for the first and last time!!\n\nRegards, Sumeet Nadkarni.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0213775/"
}