{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vijay Anand",
            "url": "/name/nm0025629/"
        },
        {
            "@type": "Person",
            "name": "Jaya Bachchan",
            "url": "/name/nm0080149/"
        },
        {
            "@type": "Person",
            "name": "Achala Sachdev",
            "url": "/name/nm0755087/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 268,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056148/"
        },
        {
            "@type": "Person",
            "name": "M.G. Hashmat",
            "url": "/name/nm1355234/"
        },
        {
            "@type": "Person",
            "name": "Sisir Misra",
            "url": "/name/nm0592893/"
        },
        {
            "@type": "Person",
            "name": "Ashutosh Mukherjee",
            "url": "/name/nm0611514/"
        }
    ],
    "datePublished": "1974-05-04",
    "description": "By the time we learn to live, life is gone.",
    "director": [
        {
            "@type": "Person",
            "name": "Anil Ganguly",
            "url": "/name/nm0304356/"
        }
    ],
    "duration": "PT2H5M",
    "genre": [
        "Drama",
        "Musical",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTA3NGQ5NmUtZTYwYy00YThmLWE2YjAtNzhhODdjYTRmMjgyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "life",
    "name": "Kora Kagaz",
    "original_info": {
        "id": "Kora Kagaz_1974",
        "name": "Kora Kagaz",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jmathur_swayamprabha"
        },
        "dateCreated": "2011-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0246740/"
        },
        "name": "The blank paper of life sans the colours of love",
        "reviewBody": "Whenever I guide someone on interpersonal relations or self-motivation to do something worthwhile with the help of networking with significant others, I always assert one sentence - keep remember that communication gap is the biggest enemy of all relationships. I reiterate on this page too - if you consider your certain relationship is a very significant one for your life, then never allow any communication gap to creep into that. It destroys any relationship (howsoever strong it might be) the same way termite eats up wood.\n\nAnd which relationship can be more significant than the relationship of life-partners in wedlock. There is no dearth of jealous people or idiots or free consultants or the ones who interfere in your personal affairs without any need or a right on their part for doing so. Then it's the duty of the married couple only to at least maintain free and frank communication with each other (like we should maintain with MS) so that the issues get timely resolution and no eruption gets an opportunity to turn into a canker with the passage of time. Hurting your partner through words is bad but keeping mum and suppressing your feelings towards him / her within yourself is worse. And that's what Vijay Anand and Jaya Bhaduri starrer Kora Kaagaz (1974) underscores. It is an underrated classic from Bollywood which every newly married (or marrying) couple should give watch.\n\nKora Kaagaz (blank paper) is the story of Archana (Jaya Bhaduri) and professor Sukesh (Vijay Anand). Archana has a full-fledged family containing father (A.K. Hangal), mother (Achala Sachdev), sister (Nazneen) and brother (Dinesh Hingu) whereas Sukesh is almost alone and has no living relative other than an aunt (Sulochana). Archana and Sukesh get married but despite their abundant love for each other, cracks appear in their marital life due to the undue interference of Archana's mother in her life. Misunderstandings prop up and lack of communication on the part of the married couple aggravates them to an extent that ultimately they become separate. Archana realizes her error of giving her mother too much free hand to play with her married life and repents but only when it's too late. She feels the depth of her love for Sukesh after they are divorced and her family members insist her to remarry.\n\nHowever years later, destiny arranges their unexpected meeting in the waiting room of a railway station when both of them are going to ride different trains for their respective journeys. They get emotional and regret their mistakes. Once the suppressed love in the hearts of the husband and the wife is exasperated through the sweet memories of the past, they reunite.\n\nKora Kaagaz is the symbol of a life which can be compared to a plain sheet of paper without any picture or any colour or any words on it. Love is the thing which fills this blank sheet and turn it into a beautiful painting (or a beautiful story). Once the love is gone, the life is no better than a blank piece of paper. And let me say, it is even worse than that because due to the evaporation of the colours of love which were once there on it, it does not remain worthy of making a new painting or writing a new story on it. That's the pain of Sukesh and Archana vented out in the words of Kishore Kumar's immortal song - Mera Jeevan Kora Kaagaz Kora Hi Reh Gaya (my life was like a blank and it remained so).\n\nThe director of this movie, Anil Ganguly has given many good movies during the seventies. Kora Kaagaz is, inarguably, his best work in Hindi cinema. The story catches the viewer since beginning and leaves a highly feelgood impact upon him in the end after a time-span of two hours and odd minutes.\n\nKalyanji Anandji have composed highly admirable music for this movie. In addition to the immortal title song (brilliantly penned by M.G. Hashmat), the other songs - Mera Padhne Mein Laage Dil and Roothe Roothe Piya (both sung by Lata) are quite hilarious to hear and to watch on the screen.\n\nJaya Bhaduri has delivered one of the best performances of her career. The director of gems like Guide, Jewel Thief and Tere Mere Sapne, Vijay Anand has proved that he's no less when in front of the camera than he was when behind the camera. Others have supported them well. The only flaw in the movie is caricature like portrayal of certain characters.\n\nThe great lesson rendered by this movie is for the parents of married children (especially the girl who has to shift to a new household after her marriage). Once married, the children should be left free to manage their affairs (until and unless the life-partner of the child turns out to be a real villain). When the children are grown-up, educated and sensible, too much interference in their married life brings about disastrous results only. Misunderstandings may be arise and everything may be messed-up due to that, leaving a lot to be done for rectifying the things.. Please never give your child an opportunity to curse you one day because of your undue interference in his / her married life as Archana curses her mother after it's all over in her married life.\n\nFinally, I revisit my assertion in the first para - communication gap is the biggest enemy of all relationships and especially the marital relationship, so please consider it a taboo in your married life. Before this review ends, I am reproducing the final dialogues of the lead pair in the ending scene : Archana : Kya Saara Dosh Mera Hi Tha (Did the complete fault lie with me only)? Sukesh : Kuchh Dosh Tumhaara Tha, Kuchh Mera, Aur Kuchh Hum Dono Ka (Some fault lay with you, some with me, and some with both of us.\n\nI rest my case."
    },
    "url": "/title/tt0246740/"
}