{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Walter Matthau",
            "url": "/name/nm0000527/"
        },
        {
            "@type": "Person",
            "name": "Deborah Winters",
            "url": "/name/nm0935922/"
        },
        {
            "@type": "Person",
            "name": "Felicia Farr",
            "url": "/name/nm0268012/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1526,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "GP",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0636045/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051994/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037052/"
        },
        {
            "@type": "Person",
            "name": "John Paxton",
            "url": "/name/nm0668122/"
        },
        {
            "@type": "Person",
            "name": "Katharine Topkins",
            "url": "/name/nm0867684/"
        }
    ],
    "datePublished": "1971-09-17",
    "description": "Wanting to avoid settling in a nursing home, Joseph Kotcher, a retired salesman, is obliged to leave his son's family. He embarks on a road trip during which he strikes up a friendship with a pregnant teenager and begins to unders...",
    "director": [
        {
            "@type": "Person",
            "name": "Jack Lemmon",
            "url": "/name/nm0000493/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ1NzE2ZGMtOWQwOS00YzIzLTkzODgtNzZiNzA1ZjljZmVhXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "old age,senility,based on novel,character name as title,nickname as title",
    "name": "Kotch",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2007-05-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067314/"
        },
        "name": "Bonding With The Oddest People",
        "reviewBody": "I had not seen Kotch for a long time before viewing my VHS copy today and I was really moved with how good it was. Too bad Jack Lemmon never wanted to try directing again. Maybe had the film won an Oscar or two, he could have been persuaded to try.\n\nI think I finally figured out who Walter Matthau modeled his Oscar nominated performance on, it's Casey Stengel. Casey without the double-talk, but the same non-stop garrulousness that I remember from my youth.\n\nBut Casey had his captive audience of baseball writers and fans. Poor Joseph Kotcher is a retired salesman who lives with his son and his family. Though he's an excellent babysitter for his young grandson, he's generally underfoot according to his daughter-in-law Felicia Farr. Son Charles Aidman gently persuades him he ought to move into a retirement home.\n\nBut Matthau is just a lonely old man, looking for someone to bond with. He finds someone quite unlikely in the person of Deborah Winters, the new babysitter who finds herself pregnant by her boyfriend Darrell Larson. She moves in with him and not in a retirement home and they have some interesting experiences.\n\nMatthau lost the Best Actor Award to Gene Hackman and Kotch similarly lost as Best Picture to The French Connection. Still I think this one has stood the test of time a lot better.\n\nMarvin Hamlisch and Johnny Mercer wrote the song Life Is What You Make It for Kotch and it lost for Best Song to the Theme from Shaft. That one was truly unfortunate.\n\nKotch is a picture about the person who's your grandfather, old and a bit crotchety and some times a pain in the posterior as Deborah Winters says. But he's also the one with enough life experience to come through in the clutch.\n\nCome to think of it, one of the things that drove Deborah crazy was his insistence on a car with an old fashioned clutch as opposed to automatic transmission.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0067314/"
}