{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edward Asner",
            "url": "/name/nm0000799/"
        },
        {
            "@type": "Person",
            "name": "Pat Benatar",
            "url": "/name/nm0070232/"
        },
        {
            "@type": "Person",
            "name": "Jerry Brown",
            "url": "/name/nm0113831/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 39548,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020958/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0192317/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012737/"
        },
        {
            "@type": "Person",
            "name": "Ron Fricke",
            "url": "/name/nm0294825/"
        },
        {
            "@type": "Person",
            "name": "Godfrey Reggio",
            "url": "/name/nm0716585/"
        },
        {
            "@type": "Person",
            "name": "Michael Hoenig",
            "url": "/name/nm0006129/"
        }
    ],
    "datePublished": "1983-08-24",
    "description": "A collection of expertly photographed phenomena with no conventional plot. The footage focuses on nature, humanity, and the relationship between them.",
    "director": [
        {
            "@type": "Person",
            "name": "Godfrey Reggio",
            "url": "/name/nm0716585/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU1NjIwNDEtZTBhNi00ZWY2LTlkYWMtNDI3Njg5YWM1YzEzXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "time lapse photography,experimental film,television,demolition,building",
    "name": "Koyaanisqatsi",
    "original_info": {
        "id": "Koyaanisqatsi: Life Out of Balance_1983",
        "name": "Koyaanisqatsi: Life Out of Balance",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "desh79"
        },
        "dateCreated": "2005-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085809/"
        },
        "name": "A cinematic tour de force",
        "reviewBody": "\"It is up for the viewer to take for herself what Koyanisqaatsi means. For some people it's an environmental film, for some people it's an ode to technology, for some people it's a piece of sh-t, for other people it moves them deeply. It depends on who you ask\" - Godfrey Reggio\n\nSo, Koyanisqaatsi. Boring junk to some, an involving masterpiece to others, and God knows what other adjective-noun combinations are out there (you can probably guess my opinion from the rating above). Most of these descriptions are fairly subjective, but it would definitely be wrong to regard Koyanisqaatsi as anti-cinema. It is anything but. Cinema, in its purest form, is a marriage of sound and visuals; everything else is just decoration. Dialogue? Storyline? Koyanisqaatsi harks back to an age when cinema was simply a filmed record of a situation. Was it not the Lumiere brothers who are generally regarded as the first pioneers of cinema? And is it not the case that their films comprised of nothing more than situations like a couple feeding their baby, workers leaving a factory, or the (in)famous Train Leaving A Station, which went down in folklore as causing people to flee the auditorium in panic thinking they were about to be hit by a train as it approached them on-screen? Koyanisqaatsi is cinema returning to its roots, to the days when the possibilities for film as an art form were wide open, free of commercial constraints and fickle audiences too narrow in scope to accept anything other than what they view as the given norm.\n\nIn a way it's fairly irrelevant what Koyanasqaatsi meant to me on a personal level, though I might get to that later. What's important is what Koyanasqaatsi represents. It's an interesting attempt (and a successful one in my view) to illustrate how a narrative can be created simply by editing together seemingly loosely related scenes and images. It reminds me of another cinematic milestone, the Kuleshov experiment, in which two separate images where edited together to create a third meaning, and which helped establish what is now known as Russian montage (and speaking of the Russian montage tradition, anyone who has seen Vertov's The Man With The Movie Camera will no doubt find traces of it in Koyanisqaatsi and vice versa). Koyanisqaatsi takes it one step further, perhaps even to its logical conclusion, using editing to create a new meaning for the entire narrative as a whole. It works on a gut level and sparks an emotional response, in a way it demands a response, be it boredom, amazement... it really depends on the person (as illustrated by the Reggio quote above). As such it's an example of cinema at its most subjective.\n\nComing back to the influence Man With A Movie Camera no doubt had on this film, I think what Godfrey Reggio has done here is take this specific style of film-making and turn it into what I, personally, view as a cinematic statement on humanity- and our technology's relationship with the environment around us. It's a pessimistic film, filled with Cold War anxiety (though it hasn't lost any of its relevance) - and in retrospect, I also found it reminiscent of an age when America still had a strong avantgarde movement in the shape of people like Reggio or Laurie Anderson (and in a way it's an interesting coincidence that 1983 also gave birth to another experimental documentary, Chris Marker's Sans Soleil, which is equally rich in scope and tackles the same philosophical issues, albeit from a slightly different angle).\n\nI really wonder if the western world could produce a film like this today, in an age where cinema audiences are more fickle than ever, demanding a cut every three seconds and some sort of \"surprise twist\" at the end, with hardly a niche left for the Godrey Reggios of this world. But in a way I suppose it doesn't really matter. Koyanisqaatsi, to me at least, is one of the richest cinematic experiences anyone could possibly hope to have, and I doubt I'll see a film which will move me quite like this for a long time to come.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A collection of expertly photographed phenomena with no conventional plot. The footage focuses on nature, humanity and the relationship between them.",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2735391513",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTk1NWM3YTctM2IwZC00ZDcxLWEzNGUtZGIzMjdiMWIzOWJhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTk1NWM3YTctM2IwZC00ZDcxLWEzNGUtZGIzMjdiMWIzOWJhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-02-07T19:45:47.881Z",
        "url": "https://www.imdb.com/video/vi2735391513/"
    },
    "url": "/title/tt0085809/"
}