{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kajol",
            "url": "/name/nm0004418/"
        },
        {
            "@type": "Person",
            "name": "Rati Agnihotri",
            "url": "/name/nm0013159/"
        },
        {
            "@type": "Person",
            "name": "Rishi Kapoor",
            "url": "/name/nm0438501/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 690,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0266930/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0109068/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0163191/"
        },
        {
            "@type": "Person",
            "name": "Rahul Rawail",
            "url": "/name/nm0712541/"
        }
    ],
    "datePublished": "2001-01-19",
    "description": "Here is another Indian that also closely resembles another Hollywood movie. This story revolves around the lives of two look-alike sisters, who are brought up separately by their estranged parents, who had separated due to a misun...",
    "director": [
        {
            "@type": "Person",
            "name": "Rahul Rawail",
            "url": "/name/nm0712541/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzNzYwOTQ2OV5BMl5BanBnXkFtZTcwNzA2ODgzMQ@@._V1_.jpg",
    "keywords": "identity swap,dual role,inheritance,alcoholic,twins separated at birth",
    "name": "Kuch Khatti Kuch Meethi",
    "original_info": {
        "id": "Kuch Khatti Kuch Meethi_2001",
        "name": "Kuch Khatti Kuch Meethi",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "meghal"
        },
        "dateCreated": "2001-12-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0271604/"
        },
        "name": "Good story marred by poor script & direction",
        "reviewBody": "When the casting shows \"Rahul Rawail\" as director, you do expect something good from the guy who gave winners like \"Arjun\" or \"Dacait\". However, after \"Dacait\", Rahul Rawail has lost his touch, which was quite apparent in \"Anjaam\". And with KKKM, it feels it is the time either he takes a course in direction or call it quits.\n\nThe opening moments of the movie are quite well handed, with the confrontation between Rishi Kapoor and Rati Agnihotri provided as synopsis rather than typical \"Rona Dhona\" scene. However, as the movie comes into \"present time\", it degenerates. The opening scenes between Kajol and Sunil Shetty, when they meet in London, are not done properly. As a result, the viewer has no clue as to what is going on.\n\nThe worst thing about the movie is the useless comedy that has been \"shoved in\" to provide comic relief. Instead of providing comical relief in the first half of the movie, the director has chosen to provide comic relief in each and every scene. As a result, one is confused whether the movie is a comedy or an emotional drama. Also, the songs keep coming at regular intervals without any need or situation. Not to mention a very mediocre score by Anu Malik and equally bad lyrics by Sameer.\n\nAs usual, like a typical Hindi movie, KKKM is not without goofs. One cannot imagine that Rati Agnihotri can own a huge departmental store and still thieves can get away without getting caught in the modern day world of video surveillance cameras and security guards. Or is the police of England so ineffective that it cannot provide security to such huge departmental stores. Also, it is ridiculous to see Kajol driving a battle tank right into the parking lot. I wonder when will Indian directors rise from mediocrity and foreign-locations hangups.\n\nPerformance wise, everybody does their parts without any dedication as none of the characters have been given enough justice to develop in movie due to inevitable comedy situation. Only saving grace is Rati Agnihotri, who like Sharmila seems very fresh unaffected by age. Hope we can see her in better roles in future.\n\nIn a nutshell, better opt for a pure comedy movie or a family drama instead of watching such uncooked \"Khichadi\". Yuck",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0271604/"
}