{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Black",
            "url": "/name/nm0085312/"
        },
        {
            "@type": "Person",
            "name": "Bryan Cranston",
            "url": "/name/nm0186505/"
        },
        {
            "@type": "Person",
            "name": "Dustin Hoffman",
            "url": "/name/nm0000163/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 166945,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049799/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0129164/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0371886/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Aibel",
            "url": "/name/nm0008743/"
        },
        {
            "@type": "Person",
            "name": "Glenn Berger",
            "url": "/name/nm0074184/"
        },
        {
            "@type": "Person",
            "name": "Ethan Reiff",
            "url": "/name/nm0717550/"
        }
    ],
    "datePublished": "2016-01-29",
    "description": "Continuing his \"legendary adventures of awesomeness\", Po must face two hugely epic, but different threats: one supernatural and the other a little closer to home.",
    "director": [
        {
            "@type": "Person",
            "name": "Alessandro Carloni",
            "url": "/name/nm1868917/"
        },
        {
            "@type": "Person",
            "name": "Jennifer Yuh Nelson",
            "url": "/name/nm0950775/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUyNzgxNjg2M15BMl5BanBnXkFtZTgwMTY1NDI1NjE@._V1_.jpg",
    "keywords": "title co directed by female,younger version of character,falling downhill,title directed by female,psychotronic film",
    "name": "Kung Fu Panda 3",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tjgoalie13"
        },
        "dateCreated": "2016-02-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt2267968/"
        },
        "name": "Funny and Gorgeously Animated",
        "reviewBody": "Kung Fu Panda is yet another solid entry in the Kung Fu Panda film series. It should be noted that while it's subjective, my opinion is that Kung Fu Panda 3 is ever so slightly the weakest of the franchise, but that's not a knock on the film. Kung Fu Panda 3 is often funny, beautifully animated, and features great characters. This is another great animated film for the entire family, that will surely delight people of all ages.\n\nThe tone of Kung Fu Panda 3 is a somewhat silly one, much like the other Kung Fu Panda films, however it does a good job of balancing mature themes with silly humor. The film also does a good job of balancing both subtle and witty humor with more bombastic and silly humor. The humor is bolstered by the terrific voice acting of the entire cast, which is as per usual great. Many times throughout this film I found myself laughing hysterically.\n\nAnother impressive element of the film is the amazing animation in this film. It may seem like every animated film features beautiful animation, but the animation in this film is truly amazing. Another impressive element of the animation is the action, which in an animated film may not seem like something to watch for, but the action sequences in Kung Fu Panda 3 are amazing. Many times watching this film the animation is so good it looks real, which is in it's own right an amazing accomplishment.\n\nThe film's pacing is great, but what's even better is the character development. With a story that isn't the strongest, the characters keep the film entertaining. Besides the villain, a character who feels like a forced conflict thrown in just to give the film drama, all of the characters in this film have some kind of development. Many of the characters are relatable, which helps the audience care about them. With characters that the audience can relate to and root for, the consequences of the film feel even heavier. \n\nIn Conclusion Kung Fu Panda 3 is a great fun film for the entire film with a little bit of something for everyone. The film is gorgeously animated, features well developed characters, great action sequences, good voice acting, and a terrific sense of humor. Despite the weak villain, occasionally silly tone, and some clichés the film is still very enjoyable. If you have some young kids take them to this film you'll all enjoy it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When Po's long-lost panda father suddenly reappears, the reunited duo travels to a secret panda paradise to meet scores of hilarious new panda characters. But when the supernatural villain Kai begins to sweep across China defeating all the kung fu masters, Po must do the impossible-learn to train a village full of his fun-loving, clumsy brethren to become the ultimate band of Kung Fu Pandas.",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3597971993",
        "name": "Trailer #3",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk2NDIyNjU1MV5BMl5BanBnXkFtZTgwNzc2MzM1NzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk2NDIyNjU1MV5BMl5BanBnXkFtZTgwNzc2MzM1NzE@._V1_.jpg",
        "uploadDate": "2015-12-22T08:09:00Z",
        "url": "https://www.imdb.com/video/vi3597971993/"
    },
    "url": "/title/tt2267968/"
}