{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Gilio",
            "url": "/name/nm0318580/"
        },
        {
            "@type": "Person",
            "name": "Lara Phillips",
            "url": "/name/nm0680568/"
        },
        {
            "@type": "Person",
            "name": "Rich Komenich",
            "url": "/name/nm0464620/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 226,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0138036/"
        },
        {
            "@type": "Person",
            "name": "Michael Gilio",
            "url": "/name/nm0318580/"
        }
    ],
    "datePublished": "2001-04-21",
    "description": "The tale of a Hollywood-bound actor called Lucky whose shoplifting is discovered by a local girl in a small, Midwestern town.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Gilio",
            "url": "/name/nm0318580/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM4MDg3Mjc2NF5BMl5BanBnXkFtZTcwMjk5NzkyMQ@@._V1_.jpg",
    "keywords": "shoplifting,pregnancy,diner,convenience store,bus station",
    "name": "Kwik Stop",
    "original_info": {
        "id": "Kwik Stop_2001",
        "name": "Kwik Stop",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Jalow547"
        },
        "dateCreated": "2016-12-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0212292/"
        },
        "name": "It's a lot better than Clerks",
        "reviewBody": "At first glance, this film looks and feels like your typical low-budget, independent comedy-drama. It has the same kinds of characters, the same production quality, bad lighting, and amateur acting. But at some point it starts to feel like real life in a way that we're not used to seeing in this kind of movie. We may resist it at first, being unprepared for it, but can only hold out for so long. And in that way, it stands out from all the others.\n\nAt times—especially toward the beginning—Kwik Stop feels a bit like Kevin Smith's Clerks. It has the same kind of dialogue and the same independent charm. But while Kevin Smith went on after Clerks to become a hugely successful director of big-budget films, Kwik Stop conquers the independent realm in a way that Kevin Smith could never do, albeit in a purely artistic aspect. Unfortunately, I get the feeling that it was never quite so successful on a monetary level, and director Michael Gilio never went on to make another film.\n\nKwik Stop feels like someone watched Clerks and said, \"People actually like this movie? I can make a better film with the same amount of money.\" It has the same charming quality and witty dialogue from Clerks and, similarly, it makes use of the same kinds of cheap, available locations. But it also has a great, unpredictable and completely believable story that is different from anything we're used to seeing. It's as if the filmmakers realized that what they would lose out on due to the low budget they could make up for through excellent storytelling. They invested in that and it paid off. Unlike other independent films, Kwik Stop doesn't waste too much time on silly comedy or sappy romance. It ignores those tired ideas, proving that the filmmakers were confident enough in their own ideas to take a chance on them. It feels like real life in such a way that I'm unable to think of any film worthy of comparison. And while there are comedy and romance throughout the film, is still always feels totally real. It feels real even despite the bad acting, because the events and the things happening to the characters feel so genuine and unrehearsed.\n\nThe film's main weakness is the acting, which is to be expected in such a low budget movie. The acting isn't exactly terrible. It's actually pretty good at times, but pretty bad at others. Most notably, the leading man played by director Michael Gilio delivers the majority of his lines pretty badly. He feels miscast. He's trying to play a part that his face and his voice and his overall demeanor can't quite pull off. It's a bit ironic, as there's a scene in this film in which his character watches a movie and then talks about how one of the leads in that film was miscast.\n\nThe only other drawback I found in this film was its length. At almost two hours, it felt a bit long for the story it was telling. One thing I like about most of these independent films is that they tend to wrap things up pretty quickly and rarely drag on past the hour-and-a-half mark.\n\nOverall, I enjoyed Kwik Stop quite a bit. It's not the best film I've seen lately, but it's certainly the best of its kind. It tells a story that's new and different than what we're used to, and it pulls off what it does better than any other low budget film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An award-winning indie hit, KWIK STOP is now available to rent or purchase at iTunes and Amazon VOD.",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2882143001",
        "name": "Kwik Stop",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTI0MDU4MjU2MF5BMl5BanBnXkFtZTcwNjMxODYyMg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTI0MDU4MjU2MF5BMl5BanBnXkFtZTcwNjMxODYyMg@@._V1_.jpg",
        "uploadDate": "2009-01-21T09:04:10Z",
        "url": "https://www.imdb.com/video/vi2882143001/"
    },
    "url": "/title/tt0212292/"
}