{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Vivek Oberoi",
            "url": "/name/nm1059103/"
        },
        {
            "@type": "Person",
            "name": "Aishwarya Rai Bachchan",
            "url": "/name/nm0706787/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1848,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0150409/"
        },
        {
            "@type": "Person",
            "name": "Tushar Hiranandani",
            "url": "/name/nm1571874/"
        },
        {
            "@type": "Person",
            "name": "Samir Karnik",
            "url": "/name/nm1334468/"
        },
        {
            "@type": "Person",
            "name": "Vivek Oberoi",
            "url": "/name/nm1059103/"
        }
    ],
    "datePublished": "2004-08-13",
    "description": "A woman decides to marry her childhood friend, after getting her heart broken by her sweetheart.",
    "director": [
        {
            "@type": "Person",
            "name": "Samir Karnik",
            "url": "/name/nm1334468/"
        }
    ],
    "duration": "PT2H45M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDcyODc1ZmYtMDQzYS00NGY0LWI4NDktMTkwZjNkMmMwYmU1XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "name": "Kyun! Ho Gaya Na...",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ijzeren_jan"
        },
        "dateCreated": "2009-09-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0349703/"
        },
        "name": "Average romance, completely spoiled by Aishwarya Rai",
        "reviewBody": "\"Comantic romedies\", as I once called them by mistake, are not my favorite sort of movies, but nevertheless I've hit upon instances I like a lot. Well, \"Kyun! Ho gaya na...\" is definitely not one of those. The story is one of thirteen in a dozen and unfolds itself without any significant surprises. Already at the very start of the film you know how it is going to end, and that the road towards that end will be tortuous. But then, that is inherent to the genre. Whether such a movie is nice or not, depends pretty much on things like humor, acting, chemistry between the actors and the like. Unfortunately, when it comes to these, KHGN turns out to be a major disappointment.\n\nThe best memories I have about it are the roles of Om Puri and Amitabh Bachchan. With both gentlemen, you are in for a real treat. Most important in romantic comedies, however, is chemistry between the protagonists, in this case Vivek Oberoi and Aishwarya Rai, and unfortunately, that is precisely what KHGN completely lacks. I don't think Vivek is to be blamed for that. He does whatever he can, playing the kind of light-hearted, immature joker we've seen him playing before, too, and generally manages well. Aishwarya, on the other hand, is deeply disappointing. I've seen her playing way below her possibilities in other movies as well, but in KHGN her acting is downright embarrassing. If there is anything at all she manages to convey with this role, it must be something like: \"God, what evil have I done to Thee to deserve playing in this movie\". I'm curious why. Laziness? Arrogance (\"I am the Queen of Bollywood, and whatever I do, I am a mega star anyway\")? Deep roots in old Bollywood traditions (\"Hurry up folks, in twenty minutes I have to be at the next set\")? Trouble in her real-life relationship with co-star Vivek Oberoi? Hard to tell. But one thing is for sure: this horrible performance of hers is enough to destroy an entire movie, including the good work of the other actors. A few more of these sub-standard performances, and no director will ever be willing to work with her - queen or no queen. Besides, Aishwarya is not exactly the logical choice for the role of a young girl of less than average beauty, the type of girl boys tend to neglect.\n\nI should add that the movie is way too long for such a thin tale. During most of these 170 minutes I found myself bored or almost falling asleep. Not even because the tempo is slow, but because there is constantly too much of the same thing. Of the entire footage, no more than 100, perhaps 120 minutes is usable, and the rest can quietly be removed: it would undoubtedly make the movie more bearable. \n\nA great asset of KHGN is the music. In my opinion, the score would have deserved a much better movie than this one.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A woman decides to marry her childhood friend, after getting her heart broken by her sweetheart.",
        "duration": "PT42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3146628633",
        "name": "Kyun! Ho Gaya Na... (2004) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjYxZTRiZWUtNjNjNy00NWI1LTgzYjEtMmEwYTQ1NjcyMmRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjYxZTRiZWUtNjNjNy00NWI1LTgzYjEtMmEwYTQ1NjcyMmRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-04-10T12:41:18.365Z",
        "url": "https://www.imdb.com/video/vi3146628633/"
    },
    "url": "/title/tt0349703/"
}