{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christian Patey",
            "url": "/name/nm0665540/"
        },
        {
            "@type": "Person",
            "name": "Sylvie Van den Elsen",
            "url": "/name/nm0886142/"
        },
        {
            "@type": "Person",
            "name": "Michel Briguet",
            "url": "/name/nm0109276/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10878,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "L'Argent",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0847853/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026705/"
        },
        {
            "@type": "Person",
            "name": "Lev Tolstoy",
            "url": "/name/nm0866243/"
        },
        {
            "@type": "Person",
            "name": "Robert Bresson",
            "url": "/name/nm0000975/"
        }
    ],
    "datePublished": "1983-05-18",
    "description": "A forged 500-franc note is passed from person to person until carelessness leads to tragedy.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Bresson",
            "url": "/name/nm0000975/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTk4YTJkMGUtOTJkYi00MGJjLThhODctOGJlNTI5YzI0ZDM4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "nihilism,misanthropy,counterfeiting,loss of daughter,attempted suicide",
    "name": "L'argent",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dbdumonteil"
        },
        "dateCreated": "2007-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085180/"
        },
        "name": "money is the root of evil",
        "reviewBody": "\"L'Argent\" is Robert Bresson's very last film and a piece of work that went through a lot of financial problems to see the light of day. It was dismissed by many producers before being finally taken in hand by the Ministry of the Arts. At that time, Jack Lang was the ministry and his daughter served as a \"model\" for Bresson in the film where she is Yvette, Yvon's wife.\n\nSourced from a short story by Léon Tolstoï, \"l'Argent\" is first the assessment of a downward spiral for the main hero of the film, Yvon. Because he was given a forged note, this domestic oil delivery man will be caught in a chain of unfortunate events which will see him jailed, losing his cute, little daughter and wife before turning into a murderer. Through his decay, all forms of dishonesty, cruelty, injustice will be stated with money at their core, particularly in the first half of the film. Money is used for rewarding cowardice (the photograph who rewards his employee Lucien for his false evidence), for buying people's silence (Norbert's mother who gives the photograph's wife money to compensate her) and more generally, money is a God that makes Yvon's fate take a tragic dimension and drives a cruel, unfair world.\n\nIts depiction is a perfect opportunity for Bresson to let his sparse, cold, neutral cinematographic writing shine. The more the film goes on, the more these epithets prevail with an accumulation of close-ups of objects, audacious elliptical sequences, a tightened editing and deliberately bland models who recite their texts and don't \"act\" it. Bresson's minimalist approach of this tragic story and harsh society amounts to a limpid harmony that inevitably brings an unshakable emotion and it's important to note down the moment when Yvon is put up by the old lady. These sequences are like lulls in Yvon's grisly fate and it's impossible to remain indifferent to the old lady's dreary way of life or when she's offered a few hazelnuts by Yvon. There's even a glimmer of hope when she pronounces the words: \"I would forgive to the rest of the world\".\n\nIt's true that Bresson's highly elliptical, straightforward style will leave many viewers baffled as there is no psychology or action but if you're sensitive to his unspectacular directing, you will realize that he pushed his art to the extreme to better get the audience involved in Yvon's woes. You can watch it only once but it will forever stay in your mind.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A forged 500-franc note is passed from person to person until carelessness leads to tragedy.",
        "duration": "PT25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1947583257",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTIzMjQ2NDgtNGI3NS00ODJjLWFmMmEtNjNjMTYwMjgzN2NiXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTIzMjQ2NDgtNGI3NS00ODJjLWFmMmEtNjNjMTYwMjgzN2NiXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-22T21:55:29.005Z",
        "url": "https://www.imdb.com/video/vi1947583257/"
    },
    "url": "/title/tt0085180/"
}