{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gabriele Ferzetti",
            "url": "/name/nm0275213/"
        },
        {
            "@type": "Person",
            "name": "Monica Vitti",
            "url": "/name/nm0900143/"
        },
        {
            "@type": "Person",
            "name": "Lea Massari",
            "url": "/name/nm0557159/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 30869,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "L'Avventura",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055606/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100341/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077746/"
        },
        {
            "@type": "Person",
            "name": "Michelangelo Antonioni",
            "url": "/name/nm0000774/"
        },
        {
            "@type": "Person",
            "name": "Elio Bartolini",
            "url": "/name/nm0059026/"
        },
        {
            "@type": "Person",
            "name": "Tonino Guerra",
            "url": "/name/nm0346096/"
        }
    ],
    "datePublished": "1961-03-04",
    "description": "A woman disappears during a Mediterranean boating trip. During the search, her lover and her best friend become attracted to each other.",
    "director": [
        {
            "@type": "Person",
            "name": "Michelangelo Antonioni",
            "url": "/name/nm0000774/"
        }
    ],
    "duration": "PT2H24M",
    "genre": [
        "Drama",
        "Mystery",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmJlYTVjZTYtZDg1Yy00NzFiLWJmYzYtYTJhMjliY2I2ZTlhXkEyXkFqcGdeQXVyMjgyNjk3MzE@._V1_.jpg",
    "keywords": "island,disappearance,boat,italy,train",
    "name": "L'avventura",
    "original_info": {
        "id": "L'Avventura_1960",
        "name": "L'Avventura",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "avik-basu1889"
        },
        "dateCreated": "2017-11-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053619/"
        },
        "name": "Antoniennui !!!",
        "reviewBody": "By the late 1950s and early 1960s, the Italian economy had already started stabilising and moving away from the devastating consequences of WWII. The stabilisation and subsequent economic growth took place through rapid and widespread industrialisation. One can also clearly notice a shift in the sensibilities in the Italian films which were made during these years by acclaimed filmmakers like Antonioni, Fellini, Ermanno Olmi, etc. Their films shifted away from the concerns of neorealist films of the 1940s and early 50s. In this context, it is very interesting to note the dissimilarities between a typical Italian neorealist film and a post-neorealist film like 'L'Avventura'. While Neorealism dealt with the economic fallout of WWII, 'L'Avventura' deals with a sense of disillusionment in the midst of rapid industrialisation(the very first line of dialogue revolves around how the natural woods are being being replaced by houses). While Neorealism focused on the poor working class Italians, 'L'Avventura' focuses on the privileged upper class or the bourgeois section of the Italian society.\n\nFrom a technical standpoint, it has to be said that 'L'Avventura' is exquisitely shot. The camera movements and numerous tracking shots are executed with a distinct sophistication and methodical precision. There are a lot of complex frame compositions that take place in the interior scenes which scream perfectionism on the part of Antonioni. The overall tone for the film is one of extreme austerity. This austerity and lack of humanity to the film is clearly meant to represent the supposed lack of humanity in the midst of mindless industrialisation and consumerism. I think one thing that the viewer has to assume in order to buy into the film's plot and story elements is that the film takes place in Antonioni's own world which is a little different to the real world. This is because accepting the reaction of some of the characters to certain occurrences in the film will involve a certain amount of the suspension of disbelief.\n\nThe problem I had with 'L'Avventura' is that after a while, the relentless austerity started to get a little unbearable and tough to be receptive to. It's interesting because I know the austerity is absolutely deliberate and it's intended to epitomise the ennui that the characters get afflicted by along with Antonioni's own idea of the blandness and aimlessness of life in contemporary industrialised Italy of the early 60s. The first hour of the film is absolutely spectacular and rich with abstract existentialist intrigue. But once the group leaves the island and we re-enter civilisation, the film gets progressively less intriguing for me. I generally don't get negatively affected by the austerity of Kubrick or Bergman. But the second half of this film really started to progressively weigh me down.\n\nI don't think any acting performance in the film is particularly special. But of course Monica Vitti offers vulnerability and a sensitive touch to her character and she is the only one that the viewer can find any reason to sympathise with. But to be honest, it is clear that Antonioni is in no mood to make any character singularly likable.\n\nOverall 'L'Avventura' is a film that clearly shows a master at work who clearly has a visual flair and a philosophical voice. But the austerity and lack of humanity in the film makes it tough to rewatch and revisit too often.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A woman disappears during a Mediterranean boating trip. But during the search, her lover and her best friend become attracted to each other. ",
        "duration": "PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1099016473",
        "name": "Theatrical Version",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODcwNDQ3Mjk5MV5BMl5BanBnXkFtZTgwNzU3NTMyMzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODcwNDQ3Mjk5MV5BMl5BanBnXkFtZTgwNzU3NTMyMzE@._V1_.jpg",
        "uploadDate": "2013-07-09T19:49:58Z",
        "url": "https://www.imdb.com/video/vi1099016473/"
    },
    "url": "/title/tt0053619/"
}