{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin Spacey",
            "url": "/name/nm0000228/"
        },
        {
            "@type": "Person",
            "name": "Russell Crowe",
            "url": "/name/nm0000128/"
        },
        {
            "@type": "Person",
            "name": "Guy Pearce",
            "url": "/name/nm0001602/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 589742,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0089381/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "James Ellroy",
            "url": "/name/nm0255278/"
        },
        {
            "@type": "Person",
            "name": "Brian Helgeland",
            "url": "/name/nm0001338/"
        },
        {
            "@type": "Person",
            "name": "Curtis Hanson",
            "url": "/name/nm0000436/"
        }
    ],
    "datePublished": "1997-09-19",
    "description": "As corruption grows in 1950s Los Angeles, three policemen - one strait-laced, one brutal, and one sleazy - investigate a series of murders with their own brand of justice.",
    "director": [
        {
            "@type": "Person",
            "name": "Curtis Hanson",
            "url": "/name/nm0000436/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDQ2YzEyZGItYWRhOS00MjBmLTkzMDUtMTdjYzkyMmQxZTJlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "corruption,neo noir,1950s,murder,call girl",
    "name": "L.A. Confidential",
    "original_info": {
        "id": "L.A. Confidential_1997",
        "name": "L.A. Confidential",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hall895"
        },
        "dateCreated": "2005-08-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119488/"
        },
        "name": "A fascinating look at life in the big city",
        "reviewBody": "Give a collection of great actors a great story to work with and you are likely to end up with something rather special. Such is the case with L.A. Confidential. The boldface names jump off the page...Kevin Spacey, Russell Crowe, Kim Basinger, Danny DeVito, James Cromwell and, in his first big-time role, Guy Pearce. And none of these big names are just mailing it in, here to collect a paycheck. They're all on top of their games, undoubtedly helped to no small extent by the wonderfully nuanced and utterly intriguing story.\n\nThis story takes place in 1950s Los Angeles but this is a side of L.A. most people don't get to see. Behind all the Hollywood glamour L.A. has a seamy side which will be the focus of this tale. At the heart of the movie are three cops who ostensibly are supposed to be working together but who go about the business of dispensing justice in very different ways. Crowe plays aggressive hothead Bud White. Spacey is Jack Vincennes, who takes more pride in his work as an adviser on a popular television cop drama than he does in his actual police work. And Pearce plays Edmund Exley, a young up-and-comer in the department who plays things by the book. As we will soon see Exley is rather unique in an LAPD which believes in doing whatever is necessary to bring the guilty to justice. Even if it means becoming a little guilty themselves.\n\nThe movie really begins to move forward with a massacre at a coffee shop. It seems a pretty cut and dried case but initial appearances can be deceiving. Soon White, Vincennes and Exley will find themselves caught up in a maze of lies, deception and mystery. It will be a great test for these very different men as it appears they may well need each other's unique talents to solve this puzzle. And quite the elaborate puzzle it is. One important piece is Lynn Bracken, a high class call girl played by Basinger. Tying together many of this complex story's strands is gossip writer Sid Hudgens who is played with appropriate sleaziness by DeVito. And in the background the whole time is the somewhat mysterious Captain Dudley Smith, played by Cromwell. Here is a man who believes in bringing the guilty to justice by any means necessary. That's all well and good if you know who the guilty are but in L.A. Confidential you're never quite sure who to believe. The viewer is guessing right along with the investigators on the screen. And in the end it all comes together and pays off brilliantly.\n\nL.A. Confidential is first and foremost a great story, with many fascinating twists and turns along the way. The film also serves as a showcase for some of this generation's finest acting talents. Each of the main characters is wonderfully unique and each of the actors involved does a terrific job in bringing those characters to life. These are complex characters in a complex tale. It's so involved that the acting had to be stellar if this film was going to work and none of the stars disappoint. Terrific storytelling brought to life by a collection of inspired performances makes L.A. Confidential an absolute winner.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for L.A. Confidential",
        "duration": "PT2M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1124073497",
        "name": "L.A. Confidential",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2VlMDk1OTQtODY4Ny00ZGMzLWI4MWUtZWMwOTBmZjE2YTdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2VlMDk1OTQtODY4Ny00ZGMzLWI4MWUtZWMwOTBmZjE2YTdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-09-24T03:29:24Z",
        "url": "https://www.imdb.com/video/vi1124073497/"
    },
    "url": "/title/tt0119488/"
}