{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mercedes Morán",
            "url": "/name/nm0608187/"
        },
        {
            "@type": "Person",
            "name": "Graciela Borges",
            "url": "/name/nm0096559/"
        },
        {
            "@type": "Person",
            "name": "Martín Adjemián",
            "url": "/name/nm0012033/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7089,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048673/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055022/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050043/"
        },
        {
            "@type": "Person",
            "name": "Lucrecia Martel",
            "url": "/name/nm0551506/"
        }
    ],
    "datePublished": "2001-04-12",
    "description": "The life of two women and their families in a small provincial town of Salta, Argentina.",
    "director": [
        {
            "@type": "Person",
            "name": "Lucrecia Martel",
            "url": "/name/nm0551506/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWM2N2U2ODUtNTQzZC00OWY4LWE5ZTMtM2FkNjQ5ZDU2ZTJjXkEyXkFqcGdeQXVyMTEwODYxODM1._V1_.jpg",
    "keywords": "maid,alcoholism,mother daughter relationship,matriarch,racism",
    "name": "La Ciénaga",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2005-12-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0240419/"
        },
        "name": "Class contrasts in the provinces",
        "reviewBody": "Lucrecia Martel, the talented director of \"La Cienaga\", creates a dark picture with this film that takes place in the northern part of Argentina that borders Bolivia. Having seen \"La nina santa\" prior to watching this movie, there is a sort of connection between the two, as the director explores the darker side of human beings, which seems to consume her.\n\n\"La Cienaga\" is a film that mirrored the times when it was made. The last part of the 21th century was devastating for Argentina as most people were affected by the rapid changes in the economy that befell the land. As the film starts, we suffer from disorientation. We are taken to Mecha's house in the country where a group of people are seen sitting around the swimming pool. No one says anything to one another; it's as though the oppressing heat has numbed everyone. The only thing left to do is to drink to oblivion.\n\nMecha appears to be inebriated when she tripped and fell. The wine glass cuts her in the chest. Blood is seen all over the place. Then, as though by magic, we are taken to meet Tali and her family, who appear to live in town. There is a sharp contrast between the two households. Where Mecha's house is run down, it still shows signs of a richer past. Tali's home, on the other hand, is a much humbler place.\n\nMs. Martel makes a subtle comment on what she shows us. There are a lot of things that are wrong in Mecha's house, like the lesbianism shown between one of her daughters and the maid. Incest is also hinted when Jose, the older son, who has come from Buenos Aires to see his mother after her accident, shows a sick interest in his beautiful sister. He enters the bathroom while she is taking a shower. At the same time, we are shown on the television set, an incident where people are attesting to seeing the Virgin Mary in a water tank on the roof of a house.\n\nThe director imbues the film in symbolism, which seems to be hard for viewers to follow. The story is deeper than what the images present for our viewing. That is why this enigmatic film did not reach a wide audience. It's a shame because Lucrecia Martel's film has a hypnotic way to get us involved.\n\nGraciela Borges, an Argentine film star in her own right, plays Mecha, a woman of the moneyed society who appears to have seen better days. Ms. Borges underplays her character, achieving a great appearance. Mercedes Moran, who played Helena in \"La nina santa\", is seen as Lita, Mecha's cousin, Lita shows a lot of common sense. She also has a lot of problems, but she is much grounded than her cousin that is decaying in the old country estate. The ensemble cast is also good.\n\nWhile \"La Cienaga\" is a disturbing work. Lucrecia Martel wrote and directed with great style. It's worth a look of fans of the Argentine cinema because it shows one of the most original talents in a film that dares to go where others don't.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The life of two women and their families in a small provincial town of Salta, Argentina.",
        "duration": "PT1M51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi219333401",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWY1NDAwNmQtZjQxNy00YWIwLWJmMDgtOWJlYmNjNWI0YjMyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWY1NDAwNmQtZjQxNy00YWIwLWJmMDgtOWJlYmNjNWI0YjMyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-20T22:40:23.220Z",
        "url": "https://www.imdb.com/video/vi219333401/"
    },
    "url": "/title/tt0240419/"
}