{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nicole Garcia",
            "url": "/name/nm0305368/"
        },
        {
            "@type": "Person",
            "name": "Bernard Giraudeau",
            "url": "/name/nm0320808/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Marielle",
            "url": "/name/nm0547339/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1740,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057470/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021150/"
        },
        {
            "@type": "Person",
            "name": "Julien Boivent",
            "url": "/name/nm0092444/"
        },
        {
            "@type": "Person",
            "name": "Anton Chekhov",
            "url": "/name/nm0155009/"
        },
        {
            "@type": "Person",
            "name": "Claude Miller",
            "url": "/name/nm0002218/"
        }
    ],
    "datePublished": "2003-08-27",
    "description": "A group of cinematic spend a holiday in the French countryside. The film provides insight in their relationships, including that between a young man and a local girl, Lili. She uses the opportunity to work her way into the cinemat...",
    "director": [
        {
            "@type": "Person",
            "name": "Claude Miller",
            "url": "/name/nm0002218/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTNlMGRiNTQtYzRhZS00ZDllLTg0YzEtZDEyNmUwMWQ2YTY1XkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "dysfunctional family,unhappiness,infidelity,unfaithfulness,female rear nudity",
    "name": "La petite Lili",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "noralee"
        },
        "dateCreated": "2004-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0335351/"
        },
        "name": "A Sensual Re-Interpretation of \"The Seagull\"",
        "reviewBody": "\"La Petite Lili\" is a delightful, visually enticing reinterpretation of Chekhov's \"The Seagull\" through a very Gallic sensibility, similar to how \"Clueless\" updated and Americanized Austen's \"Emma.\"\n\nWhile retaining most of the original dialogue and plot as a droll commentary on the more things change the more they stay the same, co-writer/director Claude Miller cleverly updates the artistic medium of debate from literature to film and uses his visual powers to very sensually illustrate the sub-text that in most productions is stifled under 19th century Russian costumes. \n\nBecause for all the high falultin' talk of aesthetics and generational conflict, and intellectual art vs. commercial pandering, lust is the primary motivator. Essentially, all the men are led around by their genitals and the women are empowered by controlling them (and it was suspenseful as to which of the competing women would succeed at it for the long run as to whether any of the men could remain faithful to them). For all their intellectual pretensions, all the characters are ruled by their emotions. \n\nMiller wonderfully sets us up for the hot indolence of a country home weekend with a nude nubile Ludivine Sagnier, triggering a much more more effective mise en scene than Bernardo Bertolucci did in \"Stealing Beauty.\" The effect Sagnier has on all the gathered extended family members is palpable and her brazen manipulations are consistent through to the ironic conclusion. \n\nI thought through most of the movie that the director was possibly unaware of just how equally visually mesmerizing her counterpart Robinson Stévenin is on screen, as only one character responds to him, until I saw that James Dean is thanked in the acknowledgments and realized that Miller was using this brooding hunk as an archetype as well (his one final smile is almost a shock). \n\nThe last act is a culminating commentary on Chekhov's jarring denouement, claiming that \"this is how it should have turned out.\" Miller softens some of the punishing sexism of the original while putting together a film-within-a-film like Hamlet's play-within-a-play that revenges on the ex-girlfriend, the mother, the mother's lover, etc. full of both comedy and tension. \n\nThe sub-titles are many times white on white for difficult reading."
    },
    "url": "/title/tt0335351/"
}