{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Noël-Noël",
            "url": "/name/nm0637660/"
        },
        {
            "@type": "Person",
            "name": "Pascale Audret",
            "url": "/name/nm0041635/"
        },
        {
            "@type": "Person",
            "name": "Michel Galabru",
            "url": "/name/nm0301556/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036246/"
        },
        {
            "@type": "Person",
            "name": "Noël-Noël",
            "url": "/name/nm0637660/"
        }
    ],
    "datePublished": "1966-01-21",
    "description": "Doctor Mathieu helps the royalists plot against usurper Napoleon .The assassination will take place in Chalons where Mathieu claims he's got to visit some patients .But the emperor's police has got wind of the attempt.Now their ma...",
    "director": [
        {
            "@type": "Person",
            "name": "Jean Dréville",
            "url": "/name/nm0238810/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGFjOTBmMTYtMGFlNi00ZTM1LTkyNmYtOWIwNDJiMjNhYWQyXkEyXkFqcGdeQXVyMTk5MjE0MDA@._V1_.jpg",
    "name": "La sentinelle endormie",
    "original_info": {
        "id": "La Sentinelle_1992",
        "name": "La Sentinelle",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dbdumonteil"
        },
        "dateCreated": "2019-04-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0239964/"
        },
        "name": "The night of the usurper.",
        "reviewBody": "Doctor Mathieu helps the royalist plot against Napoleon .Actually he is such a drip that he lets himself persuaded by the royalists that ,for their homeland's sake, they must do away with the usurper. The assassination will take place in Chalons where Mathieu claims he's got to visit some patients .But the emperor's police has got wind of the attempt.Now their master will spend the night in a small village, in Mathieu's own house! And ,unbeknownst to him, one of his accomplices puts the explosive device in his desirable mansion!\n\nA lot of Jean Dreville 's works deserve to be re-discovered ,notably \" LES AFFAIRES SONT LES AFFAIRES\" \"LA FERME DU PENDU \" \"LE VISITEUR\" \" HORIZONS SANS FIN\".The first version of \"LA REINE MARGOT\" and \"LA CAGE AUX ROSSIGNOLS \" are his most famous efforts ,but the latter is soupy melodrama .\n\nThe cast and credits read : a film by Noel-Noel directed by Jean Dreville ; both men had already teamed up for \"LA CAGE AUX ROSSIGNOLS\" (later remade as \"LES CHORISTES \" ); a huge success but a bit mawkish in my book .\n\n\"LA SENTINELLE ENDORMIE \" is much more interesting ,with an excellent screenplay with never a dull moment. The actors rise to the occasion : Noel-Noel is a namby-pamby conspirer ,overtaken by events,but who reveals himself a resourceful man ; Michel Galabru portrays a colorful character who has a tendency to embroider the truth :a former soldier of the old guard of Napoleon,he would have fallen asleep -hence the title- while on duty and the emperor in the flesh would have replaced him!;Micheline Luccioni is a very capable woman of a servant; Pascale Audret as the doctor's daughter and Jean Sobieski as his nephew provide the love interest ; and the little boy (Alain Noel !)does not ham it up ,as child actors often do , and is very cute and curious.\n\nAll are going to spend a night to remember ; Napoleon ,who is after all the main character of the story ,does not appear ,one only sees his back in the final sequence (like in Ettore Scola's \"LA NUIT DE VARENNES \" in which neither Louis the Sixteenth nor Marie-Antoinette would appear);plenty of suspense is guaranteed for the viewer ,and it's sustained till the very last picture !!\n\nIt can also be seen as a reductio ad absurdum of the futility of politics ; never,perhaps ,even in Henri Jeanson's lines , the Legion D'Honneur (created by Napoleon himself)was held up in ridicule so much-which gives the movie a contemporary feel!-\n\nThe human factor is not passed over in silence ;the doctor's daughter : \"you think about your own little boy ,but haven't you thought about the little ones in Chalons?\"And hints at the Russian campaign sound highly ironical ...\n\nIt's an imaginary conspiracy ,but it's a night to remember indeed .Recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0239964/"
}