{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Douche",
            "url": "/name/nm0234745/"
        },
        {
            "@type": "Person",
            "name": "Marjorie Cottreel",
            "url": "/name/nm0183143/"
        },
        {
            "@type": "Person",
            "name": "Kader Chaatouf",
            "url": "/name/nm0149237/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3362,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029856/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057358/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037403/"
        },
        {
            "@type": "Person",
            "name": "Bruno Dumont",
            "url": "/name/nm0241622/"
        }
    ],
    "datePublished": "1997-06-04",
    "description": "A social movie about current life in the north of France. Freddy and his friends are all unemployed. They pass away time by wandering around on their motorcycles and by directing their aggressive feelings towards Arab immigrants. ...",
    "director": [
        {
            "@type": "Person",
            "name": "Bruno Dumont",
            "url": "/name/nm0241622/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2M0NDBlNTgtYWY5Ny00YWQ2LTlkM2YtOGMyZWJmMzYwYzQ1L2ltYWdlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg",
    "keywords": "female full frontal nudity,female pubic hair,racist,vaginal penetration,real penetration",
    "name": "La vie de Jésus",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2003-05-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120448/"
        },
        "name": "Dumont's startling debut has transcendent power",
        "reviewBody": "La Vie de Jesus, a film by Bruno Dumont, is an unconventional look at marginal young people living in Bailleul in northern France. They spend their time without much purpose, riding around the drab Flanders town on motorbikes or playing in a marching band. From the opening of the film, I could sense that I was in the hands of a director with unique talent. One of Dumont's greatest strengths is his uncanny ability to capture the sense of emptiness of the town and the people who inhabit it. With little dialogue and no musical score other than the sounds of nature to break the stillness, we are forced to relate to the characters by observing their eyes, their physical movements, and the facial expressions that reveal an inner sadness. \n\nIn La Vie de Jesus, unemployed, uneducated, and epileptic 20-year old Freddy (David Douche) lives with his mother Yvette (Genevieve Cottreel), a café owner. Douche gives a haunting performance as the sensitive but not very bright Freddy, his body scarred from repeated falls from his motorcycle and his face mirroring the fear of not knowing when his next epileptic seizure will come. Freddy has a girl friend, Marie (Marjorie Cottreel), who works as a cashier at the supermarket but their relationship lacks an emotional pull and their graphically depicted sex feels mechanical. Dumont does not judge his characters and they are fully three-dimensional, both guilty and innocent, displaying tenderness one minute and cruelty the next, searching for human connection. Freddy trains his finch to sing and takes the boy who just lost his brother to the beach to cheer him up, yet shortly afterwards he and his friends humiliate an overweight girl who plays in the band.\n\n One of the most moving scenes takes place at a hospital where the friends stand around a hospital bed watching one of the boys' brother who is dying of Aids. On the wall there is a picture of Jesus described as \"about a guy who comes back to life\". They do not talk but wait and watch silently and we wait with them as if expecting momentary redemption. Freddy and his friends are not \"bad\" people but each one is tightly wound, looking for a reason to explode and the film seethes with tension. When a young Arab boy Kader (Kader Chaatouf) foolishly tempts fate by making a play for Marie, the underlying racism of the society transforms an ordinary love story into a tragedy of transcendent power."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Freddy, barely 20 and an unemployed epileptic, lives with his mom in the sleepy town of Bailleul in Northern France. Freddy loves his girlfriend Marie and hangs out with his buddies aimlessly riding motor scooters. However, he faces a moment of strife when he sees Marie talking to the new guy in town.",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1659159065",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjljNWI3NWUtMWQ1MS00MDI3LWE5ODMtNzkyMTA5YTlkM2EwXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjljNWI3NWUtMWQ1MS00MDI3LWE5ODMtNzkyMTA5YTlkM2EwXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-06-03T00:21:50.096Z",
        "url": "https://www.imdb.com/video/vi1659159065/"
    },
    "url": "/title/tt0120448/"
}