{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Meiko Kaji",
            "url": "/name/nm0435299/"
        },
        {
            "@type": "Person",
            "name": "Jûzô Itami",
            "url": "/name/nm0411631/"
        },
        {
            "@type": "Person",
            "name": "Kazuko Yoshiyuki",
            "url": "/name/nm0949097/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3940,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "Lady Snowblood 2: Love Song of Vengeance",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024079/"
        },
        {
            "@type": "Person",
            "name": "Kazuo Kamimura",
            "url": "/name/nm0436655/"
        },
        {
            "@type": "Person",
            "name": "Kazuo Koike",
            "url": "/name/nm0463521/"
        },
        {
            "@type": "Person",
            "name": "Norio Osada",
            "url": "/name/nm0651487/"
        }
    ],
    "datePublished": "1974-06-15",
    "description": "To avoid a death sentence for her prior acts of bloodshed, the vengeful swordswoman Lady Snowblood is conscripted by the Japanese Secret Police to assassinate political dissidents.",
    "director": [
        {
            "@type": "Person",
            "name": "Toshiya Fujita",
            "url": "/name/nm0297846/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDc3NTMwMDAtNzUyYS00YTdjLWJlNGQtODE2ODAyNjkwYWM3XkEyXkFqcGdeQXVyNzM0MTUwNTY@._V1_.jpg",
    "keywords": "female warrior,female assassin,sword,severed hand,severed arm",
    "name": "Shurayukihime: Urami renka",
    "original_info": {
        "id": "Lady Snowblood: Love Song of Vengeance_1974",
        "name": "Lady Snowblood: Love Song of Vengeance",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AwesomeWolf"
        },
        "dateCreated": "2005-05-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0072157/"
        },
        "name": "The vengeance? Where's the vengeance?",
        "reviewBody": "Version: Eastern Eye's R4 DVD release. Japanese / English subtitles.\n\nI thought the ending of 'Lady Snowblood' was rather definite. It didn't exactly set itself up for a sequel, but, here we are. Sequel time - 'Lady Snowblood: Love Song of Vengeance'. I must admit, it is a cool title.\n\nAfter avenging her mother in 'Lady Snowblood', Yuki (Meiko Kaji) is arrested by the new Japanese police. Sentenced to death, Yuki is granted a reprieve by Kikui (Shin Kishida), an agent of the secret police. Kikui will let Yuki live if she spies on Ransui Tokunaga (Juzo Itami), an active socialist. Yuki accepts Kikui's offer, but making that offer may not have been the smartest thing Kikui ever did...\n\nThe first thing you may notice about 'Lady Snowblood 2' is that there is a lack of vengeance. It seems to have been substituted for politics. Naturally, there is some vengeance, and the requisite amount of Yuki killing people, but 'Lady Snowblood 2' seems to grounded in the political and social climate of Japan in the early 1900s. I've studied a bit of Japanese history from this period at university, so the tie-in managed to maintain my interest. However, characters make references to the Hibiya Riots and the Russo-Japanese war, events that happened in 1905. This is supposedly set right after 'Lady Snowblood', which I believe was set in the 23rd Year of Meiji. By my reckoning, that would make 'Lady Snowblood' set around 1891. I think I've missed something, or gotten the Meiji years wrong. If someone doesn't correct me, I'm going to assume time-travel was involved. Time-travel? Cool!\n\nMeiko Kaji turns into something of an acting robot in this outing. Yuki seems devoid of any emotion, and while that was a theme in the first, it was established that she was capable of human feeling. However, she still makes a good assassin. Although we have more politics and less action, the action we do get is still pretty good, if dated.\n\n'Lady Snowblood 2' stands in the shadow of its prequel. The first movie outshines this movie in every way, but the second is still entertaining. Worth a look for fans of the first - 7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0072157/"
}