{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Helena Bonham Carter",
            "url": "/name/nm0000307/"
        },
        {
            "@type": "Person",
            "name": "Cary Elwes",
            "url": "/name/nm0000144/"
        },
        {
            "@type": "Person",
            "name": "John Wood",
            "url": "/name/nm0939795/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6861,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048642/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Chris Bryant",
            "url": "/name/nm0117068/"
        },
        {
            "@type": "Person",
            "name": "David Edgar",
            "url": "/name/nm0249201/"
        }
    ],
    "datePublished": "1986-02-07",
    "description": "The story of Lady Jane Grey, who was Queen of England for only nine days.",
    "director": [
        {
            "@type": "Person",
            "name": "Trevor Nunn",
            "url": "/name/nm0638080/"
        }
    ],
    "duration": "PT2H16M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWE4OGM1NjAtNGU4ZC00ZTYyLWJkZDktNjFhYThlYjFhMTI3XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "decapitation,female nudity,starvation,brothel,character name as title",
    "name": "Lady Jane",
    "original_info": {
        "id": "Lady Jane_1986",
        "name": "Lady Jane",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Sophie-3"
        },
        "dateCreated": "2001-08-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091374/"
        },
        "name": "God is in the details",
        "reviewBody": "It's difficult to know how to take a film that begins with a history lesson (to the self-important sound of a beating drum, no less) and ends with a quote from Plato. Between the two is a narrative that wants to be both a conventional love story and an unconventional period film. It doesn't quite succeed at either, but for viewers of LADY JANE, the pleasure is in the details, and there are plenty of those.\n\nTo first dispense with the glaring historical inaccuracy that lies at the film's center, Lady Jane Grey, the Nine-Day Queen of England in 1553, did not in truth have a passionate love match in her husband, Guilford Dudley. Theirs was an arranged marriage, highly political in nature and masterminded by Dudley's ambitious father, the Duke of Northumberland. In reality, Jane resented and distrusted her husband, who was a spoiled and rather empty-headed young man with none of the high intellectual achievement so prominent in Jane.\n\nFor the second dispensation, Helena Bonham Carter, who plays Jane, is still unskilled at acting in this, her first role. She can furrow her brow with admirable dexterity to denote every emotion from confusion to embarrassment to sexual fulfillment, but there's little evidence of much going on behind, in the furrows of an actor's brain. However, since those afore-mentioned details surround her, it becomes fairly easy for a more demanding audience to overlook her callowness.\n\nNow for the details, beginning with everyone else in the cast. Has John Wood ever utilised his supercilious half-smile to better advantage? As Northumberland, he's perfect - driven by the need to consolidate his power when Jane's cousin Edward VI falls into a fatal illness, he conceives a scheme that will require relentless control over nearly everyone at court. While his fellow ministers, all burly toughs, inevitably knuckle under to his combination of silken flattery and outright threats, he's thwarted by two seemingly weak women - Jane and Mary Tudor (played with real grit and bitterness by Jane Lapotaire). It's a tossup whether Wood is better at the threats or at two points of emotional breakdown - one, when he must cast the die and order the agonising prolongation of Edward's death to complete his plans, or when, mud-pelted and dishevelled following his defeat by Mary's army, he ends up in the Tower, where all he can offer to his sons and followers is a weary, `I'm sorry.' It's the rare film where Wood's comic instincts don't get the better of his serious performance - this is one of them.\n\nAs Jane's equally controlling parents, Patrick Stewart and Sara Kestelman are almost as good. Stewart's character, the Duke of Suffolk, isn't a bright man, but his pursuit of his ambitions never quite overrides his notion of family honor, and this keeps him sympathetic, as all the supposed villains of the film remain. That's another of the details that deserves cherishing - the refusal to go for simplistic characters. Stewart is especially good when he throws all caution to the wind and raises an army to rescue his daughter, overriding even the objections of his formidable wife.\n\nOther details are in the costuming, the suitably squalid tavern and brothel scenes, the bit where the aristocratic Kestelman chows down on her dinner, gnawing on a greasy chop and wiping her mouth with her sleeve, and the achingly beautiful winter deer hunt that runs under the opening credits. All this and more make up for a downbeat ending and a central failure to come up with a satisfying examination of that most enigmatic of queens, Lady Jane Grey."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The story of Lady Jane Grey, who was Queen of England for only nine days.",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1771815705",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2RjZDlhYjQtZDU4ZS00MmMyLWEzYmYtZDQxOTNlMzE5YTNjXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2RjZDlhYjQtZDU4ZS00MmMyLWEzYmYtZDQxOTNlMzE5YTNjXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-11T23:24:48.301Z",
        "url": "https://www.imdb.com/video/vi1771815705/"
    },
    "url": "/title/tt0091374/"
}