{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cynthia Rothrock",
            "url": "/name/nm0001686/"
        },
        {
            "@type": "Person",
            "name": "Richard Norton",
            "url": "/name/nm0636280/"
        },
        {
            "@type": "Person",
            "name": "Robert Ginty",
            "url": "/name/nm0320180/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 624,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041462/"
        },
        {
            "@type": "Person",
            "name": "David Worth",
            "url": "/name/nm0175730/"
        },
        {
            "@type": "Person",
            "name": "Clifford Mohr",
            "url": "/name/nm0596046/"
        }
    ],
    "datePublished": "1992-05-15",
    "description": "An ex-CIA agent (Kathy Gallagher) living in Indonesia tracks Ludvig Hauptman, the arms dealer who killed her husband. Along the way, she meets a young boy and his grandfather, who teach her in the ways of the Lady Dragon.",
    "director": [
        {
            "@type": "Person",
            "name": "David Worth",
            "url": "/name/nm0175730/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAyNTc3NDQxOF5BMl5BanBnXkFtZTcwMTQ2MzUxMQ@@._V1_.jpg",
    "keywords": "rape,female fighter,groom dies at wedding day,wise mentor,alliteration",
    "name": "Lady Dragon",
    "original_info": {
        "id": "Lady Dragon_1992",
        "name": "Lady Dragon",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "I_Ailurophile"
        },
        "dateCreated": "2022-03-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104667/"
        },
        "name": "A little uneven, but ultimately a whole lot of fun",
        "reviewBody": "I have a deep appreciation for action films that have no pretenses about what they are. Make no mistake, this kindly informs us immediately what it is, as the very first scene is filled with dramatic flourishes to emphasize Cynthia Rothrock is portraying The Protagonist, and her opponent opens with a grand show. A somewhat middling rock score that's Just Enough attends the scene, and the MC of the bout vanishes from the makeshift arena as revealed in a trumped up moment as Rothrock turns her head. Welcome to 'Lady Dragon.'\n\nAs a distinct B-movie of martial arts, the flick wavers at all points and in all ways between earnest action-thriller vibes and overwrought imitation of titles with stars of more renown. With that, the entertainment provided oscillates twixt honest fun and \"a little too much.\" To be frank, though, I'd be lying if I said I didn't have a great time watching this. It's worth noting right away that of course Rothrock is actually quite accomplished in various fighting styles, and she brings that knowledge and experience to her portrayal of protagonist Kathy in fight scenes that are consistently well done. While perhaps not as sharp as in more recent pictures, I dare say the choreography is on par with any comparable features of the 80s or 90s, with stunts that come off pretty well. Action scenes at large, and any instances where martial arts are on display specifically, are the best executed moments throughout the length, especially as filmmaker David Worth and editors Maruli Ara and Amin Kertaraharja demonstrate capable camerawork and sequencing to make these as dynamic as possible.\n\nLess convincing are those scenes that require actual acting and emotional range from the cast. Rothrock isn't a bad actress - she does try, and gives a solid effort - but her skill set is orientated more towards action than nuance, and her co-stars either share that quality or just can't give a convincing performance generally. Richard Norton and Robert Ginty are suitable enough in their roles, but mostly play a one-note song; Pitradjaya Burnama and Diaz Tangkilisan show a little more dexterity as the grandfather and the boy - and Bella Esperance, too, as Susan - but the writing and direction keeps them restricted to Second Fiddle status. The more that 'Lady Dragon' requires a delicate hand of expression, the more it struggles. What we see of Kathy with her instructor and his grandson is notably forced and ham-handed as a plot development, and in presentation at large; worst of all is a passing love scene that holds no water whatsoever. Still, in fairness - martial arts flicks do broadly require some measure of narrative to provide structure, and again, what we see here is at least no worse than the least well regarded of, say, Jean Claude Van Damme, or the like. It serves its purpose.\n\nCharacters and dialogue mostly just do their part. Apart from the martial arts, the scene writing is the strongest aspect of the feature - duly engaging and enjoyable, and varied, as it builds the story bit by bit, with touches of comedy to round out the picture. I'm less certain that the plot underlying 'Lady Dragon' is entirely complete, but in any event, it's little more than an excuse for the action and stunts to follow. While composer Jim West's score isn't the most grabbing or essential film music, the 80s rock sensibilities and instrumentation are adequate in the quieter moments - and when employed during fight scenes, feel like they could be pulled from any given arcade or console fighter videogame.\n\nVery importantly, within the last third of the film, every last element is taken to fun new extremes, leaning into the utmost flavor of the B-movie with choice one-liners and deliberately overblown shots and action that occasionally defy good taste. The climactic battle between hero and villain is the most carefully crafted scene in all of 'Lady Dragon.' While any instance of vehicles extravagantly flying through the air are way over the top, I admire the gusto with which these aerials were performed, and the capstone of the chase scene preceding the climax is... Well, it's a choice. And it's a cheekily enjoyable one.\n\nA great deal of the movie traipses along a fine line between a second-tier romp and \"overt and tawdry\" - amusing, if not utterly captivating. The greatest energy was clearly poured into the final stretch, and with that the entertainment is cemented. No, Cynthia Rothrock isn't a household name like other action stars, and one may well argue that she doesn't deserve to be. But as much as her staple seems to be movies that have no aim but to deliver a kitschy, martial arts-filled popcorn flick, 'Lady Dragon' somehow climbs a few steps higher to be considerably more worthy than it has any meaningful right to be. Everyone involved clearly recognized the importance of ensuring the core martial arts action was the film's greatest strength - and so it is, with everything else built in service to that purpose. One gets a sense that making this movie was more fun than work, and that feeling is passed along to the audience. If not an absolute must-see, this is definitely sufficiently well done to earn a sincere recommendation to anyone that likes the genre and the space it plays in.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An ex-CIA agent (Kathy Gallagher) living in Indonesia tracks Ludwig Hauptman, the arms dealer who killed her husband. Along the way, she meets a young boy and his grandfather, who teach her in the ways of the Lady Dragon.",
        "duration": "PT3M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3342713625",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmRlYjY4MTEtMmIxOS00ZDgyLWFmNDEtYTAzOWNlZWRhNjVlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmRlYjY4MTEtMmIxOS00ZDgyLWFmNDEtYTAzOWNlZWRhNjVlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-07T16:55:56.051Z",
        "url": "https://www.imdb.com/video/vi3342713625/"
    },
    "url": "/title/tt0104667/"
}