{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Olivia de Havilland",
            "url": "/name/nm0000014/"
        },
        {
            "@type": "Person",
            "name": "James Caan",
            "url": "/name/nm0001001/"
        },
        {
            "@type": "Person",
            "name": "Jennifer Billingsley",
            "url": "/name/nm0082515/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3621,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015430/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000069/"
        },
        {
            "@type": "Person",
            "name": "Luther Davis",
            "url": "/name/nm0205065/"
        }
    ],
    "datePublished": "1964-06-10",
    "description": "A woman trapped in a home elevator is terrorized by a group of vicious hoodlums.",
    "director": [
        {
            "@type": "Person",
            "name": "Walter Grauman",
            "url": "/name/nm0336139/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGM2ZDQ5ZTktNmRjOC00NmM0LTg2NzUtMWVmMzNmZDE3NDllXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "elevator,woman in jeopardy,home invasion,grande dame guignol,bare chested male",
    "name": "Lady in a Cage",
    "original_info": {
        "id": "Lady in a Cage_1964",
        "name": "Lady in a Cage",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2007-09-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058283/"
        },
        "name": "Crazy, man, like wow",
        "reviewBody": "Olivia de Havilland is a \"Lady in a Cage\" in this 1964 film also starring Ann Sothern, James Caan (in his debut), Jennifer Billingsley, Rafael Campos, and Scatman Crothers. de Havilland is an elegant, wealthy poetess who is recovering from a broken hip and is dependent on an elevator in the house - one of those European types that looks like a birdcage. After her son Malcolm has left for the weekend, an accident outside knocks out the power as she is going upstairs in the elevator. Though she hits an outside alarm, no one who can help hears it. The only ones that hear it? Any thief within a 5-mile radius. A homeless alcoholic (Jeff Corey) is first on the scene; he steals a toaster and alerts a cheap hustler, Sade (Ann Sothern, who resembles Suzanne Pleshette in this film). However, they're no match for the next bunch, played by James Caan, Jennifer Billingsley, and Rafael Campos, who seem like early Mansonites and decide everything is theirs. (Later a third group shows up, and they're the toughest yet.) All the while, the lady of the house sits in the elevator, powerless to do anything about the destruction around her.\n\nThis is a harrowing movie, very '60s in its music and the messages are familiar: the urban jungle, druggies, man's inhumanity to man, people not stopping to help, putting themselves and their own agendas first. The de Havilland character is driven to drastic measures - the movie will glue you to your TV set.\n\nThe beautiful de Havilland is excellent - as she always is - as the trapped woman who not only has to deal with enemies at the gate but the fact that one of the crooks finds an accusatory note from her son which ends with a suicide threat - and she has no idea there was a problem. \"He sounds gay,\" one of them (Campos) says. James Caan is appropriately frightening, and so hairy it looks as if hair was taped onto his body. Jennifer Billingsley is good as his whacked out, drug-laden girlfriend. Sothern's story has a big continuity hole; it's never resolved. It's always a treat to see her in anything, and she plays this down and out loser very well.\n\nWithout de Havilland, this would have been a fairly lousy movie; with her, I think it's a cut above the horror films of other aging, classic film actresses like Crawford and Davis. If there is one thing de Havilland can always bring to a role besides great acting - and I write in the present tense because she's still alive - it's refinement, beauty, and class. Let's hope there's still a role she will agree to play.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A woman trapped in a home elevator is terrorized by a group of vicious hoodlums.",
        "duration": "PT3M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2033042201",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWRiNGM3MjctZDAxOS00Yjk2LTgwZjQtZWI3NjNhNzdkY2MwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWRiNGM3MjctZDAxOS00Yjk2LTgwZjQtZWI3NjNhNzdkY2MwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-18T21:37:27.069Z",
        "url": "https://www.imdb.com/video/vi2033042201/"
    },
    "url": "/title/tt0058283/"
}