{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Manisha Koirala",
            "url": "/name/nm0463539/"
        },
        {
            "@type": "Person",
            "name": "Jackie Shroff",
            "url": "/name/nm0006763/"
        },
        {
            "@type": "Person",
            "name": "Madhuri Dixit",
            "url": "/name/nm0002043/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2783,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037916/"
        },
        {
            "@type": "Person",
            "name": "Ranjit Kapoor",
            "url": "/name/nm0438499/"
        },
        {
            "@type": "Person",
            "name": "Haroon Rashid",
            "url": "/name/nm8637652/"
        },
        {
            "@type": "Person",
            "name": "Ashok Rawat",
            "url": "/name/nm1351622/"
        }
    ],
    "datePublished": "2001-08-31",
    "description": "The lives of four women from different places are the victims of male chauvinism and marital abuse. They decide to fight for their rights and dignity against the social norms and injustice.",
    "director": [
        {
            "@type": "Person",
            "name": "Rajkumar Santoshi",
            "url": "/name/nm0764316/"
        }
    ],
    "duration": "PT3H22M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTczZjQ0OWUtYjgyMS00YTdjLTg2NmUtMWVlYjVmMGQxYmQzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "rape and revenge,theater,bandit,actress,dowry",
    "name": "Lajja",
    "original_info": {
        "id": "Lajja_2001",
        "name": "Lajja",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "skfazli"
        },
        "dateCreated": "2001-09-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0293342/"
        },
        "name": "Laudable Theme, Gripping Narrative",
        "reviewBody": "I saw Lajja on opening night August 31,2001 at a theatre in nearby Diamond Bar. I was drawn to the movie by Rajkumar Santoshi's name, because generally he makes fairly good movies. Anu Malik's name as the composer was also an attraction. Rajkumar Santoshi did not disappoint me. He presented the subject in a fairly compelling way and did not deviate too much to accommodate \"entertainment\". Once again he did not use all the songs that featured on the film's audiocassette and CD, which will adversely affect the movie at the box-office.His father,P.L. Santoshi who was himself a famous lyricist before he became a film director, knew the importance of songs in an Indian movie. Rajkumar Santoshi, ever since his Ghayal became a hit without the support of music, has tended to ignore music and not give it the centrality it deserves in the Indian cultural context. He could not take advantage of even Nadeem- Shravan in Damini or of A.R. Rahman in his last movie Pukar. At least in the latter he took eminent lyricist Majrooh Sultanpuri and also Javed Akhtar (for one number). Here he relies on overworked and mediocre Sameer.The music department(with even the theme song cut out), therefore,is nothing to write home about. Will someone urge him not to repeat the same mistake over and over again?\n\nBut despite these drawbacks, which are quite serious, the movie works because of its laudable theme, Rajkumar Santoshi's good direction and some good writing too. But here too one fails to understand why a good director of Santoshi's calibre should take upon himself the added burden of writing the screenplay and the dialogue. Bollywood has plenty of good writers who would be happy to work for a director like Santoshi.\n\nOverall, it's a good movie.That's why I am giving it an 8 out of 10.\n\n Now a word about the advertising.It is publicised as a movie with three heroes and three heroines whereas the story concerns only one pair played by Manisha Koirala and Jackie Shroff. The rest just come and go.It should have been advertised as just a Manisha Koirala-Jackie Shroff starrer. There should have been no mention of the other famous names who are just guest stars in the movie. Like Salman Khan was not mentioned in the advertising of Kuch Kuch Hota Hai and that worked great for the movie.Lajja could have benefited tremendously from the presence of Madhuri Dixit, Anil Kapoor, Rekha and Ajay Devgan if their names had not been advertised and the public discovered them for the first time in the theatre on opening night.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The lives of four women from different places are the victims of male chauvinism and marital abuse. They decide to fight for their rights and dignity against the social norms and injustice.",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi312850969",
        "name": "Lajja Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjY4NTc2YTktYjVkNS00OGRhLTk1ZjktNTE0MmE5ZjM1ZGNiXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjY4NTc2YTktYjVkNS00OGRhLTk1ZjktNTE0MmE5ZjM1ZGNiXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-10-04T06:54:04.796Z",
        "url": "https://www.imdb.com/video/vi312850969/"
    },
    "url": "/title/tt0293342/"
}