{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hrithik Roshan",
            "url": "/name/nm0004335/"
        },
        {
            "@type": "Person",
            "name": "Preity G Zinta",
            "url": "/name/nm0006689/"
        },
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 24066,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019447/"
        },
        {
            "@type": "Person",
            "name": "Javed Akhtar",
            "url": "/name/nm0015287/"
        },
        {
            "@type": "Person",
            "name": "Karan Kashyap",
            "url": "/name/nm1260845/"
        },
        {
            "@type": "Person",
            "name": "Karan Vishwanath Kashyap",
            "url": "/name/nm10689808/"
        }
    ],
    "datePublished": "2004-06-18",
    "description": "An aimless, jobless, irresponsible grown man joins the army and matures into a battlefield hero.",
    "director": [
        {
            "@type": "Person",
            "name": "Farhan Akhtar",
            "url": "/name/nm1027719/"
        }
    ],
    "duration": "PT3H6M",
    "genre": [
        "Action",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2Y0NjY5ZTctZWMzNC00MDQ4LTkyMWUtOGZkMzk4NWNhYWI5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "character repeats someone else's dialogue,army,military academy,mountain,basic training",
    "name": "Lakshya",
    "original_info": {
        "id": "Lakshya_2004",
        "name": "Lakshya",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kya_bakwaas"
        },
        "dateCreated": "2004-06-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0323013/"
        },
        "name": "Good work, Farhan Akhtar!",
        "reviewBody": "Farhan Akthar has to live upto his debut 'Dil Chahta Hain' - a feat which will be difficult to match. FA will carry the DCH label forever, much like Ramesh Sippy was labeled with the Sholay tag. Comparing Lakshya with DCH is inevitable. And FA does score in many places. The story is quite simple. The setting is in late 1990s - just prior to the infamous Kargil. Roshan is Karan Shergill, the younger sibling in a well to do Delhi business family. Karan is a happy-go-lucky naive kid who has nothing to worry about in his life. His lady love, Romila Gutta aka Romy (Zinta), on the other hand, is a career minded young lady who has a clear idea what to do with her life. When placed at crossroads when all his friends are deciding about their future career prospects, Karan is influenced by one of his friends' decision and plans to join the Army. And to his own surprise finds himself in the Army training school. However, this sudden transition from his Bohemian lifestyle to army life proves to be more than he can handle and he quits the course. However, Karan realises that things will never be the same again with Romy, who clearly sees him as a quitter, a loser with no ambitions, no goals(That's Lakshya in Hindi) in life. Hurt and dejected, Karan joins the Army training again and comes out as a hard-boiled Lieutenent.\n\nKaran is posted in the volatile Dras sector, Kashmir. Here meets the stiff, focused Col. Damle (Mr. Bachchan) and his troops who make Karan realize that his Lakshya is to serve the country. Before long, there is a war brewing in the mountains, with Pakistani insurgents blocking out the supplies to various army bases high up in the mountains. Karan suddenly finds himself responsible for his country's safety and plays a key role in winning the battle against the intruders. His Lakshya is met. Technically, the film is brilliant. One of the first army movies made in Bollywood without an overdose of jingoism. German cinematographer Christopher Popp captures the night war sequences beautifully. The natural beauty of the rugged Ladakh has been brought to the screen in its whole. FA is a fine eye for the minor details, e.g., the name plates on the vehicles are in white letters written on black boards, like they were prior to 2001-2. The tense screens between Roshan and his father (played by the inimitable Boman Irani) are excellent. The film was conceived very very well. However, since nothing is perfect, no review is complete without some criticism. Lakshya has its faults - and most of these are because we had expected otherwise from the director of DCH. For one, there is not much of a script, so people watching for killing time will be bored. Unlike most war/army movies, this is more of a drama. Unlike DCH, we hardly have a light-hearted moment in the movie. Javed Akthar has returned to script writing after a long gap BUT I had expected more. Second, there are too many characters. Many actors in \"special appearances\" prove to be more distractions than integral elements of the story. Amitabh has his moments, but Om Puri, Lillette Dubey and Shushant have been wasted. At points, we feel that FA had a hard time to decide whether to keep pop-patriotism away from the movie. Songs distract and do not fit in the script, unlike DCH. My rating - 6.5/10 - for the sincerity with which the movie was made, for FA's dedication to his work, and for Hritik Roshan's performance."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2756229145",
        "name": "Lakshya (2004) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWNjNmUxMGYtNjlkZi00MmMyLWJhZTQtM2FhOTUyMzJmMjA0XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWNjNmUxMGYtNjlkZi00MmMyLWJhZTQtM2FhOTUyMzJmMjA0XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-05-07T09:11:23Z",
        "url": "https://www.imdb.com/video/vi2756229145/"
    },
    "url": "/title/tt0323013/"
}