{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Luc Simon",
            "url": "/name/nm0800253/"
        },
        {
            "@type": "Person",
            "name": "Laura Duke Condominas",
            "url": "/name/nm0174372/"
        },
        {
            "@type": "Person",
            "name": "Humbert Balsan",
            "url": "/name/nm0051116/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4041,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Lancelot of the Lake",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0245253/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0519527/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073149/"
        }
    ],
    "datePublished": "1974-05-31",
    "description": "King Arthur learns that his wife, Queen Guinevere, has been having an affair with Lancelot, who at the same time remains loyal to the king, particularly after Arthur's traitorous nephew Mordred commits an attempt on his life.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Bresson",
            "url": "/name/nm0000975/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Drama",
        "Fantasy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGY2M2IyMGUtMGIyYy00MTllLTg0YjctOGMzYmRhMjU5NjNjXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "nihilism,pessimism,misanthropy,despair,hopelessness",
    "name": "Lancelot du Lac",
    "original_info": {
        "id": "Lancelot of the Lake_1974",
        "name": "Lancelot of the Lake",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zetes"
        },
        "dateCreated": "2002-02-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071737/"
        },
        "name": "If nothing else, it's probably the only French New Wave film that begins with a decapitation!",
        "reviewBody": "I'm still inching into the cinema of Robert Bresson, as I would a hot bath. I saw Pickpocket a couple of months ago. I liked it, but didn't agree that it was a masterpiece of any sort. I picked up Lancelot of the Lake because the video box caught my eye. I didn't expect a French New Wave guy to be directing Medieval drama (I also rented Rohmer's Perceval at the same time, but have not yet watched it), especially Bresson, whom I associate with a certain slowness. \n\nThe result is mixed. The film is certainly not entirely successful, but I'd say that it is an extraordinarily interesting film. I have a problem with his decision to erase all emotion from his actors. That works decently in Pickpocket, but not as well here. The story takes place after the Knights of the Round Table have failed to find the Holy Grail. They return defeated. They feel that they have been denied by God himself. And then they begin to doubt themselves, and eventually to turn against each other. The story is one that ought to be imbued with emotions, especially Lancelot and Guinivere. Also, Lancelot's enemies, who are jealous of his affair with the queen more than they are angry on King Arthur's behalf, their rivalry should be readable on their faces. Instead, the actors emote about as much as cardboard cutouts. I guess Bresson is going for naturalism, but he falls way below that mark. Real people have emotions. \n\nOn the other hand, Robert Bresson's direction, that is, everything but the acting, is excellent. Most everything works, and there are many masterful sequences. It's perfectly paced (well, that is, if you like his style). The editing is often amazing. The art direction and music are also very good. As for the script, well, it can sometimes be confusing. Once in a while, I got a bit lost. But most of it works really well. 7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "King Arthur learns about his wife's, Queen Guinevere, affair with Lancelot, who at the same time remains loyal to the king, particularly after Arthur's traitorous nephew Mordred commits an attempt on his life.",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1860748057",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjNkNWI2ZjQtOTk1YS00OGI0LTk5NGQtNWNjMzUyYTNkZjI2XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjNkNWI2ZjQtOTk1YS00OGI0LTk5NGQtNWNjMzUyYTNkZjI2XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-18T15:25:31.233Z",
        "url": "https://www.imdb.com/video/vi1860748057/"
    },
    "url": "/title/tt0071737/"
}