{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Wesley Eure",
            "url": "/name/nm0262374/"
        },
        {
            "@type": "Person",
            "name": "Kathy Coleman",
            "url": "/name/nm0171101/"
        },
        {
            "@type": "Person",
            "name": "Spencer Milligan",
            "url": "/name/nm0589710/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3040,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070812/"
        },
        {
            "@type": "Person",
            "name": "Allan Foshko",
            "url": "/name/nm6129385/"
        },
        {
            "@type": "Person",
            "name": "Marty Krofft",
            "url": "/name/nm0471897/"
        },
        {
            "@type": "Person",
            "name": "Sid Krofft",
            "url": "/name/nm0471898/"
        }
    ],
    "datePublished": "1974-09-07",
    "description": "A family finds themselves fighting to survive in a land populated by dinosaurs and otherworldly beings.",
    "genre": [
        "Adventure",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA3NDUyMDA1OV5BMl5BanBnXkFtZTcwNzM3NDI0Mg@@._V1_.jpg",
    "keywords": "lost civilization,dinosaur,dinosaur adventure,waterfall,earthquake",
    "name": "Land of the Lost",
    "original_info": {
        "id": "Land of the Lost: Season 1_1974",
        "name": "Land of the Lost: Season 1",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jsfmt99"
        },
        "dateCreated": "2005-01-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071005/"
        },
        "name": "Beware of the Sleestak!!",
        "reviewBody": "This was my favorite Saturday morning program by Sid and Marty Krofft\n\nOn a rafting expedition, the Marshall family (Holly, Will and father Rick) fall down a waterfall into a time portal which sent them to the Land of the Lost. The land of the lost was a prehistoric world. \n\nEach week, the Marshall family faced many challenges and shared many learning experiences in the Land of the Lost. It was a story of survival. They dodged dinosaurs and befriended Cha-Ka, who was a prehistoric simian humanoid. Cha-Ka could speak in his native language Pakuni, which was learned by the Marshall Family. It is my understanding that a Pakuni dictionary has been written for those of you who want to learn Pakuni.\n\nFor its time the special effects were very good but the acting sometimes was overkill and really fake which made me laugh just because it seemed so stupid. But then again, the actors were often acting to a blue screen and the special effects were added later.\n\nThe thing that I remember the most about this show (other than my crush for actress Kathy Coleman who played Holly Marshall) was the Sleestak. \n\nRemember the Sleestak? Those giant walking hissing lizards with those big bug eyes? A few of the Sleestak were played by professional basketball players. They really scared me as a kid and I always remembered that to get rid of them all I had to do was to touch a blue and green crystal together to create a force field. \n\nThe settings of the Land of the Lost were very imaginative and unique such as the lost city and the pylons. The background music was both a little corny but eerie too!\n\nThere were also many other memorable characters in this show including the Zarn, Enik, Ta, Sa and Malak. The Zarn was the most mysterious and scariest character in the series. The Zarn was often invisible and his presence could be heard and it sounded like wind chimes cutting through the eerie silence.\n\nYou can find more information about the show on the Land of the Lost website: www.landofthelost.com\n\nThis program had 43 episodes and ran for 3 years (1974-1977). It has been released on DVD. You can buy the DVD series on Ebay."
    },
    "url": "/title/tt0071005/"
}