{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anthony LaPaglia",
            "url": "/name/nm0001439/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey Rush",
            "url": "/name/nm0001691/"
        },
        {
            "@type": "Person",
            "name": "Rachael Blake",
            "url": "/name/nm0086697/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19862,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005370/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000915/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023514/"
        },
        {
            "@type": "Person",
            "name": "Andrew Bovell",
            "url": "/name/nm0100597/"
        }
    ],
    "datePublished": "2002-03-08",
    "description": "The relationships of four couples unravel after the discovery of a young woman's body in Lantana bush in suburban Sydney.",
    "director": [
        {
            "@type": "Person",
            "name": "Ray Lawrence",
            "url": "/name/nm0492979/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Drama",
        "Mystery",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2UwZGJjODAtYmY3OC00NzZmLTgyMzAtMDlkMWMzNjM1MjRmXkEyXkFqcGdeQXVyNzQ5MzY0NjM@._V1_.jpg",
    "keywords": "rear entry sex,adulterous wife,lust,scantily clad female,nylons",
    "name": "Lantana",
    "original_info": {
        "id": "Lantana_2001",
        "name": "Lantana",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tomsview"
        },
        "dateCreated": "2016-02-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0259393/"
        },
        "name": "Tangled and strangled",
        "reviewBody": "This is a complex drama. Although the film involves a murder, the story is more the exploration of a number of interconnected relationships.\n\nThe film starts with a woman's body lying in a lantana bush, but we don't know who it is until the end. The story builds up to that point, and centres on a quartet of families starting with Leon Zat (Anthony La Paglia), a police detective, and his wife Sonja (Kerry Armstrong).\n\n\"Lantana\", the title of the film, refers to the noxious weed that grows like crazy and eventually strangles and entangles everything else in the garden - it's the perfect metaphor for the way all the various relationships are being strangled and entangled by infidelity, deception and unhappiness.\n\nThe structure of the film is similar to Robert Altman's \"Short Cuts\" where different stories intersect at critical times.\n\nAlthough the film has a sense of mystery, I found \"Lantana\" just too serious and humourless. Unlike \"Short Cuts\", there really isn't a light touch in the whole thing. Anthony La Paglia's Leon Zat makes the characters played by Nicholas Cage seem deliriously happy by comparison. I am also wary in Australian movies of scenes set in psychiatrist's offices; it often allows the 'meaningful' dialogue to be delivered in very large chunks.\n\nAfter a while, for me at any rate, the interconnectivity - where no meeting is random - comes across as just a little too laboured. What saves \"Lantana\" is that everyone plays it low-key - the actors give the movie class.\n\nThe brilliant Barbara Hershey has competition for attention from two other women: Kerry Armstrong and Rachael Blake. Kerry Armstrong is one of the most interesting actors in Australian film and television, and she ages beautifully.\n\nThe film steps up a notch when the mystery kicks in about halfway through, and it becomes partly a police procedural.\n\n\"Lantana\" was loved up by the critics and won every Australian film award going at the time it was released. It is the sort of smart, multi-layered film that the cognoscenti could discuss at some length over lattes on Sunday morning.\n\nThe film is well made and the acting is flawless, but it seems interminably stretched out, an effect aided by the chilled out score. My main problem with \"Lantana\" is that it seems to self-consciously scream out \"How clever is my script?\" I can see the gears turning.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Th trailer",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi328335641",
        "name": "Lantana",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTlkN2ViN2EtM2EzMS00MTFlLThhMGMtYzc0OWVkZmY4YjZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTlkN2ViN2EtM2EzMS00MTFlLThhMGMtYzc0OWVkZmY4YjZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:45:31Z",
        "url": "https://www.imdb.com/video/vi328335641/"
    },
    "url": "/title/tt0259393/"
}