{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emilio Estevez",
            "url": "/name/nm0000389/"
        },
        {
            "@type": "Person",
            "name": "Bobby Edner",
            "url": "/name/nm0002810/"
        },
        {
            "@type": "Person",
            "name": "Steven Weber",
            "url": "/name/nm0001836/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 603,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023163/"
        },
        {
            "@type": "Person",
            "name": "Steven Brill",
            "url": "/name/nm0109359/"
        }
    ],
    "datePublished": "1999-06-20",
    "description": "After a fight with his wife, who's leaving him, Dan's day is getting worse by the minute. He calls an old friend for a night of binge drinking and intoxication. They start a cathartic ride through the city's underbelly.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Brill",
            "url": "/name/nm0109359/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0MDIzMzcyOF5BMl5BanBnXkFtZTYwODQ4MDc5._V1_.jpg",
    "keywords": "night,binge drinking,undercover cop,transvestite,stripper",
    "name": "Late Last Night",
    "original_info": {
        "id": "Late Last Night_1999",
        "name": "Late Last Night",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "damacus"
        },
        "dateCreated": "2002-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0167250/"
        },
        "name": "\"Compare and Contrast\" taken to the limits.",
        "reviewBody": "Late Last Night is an insane movie. I rented it looking for a fresh movie that I hadn't seen before.. the cover looked played out, but light; unlike some of the more dramatic movies I'd seen lately. \n\nI needed a change.. and a change I got.\n\nWhen Dan comes out of the door at the start.. his face, and his breathing.. really intense.. I could just feel his mix of anger, pain and shock. I started waiting for something to happen.. anything.. finally, he walks off, kicks over his lawn decor and walks off, while some happy music plays -- the music was so off-colour that I could tell I was in for a strange ride..\n\nStrange indeed.. as soon as he gets out of his lawn, a small kid nearly runs him over on a three-wheeler.. Dan seems to pause as he thinks about the kid.... about how he had maybe thought of having his own with the girl who is now leaving him... There are a lot of these \"What-If\" flashbacks throughout the movie that you start to catch on to.\n\nAfter several walk-ins with self-important police and such, he lands himself at a bar.. meets some drunks who just aren't matching his mindset, and driving him mad with their drunken antics, causing him to ditch the bar to call a friend.. someone. He eventually reaches Jeff.. .apparently a very last resort, as he has tried to call his parents before this Jeff person.\n\nJeff is wild, Jeff is crazy... Smokes pot, pops pills, drinks like a madman, pays whores with coke and \"borrows\" cars. He's the black of Dan's white. \n\nDan is close to getting laid several times in the movie but mostly falls short.. on his own, or because of insane circumstances. I found the movie ironic, hilarious, aggravating, inspiring, sad, happy.. anything but dull and boring. There's this huge theme of 70s music throughout the show that I didn't quite understand.. but it was very coloured.\n\nOne unforgettable moment is when Dan, still high and on other drugs and alcohol, is in the back of a cop car.. after the cops joke around about beating him senseless, they tell Dan they're kidding and he both laughs and screams in angst -- isn't that indicative of life sometimes?\n\nI highly (HIGHly) recommend watching it.. once while wasted,once while clean. It will open your eyes and massage your senses.\n\nDamacus.. 10 of 10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sterling Home Entertainment",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1267859737",
        "name": "Late Last Night",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGJjMjE5ODMtNmMyYy00MmM1LTkxZGItZmI5YzEwNDZhYjlmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGJjMjE5ODMtNmMyYy00MmM1LTkxZGItZmI5YzEwNDZhYjlmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:46:23Z",
        "url": "https://www.imdb.com/video/vi1267859737/"
    },
    "url": "/title/tt0167250/"
}