{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frances McDormand",
            "url": "/name/nm0000531/"
        },
        {
            "@type": "Person",
            "name": "Alessandro Nivola",
            "url": "/name/nm0005273/"
        },
        {
            "@type": "Person",
            "name": "Christian Bale",
            "url": "/name/nm0000288/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17120,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014453/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007554/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011355/"
        },
        {
            "@type": "Person",
            "name": "Lisa Cholodenko",
            "url": "/name/nm0158966/"
        }
    ],
    "datePublished": "2003-03-28",
    "description": "When an uptight young man and his fiancée move into his libertine mother's house, the resulting clash of life attitudes shakes everyone up.",
    "director": [
        {
            "@type": "Person",
            "name": "Lisa Cholodenko",
            "url": "/name/nm0158966/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgxMjMxMDA2Ml5BMl5BanBnXkFtZTYwMjE5MTI3._V1_.jpg",
    "keywords": "boyfriend girlfriend relationship,united states of america,one male two females threesome,rock 'n' roll,f rated",
    "name": "Laurel Canyon",
    "original_info": {
        "id": "Laurel & Hardy & Friends_1938",
        "name": "Laurel & Hardy & Friends",
        "year": "1938"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ilovedolby"
        },
        "dateCreated": "2003-06-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0298408/"
        },
        "name": "A well-made character study, `Laurel Canyon,' explores the reasons for the distress and resentment that can reside between parents and their children.",
        "reviewBody": "People are often disappointed in the ones that love them or the ones that they love. This disappointment can stem from the mistakes made by parents in the upbringing of their children, or perhaps the simple differences that separate family members. It is this frustration that plagues Christian Bale's character, Sam, in the film `Laurel Canyon.' A well-made character study, `Laurel Canyon,' explores the reasons for the distress and resentment that can reside between parents and their children. \t`Laurel Canyon' is about a man named Sam (Bale) and his fiancé Alex (Kate Bekinsale) who move to California so he can begin his medical residency at a local hospital and she can finish her dissertation. The pair moves in with Sam's mom Jane (Frances McDormand) who is record producer who lives on Laurel Canyon Road in Hollywood. Although she is in her mid 40s, she lives the life of a rock star, smoking pot, drinking, partying, and hanging out with her rock star boyfriend Ian (Alessandro Nivola), who is 16 years younger than she. Sam and Jane are always at odds with each other as he is ultraconservative and Jane is like a teenager. The two must weed out their problems and come to terms with each other about the mistakes that Jane made while bringing up Sam. \tAlthough a bit slow at times, `Laurel Canyon' was an interesting film that has its lighthearted and touching moments. It's funny to watch the subtle changes that begin in the characters lives. Alex, although conservative like Sam, is slowly being drawn into the free spirited world of Jane's home, with her parties and rock friends always around. Sam is being tempted by the fruit of another woman named Sara (Natascha McElhone), as their share their sexual desires with each other over private conversations in a car. And even Jane is beginning to recognize her own faults-she had several lovers throughout her life is starting to feel the need to settle on just one, Ian. Every character starts to understand that they are all the extreme end of different spectrums and they must learn to meet somewhere in the middle. \tThe acting in the film was excellent. Every actor was believable and to a certain extent, the audience can feel their pain and happiness. McDormand (`Fargo') and Bale (`Empire of The Sun') steal the show with their amazing abilities to transcend the characters in the script to the dynamic people they present on the screen. Praise must also be given to Bekinsale (`Pearl Harbor') and Nivola (`Jurassic Park 3') for their exceptional performances.\n\n\tOne other superior quality of `Laurel Canyon' was the music, some of which was sung by Nivola. The soundtrack holds a great deal of classic rock songs from groups such as `Steely Dan,' `Leroy' and `Mercury Rev.'\n\n\tOverall, `Laurel Canyon' was a very good movie that reminds its audience to look beyond the surface of things and to see what really matters in all relationships-love. ***",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Sony Pictures Classics",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2039611673",
        "name": "Laurel Canyon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWU0OGViZDgtNmI3Yy00NjhhLWI1YzUtNWZjYmU3MzI2MjcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWU0OGViZDgtNmI3Yy00NjhhLWI1YzUtNWZjYmU3MzI2MjcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:46:32Z",
        "url": "https://www.imdb.com/video/vi2039611673/"
    },
    "url": "/title/tt0298408/"
}