{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Douglas Henshall",
            "url": "/name/nm0378112/"
        },
        {
            "@type": "Person",
            "name": "Tom Hollander",
            "url": "/name/nm0390903/"
        },
        {
            "@type": "Person",
            "name": "Bill Nighy",
            "url": "/name/nm0631490/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1409,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001270/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059198/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104092/"
        },
        {
            "@type": "Person",
            "name": "Neil Hunter",
            "url": "/name/nm0402980/"
        },
        {
            "@type": "Person",
            "name": "Tom Hunsinger",
            "url": "/name/nm0402317/"
        }
    ],
    "datePublished": "2002-06-28",
    "description": "Three intersecting stories about people whose lives are affected by the death of a gay restaurateur.",
    "director": [
        {
            "@type": "Person",
            "name": "Tom Hunsinger",
            "url": "/name/nm0402317/"
        },
        {
            "@type": "Person",
            "name": "Neil Hunter",
            "url": "/name/nm0402980/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWRkMjRhMGYtMGNiMS00YTkwLWIyYzEtOGE2N2IyNTJkNmI3XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "female frontal nudity,unfaithfulness,adultery,female nudity,death",
    "name": "Lawless Heart",
    "original_info": {
        "id": "Lawless Heart_2001",
        "name": "Lawless Heart",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bandw"
        },
        "dateCreated": "2006-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0276276/"
        },
        "name": "Thrice-told tale",
        "reviewBody": "This movie tells the same story from the viewpoint of three different people. The stories are presented in sequence and cover the same time span - the three characters are together in the first scene as well as several days later in the final scene. The event that brings them together in the first scene is the funeral reception for a man who was the brother-in-law of Dan (Bill Nighy), the lover of Nick (Tom Hollander), and the cousin and friend of Tim (Douglas Henshall). The plot structure is clever and works well. One of the challenges in telling a story in this manner that is effectively dealt with is to strike a balance in how much the characters interact - too little and the movie becomes three separate stories; too much and all the characters, as well as the viewers, know the whole story and there are no surprises. This plot structure is distinctly different from those of \"Rashomon,\" where each character relates the same story with personal embellishments, or \"Pulp Fiction,\" where the stories are only loosely intersecting and the time sequencing is not linear, or movies like \"Lantana,\" which effectively utilizes flashbacks and interactions in real time among an ensemble of unrelated characters.\n\nWith each succeeding scene in each story we fill in pieces of the puzzle. The curious way people behave in one story is understood in a later story. For example, when Tim throws a party and invites a woman with whom he has just been enamored, she shows up only to hide behind a wall and ultimately escape the party by climbing over a fence. Tim is hard pressed to interpret this peculiar behavior and Dan, who witnesses the escape from outside the house, is mystified. How odd we think, but later we learn that a recent ex-lover of hers is there and she does not want an encounter with him. \n\nWe are made to think about how each of us sees only a small piece of the big picture. Each personal human encounter is the intersection of two worlds, the complex histories of which are fully known only by the individuals. People behave in ways that we find difficult to comprehend, but, in almost all situations, if we were to know the personal motivations and the full story, all would be understood. \n\nTo a great extent, the dialog carries the movie. When Dan is approached by an interested woman, Corrine, at the funeral reception and she asks him if he is depressed, he says, \"How would I know?\"\n\nWhile the movie hangs together on first viewing, I found a second viewing to be rewarding. You pick up on a lot of things that would easily be missed on first viewing, like when Corrine invites Dan to dinner while checking out at the grocery store the cashier is a woman with whom Nick becomes involved.\n\nThe acting is polished and the multitude of songs on the soundtrack seem to have been chosen with care and they augment the story. It was uncharitable not to credit the Schubert piano trio that so effectively set the mood at the beginning and the end (Trio in E flat, Op. 100 D.929).\n\nAltogether an engaging and skillful piece of film-making.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from First Look",
        "duration": "PT2M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2912223513",
        "name": "Lawless Heart",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDEwOTRhMmUtOWYwMS00OTdmLWFkZTUtYzI4ZTQ0NDA5ZDBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDEwOTRhMmUtOWYwMS00OTdmLWFkZTUtYzI4ZTQ0NDA5ZDBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:58:43Z",
        "url": "https://www.imdb.com/video/vi2912223513/"
    },
    "url": "/title/tt0276276/"
}