{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sam Rockwell",
            "url": "/name/nm0005377/"
        },
        {
            "@type": "Person",
            "name": "Kathleen Quinlan",
            "url": "/name/nm0000599/"
        },
        {
            "@type": "Person",
            "name": "Mischa Barton",
            "url": "/name/nm0059215/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8274,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021421/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054201/"
        },
        {
            "@type": "Person",
            "name": "Naomi Wallace",
            "url": "/name/nm0908799/"
        }
    ],
    "datePublished": "1998-05-15",
    "description": "When Devon, a 10-year-old girl, forges a friendship with Trent, a 21-year-old outsider who mows the neighborhood lawns, things suddenly get very complicated and private.",
    "director": [
        {
            "@type": "Person",
            "name": "John Duigan",
            "url": "/name/nm0241090/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTFkMTBlYzMtYjI3Ni00NjYzLWE5ZTktZWM0NTE3MTA2NzFhXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "infidelity,adultery,hole in shirt,chasing an animal,dog attack",
    "name": "Lawn Dogs",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Siskbert"
        },
        "dateCreated": "1999-04-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119506/"
        },
        "name": "Fairy-Tale Inspiration",
        "reviewBody": "I am baptized in the blood, `bathtubs full,' of wild dogs, chicken dinners, and a little fairy princess. Last night I viewed \"Lawn Dogs\" for the second time in 5 days. I just couldn't return the tape without another look-see, even if it makes Block Buster $2 richer and me $2 poorer, for the awareness and inspiration this fairy-tale masterpiece has imbued me with are priceless. Like Trent in the film, I am alive with the hope that flight from any kind of poverty, financial or spiritual, is possible.\n\nOn the surface, the story seems to revolve around the relationship between a young man, Trent, and a little girl, Devon, and between the two struggling economic classes that they come from. But the magical cinematography throughout the film, and more than that, Devon's running fairy-tale narration, allude to a deeper meaning in the film that is revealed absolutely in the last five minutes. After all, there is nothing in the world around us that is not represented by symbols within us, and how can we tell whether the inner symbols we deal with represent things outside us, or things within us? It is natural for the world to discourage a relationship between a sexually-active male, and a prepubescent, vulnerable, hungry-for-friends female. It is also natural for the world to discourage an individual from relating to the power within himself, perhaps represented by said young female, to imagine and pursue a better life for himself, when it means he will flee the status quo that makes the rest of the world comfortable.\n\nThe setting is a highly artificial, unabashedly bourgeois, gated community in Kentucky, `Camelot Gardens' (see, we're already alluding to fairy tales), and the surrounding countryside, wherein Trent lives in a trailer, making, what can loosely be called, a \"living\" by mowing the lawns of the rich in Camelot Gardens. The two heroes first meet when Devon happens upon Trent's trailer while wandering into the woods to sell cookies (her capitalist parents' idea), reciting to herself a version of the Russian fairy-tale about the contest between a little girl, like herself, and the witch named `Baba Yaga.' She continues her relationship with the at-first-reluctant Trent, as he continues to mow her parents' lawn. Whom she identifies Baba Yaga with, that is, who is evil in the world, evolves with the story. In the end, she realizes where the true evil lies, and uses the magic charms of her youthful idealism to aid the flight of the oppressed.\n\nI really enjoyed this film. It not only inspires hope, but also possesses a depth sorely lacking in the majority of American films. Much of the symbolism in the story seems to be lifted directly from classical mythology: From the open nakedness of both heroes in the beginning, a necessary reduction of the self to its bare essentials before it can be remade into something new, Trent holding up traffic to dive naked from a one-lane bridge into the local river, a kind of spectacular baptism into a new beginning, and Devon removing her nightgown to bay from her rooftop, like some essential mythic beast imploring the gods of night; to the adorning, i.e. honoring, of the tree outside the door of Trent's trailer, the Sacred Tree, Ygdrasil, the Tree of Life, so honoring life itself, and the demands that life makes of us; to the maenadic frenzy of the dancing chicken feet, a maddening after-chicken-death/chicken-dinner dithyramb; to Trent's conquest over the infernal hound, a Doberman named `Tracker,' who guards the homes of Camelot Gardens, and perhaps guards as well the path to personal power, the hound who, like Cerberus, turns away all cowards (chickens) from the inner realms; to the magic towel and comb of divine deliverance (more on these two symbols below) at the end; the story is full of age-old symbols that affect us deeply, transforming us or renewing us, without our knowing how.\n\nThe following passage is taken from Marie-Louise von Franz's `Interpretation of Fairy Tales.' It will help the reader to understand the meaning of the magic comb and towel. (In von Franz's story, a red handkerchief substitutes for the towel.)\n\nSays von Franz:\n\nThe girl runs, throwing her magic comb and her red handkerchief behind her. Bestrewing one's trail with objects is characteristic of the magic flight. This act of throwing away things of value is a sacrifice; one throws things over one's shoulder to the dead, or to spirits, or to the devil, to propitiate those whom we dare not face. It may seem panicky to abandon valuable possessions when one is escaping, but one who stiffens himself into a defensive attitude is easily cut down by an assailant stronger than himself, whereas stripping oneself gives mobility. There are situations in which one absolutely has to give up wanting anything, and in this way one slips out from under; one is not there any longer, so nothing more can go wrong. When one is confronted by a hopelessly wrong situation, one must just make a drastic leap to the bottom of passive simplicity, and from there one can live it out.\n\nWhat is more, the objects which have been sacrificed generally transform themselves into obstacles for the pursuer. The comb at once turns into a forest and becomes a part of nature  the hair of mother earth. Its transformation into a natural object suggests that originally it was an integral part of nature. Actually, there is no thought or instrument or object that has not originated from nature; that is, from the unconscious psyche. One sacrifices to the unconscious what once was wrested from it.\n\nThe comb is used to arrange and confine the hair. Hair is a source of magic power or mana. Ringlets of hair, preserved as keepsakes, are believed to connect one individual with another over a distance. Cutting the hair and sacrificing it often means submission to a new collective state  a giving up and a rebirth. The coiffure is frequently an expression of a cultural Weltanschauung. Primitive folk tales speak of demons being deloused and combed when they are caught, which means that the confusion in the unconscious has to be straightened out, ordered, and made conscious. Because of this meaning, hair in wild disarray is often dreamed of at the start of an analysis. The comb, therefore, represents a capacity for making one's thoughts ordered, clear, and conscious.\n\nThe red handkerchief that the girl gives up becomes a flame soaring from earth to heaven. To abandon the staff and comb meant not attempting to marshal herself or to think out a plan. Now the flame indicates that she puts an inner distance between herself and her feelings and emotions. She is reduced to a passive simplicity.\n\nIn the tale, the gaping jaws devour the forest and spit water on the flame. Water and fire battle in the unconscious, and in the meantime the girl escapes between the opposites."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Trimark",
        "duration": "PT2M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2460614937",
        "name": "Lawn Dogs",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjkxZDBkMGMtNGZmMS00NjliLTk3YmItNWM3MzlhMTZiOTIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjkxZDBkMGMtNGZmMS00NjliLTk3YmItNWM3MzlhMTZiOTIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:18:19Z",
        "url": "https://www.imdb.com/video/vi2460614937/"
    },
    "url": "/title/tt0119506/"
}