{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Maloney",
            "url": "/name/nm0540585/"
        },
        {
            "@type": "Person",
            "name": "George Pagliero",
            "url": "/name/nm1493826/"
        },
        {
            "@type": "Person",
            "name": "Nadim Sawalha",
            "url": "/name/nm0768022/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 111,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103830/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068734/"
        },
        {
            "@type": "Person",
            "name": "James Hawes",
            "url": "/name/nm0369949/"
        }
    ],
    "datePublished": "2003-10-22",
    "director": [
        {
            "@type": "Person",
            "name": "James Hawes",
            "url": "/name/nm0369949/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5MzMwNDM5N15BMl5BanBnXkFtZTcwMTUxMTAyMQ@@._V1_.jpg",
    "keywords": "world war one,middle east,arabia",
    "name": "Lawrence of Arabia: The Battle for the Arab World",
    "original_info": {
        "id": "Lawrence of Arabia: The Battle for the Arab World_2003",
        "name": "Lawrence of Arabia: The Battle for the Arab World",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2012-05-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0384277/"
        },
        "name": "A great insight into much of the distrust of the West as well as into a most unusual man.",
        "reviewBody": "While the movie \"Lawrence of Arabia\" is no doubt a great film, there is much to the story that simply isn't told in this David Lean epic. Because of this, I urge you to try getting a hold of this PBS documentary--as it gives wonderful insight into Lawrence, his mission and the Middle East.\n\nThe first thing I noticed in this wonderful documentary is that the real T.E. Lawrence really was quite different from Peter O'Toole (from the movie), as he was a tiny man of only 5'5\"! He also was a bit confusing, as some things about him were very secret--such as his sex life, his possible penchant for beatings and what his life was like between the end of WWI and his death. It's not addressed at all in the movie (even though he died 17 years later), but at least in the documentary you learn about his odd tortured existence--where he worked very hard NOT to be noticed. He was evidently sick of the limelight and possibly ruined by his country's response to promises of Arab independence. And this brings me to by far the most interesting thing about this PBS show--how the British and French betrayal of their Arab allies actually has done much to make the Arab world distrust the West today. I am not excusing terrorism, but I could certainly see how if this had all been handled better by the Western world, then peace and perhaps even appreciation COULD be the norm today. Overall, unlike most documentaries, this one makes you really think and wonder 'what would have happened IF'--something that makes the show more interesting to history lovers. Well worth seeing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0384277/"
}