{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel Craig",
            "url": "/name/nm0185819/"
        },
        {
            "@type": "Person",
            "name": "Sienna Miller",
            "url": "/name/nm1092227/"
        },
        {
            "@type": "Person",
            "name": "Michael Gambon",
            "url": "/name/nm0002091/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 186858,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014453/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0165404/"
        },
        {
            "@type": "Person",
            "name": "J.J. Connolly",
            "url": "/name/nm1129753/"
        }
    ],
    "datePublished": "2005-06-03",
    "description": "A successful cocaine dealer gets two tough assignments from his boss on the eve of his planned early retirement.",
    "director": [
        {
            "@type": "Person",
            "name": "Matthew Vaughn",
            "url": "/name/nm0891216/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI5MTE1OTAzOV5BMl5BanBnXkFtZTcwNDc2OTgyMQ@@._V1_.jpg",
    "keywords": "nipples visible through clothing,panties,drug lord,peep show,no panties",
    "name": "Layer Cake",
    "original_info": {
        "id": "Layer Cake_2004",
        "name": "Layer Cake",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-10-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0375912/"
        },
        "name": "The serious telling of a complex story is a nice change for this genre in the UK but the delivery is a little messy and the narrative doesn't work as well as it really should",
        "reviewBody": "We join the story in the hands of our narrator who is making a nice little earner packing cocaine with friends acting as middlemen to keep him out of the way of the users, the wannabe gangsters and the bosses. However when he is invited to meet Jimmy the boss, he is given two jobs  handling a shipment of pills brought in by the Duke and also finding the daughter of Jimmy's boss Eddie. Even though he wants to stay away from the sharp end, he takes the jobs and tries to deal with the Duke and his crew of Chavs. However whenever it becomes apparent that the Duke has stolen the pills and is leaving a trail of bodies behind him, he realises he is in over his head and that the jobs are not what he thought they were. \n\nThe trailer was awful but the reviews were mostly good so I decided to give it a stab even though I generally don't get the appeal of these geezer gangster comedies and all their copies. I was rather relived to find that this film was much straighter than the others that had come to revel in violence and swearing in favour of plot, but this is not to say that it is a great film just because it is different. It has a good story at its core but it isn't delivered very well and at times is just a bit too messy with too much going on. The complexity of the story is not a problem it is more a matter of it not all coming together as well as it should have done. Side issues dilute the main thrust (although they are necessary for the bigger plot) and they take away from the tension and urgency of the whole story. It still engages though but at times it feels unsure of itself and will occasionally feel a little long  fans expecting Lock Stock will be trying to laugh (as they were in the audience I was in) as they try to work out why it isn't funnier, while those looking for a more traditional gangster film will wish it would lose the modern style a bit, tighter the plot and make it more focused.\n\nThe cast was a surprise to me because I happened to have seen The Football Factory the other night and a great deal of them were in and around the support cast here. Craig is a very attractive man and he has good presence on the screen, but he finds his character difficult (heck, he doesn't even have a name) to read. He is cool but I would have liked more to him than the usual old 'getting out from under' stuff. Support is so-so from everyone else, they all just more or less fall into the tried and tested stereotypes  'f*ck-rough chav', 'cool boss man', 'brutal middlemen' and so on. Gambon, Fletcher, Hassan, Foreman, Healy, all of these and the others are all fine but none of them really make much of an impression. The film is directed with restraint in comparison to Snatch and the like and I did like the way that Vaughn didn't just go for the empty style but rather directed pretty well.\n\nOverall this was better than I expected but then I didn't expect much from it. The story is good but not that well delivered and often comes across as being a bit messy and hard to totally get into but it is still OK. As a British gangster film it is good and happily just not another Lock Stock clone trying to cash in, but it doesn't totally have its own voice. Worth seeing for what it is but just don't expect too much."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2510946585",
        "name": "Layer Cake",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGE2NmQ5NmMtZDdiYS00ZjE0LTkwZDgtNWZhZWFhYmVkNGIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGE2NmQ5NmMtZDdiYS00ZjE0LTkwZDgtNWZhZWFhYmVkNGIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:18:21Z",
        "url": "https://www.imdb.com/video/vi2510946585/"
    },
    "url": "/title/tt0375912/"
}