{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Annabella",
            "url": "/name/nm0030246/"
        },
        {
            "@type": "Person",
            "name": "René Lefèvre",
            "url": "/name/nm0499151/"
        },
        {
            "@type": "Person",
            "name": "Jean-Louis Allibert",
            "url": "/name/nm0021342/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3663,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Le Million",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012482/"
        },
        {
            "@type": "Person",
            "name": "Georges Berr",
            "url": "/name/nm0077278/"
        },
        {
            "@type": "Person",
            "name": "Marcel Guillemaud",
            "url": "/name/nm0347058/"
        },
        {
            "@type": "Person",
            "name": "René Clair",
            "url": "/name/nm0163229/"
        }
    ],
    "datePublished": "1931-02-04",
    "description": "An impoverished painter and his rival engage in a race across Paris to recover a jacket concealing a winning lottery ticket.",
    "director": [
        {
            "@type": "Person",
            "name": "René Clair",
            "url": "/name/nm0163229/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA1MTA3NjI3M15BMl5BanBnXkFtZTcwNTA3OTMyMQ@@._V1_.jpg",
    "keywords": "betrayal by a friend,france,co written by director,financial crisis,told in flashback",
    "name": "Le million",
    "original_info": {
        "id": "Le Million_1931",
        "name": "Le Million",
        "year": "1931"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zetes"
        },
        "dateCreated": "2000-06-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0022150/"
        },
        "name": "Very satisfying light entertainment",
        "reviewBody": "I have lately got into the habit of purchasing any interesting DVD that the Criterion company releases. I figure that even if I dislike the movie, Criterion usually supplies enough extra material to compensate for any shortcomings in the actual film. I read up on them, and I buy the ones which are the most interesting to me.\n\nLe Million is my latest purchase, and I must say that I was not disappointed in the film. It is cheery, funny, and romantic. Everything about it is quite excellent. The songs are wonderful. If I understood French, I would probably hum them and sing them all day long. The acting is very good for this kind of movie. American musicals of the classic Hollywood era relied more on song and dance than the actual characters and story, but in Le Million, the characters are rather well developed and the story, while not being anything extremely impressive, is not at all lacking. I loved the developments of the relationships, especially the relationship between the once best friends Michel and Prosper. The romantic moments are also very well developed. The direction is nearly perfect, with several very memorable moments. Probably the single most perfect scene of the film occurs right after the lead couple has an argument. They hide on the stage of an opera performance, and the opera singers sing lines which the couple, Michel and Beatrice, interpret to their own situation. This is definitely one of the high points in cinema history. The scene managed to make me laugh, to win me over with a very sweet romance, and make me smirk at just how clever the director was. I give this film a 9/10.\n\nP.S. - Some information for anyone who has the same faith in Criterion that I do and is planning to buy it. Amongst the Criterion discs I now own, Le Million contains the fewest features. All it has is a photo gallery (not all that useful; one might flip through it once) and a rare television interview with Rene Clair, the director. This piece is of some interest. He was one of the many directors who had started out in silent film, and when talkies were first appearing, he said that they represented the death of film. I think most film-savvy people understand what these directors meant when they said that, but it is interesting to hear him explain it. Also, if you have read the description of this movie on Amazon.com, please note that they were wrong in one important respect: not every line in the film is sung. In fact, it contains no more songs than a regular musical. It is actually a lot more like a Chaplin or Buster Keaton or Marx Brothers film. My criticisms of the disc are not that important. Heck, Criterion has the right to smack me around for making those complaints. The fact is, their people probably spent hundreds of hours fixing up a film which only 20 (now 21!) people have voted for on imdb, and only about a hundred people, if that, will ever see the film. Heck, if you look at the Criterion web site, Le Million is nowhere to be found. I have no clue why not. It's something they should really be proud of (of course, their web site is surprisingly horrible). They did a fine job on this film. Bravo! They deserve all the money I can stand to give them!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0022150/"
}