{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "André Bervil",
            "url": "/name/nm0078514/"
        },
        {
            "@type": "Person",
            "name": "Jean Keraudy",
            "url": "/name/nm0449191/"
        },
        {
            "@type": "Person",
            "name": "Michel Constantin",
            "url": "/name/nm0176039/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18895,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "alternateName": "Le Trou",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010228/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005573/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032224/"
        },
        {
            "@type": "Person",
            "name": "José Giovanni",
            "url": "/name/nm0320510/"
        },
        {
            "@type": "Person",
            "name": "Jacques Becker",
            "url": "/name/nm0065442/"
        },
        {
            "@type": "Person",
            "name": "Jean Aurel",
            "url": "/name/nm0042159/"
        }
    ],
    "datePublished": "1997-02-14",
    "description": "Distrust and uncertainty arise when four long-term inmates cautiously induct a new prisoner into their elaborate prison-break scheme.",
    "director": [
        {
            "@type": "Person",
            "name": "Jacques Becker",
            "url": "/name/nm0065442/"
        }
    ],
    "duration": "PT2H11M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzg1ZWQxZDMtYjBhMC00OTNhLWJiNGYtMGFiNDQ4NzQ4NjVlXkEyXkFqcGdeQXVyNTA1NjYyMDk@._V1_.jpg",
    "keywords": "escape from prison,prison warden,digging,corridor,jail cell",
    "name": "Le trou",
    "original_info": {
        "id": "Le Trou_1960",
        "name": "Le Trou",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "muddlyjames"
        },
        "dateCreated": "2002-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054407/"
        },
        "name": "God is in the details.",
        "reviewBody": "This most powerful of escape stories is a wonderful exposition of the most basic human qualities, ingenuity and cooperation, and the innate drive toward freedom that brings these qualities into being.\n\nWhile the theme of transcendence is certainly present (although not be-labored) as in A MAN ESCAPED, it is interesting that, in direct contrast to Bresson's work, transcendence is here achieved through work WITH others on a task. The inmates form a unique brotherhood through their joint reliance. This allows them to be IN the prison while not OF it and is quietly visible from the early moments of the film. We see this group bond deepened through each risk taken, each chisel blow against a concrete wall, and we become emotionally tied to the characters' quest simply through observing their effort (it is amazing how dramatic hammering away at a concrete wall can be). No verbal exposition is necessary, no creation of characters and their pasts intrudes to distract us from their task, which IS the drama.\n\nIndeed Becker's film is as notable for what is left out as for what is included. There are no prison \"types\" created, his style is restrained to the point of being transparent, not to the point of calling attention to itself as \"bare\" or \"ascetic\" as Bresson's is. We get no exposition of the horrors of prison life; just enough detailing of the regimentation, drabness of environment, and lack of personal space to make us aware of the institution's suffocating presence. There are no sudden surprises or plot shifts. Well, maybe one. The shot in the mirror near the end of the film is so surprising that I literally couldn't take it in for a few seconds, I thought it had to be a dream: that's how involved with the characters I was! Finally, there is no use of music to pump up the suspense. There IS, however, a powerful and unique use of sound. We hear, in an almost hallucinatory fashion, every thump, clang, and wail within the prison walls and, during the digging scenes, Becker apparently uses a dual soundtrack combining naturalistic sound with heightened effects of the digger's grunts, heavy breathing, and THUMPS of metal against rock. Again this serves to effectively involve us with physical/emotional effort of their task. The cacophony the end of the film harshly accents our sense of disturbance and loss.\n\nIt is also worth noting that the apparent \"innocent\" in the film is the only one who does not achieve transcendence. While he may legitimately gain his freedom, he remains locked within the bounds of his own ego (\"poor Pierre\" says the leader of the break). Another interesting contrast (reply?) to Bresson.\n\nAltogether a powerful statement that humans at work can be intrinsically dramatic subject matter, that the most simple of subjects can be the most visually entrancing (and emotionally resonant) and a grand illustration of the maxim that \"God (and/or art) is in the details\". 10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Le Trou",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1088207385",
        "name": "Le Trou",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTI4YmU1ZjctOWFjYi00MTQ3LThhYjMtNGQyNGJiN2JjMjRkXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTI4YmU1ZjctOWFjYi00MTQ3LThhYjMtNGQyNGJiN2JjMjRkXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-12-04T17:18:24.382Z",
        "url": "https://www.imdb.com/video/vi1088207385/"
    },
    "url": "/title/tt0054407/"
}