{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kate Hodge",
            "url": "/name/nm0388082/"
        },
        {
            "@type": "Person",
            "name": "Ken Foree",
            "url": "/name/nm0286010/"
        },
        {
            "@type": "Person",
            "name": "R.A. Mihailoff",
            "url": "/name/nm0586133/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17794,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005022/"
        },
        {
            "@type": "Person",
            "name": "Kim Henkel",
            "url": "/name/nm0377066/"
        },
        {
            "@type": "Person",
            "name": "Tobe Hooper",
            "url": "/name/nm0001361/"
        },
        {
            "@type": "Person",
            "name": "David J. Schow",
            "url": "/name/nm0775017/"
        }
    ],
    "datePublished": "1990-01-12",
    "description": "A California couple and a survivalist encounter Leatherface and his family.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeff Burr",
            "url": "/name/nm0123009/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmFhMjlkOTctNWU2MC00YmQzLWJmYWMtZTUyNzM4YTU4ODRhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "gas station,shotgun,survivalist,leatherface,gas station attendant",
    "name": "Leatherface: Texas Chainsaw Massacre III",
    "original_info": {
        "id": "Leatherface: The Texas Chainsaw Massacre III_1990",
        "name": "Leatherface: The Texas Chainsaw Massacre III",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2006-07-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099994/"
        },
        "name": "Family values and road kill.",
        "reviewBody": "A young couple are driving from L.A. to Florida, but when they stop off at a gas station they encounter a crazy attendant with a shotgun. Then they are lured off the main road and take a deserted track that leads them to Leatherface and his cannibalistic family. Now the pairs' only chance of escaping this demented nightmare rests on a well-prepared survivalist, who they had a car accident with and which has left them at Leatherface's mercy.\n\nWell, that just seemed to breeze by with very little impact, but I found \"Leatherface: The Texas Chainsaw Massacre\" to be rather nasty piece of work that's an exceptionally well-made production. Sure, it's not very explicit because of the MPAA cuts leaving a lot of the real gruel up in the air and causing large continuity shifts in the story. But these factors didn't stop me from mildly enjoying this torturous outing that seems to skip the events that followed on in Hooper's outrageously jokey sequel \"The Texas Chainsaw Massacre 2\".\n\nIt kind of starts off like the original film by providing a voice over dude giving their own interpretation of what had happened after the first flick and there are scenarios that have that rehash feeling about them. Replacing the goofiness of the last feature is a more serious approach that has some dark macabre wit within the script and some crazy antics. There's even a new gimmick involving Leatherface's glistening new chainsaw! Which is the most frightening item you can ever think of, although it would have been great it he got to use it on someone! The problem with the flick was that it looks too clean and really lacks that iron-fisted and repellently grimy nature, because it never gets truly dirty and that ending is totally out-of-place. Again it might look polished, but there is still a ruthlessly unflinching edge about its shocks, but the thing is they are just far from disturbing and lose that subtle realism. Despite all that it efficiently creates an isolated feeling amongst the sticks, the photography is well displayed and an atmospherically Gothic score amplifies a tight knit awe to proceedings. Although it probably could have done without those instrumental, heavy metal cues.\n\nThe short story is draped with many activities (some rather vague) and characters that come from nowhere and disappear and then reappear. It might be basic, senseless and foreseeable material, but really there was only one thing that got to me and they were the unexplained details and one or two illogical moments. Like Leatherface's new clan and that of Ken Foree's character. The performances were ho-hum, but it's the fun supporting roles by Viggo Mortensen as the subtle one minute to nut-job the next and legendary horror figure Ken Foree as the likable survivalist make it even more enjoyable. Kate Hodge is okay in the lead role as one of Leatherface's prey and R.A.Mihailoff steps up to the plate as Leatherface and does fair job at it and brings back some of that fear associated with that icon. Although anyone accustomed to the original knows no one gets near Gunnar Hansen performance! \n\nIt's certainly not a great film and does lack the heart of the earlier efforts, but still I didn't mind it and it goes by quick enough if caught in the right mindset.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Home Entertainment",
        "duration": "PT1M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2158625049",
        "name": "Leatherface: Texas Chainsaw Massacre 3",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDNlOWU5MjYtMjAwYy00ZWUyLTgzNWYtZGIwOTViZDczYTllXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDNlOWU5MjYtMjAwYy00ZWUyLTgzNWYtZGIwOTViZDczYTllXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:18:28Z",
        "url": "https://www.imdb.com/video/vi2158625049/"
    },
    "url": "/title/tt0099994/"
}