{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nicolas Cage",
            "url": "/name/nm0000115/"
        },
        {
            "@type": "Person",
            "name": "Elisabeth Shue",
            "url": "/name/nm0000223/"
        },
        {
            "@type": "Person",
            "name": "Julian Sands",
            "url": "/name/nm0001696/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 127984,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0122581/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068828/"
        },
        {
            "@type": "Person",
            "name": "John O'Brien",
            "url": "/name/nm3840714/"
        },
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "datePublished": "1996-02-09",
    "description": "Ben Sanderson, a Hollywood screenwriter who lost everything because of his alcoholism, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDg3MDM5NTI0MF5BMl5BanBnXkFtZTcwNDY0NDk0NA@@._V1_.jpg",
    "keywords": "alcoholism,alcoholic,prostitute,falling in love with a prostitute,based on novel",
    "name": "Leaving Las Vegas",
    "original_info": {
        "id": "Leaving Las Vegas_1995",
        "name": "Leaving Las Vegas",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hlcepeda"
        },
        "dateCreated": "2004-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113627/"
        },
        "name": "Viva Greek Tragedies",
        "reviewBody": "Not unlike John Huston's Under The Volcano, Leaving Las Vegas borrows from Greek mythology, obliquely mirroring the tragedy and pathos of Orpheus' failed attempt to rescue his dead wife, Eurydice, from Hades. Mike Figgis obliges us with a helpful hint in the scene where Nicolas Cage gives Elizabeth Shue a present of earrings: Greek cameos.\n\nAs in the ancient tale, love challenges the inevitability of death, although, in the case of LLV, roles are upended and sometimes blurred, and Orphean references are either thinly disguised, or non-specific to the point of being thoroughly sublimated. Academic, to be sure, but completely acceptable as long as LLV can sustain itself and remain engaging. And it surely does, thanks to Figgis' intelligent script and direction, Cage's role as a down-and-out writer and his protracted self-destruction, and Shue's portrayal of a lonely hooker, lifting that old bromide beyond what could have been routine, to a level not seen since Jane Fonda's character in Klute. Excellent performances all around.\n\nWith all that said, this film is not for everyone (in particular those who only respond to gratuitous sex, car chases, and mindless pyrotechnics). The lurid depictions of despair, self-loathing, and violence could put off even the most hardened social worker. In my mind's eye, I could see psychiatrists amongst the theater audiences, furiously jotting down their observations. Understandable; the two principal characters are, in the common parlance, screwed up. One cannot cope with failure, so decides to opt out, while the other does cope, but only barely, existing along the ragged edges of what passes for society in Nevada Hell. These details, though, tend to outline and, indeed, strengthen the true heart of this film: Sacrifice and Unconditional Love.\n\nIf this film is not for everyone, then who is it for? Those with real life experience and the maturity gained thereby. Those with strong emotional constitutions. Anyone appreciative of impassioned performances. Freudians. Alcoholics, recovering and otherwise. Pimps. Priests. Classicists. Petty whiners in need of perspective. And, more than anyone else, couples who plan on breaking up. In sickness and in health, 'til death do us part. 9.5 out of 10."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Ben Sanderson, a Hollywood screenwriter who lost everything because of his alcoholism, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.",
        "duration": "PT2M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3960192537",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzk0Y2E5ZWEtZWQzYi00ZDBmLWFkNjEtMjBiNWFmMThhZDdmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzk0Y2E5ZWEtZWQzYi00ZDBmLWFkNjEtMjBiNWFmMThhZDdmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-14T13:53:29.483Z",
        "url": "https://www.imdb.com/video/vi3960192537/"
    },
    "url": "/title/tt0113627/"
}