{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hiroko Yakushimaru",
            "url": "/name/nm0945129/"
        },
        {
            "@type": "Person",
            "name": "Hiroyuki Sanada",
            "url": "/name/nm0760796/"
        },
        {
            "@type": "Person",
            "name": "Shin'ichi Chiba",
            "url": "/name/nm0002002/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1238,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Legend of the Eight Samurai",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0095233/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053157/"
        },
        {
            "@type": "Person",
            "name": "Kinji Fukasaku",
            "url": "/name/nm0297935/"
        },
        {
            "@type": "Person",
            "name": "Toshio Kamata",
            "url": "/name/nm0436458/"
        }
    ],
    "datePublished": "1983-12-10",
    "description": "Princess Shizu's family is wiped out by an family of undead seeking revenge. The eight samurai can save her, but who and where are they?",
    "director": [
        {
            "@type": "Person",
            "name": "Kinji Fukasaku",
            "url": "/name/nm0297935/"
        }
    ],
    "duration": "PT2H13M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmZhNzE2MmUtNTg2Zi00NWI4LTk1MTEtMTY5YTMzNWFjMGQyXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "action heroine,bow and arrow,female rear nudity,female nudity,skinny dipping",
    "name": "Satomi hakken-den",
    "original_info": {
        "id": "Legend of the Eight Samurai_1983",
        "name": "Legend of the Eight Samurai",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2002-02-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086244/"
        },
        "name": "LEGEND OF THE EIGHT SAMURAI - classic tale retold in jazzed-up version",
        "reviewBody": "LEGEND OF THE EIGHT SAMURAI (1983) is a live-action Japanese costume fantasy retelling the oft-told tale of eight warriors identified by their receipt of magic crystal balls sent by a long-dead princess to insure protection of her descendants. Here, the eight warriors who receive the crystal balls come together to protect the fugitive Princess Shizu of the Satomi Clan, which has been all but wiped out by the supernatural descendants of the Hikita Clan. The action is larded with fantasy elements, including a couple of monsters (a giant centipede and giant snake) and the long-lived evil matriarch Tamazusa (Mari Natsuki) who stays alive a hundred years after her 'death' at the hands of the Satomi Clan by taking special baths in blood.\n\nDespite the title, there's no mention of samurai in the film's English-dubbed dialogue. The characters refer to each other as ninjas, even though few ninja costumes or accessories are visible. It's an unwieldy film with over a dozen major characters, none of whom take center stage until well past the film's half-way mark. The main focus of the plot is the gathering of the eight warriors as they meet and realize their destiny to protect the princess and attack Tamazusa's castle to destroy the Eternal Spirit who keeps alive the evil remnants of the Hikita Clan. Too much of the film is spent on gathering the eight, a task which is not completed until 100 minutes into the 133-minute film. When things finally get going here, the main characters turn out to be Princess Shizu (Hiroko Yakushimaru) and the reckless young Shinbei (Hiroyuki Sanada) who kidnaps Shizu at one point and travels quite a distance with her before they're reunited with the others. Both are too callow and unformed to be of much interest, while the more exciting characters, such as the loyal retainer Dosetsu (Sonny Chiba) and the female fighter Kano (Sue Shiomi), get far less screen time.\n\nThe climactic battle at Castle Tamazusa is rousing and full of action, but it proves too little too late to compensate for the two hours it took to get there. The earlier action scenes are all too short and choppy to generate much excitement. To make matters worse, the English dubbing is particularly horrendous and the tacked-on music score is all synthesizer-created with three incongruous American pop songs (sung by John O'Banion) thrown onto the soundtrack with utter disregard for the historical and cultural tone of the film.\n\nThe film is especially disappointing because it was directed by Kinji Fukasaku, a highly regarded director known for Yakuza (gangster) films and the recent box office hit BATTLE ROYALE (2000). His earlier space opera, MESSAGE FROM SPACE (1978), was a variation of the same story told in LEGEND OF THE EIGHT SAMURAI and featured some of the same cast members, Hiroyuki Sanada, Sonny Chiba and Sue Shiomi (who played the princess in that one). Fukasaku also gave us the U.S.-Japanese co-production, THE GREEN SLIME (1968).\n\nOn the plus side, LEGEND OF THE EIGHT SAMURAI is quite colorful and beautifully appointed and the special effects are, for the most part, pretty impressive. (The giant centipede, flung about on wires, is the notable exception.) But the film lacks the formal beauty of traditional Japanese samurai films and seems pumped up in style, with the youthful romance played up, in order to suit the 1980s youth audience. For U.S. fans, the botched English soundtrack and over-length are quite fatal, along with the absence of any exceptional action scenes until the very end. The story comes from the 19th century Japanese novel 'Nanso Satomi Hakkenden,' by Bakin Takizawa, which was also the basis for the breathtaking 13-part animated series, THE HAKKENDEN (1990). Elements of the story also turn up in the original 'Dragon Ball' animated TV series."
    },
    "url": "/title/tt0086244/"
}