{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nobutoshi Canna",
            "url": "/name/nm0370650/"
        },
        {
            "@type": "Person",
            "name": "Hisao Egawa",
            "url": "/name/nm0250752/"
        },
        {
            "@type": "Person",
            "name": "Hiroko Emori",
            "url": "/name/nm0256607/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Akinori Endô",
            "url": "/name/nm0256852/"
        },
        {
            "@type": "Person",
            "name": "Ryo Mizuno",
            "url": "/name/nm0594686/"
        }
    ],
    "datePublished": "1996-11-21",
    "description": "Lady Sheru has dreams haunting her , dreams such as her being Pirotesse in her past life. Her lover Ashram is being tortured by Barbas who is posing as their former king. Sheru tries to find a way to save him by entering the Chaos...",
    "director": [
        {
            "@type": "Person",
            "name": "Ryûtarô Nakamura",
            "url": "/name/nm0620214/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Animation",
        "Action",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA3NTM0MTUzMl5BMl5BanBnXkFtZTYwODA2MTI5._V1_.jpg",
    "keywords": "tv mini series,anime animation",
    "name": "Legend of Crystania: The Chaos Ring",
    "original_info": {
        "id": "Legend of Crystania: The Chaos Ring_1996",
        "name": "Legend of Crystania: The Chaos Ring",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slingshott-58928"
        },
        "dateCreated": "2016-12-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3633660/"
        },
        "name": "Why the hell has nobody reviewed this great old school anime flick yet!!!!",
        "reviewBody": "Classic old time anime style animation and a great story. Maybe it got thrown to the wayside cause the Legend of Crystania:motion picture was released but the 3 episodes of the \"chaos ring\" story finally released together in sequence on DVD in 1996 was brilliant,yet i see as of now it does not get the credit it deserves here on IMDb. Brought together as one makes for an epic 2hr and 15 min anime flick. Its possible that most don't know it exists..i was lucky enough to stumble acrossed it in a bin at a used movie store...i've watched it both dubbed and subbed cause that what the copy i have offers n both ways are good...i probably lean more towards the subbed version cause u get the true story the way it was meant to be told originally but either way is still good enough that it should have been rated and reviewed before now. As nice as it may seem that i get to break this films \"review cherry\" here on IMDb i'm still disappointed that since 1996 nobody has beat me to it. Possibly its harder to find than i realise but still. Anyway if u looking for a deep old school anime fantasy story please seek this one out...not to be confused with the actual movie that was released in same year...these 3 episodes spliced together on DVD is something that any true anime fan should seek out...because it truly is an epic old school anime flick that deserves more credit.Check it the heck out!!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt3633660/"
}