{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lesley Taplin",
            "url": "/name/nm0317927/"
        },
        {
            "@type": "Person",
            "name": "Cheryl Smith",
            "url": "/name/nm0807679/"
        },
        {
            "@type": "Person",
            "name": "William Whitton",
            "url": "/name/nm0926595/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2334,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042486/"
        },
        {
            "@type": "Person",
            "name": "Richard Blackburn",
            "url": "/name/nm0085636/"
        },
        {
            "@type": "Person",
            "name": "Robert Fern",
            "url": "/name/nm0272767/"
        }
    ],
    "datePublished": "1973-04-30",
    "description": "A young girl who returns to her hometown to see her dying father finds herself being drawn into a web of vampirism and witchcraft.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Blackburn",
            "url": "/name/nm0085636/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Fantasy",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzIwNDVkYmEtYjFjMi00MGVlLTgxZDktNGVjYjM1M2U2MWI4XkEyXkFqcGdeQXVyMzU4ODM5Nw@@._V1_.jpg",
    "keywords": "pedophile,erotic 70s,sexuality,woman wrapped in a towel,no panties",
    "name": "Lemora: A Child's Tale of the Supernatural",
    "original_info": {
        "id": "Lemora: A Child's Tale of the Supernatural_1973",
        "name": "Lemora: A Child's Tale of the Supernatural",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cjlines"
        },
        "dateCreated": "2002-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070300/"
        },
        "name": "One the all time greatest vampire chillers - unique and unforgettable",
        "reviewBody": "Looking at the packaging to this lost classic, I was expecting a real crummy slice of early 70's schlock, hence why I took so long to actually put the tape into the VCR, so it was a total surprise when it turned out to be a genuinely very haunting, beautifully made creepfest.\n\nThe plot's fairly simple, for anyone who hasn't seen it, involving as it does a pure-as-the-driven snow church girl, Lila Lee, (of an unspecified age but I'm guessing around 13/14?) who receives a letter from the mysterious \"Lemora\" asking her to come out to some remote town in the middle of nowhere to see her long-lost gangster Father as he lies on his deathbed. Needless to say, Lemora is not all she appears to be and the mysteries surrounding her ominous precense unfold slowly but with a powerfully creepy vibe throughout the film's running time.\n\nI was really taken aback by the care which appeared to go into making the film - the soundtrack, both musically and (more to the point) the sound effects themselves, were magnificently done with lots of 'night time' sounds quite high in the mix and some really appropriately done 'scare' noises, such as a scene in which Lila is attacked by a ghoul after taking a bath, which is punctuated by an intense high-pitched shrieking noise getting progressively higher in pitch as the scene goes on... it's maybe not the smartest trick in the book but it makes the scene a *LOT* more effective and it's little touches like this which made the movie. Same goes for the imagery, which is often very surreal and frightening. Much of the film is shot in the dark and usually if something comes out of the shadows, it's something horrible that you don't want to see! There are some beautifully done shots though, such as the one in which Lila discovers Lemora's vampirism by watching her through the window as she bites a young child - the way the shot is set up, I thought was very nicely done indeed... It may not be Mario Bava but then, if it was, it'd probably not be anywhere near as affecting - there's something about the subtlety of the film which gives it a low-key, moody edge.\n\nThere's very little gore, no real nudity and nothing that smacks of the exploitation clichés the packaging suggests. The much-touted 'lesbianism' angle on the back of the box is played as merely a quiet subtext, adding yet another pleasingly understated edge to the movie.\n\nI dunno *just* how obscure this movie is, but it definitely doesn't deserve to be. I was very very impressed - it's a dark fairytale in the same vein as some of Jean Rollin's stuff but with a much more coherent narrative, none of the more explicit 'erotic' elements and a strange innocence to it which makes it all the creepier... Most of the film is seen through a child's eyes and many of the scares play on childhood fears, or at least things that would've creeped *me* out tremendously as a child and still lurk around at the back of 'ye olde braine'... There's little moments, like when Lila wakes up in 'the stone room' and looks through the bars to see laughing, dancing shadows behind the curtains in the mansion window nearby... urrgh, difficult to even explain why, but things like this *REALLY* give me the shivers. That probably sounds crass and silly the way I've written it, but trust me on this one, \"Lemora\" is one seriously unnerving little gem of a film and a must for anyone into horror cinema IMHO."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Dima Nikitin is an ordinary honest plumber who suddenly decides to face the corrupt system of local politics in order to save the lives of 800 inhabitants of an old dormitory, which is about to collapse.",
        "duration": "PT1M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3145318937",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzliODUyMzUtMzEyZC00MGQ1LTk4OWItZWQzZDRmMTFkZmQyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzliODUyMzUtMzEyZC00MGQ1LTk4OWItZWQzZDRmMTFkZmQyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-08-19T00:47:14.792Z",
        "url": "https://www.imdb.com/video/vi3145318937/"
    },
    "url": "/title/tt0070300/"
}