{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maxime Collin",
            "url": "/name/nm0172021/"
        },
        {
            "@type": "Person",
            "name": "Ginette Reno",
            "url": "/name/nm0719729/"
        },
        {
            "@type": "Person",
            "name": "Gilbert Sicotte",
            "url": "/name/nm0796449/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7166,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Leolo",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014796/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090290/"
        },
        {
            "@type": "Person",
            "name": "Jean-Claude Lauzon",
            "url": "/name/nm0491682/"
        }
    ],
    "datePublished": "1993-04-02",
    "description": "The story of a young Canadian boy who tries to escape mentally from his disturbed family thanks to his fantasy and imagination.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Claude Lauzon",
            "url": "/name/nm0491682/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTEyY2U1NTktMTIwOC00OGY4LWJmMzktYjNiZjhmZmNmOGYwXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "hereditary insanity,mental illness,obsessive compulsive,tomato,dark humor",
    "name": "Léolo",
    "original_info": {
        "id": "Leolo_1992",
        "name": "Leolo",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ThurstonHunger"
        },
        "dateCreated": "2004-12-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104782/"
        },
        "name": "By body betrayed, by poetry saved...",
        "reviewBody": "Which came first, the disturbing or the disturbed? This is a difficult film for me to assay. Certainly I did not enjoy \"Leolo\" but then there are many films I have appreciated which I did not enjoy. Despite being tagged as such, this film was never a comedy for me, outlandish scenes too often were tainted by a ring of tragic truth. Well, I should clarify and say \"at least an emotional truth.\"\n\nThis film reminded me of Baudelaire and Rabelais. I remember in my late teens, seeking out those poets feeling that I should appreciate them from the little I had heard about them. Someone probably mentioned Iggy Pop in the same breath with 'em. Anyways, their poems never did connect with me, I remember thinking that something in translation or in the transatlantic crossing was lost upon me. This film has many moments like that (despite a shorter journey down from Canada), but cast amidst shining gems of genius. One example, the recurrent use of the refrigerator light, and other illumination, shining over Leolo's shoulder.\n\nThis film slips and dips into the \"rabelaisian\" in the reduced definition, i.e. a fecal focus. A childhood is deprived more than depraved, but a little of both. If any sexual appetite is offensive for you, than this film is not for you... Spend your time on some counseling instead.\n\nAnd yet for me, much of the film was grotesque...and I think that's a nearly perfect word for it, what with its stylish franco-suffix... gracefully covering over its seamier stewings. Like a sauce over spoiled meat.\n\nBut as I think more about this film: the merd, the bugs, the dead dog in the canal...all of that waste, is not wasted. Instead the images, the reviling of an earthly existence drive us off the screen and into the voiced-over poetry of Leolo. Even in translation and subtitle, the words had a precise beauty. A beauty I feel was intentionally and successfully accented by the sordid scenarios stitched together.\n\nIt would be an interesting test for someone to read the poetry from the screenplay first and then watch the film. Would the words be strong enough without the sights, sounds and implied smells of Leolo's world to suffice?\n\nWhile I cannot honestly recommend this film (too many times I found myself hoping that a fade-to-black was final), it would be interesting to hear/read others' comments. I'll come back to the reviews here, and maybe the film in the future.\n\nTil' then, I 'll give it a 6/10\n\nPS Interesting. In posting my review the \"s-word\" now appears to be banned...so let them read \"merd.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0104782/"
}