{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Warwick Davis",
            "url": "/name/nm0001116/"
        },
        {
            "@type": "Person",
            "name": "Jennifer Aniston",
            "url": "/name/nm0000098/"
        },
        {
            "@type": "Person",
            "name": "Ken Olandt",
            "url": "/name/nm0645949/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28386,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079484/"
        },
        {
            "@type": "Person",
            "name": "Mark Jones",
            "url": "/name/nm0428751/"
        }
    ],
    "datePublished": "1993-01-08",
    "description": "An evil, sadistic Leprechaun goes on a killing rampage in search of his beloved pot of gold.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Jones",
            "url": "/name/nm0428751/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTVhY2JhNzgtYzQxZS00YmEzLTk3ODQtZjlkYzVkN2E5MGU5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "cult film,evil creature,f word,child swearing,creature",
    "name": "Leprechaun",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "YellowJacketYJ"
        },
        "dateCreated": "2008-04-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107387/"
        },
        "name": "Not as bad as some make it out to be",
        "reviewBody": "I used to call Leprechaun a guilty pleasure of mine. Sure, I didn't mention it to many people, for the fear of being pointed and laughed at, while I hear people yelling \"He's the guy that liked Leprechaun!\" So, I kept it a secret. Until now! Why now, you ask (I don't care if you didn't ask, I'm going to tell you anyway)? Simply put, you can all still ridicule me, but I won't be able to hear you laugh or see you pointing at me.\n\nDespite the fact I declare Leprechaun a guilty pleasure, the more I watch it, the more I hate it. Yes, I still find redeemable qualities (though, nowadays, that's becoming quite a task). But, the smell of crap is starting to fill the room anytime I put Leprechaun on.\n\nFirst and foremost, the main cast (excluding Warwick Davis as the Leprechaun) is idiotic and annoying. How am I supposed to care for these people when they're in danger, when all I keep thinking about is \"I hope that house collapses on all of them\"? The answer: I can't! That's where the problem lies (cheats and steals?). Without a likable round-up of people, then the story itself falls flat on its face.\n\nThe main cast itself is bad, but nobody, and I mean nobody, was more annoying than Robert Gorman, who played the young kid Alex. Talk about your annoying kid actors. For the love of God, couldn't somebody have smacked the kid and threw him into the well that was in the backyard? I've seen some annoying child actors in my day (surprisingly, not including Dickie Roberts. Mainly for the fact that a grown man as a child actor is kind of creepy. I'm talking about you Christopher Knight). I would rather walk onto burning hot magma while having fat little trolls stab me with pitchforks, with House of the Dead (the crappy Uwe Boll movie, not the fun video game) playing simultaneously.\n\nOverall, Leprechaun is like having a fun night out on the time. At first, you're living it up with your buddies, laughing your asses off, and shining people's shoes (this is what happens when you party with Warwick Davis). Then, a bunch of morons join in the fray, ruining your night. Then, you pass out in the bathroom and wake up the next morning with a horrible hangover that makes George W. Bush's presidential run seem tolerable compared to the immense pain your in. Basically, this was just my way of saying that Leprechaun has its moments, but has many flaws that smacks it in the face with a bullwhip.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Trimark",
        "duration": "PT1M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi378929433",
        "name": "Leprechaun",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTc5NzNlZDUtMjI3YS00ZDBmLWEyNjUtYTJmZWM0NWZmZWEyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTc5NzNlZDUtMjI3YS00ZDBmLWEyNjUtYTJmZWM0NWZmZWEyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:59:49Z",
        "url": "https://www.imdb.com/video/vi378929433/"
    },
    "url": "/title/tt0107387/"
}