{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Bernard",
            "url": "/name/nm0076350/"
        },
        {
            "@type": "Person",
            "name": "María Casares",
            "url": "/name/nm0143018/"
        },
        {
            "@type": "Person",
            "name": "Elina Labourdette",
            "url": "/name/nm0479626/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4601,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "Les Dames du Bois de Boulogne",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079143/"
        },
        {
            "@type": "Person",
            "name": "Robert Bresson",
            "url": "/name/nm0000975/"
        },
        {
            "@type": "Person",
            "name": "Denis Diderot",
            "url": "/name/nm0225784/"
        },
        {
            "@type": "Person",
            "name": "Jean Cocteau",
            "url": "/name/nm0168413/"
        }
    ],
    "datePublished": "1964-04-03",
    "description": "A society lady engineers a marriage between her lover and a cabaret dancer who is essentially a prostitute.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Bresson",
            "url": "/name/nm0000975/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGIzZGUyMDctYThjYy00ZjQ1LTgyN2ItMmZiMzk5OTI3NzYzXkEyXkFqcGdeQXVyNTc5OTMwOTQ@._V1_.jpg",
    "keywords": "tap dancing,possessive mother,taming of the shrew,domineering mother,dysfunctional marriage",
    "name": "Les dames du Bois de Boulogne",
    "original_info": {
        "id": "Les Dames du Bois de Boulogne_1945",
        "name": "Les Dames du Bois de Boulogne",
        "year": "1945"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Red-125"
        },
        "dateCreated": "2012-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0037630/"
        },
        "name": "\"Hell hath no fury . . .\"",
        "reviewBody": "Les dames du Bois de Boulogne (1945) was written and directed by Robert Bresson. This movie is the second feature film by the great French director Bresson. It's the last film in which he used professional actors.\n\nIn a story somewhat reminiscent of Les Liaisons Dangereuses, two wealthy, sophisticated lovers have a parting of the ways. Hélène, played by María Casares, senses that Jean (Paul Bernard) is losing interest in her. She suggests that they separate, and he agrees. The problem is that he agrees too readily. Hélène feigns indifference, but she plots revenge.\n\nThe weapon of revenge is Agnès, played by Elina Labourdette. Agnès is a young cabaret dancer and (we understand) a prostitute. This is an ingénue role, and it's clear that Agnès is a serious dancer, forced into this role in order to support herself and her mother. The remainder of the story depicts the way the elaborate revenge scheme involving Agnès is carried out.\n\nLabourdette and Bernard are fine actors, and both had long careers in French cinema. However, the success of the movie comes from the extraordinary appearance and acting skills of María Casares. Casares, although Spanish, had an extremely successful career on both the French stage and screen. With her lithe figure and elegant clothing, she is every inch the French socialite. She is not beautiful in a typical cinematic way. Instead, with her triangular, almost feline face, and her narrowed eyes, she is fascinating. She dominates every scene in which she appears. No one questions her motive for revenge and her ability to achieve it. Bresson directs the film--and Casares--with the hand of a master.\n\nWe saw this movie on the large screen at the excellent Dryden Theatre at Eastman House in Rochester, NY. The person who introduced the film said it was the only print in the United States at present. This print is owned by the French government, and only lent to selected institutions. A DVD is available, but may be of a somewhat different version. Still, even if the DVD isn't an ideal substitute for the print version, it's worth obtaining and seeing. This is one of the great films of French cinema. Don't miss it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0037630/"
}