{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Patrice Moullet",
            "url": "/name/nm0433017/"
        },
        {
            "@type": "Person",
            "name": "Marino Masé",
            "url": "/name/nm0166706/"
        },
        {
            "@type": "Person",
            "name": "Geneviève Galéa",
            "url": "/name/nm0303593/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3434,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Les Carabiniers",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020435/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037407/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025521/"
        },
        {
            "@type": "Person",
            "name": "Beniamino Joppolo",
            "url": "/name/nm0429778/"
        },
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        },
        {
            "@type": "Person",
            "name": "Jean Gruault",
            "url": "/name/nm0344171/"
        }
    ],
    "datePublished": "1967-09-27",
    "description": "During a war in an imaginary country, unscrupulous soldiers recruit poor farmers with promises of an easy and happy life. Two of these farmers write to their wives of their exploits.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Comedy",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2IyMjZiNTYtNGRmNi00MDg1LTg1OGYtNDIzNTY5YjhmMjUzXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "satire comedy,nouvelle vague,french new wave,cult film,cynicism",
    "name": "Les carabiniers",
    "original_info": {
        "id": "Les Carabiniers_1963",
        "name": "Les Carabiniers",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zetes"
        },
        "dateCreated": "2001-04-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056905/"
        },
        "name": "amazing. 9/10",
        "reviewBody": "What can you say? It's Godard. If you appreciate Godard, his early stuff, particularly, Les Carabiniers fits in perfectly with films such as Breathless, My Life to Live, Une femme est une femme, Band of Outsiders, and Pierrot le fou. It is utterly complicated, and seems to be saying dozens of things at once, none of them becoming clear enough to formulate a satisfactory thesis.\n\nThe film starts off with two brothers and their wives living in a shack in the middle of nowhere. Two carabiniers (riflemen) arrive, basically assaulting the four of them. They come with a proposition, though: join the army, be one of them. You get to travel everywhere, and you can do anything you want. What a proposition! The two men join, leaving their wives (tellingly named Cleopatra and Venus) at the shack.\n\nWhat follows is a fantastical account of war. The characters speak French, but they don't seem to be meant to be any specific nationality. Their supreme commander is \"The King.\" They travel around the world, including Egypt and the USA, killing whoever gets in their way. They play sickening games with their victims. Why? Because they can. They have guns, their victims don't. Between the scenes where our heroes reak havoc, Godard inserts stock footage of real wars. Over the fictional footage, Godard inserts the sound of explosions and gunfire. This lack of realism creates a stunning surrealism.\n\nAt first, I was thinking the film was about the fact that your average soldier is an ignoramous with a deadly weapon. Transferred, this speaks illy of the government who willingly supplies its young morons with deadly weapons. One particularly hilarious scene (yes, it has elements of comedy, too) which shows these folks to be country bumpkins occurs when one, Michelangelo, attends a movie, his first ever. It begins with a train arriving at a station, a la L'Arrivée d'un train à la Ciotat, a Lumiere film made in 1895, often regarded as the first film ever made (though it wasn't, not even by the Lumieres). Michelangelo covers his face as it moves forwards on screen, as everyone has heard the first movie patrons ever did (which isn't true, either). The film he watches moves on to a scene where a woman undresses and takes a bath. Michelangelo is so impressed, he jumps up and tries to jump into the action, a la Buster Keaton's Sherlock Jr. The results are hilarious. I don't think this theme holds up through the whole film, but, c'est le Godard!\n\nFurther on, it seems to take more of a Marxist viewpoint (I believe Godard was a Marxist at this point in his career). Two communists ambush the carabiniers at one point, claiming that, though they may be allied with the carabiners' country, they are obliged ideologically to murder capitalists. Here I realized that a large number of aggressive nations during this time were capitalist. Later, near the end, a very long scene serves to criticize capitalism: the boys return home, saying that they have gathered everything in the world for their girlfriends. Yet they carry nothing but one suitcase. Here commences the longest single scene in the film, where the men reveal the contents of their suitcase. They have not collected everything on Earth, per se, but rather photographs of them. For one thing, this depicts Godard's main objective in life: to make us realize that we are watching a film, not involved in any sort of reality. With just photos, the lack of the real objects is even more ironic. Also, most of these objects photographed are objects that can never be owned: natural wonders, man-made wonders, and tons and tons of women, including ones long since dead. This petty ownership of photos (they also call them deeds) is a reductio ad absurdum for capitalism: the most important things in the world are unownable, and thus to own pictures of them is truly absurd.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0056905/"
}