{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeanne Moreau",
            "url": "/name/nm0603402/"
        },
        {
            "@type": "Person",
            "name": "Gérard Philipe",
            "url": "/name/nm0679959/"
        },
        {
            "@type": "Person",
            "name": "Annette Stroyberg",
            "url": "/name/nm0883006/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1449,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045230/"
        },
        {
            "@type": "Person",
            "name": "Claude Brulé",
            "url": "/name/nm0115892/"
        },
        {
            "@type": "Person",
            "name": "Choderlos de Laclos",
            "url": "/name/nm0480166/"
        },
        {
            "@type": "Person",
            "name": "Roger Vadim",
            "url": "/name/nm0671862/"
        }
    ],
    "datePublished": "1961-12-18",
    "description": "Juliette Merteuil and Valmont is a sophisticated couple, always looking for fun and excitement. Both have sexual affairs with others and share their experiences with one another. But there is one rule: never fall in love. But this...",
    "director": [
        {
            "@type": "Person",
            "name": "Roger Vadim",
            "url": "/name/nm0671862/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTVhZTI0ZmQtOWE1ZC00ZjFlLTkyMmItZmRkZGRmYmNmMmQ0XkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "female feet,sex,nudity,hand on breast,kiss",
    "name": "Les liaisons dangereuses",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bunuel1976"
        },
        "dateCreated": "2014-01-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053002/"
        },
        "name": "DANGEROUS LIAISONS 1960 (Roger Vadim, 1959) ***",
        "reviewBody": "Roger Vadim's reputation as a director of erotica and his own affairs with numerous leading ladies has denied him serious attention by movie critics. Nevertheless, he did make a few prestigious efforts – mainly adaptations of famous, sometimes infamous, material: the film under review (based on the novel by Choderlos de Laclos), BLOOD AND ROSES (1960; Sheridan LeFanu's \"Carmilla\"), VICE AND VIRTUE (1963; inspired by the works of the Marquis de Sade), CIRCLE OF LOVE (1964; Arthur Schnitzler's \"La Ronde\"), THE GAME IS OVER (1966; Emile Zola's \"La Curee'\") and the \"Metzengerstein\" segment from SPIRITS OF THE DEAD (1968; based on an Edgar Allan Poe short story). I own all six of these but have watched only four so far, including LIAISONS; actually, I liked all of them – but, excluding SPIRITS, this first rendition of a scandalous classic emerges as not just the most satisfactory of the lot but perhaps the most significant in his entire oeuvre.\n\nIncidentally, in view of the updating of the narrative from the 18th to the 20th century, the full original title is LES LIAISONS DANGEREUSES 1960; tragically, co-star Gerard Philipe would not live to see that year through, as he succumbed to cancer two months after the film's September releasethough he had, by then, finished work on another, namely Luis Bunuel's REPUBLIC OF SIN (1959). The source novel has been regularly adapted for both the big and small screens, especially in the last 25 years: I had earlier watched the 1988 DANGEROUS LIAISONS and the 1999 modernization CRUEL INTENTIONS, and also own the 1989 VALMONT and the 2003 DANGEROUS LIAISONS TV mini-series (coincidentally, featuring one of Vadim's former flames and VICE AND VIRTUE co-star Catherine Deneuve); speaking of Philipe, Vadim and remakes, it is interesting to note that Philipe had appeared in the original versions of two films Vadim would eventually rework, i.e. LA RONDE (1950) and THE SEVEN DEADLY SINS (1952; Vadim's would be made 10 years later where, again, he was just one of several directors involved in an anthology).\n\nAnyway, this adaptation of French sexual intrigues makes a rather uneasy stab at equating what can be described as the perversions of the nobility (taking pleasure in corrupting the inexperienced, consequently quashing their idealized notion of love) with the amoral attitudes of the late 1950s; I say uneasy because, even if Federico Fellini's contemporaneous LA DOLCE VITA depicted a similarly decaying aristocracy, the 1960s would soon reveal that hedonism was pervasive and not tied to a certain class! That said, the plot retains its essential fascination – aided by the spot-on casting of Philippe, Jeanne Moreau (who would break out internationally soon after), Annette Stroyberg (then Vadim's wife and billed under his surname), Jeanne Valerie and Jean-Louis Trintignant; in keeping with the director's penchant for nudity, all three females mentioned shed their clothes throughout – but these scenes are extremely tame by the standards of even a decade down the line! \n\nThere are other good and not-so-good points: on the one hand, the ironic come-uppance of the central conniving pair (Philippe is killed in a fall while struggling with the otherwise mild-mannered Trintignant, after the latter finds out that the former has impregnated his girlfriend – and Philipe's own cousin! – Valerie; Moreau – Philipe's wife, who had also callously tried to break up the young couple's affair by seducing Trintignant – is facially-scarred after being engulfed in flames while trying to dispose of incriminating letters prior to the impending inquest over her husband's death); and the jazz soundtrack by Thelonious Monk (a trend popularized by Miles Davis' score for Louis Malle's LIFT TO THE SCAFFOLD {1958}, also featuring Moreau). On the other hand, some of the dancing at the climactic party is 'wildly' dated but, more importantly, Stroyberg's descent into madness at Philipe's deception simply does not ring true in a modern context! For what it is worth, the film is also included in the \"Wonders In The Dark\" poll and I watched it appositely to mark the birthdays of its director and main female star.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0053002/"
}