{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6265,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Lessons of Darkness",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0253884/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0500102/"
        },
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "datePublished": "2002-10-26",
    "description": "This film surveys the disaster of the Kuwaiti oil fields in flames, with little narration and scarcely any interviews. Hell on Earth is presented in such transcendent visions and music that one can only be fascinated by it.",
    "director": [
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "duration": "PT54M",
    "genre": [
        "Documentary",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjEwNGRiZGUtZWI3OC00YzYyLTg4MjMtZDliNzRkZTEyMjQ4XkEyXkFqcGdeQXVyMjMxMzE5MTg@._V1_.jpg",
    "keywords": "combustion,oil field fire,heat,environmental disaster,sealing an oil well",
    "name": "Lektionen in Finsternis",
    "original_info": {
        "id": "Lessons of Darkness_1995",
        "name": "Lessons of Darkness",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nienhuis"
        },
        "dateCreated": "2005-12-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104706/"
        },
        "name": "Mission Accomplished",
        "reviewBody": "Lessons of Darkness (1992) looks and acts like a companion piece to Fata Morgana (1971). As with the earlier film, Lessons either captures viewers or leaves them confused and bored within the first few minutes. Early in Lessons we see an aerial shot of an unusual city. It is obviously a contemporary urban area because we see highways, traffic, stoplights, and large buildings, but it is also obvious that it is not an American city. The narrator (Herzog) announces that this city is about to be destroyed by war and the thought of this strange but vibrant place being destroyed becomes completely repugnant. Thus, Herzog succeeds here with the approach he initially planned and then abandoned in Fata Morgana. Lessons of Darkness triumphs as a mock Science Fiction story of an apocalypse that threatens all of civilization. Luckily, it doesn't take a college education to realize that the footage is shot in Iraq in the aftermath of the First Gulf War. Luckily as well, Herzog's anti-war statement does not need to be explicit to be effective. Early in the film, interviews with two Iraqi women suggest the human price of this military event. In the rest of the film, humans appear to be on the periphery of the \"action\" but they keep coming back to the center of our consciousness. Those who persist in their viewing will eventually encounter a chilling repetitiveness in this film (the fires are still burning!) However, that repetitiveness can become cumulative and mesmerizing. This is not a film experience for everyone, but for those who have a taste for it the film will be unforgettable.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0104706/"
}