{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mel Gibson",
            "url": "/name/nm0000154/"
        },
        {
            "@type": "Person",
            "name": "Danny Glover",
            "url": "/name/nm0000418/"
        },
        {
            "@type": "Person",
            "name": "Joe Pesci",
            "url": "/name/nm0000582/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 166599,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019968/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0116435/"
        },
        {
            "@type": "Person",
            "name": "Shane Black",
            "url": "/name/nm0000948/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Lemkin",
            "url": "/name/nm0501380/"
        },
        {
            "@type": "Person",
            "name": "Alfred Gough",
            "url": "/name/nm0332184/"
        }
    ],
    "datePublished": "1998-07-10",
    "description": "With personal crises and age weighing in on them, LAPD officers Riggs and Murtaugh must contend with deadly Chinese triads that are trying to free their former leaders out of prison and onto American soil.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Donner",
            "url": "/name/nm0001149/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmU2YTYwYmUtMTYzOC00YzJmLTk1NDktMzU4YzA3Njc1ZmY0XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "kung fu,martial arts,shoulder,holster,squad car",
    "name": "Lethal Weapon 4",
    "original_info": {
        "id": "Lethal Weapon 4_1998",
        "name": "Lethal Weapon 4",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2017-07-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0122151/"
        },
        "name": "The 'Lethal Weapon' series doesn't end with a bang but it hardly ends on a whimper either",
        "reviewBody": "Talking about the other films for a minute, while not perfect, the first film is very good and one of the best buddy-cop films there is (important to the development of them too). 'Lethal Weapon 2' was almost as good, and while 'Lethal Weapon 3' was a little disappointing it was still fun.\n\nWhich is pretty much the same personal opinion for 'Lethal Weapon 4', though a slight improvement over the third. Like the third film, its weak link is the story, except it's even messier than that and sometimes has a going through the motions, tame feel, especially when one can't help comparing to the first two. It also could have done with having less going on and less characters, it did feel over-stuffed and muddled.\n\n'Lethal Weapon 4's' script is also the weakest in this component of the series. Not awful, as some of it is very funny and still intrigues, but there seemed to be too much of an emphasis on sentimentality and especially humour. The humour works better, because there are actually some funny moments like the dentist scene and the fried rice line but there were other parts where it was overdone. The sentimentality really doesn't work, am aware it's for character development but it was done in a very mawkish and under-cooked way and felt really odds and tacked on with the rest of the film.\n\nWas mixed on Chris Rock. Was expecting him to be a disaster and be completely out of place. The good news is that he is a little better than expected, there are times where he is amusing and has some good lines and moments with the rest of the cast. Not so good is that he featured in the film too heavily and some of Rock's shtick is overdone and annoying, when you already have Joe Pesci as a motor-mouth it feels overkill.\n\nHowever, the way 'Lethal Weapon 4' is shot and designed screams slick and stylish while Richard Donner once again directs with an assured hand. The score is atmospheric and groovy.\n\nParts of the script doe entertain hugely and crackle in wit and tension, especially the aforementioned moments.\n\nOnce again, the action is slick and bursts with excitement and tension, with terrific stunts and the sheer scale of them being worthy of huge admiration. The freeway scene and Jet Li's final fight are two of the series' best action sequences It is very easy to see why the chalk and cheese chemistry of the polar opposite characters of Riggs and Murtaugh became so popular, very rarely in a buddy-cop film has this kind of chemistry been so entertaining and perfectly pitched.\n\nMel Gibson continues to excel in a performance as witty and intense has before. Danny Glover gives Murtaugh the right amount of spirit, subtlety and no-nonsense attitude.\n\nJoe Pesci, despite the character being a thrown-in plot device, is closer to the funny character he was in the second and not the irritating one in the third. Rene Russo's role is not as fresh and fairly side-lined but she is a lovely presence. While underused, Jet Li is a calmly sinister villain with some truly indestructibly awesome fighting skills, for me the second best overall villain of the series after Gary Busey in the original.\n\nIn summary, fun if not blowing the mind. Doesn't see the series going out with a bang, but a long way from a whimper despite a few sizeable flaws threatening to make it so. 7/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Warner Home Video",
        "duration": "PT2M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi899023129",
        "name": "Lethal Weapon 4",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjVjOTQxYzgtOTllYy00MDBmLWE2YTktMTQ4MWUxZmVkMjdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjVjOTQxYzgtOTllYy00MDBmLWE2YTktMTQ4MWUxZmVkMjdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:00:13Z",
        "url": "https://www.imdb.com/video/vi899023129/"
    },
    "url": "/title/tt0122151/"
}