{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mel Gibson",
            "url": "/name/nm0000154/"
        },
        {
            "@type": "Person",
            "name": "Danny Glover",
            "url": "/name/nm0000418/"
        },
        {
            "@type": "Person",
            "name": "Joe Pesci",
            "url": "/name/nm0000582/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 172134,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019968/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Boam",
            "url": "/name/nm0090151/"
        },
        {
            "@type": "Person",
            "name": "Robert Mark Kamen",
            "url": "/name/nm0436543/"
        },
        {
            "@type": "Person",
            "name": "Shane Black",
            "url": "/name/nm0000948/"
        }
    ],
    "datePublished": "1992-05-15",
    "description": "Martin Riggs and Roger Murtaugh pursue a former LAPD officer who uses his knowledge of police procedure and policies to steal and sell confiscated guns and ammunition to local street gangs.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Donner",
            "url": "/name/nm0001149/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTFlNjI0NDQtMzlkNC00ZDU0LWE0ODktYmI2OTc2YjZlZmVlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "sex,1990s,shoulder holster,holster,shoulder",
    "name": "Lethal Weapon 3",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Boba_Fett1138"
        },
        "dateCreated": "2006-05-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104714/"
        },
        "name": "The magic is still here but still a somewhat weaker movie, compared to the other Lethal Weapon movies.",
        "reviewBody": "Even though this is in my opinion the weakest out of the Lethal Weapon series, that of course doesn't mean that this movie isn't fun and entertaining to watch.\n\nIt suffers from the same minor flaws as the previous 2 Lethal Weapon movies. The story is incredibly simple, standard action material. It's totally uninteresting and also told in a totally uninteresting way. Also the villain is yet again heavily underused. But it's true that none of the Lethal Weapon movies have ever relied on its story. Instead the movie heavily relies on its two main character; Martin Riggs and Roger Murtaugh. And when you have two such characters like Riggs and Murtaugh, who have such an amazing chemistry together, you just don't need much else to make a good and entertaining movie.\n\nUnfortunately the movie does nowhere live up to its fantastic and memorable beginning. Everything that happens after the opening sequence isn't really that interesting or memorable. The movie doesn't always have the right pace and the way the story is presented make it seem even less interesting than it is on paper.\n\nThe movie is filled with some great characters next besides to the two main leads. Joe Pesci returns as Leo Getz and Rene Russo joins the team as a woman who knows how to take care of herself. The villain is this time played by the always great Stuart Wilson. It however is unfortunate that all of these characters are given too little screen time, especially Joe Pesci and Stuart Wilson. All of the Lethal Weapon movies always had great villains, that were also at the same time always heavily underused. Same goes for Wilson in this particular case, who's talent is practically wasted.\n\nBut luckily the movie is still of course a perfectly entertaining one. This is absolutely thanks to Mel Gibson and Danny Glover, who still have the magic chemistry together, after already 2 Lethal Weapon movies. The two of them provide some great and hilarious moments together, that alone is reason enough why this movie is a good and enjoyable one to watch.\n\nMaybe not as good- but certainly just as entertaining as all of the other Lethal Weapon movies.\n\n7/10\n\nhttp://bobafett1138.blogspot.com/",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT2M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi865468697",
        "name": "Lethal Weapon 3",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDY1MmNiNjktOGJmYi00Y2RiLWFhYTEtOTcxZDBhZGFiNjkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDY1MmNiNjktOGJmYi00Y2RiLWFhYTEtOTcxZDBhZGFiNjkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:00:11Z",
        "url": "https://www.imdb.com/video/vi865468697/"
    },
    "url": "/title/tt0104714/"
}