{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin Anderson",
            "url": "/name/nm0000754/"
        },
        {
            "@type": "Person",
            "name": "Bill Pullman",
            "url": "/name/nm0000597/"
        },
        {
            "@type": "Person",
            "name": "Kim Novak",
            "url": "/name/nm0001571/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1628,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011877/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026481/"
        },
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "description": "The successful writer and professor of architecture Nick Kaminsky returns from New York to Elderstown to visit his biological mother Lillian Anderson Munnsen that is terminal. Nick does not know Lilian since he was adopted when he...",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjFmOTljNDktMWI2MC00NDg3LWEwMDAtODU5ZmVmY2YyYzU2XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg",
    "keywords": "neo noir,kiss,female frontal nudity,female rear nudity,black bra and panties",
    "name": "Liebestraum",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chaos-rampant"
        },
        "dateCreated": "2016-05-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102299/"
        },
        "name": "Dreamlike. Bodies entered by narrative",
        "reviewBody": "I like films that are dreamlike and fluid, floating that wanders outside of the confines of self and story. At the same time I like them to draw fresh water from the well of mysterious non- self that underpins really anything that is exuberantly receptive to the world (passionate sex, dreaming, youth, all a part of it), wipes anxiety and restores our way of seeing to the far-flung horizons teeming with possibility that youth and early lovers know.\n\nLynch is a natural master of this deep swimming. Ferrara tried briefly at around the same time. Further back it was Rivette. A lot of film noir works in a similar way for me.\n\nHere we have all these things; dreamlike in the way that Lynch is, about passion that dives in and perturbs reality, and a cinematic mind-bending swim in the waters. It's nominally a thriller, but written in waters, fluid about anxiety and self.\n\nIt has the noir engine where someone sets out to investigate and finds himself embroiled in mysterious goings-on. In noir that's usually a PI, but it doesn't have to be. Here it's simply a son whose mother has been hospitalized and he arrives to the small town to care for her.\n\nHe an architectural writer, she a photographer, both coming to explore an old building that is set to be demolished, but she has a husband. They unearth a story that took place in that building long ago, about illicit lovers discovered one night. We have some obvious symbolism in the building as obliquely shared past and as wandering through his own mind that is buffeted by anxieties.\n\nAnd it has the notion of persisting memory where something that happened in the past is rising up again in the present. The noir drive is that the more he succumbs to passion, the more he is pulled as a narrator into a past story about similar passion.\n\nSo they fall for each other while he's unearthing a narrative of how that shattered lives one day. By investigating further, he comes to understand that he's tied to that story via his parents; his mother has been unwell ever since. There's also another son whose life is intimately woven to events of that night, an eerie figure like out of Lynch who by driving past the building one day causes someone to die.\n\nIt's all eventually made to align during a hospital visit late at night. Another invalid mother is wheeled out, central in events of that story. A metaphysical wiring between bodies takes place, bodies entered it seems by our knowledge of the story. The fateful coupling that upset reality takes place once more inside the building; once more a vengeful spouse is waiting in the shadows with a gun. But they say that they love each other. He's eavesdropping and stays his hand.\n\nThis is worthwhile stuff.\n\nNoir Meter: 2/4 / Neo-noir or post noir? Post"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from MGM Home Entertainment",
        "duration": "PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2090205465",
        "name": "Liebestraum",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzkxMmE2YTYtNWFmYy00ZDI0LThkNDQtOWE0MTkzYTIwMTcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzkxMmE2YTYtNWFmYy00ZDI0LThkNDQtOWE0MTkzYTIwMTcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:00:54Z",
        "url": "https://www.imdb.com/video/vi2090205465/"
    },
    "url": "/title/tt0102299/"
}