{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Judy Davis",
            "url": "/name/nm0001114/"
        },
        {
            "@type": "Person",
            "name": "Victor Garber",
            "url": "/name/nm0001255/"
        },
        {
            "@type": "Person",
            "name": "Hugh Laurie",
            "url": "/name/nm0491402/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2315,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054762/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038746/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091980/"
        }
    ],
    "datePublished": "2001-02-25",
    "description": "The Judy Garland story from the 1930s until her death.",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU1Mzg0OTg3NV5BMl5BanBnXkFtZTcwNTc1NzMyMQ@@._V1_.jpg",
    "keywords": "grauman's chinese theatre los angeles,showbiz drama,death,1930s,singing",
    "name": "Life with Judy Garland: Me and My Shadows",
    "original_info": {
        "id": "Life with Judy Garland: Me and My Shadows_2001",
        "name": "Life with Judy Garland: Me and My Shadows",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gftbiloxi"
        },
        "dateCreated": "2005-04-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250581/"
        },
        "name": "Incredible Performances, But Not Entirely Accurate",
        "reviewBody": "Arguably the single greatest talent to emerge from golden-era Hollywood, Judy Garland continues to fascinate us even more than four decades after her untimely death. As a singer, she was incomparable; as an actress, she was exceptional; as a star, she was perhaps the most brilliant celebrity of her generation. But behind the brilliance there was a deeply troubled woman who began her career as a child in the hands of a driven mother and an all-powerful studio, who raced through five husbands, who fought a losing battle with chemical dependency throughout most of her life, and who self-destructed again and again--only to arise, phoenix-like, from her own ashes time and time again. It was an extraordinary life.\n\nSo it should come as no surprise, really, that this three-hour television falls a bit short. Realistically, it would take a talent of Garland's own scope to bring her fully to the screen. But what the film does right, it does extremely, extremely well--and the centerpieces of the film are the remarkable performances of Tammy Blanchard and Judy Davis. Both give extraordinary performances. That said, however, both performances are flawed due to the age of the actresses. Blanchard, who plays the teenage Garland, is clearly too old to be thirteen-ish when the film begins; Davis, who plays Garland from her twenties until her death, is clearly too old to be Garland in her twenties.\n\nBut so exceptional are the performances that these are actually minor quibbles. When made up for the role and placed in period attire, both Blanchard and Davis have the look to an absolutely uncanny degree. More importantly, they match each other in their skill at playing Garland, who was one of the most uniquely idiosyncratic personalities of her era--indeed, Davis has been described by many as having \"channeled\" Garland, and I certainly wouldn't disagree. And the supporting cast is quite good as well, ranging from above average to extremely good, something of a surprise in a made-for-television movie. Equally impressive is the painstaking recreation of the world in which Garland moved; her wardrobe, both on stage and off, has been meticulously recreated right down to the hat she wore for her wedding to Vincent Minnelli. Be it sets, costumes, or props, the design staff did a truly miraculous job.\n\nBut the film falls down a bit in both script and detail. Part of this is due to fact that Lorna Luft's memoir was, naturally enough, based on what her mother told her about her life. Doubtlessly Luft accepted much of this as fact, but Garland was notorious for twisting the truth if it would make a good story--and consequently the film includes several depictions of events that by all other accounts didn't happen that way, assuming they happened at all.\n\nWhen filming THE WIZARD OF OZ, SHADOWS shows Garland being crowded out of the shot by her co-stars, prompting director Victor Flemming to say \"You three dirty hams, let that little girl in there!\" It was one of Garland's favorite party stories--but it didn't happen. Garland was well known for her ability to perform complex musical numbers with little rehearsal in a single take, and SHADOWS offers her performance of \"The Trolley Song\" in MEET ME IN ST. LOUIS as an example of her ability to do that--but while she certainly could and often did perform her numbers in a single flawless take, she didn't do it for that particular number. You need only look at MEET ME IN ST. LOUIS and count the cuts in the sequence for change of camera set up. Perhaps the most obvious gaffe in the film is when Garland is found dead in the bathroom of her London apartment; SHADOWS shows her husband going to the bathroom door and seeing her sprawled out on the floor, clearly dead. In reality, the door was locked and he had to climb out on the roof to look in the window--and from her appearance he was unsure of her condition until he actually got into the room.\n\nSuch details aside, the script does a superior job of showing Garland's racy, acid, and often self-mocking sense of humor and her often-hidden but powerful sexuality. It also does a fairly good job of displaying her love-hate relationship with her own talent. But it is extremely spotty, skipping over major events and focusing on considerably more trivial incidents. (Garland's first husband, David Rose, is never seen in the film--and indeed, scarcely mentioned at all.) It lacks flow. And were it not for the incredible performances of both Blanchard and Davis, it would often also lack drama--a pretty astonishing thing when one considers how electrically dramatic Garland's life was from day to day. Perhaps most frustrating, the film also has a certain aloofness from its own subject; we observe Garland, but the script itself never really allows us to get inside her.\n\nIn the final analysis, ME AND MY SHADOWS is a film that will most greatly appeal to casual viewers or to new Garland fans, for it does show the main outlines of her life and her career. Hardcore fans, however, will be frustrated by its covert inadequacies--and will be quick to spot the numerous moments when the script goes awry. Still, even with its numerous flaws, Blanchard and Davis are exceptional. And I strongly recommend it on that basis.\n\nGary F. Taylor, aka GFT, Amazon Reviewer",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "hv post",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2380857625",
        "name": "Life With Judy Garland: Me and My Shadows",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmI3ZTVkYzgtMjY2Ni00MzFiLTg4ZDktODBmOTIwMGNiMWM4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmI3ZTVkYzgtMjY2Ni00MzFiLTg4ZDktODBmOTIwMGNiMWM4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-06-30T03:23:50Z",
        "url": "https://www.imdb.com/video/vi2380857625/"
    },
    "url": "/title/tt0250581/"
}