{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clarence 'Gatemouth' Brown",
            "url": "/name/nm1076115/"
        },
        {
            "@type": "Person",
            "name": "Buddy Guy",
            "url": "/name/nm0349796/"
        },
        {
            "@type": "Person",
            "name": "Solomon Burke",
            "url": "/name/nm0121868/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 705,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042766/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0133364/"
        }
    ],
    "datePublished": "2004-08-05",
    "description": "Antoine Fuqua's documentary on the blues, shot at Radio City Music Hall in New York City.",
    "director": [
        {
            "@type": "Person",
            "name": "Antoine Fuqua",
            "url": "/name/nm0298807/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzNzc0OTkwN15BMl5BanBnXkFtZTcwNzA2MTcyMQ@@._V1_.jpg",
    "keywords": "new york city,manhattan new york city,historical event,blues music,radio city music hall manhattan new york city",
    "name": "Lightning in a Bottle",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2005-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0396705/"
        },
        "name": "enjoyable documentary",
        "reviewBody": "The thing that separates the Blues from many other types of music is that it is an art born of pain and suffering, of a collective experience that includes slavery, Jim Crow laws, segregation, discrimination and poverty. With all that to face, who wouldn't be singing the blues? Yet, as with any great art form, the suffering is only a part of the story. For the Blues derives its true energy and strength from the optimism and hope it exudes, that hope for a better future that resides in the human spirit even in the darkest of times. Through the years, the Blues has given voice to the powerless and helped change the world in ways that one never could have imagined a hundred years ago. That is its true legacy.\n\nAll of this has been effectively captured in \"Lightning in a Bottle,\" a documentary about a concert held at Radio City Music Hall to commemorate one hundred years of the Blues. The concert organizers gathered some of the greatest legends still alive today - far too numerous to mention - to play and sing together and to pay tribute to the musical trailblazers who went ahead of them (artists like Leadbelly, Billie Holliday etc.). The concert itself has an almost \"survey course\" feel to it, charting the development and growth of the Blues from its roots in Africa to its flowering as the premiere art form and avenue of expression for millions of oppressed blacks in 20th Century America. The performances are accompanied by behind-the-scenes interviews with some of the artists present at the event as well as by old audio and film clips of many of the seminal performers from the past doing their thing in the recording studio or on stage. Thus, we are given a nicely balanced view of the Blues both past and present.\n\nThe musical performances are all first rate, although, in the interest of time, the sets are much shorter than any real Blues fan would probably like them to be. Still, it's great to hear the old standards being performed by world-renowned artists at the peak of their form. If you're a devotee, check out \"Lightning in a Bottle.\" And if you're not a blues fan, check the film out anyway. You might just learn something and have a terrific time listening to all that great music at one and the same time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2610299161",
        "name": "Lightning in a Bottle",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTY4NTQ4MWUtZWNhZi00ODA4LTkwNDEtZGEzMThmNjgwZDA1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTY4NTQ4MWUtZWNhZi00ODA4LTkwNDEtZGEzMThmNjgwZDA1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:01:18Z",
        "url": "https://www.imdb.com/video/vi2610299161/"
    },
    "url": "/title/tt0396705/"
}