{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ian D. Clark",
            "url": "/name/nm0164019/"
        },
        {
            "@type": "Person",
            "name": "Marcel Sabourin",
            "url": "/name/nm0754889/"
        },
        {
            "@type": "Person",
            "name": "Aubert Pallascio",
            "url": "/name/nm0657816/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2787,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Lilies",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032729/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022459/"
        },
        {
            "@type": "Person",
            "name": "Michel Marc Bouchard",
            "url": "/name/nm0098919/"
        },
        {
            "@type": "Person",
            "name": "Linda Gaboriau",
            "url": "/name/nm3580391/"
        }
    ],
    "datePublished": "1997-08-16",
    "description": "When a bishop comes to a prison to hear the confession of an old friend he is forced to watch a play, performed by the inmates, about their youth together, love and betrayal.",
    "director": [
        {
            "@type": "Person",
            "name": "John Greyson",
            "url": "/name/nm0340742/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Crime",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWUxYTg1YWUtYWEzZi00YmE0LTg2NDAtYTRkMGFlOWJhNjEzXkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_.jpg",
    "keywords": "male nudity,male full frontal nudity,gay,prison,boyhood friend",
    "name": "Lilies - Les feluettes",
    "original_info": {
        "id": "Lilies_1996",
        "name": "Lilies",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gradyharp"
        },
        "dateCreated": "2006-03-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116882/"
        },
        "name": "From the Confessional",
        "reviewBody": "LILIES, based on a Canadian play 'Les feluettes' by Michel Marc Bouchard, has been adapted to the screen by Bouchard and placed in the sensitive hands of director John Greyson, an artist who is able to indulge in surrealism with reality and make it work well. This very beautiful film is cast entirely with men despite the fact that there are women roles in the story. How does he make that work successfully without pandering to artiness? View this little film and make the discovery for your self.\n\nSet in Quebec in a prison, Bishop Bilodeau (Marcel Sabourin) has been summoned form the outside to hear the confession of 'a very sick man' who has been imprisoned for 40 years for a murder. Upon the Bishop's arrival the audience knows something is amiss: despite the atmosphere of the prison as a stage accompanied by choral singing of plainsong (The Hilliard Ensemble) there are props and images that seem out of place in a grim prison. The Bishop is ushered into the confessional booth and when he opens the window to hear confession, the person in the seat is Simon (Aubert Pallascio) the 'very sick' man who has planned for the bishop to watch a play depicting the 40 year old crime - a reverse on the confessional stance.Through a small aperture in the bishop's now locked confessional, the Bishop is forced to watch a reenactment of the incident 40 years ago when two young boys, Simon (Jason Cadieux) and Vallier (Danny Gilmore) were in love and the young future Bishop (Matthew Ferguson) was jealous of Vallier's attention from Simon and played a key role in 'murder' of Vallier that resulted in Simon's being accused and imprisoned. The atmosphere leading up to this act includes the reaction from the small town's homophobia and to Simon's sexual ambiguity that involves a strange lady Lydie-Anne (Alexander Chapman) who arrives form Paris via an air balloon. It is the interaction of the boys with the townsfolk, the new lady arrival who desires Simon's affections, and Vallier's understanding and self-sacrificing mother Countess De Tilly (Brent Carver) that leads to the fateful death of Simon. How the story ends in the confessional booth reversal is the beauty of the film that must be left unsaid for the drama to affect potential audiences of this movie.\n\nThe cast is all male because the whole story is a mise-en-scene, a play within a play, where all parts are acted by the prisoners for the sake of displaying truth to the Bishop. There is no pretense at making the men look like women except for the costumes and this enhances the message of the story. The actors are excellent and the impact of the story is powerful. Yes, this is a highly honored gay-themed film, but it is really more about the power of love both in youths and in thwarted adults that makes it a film for all audiences. Highly Recommended. Grady Harp",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0116882/"
}