{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charles Chaplin",
            "url": "/name/nm0000122/"
        },
        {
            "@type": "Person",
            "name": "Claire Bloom",
            "url": "/name/nm0001954/"
        },
        {
            "@type": "Person",
            "name": "Nigel Bruce",
            "url": "/name/nm0115558/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21104,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028083/"
        },
        {
            "@type": "Person",
            "name": "Charles Chaplin",
            "url": "/name/nm0000122/"
        }
    ],
    "datePublished": "1952-10-31",
    "description": "A fading comedian and a suicidally despondent ballet dancer must look to each other to find purpose and hope in their lives.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Chaplin",
            "url": "/name/nm0000122/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTg2NmZmM2EtYmFjMi00MGI5LTg3MjItMWEzYzk4ZDgyODA1XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "music hall,clown,vaudeville,older man younger woman relationship,recovering alcoholic",
    "name": "Limelight",
    "original_info": {
        "id": "Limelight_1952",
        "name": "Limelight",
        "year": "1952"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tfrizzell"
        },
        "dateCreated": "2003-11-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0044837/"
        },
        "name": "The Spotlight Unfortunately Cannot Shine Forever.",
        "reviewBody": "Haunting and unforgettable piece from Charles Chaplin that was nearly lost in the American cinema all together. It played in very few cities within the U.S. in 1952 and was never shown in Los Angeles due to the suspicion that the House of Un-American Acts Committee had concerning Chaplin (making no sense to me as Chaplin, who was British, was the polar opposite of a Communist from all indications). The film disappeared from U.S. soil and did not re-surface until some 20 years later in 1972 and Chaplin actually won an Oscar, with fellow scorers Raymond Rasch and Larry Russell, for this movie's original dramatic score (this was the only competitive Oscar Chaplin ever won). Chaplin stars as a washed-up vaudeville performer. He is now an elderly man (in his 60s when the film was made) and the spotlight is gone forever, even though he still secretly yearns for it. Chaplin discovers a very young ballet dancer (Claire Bloom) who has attempted suicide because she cannot handle being a performer. Naturally Chaplin cannot believe that this young, beautiful and talented woman would rather take her life than be a ballet performer (the fact that Chaplin yearns for her youth and the ability to be an entertainer again makes him bound and determined to get her back on her feet). He tries with all his might to get her performance-ready again, all the while he is also trying to resurrect the career that he lost long ago. Chaplin has a dream of a stunning performance he has on the stage, but when his act ends there is no one there to acknowledge him (one of, if not the saddest sequences I have ever seen on film). Soon it becomes obvious that Chaplin's time is running out and his desperation to have that one last piece of action engulfs his mind, body, heart and soul. \"Limelight\" is one of the most dramatic and intense pictures I have ever encountered. Chaplin's life and career had changed dramatically by 1952. The Little Tramp was no more, all movies had sound, some films were being made in color and the subject matter of motion pictures was slowly starting to change. In many ways Chaplin was trying to show the viewing public his life in celluloid form and \"Limelight\" would be the vehicle used. This is a stunning work that once again shows the humanity and overall sensitivity that Chaplin had with his movies. Chaplin's long-time rival in real-life (Buster Keaton) even shows up late and acts as a partner in the duo's stage routine. The pairing is usually the most memorable part of this production to most, but the story and the deep emotional part that Chaplin plays are the things that make \"Limelight\" quite possibly Chaplin's greatest cinematic masterpiece. 5 stars out of 5."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2932850457",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTQ1OTNkMjAtZjE5Yy00MzE5LTlmMWMtOGQ4OWNhMzQxOTNjXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTQ1OTNkMjAtZjE5Yy00MzE5LTlmMWMtOGQ4OWNhMzQxOTNjXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg",
        "uploadDate": "2019-11-25T09:46:20.312Z",
        "url": "https://www.imdb.com/video/vi2932850457/"
    },
    "url": "/title/tt0044837/"
}