{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bonnie Dickenson",
            "url": "/name/nm0225347/"
        },
        {
            "@type": "Person",
            "name": "Todd Verow",
            "url": "/name/nm0894812/"
        },
        {
            "@type": "Person",
            "name": "Linda Ann Eknoian",
            "url": "/name/nm0252504/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 114,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060454/"
        },
        {
            "@type": "Person",
            "name": "Jim Dwyer",
            "url": "/name/nm0245499/"
        },
        {
            "@type": "Person",
            "name": "Todd Verow",
            "url": "/name/nm0894812/"
        }
    ],
    "datePublished": "2002-03-20",
    "description": "Frances has dug herself a hole of boredom and misery with her lifeless job and her loveless marriage. She begins to combat her lack of identity by creating a wild nightlife character for herself to play.",
    "director": [
        {
            "@type": "Person",
            "name": "Todd Verow",
            "url": "/name/nm0894812/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjE1ZTJhZjAtZmY0Ni00ZmM0LWFlODQtY2Y3NGU1YzBmYjU0XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "independent film",
    "name": "Little Shots of Happiness",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nikmaack"
        },
        "dateCreated": "2005-01-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119553/"
        },
        "name": "Disappointing, Disjointed, Dull",
        "reviewBody": "It's a shallow movie pretending to be deep. And it looks like it was filmed with a toy movie camera held by an epileptic, featuring a non-stop soundtrack of repetitive sound mixed with broken bits of punk songs. The dialogue was recorded underwater, that's the only thing that can explain how bad the sound is. The film is stuffed with bad acting and improvised scenes that go on endlessly. \n\nAll of this could possibly be forgiven -- it's a low budget picture -- but this film is awful. There's just nothing there of any interest. Well, that's not entirely true. There are glimmers of promise, and a weak storyline of interest, but it all flops around aimlessly, like the movie has been stabbed in the legs.\n\nThe film features dialogue like the following:\n\n\"Can I have a cigarette?\" \"How'd you know I was a smoker?\" \"I had a feeling.\" \"Smoking's bad for you.\" \"So what?\" Snarky, surprised, \"So what?!\"\n\nAnd the characters spar and fuss and half-play, without ever actually saying anything. I believe the example I've provided is supposed to be strangers flirting. That should give you an idea of what you're in for.\n\nI suspect it was all done to feel realistic -- the jerky camera, the bad dialogue, the improvised scenes, the bad sound. It's all so jarring that the movie is almost unwatchable. (And I normally don't mind \"cinema verite\" camera work.) Worst of all, nothing really happens. Characters come and go. The plot spins its wheels and just peters out into nothing.\n\nThe ending (which I will not mention) sums up the cold, callous, disinterested feeling of the entire film. It's flat, almost utterly emotionless. I suspect the end is supposed to be funny in that \"ironic\" way. It isn't. It's just the dull little cherry on top of the dull little sundae.\n\nWatch for the paintings on the wall in a few scenes -- I suspect the director had a painter friend he wanted to promote. The paintings are sort of interesting, but unfortunately the camera doesn't stay still long enough to get a good look at them.\n\nThis movie has won awards, supposedly. That baffles me.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0119553/"
}