{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dustin Hoffman",
            "url": "/name/nm0000163/"
        },
        {
            "@type": "Person",
            "name": "Faye Dunaway",
            "url": "/name/nm0001159/"
        },
        {
            "@type": "Person",
            "name": "Chief Dan George",
            "url": "/name/nm0313381/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 36412,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0114899/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047368/"
        },
        {
            "@type": "Person",
            "name": "Thomas Berger",
            "url": "/name/nm0074383/"
        },
        {
            "@type": "Person",
            "name": "Calder Willingham",
            "url": "/name/nm0932229/"
        }
    ],
    "datePublished": "1970-12-23",
    "description": "Jack Crabb, looking back from extreme old age, tells of his life being raised by Native Americans and fighting with General Custer.",
    "director": [
        {
            "@type": "Person",
            "name": "Arthur Penn",
            "url": "/name/nm0671957/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWQwNTZjNTgtMGQyMS00ZTI3LWFkNzEtYzIxM2EwZGYxMDU4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "revisionist western,native american,based on novel,cheyenne indian,u.s. cavalry",
    "name": "Little Big Man",
    "original_info": {
        "id": "Little Big Man_1970",
        "name": "Little Big Man",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secondtake"
        },
        "dateCreated": "2011-12-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065988/"
        },
        "name": "Lightly funny, wry, and with doses of American tragedy...an odd, long, decent film",
        "reviewBody": "Little Big Man (1970)\n\nWell, this was destined to be a headliner--Arthur Penn directing (after \"Bonnie and Clyde\") and Dustin Hoffman (after \"The Graduate\" and \"Midnight Cowboy\"). And it's a comedy in the wackiest way. Hoffman is a survivor from Little Big Horn (Custer's Last Stand) and this is an invented life up to that point, told from memory to man with a tape recorder at the age of 123.\n\nAnd the old (old!) Hoffman is pretty terrific, mostly in the narration, but including some pretty caked on make-up, too. Most of the movie is a young Hoffman as both Indian and White Man (alternating, depending on how he gets miraculously saved from one disaster after another). It's a farce, yes, but there are overtones of tragedy throughout (the annihilation of a race can only be so funny for so long) and there are some truly violent scenes, mostly of Indians being slaughtered by the Army.\n\nIt might help to know this is a metaphor of sorts about the brutality of the Army in Vietnam, which was raging at the time. It does make it all less frivolous. But it's also just fine as a crazy retelling of the last great famous Indian War, and the events (more or less) leading up to it. Hoffman is terrific in his usual way, and the support around him funny, especially the old Indian Chief, played by Chief Dan George. The two other big stars appear only briefly, Faye Dunaway in a couple scenes, and Martin Balsam in one. It's really Hoffman's film, and Penn's, too, with a grand and complex range of scenes inside and out, night and day, city and wide open country.\n\nIt didn't strike me as a brilliant film, or even as funny as it could have been, but it's endlessly engaging and there are some witty and funny moments sprinkled all through. It is long, and I might not call it slow even though it feels like it drags here and there, for sure.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0065988/"
}