{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Roger Moore",
            "url": "/name/nm0000549/"
        },
        {
            "@type": "Person",
            "name": "Yaphet Kotto",
            "url": "/name/nm0001433/"
        },
        {
            "@type": "Person",
            "name": "Jane Seymour",
            "url": "/name/nm0005412/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 110490,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054040/"
        },
        {
            "@type": "Person",
            "name": "Tom Mankiewicz",
            "url": "/name/nm0542539/"
        },
        {
            "@type": "Person",
            "name": "Ian Fleming",
            "url": "/name/nm0001220/"
        }
    ],
    "datePublished": "1973-06-27",
    "description": "James Bond is sent to stop a diabolically brilliant heroin magnate armed with a complex organisation and a reliable psychic tarot card reader.",
    "director": [
        {
            "@type": "Person",
            "name": "Guy Hamilton",
            "url": "/name/nm0357891/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzY0M2MzODYtZDU5Yy00YTg2LWJmMGQtNmY1OWZiYjlmNzY0XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "snake,voodoo ritual,human sacrifice,fictional country,official bond film",
    "name": "Live and Let Die",
    "original_info": {
        "id": "Live and Let Die_1973",
        "name": "Live and Let Die",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CuriosityKilledShawn"
        },
        "dateCreated": "2006-12-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070328/"
        },
        "name": "Positively surreal Blaxploitation Bond",
        "reviewBody": "And none the worse for it, since every Bond film needs a fresh spin on the same old formula. Roger Moore's first outing as JB is, in equal measures, comical and action-packed. You'll never get bored. But it's definitely the weirdest Bond ever with loads of utterly bizarre moments.\n\nIt begins with M turning up at JB's house in the early hours while he's pumping some Italian agent for information (don't you just love his initialled dressing gown). Before sending him to America to investigate a Harlem pimp known as Mister Big he delivers some gadgets from Q-Branch, including a very useful watch. Q himself, or Major Boothroyd if you want to call him by his proper name, doesn't make any appearance in this one.\n\nStanding out like a Muslim in an airport, almost every single black person JB encounters in Harlem is on Mister Big's payroll. And they've got a seemingly endless bag of tricks to play on him. The funny thing about Moore is that he's very proper and British and doesn't think anything of walking into a tough Harlem bar while dressed up like the Duke of Edinburgh. His stunned reactions when they mess with his head are seriously funny.\n\nThe action then moves to Lousiana and a savage Caribbean island as JB uncovers a massive heroin plot. There's a particularly long speedboat chase across a bayou where JB encounters Sheriff J.W. Pepper, the most stereotypical southern redneck ever. Think of Texas Businessman from The Simpsons and you get the idea. JB also gets to dodge a hundred hungry Gators and do, many times over, Solitaire, Mister Big's Tarot card reader.\n\nI'm not sure what kind of formidable villain uses a Tarot card reader to help him do business but when you also surround yourself with a hook-handed maniac called Tee-Hee, a quiet fat guy called Whisper and a seemingly unkillable voodoo high priest called Baron Samedi then you really do become a serious baddie. Right? He even goes on a big speech about how his master plan works before attempting to kill JB slowly. Obviously this makes much more sense than just shooting him right away. When will they learn?\n\nDespite being the oldest actor to debut as Bond (at 46), Moore does look younger than Connery. And while Sean was gruff and Scottish, Moore is perpetually calm and refined, even in the face of danger (fingers being chopped-off, snake in the bath, being eaten by gators/sharks). Everything that the British once thought they were. He has a certain sarcastic edge that the other Bond actors lacked. While some of his films may have been the sillier of the franchise, Moore has always been my favorite. And the massive revolver and holster he uses at the end is so much more masculine than the usual, wimpy as hell, Walther PPK.\n\nAnd, as much as I am no fan of Paul McCartney, you gotta love that theme song! Exciting and iconic at the same time. And also yet another juxtaposition in the weirdest Bond movie ever. \n\nMI6, Harlem, Pimps, Paul McCartney, Gators, Heroin, Voodoo, Snakes, Sharks, Clairvoyance, Rednecks, Afros, Fake Afros, Fillet of Soul, Human Scarifice, Scarecrows and a small-headed man in a Top-Hat who lost a fight with chickens. Is this a Bond film or did the whole world just go insane?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "On this IMDbrief, presented by Progressive, let's look at the evolution of the women who loved the spy, and hear from four who co-star with Daniel Craig in Bond 25.",
        "duration": "PT6M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3772365849",
        "name": "These Bond Women Are Changing the Spy Game",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzI0Yjg1NTEtNDk3Zi00MzljLTk5Y2MtNmYwYWNlMTViYzVkXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzI0Yjg1NTEtNDk3Zi00MzljLTk5Y2MtNmYwYWNlMTViYzVkXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg",
        "uploadDate": "2019-05-23T21:20:23.510Z",
        "url": "https://www.imdb.com/video/vi3772365849/"
    },
    "url": "/title/tt0070328/"
}