{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liberto Rabal",
            "url": "/name/nm0704721/"
        },
        {
            "@type": "Person",
            "name": "Francesca Neri",
            "url": "/name/nm0626202/"
        },
        {
            "@type": "Person",
            "name": "Javier Bardem",
            "url": "/name/nm0000849/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32469,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Live Flesh",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0006440/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008195/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Person",
            "name": "Pedro Almodóvar",
            "url": "/name/nm0000264/"
        },
        {
            "@type": "Person",
            "name": "Ruth Rendell",
            "url": "/name/nm0719334/"
        },
        {
            "@type": "Person",
            "name": "Ray Loriga",
            "url": "/name/nm0520943/"
        }
    ],
    "datePublished": "1998-01-16",
    "description": "After leaving jail, Víctor is still in love with Elena, but she's married to the former cop -now basketball player- who became paralysed by a shot from Víctor's gun...",
    "director": [
        {
            "@type": "Person",
            "name": "Pedro Almodóvar",
            "url": "/name/nm0000264/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2EwNDI5NjctZmMyNS00NzFlLTlkN2ItMzAwY2I0YTdkMzdjXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "erotica,male frontal nudity,wheelchair basketball,prison,pizza",
    "name": "Carne trémula",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stryker-5"
        },
        "dateCreated": "2002-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118819/"
        },
        "name": "\"Una Vida Sobre Ruedos\"",
        "reviewBody": "One of Almodovar's favourite conceits is the use of old TV and movie images as ironic commentary on our modern lives. He loves the sheer trashiness of those millions of hours of low-grade output and he likes to mimic 1950's sitcom formats (\"Women On The Verge\") or to splice 'quotes' from old footage into his modern tales. It's a device which he uses very effectively in this film. When the gun is fired in the apartment, a shot rings out from the TV set in the corner. The fake news item of the bus birth, in black and white to represent the drabness of Franco's Spain, is a loving recreation of TV's golden age. Women are mannequins in these old TV shows, used by men as objects of prurient displays, and of violence. Our mass media have drugged us, suggests Almodovar, into being passive recipients of authority's handouts. We can no longer distinguish between entertainment and reality. David confronts Victor and wounds him in the testicles, but the two enemies are immediately distracted by the soccer game on TV and become 'guys together', forgetting their hatred in the communal false orgasm of the scored goal.\n\n Names are always important in Almodovar films, and in this one they hold the key to the story's many meanings. Elena is Helen of Troy, the creature who radiates unconscious sexual appeal and leads men into war and destruction. Victor Plaza's name contains several layers of symbolic importance. He is the film's real victor, overcoming the misfortune of the shooting and his own sexual imbecility to attain true happiness in America. Many Spanish towns have a 'Plaza de la Victoria', a municipal tribute to the great historical sea triumph of Lepanto. In this sense Victor's name makes him the personification of ordinary Spanish life, a hispanic Everyman. Isabel Plaza Caballero, the prostitute whose wretched short life becomes a saintly image of suffering and continuity, has the name of Spain's great Catholic queen and the title of a 'gentlewoman'. For Almodovar there is no contradiction in a whore having nobility. Sancho is a kind of Sancho Panza to David's Quixote, the latter idealistic but impotent, the former iconoclastic and comical.\n\n Almodovar's trademark is the looping circular plot in which the characters both repeat and vary their patterns of behaviour, crossing one another's paths and inadvertently echoing the actions of others. Nowhere is this better illustrated than here. The plot is almost literally circular, beginning and ending with childbirth in a wheeled vehicle, and Victor's life-defining moment hinging on the circular bus ride which brings him back to the identical spot where he started, a payphone on the Calle Eduardo Dato. The characters penetrate one another's lives in ways that are totally convincing, and with a grounding in human psychology which few writers or directors can display.\n\n Opposites and contradictions are everywhere. Victor is the prison convict, the sexual inadequate born of a prostitute on a bus, who rises to become an admirable man, sexually proficient, successful, and a loving husband and father. Sancho the macho cop is a spiritual cripple, relying on alcohol to deaden the pain of his failure as a lover. David the real cripple is a national sporting hero. The mother is the whore, the charity director is the heroin addict and the naive lad is the jailbird. The welcome mat on Clara's threshold is the cruellest of ironies. Marriage and sexual coupling are the fabric of the story, but in fact everyone is cuckolded sooner or later. David used to 'service' Clara, now Victor performs that function, and the 'manly' Sancho is sexually redundant. Elena copulates with Victor at the dramatic climax, and we recall that it was a sexual encounter between these two which launched the whole story.\n\n It is hard to watch Almodovar's work without thinking of Bunuel. The adolescent preoccupation with the 'obscure object of desire' is a good example. Almodovar is fascinated by the vagina, and over and over again in this film we see men's heads buried between women's legs. Two boy children emerge from wombs, David performs oral sex on Elena in the bath, Victor studies Clara's pudendum, David approaches Elena's genitalia along his wheelchair ramp. The great sloping twin towers of Madrid's Puerta de Europa form an architectural pun, a visual representation of a woman's open thighs. Victor's emotional speech at Isabel's burial site (apart from advancing the plot neatly) is one more image of a man's face in a woman's vagina, the grave being the ultimate womb. This particular vagina brought Victor into the world, and through its immoral earnings it gave him the money to live.\n\n The first Christmas in the film, like the First Christmas, happens in a very unpromising setting. It is cold in Madrid in every sense. The final years of Franco's joyless, oppressive reign are conveyed very effectively in a restrained palette of blacks, browns and greys. A state of emergency has been declared by a faceless Authority, grown paranoid about the danger of 'outside influences'. Victor has entered a drab and frightened world, with a bus driver as his reluctant Joseph. By the close of the film Christmas has acquired its cheerful capitalist trappings. This is a 'Christmas in the sun'. Victor is in the young land of freedom and opportunity. He has come of age and is now the complete man. The future looks bright for the New David, father and son."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3300768537",
        "name": "Trailer OV",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmNhMjdjNzgtOTJiNS00MjY5LWI4NTQtNGJhZDc5YTE4ZjA4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmNhMjdjNzgtOTJiNS00MjY5LWI4NTQtNGJhZDc5YTE4ZjA4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-05-18T15:11:06Z",
        "url": "https://www.imdb.com/video/vi3300768537/"
    },
    "url": "/title/tt0118819/"
}