{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Noel Gallagher",
            "url": "/name/nm0302462/"
        },
        {
            "@type": "Person",
            "name": "Liam Gallagher",
            "url": "/name/nm0302427/"
        },
        {
            "@type": "Person",
            "name": "Damon Albarn",
            "url": "/name/nm0016332/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1285,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103812/"
        },
        {
            "@type": "Person",
            "name": "John Dower",
            "url": "/name/nm0235770/"
        }
    ],
    "datePublished": "2003-03-07",
    "description": "The story of the mid-1990s Britpop music scene.",
    "director": [
        {
            "@type": "Person",
            "name": "John Dower",
            "url": "/name/nm0235770/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxMjAwMTY3MV5BMl5BanBnXkFtZTcwMTg2OTEzMQ@@._V1_.jpg",
    "keywords": "britpop,british music,retrospective,british rock music,rock band",
    "name": "Live Forever",
    "original_info": {
        "id": "Live Forever_2003",
        "name": "Live Forever",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ricky_Roma__"
        },
        "dateCreated": "2006-07-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0358569/"
        },
        "name": "Rose-tinted spectacles",
        "reviewBody": "Liam Gallagher is a wonderful human being. You don't believe me? Just watch Live Forever and witness the Manchunian ape-boy respond to the interviewer calling him 'androgynous'. At first he's puzzled, but when the word is explained to him he wonders whether he's being called a girl. But then when this curious word is explained in even greater detail, he admits that yes, he is indeed a pretty boy. \"I take care of me hair.\" What a guy.\n\nBut even more endearing than this is when Liam is asked what the characteristics of a great rock band are. \"'aving it,\" he replies. And then after a lengthy pause he continues, \"And by us 'aving it, hopefully some other people will learn how to 'ave it.\" And as he says this, he turns to the camera and does a sly 'Bang, bang' with his fingers. Liam, can I give you a hug? \n\nBut Liam isn't finished. Just when the dumb bastard couldn't get any more lovable he says that the S Club Juniors are: \"Good little kids, man.\" I have no idea what goes on in that man's head, but the words he incoherently pukes out are pure gold.\n\nFurther evidence of Liam's genius is in his reaction to 80s pop stars. \"You ain't got nowt to say. You don't look like rock stars. You look like dicks in tights.\" And then to cap everything off, during the end titles, he tells a bizarre story of how he fought his brother as a child and came home with broken limbs and a shotgun over his shoulder(?!?). That's life on Planet Liam, I guess.\n\nBut it says a lot for Britpop when a man of Liam's limited mental capacity became a cover boy. Here's a guy who can barely string a sentence together and who thought he was playing one night at Knebworth instead of two. It wasn't really a movement forged by insight and intelligence.\n\nHaving said that, Jarvis Cocker does pop up to prove that not everyone involved was brain dead. And Noel Gallagher is good value, too. And although he seems to take himself far too seriously, Damon Albarn (when he decides to stop fiddling with his ukulele) has some reasonably intelligent thoughts to share as well. But having said all that, was the music any good? Well, like any scene, some of it was and some of it wasn't.\n\nOf the bands that are featured, I think the early Oasis stuff still holds up. It has tons of energy, and unlike Nirvana, there's no whining. But I have to say that I can't stand songs like 'Parklife' and 'Country House' (even 'Common People' is grating)  they sound to me like novelty records. And of course, while idiots like James Brown (not THE James Brown) were talking about the glory days, I couldn't help but think of bands like Dodgy and Menswear.\n\nBut it's notable that almost all the more interesting bands of that era only get a brief mention. You hear a snatch of The Verve, you hear a few thoughts from 3D out of Massive Attack and Portishead is quickly referenced. And it's also worth noting that while various media figures talk about how big Oasis became, they never really were the biggest band in the world. If anything, Radiohead were bigger (they were the only British band of the era to crack the States). However, Radiohead only get a brief mention. (It's probably to their credit that they're never really associated with 'Britpop'.) \n\nAnd another band that only gets a brief mention is The Stone Roses; you'd think 'The Second Coming' never happened, even though everything else in the film pales in comparison. But thankfully the Roses ignored Britpop and produced a record that had more in common with Led Zeppelin than The Beatles, thus ensuring that music critics quickly wrote it off. But the band's influence is mentioned at the beginning of the film when Spike Island is referenced. And it's a shame that they weren't the ones to make it big. They were smarter than Oasis, they wrote better songs and they were better musicians. Indeed, Oasis are just Stone Roses Lite. I mean, as cocky Liam and Noel are, beneath it all they're quite respectable. Sure they swear a lot, but they constantly doff their cap at their favourite bands, appear on chat shows and play the game. The Roses on the other hand were little bastards. Their arrogance was through the roof. But they also had integrity. They certainly wouldn't have turned up at Downing Street and they certainly wouldn't have chugged Tony Blair's genitals at The Brits.\n\nAnd it's the whole sorry episode of Noel going to visit the new Prime Minister that shows how empty the Britpop movement was. It wasn't about rebellion, it was about new rock stars acting like old rock stars; as dangerous and rebellious as they want to be, they also want to be part of the establishment. And it was truly sickening to see Noel's mug on the New Labour magazine proclaiming that a speech Tony Blair gave made him cry. These were people we worshipped at the timeand they were f***wits! (Just as stupidly, Damon Albarn says he once thought that New Labour were actually interested in what he had to say.) \n\nBut although Britpop was a superficial movement (we see lots of shots of Kate Moss, Naomi Campbell, Jo Guest and Loaded Magazine, and people like Damien Hurst are interviewed  wow, those were certainly halcyon days!) and the music wasn't as good as we all remember, it at least gave us Liam Gallagher, a man who is as dumb and blindly confident as all good rock stars should be. He certainly beats Chris 'Fair Trade' Martin and Tom 'Touchy-Feely Fat Boy' Chaplin."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Live Forever",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3600154905",
        "name": "Live Forever",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzkzYTdmY2ItN2U0Yi00MzIyLTllODEtMjE0YzE1NjM1MWVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzkzYTdmY2ItN2U0Yi00MzIyLTllODEtMjE0YzE1NjM1MWVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:02:34Z",
        "url": "https://www.imdb.com/video/vi3600154905/"
    },
    "url": "/title/tt0358569/"
}