{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julia Query",
            "url": "/name/nm0703300/"
        },
        {
            "@type": "Person",
            "name": "Jane",
            "url": "/name/nm7993143/"
        },
        {
            "@type": "Person",
            "name": "Siobhan Brooks",
            "url": "/name/nm4074633/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 504,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058650/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065639/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036348/"
        },
        {
            "@type": "Person",
            "name": "Vicky Funari",
            "url": "/name/nm0298586/"
        },
        {
            "@type": "Person",
            "name": "Julia Query",
            "url": "/name/nm0703300/"
        }
    ],
    "description": "Documentary look at the 1996-97 effort of the dancers and support staff at a San Francisco peep show, The Lusty Lady, to unionize. Angered by arbitrary and race-based wage policies, customers' surreptitious video cameras, and no p...",
    "director": [
        {
            "@type": "Person",
            "name": "Vicky Funari",
            "url": "/name/nm0298586/"
        },
        {
            "@type": "Person",
            "name": "Julia Query",
            "url": "/name/nm0703300/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE0Njk3NTg4M15BMl5BanBnXkFtZTcwMjcyNTMyMQ@@._V1_.jpg",
    "keywords": "f rated,female nudity,striptease,peep show,mother daughter relationship",
    "name": "Live Nude Girls Unite!",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ibuck-2"
        },
        "dateCreated": "2001-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0264802/"
        },
        "name": "Union YES!",
        "reviewBody": "I can only assume that the current low rating of this film, despite generally positive comments, is a result of a bunch of idiotic guys renting this thinking it'll be some nice T&A and then being p***ed off because not only are they being asked to THINK, but they're also being asked to show sex industry workers some RESPECT. Looking at the gender breakdown of the votes only further supports this theory. This fact only goes to show why the actions taken by the women of the Lusty Lady are SO important. My fiancee is a stripper, not because she finds it to be fun work, but because it's a decent paying job for a freelance artist between jobs. The funny thing is, people want to believe that those girls are there because they have some sexual compulsion to; hence girls are often asked, \"So what do you do for a living?\" Any guy reading this who has ever asked a stripper this question, please go jump off the nearest bridge. We don't need morons like you in the gene pool.\n\nAnyway, this mentality, that strippers aren't workers (and try dancing in 8 inch platform heels for 8 hours and tell me it's not hard work), but are sex crazed exhibitionists, fuels the concept that they can be mistreated in the workplace. This movie shows how these women stood up to a negative cultural perception of them to take control of their workplace and fight for the same rights afforded to other workers. It's an inspiring story, and I'd like to think that if more people saw it, and were presented with stories like this more often, maybe we could finally change the public perception of these women.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0264802/"
}