{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Onika Day",
            "url": "/name/nm1307878/"
        },
        {
            "@type": "Person",
            "name": "Shawn Harris",
            "url": "/name/nm1396701/"
        },
        {
            "@type": "Person",
            "name": "Archie Howard",
            "url": "/name/nm1139038/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 71,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0102369/"
        },
        {
            "@type": "Person",
            "name": "Joseph Brown",
            "url": "/name/nm0113912/"
        }
    ],
    "datePublished": "2003-04-22",
    "description": "Two friends, Jamal and Peanut go through their daily routines in Compton. The two inadvertently apprehend a theif who was breaking into Jamal's house but then the thief drops dead in front of them.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Brown",
            "url": "/name/nm0113912/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTc5NDMyODk1Ml5BMl5BanBnXkFtZTcwMDE2OTQyMQ@@._V1_.jpg",
    "name": "Livin' tha Life",
    "original_info": {
        "id": "Livin' tha Life_2003",
        "name": "Livin' tha Life",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cagney911"
        },
        "dateCreated": "2003-07-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0371795/"
        },
        "name": "Better Than You'd Imagine",
        "reviewBody": "Consider the facts from the director's commentary: this was shot by a first time filmmaker on digital video with a shooting budget of $400, using comedians who've never acted before found in a local club in Los Angeles and allowing them to improvise based on a skeletal plot structure... And yet, despite all the places where this film can go SO wrong and remain ignored at the video store, it would be a crime not to check it out. There is A LOT of surprisingly funny moments here. The foul mouthed grade schooler bullying adults out of money. The barber who can't focus on cutting hair for want of running Yo Momma jokes on a customer. The Crazy Uncle with Vietnam flashbacks... More... And the chemistry between the two leads is startlingly rich and natural-- they work well together. Because the moments of physical comedy here are at times so broad, so slapstick, so vaudevillian, it made the film feel old fashioned-- that this could just as well been an Abbott and Costello flick remade by John Singleton. With all comedies, not all the jokes work (the crabs subplot? eh!) and this isn't one of the Greatest Films Ever... But it really charmed me and had several moments that I kept going back to over and over. It ain't worth an Oscar, but its well worth renting!"
    },
    "url": "/title/tt0371795/"
}