{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Erwin Chemerinsky",
            "url": "/name/nm1384416/"
        },
        {
            "@type": "Person",
            "name": "Harold Velde",
            "url": "/name/nm1387842/"
        },
        {
            "@type": "Person",
            "name": "James Lafferty",
            "url": "/name/nm1385896/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0027708/"
        }
    ],
    "director": [
        {
            "@type": "Person",
            "name": "Catherine Hollander",
            "url": "/name/nm1107486/"
        },
        {
            "@type": "Person",
            "name": "Laura Nix",
            "url": "/name/nm0633177/"
        }
    ],
    "duration": "PT25M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "keywords": "freedom of speech,civil rights,civil liberties",
    "name": "Lockdown on Main Street",
    "original_info": {
        "id": "Lockdown_2003",
        "name": "Lockdown",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dcalyn"
        },
        "dateCreated": "2007-11-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0367978/"
        },
        "name": "ACLU is part of the problem, not the solution.",
        "reviewBody": "I didn't mind this documentary, though it was heavily liberally biased, it still made sense in many ways, I don't agree with the Patriot Act in many ways but in some cases I do. It didn't need to be on the Running Man Video that was just a really coy way of preaching a Liberal Gospel to people. (IE The filmmakers telling you that you have to see that, in Our Opinion The Bush Administration is just so terrible)\n\nThis video was okay up until they had The ACLU involved giving their two cents. That's when it ceased to hold any water with me as the ACLU is responsible from taking an unlimited amount of liberties to wreck havoc on communities that are united in their beliefs. Just because one person is offended or affronted this gives no just cause to take away the majority of the community's beliefs or practices. The Government as far as I am concerned maybe dangerous, but those at the ACLU who connive and wheel and deal law suits against other peoples beliefs, while at the same time take cases for Child Pornographers, Convicted Terrorists, and anyone who has a gripe with the Judeo-Christian Community is just plain undermining authority and wrong. And if you don't think it is just wait, because when you mess with someone's right to disagree and force them to submit to your opinion rather than winning that person over, then guess what? You'll wake up one day and find that your freedom of speech has been taken away from you too.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0367978/"
}