{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martine Carol",
            "url": "/name/nm0138987/"
        },
        {
            "@type": "Person",
            "name": "Peter Ustinov",
            "url": "/name/nm0001811/"
        },
        {
            "@type": "Person",
            "name": "Anton Walbrook",
            "url": "/name/nm0906932/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5652,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023365/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023365/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057283/"
        },
        {
            "@type": "Person",
            "name": "Jacques Laurent",
            "url": "/name/nm0491240/"
        },
        {
            "@type": "Person",
            "name": "Max Ophüls",
            "url": "/name/nm0649097/"
        },
        {
            "@type": "Person",
            "name": "Annette Wademant",
            "url": "/name/nm0905539/"
        }
    ],
    "datePublished": "1955-12-23",
    "description": "When she is reduced to appearing in a circus, a notorious beauty thinks back on her past loves.",
    "director": [
        {
            "@type": "Person",
            "name": "Max Ophüls",
            "url": "/name/nm0649097/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDRlODllZjktY2I2NC00MDZjLWFkMTgtY2FiOGNhMzg5OGNkXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "character name as title,lola montez character,two word title,man kisses a woman's foot,1850s",
    "name": "Lola Montès",
    "original_info": {
        "id": "Lola Montes_1955",
        "name": "Lola Montes",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Boba_Fett1138"
        },
        "dateCreated": "2010-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048308/"
        },
        "name": "Unfortunately Max Ophüls' only color movie, is one to remember.",
        "reviewBody": "This movie made me wish Max Ophüls would had made more color movies during his career. This is the only color movie he did and the last movie he completed as well, after passing away way too early in 1957. It's a beautiful, colorful looking movie, that has some of the usual typical Max Ophüls ingredients in it as well.\n\nI can definitely understand people finding Max Ophüls boring ones to watch. They are not just movies for just everybody, especially not for todays usual type of audience. Luckily the majority of people still seem to be able to appreciate his movies and his more slow but very stylish and strong way of story-telling.\n\nIt's narrative is probably the movie its strongest point. It isn't necessarily the story itself this time that makes this movie stand out. It's a movie that follows a plot-line set in the present, combined with another story, that of Lola Montès life, told in flashbacks. It's an approach that works out so well and interesting for the movie.\n\nI wouldn't exactly call this movie a real biopic, since it only focuses on some of the early years of Lola Montès her life. In all honesty, I think her real life and character was much more interesting and complex than the one that is being told in this movie but that would had simply made an entire different movie. So it really doesn't matter that this movie takes a lot of liberties and only tells a small part of Lola Montès her entire lifespan. This was simply not the approach that had been chosen by Max Ophüls, who simply tried to tell a good, compelling, compact story, about an intriguing woman. Max Ophüls always seemed to have had a fascination for female behavior and especially for those that didn't simply went with the flow and did other things than were expected from them. He did this even with movies that were about simple housewives and was not afraid to show people how they often really are and that not everything is always black and white in life.\n\nLike basically every big Max Ophüls movie, this one is a period piece, which means that is has some great looking sets and costumes, that this time even catch more attention, since it got all shot in color. But that doesn't mean that it distracts from the story or all of the other typical Max Ophüls elements that make most of his movie so incredibly effective and compelling to watch, with this one included.\n\n8/10\n\nhttp://bobafett1138.blogspot.com/",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for the Criterion Collection release",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2467235609",
        "name": "Lola Montes",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTczZTcyMDEtMzQxZC00ZmU5LThlNDAtOTIzNmQwNWExYmY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTczZTcyMDEtMzQxZC00ZmU5LThlNDAtOTIzNmQwNWExYmY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:32:32Z",
        "url": "https://www.imdb.com/video/vi2467235609/"
    },
    "url": "/title/tt0048308/"
}