{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeremy Irons",
            "url": "/name/nm0000460/"
        },
        {
            "@type": "Person",
            "name": "Dominique Swain",
            "url": "/name/nm0000663/"
        },
        {
            "@type": "Person",
            "name": "Melanie Griffith",
            "url": "/name/nm0000429/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 61834,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040268/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053732/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068747/"
        },
        {
            "@type": "Person",
            "name": "Vladimir Nabokov",
            "url": "/name/nm0618603/"
        },
        {
            "@type": "Person",
            "name": "Stephen Schiff",
            "url": "/name/nm0771496/"
        }
    ],
    "datePublished": "1998-09-25",
    "description": "An English professor falls for a minor, and has to face the consequences of his actions.",
    "director": [
        {
            "@type": "Person",
            "name": "Adrian Lyne",
            "url": "/name/nm0001490/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGNkZDU0YjktN2Q5Zi00MmY0LWI3Y2YtNmQzOGQxY2UzNGM3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "teenage girl,14 year old,forbidden love,lust,stepfather stepdaughter relationship",
    "name": "Lolita",
    "original_info": {
        "id": "Lolita_1997",
        "name": "Lolita",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2000-08-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119558/"
        },
        "name": "Lost Narrative Folds",
        "reviewBody": "The Author would be dismayed, and precisely because the story is so faithful to the book. But the story in the book was incidental, just something on which Nabokov could hang his layered challenges to concepts of narrative. The narrator is crazy, overly colors and outright lies. The story never fully exists in the book at all, and such as it does one can never be sure what is true and what imagined. Humbert is a made up name (as are all names) and clearly the narrator makes up most of the elements of his own character as well (European, Professor, Author... obviously a joke by the narrator on Nabokov).\n\nIn this film, everything makes sense, exactly the opposite of the reason the book exists. This is a beautiful film, with lovely detailed cinematography, good acting and great score, and all to solidify something that Nabokov created such that it could not be so. I believe that Peter Greenaway could make a good film of Lolita, and that he would have the courage to make it confusing and unerotic and unresolved. Why does Dolores' fate have to change in the film's epilogue? Because it ties up every last loose end. On Christmas Day no less!\n\n(The real scandal is not that audiences/censors are shocked by prurient subjects, but that they take one of the greatest literary achievements ever and make it \"explainable.\" Is this the only thing we can accept?)\n\nBut take the film on its own presumption that the book's story is what matters. This Lolita is too old, too pretty and sexy, too controlling. Irons is clearly narrowly channeled here and he is smart enough to know it: his frustration with the unimaginative stance of the film translates to a frustrated Humbert. I think Melanie is just right (just because HH calls her a cow means nothing). HH's violence with his previous wife should have been mentioned; her running away with the Russian cabbie is as much a setup for the Lolita fixation as the childhood dalliance, and better justifies the angst of loss. There should have been a few butterflies, and some explanation about the play: that it was written to allude to that first night at the hotel.\n\nI highly recommend the audio tape version of Lolita. It is read by (guess...) Jeremy Irons! What he brings to the audio tape is the voice and phrasing of a man in a cell continually going over things in his own mind, embellishing and exaggerating and confusing and speculating and sometimes not at all sure about any of it. He brings this same voice to the voiceovers in the film, but it conflicts with the images which purport to represent a narrative stance of \"real truth\"."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Trimark",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi883622169",
        "name": "Lolita (1997)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWZhMTJiNDQtMjk1Ni00MjhiLWI3NmQtYmU4YTA5NTkzMWQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWZhMTJiNDQtMjk1Ni00MjhiLWI3NmQtYmU4YTA5NTkzMWQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:20:05Z",
        "url": "https://www.imdb.com/video/vi883622169/"
    },
    "url": "/title/tt0119558/"
}