{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tomisaburô Wakayama",
            "url": "/name/nm0423663/"
        },
        {
            "@type": "Person",
            "name": "Gô Katô",
            "url": "/name/nm0441351/"
        },
        {
            "@type": "Person",
            "name": "Yûko Hama",
            "url": "/name/nm3944840/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5322,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Lone Wolf and Cub: Baby Cart to Hades",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037408/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Kazuo Koike",
            "url": "/name/nm0463521/"
        },
        {
            "@type": "Person",
            "name": "Goseki Kojima",
            "url": "/name/nm0463618/"
        }
    ],
    "description": "Ogami Itto volunteers to be tortured by the yakuza to save a prostitute and is hired by their leader to kill an evil chamberlain.",
    "director": [
        {
            "@type": "Person",
            "name": "Kenji Misumi",
            "url": "/name/nm0593014/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzk2MjIyZjMtMWNlNC00OWQ3LWIwODMtOWVmYzdiMzViZGMxXkEyXkFqcGdeQXVyNDIwODAwNzg@._V1_.jpg",
    "keywords": "ninja,opening action scene,hand to hand combat,gunfight,shootout",
    "name": "Kozure Ôkami: Shinikazeni mukau ubaguruma",
    "original_info": {
        "id": "Lone Wolf and Cub: Baby Cart to Hades_1972",
        "name": "Lone Wolf and Cub: Baby Cart to Hades",
        "year": "1972"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pjtaylor-96-138044"
        },
        "dateCreated": "2020-12-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068817/"
        },
        "name": "More of the same, yet similarly enjoyable.",
        "reviewBody": "The 'Lone Wolf And Cub' series continues with its third outing, this time seeing its eponymous assassins help out an unwilling would-be prostitute by taking her place for punishment. It's probably the most 'noble' thing that its stoic anti-hero has done thus far, even if volunteering for torture seems far less convenient than just killing his aggressors (which we know he is capable of doing and usually willing to do so). After this, the assassins (yes, Diagoro is an accessory to most of the killings) are given the task of taking out a corrupt official, which leads to an absolutely fantastic finale that sees the pair take on what's seemingly a hundred foes at once. As usual, the baby cart has a few surprises in store for the protagonist's enemies (which also includes a string of assassins sent by the Yagyu clan they crossed in their first outing); this time, we're treated to possibly the best, most outlandish one yet. It's really this final movement that makes the affair as successful as it is. Though its overall story is a bit scatterbrained (I haven't even mentioned the third plot-line about a mercenary who wants to die an honourable death), 'Lone Wolf And Cub: Baby Cart To Hades (1972)' comes together in a satisfying and smile-inducing climactic battle that raises the quality of the entire effort. Before this, the film is somewhat meandering and, in a way, a little light on the bloodletting you expect from the series. It also doesn't have a solid through-line and, essentially, feels like more of the same. There's also an unnecessary and somewhat dodgy rape scene early on that lasts for far too long; it's the sort of sequence that seems to be aiming for the specific crowd that enjoys seeing that sort of stuff, which is a crowd I don't want anywhere near me. Still, the movie (which is an exploitation piece from the early seventies) is undeniably enjoyable when its focus is in the right place. It's a short, almost inconsequential action flick with a hint of stoic philosophy and a lot of dead bodies. 6/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "With more spoilers than you can shake a gaffi stick at, this IMDbrief breaks down the wild western premiere of \"The Mandalorian\" on Disney+.",
        "duration": "PT4M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3487547161",
        "name": "\"The Mandalorian\" Takes Star Wars to Wild West of Space",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDdjNDVjNmEtMmMxYi00ZWMwLWFhMjItOGJlMTMyYmUyNTRhXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDdjNDVjNmEtMmMxYi00ZWMwLWFhMjItOGJlMTMyYmUyNTRhXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg",
        "uploadDate": "2019-11-14T00:54:01.090Z",
        "url": "https://www.imdb.com/video/vi3487547161/"
    },
    "url": "/title/tt0068817/"
}