{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tomisaburô Wakayama",
            "url": "/name/nm0423663/"
        },
        {
            "@type": "Person",
            "name": "Michiyo Yasuda",
            "url": "/name/nm0644856/"
        },
        {
            "@type": "Person",
            "name": "Akihiro Tomikawa",
            "url": "/name/nm0866674/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4394,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Lone Wolf and Cub: Baby Cart in the Land of Demons",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Kazuo Koike",
            "url": "/name/nm0463521/"
        },
        {
            "@type": "Person",
            "name": "Tsutomu Nakamura",
            "url": "/name/nm2919190/"
        }
    ],
    "datePublished": "1973-08-11",
    "description": "Five warriors challenge Ogami to duels. Each holds a part of information needed to complete the assassination of a mad clan leader.",
    "director": [
        {
            "@type": "Person",
            "name": "Kenji Misumi",
            "url": "/name/nm0593014/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTZmMzJhMzktZmVlNi00OGVkLTgzYmItMmFmMWM2YmEzMDJjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "hero,action hero,tough guy,one man army,one against many",
    "name": "Kozure Ôkami: Meifumadô",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Leofwine_draca"
        },
        "dateCreated": "2012-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0143428/"
        },
        "name": "Entry 5/6 in tough samurai series",
        "reviewBody": "The indefatigable Itto Ogami continues his journey through feudal Japan with his son in tow. BABY CART IN THE LAND OF DEMONS is the fifth in the six-film series and for the first time, the film shows signs of flagging. It's not that I didn't enjoy this movie, because I did; rather, I started to find the plot shenanigans to be ever-so-slightly familiar, if not a little tired. Much of what goes on in the film has been seen before, and although the action sequences are as vivid as ever, there's little here that hasn't been done previously (and better).\n\nAs per usual, Ogami finds himself caught up in plotting between various factions and must form political allegiances to see him through. The opening of the film sees him tackling a series of martial arts masters, all of whom test him unawares to make sure he's worthy of the job. The plot then takes a lengthy and slightly pointless detour to a market village where Daigoro is accused of helping a pickpocket conduct her business. Although this sequence has been incorporated to allow greater characterisation of Ogami's son, I found it dragged the pacing down to crawling speed.\n\nThankfully, things pick up for a relatively exciting climax which sees Ogami finishing off his job. There's still a great deal of entertainment value from watching the various characters occupying different positions in Japanese society at this time and how they react to our hero. The cast give understated performances and the action is typically well shot, but I'm actually looking forward to the end of this series now: better to end on a high than dragging it into the ground.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0143428/"
}