{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tomisaburô Wakayama",
            "url": "/name/nm0423663/"
        },
        {
            "@type": "Person",
            "name": "Akihiro Tomikawa",
            "url": "/name/nm0866674/"
        },
        {
            "@type": "Person",
            "name": "Junko Hitomi",
            "url": "/name/nm0386951/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4082,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Lone Wolf and Cub: White Heaven in Hell",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037408/"
        },
        {
            "@type": "Person",
            "name": "Kazuo Koike",
            "url": "/name/nm0463521/"
        },
        {
            "@type": "Person",
            "name": "Goseki Kojima",
            "url": "/name/nm0463618/"
        },
        {
            "@type": "Person",
            "name": "Tsutomu Nakamura",
            "url": "/name/nm2919190/"
        }
    ],
    "datePublished": "1974-04-24",
    "description": "In the sixth and final film of the Lone Wolf and Cub series, the final conflict between Ogami Itto and the Yagyu clan is carried out.",
    "director": [
        {
            "@type": "Person",
            "name": "Yoshiyuki Kuroda",
            "url": "/name/nm0475852/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTJlYTdmMTktODVhNy00NjZlLWIyMzUtMjQwYzg0N2E0MzgzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "supernatural power,psychotronic film,based on manga,brother sister incest,rape",
    "name": "Kozure Ôkami: Jigoku e ikuzo! Daigorô",
    "original_info": {
        "id": "Lone Wolf and Cub: White Heaven in Hell_1974",
        "name": "Lone Wolf and Cub: White Heaven in Hell",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Leofwine_draca"
        },
        "dateCreated": "2012-08-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071695/"
        },
        "name": "Disappointing conclusion to the series",
        "reviewBody": "I was really looking forward to seeing WHITE HEAVEN IN HELL, the conclusion of the six-part LONE WOLF & CUB series of films charting the misadventures of Itto Ogami and his son Daigoro as they travel the violent landscapes of feudal Japan. Earlier films in the series – especially my favourite, the second one – have been excellent, so I was enthused to see how they finished the long-running storyline off. The bad news is that they don't; this was never intended to be the last film in the series, so things just close on a cliffhanger that was never followed up. I won't pretend that I'm not disappointed.\n\nThere's both good news and bad news for fans of this series. It's simple: WHITE HEAVEN IN HELL offers more of the same of what's come before. So there's plenty of villainous plotting, scenes of Daigoro being the lad we all know and love, and Ogami taking down numerous opponents without breaking much of a sweat. The villains are hissable, Ogami is effortlessly cool, and by now we all know what's going to happen come the end.\n\nYet the familiarity of this film's plot is also its downfall. I was starting to feel that things were getting a little stale in the last instalment, and that feeling is now overwhelming. The expert direction and effortless atmosphere of the earlier films is missing, and I couldn't help but feel that things were getting a little run-of-the-mill this time around. Certainly, nothing much happens we haven't seen before.\n\nThe writers try to mix things up a bit by introducing more outlandish elements to the script. I like crazy stuff in films, so I was pleased to see the presence of the undead here, and some elements of horror mixed into the narrative, but it's never fully capitalised upon. And the ending is a real let-down, an icy encounter between our feared hero and an army of skiing enemies; it's neither particularly gory nor exciting, instead coming across as rather silly. If you sit back and remember the triumphant, eye-popping ending of BABY CART AT THE RIVER STYX and compare it with what's on offer here, it's a real disappointment. And although they never did close that storyline, I'm kind of glad that things ended with this film. I can only feel they would have otherwise run this series into the ground eventually.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0071695/"
}