{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeremy Irons",
            "url": "/name/nm0000460/"
        },
        {
            "@type": "Person",
            "name": "Anna Chancellor",
            "url": "/name/nm0151250/"
        },
        {
            "@type": "Person",
            "name": "Emma Kay",
            "url": "/name/nm0443035/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2323,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103414/"
        },
        {
            "@type": "Person",
            "name": "Dava Sobel",
            "url": "/name/nm0811750/"
        },
        {
            "@type": "Person",
            "name": "Charles Sturridge",
            "url": "/name/nm0836430/"
        }
    ],
    "datePublished": "2000-01-02",
    "description": "In two parallel stories, the clockmaker John Harrison builds the marine chronometer for safe navigation at sea in the 18th Century and the horologist Rupert Gould becomes obsessed with restoring it in the 20th Century.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Sturridge",
            "url": "/name/nm0836430/"
        }
    ],
    "duration": "PT3H20M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU2MTgzMjYyM15BMl5BanBnXkFtZTcwNTc1NzIyMQ@@._V1_.jpg",
    "keywords": "tv mini series,period drama,clock,sea,navigation",
    "name": "Longitude",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chip98"
        },
        "dateCreated": "2000-07-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0192263/"
        },
        "name": "A timely epic",
        "reviewBody": "Long, but worth it! A blessed antidote to MTV's Tom Green and the rest of the scumbag-chic that passes for culture these days. Based on the brilliant history of the same name by Dava Sobel.\n\nIn the days when ships measured themselves by yardage of sail and bank of cannon, knowing your north-south latitude was easy. Finding your east-west longitude however (and keeping your ship off the reefs) was hit-and-miss. That could get you killed. The cure was to know the time in London, precisely, but keeping time accurate on a rolling ship was tougher than keeping milk fresh; pendulum clocks need stable ground, and pendulum clocks were all they had.\n\nQueen Anne (Br., 1665-1714) had another idea: a 20,000 pound-sterling prize to anyone who had a solution. Problem was, no one expected a country carpenter cum-clockmaker to do it. John Harrison (Michael Gambon) was that carpenter, and it became *his* problem--a three-decades-long problem. It would also pose one for Rupert Gould (Jeremy Irons) two centuries later, as a marriage-busting, sanity-breaking obsession over restoring Harrison's neglected prototypes: clocks that could keep time at sea better than the quartz-timed digital you might be wearing now.\n\n\"Longitude\" weaves seamlessly--almost--between the two eras, tracking the exertions and miseries of John Harrison and Rupert Gould with the same kind of synchronicity Harrison spent half his life pitching to astronomers who had scarce respect for the tinkerings of a hayseed. Michael Gambon's passionate performance as John Harrison is truly Oscar-calibre, eclipsing Irons--but only because the tunnel-visioned Rupert Gould is hardly a vehicle for the memorable. Too bad this was \"only\" a TV mini-series. As a theatrical release it would have lent due reknown to a scarce-remembered true epic of genius.\n\nWatch this when you get the chance. Then go punch Tom Green in the nose."
    },
    "url": "/title/tt0192263/"
}