{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Javier Bardem",
            "url": "/name/nm0000849/"
        },
        {
            "@type": "Person",
            "name": "Savion Glover",
            "url": "/name/nm0323174/"
        },
        {
            "@type": "Person",
            "name": "Chris Rock",
            "url": "/name/nm0001674/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 50,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103055/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0755626/"
        },
        {
            "@type": "Person",
            "name": "Sally Potter",
            "url": "/name/nm0006845/"
        }
    ],
    "datePublished": "2022-10-07",
    "description": "Rehearsals for a fundraising gala become the arena for a struggle between two men; one, the gala director and the other, a richly talented but unstable rock drummer. As their battle for expression and control escalates against a r...",
    "director": [
        {
            "@type": "Person",
            "name": "Sally Potter",
            "url": "/name/nm0006845/"
        }
    ],
    "duration": "PT16M",
    "genre": [
        "Short",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzg5MWRhMTMtYjVlMy00MDJmLWFhZGQtYWI5MDIwN2E5M2VhXkEyXkFqcGdeQXVyNDY2MjcyOTQ@._V1_.jpg",
    "name": "Look at Me",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kristonkiner"
        },
        "dateCreated": "2023-01-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt21806354/"
        },
        "name": "Rage and tenderness",
        "reviewBody": "Veteran British director Sally Potter, author of the adaptation of Virginia Wolf's novel \"Orlando\" among others, returns to short films with \"Look at Me\", a surprising work with an even more unpredictable cast of two very different triple A stars, Javier Bardem and Chris Rock.\n\nFrom its opening moments, the short film is dominated by its sound design, especially the rhythms of Leo, a Mexican drummer played by Javier Bardem. As he beats his instrument with absolute fury, he is closely watched by Chris Rock, who plays Adam, director of this charity gala for the \"unjustly incarcerated,\" we assume for liberal philanthropists. Adam, in charge of the rehearsal, shows his disapproval at the dominance of Leo's drumming, and asks him to just give him a beat to swing with the tap dancer next to him, who seems to have a free hand to improvise without interference. Quite the opposite of Leo, who feels undermined and humiliated, struggling to keep his emotions in check, while Alan is removing drum parts and in turn undermining Leo's creativity. Added to this is the intended connotation of feeling like a caged Mexican, alienated in this behind bars scenario, where swirling spotlights heighten the sense of being watched and simulate familiar images of the treatment of illegal immigrants at the U. S. border in a country that has the highest incarcerated population per capita in the world. The battle of egos continues to escalate between Leo and Adam as the director reduces Leo's creativity to the bare minimum, a monotonous bass drum sound. Each beat aptly shows the turmoil Leo's character is in. Sparks fly between the two as we come to understand the complexity of their relationship, which goes beyond the professional, turning this rehearsal into a battleground for their relationship. Leo angrily escapes the rehearsal without accountability, only to return hours later to witness that his contribution to the gala has been suppressed by Alan. Leo, in a primitive act, lunges at Alan and raises his fist at him. A moment that gives the director the opportunity to talk about anger and how men cope with the emotions and feelings of a misunderstood masculinity. A moment that leads us inevitably to the parallelism and real experience of Chris Rock, slapped by Will Smith at the Oscars, even in the subsequent sequence of Leo's apology and although this short film was shot two years earlier, we seem to see Chris Rock himself asking for explanations to the Oscar-winning actor from \"King Richard\". It is here when Chris Rock's character acquires nuances that we had never seen in this actor stuck in comedy.\n\nRock's restrained, eloquent and thoughtful performance contrasts with Bardem's more physical and frenetic one. Little by little, we discover the truth about the relationship between these two men, where Alan has always struggled to keep the relationship afloat, while preserving his own dignity by throwing in Leo's face a past life of addiction and mental health problems that has burned many bridges in their relationship. Leo, like a wounded beast, vents his frustration on the rooftop of the building located in Brooklyn. A beautiful sequence charged with emotion and rage in a visceral performance choreographed by percussionist and co-creator of Stomp, Luke Cresswell. Leo battles his own demons and is the embodiment of a \"man on the edge\" who is conveniently saved by Alan...and although this final scene, is somewhat condescending, the committed and passionate performances of Bardem and Rock keep \"Look at Me\" from sinking into overly melodramatic territory, where Bardem's despairing eyes perfectly paint the portrait of a man jaded by both his love and his passion. In the end, explicit tenderness prevails between two men who, despite everything, truly love each other in the depth of their connection, in a poetically shot final shot.\n\n*More in Kristonkino channel in youtube."
    },
    "url": "/title/tt21806354/"
}