{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jade Henham",
            "url": "/name/nm0993061/"
        },
        {
            "@type": "Person",
            "name": "Sam Bottoms",
            "url": "/name/nm0098734/"
        },
        {
            "@type": "Person",
            "name": "Robert Glen Keith",
            "url": "/name/nm0445295/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 333,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049744/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0082175/"
        },
        {
            "@type": "Person",
            "name": "Jade Henham",
            "url": "/name/nm0993061/"
        },
        {
            "@type": "Person",
            "name": "Jake Torem",
            "url": "/name/nm0867935/"
        }
    ],
    "datePublished": "2006-08-02",
    "description": "An X-Rated 'Holly-Go-Lightly' flip flops between choosing life's uncertainty under her own direction or the \"Good Life\" provided by a twisted sister Gene.",
    "director": [
        {
            "@type": "Person",
            "name": "Jake Torem",
            "url": "/name/nm0867935/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2MTMwMjA2MV5BMl5BanBnXkFtZTcwMDMwNTIyMQ@@._V1_.jpg",
    "keywords": "controversy,role playing,secret,lost soul,drugs",
    "name": "Looking Through Lillian",
    "original_info": {
        "id": "Looking Through Lillian_2002",
        "name": "Looking Through Lillian",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bjagneaux"
        },
        "dateCreated": "2005-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0285681/"
        },
        "name": "I was there!?",
        "reviewBody": "OK, so I'll admit to not seeing the movie but I was actually a member of the production team (low level) and could not believe it when a friend of mine introduced me to this site asking what the most obscure film I could think of was. I was willing to test his enthusiasm over a site that \"has every movie you've ever heard of on it.\" Well, I lived in LA for a few years and worked on a few indies and had no idea this film had even made it to release when I blurted out this title. As you know, it was here, shocking the hell out of me! \n\nTo the crew and Jake (and the DP I can picture jerking his head around like a chicken for laughs) I say congratulations! I did not know much at the time but the weeks I worked were an eye-opening experience. I won't say the set was like \"Living in Oblivion\" but it was close. I met some great people on-set and got to say goodbye to a few before I left. (\"We need more wind.\") I can't bring myself to divulge any messy off camera details although it was tense, loud at times, obviously bawdy and a bit hard to merely standby at times. The crew, for the most part, were professionals and held up their end which is why I will definitely watch this film soon. \n\nJust had to chime in and express my amazement that this site truly has \"every movie you've ever heard of.\" If you're a crew member then no, I brought you coffee(and drove from the cliffs to Tony Roma's or the Stinking Rose, I can't remember which)."
    },
    "url": "/title/tt0285681/"
}