{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Larroquette",
            "url": "/name/nm0488662/"
        },
        {
            "@type": "Person",
            "name": "Angela Cartwright",
            "url": "/name/nm0142145/"
        },
        {
            "@type": "Person",
            "name": "Mark Goddard",
            "url": "/name/nm0323813/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 154,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0143562/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044236/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036884/"
        },
        {
            "@type": "Person",
            "name": "Brian Anthony",
            "url": "/name/nm0030834/"
        },
        {
            "@type": "Person",
            "name": "Kevin Burns",
            "url": "/name/nm0122745/"
        },
        {
            "@type": "Person",
            "name": "Bill Mumy",
            "url": "/name/nm0612621/"
        }
    ],
    "datePublished": "1998-11-28",
    "description": "The resolution to lost in space in this TV movie documentary.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Burns",
            "url": "/name/nm0122745/"
        }
    ],
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg3MzIyODQwNV5BMl5BanBnXkFtZTcwNTY0NTYxMQ@@._V1_.jpg",
    "keywords": "psychotronic filmmaking,adventure filmmaking,comedy filmmaking,sci fi filmmaking,fantasy filmmaking",
    "name": "Lost in Space Forever",
    "original_info": {
        "id": "Lost in Space Forever_1998",
        "name": "Lost in Space Forever",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JimmyL5555"
        },
        "dateCreated": "2007-02-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0244630/"
        },
        "name": "A must for any Lost in Space fan!!",
        "reviewBody": "I am a die-hard LIS fan, and I absolutely LOVED this special plus the DVD extras. John Larrocat hosts this special with Bob May/Dick Tufeld as the Robot that led to the shows origins, through all 3 seasons and up to the theatrical motion picture. And at the very end of this one-hour special we are given a super treat of Jonathan Harris & Bill Mumy reprising their roles as Dr. Smith and Will Robinson in their 3rd season costumes in a short scene that made me think that if they and the rest of the remaining cast did the same for the theatrical feature (with as much care as the crew did in recreating the original upper deck of the Jupiter II)-- like Star Trek did -- the movie would have been a huge success, and like Star trek, would have spawned sequels.\n\nAll they'd have to do is explain, like Star Trek did, how they all got older and that (because of Guy Williams' death) John Robinson died 5 years sooner than he was supposed to because of the deal he made with The Time Merchant from the 3rd season. Then, Lost in Space: The Movie would be a continuation of the story, like \"Star Trek: The Motion Picture\" was, with a new adventure they'd encounter, then Lost in Space II, Lost in Space III, and so on. That final scene in this special showed me the potential is endless! If you own the DVD you'd want to replay that last scene over and over again because it is so cool!! \n\nThe DVD has special features like behind the scenes of that final scene in the special and you can see how Jonathan Harris and Bill Mumy enjoyed doing it, test shots of the special effects primarily of the giant cyclops, the little robots, and -- my favorite: the Jupiter II and space pod flying, landing & taking off!\n\nAnother unique treat in the DVD extras is an audition/conversation with Guy Williams being introduced to the show by Irwin Allen (offsceen), and you can see how and why he was so easily chosen to play John Robinson.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0244630/"
}