{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Pauline Etienne",
            "url": "/name/nm3011788/"
        },
        {
            "@type": "Person",
            "name": "Olivier Rabourdin",
            "url": "/name/nm0705005/"
        },
        {
            "@type": "Person",
            "name": "Florence Thomassin",
            "url": "/name/nm0859740/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 230,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "Lost Paradise",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0260662/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0202716/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Person",
            "name": "Ève Deboise",
            "url": "/name/nm0213476/"
        },
        {
            "@type": "Person",
            "name": "Nadine Lamari",
            "url": "/name/nm1300507/"
        }
    ],
    "datePublished": "2012-07-04",
    "description": "Lucie lives with her father Hugo. Her mother has been gone for a year and the abscence brought father and daughter even closer. However, when the mother returns, Hugo's taken by uncontrollable jealousy and anger. (French with Engl...",
    "director": [
        {
            "@type": "Person",
            "name": "Ève Deboise",
            "url": "/name/nm0213476/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTc2MjYzODg5NF5BMl5BanBnXkFtZTgwNjIzNjQ4MzE@._V1_.jpg",
    "keywords": "husband wife relationship,male nudity,skinny dipping,foreign film,poverty",
    "name": "Paradis perdu",
    "original_info": {
        "id": "Lost Paradise_2000",
        "name": "Lost Paradise",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lazarillo"
        },
        "dateCreated": "2014-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1863352/"
        },
        "name": "Very ambiguous, Rorschah test of a movie",
        "reviewBody": "This is a very strange French film about a father and teenage daughter living by themselves on a farm in a very rural, provincial part of France. There seems to be something incestuous about their relationship, but this is kept vague and ambiguous. They seem happy with the father home-schooling the daughter and an unseen neighbor giving her driving lessons. Conflicts arise when the unfaithful wife/mother of the girl suddenly returns and the father decides to keep her captive in a shed on the corner of his property rather than let her reunite with the daughter. Then another potential conflict arises when the father hires a young Moroccan boy to help him out at the farm. The girl is attracted to the boy and this inspires no small of jealousy on the part of the father. There is also a little girl, but it is not clear whether this is the daughter's child, a neighbor's child she is babysitting, or some kind of metaphoric character that doesn't exist at all(?).\n\nObviously this movie is deeply ambiguous. I don't mind the tendency of French films to not spell EVERYTHING out like a lot of Hollywood films do, but this film is perhaps too vague and ambiguous to the point you don't really know ANYTHING for sure. The end doesn't really resolve anything and really just raises even more questions. This movie is almost like a Rorschah inkblot which you can interpret pretty much any way you want, but that is not necessarily a great artistic achievement.\n\nThe main actress of note here is Pauline Etienne who plays the daughter. She is unusual in that--unlike most young French actresses or young Hollywood actresses--she is a not a stunning beauty, but really a normal-looking girl. Still, that makes her very believable in this role, and she gives a very convincing performance. I just wish it wasn't in such a frustratingly ambiguous movie."
    },
    "url": "/title/tt1863352/"
}