{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Guy Williams",
            "url": "/name/nm0930713/"
        },
        {
            "@type": "Person",
            "name": "June Lockhart",
            "url": "/name/nm0001478/"
        },
        {
            "@type": "Person",
            "name": "Mark Goddard",
            "url": "/name/nm0323813/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8231,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064339/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038185/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063202/"
        },
        {
            "@type": "Person",
            "name": "Irwin Allen",
            "url": "/name/nm0000740/"
        }
    ],
    "datePublished": "1965-09-08",
    "description": "A space colony family struggles to survive when a spy/accidental stowaway throws their ship hopelessly off course.",
    "genre": [
        "Adventure",
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE2OTczMDI2M15BMl5BanBnXkFtZTcwMTA5MDgyMQ@@._V1_.jpg",
    "keywords": "space travel,spaceship,family relationships,crash landing,lost in space",
    "name": "Lost in Space",
    "original_info": {
        "id": "Lost in Space: Season 1_1965",
        "name": "Lost in Space: Season 1",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "skeetz1105"
        },
        "dateCreated": "2002-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058824/"
        },
        "name": "Best Science Fiction Series of All Time",
        "reviewBody": "This sci-fi adventure series was \"Bold in concept, Brilliant in execution\". From the Robinson's departure from Earth to their encounter with the Junkman I was kept on the edge of my seat. Virtually every episode had some great moments. Among my least favorites are: Space Vikings (however, this one did have good special effects), Space Beauty, 2 Weeks in Space, and A Day At The Zoo. The rest are top rate -they dealt with such topics as: time travel, environmental problems one may encounter on alien worlds, cryogenics, matter transfer, espionage, sabotage, national security, and human survival issues. What also remained intriguing was the fact that the greatest danger they faced came from within - namely, Dr. Smith. Why they didn't \"kill him\" is obvious - they couldn't bring civilization to the stars starting with the uncivilized act of murder (not to say that it never crossed anybody's mind). Cool special effects and equipment were: lazer battles (and their weapons), explosions, flying belts, the force field, weather stations, the Jupiter 2, the robot, and the charriot. I too, like many people, wish that \"Lost In Space\" would have remained a more serious science fiction epic, but the 2nd and 3rd seasons did produce some outstanding episodes like: Blast of into Space, Wreck of the Robot, Collision of Planets, The Colonists, Space Creature, The Anti-Matter Man, Hunter's Moon, and Visit to a Hostile Planet. Jonathan Harris' decision to make Dr. Smith a more comedic villian may have been more fun for him, but I think it would have been better if he had remained the evil agent he started out being (but there were some humorous moments between him, the robot, and Will). When I was a kid I attributed to this change in character to a complete mental breakdown due to the stress and strain of isolation in space (of course he was crazy from the beginning and it wouldn't require a lot for him to snap). Even though people remember Smith, the robot, Will, and their relationship the best, there were plenty of episodes where the main focus was the Robinson family as a whole and their plight. Guy Williams was among my favorites and I always looked up to him. He was my hero in this show. There is no comparison between LIS and Star Trek. I would much rather watch a show about human survival in space than a show with weird aliens who have acne problems."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox",
        "duration": "PT16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4069720345",
        "name": "Lost in Space :Season 1 (1965)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDk4YmQxZGUtYzZjNi00ZDRlLWJkNzQtOWQ4MzdkNjg3MGMzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDk4YmQxZGUtYzZjNi00ZDRlLWJkNzQtOWQ4MzdkNjg3MGMzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:53:18Z",
        "url": "https://www.imdb.com/video/vi4069720345/"
    },
    "url": "/title/tt0058824/"
}