{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jesse Eisenberg",
            "url": "/name/nm0251986/"
        },
        {
            "@type": "Person",
            "name": "Gabriel Byrne",
            "url": "/name/nm0000321/"
        },
        {
            "@type": "Person",
            "name": "Isabelle Huppert",
            "url": "/name/nm0001376/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13650,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010446/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0148146/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018704/"
        },
        {
            "@type": "Person",
            "name": "Joachim Trier",
            "url": "/name/nm1258686/"
        },
        {
            "@type": "Person",
            "name": "Eskil Vogt",
            "url": "/name/nm1258777/"
        }
    ],
    "datePublished": "2015-10-02",
    "description": "The fractious family of a father and his two sons confront their different feelings and memories of their deceased wife and mother, a famed war photographer.",
    "director": [
        {
            "@type": "Person",
            "name": "Joachim Trier",
            "url": "/name/nm1258686/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc0MTQxMDY2OV5BMl5BanBnXkFtZTgwNTIwNTgxODE@._V1_.jpg",
    "keywords": "2010s,troubled teen,father son estrangement,car truck crash,repeated scene from a different perspective",
    "name": "Louder Than Bombs",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OJT"
        },
        "dateCreated": "2015-10-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt2217859/"
        },
        "name": "The difficulty of communication and living together",
        "reviewBody": "Acclaimed Norwegian filmmakers Joachim Trier and Eskil Vogt has done another profound film which will be talked about in years to come. This film was chosen for the main program at this years Cannes festival, after Trier's last movie was shown in the festivals' \"Un certain regard\"- program. Joachim Triers granddad, Erik Løchen, participated in the main program with his acclaimed \"Jakten\"/\"The hunt\" in 1960, and Lars von Trier is also said to be a distant relative, though I haven't found the proof of that.\n\nIn this drama we meet the men, and the woman (Isabelle Huppert) of which their life has circled around. The mother died a couple of years ago in a car accident after colliding with a meeting trailer. The husband (Gabriel Byrne), which is a teacher, and the two sons has moved on, and we come into their lives when there is to be a memorial exhibition for her, when the oldest son (Jesse Eisenberg) just see his first kid being born at the hospital, and the youngest (Devin Druid) is seemingly living in his own world and in the video games he plays. \n\nThe film must be interpreted by each viewer, and will mean different thing to each one giving time to this film, but I would say the film is about awareness in your own life, as well as the difficulty in living together with other persons, especially if you don't have the communication needed.\n\nThe film is also from time to time bringing you into the thought of all the main persons, and especially into the youngest son's stream of consciousness of weird thoughts. The three men communicate, but are all keeping secrets from each other. These secrets seem more or less profound for each of them, and are all stories which should be told. How this all unravels is the excitement and tension of the film. \n\nWell, go watch it! The film has capability to both be life changing and food for thought, and I liked it on that basis. I was expecting the film to have a stronger emotional impact on me, which disappointed me a little, but it sure will do that to others, depending on life experiences.\n\nThe style has obviously been very influenced by several great film makers, amongst them, some of the French masters. An obvious reference to me was Louis Malle's masterpiece \"Le feu follet\", and Luis Bunuel's \"The Discreet Charm of the Bourgeoisie\", but there's many more.\n\nWe've just seen the start of the magic to come out of the friendship between Joachim Trier and fellow script writer and filmmaker Eskil Vogt. I sense there are great films to come out of this cooperation. \n\nWell worth a watch, but don't expect an action movie. Be ready to use your brain.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Louder Than Bombs",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3045964313",
        "name": "Louder Than Bombs",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTdjOTFiNmMtN2I2YS00NDgzLTg4NzAtOWE0YzQ3Nzk1MWEzXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTdjOTFiNmMtN2I2YS00NDgzLTg4NzAtOWE0YzQ3Nzk1MWEzXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-10-31T17:10:25.696Z",
        "url": "https://www.imdb.com/video/vi3045964313/"
    },
    "url": "/title/tt2217859/"
}