{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Philip Seymour Hoffman",
            "url": "/name/nm0000450/"
        },
        {
            "@type": "Person",
            "name": "Annie Morgan",
            "url": "/name/nm1112902/"
        },
        {
            "@type": "Person",
            "name": "Kathy Bates",
            "url": "/name/nm0000870/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8290,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025720/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024845/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047476/"
        },
        {
            "@type": "Person",
            "name": "Gordy Hoffman",
            "url": "/name/nm0388896/"
        }
    ],
    "datePublished": "2003-01-31",
    "description": "Following the unexplained suicide of his wife Liza, a web designer turns to gasoline fumes and remote-control airplanes while avoiding an inevitable conflict with his mother-in-law.",
    "director": [
        {
            "@type": "Person",
            "name": "Todd Louiso",
            "url": "/name/nm0521974/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkyODI0OTY4MV5BMl5BanBnXkFtZTYwMTQwMDg2._V1_.jpg",
    "keywords": "suicide of wife,downward spiral,crying man,man wears underwear,female rear nudity",
    "name": "Love Liza",
    "original_info": {
        "id": "Love Liza_2002",
        "name": "Love Liza",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2003-08-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0282698/"
        },
        "name": "a searing study of grief",
        "reviewBody": "Philip Seymour Hoffman has made a career out of playing deeply depressed characters. In `Love Liza,' he has found what might well be his most perfectly suited role to date, that of a young man trying to come to terms with the suicide of his wife.\n\nWritten by Gordy Hoffman and directed by Todd Louiso, `Love Liza' is a searing study of grief, one that chronicles the many stages a man goes through in coping with this type of tragedy. Wilson first finds himself unable to sleep in the same bed he used to share with his wife. Then he returns to the place where they spent their honeymoon in a vain attempt to find some solace or answers there. Then there's the turn towards self-destruction as he seeks escape from his pain by inhaling mass quantities of gasoline. All along the way, well-meaning friends, colleagues and family members proffer what they can in the way of support and sympathy but, invariably, they find themselves ill-equipped to deal with grief at this level of intensity. This is even the case with Mary Ann, Wilson's understanding mother-in-law, who is having to cope with her son-in-law's dysfunction while also dealing with her own grief at the loss of her daughter.\n\nThe title of the film comes from a signed suicide note Liza left to Wilson under his pillow. That letter, which Wilson cannot bring himself to open, only adds to the man's despair, for he fears it may reveal that he was somehow responsible for his wife's actions. Thus, wracked with guilt as well as grief, Wilson slides ever further into that deep dark hole of despair. The filmmakers, in an effort to mitigate some of the misery inherent in the subject matter, invest the story with a number of sly, quirky touches, such as Wilson's sudden obsession with mechanized toy airplanes. But the overwhelming sadness is never far from the film's surface.\n\n`Love Liza' is, at its core, an actor's film  and the cast proves itself worthy of the challenge. Hoffman's portrait of a man whose entire meaning for existence has been knocked out from under him is devastating in its understatement and power. Kathy Bates turns in an equally fine and subdued performance as his grieving mother-in-law, and Sarah Koskoff and Jack Kehler offer fine support.\n\nIs `Love Liza' a `dark' film? Absolutely. But it is also a brave, insightful and compelling one for those willing to enter its world. It may not be easy to watch, but it is probably harder not to."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Classics",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1519845657",
        "name": "Love Liza",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDc3ZTZhODctYWRmOC00YzY5LTk0MTItZmI0MzRlOWZhMTc0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDc3ZTZhODctYWRmOC00YzY5LTk0MTItZmI0MzRlOWZhMTc0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:05:21Z",
        "url": "https://www.imdb.com/video/vi1519845657/"
    },
    "url": "/title/tt0282698/"
}