{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Derek Jacobi",
            "url": "/name/nm0001394/"
        },
        {
            "@type": "Person",
            "name": "Daniel Craig",
            "url": "/name/nm0185819/"
        },
        {
            "@type": "Person",
            "name": "Tilda Swinton",
            "url": "/name/nm0842770/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3860,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037450/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103757/"
        },
        {
            "@type": "Person",
            "name": "John Maybury",
            "url": "/name/nm0562266/"
        }
    ],
    "datePublished": "1998-10-07",
    "description": "Biography of British painter Francis Bacon focuses on his relationship with his lover, George Dyer, a former small time crook.",
    "director": [
        {
            "@type": "Person",
            "name": "John Maybury",
            "url": "/name/nm0562266/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjE2YmYxM2QtY2I3Yi00ZTU3LTlkZjgtNjE5NmJlMThmZmViXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "reference to francis bacon,male full frontal nudity,female removes her clothes,female nudity,female frontal nudity",
    "name": "Love Is the Devil: Study for a Portrait of Francis Bacon",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119577/"
        },
        "name": "Aimed at a small audience I think and will mostly alienate those outside of its target group",
        "reviewBody": "When British painter Francis Bacon disturbs a burglar in his home, he invites George Dyer to come to bed with him in return for anything he wants to steal. This starts a relationship between the two that is as impatient and untrustworthy as it is passionate. Bacon draws on Dyer to compliment his work while at the same time Dyer begins to feel used and out of his depth in a relationship that draws him into the arty underworld of the time.\n\nI don't know a great deal about Francis Bacon other than a passing knowledge of his work and I must admit that I had vague hopes that a film about the painter would give me a little more knowledge of him, his work or the circumstances around him; it's a shame then that it didn't really manage to do any of these things particularly well. Instead what it does is deliver a rather pretentious piece of film rather fails to really deliver anything of value for those of us who are not as smart and informed as others. Maybe of Bacon lovers (pardon the turn of phrase) this film serves as a minor insight into his life for them to um and ah over but for me it was simply a collection of blurry shots, overdone pretentious shots and arty sentiment.\n\nThe plot, for what it is, follows Bacon and Dyer together and separately as they destroy one another in various ways. It is as meaningful as watching paint dry because we are never allowed into these people as, well, people and the film seems more concerned with camera movement and minimalist sets. Of course part of this will appeal to the arty crowd as the direction tries to ape Bacon's style but I'm not sure if that was because his estate refused to have anything to do with the film or not. While not rubbish it is aimed at a select audience and I don't think I am in that group; a little annoying perhaps because I felt like the film was looking down its nose at me in the same way that Bacon did with Dyer but I suppose that's what I get for trying out something new!\n\nWhat made it more worthwhile though was a collection of good performances throughout; none of them have particularly likable characters but they all deliver with passion. Certainly Jacobi is very good even if I came to dislike his Bacon's pretentious approach to life, art and others, but Jacobi never let up on his portrayal anyway. Craig is a good actor and he is like a hurt animal for most of the time here  eager to please but knowing he is out of his depth and suffering for it. Swinton is OK, Johnson is overdone and the rest of the support tend to just drift around like a collection of back street 'Darling!' clichés. However bleak and unlikeable performances from both Jacobi and Craig are worth seeing.\n\nOverall this film was wasted on me as it seemed to be aimed at a very specific group of people who are much smarter than I. To me this was annoying as I felt inferior and irritated that the film did not throw me a bone to help me out with the subject. The direction, editing and themes come across as pretentious a bit too much and this did put me off but in fairness I'm not a big Bacon fan so maybe it was my fault. Anyway  fans of Bacon's work may wish to see this film to discuss his life further (whether they agree with the film or not) but for most of us this will come off as an elitist piece of cinema that does nothing to help the unaware and only serves to alienate 'the masses' from art."
    },
    "url": "/title/tt0119577/"
}