{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mickey Rooney",
            "url": "/name/nm0001682/"
        },
        {
            "@type": "Person",
            "name": "Judy Garland",
            "url": "/name/nm0000023/"
        },
        {
            "@type": "Person",
            "name": "Lewis Stone",
            "url": "/name/nm0832011/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1961,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "William Ludwig",
            "url": "/name/nm0525067/"
        },
        {
            "@type": "Person",
            "name": "Vivien R. Bretherton",
            "url": "/name/nm0107858/"
        },
        {
            "@type": "Person",
            "name": "Aurania Rouverol",
            "url": "/name/nm0746168/"
        }
    ],
    "datePublished": "1938-07-22",
    "description": "Andy has problems raising the last payment for a used car and juggling three pretty girls with an upcoming country club dance scheduled.",
    "director": [
        {
            "@type": "Person",
            "name": "George B. Seitz",
            "url": "/name/nm0782707/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDBkZjdiNzctMTVkOS00ODIzLWJkN2ItM2Y5OTgyZTNjNGJlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "christmas,national film registry,drugstore,teenage romance,ice cream soda",
    "name": "Love Finds Andy Hardy",
    "original_info": {
        "id": "Love Finds Andy Hardy_1938",
        "name": "Love Finds Andy Hardy",
        "year": "1938"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2010-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0030386/"
        },
        "name": "One of the Greatest Casts Ever Put Together",
        "reviewBody": "Love Finds Andy Hardy (1938) \n\n*** (out of 4) \n\nAndy (Mickey Rooney) catches a break when girlfriend Polly (Ann Rutherford) must head out of town because this leaves him able to earn $8 for a car he wants to buy. All he has to do is date his best friend's girlfriend (Lana Turner) while he's out of town as he doesn't want her going around with any other boys. Things don't go as planned but at least Andy has his new neighbor (Judy Garland) who just happens to have a few plans of her own. This fourth film in the series is often considered by man to be the best but I'm not certain I'd go that far. If someone is looking for pure laughs there are funnier films in the series but at the same time it's easy to see why this one would get so much attention due to the terrific cast. I guess you could say Andy is the luckiest guy in the world if his biggest problem is dating women like Garland, Turner and Rutherford but that's the major of the film's storyline. There are a few minor subplots dealing with Judge (Lewis Stone) having to take care of the fort when his wife (Fay Holden) leaves to take care of her ill mother. I'm guessing mom was pretty much written out of this one simply because you had so many other characters that needed attention. Apparently this film was shot in just 19 days and was released to theaters less than two months after it was given the green light. It's hard to imagine any movie being written, shot and shown in such a short period of time but I guess you have to give the MGM factory credit for this. Even though I wouldn't name this the best of the series there are still enough good moments to make it a must see. The majority of the charm comes from Rooney and his energy as he tries to get through all these situations while at the same time learning various life lessons. It's hard to imagine anyone else in the role of Andy Hardy as Rooney is pitch perfect for it and he matches well with the three females. He and Rutherford always had that great charm in each film but the real shock was seeing how good he was with Turner. The two really seem to have great chemistry and this comes across during a terrific scene in the woods where they kiss and Rooney lets out a scream of pleasure to which Turner then laughs in hysterics. Garland certainly gets the majority of the screen time and she does a fine job as well. She also gets to sing three songs, which she does a good job with even though none of the songs are all that memorable. It goes without saying but Lewis Stone is at the top of his game as normal. LOVE FINDS ANDY HARDY is certainly a flick that any film buff should see simply because of the great cast. It's hard to think of a film with more young talent but they all deliver the goods and make this an entertaining little gem."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1925626905",
        "name": "Love Finds Andy Hardy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTI0MWI2NmYtZGEyMC00ZGVjLWEzZWMtYjI1Njk0NzQxMDJhXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTI0MWI2NmYtZGEyMC00ZGVjLWEzZWMtYjI1Njk0NzQxMDJhXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2019-06-01T17:10:34.314Z",
        "url": "https://www.imdb.com/video/vi1925626905/"
    },
    "url": "/title/tt0030386/"
}