{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Hurt",
            "url": "/name/nm0000457/"
        },
        {
            "@type": "Person",
            "name": "Jason Priestley",
            "url": "/name/nm0000594/"
        },
        {
            "@type": "Person",
            "name": "Fiona Loewi",
            "url": "/name/nm0517370/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4077,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008738/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108918/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019383/"
        },
        {
            "@type": "Person",
            "name": "Gilbert Adair",
            "url": "/name/nm0010434/"
        },
        {
            "@type": "Person",
            "name": "Richard Kwietniowski",
            "url": "/name/nm0477193/"
        }
    ],
    "datePublished": "1998-03-06",
    "description": "Giles De'Ath (Sir John Hurt) is a widower who doesn't like anything modern. He goes to movies and falls in love with movie star Ronnie Bostock (Jason Priestly). He then investigates everything about the movie and Ronnie. After tha...",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Kwietniowski",
            "url": "/name/nm0477193/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGQ0YzY4MjEtN2ZiNi00MzgzLTk5OGQtZDg5Mjc3YzFjNTE1XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "obsession,obsessive love,gay,independent film,columbia tristar",
    "name": "Love and Death on Long Island",
    "original_info": {
        "id": "Love and Death on Long Island_1996",
        "name": "Love and Death on Long Island",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DannyBoy-17"
        },
        "dateCreated": "1999-04-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119574/"
        },
        "name": "Worth a look",
        "reviewBody": "\"Do you own a word processor?\"\n\n\"I WRITE. I do not PROCESS words.\"\n\nGiles De'Ath is a frail man on the verge of suffocating on high 19th century culture: he is sheltered within cafes, cigars, E.M. Forster, and presentations of lectures like \"The Death of the Future.\" As one radio commentator asks him, \"Does the 20th century play ANY part in your life?\"\n\nGiles is utterly changed by witnessing truly LOW culture on the big screen, the film Hotpants College II that he mistakes for E.M. Forster's Eternal Moment. Upon going for a second viewing, Giles is ashamed of even saying the name of the movie at first. He is mesmerized by the image of one Ronnie Bostock, Mikey in the film, a waiter who gets pushed around and finally shoved onto a restaurant counter and covered with ketchup, making Mikey a Christlike martyr for the Porky's generation. When the movie fades to black and the end credits come up, the name RONNIE BOSTOCK literally shines through the eyes of Giles De'Ath. So begins Giles' reluctant but determined search for this Bostock. He's seen all Ronnie's films and is transfixed by his image (indeed, Ronnie's movies are the first thing he's ever seen on a TV or a film screen.)\n\nThe second act of the movie takes Mr. De'Ath to Chesterton, Long Island- the home of Ronnie Bostock. De'Ath learns little by little about the modern American culture as he amusingly stalks his way into Ronnie's home. He offers his devotion to the career of Ronnie Bostock, who has decided he wants to be taken seriously as an actor.\n\nGiles introduces him to an idea for a movie: a deaf-mute who has never been outside in the real world, who in fantasy is surrounded only by white, empty space, has in his possession a television to look outwards. After enough images, this childlike deaf-mute wants to experience the real world and must do it through fulfilling the quest of falling in love.\n\nBostock loves the idea, but he just doesn't GET it about Giles. That's DE'ATH's story. (It's strange when seeing the vision of Priestley in that script. I found myself wondering the effect of Teletubbies upon children, who may be both deaf and mute in certain ways and learn how to reach out towards reality through surreal television images. It's both troubling and poignant...)\n\nGiles De'Ath is in love with the image of Ronnie Bostock: regardless of how low his movies are, Ronnie has a \"file of smiles\" for different emotions, \"a permanence\" in his look. His martyred state on the counter resembles old paintings. His film work is what Shakespeare would have done as both his comedies and Hotpants College 2 were made \"for the rabble in the pit.\"\n\nHowever, Giles, somewhere along the way, realizes that he is ALSO \"completely, desperately\" in love with Ronnie Bostock.\n\nI won't give away the ending. The film is low-budget, short, and it has basically only two developed characters. It doesn't have much of an effect afterwards, but it has real poetry to it, especially in Hurt's transformation from high culture shelter to low culture inspiration. I'm still not sure if this is a high-culture indie making fun of low culture, or a low culture movie trying to justify itself, as Giles tries to do for Ronnie. One reason I hated Boogie Nights, among many, is that it wanted us to sympathize with Mark Wahlberg's porn star but also allowed us to distance ourselves from him and laugh AT him anytime we wanted: that's cheating. This film gets it right- it's not sarcastic about Ronnie's work, though certainly we have reasons to laugh at it. We have to draw our own conclusions about these characters, about the LOVE we see that Giles has for the star. Is this REAL love, or is it even more than that?\n\nI'm a lover of film, and there are images that I see that I will pause, and play in slow motion, especially now with quicktime clips on the Mac: the poetry of a certain face, like that of Jodhi May(Alice) in Last of the Mohicans right before she jumps off the cliff. There's a love there for her, for her image, that is indescribable for me, so I can appreciate and truly relish the story of a man enamored by an image.\n\nI'm also always glad to see a film about a man who finds inspiration in modernity. We know by the end that Giles is entering a new kind of life: perhaps \"The De'Ath of the Future\" is somebody who accepts all culture. He sees the low in the high and the high in the low, and he makes no distinction between the \"art\" of images in the art gallery and those of your everyday teen flick."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1756037401",
        "name": "Love And Death On Long Island",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzZhZWY1NGMtOTVhZC00MTE1LWIzNWMtN2Q1ZGZmOTNlM2I4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzZhZWY1NGMtOTVhZC00MTE1LWIzNWMtN2Q1ZGZmOTNlM2I4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:20:48Z",
        "url": "https://www.imdb.com/video/vi1756037401/"
    },
    "url": "/title/tt0119574/"
}