{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Alexander",
            "url": "/name/nm0004517/"
        },
        {
            "@type": "Person",
            "name": "Stephen Spinella",
            "url": "/name/nm0818880/"
        },
        {
            "@type": "Person",
            "name": "Stephen Bogardus",
            "url": "/name/nm0091551/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3618,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041532/"
        },
        {
            "@type": "Person",
            "name": "Terrence McNally",
            "url": "/name/nm0573645/"
        }
    ],
    "datePublished": "1997-05-16",
    "description": "Gregory invites seven friends to spend the summer at his large, secluded 19th-century home in upstate New York. The seven are: Bobby, Gregory's \"significant other,\" who is blind but who loves to explore the home's garden using his...",
    "director": [
        {
            "@type": "Person",
            "name": "Joe Mantello",
            "url": "/name/nm0544079/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWY4MzE2NWUtNTU1Yi00ODI1LWI2ZTMtNmVhNmZmNDQxMzMxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "nudity,swimming,male nudity,homosexual,independent film",
    "name": "Love! Valour! Compassion!",
    "original_info": {
        "id": "Love! Valour! Compassion!_1997",
        "name": "Love! Valour! Compassion!",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "drednm"
        },
        "dateCreated": "2008-02-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119578/"
        },
        "name": "Sweet and Sad and Excellent",
        "reviewBody": "Adapted from a hit play by Terence McNally and utilizing most of the original stage cast, this film cannot hide its theatrical roots... nor should it.\n\nThis is a sweet and sad story set against a perfect summer at a perfect country estate in upstate New York (?) that shows the lives of 8 gay men as they come to terms with AIDS, death, love, compassion, and the thin bonds of friendship that hold them together.\n\nTheir summer idyll is a microcosm that, apart from the real world we never see, touches us all because it is their humanity that dominates this story. That one is a dancer, a lawyer, a choreographer, etc. is unimportant. They are 8 gay men whose lives are intertwined in love, valour, and compassion.\n\nJason Alexander is very good in the Nathan Lane role, the portly man dying of AIDS who, late in life finds love. John Glover is brilliant (repeating his Tony-winning role) as twins: one a nasty hateful man; the other a sweet man whose death from AIDS is imminent. Stephen Spinella and John Benjamin Hickey are solid as the yuppie long-term couple. Stephen Bogardus is warm as the stuttering host, Justin Kirk is surprisingly good as the blind man, and Randy Becker is good as the Latino hunk whose causes so much trouble.\n\nThe film is full of stereotypes and warm humor and terrific moments of truth. This is not a revolutionary film that tries to change the world, but it is a wise and bittersweet look at the lives of gay men in the time of AIDS, men whose lives are shattered (and ended) by a cruel and heartless disease.\n\nThere's nothing earth-shattering here, no insights that make the lives of gay men clear and understandable to non-gays. But it is a work of great honesty and simplicity in showing 8 gay men as.... human beings.\n\nThe scene, when the men go skinnydipping under a summer moon is beautiful in its complete innocence. No viewer can fail to understand their childlike glee in such a simple pleasure.\n\nThis film is a must see just because it is not a strident, political rant against the horrors of AIDS. The characters, especially those played by Glover and Alexander, accept their fates with great dignity, humor, and valour. This film is a great tribute to all our victims of AIDS, and a silent condemnation to the society and politics that let it happen."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi898892057",
        "name": "Love! Valour! Compassion!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDRlY2ZjNGMtMjcyOS00ZjQ2LTlmMWYtMGRiYWYwNGY4YzliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDRlY2ZjNGMtMjcyOS00ZjQ2LTlmMWYtMGRiYWYwNGY4YzliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:54:05Z",
        "url": "https://www.imdb.com/video/vi898892057/"
    },
    "url": "/title/tt0119578/"
}