{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Yûji Ueda",
            "url": "/name/nm0879936/"
        },
        {
            "@type": "Person",
            "name": "Yui Horie",
            "url": "/name/nm0394679/"
        },
        {
            "@type": "Person",
            "name": "Masayo Kurata",
            "url": "/name/nm0475597/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2296,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Love Hina",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0068457/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021660/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002212/"
        }
    ],
    "datePublished": "2000-04-19",
    "description": "When Keitaro was a child, he was friends with a little girl. When the girl had to move away, the two made a promise to meet each other at Tokyo University when they grew up. Years later, Keitaro has failed his entrance exam twice,...",
    "genre": [
        "Animation",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmFiOGMxODctY2U4My00ZWFkLWJkZDAtZmQwMWMxNTFkNTVhXkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "boy wrapped in a towel,boy wears eyeglasses,girl wrapped in a towel,girl wears eyeglasses,based on comic book",
    "name": "Rabu Hina",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Y-u-n-i-e"
        },
        "dateCreated": "2008-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0279570/"
        },
        "name": "Please read the manga first!",
        "reviewBody": "I've read several Japanese manga's but none has managed to capture my heart like 'Love Hina' did. The series was made into an anime series, which is good, but nothing compared to the manga. The story is as follows: Keitaro is about to become a third year Ronin and wants to get into a high class university called Tokyo U, but he has failed so many times before he doesn't think he has a chance... until he moves into his grandmother's former hotel, which unfortunately for Keitaro has now been turned into a girls' dormitory. After several mishaps with the girls they finally allow Keitaro to stay with them. Upon learning the truth that he is not really a Tokyo U student, they begin to contemplate kicking him out. However, when Keitaro announces to them that he wishes to take the exams again in order to get into Tokyo U and escape becoming a third year Ronin, they let his little lie slide and allow him to stay. However, he neglects to tell them the real reason for why he wants to go to Tokyo U: years ago Keitaro made a promise to an anonymous girl that both of them would get into the university together. He wants to discover the girl's identity, but how can he after all these years?\n\nKeitaro becomes close with each and every one of the girl characters. There's Naru, the heroine of the story, who becomes Keitaro's best friend and begins to harbour a crush for him, which is mutual; Kitsune, the sly fox who often gets into trouble by getting wasted or gambling far too much; Motoko, the verging-on-psycho kendo girl who is forever trying to kill Keitaro (she, however, also has a crush on him); Shinobu, the sweet, shy and caring young girl who unlike Naru and Motoko falls in love with Keitaro almost at once, and Su the eccentric yet lovable Indian girl. Each one has an effect on Keitaro and he becomes very good friends with all of them. Along the way Keitaro meets other new friends, such as Mutsumi Otohime, the clumsy yet carefree girl who could be a link with Keitaro's past.\n\nTogether both Keitaro and Naru vow to study hard in order to get into Tokyo U together, but they both know it won't be an easy ride.\n\nSo, why should you read the manga first? Because simply put it's one of the best manga series' ever created. In short it's a sweet, fun, hysterical masterpiece. The main problem with the anime is that it's only twenty six episodes long, while the manga lasts for a whopping fourteen volumes. Therefore not everything could be packed into each twenty minute episode of the show. Not to mention that the manga is a hundred times better and funnier then the anime. Still, the anime is great too, and you can hardly beat that catchy ass theme tune. So please read the manga first, I beg of you! You really will not regret it. Also if you are considering watching the anime please watch the Japanese dub as the English dub is beyond awful."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 2 for Love Hina",
        "duration": "PT1M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1474731545",
        "name": "Love Hina: Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzUxNDM3NTYtZDRiZS00MzJkLTk1ZTMtOWZkYWJhNWJhOWYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzUxNDM3NTYtZDRiZS00MzJkLTk1ZTMtOWZkYWJhNWJhOWYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-22T03:24:31Z",
        "url": "https://www.imdb.com/video/vi1474731545/"
    },
    "url": "/title/tt0279570/"
}