{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dudley Moore",
            "url": "/name/nm0001545/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth McGovern",
            "url": "/name/nm0001527/"
        },
        {
            "@type": "Person",
            "name": "Alec Guinness",
            "url": "/name/nm0000027/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 871,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042559/"
        },
        {
            "@type": "Person",
            "name": "Marshall Brickman",
            "url": "/name/nm0108613/"
        }
    ],
    "datePublished": "1983-02-18",
    "description": "A psychiatrist, who falls in love with a patient, is visited by the spirit of Sigmund Freud, who gives him advice on how to handle it.",
    "director": [
        {
            "@type": "Person",
            "name": "Marshall Brickman",
            "url": "/name/nm0108613/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Fantasy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg4MDk0OTQyOV5BMl5BanBnXkFtZTcwMTAxODcxMQ@@._V1_.jpg",
    "keywords": "advice,scene during opening credits,telephone,telephone call,venetian blinds",
    "name": "Lovesick",
    "original_info": {
        "id": "Lovesick_1983",
        "name": "Lovesick",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "robert-temple-1"
        },
        "dateCreated": "2013-10-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085873/"
        },
        "name": "A gentle romantic comedy from the school of Woody Allen",
        "reviewBody": "This is a very fine romantic comedy, and if it reminds us of a Woody Allen film, then guess why! It is written and directed by Allen's friend and colleague Marshall Brickman, who wrote Allen's famous films ANNIE HALL (1977), for which he won an Oscar, and MANHATTAN (1979, see my review), for which he was nominated for an Oscar, as well as his earlier film SLEEPER (1973), and twenty years later, Allen's MANHATTAN MURDER MYSTERY (1993). Brickman's association with Woody Allen goes back so far that he wrote Allen's comedy material in 1967 for a television special. I believe Brickman used to be represented by Jack Rollins, back in the days when Jack was agent and manager for Allen, Dick Cavett, Joan Rivers, and the whole crowd of young Manhattan comedians as they were in the 1960s when I knew them all, as well as the amazing Jack Rollins himself, who is certainly one of the cinema's unsung heroes. Woody Allen owes his whole cinema career to Jack Rollins in my opinion, and without Jack, Dick Cavett would possibly never have risen above stand-up work in nightclubs such as the Bon Soir on 8th Street, as he was when I knew him. Jack Rollins thus created the entire genre of which this Marshall Brickman film (possibly written for Allen originally, with Allen being replaced instead with Dudley Moore) is an excellent example. Brickman (now 74) is still at work, and has written the book for the musical film JERSEY BOYS set for release next year. And last year he appeared in WOODY ALLEN: A DOCUMENTARY (2012). This film has Sigmund Freud step into the action as a projection of the hero's imagination, a device used so brilliantly in Herbert Ross's film with Allen, PLAY IT AGAIN, SAM (1972), where Bogart does the same thing. Freud is impeccably played by Alec Guinness, who does not overdo the accent and judges the part perfectly. Dudley Moore had, by the time this film was made, been a terrific hit in Hollywood because of 10 (1979) and ARTHUR (1981), and he was considered a hot box office property. Probably this film was set up on that basis. 'Dud', as he was called in England, was certainly no dud on screen, and here he shines with his usual soft charm and melting gaze. He was really very cuddly as a screen personality. The only time I ever met him was when he was still married to Suzy Kendall (they divorced in 1972), and they came together to a private screening. I didn't speak to her but exchanged a few words with him. I knew, as everyone did, that Dudley was short, but it was a shock to see in person just how short, especially beside his wife. He was only five foot two and a half. On that occasion, he was wrapped in an enormous fur coat with a huge collar which nearly engulfed his head, and he did not take it off in the screening theatre, even though it was not cold. In this film, Dudley's limp shows clearly, as he was born with his left foot as a club foot, and the corrective surgery as a child was not completely satisfactory. With those two physical handicaps, it is amazing that Dudley had such a successful career, and what is more, was assailed by countless women who wanted not only to cuddle cute little Dud, but do real grown up things with him as well, so that he developed a reputation as a serious ladies' man and had four wives. Certainly Dudley was in my opinion one of the funniest comedians ever produced by Britain, and his BBC TV sketches with his pal Peter Cook will and cannot ever be forgotten, so that people still roar with laughter at them even though they have seen them dozens of times. The girl in the film is played by the beautiful 22 year-old Elizabeth McGovern, in her first major film role. The makeup lady went a bit too far in whitening her face, especially around her eyes to heighten the startling blue of her eyes. But never mind, she is a vision of beauty and who could resist her? Certainly not Dudley's character, Dr. Saul Benjamin, a respected Freudian psychoanalyst, whose patient she becomes. Dudley goes through the various Woody Allenesque guilt and obsession syndromes, and does a terrific job of it. Everything is very hilarious, but sad at the same time, and it is also all very Manhattan. Most of Dudley's psychiatric patients, seen often on the couch or flapping their arms as they imagine they are flying around his office, are hilariously mad, or otherwise self-indulgent narcissists, which is almost as funny. The ups and the downs of this 'counter-transference' romance are shown as the inevitable waves of the sea of love, pardon the purple prose. It is all very entertaining and well done, and I hope that one day in the future when all the ouevres are complete, some wise cinema historian surveying the 'Woody Allen Movement', will not omit the films directed by Marshall Brickman, especially this one, from consideration as an inseparable part of the genre. Brickman deserves more attention and recognition than he has ever received, although as an Oscar winner, maybe he has a few laurels upon which to rest his comically imaginative head, and perhaps even thus rests content. Let us hope so.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A psychiatrist, who falls in love with a patient, is visited by the spirit of Sigmund Freud, who gives him advice on how to handle it.",
        "duration": "PT2M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4109943321",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWY5YzY4MGEtYTg4NS00M2ZkLWEwZTQtZTBlMWVjZDQyMWMxXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWY5YzY4MGEtYTg4NS00M2ZkLWEwZTQtZTBlMWVjZDQyMWMxXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-05-25T00:02:52.580Z",
        "url": "https://www.imdb.com/video/vi4109943321/"
    },
    "url": "/title/tt0085873/"
}