{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aomi Muyock",
            "url": "/name/nm7312806/"
        },
        {
            "@type": "Person",
            "name": "Karl Glusman",
            "url": "/name/nm3194762/"
        },
        {
            "@type": "Person",
            "name": "Klara Kristin",
            "url": "/name/nm7312807/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 61557,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007481/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0258481/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0126452/"
        },
        {
            "@type": "Person",
            "name": "Gaspar Noé",
            "url": "/name/nm0637615/"
        }
    ],
    "datePublished": "2015-10-30",
    "description": "Murphy is an American living in Paris who enters a highly sexually and emotionally charged relationship with Electra. Unaware of the effect it will have on their relationship, they invite their pretty neighbor into their bed.",
    "director": [
        {
            "@type": "Person",
            "name": "Gaspar Noé",
            "url": "/name/nm0637615/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGQxZTFlZDctZjcyMy00NzA1LWFkMDYtNzRmZTkwYTFhYTc3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "sex scene,unsimulated sex,film starts with sex,erection,sex with neighbor",
    "name": "Love",
    "original_info": {
        "id": "Love & Basketball_2000",
        "name": "Love & Basketball",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Manal1987"
        },
        "dateCreated": "2016-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3774694/"
        },
        "name": "Love, Sex and the Aesthetics of Euphemism",
        "reviewBody": "I always have problems with beginnings – the beginning of an article, the beginning of a film, the beginning of a relationship, simply because beginnings are crucial in setting the tone and pattern that will lead you all the way through till the end. Naturally being affected by all the negative social media propaganda that Gaspar Noé's Love (2015) has stirred, I was reluctant to even begin watching it because I am inclined to believe that films with explicit sexual content (except for Lars von Trier's Nymphomaniac, and I will tackle why in another review) are made either to sell like cheap porn for lucrative reasons or to assume a false air of originality and experimentation. I have finally decided to watch Love after it was recommended by a trusted friend of mine, and at the end of the day, one has to constantly push their limits in terms of artistic tolerance.\n\nBack to the beginnings, Love begins with a three-minute scene taken in one shot by a steady camera of two people having what seems to be – and what actually turns out to be – unsimulated sex. After overcoming my feelings of discomfort, I started to understand what the Argentinian director is trying to do here. Is it a pornographic scene? It definitely is. But is it meant to be sexually arousing? I would have to argue for a no. Sexual excitement requires a certain amount of build-up, but jumping directly and unexpectedly into the act generates nothing but feelings of shock and unease that would need some time to fade away.\n\nThe story then unfolds in a backward linear plot. We are introduced to Murphy (the man in the opening sex scene), a frustrated young man who lives in a small apartment in Paris with his detached girlfriend and their son. The memory-evoked reversed narrative is instigated by a voice message he receives from the mother of his ex-girlfriend Electra (the woman from the opening sex scene), asking for his help to find her daughter. The man and the woman from the first sex scene are no longer strangers; we get to see how they broke up, how they managed their relationship, and finally how they met, with a heap of very long unsimulated sex scenes in between.\n\nAs a voyeur (a person who discreetly watches other people in intimate, usually sexual, positions) I was extremely confused since the enjoyment element was missing. Is it because the sex scenes were too many, too long, too real, or too unnecessary? In one of the scenes Murphy says, as a cunning gesture to voice Gaspar Noé's desire, his biggest dream is to make a movie like no other that truly portrays sentimental sexuality. He also tells Electra: \"I want to make movies out of blood, sperm and tears. This is like the essence of life. I think movies should contain that, perhaps should be made of that.\" Well, we see a lot of sperm and tears in that film, there is no doubt about it. It is true Love depicts relationships from an exceptionally crude, raw angle I have never seen before. Sex in cinema – and in life in general – is an uncanny subject; it lies at the essence of everything, everybody knows it is there, yet nobody talks about it overtly.. not in realistic terms at least. The film feels emotionally real. Too real. And not just when it comes to sex, but also to dialogue and performance. In one scene, Murphy tries to get Electra back and he keeps knocking on her door, after a few seconds she opens the door, apparently under the influence of drugs, and screams at him in the most deranged manner you could ever imagine. The camera does not move; it feels like a terrified neighbor watching the scene from the stairs. Most of the camera movement and angles follow the same pattern throughout the movie: the neutral uninvolved medium shot. Mid-film I realized it was not the sex scenes that made me uncomfortable but the fact that the film is devoid of any cinematic, stylistic euphemisms. In conventional romantic films, there is an invisible line separating the romantic from the sexual – love from desire. The subtle message is always: love is sublime and desire is vulgar. The reality of the things, and as presented in the film, is that both are inseparable in their sublimity and vulgarity.\n\nI cannot tell for sure whether I like it or not. Cinema, as Slavoj iek puts it, is \"the ultimate pervert art\" because it does not directly satisfy our desires but manipulates them. It does not show us our capabilities, but give us the illusion that we are capable. Cinema draws the line between imagination and reality and keeps crisscrossing the boundary: it takes imaginary elements and roots them in reality, and sugarcoats real elements in imaginary wraps. The trick is not to call a spade a spade, i.e. not to place two firm feet on one side of the spectrum; otherwise you would shake the balance between reality and imagination that the viewer cannot find in real life.\n\nWhatever your sentiments are towards the film, Noé – purposefully or inadvertently – raises some important issues: what if cinema does away with the aesthetics of presentational euphemism? Would it undermine its role as an artistic medium? Would it put the viewer on the defensive, being constantly faced with the unrefined reality of what (s)he dreads/desires?\n\nThe way I see it is that Noé created an extremely stimulating film, not sexually as he probably desired but intellectually and sentimentally.\n\nI'm grateful I watched Love alone and had the chance to struggle with and make sense of all those feelings and thoughts by myself. I can imagine how uncomfortable it would be watching it in a movie theater with other people, let alone how the actors felt while shooting!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt3774694/"
}