{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jamie Lee Curtis",
            "url": "/name/nm0000130/"
        },
        {
            "@type": "Person",
            "name": "Bonnie Bartlett",
            "url": "/name/nm0058783/"
        },
        {
            "@type": "Person",
            "name": "Matt Clark",
            "url": "/name/nm0164273/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 863,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0078179/"
        },
        {
            "@type": "Person",
            "name": "Amy Holden Jones",
            "url": "/name/nm0427468/"
        }
    ],
    "datePublished": "1984-04-27",
    "description": "A story of love and obsession. A young radio personality who, after her mother dies, discovers she had been having a love affair for 15 years. Now she finds herself recreating her mother's romance by getting involved with a marrie...",
    "director": [
        {
            "@type": "Person",
            "name": "Amy Holden Jones",
            "url": "/name/nm0427468/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUxMTQ1MWYtMWQ4NC00YzEyLTkzNDMtM2ZkYTYzMTg3M2VmXkEyXkFqcGdeQXVyNTcwNjUwNzk@._V1_.jpg",
    "keywords": "sex with a married man,f rated,independent film,woman in a bathtub,sex scene",
    "name": "Love Letters",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LewisJForce"
        },
        "dateCreated": "2004-04-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085871/"
        },
        "name": "Remarkable, low-key, cliché-free character piece",
        "reviewBody": "\"Love Letters\" is a remarkable and enthralling piece for many reasons. It resists plot contrivance and genre strait-jacketing to concentrate on character nuance, freshness of observation, and originality of milieu. It presents it's material with clarity, intelligence, and a refreshing lack of stylistic tropes.\n\nJaimie Lee plays a classical music DJ at a small, under-funded local radio station. One of her colleagues, a kind of hip nerd typical of the early 1980's time-frame, is played by 'Harold and Maude' star Bud Cort. He was, amazingly, 35 at the time but looks all of 20. During an in-studio performance by a home-made synth wizard (a delightful little sequence) she meets married photographer James Keach and almost immediately begins an affair. The film then follows the course of their various assignations until the inevitably messy conclusion, and it's ambiguous correlation with a cache of her dead mothers secret love letters.\n\nThe film captivates with it's perceptivity. The characters seem completely 'real', in the sense that they are quirky and human, and not merely constructs required to advance the plot. Their actions and motivations are often recondite, but always believable. Particularly intriguing are Jaimie Lee's relationships with her best friend, played by the delightful Amy Madigan, and her father (Western veteran Matt Clark). Amy and Jaimie create a wonderful rapport: we immediately accept that these gals are old buddies. And Clark's father is a superbly unsettling creation. We never know for sure whether his strange outbursts and creeping, leering presence are merely a combination of his boozing and grief over his wife's death or something more sinisterly incestuous.\n\nThe handling of the central sexual relationship avoids cliché and exploitation from the first meeting. The trysts are sketched with deftness and economy. Both leads are excellent. Keach plays it nicely low-key as an 'artistic' photographer turned advertising man who is, in truth, a rather selfish pseudo-intellectual bore. Curtis has never been better than here, as a tormented, passionate, almost schizophrenic character (just check her wardrobe changes from sensuous and stylish to bizarrely homely). Appearing just after her reign as the 'scream queen' of early 80's horror films, she evinces a startling, original presence, mixing controlled physicality and strength with numerous subtle character shadings. She's mesmerising, but somehow too unique to suggest a conventional 'star' presence. It's a real shame that she has not been granted such freedom since.\n\nWritten and directed by former Scorsese associate Amy Jones, who also, as yet, has done nothing as captivating, 'Love Letters' is a most interesting one-off. Eschewing trite corollaries and crowd pleasing expedience, it remains a quietly forceful achievement."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A story of love and obsession. A young radio personality whom, after her mother dies, discovers she had been having a love affair for 15 years. Now she finds herself recreating her mother's romance by getting involved with a married man.",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1283638041",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjc5YjNmYjUtOWExNi00MzZiLTg3ZTUtOWJhODVhMjI2NzViXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjc5YjNmYjUtOWExNi00MzZiLTg3ZTUtOWJhODVhMjI2NzViXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-17T22:21:00.783Z",
        "url": "https://www.imdb.com/video/vi1283638041/"
    },
    "url": "/title/tt0085871/"
}