{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Mel Martin",
            "url": "/name/nm0552774/"
        },
        {
            "@type": "Person",
            "name": "Christopher Blake",
            "url": "/name/nm0086512/"
        },
        {
            "@type": "Person",
            "name": "Sherrie Hewson",
            "url": "/name/nm0382137/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 230,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017529/"
        }
    ],
    "datePublished": "1979-09-23",
    "description": "A coming-of-age story perceived from the acts and feelings of Edward Richardson, a junior journalist who falls deeply in love with the enchanting and reckless Lydia Aspen, heiress of the welthy but on-decline Aspen family.",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTcwZTZiM2ItYWZhMi00YjkzLWI0Y2UtNDQ2ZjAxMTI2MzFkXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "timeframe 1920s,heiress,costume drama,two suitors,period piece",
    "name": "Love for Lydia",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dan1863Sickles"
        },
        "dateCreated": "2004-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077046/"
        },
        "name": "Turbulent, Romantic, Glamorous and Sexy!",
        "reviewBody": "LOVE FOR LYDIA is the sexy, sophisticated story of the dizzy and exciting but also rather empty lifestyle of English society people during the wild Twenties decade. The central character, Lydia, is a beautiful but rather shy girl at first. Then she inherits a great deal of money and begins to realize that she is a very desirable catch -- and that men will let her get away with almost anything!\n\nThe one man who truly loves Lydia is Richardson, a would-be writer from a rather poor and humble local family. On a cold winter day, Lydia has her first kiss from him, but instead of making her fall for him it merely sparks her interest in men in general. Before long Lydia is the talk of the town, dashing about in her flashy new clothes and going to hot, Twenties-style dances where she is always the center of attention. One by one, all the handsomest and most exciting young men in the neighborhood simply collapse at her feet -- rich and stylish Alec Sanderson, sweet and trusting Tom Holland, and even the tough local mechanic, mean and muscular and hairy-chested Blackie Flannagan. Lydia toys with all three men at once, totally enjoying both the sense of power and the pleasure. Totally ignoring the pain in Richardson's eyes, she grows more and more reckless, until at last tragedy strikes. Lydia sees herself as she truly is -- weak, greedy and selfish. She wants to change, but by now even loyal and faithful Richardson is tired of her. Is it too late for Lydia -- too late for love?\n\nLOVE FOR LYDIA is a sumptuous and beautifully filmed romantic epic. The big dance scenes are exhilarating, but the quiet scenes draw you in too. Lydia changes from a shy schoolgirl to a glamorous and sexy siren.\n\nBut in her quiet moments you can see her basic insecurity, like the way she lies on the bed listening to the same jazz love song over and over. Night after night she dances till 2 or 3AM, and then next day is still asleep past noon. \n\nThere's an aimless quality to her life, and an emptiness as well. It shows in the way she downs a drink before dinner or takes a quick hit from a pocketbook flask. Glamorous and sexy, but you feel the human side of it -- the loneliness and the waste. A very good British series.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Love For Lydia: Episode 7",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi387235097",
        "name": "Love For Lydia: Episode 7",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODNiMTEyNWItODM4Yy00NjM0LWE2NjMtODZhNDhmZjFkZTdmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODNiMTEyNWItODM4Yy00NjM0LWE2NjMtODZhNDhmZjFkZTdmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-11T07:25:35.254Z",
        "url": "https://www.imdb.com/video/vi387235097/"
    },
    "url": "/title/tt0077046/"
}