{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Guillermo De Córdova",
            "url": "/name/nm0208219/"
        },
        {
            "@type": "Person",
            "name": "Roberto Maurano",
            "url": "/name/nm1086066/"
        },
        {
            "@type": "Person",
            "name": "Carmin O'Neal",
            "url": "/name/nm1086230/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 181,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020838/"
        },
        {
            "@type": "Person",
            "name": "Antonio Velazquez",
            "url": "/name/nm2632789/"
        }
    ],
    "description": "During a cataleptic fit, Montel is buried alive, a burial plotted by his greedy wife Sofia with several men, including her lover, Montel's doctor. Exiting his grave, Montel goes on a sexual rampage. When the conspirators engage in...",
    "director": [
        {
            "@type": "Person",
            "name": "Glauco Del Mar",
            "url": "/name/nm0215626/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Crime",
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmM4Zjg1MDEtNTk2Mi00OTBhLTg5ZjYtODJjNmViZmMxNTk0XkEyXkFqcGdeQXVyMjIyNjE2NA@@._V1_.jpg",
    "keywords": "cemetery,catalepsy,funeral ceremony,infidelity,man forces woman to watch sex",
    "name": "Love After Death",
    "original_info": {
        "id": "Love After Death_1998",
        "name": "Love After Death",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2017-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250517/"
        },
        "name": "The Horny Zombie",
        "reviewBody": "Love After Death (1968) \n\n** (out of 4) \n\nDue to a cataleptic episode, Montel (Guillermo De Cordova) is buried alive by his wife and doctor who he learns were also having an affair. Montel manages to crawl his way to the surface where he eventually takes a liking to watching naked women.\n\nLOVE AFTER DEATH is an Argentinean film that manages to be quite entertaining even though it probably had a budget of only a couple thousand dollars. The film is pretty much all over the map as it wants to be a horror film, a noir and a sexploitation picture. What's most interesting about the film is the opening sequence where the man comes out of the ground and stumbles around a graveyard. You can't help but see some similarities with George A. Romero's NIGHT OF THE LIVING DEAD including the same library music. I'm going to take a guess that the Romero film was out first but I must admit that the director here did a nice job.\n\nAs far as the rest of the film goes, there's nothing overly good about any of it but at the same time it's mildly entertaining if you enjoy these types of movies. The highlight of the film is without question the opening sequence inside the cemetery but from here we basically get a mix of noir and sexploitation. There are countless naked women on display so if you're a sexploitation freak then you'll enjoy what this has to offer. The sex scenes really aren't that erotic but at the same time the nudity will keep your attention."
    },
    "url": "/title/tt0250517/"
}