{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Lau",
            "url": "/name/nm0490489/"
        },
        {
            "@type": "Person",
            "name": "Sammi Cheng",
            "url": "/name/nm0155618/"
        },
        {
            "@type": "Person",
            "name": "Rikiya Kurokawa",
            "url": "/name/nm0475870/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1921,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Love on A Diet",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003221/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036229/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068676/"
        },
        {
            "@type": "Person",
            "name": "Ka-Fai Wai",
            "url": "/name/nm0906413/"
        },
        {
            "@type": "Person",
            "name": "Nai-Hoi Yau",
            "url": "/name/nm0946883/"
        }
    ],
    "datePublished": "2001-06-21",
    "description": "A depressed, obese woman tries to lose weight in order to win back her ex-boyfriend with the help of a fellow Hong Konger whom she met in Japan.",
    "director": [
        {
            "@type": "Person",
            "name": "Johnnie To",
            "url": "/name/nm0864775/"
        },
        {
            "@type": "Person",
            "name": "Ka-Fai Wai",
            "url": "/name/nm0906413/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkwODkzNzc5N15BMl5BanBnXkFtZTcwMzE5MzcyMQ@@._V1_.jpg",
    "keywords": "fat suit",
    "name": "Sau sun nam lui",
    "original_info": {
        "id": "Love on a Diet_2001",
        "name": "Love on a Diet",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SoulxSide"
        },
        "dateCreated": "2001-09-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0286797/"
        },
        "name": "Love on a Diet is a decent flick",
        "reviewBody": "Love on a Diet is a romantic comedy about a woman who gained 200 lbs and is too ashamed of herself to reunite with her lost love. She meets and takes over the life of another 300 pounder who makes it his mission to get her skinny again so she can reunite with her love. I don't want to give away anything more than that, but once you start watching the film you'll see the plot developments coming a mile away.\n\nThis is a film that is basically about how fat people are miserable losers and thin people are happy and perfect. Bah... If you are able to look past the anti-fat campaign and all the political incorrectness going on, it's a pretty enjoyable film. Andy Lau turns out a decent performance, but certainly not his best. I often get the feeling that he's disgusted with acting in movies because he always seems to have that sort of attitude. Sammi is great in this film as the fat girl.\n\nTechnically, this film is nothing new... Fat suits have been around for quite some time. Andy and Sammi are both extremely petite people in real life, but they do a pretty good job of making them look obese. The make-up was good and included every detail - even the fingers were fattened up. Still - not one moment passed where the fact that they were skinny people in fat suits slipped past my notice. It wasn't quite as good as Eddie Murphy's make-up job in The Nutty Professor, but this was also a much tighter budget. I can't knock the job they did here too much though... it was indeed good enough.\n\nThe comedy was light and I chuckled a few times, but this was not a Stephen Chow film, so I can't expect to be rolling on the floor laughing myself silly. The romance was also light... as I said, the plot development can be seen from a mile away - mostly because you've seen it before. Essentially - this is one of those movies that you would describe as \"cute\" but probably not \"spectacular\" or \"incredible\"... just \"cute\". It's worth seeing, but you would be ok if you skipped it.\n\nIt's currently available on VCD and DVD from HK (fairly cheap too I should add). The DVD includes a Making-Of featurette and Trailers. The VCD is one of the best I've seen in terms of transfer quality and sound. Although, the prices only differ by 3 or 4 US dollars so it might not be such a big deal for someone to spring for the DVD unless they are on a budget (in which case, the VCD is very nice).\n\nI'd rate this film 6/10 or thereabouts. I wasn't all that impressed with anything from the movie, but it was decent and worth my time to watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0286797/"
}