{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Louis Koo",
            "url": "/name/nm0465503/"
        },
        {
            "@type": "Person",
            "name": "Gigi Leung",
            "url": "/name/nm0504942/"
        },
        {
            "@type": "Person",
            "name": "Charlene Choi",
            "url": "/name/nm1218953/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 221,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "Love on the Rocks",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003221/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0239007/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036229/"
        },
        {
            "@type": "Person",
            "name": "Hing-Ka Chan",
            "url": "/name/nm0150916/"
        }
    ],
    "datePublished": "2004-04-08",
    "description": "A man tries to save his relationship with his girlfriend by hiring a dating guru and revisiting failing relationships from the past.",
    "director": [
        {
            "@type": "Person",
            "name": "Hing-Ka Chan",
            "url": "/name/nm0150916/"
        },
        {
            "@type": "Person",
            "name": "Dante Lam",
            "url": "/name/nm0482592/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmY3MjIxYzYtMzE1Mi00YzRkLTkyYTMtOTQ4YmY4ZTU5MmM2XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg",
    "keywords": "dating",
    "name": "Luen ching go gup",
    "original_info": {
        "id": "Love on the Rocks_2004",
        "name": "Love on the Rocks",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Lizzy1024"
        },
        "dateCreated": "2005-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0409016/"
        },
        "name": "Fun comedy with a hilarious cast",
        "reviewBody": "Perhaps the vote I've given this movie seems a little high at first but I wasn't grading this based on technical achievement. I gave it a 9/10 because it was fun movie that I couldn't stop watching even though I first caught a glimpse of it on television at around eleven at night, while on vacation, and needed to be up really early in the morning.\n\nThe basic premise is that a guy (Louis Koo) is not romantic enough for his girlfriend, so the girlfriend (Gigi Leung) breaks up with him, but he convinces her to give him until Easter to make their breakup official. He then hires a romance coach, Charlene Choi, to teach him what to do to be romantic which leads to hilarious scenarios, and flashbacks to his past girlfriends. The plot is thin, yes, and sometimes it goes off tangent, but the film never strays far, and the pace is always fast, and the movie never bogs down for long.\n\nThere are two things that really help carry this movie and keep it from being a bit ridiculous. First is the ensemble cast. Louis Koo has such great comedic timing in his expressions, and he does very well in keeping a balance between the silly and sentimental side of his character. He's also not afraid to make himself look like a complete fool, such as in one particularly memorable scene when he gets his ass kicked by martial arts star Donnie Yen with a belt. Ultimately however, he makes his character very likable, and easy to sympathize with, despite all the faults. He's creates a truly believable flawed character, not a hero with some tragic flaw like in most movies. He's an average guy, but you still root for him. Gigi Leung's character doesn't hold up as well, because she's a little too ditzy, however, Gigi is cute in the role and you'll want to see her be happy in the end. Charlene Choi can be annoying sometimes in her roles, but I think she did an excellent job here as the girl who tries to bring romance back into Koo's character's life. The supporting cast makes memorable turns too in character roles that add a lot of humour to the movie. Out of the old girlfriends, Gillian Chung (it was only after this film that I found out about Twins and the fact that they're EVERYWHERE) makes the deepest impression because in a movie that doesn't try to take itself very seriously she gives a rather poignant performance that I thought was quite touching, and says a lot about how human nature. Two other standouts were the guy who tries to set up Gigi's character with his boss, and the guy who plays her father. They're not large parts, but they're nice touches to the movie.\n\nThe second thing that really helps the movie is the theme music that plays throughout. I haven't watched many HK films, but this one is catchy and really fits the mood of the movie. It's a fun tune and tell you not to take the film too seriously.\n\nAfter finishing the film and being instilled with a new found appreciation for Hong Kong cinema and it's slapstick comedies that don't employ grossout humour for its laughs, I set out to find this movie. I did end up finding a copy and I watch it every so often. It a great addition to my DVD collection, and never fails to make me laugh. It of course has its faults, like a particularly useless cameo by Alex Fong, Olympic swimmer turned heartthrob (although I'm not sure exactly how, with his looks), but that's why I gave this movie a 9 instead of a ten. they're flaws but they don't ruin the enjoyment of this film. So go watch, you may be pleasantly surprised.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0409016/"
}