{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Greager",
            "url": "/name/nm0337278/"
        },
        {
            "@type": "Person",
            "name": "Sergei Baigildin",
            "url": "/name/nm0047080/"
        },
        {
            "@type": "Person",
            "name": "Robin Donald",
            "url": "/name/nm0232042/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 43,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032553/"
        },
        {
            "@type": "Person",
            "name": "Salvatore Cammarano",
            "url": "/name/nm0131899/"
        }
    ],
    "datePublished": "1991-06-24",
    "description": "In July 1835 Donizetti was to have staged the first of the three new operas for which he had signed a contract with the management of the San Carlo theatre; but things, as so often happens in the world of opera, did not work out a...",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Butler",
            "url": "/name/nm0125091/"
        }
    ],
    "duration": "PT2H23M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAyMTE4ODY1N15BMl5BanBnXkFtZTcwMjY4NTIyMQ@@._V1_.jpg",
    "keywords": "opera,classical",
    "name": "Lucia di Lammermoor",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2011-07-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0277112/"
        },
        "name": "La Stupenda in her signature role....",
        "reviewBody": "I have always been a fan of opera, and one of my earliest memories of it was hearing a recording of La Traviata with Joan Sutherland, Carlo Bergonzi and Robert Merrill, and thinking \"wow, Sutherland's high notes are beyond amazing\". After hearing more of her voice and seeing her presence on stage, I am now a fan of the now late Joan Sutherland, not just for her dazzling and powerful colouratura and her sense of fun on stage but also her gracious manners.\n\nTo see her in what I consider her signature role was a delight for me. Okay Sutherland mayn't be as good as she was in her prime, where she was phenomenal, however alongside her 1983 Lucia and her 1984 Anna Bolena this performance is one of her better performances of the 80s. She manages to be imposing and gracious on stage and is in pretty dazzling voice.\n\nAs a production, this Lucia is really quite delightful. The sets and costumes are all beautiful and lavish, even if some of the rather dark lighting hinders it occasionally, and when it comes to the staging the Sextet(beautifully sung, balanced and staged in an efficient and interesting way) and Mad Scene(very effective if not as vivid or as somewhat shocking as somebody like Zeffirelli envisioned, if memory serves Sutherland appears in a long white dress covered in blood).\n\nI consider Lucia Di Lammermoor to be Donizetti's masterpiece, though I am fond of La Favorita and La Fille Du Regiment as well. The music is sublime, the Sextet and the Mad Scene are the two most famous parts of the opera and deservedly so, but I also like very much Enrico's Crude Funesta Smania...La Fietade In Suo Favore.\n\nThe orchestra playing throughout is involving and Richard Bonynge's conducting precise and musical. The support cast are solid. For me, Lucia doesn't really work if you don't have a good Lucia or Edgardo. Fortunately, we have a wonderful Lucia, who while past prime is still superb and an above average and emotive Edgardo in the name of Richard Gaegar. Malcolm Donnelly is a powerful Enrico, Clifford Grant does a very nice job as Raimondo and Sergei Baigliden is a good Artuto.\n\nAll in all, a great production and a delight to see Sutherland in her signature role. 9/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0277112/"
}