{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stefania Bonfadelli",
            "url": "/name/nm1454043/"
        },
        {
            "@type": "Person",
            "name": "Marcelo Álvarez",
            "url": "/name/nm1235563/"
        },
        {
            "@type": "Person",
            "name": "Roberto Frontali",
            "url": "/name/nm0989246/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035035/"
        },
        {
            "@type": "Person",
            "name": "Salvatore Cammarano",
            "url": "/name/nm0131899/"
        },
        {
            "@type": "Person",
            "name": "Walter Scott",
            "url": "/name/nm0779797/"
        }
    ],
    "director": [
        {
            "@type": "Person",
            "name": "Andrea Dorigo",
            "url": "/name/nm1789438/"
        }
    ],
    "duration": "PT2H25M",
    "genre": [
        "Music",
        "Drama"
    ],
    "keywords": "italian opera,revenge,opera,suicide,insanity",
    "name": "Lucia di Lammermoor",
    "original_info": {
        "id": "Lucia Lucia_2003",
        "name": "Lucia Lucia",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Gyran"
        },
        "dateCreated": "2006-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0436527/"
        },
        "name": "Love you madly",
        "reviewBody": "Bel canto is a bit like country music for eggheads, big tunes and obvious emotions. I love it but rarely get the opportunity to hear it, either live or on film. I am going to hear Lucia di Lammermoor at La Scala Milan soon and, in order to get a taste of what to expect, I had to lay out £25 of my own money to buy this DVD. I plumped for this attractive, widescreen, modern version rather than one of the several versions made by Joan Sutherland in the 1970s and 1980s. It turned out to be a good choice.\n\nThe libretto of Lucia is based on Sir Walter Scott's \"The Bride of Lammermoor\". In Donizetti's opera all the politics and back-story is stripped out and we are left with a simple story of love, betrayal and madness. Lucia is secretly betrothed to her brother's enemy Sir Edgardo di Ravenswood. Her brother Lord Enrico Ashwood, tricks her into believing that Edgardo has been unfaithful and persuades her to marry Lord Arturo Bucklaw. On her wedding night, she learns the truth, becomes comprehensively insane and murders her husband. \n\nIn this production for Teatro Carlo Felice, Genova, the stage director Graham Vick has chosen a resolutely Scottish look. Most of the action takes place on a wind-blasted Scottish moor with the stage being covered with purple heather. The Ashwoods wear a blue tartan and Sir Edgardo wears a red tartan. To emphasise her Scottishness, the soprano Stefania Bonfadelli wears a flowing, curly wig the colour of orange peel. The overall effect is attractive although it is a bit reminiscent of Brigadoon.\n\nOne reason that this opera is not often performed is that the soprano role really needs someone of the calibre of Maria Callas or Joan Sutherland. Stefania Bonfadelli proves herself to be a worthy successor to these performers. She has a fragile beauty with mad, staring eyes. She does not descend into madness: right from her opening scene it is clear that this Lucia is one shortbread light of a cracker-barrel. I thought, at the beginning, that Bonfadelli was a little uncertain in the lower part of her register but the higher the music soars the better she sounds. She has a light but beautiful tone, ideal for bel canto. Her duet with Marcello Alvarez's Edgardo: \"Verrano a te sull'allure\" is the highlight of the first act as Edgardo lays down his red tartan on the heather symbolising their nuptial bed. Of course this opera is all about the mad scene. Instead of playing it in front of the wedding guests, Vick has her play the scene alone among the heather. Covered in blood, Lucia re-enacts the betrothal scene with the tartan blanket, this time with an imaginary lover. Her aria reworks the lover's duet. Bonfadelli's coloratura in the extreme heights of the soprano register is quite dazzling and she makes it look effortless.\n\nSurprisingly, Donizetti does not end on the mad scene. It is a measure of Marcello Alvarez's ability as a tenor in this repertoire that he can make the final 15 minutes of the opera his own.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0436527/"
}