{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eriq Ebouaney",
            "url": "/name/nm0248254/"
        },
        {
            "@type": "Person",
            "name": "Alex Descas",
            "url": "/name/nm0220976/"
        },
        {
            "@type": "Person",
            "name": "Théophile Sowié",
            "url": "/name/nm0816380/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2002,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066246/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001178/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021735/"
        },
        {
            "@type": "Person",
            "name": "Pascal Bonitzer",
            "url": "/name/nm0094726/"
        },
        {
            "@type": "Person",
            "name": "Dan Edelstein",
            "url": "/name/nm0249041/"
        },
        {
            "@type": "Person",
            "name": "Raoul Peck",
            "url": "/name/nm0669704/"
        }
    ],
    "datePublished": "2000-09-27",
    "description": "The true story of controversial leader of independent Congo, Patrice Lumumba.",
    "director": [
        {
            "@type": "Person",
            "name": "Raoul Peck",
            "url": "/name/nm0669704/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkwNzA2MzU0NF5BMl5BanBnXkFtZTcwNjkxMjEyMQ@@._V1_.jpg",
    "keywords": "deception,belgian history,chopping up a corpse,africa,patrice lumumba",
    "name": "Lumumba",
    "original_info": {
        "id": "Lumumba_2000",
        "name": "Lumumba",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "widescreenguy"
        },
        "dateCreated": "2004-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0246765/"
        },
        "name": "absorbing dramatization",
        "reviewBody": "I was a pre-teen when news of Lumumba's assassination hit the news so I very vaguely recall at the time it was sad a leader who tried to shuck the reigns of colonialization was killed for efforts towards independence.\n\nThere is woefully insufficient time in a 2 hour movie to completely explain the whos whys and wherefores of a political assassination. Suffice to say the victors write the history and even if the truth were portrayed adequately, who's truth would it be? As the character Lumumba says in the movie, he came 50 years too early.\n\nI found the story fast paced with good production values. It mirrored the all too brief time in power for a promising African leader, and there is a dearth of them lately. That continent still suffers a vacuum in its leadership, a state that will take another century to rectify. The film and life of Lumumba is a lesson of how badly things can go wrong in a climate of conflicting objectives and numerous parties and forces acting in a volatile setting. Congo had just gained independence and tribal rivalry reared its head very quickly. It is suggested for example that Lumumba seek sanctuary in the province of Katanga, where months before he had been refused landing rights in a flight to visit the troubled area. Politics makes strange bedfellows.\n\nThe time of the 1960s was the height of the cold war and Lumumba's courting of Soviet aid to fast track his country did not win any favours. No doubt the superpower USA had at least some hand in his death, much the same as Ngo Dhin Diem in Vietnam around the same time. Attempts to assassinate Fidel Castro at that time are also well documented so it may be some measure of just desserts that Kennedy met his end with an assassin's bullet.\n\nRead up on that period of history then watch the movie to get additional value for the time you invest, and then you will be prepared to better understand contemporary events in far off places when national interests are at stake. Oil, diamonds, bauxite, coffee, whatever; liberty always seems to take a back seat when these interests get the ear of the powers that be.\n\nRealism in the film is reinforced with the french dialog. I also understood the subtleties having studied military coups in university under a black professor who came from Nigeria."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Zeitgeist Films",
        "duration": "PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1556939545",
        "name": "Lumumba",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGI2MWUyOTYtOWIxMi00NmYyLTg2M2MtM2I2NDBjNjRhY2M0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGI2MWUyOTYtOWIxMi00NmYyLTg2M2MtM2I2NDBjNjRhY2M0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-01-23T06:59:32Z",
        "url": "https://www.imdb.com/video/vi1556939545/"
    },
    "url": "/title/tt0246765/"
}