{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kan'ichi Kurita",
            "url": "/name/nm0475737/"
        },
        {
            "@type": "Person",
            "name": "Kiyoshi Kobayashi",
            "url": "/name/nm0462017/"
        },
        {
            "@type": "Person",
            "name": "Makio Inoue",
            "url": "/name/nm0409296/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 844,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Lupin III: Farewell to Nostradamus",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0916603/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0345846/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0346668/"
        },
        {
            "@type": "Person",
            "name": "Monkey Punch",
            "url": "/name/nm0700578/"
        },
        {
            "@type": "Person",
            "name": "Hiroshi Kashiwabara",
            "url": "/name/nm0440569/"
        },
        {
            "@type": "Person",
            "name": "Toshiya Itô",
            "url": "/name/nm3357766/"
        }
    ],
    "datePublished": "1995-04-22",
    "description": "Lupin must rescue a young girl from a doomsday cult seeking a book of prophecies hidden by the girl's father, a wealthy US Presidential candidate.",
    "director": [
        {
            "@type": "Person",
            "name": "Takeshi Shirato",
            "url": "/name/nm0794168/"
        },
        {
            "@type": "Person",
            "name": "Nobuo Tomizawa",
            "url": "/name/nm0866758/"
        },
        {
            "@type": "Person",
            "name": "Shun'ya Itô",
            "url": "/name/nm0411746/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDYzNTkzZGItZDAxZi00ZjRkLWFiYmUtYzkyMGZlODhlZjdmXkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "1990s,based on manga,car chase,counterfeit,cult tv",
    "name": "Rupan sansei: Kutabare! Nostradamus",
    "original_info": {
        "id": "Lupin the 3rd: Farewell to Nostradamus_2005",
        "name": "Lupin the 3rd: Farewell to Nostradamus",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2004-09-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0170181/"
        },
        "name": "LUPIN III: DIE, NOSTRADAMUS!  Action-packed anime adventure",
        "reviewBody": "Easily one of the best of over a dozen feature-length Lupin III animated features and TV specials made between 1979 and 2000, DIE, NOSTRADAMUS! is a 1995 film (98 min.) that showcases all of the Lupin series' regular characters to great effect, but also unleashes a formidable stable of new villains and some interesting supporting characters, including Julia, the fearless, precocious child who's heir to one of the world's largest fortunes, and Douglas, her blindly ambitious father whose U.S. presidential campaign is derailed by her kidnapping. For those new to the Japanese animated Lupin III phenomenon (introduced on TV in Japan in 1971), the regular characters are as follows: Lupin the 3rd, famous jewel thief and grandson of famous French literary character Arsene Lupin; Fujiko, Lupin's gorgeous, buxom and duplicitous sometime partner; Jigen, Lupin's fedora-wearing, gun-toting sidekick; sword master Goemon; and the gang's ever-persistent nemesis, Inspector Zenigata.\n\nThe action in the film is fast and furious and moves from Brazil to an unnamed city in the U.S. (the site of Douglas's 200-story skyscraper HQ, the tallest building in the world) to a Devil's Island-type penal colony to the interior of the Amazon jungle and back to the U.S. Several different parties are all after an original, complete copy of Nostradamus' predictions that Douglas keeps in a vault in his skyscraper. One of these parties is the cult leader of the Church of Nostradamus who needs the book to bolster his own power. The Brazilian soccer team gets involved at one or more points in the story.\n\nThe big action climax occurs in the giant Douglas skyscraper as all parties converge in a race against time to get the book before the bombs planted by one of the competing factions go off. There's quite a lot of genuine suspense and destructive spectacle in this section of the film, which will no doubt please fans of the series but may help to explain why, at least in the last three years, this film has not been picked up for distribution in the U.S. Some of the action here simply hits a little too close to home after 9/11.\n\nWhile Lupin and Fujiko maintain their sense of humor throughout the film and even get romantic during one unusual interlude (with the appropriate-and expected--clothes-shedding), the overall tone is more serious and straightforward than most Lupin features. Things don't get too ridiculous or outlandish as they do in, say, LEGEND OF THE GOLD OF BABYLON (1985) and PURSUIT OF HARIMAO'S TREASURE (1995) to name two Lupin features that are available in the U.S. I would rank NOSTRADAMUS with Hayao Miyazaki's CASTLE OF CAGLIOSTRO (1979) as the two best Lupin animated features. Others I would recommend include THE FUMA CONSPIRACY (1987) which, like CAGLIOSTRO, is available in the U.S., BURNING ZANTETSUKEN (1994), DEAD OR ALIVE (1996), and WALTHER P38 (1997, also reviewed on this site)."
    },
    "url": "/title/tt0170181/"
}