{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Yasuo Yamada",
            "url": "/name/nm0945280/"
        },
        {
            "@type": "Person",
            "name": "Kiyoshi Kobayashi",
            "url": "/name/nm0462017/"
        },
        {
            "@type": "Person",
            "name": "Gorô Naya",
            "url": "/name/nm0623214/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1854,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Lupin the 3rd",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064579/"
        },
        {
            "@type": "Person",
            "name": "Monkey Punch",
            "url": "/name/nm0700578/"
        }
    ],
    "datePublished": "2003-01-13",
    "description": "The master thief Lupin III and his cronies continue their globe-trotting exploits, with the stubborn Inspector Zenigata ever at their trail.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzc5MjFkNjgtNzU0MS00OThkLTgyODktOGYwOTdkNzNiNmVmXkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "1970s,1980s,based on manga,car chase,counterfeit",
    "name": "Rupan sansei: Part II",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2017-09-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0159192/"
        },
        "name": "Lupin is back",
        "reviewBody": "The first 'Lupin' series from 1971 is an anime, and animation, landmark and is still a great show in its own right and a good demonstration of what is so appealing about the Lupin franchise in the first place.\n\nIt was inevitable that there would be another show, and a series of films, that would follow, and the second 'Lupin' series is a very worthy one. It is not as big a landmark as the 1971 incarnation, which was always superbly written, entertaining and even suspenseful, actually really admired the darker and grittier tone of the earlier episodes, which more than made up for the ill-fitting and out-of-date music. With that being said, 'Lupin the III: Part II' does have more polished animation quality and much better music scoring that fits much better and sounds more appealing, plus its tone for anybody more familiar with the films is likely to be more accessible.\n\n'Lupin the III: Part II' is not perfect. Do have to agree that a lot of the modern day jokes in the American/English dub are really jarring and anachronistic, and whether they're successful in being funny wildly varies (some are entertaining, others pretty cringe-worthy and distract badly). Things can be wildly implausible in the earlier episodes, with action that is admittedly well-animated and exciting but throws logic out the window.\n\nHowever, as said, the animation is more polished this time round. There is more refinement in the drawings, more vibrant colouring, bolder and more meticulous background details and it looks more imaginative in general. The music score, again as aforementioned, is a much better fit and is more dynamically scored with a real liveliness, cool vibe and lushness.\n\nWriting is incredibly funny, very smart and also very intelligent, while the action even with the implausibility is really exciting and often beautifully and imaginatively animated. The stories entertain and intrigue, with a real sense of adventure, fun, charm and suspense. Nothing's too simplistic and nothing's convoluted.\n\nGreat characters too, with a likable and interesting titular character who has both a fun and gritty side that stops him from being a one-dimensional stereotype. Of the supporting characters, Zenigata is my favourite, the conflict engrosses between the two and the character is just very well-written in his own right. The voice acting is good.\n\nIn conclusion, very good series. 8/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0159192/"
}