{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tab Hunter",
            "url": "/name/nm0002147/"
        },
        {
            "@type": "Person",
            "name": "Divine",
            "url": "/name/nm0001145/"
        },
        {
            "@type": "Person",
            "name": "Lainie Kazan",
            "url": "/name/nm0443577/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3730,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025300/"
        },
        {
            "@type": "Person",
            "name": "Philip John Taylor",
            "url": "/name/nm0853010/"
        }
    ],
    "datePublished": "1985-03-01",
    "description": "A group of unscrupulous characters seek buried treasure in the old west.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Bartel",
            "url": "/name/nm0000860/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Comedy",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDNlMjA0Y2ItZjQyMS00NTZlLThiZDItMTE5OGQ2NzU3Y2M3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "saloon,treasure map,tattooed map,lynch mob,saved from hanging",
    "name": "Lust in the Dust",
    "original_info": {
        "id": "Lust in the Dust_1985",
        "name": "Lust in the Dust",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Crap_Connoisseur"
        },
        "dateCreated": "2006-03-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089523/"
        },
        "name": "A Trash Masterpiece",
        "reviewBody": "They sure don't make them like this anymore - A comedic musical western about two buxom women, each with part of a treasure map tattooed on their butt. As a cultural oddity of the 1980s, Lust In The Dust stands alone as a truly bizarre collision of the mainstream and the underground.\n\nLust In The Dust owes much to the then emerging popularity of John Waters and his Dreamland players. I don't think it is a coincidence that the film reunites two of the stars of Polyester - transsexual goddess, Divine and weathered heart-throb, Tab Hunter. However, while Polyester merely tested the waters of the mainstream, Lust In The Dust jumps right in with a cast of recognisable actors and a comparatively inoffensive plot line. The result is sometimes awkward and occasionally frustrating, but also frequently hilarious and utterly compelling.\n\nPaul Bartel could not have chosen better leads. Divine was really at the height of his powers as Rosie. Rosie is a luscious siren, who positively steams up the screen. Divine was a master at physical comedy and Rosie's facial expressions are priceless. Lainie Kazan more than meets the challenge as Rosie's rival, Marguerita. Lainie, now better known for mush like My Big Fat Greek Wedding, shows why she is one of the best cult actresses in the business. Marguerita is a wonderful creation and her rendition of \"South of the Border\" (... \"but north of my garter\") is truly a showstopper. Lust In The Dust also provided Tab Hunter with a memorable role as Able Wood. Tab is smart enough to underplay his part in the presence of these two larger than life ladies and is all the more effective because of it.\n\nLust In The Dust is a wonderfully offbeat example of the imaginative work being produced by cult directors in the early 1980s and holds up as a great testament to Divine's inimitable talent."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Drawn into a tangled web of greed, passion and yet more greed are voluptuous singer Rosie Velez (Divine) and lone gunfighter Abel Wood (Tab Hunter). Helped and hindered by saloon owner Marguerita Ventura (Lainie Kazan) and pursued by outlaw Hard Case Williams (Geoffrey Lewis) and his gang, the hapless treasure hunters try to decipher the limerick and locate the two halves of the map that will lead them to their destiny. The only problem being that to find the map means going far further south of the border than anyone anticipated.",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1021690649",
        "name": "Teaser Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTk2OWUzNTgtMTJjNy00NDI1LWJkMDQtN2E0ODhhYjIzOWQ3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTk2OWUzNTgtMTJjNy00NDI1LWJkMDQtN2E0ODhhYjIzOWQ3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-16T16:52:57.606Z",
        "url": "https://www.imdb.com/video/vi1021690649/"
    },
    "url": "/title/tt0089523/"
}