{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joseph Fiennes",
            "url": "/name/nm0001212/"
        },
        {
            "@type": "Person",
            "name": "Bruno Ganz",
            "url": "/name/nm0004486/"
        },
        {
            "@type": "Person",
            "name": "Peter Ustinov",
            "url": "/name/nm0001811/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15629,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024573/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037558/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0169626/"
        },
        {
            "@type": "Person",
            "name": "Camille Thomasson",
            "url": "/name/nm0859742/"
        },
        {
            "@type": "Person",
            "name": "Bart Gavigan",
            "url": "/name/nm1268543/"
        }
    ],
    "datePublished": "2003-09-26",
    "description": "During the early sixteenth century, idealistic German monk Martin Luther, disgusted by the materialism in the Catholic Church, begins the dialogue that will lead to the Protestant Reformation.",
    "director": [
        {
            "@type": "Person",
            "name": "Eric Till",
            "url": "/name/nm0863254/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5NjQ1MTQ0M15BMl5BanBnXkFtZTgwNDUwNzgwMzE@._V1_.jpg",
    "keywords": "thuringia germany,erfurt germany,95 theses,justice,hypocrisy",
    "name": "Luther",
    "original_info": {
        "id": "Luther_2003",
        "name": "Luther",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Nazi_Fighter_David"
        },
        "dateCreated": "2007-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0309820/"
        },
        "name": "The passion account of a theologian who stood against The Vatican and the Inquisition 450 years ago",
        "reviewBody": "The life of the 16th-century German monk Martin Luther (1483-1546) was filled with inner compulsions, focusing on his crucial years of his crusade against the Catholic Church, leading to his break with the Roman Catholic Church \n\nDirector Eric Till presents Rome as a shattered city where depravity was everywhere This infuriated Luther who could not believe that Rome is a circus describing it as 'a running sewer, where you can bye anything, sex, and salvation, and where they also have brothels for clerics.' \n\nHe also witnesses the church collecting coins from the people supposedly to free their sins to build Saint Peter's Church and would be therefore released from Purgatory and enter the Heaven \n\nLuther was eventually branded a heretic, his books examined and burned, and anyone who presumes to infringe Pope Leo's excommunication will stand under the wrath of Almighty God and the Apostles Peter and Paul \n\nThe reaction of the peasants in Germany was against the reaction of the Inquisition who was burning his writingsFor the German people \"you can't burn his ideas.\" For the Church, his works shall be erased from the memory of man! \n\nLuther's criticism was not against his Holiness, Pope Leo X, but of those rogues who claim to represent him His goal was not to quarrel with the Pope or the Church but to defend them than mere opinion! The Gospel, as he affirmed, cannot be denied for the word of man! \n\nAs a loyal son of the Church, Luther finds sanctuary with Prince Frederick, who finds him too daring for him but decides not to surrender him to Rome Luther goes on to produce his first translation of the New Testament Bible into German language He marries the ex-nun, Katerina Von Borg, becomes a hero to the people and in spite of his outlaw status with the Church authorities, his followers ultimately break with Rome \n\nJoseph Fiennes played intensely the intriguing story of a brilliant Augustinian monk with an independent mind who is not interested in comfort but in the truth! \n\nSir Peter Ustinovin his final rolerealizes the danger Luther poses to the Catholic Church \n\nAlfred Molina as Brother John Tetzel, is the showman terrorizing the good people of Jüterbog into purchasing special indulgences letting everyone know the fires of hell awaiting those who did not contribute \n\nJohann Von Staupitz is the spiritual counselor who knows that Martin has aptitude for law, and could be send to Rome for a legal brief \n\nClaire Cox is Luther's beautiful wife who stood behind her young 16th century monk driven by courage and outrage against a powerful Medieval Church",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "During the early sixteenth century, idealistic German monk Martin Luther, disgusted by the materialism in the Catholic Church, begins the dialogue that will lead to the Protestant Reformation.",
        "duration": "PT2M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3666985753",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjA4YWVmYzgtMmExYi00OWFmLTk3NDMtNmNlY2EwYjE2YWFlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjA4YWVmYzgtMmExYi00OWFmLTk3NDMtNmNlY2EwYjE2YWFlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-04T00:42:35.104Z",
        "url": "https://www.imdb.com/video/vi3666985753/"
    },
    "url": "/title/tt0309820/"
}