{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ian McKellen",
            "url": "/name/nm0005212/"
        },
        {
            "@type": "Person",
            "name": "Judi Dench",
            "url": "/name/nm0001132/"
        },
        {
            "@type": "Person",
            "name": "John Bown",
            "url": "/name/nm0101421/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 868,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "alternateName": "Macbeth",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103320/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103342/"
        },
        {
            "@type": "Person",
            "name": "Trevor Nunn",
            "url": "/name/nm0638080/"
        },
        {
            "@type": "Person",
            "name": "William Shakespeare",
            "url": "/name/nm0000636/"
        }
    ],
    "datePublished": "1979-01-04",
    "description": "Macbeth (Sir Ian McKellen) is a daring member of the Scottish military, who receives a revelation from three menacing sorceresses that he will someday become the King of Scotland. This information gives him a thirst for power, and...",
    "director": [
        {
            "@type": "Person",
            "name": "Philip Casson",
            "url": "/name/nm0144353/"
        },
        {
            "@type": "Person",
            "name": "Trevor Nunn",
            "url": "/name/nm0638080/"
        }
    ],
    "duration": "PT2H25M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEwMTU0ODgyNV5BMl5BanBnXkFtZTcwMzc0MDcyMQ@@._V1_.jpg",
    "keywords": "needing sleep,haunted by own murder victim,resentment toward usurper,able to see the dead,shakespeare's macbeth",
    "name": "A Performance of Macbeth",
    "original_info": {
        "id": "Macbeth_1979",
        "name": "Macbeth",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bandw"
        },
        "dateCreated": "2007-11-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079499/"
        },
        "name": "Primarily for ardent Shakespeare fans",
        "reviewBody": "This is about as spare a production of a Shakespeare play as you are likely to get. It is really more of a reading of the play than a performance. It is listed as being in color, but the colors are so muted that I had to check that my TV was not broken, since it looked pretty much like black and white to me.\n\nAnyone coming to this production cold is going to be quite confused and will most likely abandon the effort.\n\nThe acting is stagy - you might say that this film sets the standard for the definition of that word. This will definitely not be for all tastes. As good an actor as McKellen is I could never connect with him in this performance, though he does do a great job on some of the soliloquies, particularly the one ending with \"it is a tale Told by an idiot, full of sound and fury, Signifying nothing.\" I was much more engaged by McKellen during his talks about the performance on the DVD extras than I was by his performance in the film. Dench's Lady Macbeth was too shrill for me. \n\nThere are some interesting innovations, like \"Double, double toil and trouble; Fire burn, and cauldron bubble,\" being sung as a Gregorian Chant throughout most of Act IV, Scene 1. Other scenes did not work as well for me, such as the opening shot where the camera pans around the circle of actors. Having some text describing the characters that the actors were portraying would have been helpful, but I saw little significance to this as it is. And the loud organ music I found distracting and inconsistent with the production.\n\nThere are some casting problems. Roger Rees as Malcomb, dressed in his knit turtleneck sweater, looks more like he just came out of a fraternity party than being the leader of a large army.\n\nPurists will hurl stones at me for saying it, but I much prefer Polanski's cinematic. \"The Tragedy of Macbeth.\"\n\nMcKellen is quoted as saying that this is Shakespeare on the cheap. I think that the statement \"You get what you pay for,\" might apply here.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0079499/"
}