{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "Uma Thurman",
            "url": "/name/nm0000235/"
        },
        {
            "@type": "Person",
            "name": "Bill Murray",
            "url": "/name/nm0000195/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22145,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032570/"
        },
        {
            "@type": "Person",
            "name": "Richard Price",
            "url": "/name/nm0697115/"
        }
    ],
    "datePublished": "1993-03-05",
    "description": "When shy, soft-spoken Chicago detective Wayne \"Mad Dog\" Dobie inadvertently saves the life of local gangster Frank Milo, he's the reluctant recipient of an unusual one week \"thank you\" gift - a beautiful bartender named Glory.",
    "director": [
        {
            "@type": "Person",
            "name": "John McNaughton",
            "url": "/name/nm0573796/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWViMGIzMzktNDhjYS00ZjVhLWFjOWQtMjVlMmRhZjI5ZDlkXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "premarital sex,character names as title,forename in title,nickname in title,female topless nudity",
    "name": "Mad Dog and Glory",
    "original_info": {
        "id": "Mad Dog and Glory_1993",
        "name": "Mad Dog and Glory",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "johnnyboyz"
        },
        "dateCreated": "2007-05-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107473/"
        },
        "name": "One of those lost films that everybody would've hated had it not been for the cast but should still give a go regardless.",
        "reviewBody": "Most things in Mad Dog and Glory work. The film uses humour, a love story, cross casting and a scrape of suspense well and at various different intervals. What doesn't work are the overall frustrations that bog the film down. The premise is so simple, watching it might make you think you've seen it a hundred times before but that doesn't detract too much. De Niro plays a role that I hadn't seen him play before and must admit, I didn't think he had it in him following other such performances like Taxi Driver, Raging Bull and Ronin where he played various different roles with various different aims. Here he pulls off the nervous, shy photographer whom just goes about his business and although it takes some getting used to, it's a pleasant surprise.\n\nHe can be contrasted with Bill Murray's character of Frank Milo who is a criminal/mob boss that is saved by De Niro's character following a gun point robbery. What's clever about this fact is that Murray is playing the character De Niro normally plays and vice-versa. Throughout the film, the script is consistent. Mad Dog (De Niro) gets to confess some jokes to Milo since he also works as a stand up comic; something we're more familiar to Bill Murray doing, and the awkward exchanges between Mad Dog and Glory (Thurman) also evoke some emotions.\n\nUma Thurman is just about 'put-upable' in this film. Her character is right on that fine-line you get that separates 'likeable' and 'annoying' in a very distinct way. Once more, the overall treatment of the female characters also stands out in a rather obvious way. At the bars, it's all women who run around serving the men who sit there and enjoy themselves; the character of Glory, as I've said, has a dopey, annoying voice and is someone whom is to phone Milo on instructions. Glory isn't very smart either and when, nearer the end in a heated exchange between Mad Dog and Milo, Milo yells 'You love her? I OWN her!' it's really made to seem like the screenwriter has something against the female side of our species.\n\nAlthough the film is pretty much consistent throughout in its subject matter with Mad Dog and Glory spending enough time with one another to begin to like each other, Frank Milo remaining a constant, background friend and foe alike; it falters towards the end when certain characters try to raise money and the ending is such a horrible, happy, un-realistic ending  it actually leaves a bad taste in the mouth when the feeling should be very different. Sure, I was happy for the characters involved but it was too generic. Reading up on it, I found that there were two endings meaning that even the makers were undecided.\n\nRegarding Uma Thurman, this is a film of hers I feel I never would have seen had it not been for some dedicated searching and I was certainly very surprised when the sex scenes with De Niro came along since I'd always assumed she'd done Dangerous Liasons in 1988 and then nothing until 1994's Pulp Fiction which then, kick-started what was a series of successful, well known films. The reason for my surprise is that I never hear anyone mention this film as one of either Thurman's or De Niro's best. It's true that it's far from great but the sheer surprise at realising both had done this film in their careers is enough to realise and to respect the acting talent involved. From now on, when people speak of Uma Thurman or Robert De Niro, this is a film of their's I will bring up and probably recommend.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2610364697",
        "name": "Mad Dog And Glory",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2M0ZDFlNDItZWIwMS00OTE1LTgwMGUtN2YwNGU2N2VlYzU5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2M0ZDFlNDItZWIwMS00OTE1LTgwMGUtN2YwNGU2N2VlYzU5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:06:35Z",
        "url": "https://www.imdb.com/video/vi2610364697/"
    },
    "url": "/title/tt0107473/"
}