{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ying Huang",
            "url": "/name/nm2662404/"
        },
        {
            "@type": "Person",
            "name": "Richard Troxell",
            "url": "/name/nm0873878/"
        },
        {
            "@type": "Person",
            "name": "Ning Liang",
            "url": "/name/nm0508651/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 619,
        "ratingValue": 7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043325/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034023/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029218/"
        },
        {
            "@type": "Person",
            "name": "Giuseppe Giacosa",
            "url": "/name/nm0316044/"
        },
        {
            "@type": "Person",
            "name": "Luigi Illica",
            "url": "/name/nm0407794/"
        },
        {
            "@type": "Person",
            "name": "Frédéric Mitterrand",
            "url": "/name/nm0594158/"
        }
    ],
    "datePublished": "1995-11-22",
    "description": "The story of a young geisha who falls madly in love with an american captain that travels all around the world collecting hearts.",
    "director": [
        {
            "@type": "Person",
            "name": "Frédéric Mitterrand",
            "url": "/name/nm0594158/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTFkMDNjYTItMTE3Ny00NTAwLWIxMWUtMWI4NGQyMjIxNzBkXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "based on opera,suicide,love,geisha,white man asian woman relationship",
    "name": "Madame Butterfly",
    "original_info": {
        "id": "Madame Butterfly_1995",
        "name": "Madame Butterfly",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "EUyeshima"
        },
        "dateCreated": "2006-10-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113731/"
        },
        "name": "A Fitfully Effective Attempt to Cinematize the Classic, Familiar Puccini Opera",
        "reviewBody": "Filming an opera, especially one as globally well known as Puccini's, is a daunting challenge because so much of what has been composed and dramatized has been designed specifically for the stage of an opera hall. On one end, there have been superb video recordings of great stage performances, such as the 2005 Salzburg Festival production of Verdi's \"La Traviata\" with Anna Netrebko and Rolando Villazón. On the other end are adaptations that try to cinematize operas with real locations, though most often with some deficiencies, for example, Barbara Willis Sweete's 2002 production of Gounod's \"Roméo et Juliette\" with Roberto Alagna and Angela Gheorghiu frankly too old to play the young lovers. In the latter camp, this 1995 French-financed film shows director Frédéric Mitterand making a valid attempt toward authenticity, but he misses a key opportunity to open up the visual and sensory possibilities beyond the obvious. Despite the creative use of Tunisian locations to replicate early 1900's Japan, the result still feels oddly stage-bound and dramatically inert despite some bravura musical moments.\n\nThe heavily masochistic story is familiar. In 1904, U.S. naval officer Lieutenant Pinkerton, while stationed in Nagasaki, marries a teenaged girl named Cio-Cio San. Despite their affections for one another, he cavalierly sees the marriage as one of convenience, and when his assignment is done, he goes back to the U.S. with no intention of returning. Cio-Cio San, however, takes the relationship so seriously that she sacrifices her family for the marriage. Three years pass by, but it does not deter Cio-Cio San from hoping for Pinkerton's return since it turns out that she has borne their son in the meantime. Finally, a ship arrives and Cio-Cio San correctly surmises that he is on it. However, tragedy ensues since Pinkerton has remarried in the interim and wants to take his son back to America with him and his new American wife. Taken on the surface, the opera seems defiantly anti-American in showing Pinkerton to be a superficial cad despite how remorseful he may appear at the end, but it also takes a sideswipe at the purportedly subservient nature of Japanese women since her own self-delusions are so intractable. Regardless, the heartstrings are pulled at the right moments when the opera is acted in the manner Puccini intended.\n\nChinese soprano Ying Huang was chosen over hundreds of young singers for the title role, and while she does not really look Japanese, she displays a sweetly supple voice as she performs the dramatic arc of Cio-Cio San's plight. However, as a screen actress, Huang lacks a certain lightness in the early romantic scenes and seems a bit at sea with the later melodramatic moments. Even though she lacks the plummy depths of a Callas or a Tebaldi, she provides affecting renditions of the two pivotal arias, \"Un bel dì vedremo\" when Cio-Cio San looks out into the harbor awaiting Pinkerton's return, and her death scene, \"Con onor muore\". As Pinkerton, admittedly a tough role to play much less sympathize with, American tenor Richard Traxell matches Huang well vocally, but again his acting seems a bit shallow as he only shows unrelenting bravado in the first act and guilt-ridden regret in the third. The others in the cast fare better since there are less dramatic demands on them, in particular, American baritone Richard Cowan as the sympathetic consul Sharpless and acclaimed Chinese mezzo-soprano Liang Ning as the maid Suzuki.\n\nDespite some nice art direction, the visual presentation feels somewhat flat when colors should really pop and the camera be more mobile. There are also some scenes that simply do not work such as having Cio-Cio San's uncles come to banish her from the family in an airborne fashion and the use of anachronistic Japanese newsreel footage as a musical bridge. However, the sound itself is fine with superb orchestral support from the Orchestre de Paris under the baton of James Conlon. There is one extra with the 2002 DVD, a 12-minute making-of featurette which really amounts to following Huang from her initial audition through the actual production.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0113731/"
}