{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeanne Moreau",
            "url": "/name/nm0603402/"
        },
        {
            "@type": "Person",
            "name": "Ettore Manni",
            "url": "/name/nm0543188/"
        },
        {
            "@type": "Person",
            "name": "Keith Skinner",
            "url": "/name/nm0804275/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1450,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063466/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103083/"
        },
        {
            "@type": "Person",
            "name": "Marguerite Duras",
            "url": "/name/nm0243921/"
        },
        {
            "@type": "Person",
            "name": "Jean Genet",
            "url": "/name/nm0312792/"
        }
    ],
    "datePublished": "1966-08-01",
    "description": "In a French village, Manou is an Italian logger, virile, with a broad laugh. He can't say no to women's sexual invitations, and jealous villagers blame him for recent fires and a flood. He is innocent; the culprit is \"Mademoiselle...",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Richardson",
            "url": "/name/nm0724798/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzRjNDg0NzItNmI3Ny00MmIwLWI4OTgtMGMzNmI2MjQwM2IxXkEyXkFqcGdeQXVyNjYxOTg2ODI@._V1_.jpg",
    "keywords": "high heels,pantyhose,stockings,black pantyhose,schoolteacher",
    "name": "Mademoiselle",
    "original_info": {
        "id": "Mademoiselle_1966",
        "name": "Mademoiselle",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MogwaiMovieReviews"
        },
        "dateCreated": "2020-09-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060648/"
        },
        "name": "Jean Genie and Jeanne Moreau",
        "reviewBody": "This is a real gem from British director Tony Richardson (The Loneliness of the Long Distance Runner, Taste of Honey) and French jailbird Jean Genet, very rarely seen, filled with eerie and wondrous black and white photography courtesy of David Watkins, whose static camera seems to peer more deeply into certain moments than should be possible, making many of the outdoor scenes in particular feel mythic and fairytale-like.\n\nJeanne Moreau, as the sociopathic small-town schoolteacher, reminded me very much of Isabelle Huppert in another of my favourite films, La Pianiste - there's the same cold, reptilian, but hypnotically mesmerizing malevolence, and a desire on our part to understand what can't be understood. Ettore Manni, as the immigrant lumberjack Manou, has many moments of delicate injury and thoughtful reflection amid his lusty joi de vivre that makes him a much more appealing and relatable character.\n\nIt's a very simple story, and perhaps doesn't have all that much more to tell us other than people are unfathomably strange and usually smallminded, and that evil is mundane and often rewarded when hiding in plain sight in a fragile form. And yet the effect of it all is much more, and this feels both a very modern and forward-thinking film (the long, stationary shots reminded me particularly of the movies of Michael Haneke) and a very ageless film, unmoored from any particular era - either way, it certainly doesn't feel like it was made the same year The Beatles were making Yellow Submarine.\n\nIt falls a little short of greatness because of its slightness of story and lack of cohesion - most of the English supporting cast are a little weak too - but I can wholeheartedly recommend this to anyone wanting to see beautiful cinema and willing to go for a ride into the murkier waters of the human heart.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0060648/"
}