{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Widmark",
            "url": "/name/nm0001847/"
        },
        {
            "@type": "Person",
            "name": "Henry Fonda",
            "url": "/name/nm0000020/"
        },
        {
            "@type": "Person",
            "name": "Inger Stevens",
            "url": "/name/nm0828447/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3863,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Howard Rodman",
            "url": "/name/nm0734911/"
        },
        {
            "@type": "Person",
            "name": "Abraham Polonsky",
            "url": "/name/nm0689796/"
        },
        {
            "@type": "Person",
            "name": "Richard Dougherty",
            "url": "/name/nm0234877/"
        }
    ],
    "datePublished": "1968-03-29",
    "description": "In New York City's Spanish Harlem, detectives Madigan and Bonaro are given 72 hours by their superior to capture a hoodlum wanted for homicide in Brooklyn.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Siegel",
            "url": "/name/nm0796923/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTAxNjZjNjItMTVmNi00YTg5LTliMWMtNGZiMzJkZGFjMDY4XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg",
    "keywords": "manhunt,murder of a police officer,detective,police commissioner,new york city",
    "name": "Madigan",
    "original_info": {
        "id": "Madigan_1968",
        "name": "Madigan",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2012-08-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063256/"
        },
        "name": "Between The Killers and Dirty Harry, Don Siegel presents Madigan.",
        "reviewBody": "Madigan is directed by Don Siegel and adapted to screenplay by Abraham Polonsky and Howard Rodman from the novel The Commissioner written by Richard Dougherty. It stars Richard Widmark, Henry Fonda, Inger Stevens, Susan Clark, Harry Guardino and James Whitmore. Music is scored by Don Costa and cinematography by Russell Metty.\n\nPlot finds Widmark as Detective Daniel Madigan, who along with his partner Rocco Bonaro (Guardino), loses a suspected murderer who also makes off with their guns. Causing embarrassment to Police Commissioner Anthony Russell (Fonda), who is hardly a fan of Madigan's methods, they are given 72 hours in which to locate the escapee and bring him in. But as the two men go in search of the crim, Commissioner Russell has various other problems to address, both at work and with matters of the heart. Last thing he needs is a volatile Madigan screwing things up...\n\nBased on a book called The Commissioner, a film originally titled the same, and the most interesting story thread in the picture is that of Henry Fonda's Commissioner! Then why is the film called Madigan, who is an interesting character that really is only second fiddle in this particular Don Siegel orchestra? It is one of the odd and frustrating things about the piece, the story is complex enough without being unsure who to focus on, a shame because Widmark, Clark, Fonda and Whitmore are doing sterling work for their under pressure director (Siegel was constantly fighting with producer Frank P. Rosenberg).\n\nThe themes at play are deliciously enticing, infidelity, police corruption, family strife, friendship, loneliness and identity etc etc, threads are dangled and given thoughtful dialogue passages. But hang on! Wasn't there a murderer on the loose at the beginning of the film? Half way through the piece I had forgotten about Steve Ihnat's crim that opened up proceedings, surely that can't be right? Film looks terrific at day time, though, where Metty's bold Technicolor photography really gives the New York locations a sense of 70s wonder (I know it's a 60s movie but it feels very 70s, and in a good way as well), though Costa's score is far too blunderbuss for narrative themes.\n\nIt's a mixed bag, a film you just know should be better considering the talent in front of and behind the cameras. Ideas at core are strong and worthy of filmic adaptation, while the last quarter is electrifying and crowned by a classic foray into film noir territory. But really this is recommended as just above average entertainment for the cop/crime movie fan. 6/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Universal Pictures",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3667329305",
        "name": "Madigan",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGVjMWY1MGEtY2FhMy00ZDIzLTkwZGUtYWRkMTYwMDNkNmY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGVjMWY1MGEtY2FhMy00ZDIzLTkwZGUtYWRkMTYwMDNkNmY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:07:45Z",
        "url": "https://www.imdb.com/video/vi3667329305/"
    },
    "url": "/title/tt0063256/"
}