{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sanae Kobayashi",
            "url": "/name/nm1058720/"
        },
        {
            "@type": "Person",
            "name": "Houko Kuwashima",
            "url": "/name/nm0476678/"
        },
        {
            "@type": "Person",
            "name": "Luci Christian",
            "url": "/name/nm0160049/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 337,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063458/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046382/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061915/"
        }
    ],
    "datePublished": "2004-04-05",
    "description": "A beautiful, female blonde assassin with supreme gun fighting skills, accepts contracts to kill villains, and fight against an oppressive army.",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmY0NDFjYWItNzg4Mi00M2FjLTg4YzYtYjNlMzFhMDM3MGJmXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
    "keywords": "orphan girl,falling from height,only child,codename,character name as series title",
    "name": "Madlax",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "general_kane_nash"
        },
        "dateCreated": "2005-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0465339/"
        },
        "name": "An excellent piece of Japanese animation",
        "reviewBody": "These last year Japan has been producing really few nice material, from 24 minutes propaganda of toys and cars to blackmail oriented themes (just for adults), it was nothing really good to see, even sagas like Gundam were suffering a \"pussification\" (come on guys, Kira, Athrun, Lacus. etc were freaking disappointing characters). Well, Madlax make us forgive the past, particularly in the design of the storyline and the graphics. I wont tell you the synopsis of the series, you can find it in the web, however, I want to remark the strong symbolism about this anime (just like Noir, another masterpiece of Bee Train), which bring us interesting messages about our world, our human nature , and about the eternal conflict between civilization and barbarism, at first time perhaps you couldn't see this but believe me, thinking a little about every part of the story will make as reflect about the universe and about us (just like all the good stories), of course Madlax isn't a moral tale, so don't worry, you will see urban fights, sniper missions, war battles, and freaking skirmishes. The characters are wonderful done, making excellent combinations of textures and colors without abuse of the computer generated image, it looks like Bee Train is definitely one of the best studios of Japan, in fact they have already created Noir, Hack Sign and Tsubasa Reservoir Chronicles (which unfortunately results in a Today's combo of the Clamp arsenal, of course I can't denied graphics were really nice). Another thing i want to recognize of this production is it's music, Yuki Kajiura, the composer behind the tracks of the blonde agent anime bring us a unique style of exotic and delightful sounds, I enjoy particularly the use of the violin in Nowhere (track commonly used in the action scenes), the opening and the ending are wonderful too, holding the high artistic and synchronized level. Finally I only have to say Madlax is an excellent choice to see something new in our clone based TV options even if you are not a anime fan the experience will be enjoyable."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from ADV Films",
        "duration": "PT1M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3717464345",
        "name": "Madlax: Complete Collection",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzg5ODYwNDYtNmU0ZS00NDhjLWE4ZTEtMGI1YTc2MmUzY2Q0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzg5ODYwNDYtNmU0ZS00NDhjLWE4ZTEtMGI1YTc2MmUzY2Q0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:55:54Z",
        "url": "https://www.imdb.com/video/vi3717464345/"
    },
    "url": "/title/tt0465339/"
}