{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yôsuke Akimoto",
            "url": "/name/nm0015342/"
        },
        {
            "@type": "Person",
            "name": "James Carter Cathcart",
            "url": "/name/nm0146097/"
        },
        {
            "@type": "Person",
            "name": "Atsuko Enomoto",
            "url": "/name/nm0257944/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 94,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019763/"
        },
        {
            "@type": "Person",
            "name": "Mugi Kamio",
            "url": "/name/nm0436761/"
        },
        {
            "@type": "Person",
            "name": "Leiji Matsumoto",
            "url": "/name/nm0559535/"
        }
    ],
    "description": "The artificial sun that lights the frozen planet La Metalle is dying, threatening to extinguish what little life is left there.",
    "director": [
        {
            "@type": "Person",
            "name": "Kazuyoshi Yokota",
            "url": "/name/nm0948400/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Animation",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkzMDE4NzA1M15BMl5BanBnXkFtZTcwNjk4MTUyMQ@@._V1_.jpg",
    "name": "Maetel Legend",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2002-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0277811/"
        },
        "name": "Alternative origins of anime heroines Maetel and Emeraldas",
        "reviewBody": "\"Maetel Legend\" (2000) is a two-part made-for-video anime production that retells the origin story of two of Japanese artist-animator Leiji Matsumoto's most memorable heroines, Maetel and Emeraldas. Maetel is known to anime fans as the traveling companion of young Tetsuro in the series, \"Galaxy Express 999\" and its two movie spin-offs (1979, 1981), while Emeraldas is known for her appearances in the \"Captain Harlock\" TV series and the movie spin-off, ARCADIA OF MY YOUTH (1982), as well as her own two-part Original Animated Video from 1998, \"Queen Emeraldas.\" The two heroines were also featured together in a GE999 TV special, \"Eternal Traveler Emeraldas\" (1980), also reviewed on this site, in which the two women fought a duel and we learned that Emeraldas was in love with Maetel.\n\n\"Maetel Legend\" reimagines the two women's relationship so that they become sisters on the planet La Metalle (which also figures in Matsumoto's \"Queen Millennia\" TV series, also reviewed on this site), a planet in the throes of \"mechanization,\" a process in which the human population is pressured by the nefarious Lord Hardgear to convert to machine bodies through the use of an implant which multiplies within the body until all organic parts are replaced by machine parts. The Queen gets the ball rolling by submitting herself to the process and then encouraging the rest of the population to do so. The Queen's daughters, Maetel and Emeraldas, refuse to submit and wind up turning against their mother and Lord Hardgear, setting the stage for a violent clash of humans against machines (a common theme of \"Galaxy Express 999\" and other Matsumoto works). The Queen eventually regrets her decision as she sees her once beautiful body dotted with mechanical lesions that look like disease spots. Without telling any more of the story, it should be pointed out that the Galaxy Express \"Three-nine\" makes an important cameo appearance. \n\nOne of the great qualities of previous Matsumoto anime adaptations was the stark, dramatic beauty and overwhelming emotional power of the hand-drawn artwork and painted backgrounds. Matsumoto's touch was evident in every shot, as if he himself had executed all the drawings. In the current age of 2-D digital animation, the process responsible for \"Maetel Legend\" and other recent Matsumoto adaptations such as \"Cosmo Warrior Zero\" (also reviewed on this site), the qualities of Matsumoto's artwork are diluted by the computer-created character designs and the computer coloring. The colors are lighter and flatter and the overall look much brighter than it should be. There's little of the atmospheric texture you get from paint-and-ink drawings. In \"Maetel Legend,\" the character design is too rounded and the faces of the two heroines suffer as a result. Their long, flowing hair doesn't move around the way it's supposed to. It just kind of sits there, not quite hanging right, not flapping in the breeze in that attractive way it always used to. \n\nStill, MAETEL LEGEND does offer an exciting story and an intriguing new take on the legends of both Maetel and Emeraldas, two of the most revered heroines in anime. Overall, despite the limitations of the digital process, the animation and design remain impressive, particularly to fans who may not have seen the original \"Galaxy Express\" and \"Captain Harlock\" series. Such settings as the frozen planet, the abandoned underground city, and the sprawling futuristic city are delineated in an especially vivid and detailed manner.\n\nHowever, I continue to urge fans to locate \"Eternal Traveler Emeraldas\" and other Matsumoto works of the 1970s-80s to see for themselves the change in artwork from the hand-drawn to digital eras. Hopefully, an anime distributor in the U.S. will acquire the essential, missing works in the Matsumoto filmography and make them available in bilingual DVD editions."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Central Park Media",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1405289241",
        "name": "Maetel Legend",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTNhNTI3MjktNjFjNi00NDE2LWE0MGItMzQ4NDMyZDNmMDI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTNhNTI3MjktNjFjNi00NDE2LWE0MGItMzQ4NDMyZDNmMDI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-01-14T06:55:56Z",
        "url": "https://www.imdb.com/video/vi1405289241/"
    },
    "url": "/title/tt0277811/"
}