{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Mona Marshall",
            "url": "/name/nm0551065/"
        },
        {
            "@type": "Person",
            "name": "Wendee Lee",
            "url": "/name/nm0283253/"
        },
        {
            "@type": "Person",
            "name": "Bridget Hoffman",
            "url": "/name/nm0033977/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 957,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064579/"
        }
    ],
    "datePublished": "1994-10-17",
    "description": "When the princess of a land ruled by the power of one's will is kidnapped by a traitorous priest, she summons three young girls from Japan to potentially fulfill the legends of the Magic Knights. Stranded upon this mysterious worl...",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDIwNDIxNWYtZGRhMC00ZTYxLWE0ZDAtOWMwMTM0NjYwMjZkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "water power,fire power,mage,fantasy world,blue haired girl",
    "name": "Magic Knight Rayearth",
    "original_info": {
        "id": "Magic Knight Rayearth_1994",
        "name": "Magic Knight Rayearth",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Wingzero4u"
        },
        "dateCreated": "2005-02-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112057/"
        },
        "name": "The best of the Best",
        "reviewBody": "Season 1: What I like about this series,it was created by Clamp,(the animators of Tokyo Babylon, Cardcaptors,Chobits, RG Veda,etc), the story is about three junior high school girls,Hikaru,Umi,and Fuu who were summoned by Princess Emeraude to become Magic Knights and save an alternate world called Cephiro. What I also think about the series, the opening and ending theme songs were pretty cool. (Note): Both theme songs were performed by Sandy Fox. Another thing about this series, it was also a video game. In the show there are 2 things that the girls had to do in order to become Magic Knights. First, acquire the legendary ore called Escudo.(Note): the only person who can use the Escudo to make the weapons is master smith Presea. I know it was really sad that she died because, she give her life to create the weapons. Second, the Magic Knights had to revive the legendary Rune Gods to battle Zagato. I also think that the swordsman Ferio has a crush on Fuu after he give Fuu the Magic Orb. Another thing I like about the show is that the minions who served High Priest Zagato became their allies.(Note): they are Caldina, the illusionist, Ascot, the summoner, and Lafarga, the Swordmaster. I can't believe that Ferio is the Brother of Princess Emeraude, Ferio's memories returned to him after the Magic Knights defeated Innouva. But the end was very sad,Princess Emeraude's last wish to be with Zagato and the Magic Knights killed her.\n\nSeason 2: What I think about this season, it picks up after the first. I know that the Maigc Knight went back to Cephiro by their own will and it was in darkness and Terror. I know that Cephiro has no pillar because Princess Emeraude died. I know it was very sad. But it got even worse. Other countries are planning to invade Cephiro. Autozam, Farhen, and Chizeta.And of course, there are new characters in this season. Lantis,the brother of High Priest Zagato and Primera, the fairy. The evil side Nova, who was created by Hikaru, and Debonair. When the Magic Knight were each captured by the invaders,the girls talk to them and ask them to call off their attack on Cephiro. But it even got more, even in the final battle for Cephiro, the invaders help the Magic Knights save Cephiro and Hikaru wished for Cephiro to be free of the Pillar.\n\nSo in closing to this 2 season series, add it to your collection, you will see what I mean."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Media Blasters",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3247898905",
        "name": "Magic Knights Rayearth: Season 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGUwODQ0ZjMtYzQxOC00NzIwLWI5MmUtNzY3NmVkOTJjNWNlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGUwODQ0ZjMtYzQxOC00NzIwLWI5MmUtNzY3NmVkOTJjNWNlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:08:09Z",
        "url": "https://www.imdb.com/video/vi3247898905/"
    },
    "url": "/title/tt0112057/"
}