{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sheila Chan",
            "url": "/name/nm0151092/"
        },
        {
            "@type": "Person",
            "name": "Sammi Cheng",
            "url": "/name/nm0155618/"
        },
        {
            "@type": "Person",
            "name": "Nicola Cheung",
            "url": "/name/nm0156534/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 540,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "alternateName": "Magic Kitchen",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038182/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0318881/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093755/"
        },
        {
            "@type": "Person",
            "name": "Chi-Ngai Lee",
            "url": "/name/nm0156871/"
        }
    ],
    "datePublished": "2004-01-15",
    "description": "Yau is on the lookout for love in modern day Hong Kong in spite of her family curse",
    "director": [
        {
            "@type": "Person",
            "name": "Chi-Ngai Lee",
            "url": "/name/nm0156871/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Romance",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc5NzE5MjA1Nl5BMl5BanBnXkFtZTcwMzcwNjYyMQ@@._V1_.jpg",
    "keywords": "family curse,love,cooking,dish,kitchen",
    "name": "Moh waan chue fong",
    "original_info": {
        "id": "Magic Kitchen_2004",
        "name": "Magic Kitchen",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "esteepswong"
        },
        "dateCreated": "2004-02-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0396735/"
        },
        "name": "Nothing magical at all",
        "reviewBody": "Moh waan chue fong or its English title Magical Kitchen is the latest Hong Kong movie in offering for the lunar new year. However, there is not a single mood or occasion of a Chinese new year movie in it. I should say this movie is much better for a Christmas fare or Valentine's date movie.\n\nYau (Sammi Cheng) is a successful chef and owner of a restaurant which is located in a flat called Magical Kitchen which is more like a home rather than like a restaurant. In a tale told by Yau's mother, that she would be haunted by a family curse overshadowing three generations, which destines her (Yau) to fail in every relationship. On a tour of the Iron Chef TV show in Japan, Yau is at the crossroads between her love life and career.\n\nTo spice up the this \"dish\" (movie), we have Yau's assistant chef, Ho played by the hunky Jerry Yan of the fame popular Taiwan teen-throb quartet, F4. Yan is secretly in love with Yau but doesn't have the guts to express to his 'boss'. Next comes in the picture is Yau's former boyfriend, Chun Yao (Andy Lau) who is a sports goods company operations manager and a bowling expert. Further throw in two girlfriends of Yau, played by Maggie Q and Nicola Cheung, and you have a relationship roller-coaster ride.\n\nSammi plays her usual unpredictable self similar to her previous movies such as Love on a Diet, Good times Bed times and Needing You. Still she's a delight to watch. The same, however cannot be said about Jerry, who is extremely wooden here, and shares little or no chemistry with Sammi. Perhaps we got to blame the casting here as with one look at it we will feel it's a mismatched couples in all the roles.\n\nIf the name Magic Kitchen would have made you thought of some sort of a similar cooking stunts like Stephen Chow's The God of Cookery then you would be truly disappointed. Nothing unusual or special dish were being cooked up. At best, Magic Kitchen is good for a few laughs and the chance to see so many good looking actors (as well as other famous actors in cameos) on the big screen. But story-wise, it's wasted.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0396735/"
}