{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Antara Mali",
            "url": "/name/nm0539507/"
        },
        {
            "@type": "Person",
            "name": "Rajpal Naurang Yadav",
            "url": "/name/nm1056425/"
        },
        {
            "@type": "Person",
            "name": "Asif Basra",
            "url": "/name/nm1794460/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 535,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0128785/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018751/"
        },
        {
            "@type": "Person",
            "name": "Rahul Awate",
            "url": "/name/nm5485355/"
        },
        {
            "@type": "Person",
            "name": "Makrand Deshpande",
            "url": "/name/nm0221218/"
        }
    ],
    "datePublished": "2003-10-07",
    "description": "Chutki (Antara Mali) lives in a small village community in Central India, and has developed a talent of mimicing bollywood actress Madhuri Dixit in every aspect. Her friend, Raja alias Rajeshwar Singh (Rajpal Yadav) is always ther...",
    "director": [
        {
            "@type": "Person",
            "name": "Chandan Arora",
            "url": "/name/nm1154600/"
        }
    ],
    "genre": [
        "Drama",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDY5YzE5YTMtMDk1NS00ZWM4LWIxZDUtNjcwNzY3ZWFkZTg5XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "name": "Main Madhuri Dixit Banna Chahti Hoon!",
    "original_info": {
        "id": "Main Madhuri Dixit Banna Chahti Hoon_2003",
        "name": "Main Madhuri Dixit Banna Chahti Hoon",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "HeadleyLamarr"
        },
        "dateCreated": "2007-07-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0374848/"
        },
        "name": "Comic, poignant, touching - love this film",
        "reviewBody": "The movie is about Chutki (Antara Mali), a small town village girl who sees herself as the iconic Madguri Dixit. She dances and sings her way around the village and all adore her but none more than Raja (Rajpal Yadav) a childhood playmate who believes in her potential. Chutki ends up marrying Raja so they can go off to Bombay and Chutki can realize her dreams.\n\nBut her copying Madhuri ends up getting her jobs as part of the dance troupe, as an item girl. She wants to be a leading lady but she is like a babe in the woods - the vulnerable outsider - both Bombay and the biz are completely unknown to her and her husband. In fact one is expecting dire things to happen at any moment - the slightly shady looking neighbor, who turns out to be pretty benign, the hoodlum who turns out to be a cowardly fellow, the cabbie who merely price gouges, the agent who seems so ominously shady yet turns out to be a real agent and helpful at that.. These personalities in the world around her underline the fact that nothing should be taken at face value.\n\nThe movie also had some very funny moments - Choli ke peeche kya hai wil never seem the same to me! And the part where Rajpal Yadav goes to plead on her behalf and ends up being offered the acting role instead, ironic yet funny.\n\nI liked Antara's looks - she was a strange blend of attractive and ordinary and she acted very well as the village belle who was so self assured in her village environment and so vulnerable and unsure in the big city. Rajpal Yadav was very good as the self effacing husband. I particularly liked the fact that the \"Madhuri\" moments were brief and Antara managed to make them her own. Music was unobtrusive and worked well in the film. I also liked the fact that not much was made of the Chutki Raja romance and the fact that the marriage was in name only!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0374848/"
}