{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hrithik Roshan",
            "url": "/name/nm0004335/"
        },
        {
            "@type": "Person",
            "name": "Kareena Kapoor",
            "url": "/name/nm0004626/"
        },
        {
            "@type": "Person",
            "name": "Abhishek Bachchan",
            "url": "/name/nm0045393/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4867,
        "ratingValue": 3.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Sooraj R. Barjatya",
            "url": "/name/nm0054744/"
        }
    ],
    "datePublished": "2003-06-27",
    "description": "This is the story of Sanjana, a girl of today's generation full of life and vibrant ecstasy. She lives life on her own terms and gets very upset when her mother Susheela, arranges for her to see a boy leading to a marriage prospect.",
    "director": [
        {
            "@type": "Person",
            "name": "Sooraj R. Barjatya",
            "url": "/name/nm0054744/"
        }
    ],
    "duration": "PT3H17M",
    "genre": [
        "Comedy",
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5OTk5MDI3OV5BMl5BanBnXkFtZTcwNjE3NTAxMw@@._V1_.jpg",
    "keywords": "horse,footsie under the table,valentine's day,treadmill,tattoo",
    "name": "Main Prem Ki Diwani Hoon",
    "original_info": {
        "id": "Main Prem Ki Diwani Hoon_2003",
        "name": "Main Prem Ki Diwani Hoon",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Manuja"
        },
        "dateCreated": "2006-06-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0265148/"
        },
        "name": "This movie was shot in New Zealand!But it's still bad!",
        "reviewBody": "I just wanted to set the record straight once and for all!This movie was shot almost entirely on location in the South Island of New Zealand.I saw someone commenting on this page that \"Sundarnagar\" (which is where this film is supposedly based)looked a lot like Switzerland! Plus many people have wondered aloud about the \"coordinates\" of \"Sundernagar? Well it's actually New Zealand! :)\n\nThe bulk of the movie was shot in Christchurch.(I know this because a few of my friends who were living there at the time, saw some of it being shot).Even if they had not seen it, one look at it, and anyone from this part of the world would recognize it as Christchurch.\n\nFrom the scenery I know that most of the \"action adventure\" stuff,which was \"jet-boating, bungee jumping, sky diving, and white water rafting\", where ALL shot in Queenstown, which is considered the \"Adventure Capital\" of the Southern Hemisphere.(I have actually been on \"Shotover Jets\" which were the jet-boats that they hired for this film.)\n\nThat's some \"Location\" trivia for anyone who cares to know!\n\nMoving on to the film, the most disappointing performance from Hrithik Roshan to date. I don't think he has done anything this bad before or since. WHAT was he ON when he did this film? The overacting is taken to such absurd lengths. Kareena as Sanjaana is over-acting as well.The role was played rather \"one dimensionally\". But she is not entirely bad. The best acting in this movie is by Abhishek Bachchan who plays the \"introvereted Prem\" to Hrithik's \"Extrovert\".The supporting cast was adequate, but nothing too special. I liked Pankaj Kapur's rendition of the \"long suffering Dad\".\n\nThe music was actually quite good. Few songs too many. Many of the video's have Hrithik Roshan SANS shirt, prancing around,(I swear sometime he just looked plain \"Gay\")! and Kareena Kapoor wearing her signature \"strappy top and tight pants\"!The best song was \"Bani Bani\" accompanied by a nice dance from Kareena.I also liked the songs \"Aur Mohabat Hain\", and \"Kasam Ki Kasam\".\n\nFrom a director like Suraj Barjatiya, this is a HUGE disappointment. The story could have worked with a better script, and a more tight reign on the performances. But that didn't happen! Too bad!\n\nThe best thing about this movie was the \"scenery\", but then I would say that. After all, I AM a New-Zealander! :)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3662198809",
        "name": "Main Prem Ki Diwani Hoon (2003) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGIwMjg5MDctNDhhZS00OWFiLWE1YWMtZmFmMTIxMmUzNTE4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGIwMjg5MDctNDhhZS00OWFiLWE1YWMtZmFmMTIxMmUzNTE4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-05-07T09:45:40Z",
        "url": "https://www.imdb.com/video/vi3662198809/"
    },
    "url": "/title/tt0265148/"
}