{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wesley Fricks",
            "url": "/name/nm5081651/"
        },
        {
            "@type": "Person",
            "name": "Bob Costas",
            "url": "/name/nm0182471/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 91,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "description": "One hundred years in the making, the 'Major League Baseball All-Century Team' was an all-time roster chosen from the more than 15,000 men who played Major League Baseball in the 20th Century.",
    "duration": "PT1H10M",
    "genre": [
        "Documentary",
        "History",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDcyOTIxMTcyM15BMl5BanBnXkFtZTcwNDI5MjMyMQ@@._V1_.jpg",
    "keywords": "baseball",
    "name": "Major League Baseball: All Century Team",
    "original_info": {
        "id": "Major League Baseball: All Century Team_2000",
        "name": "Major League Baseball: All Century Team",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zkonedog"
        },
        "dateCreated": "2017-03-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0266740/"
        },
        "name": "A Great Tribute To Baseball History (With A Few Moments That Will Stick In Your Craw)",
        "reviewBody": "As journalist Bruce Catton once said: \"Say this much for big league baseball - it is beyond question the greatest conversation piece ever invented\". A truer phrase was never spoken, as there is nothing like the sport of baseball to spark arguments and create comparisons day after day. Due to the long history of major league baseball, dating back (in its current form) to the earliest years of the 20th century, fans have always compared the stars of the past to the stars of today.\n\nThis DVD continues to fuel that fire of comparison by putting together a \"Blue Ribbon Panel\" to decide on the greatest baseball players of the 20th century. Though the choices are relatively straightforward and won't give hard-core baseball fans any new information, it is the debate the list sparks that will have fans discussing it long after you hit the \"Eject\" button. Maybe Nap Lajoie should have started at second...or Ivan \"Pudge\" Rodriguez behind the plate...and how can Mordecai \"Three Finger\" Brown and Greg Maddux not be on the starting staff? Those are just a sampling of the questions that this program could possibly produce, and that is the beauty of it...each baseball fan has there own opinion!\n\nThe only downside of this tribute to baseball history is the continued reminder (with the including of Mark McGwire and Roger Clemens on the starting roster) of the Steroid Era sweeping baseball at the turn of the century. Could we really have been that short-sighted (with the answer, sadly, being a definitive \"yes\") to bestow honor upon honor on men whose feats seemed (and turned out to be exactly that) too good to be true? It is actually fitting that players like McGwire and Clemens were featured, however, as a century-long reminder to baseball about the dangers of ignoring a problem before it explodes in your face down the road.\n\nFinally, a special feature (the pre-game festivities of the 1999 All-Star Game) on the disc may eclipse the entire rest of the content, as baseball \"lifers\" will have trouble holding back the tears seeing all the legends of the game (with Ted Williams front and center) gathered on the hallowed ground of Fenway Park.\n\nThus, I recommend this DVD to any fan of baseball, young or old, as it will serve to re-kindle the old arguments and keep interest in the game once revered as the \"National Pastime\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from USA Films",
        "duration": "PT4M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi77005081",
        "name": "Major League Baseball: All Century Team",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjhhYjk5OWQtZmVhZC00NzBlLTlhMjgtYTAwY2I0MzY1OTcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjhhYjk5OWQtZmVhZC00NzBlLTlhMjgtYTAwY2I0MzY1OTcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:04:32Z",
        "url": "https://www.imdb.com/video/vi77005081/"
    },
    "url": "/title/tt0266740/"
}