{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Eli Wallach",
            "url": "/name/nm0908919/"
        },
        {
            "@type": "Person",
            "name": "Arthur Miller",
            "url": "/name/nm0007186/"
        },
        {
            "@type": "Person",
            "name": "Marilyn Monroe",
            "url": "/name/nm0000054/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 50,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088349/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052417/"
        }
    ],
    "datePublished": "2002-10-02",
    "description": "A behind the scenes and in-depth look at the making of John Huston's the Misfits",
    "director": [
        {
            "@type": "Person",
            "name": "Gail Levin",
            "url": "/name/nm1269198/"
        }
    ],
    "duration": "PT54M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWJhYmY2MjItNDE0MC00MmVjLWJkM2MtODRlMjMxZTc5ODI2XkEyXkFqcGdeQXVyMTY1MTcxMzc@._V1_.jpg",
    "keywords": "making of,behind the scenes",
    "name": "Making 'The Misfits'",
    "original_info": {
        "id": "Making the Misfits_2001",
        "name": "Making the Misfits",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2011-05-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338222/"
        },
        "name": "Nice Look at The Misfits",
        "reviewBody": "Great Performances: Making The Misfits (2002) \n\n*** (out of 4)\n\nFilm buffs will always remember John Huston's THE MISFITS as a disappointment that would turn out to be the final picture for both Clark Gable and Marilyn Monroe. This documentary gathers up some of the people who worked on the film as they try to go over the troubled production as well as the end result, which didn't seem to make anyone happy. Writer Arthur Miller, actors Eli Wallach and Kevin McCarthy as well as other members of the production team are interviewed about the making of the film. Miller, who was with Monroe at the time, has a rather interesting story to tell on how he got the movie made and why he wanted Huston to do the picture. There's also talk about various issues with the production including the hot temperatures, Monroe never showing up on time and of course the stories of Huston spending all night in the casinos. One of the most interesting stories comes from McCarthy who talks about the filming of his quick scene on the steps and how Monroe kept messing up each take because she couldn't remember her lines. McCarthy jokes about how he had to lose his performance because he and the director were trying to get Monroe to do the scene correctly. Wallace tells another nice story about meeting Gable and what he thought about when he heard the actor suffered a heart attack. If you're a fan of the movie then this is a pretty good look at the making of the movie but at the same time it seems like some of the stories have been watered down. Miller never really goes into any real detail about the various problems Monroe was going through at the time but I guess this is understandable if he's simply not willing to talk about it. Monroe's troubles on the production were apparently quite high but most of this isn't gone into detail about, although some of the production members say that no one ever called her on her lateness."
    },
    "timeRequired": "PT54M",
    "url": "/title/tt0338222/"
}