{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Thomas Meighan",
            "url": "/name/nm0576762/"
        },
        {
            "@type": "Person",
            "name": "Theodore Roberts",
            "url": "/name/nm0731623/"
        },
        {
            "@type": "Person",
            "name": "Raymond Hatton",
            "url": "/name/nm0369058/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1910,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Jeanie Macpherson",
            "url": "/name/nm0534221/"
        },
        {
            "@type": "Person",
            "name": "J.M. Barrie",
            "url": "/name/nm0057381/"
        }
    ],
    "datePublished": "1919-11-23",
    "description": "Lady Mary Lasenby is a spoiled maiden who always gets her way until shipwrecked with her butler, then learns which qualities are really admirable in a person.",
    "director": [
        {
            "@type": "Person",
            "name": "Cecil B. DeMille",
            "url": "/name/nm0001124/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODE2ZTlmNjUtZDU2Yi00ZjViLTllYTEtMDNmNDFmNjZlNDkwXkEyXkFqcGdeQXVyMjcxNjI4NTk@._V1_.jpg",
    "keywords": "butler,yacht,maid,class distinction,castaway",
    "name": "Male and Female",
    "original_info": {
        "id": "Male and Female_1919",
        "name": "Male and Female",
        "year": "1919"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wmorrow59"
        },
        "dateCreated": "2007-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0010418/"
        },
        "name": "Just sit right back and you'll hear a tale, a tale of a fateful trip",
        "reviewBody": "In 1952 humorist S. J. Perelman contributed a piece to The New Yorker magazine devoted to Cecil B. DeMille's silent drama Male and Female. He was a teenager when the movie was first released in 1919, and found it so enthralling he sat through it twice. More than thirty years later Perelman, by then a middle-aged playwright and essayist, saw the film again at the Museum of Modern Art and recorded his impressions. It goes without saying for anyone familiar with the man's work that his piece is hilarious, but what's surprising is how little he exaggerated. I read his essay long before I saw the movie itself, and assumed that when he quoted title cards or described the action he was employing artistic license to get laughs, but no; he described the film with journalistic accuracy and yet his article is laugh-out-loud funny. Time has not been kind to Male and Female, that is, if DeMille honestly intended to say something profound about class and gender relations, but viewed in the proper spirit the movie is still quite entertaining. Certainly it offers sumptuous production values and top-notch cinematography (and happily, survives in beautiful condition), while most of the performances are surprisingly nuanced. It's the storytelling technique that lacks subtlety, for DeMille was a moralist who could never make his points delicately when there was a sledgehammer handy.\n\nThe story is based on J. M. Barrie's 1902 stage play \"The Admirable Crichton,\" a satire on the English class system that has been staged repeatedly and adapted into all sorts of movies over the years, and no wonder: it presents a deeply satisfying fantasy of virtue recognized and bogus class distinctions overturned-temporarily, anyway. Crichton, dignified butler in a household full of pampered, lazy snobs, proves to be the most useful person present when the whole gang is shipwrecked on a remote island in the South Seas. In the version made in the '30s, We're Not Dressing with Bing Crosby and Carole Lombard, this premise was turned into a musical comedy, while a 1957 English adaptation followed the satirical elements of the play more closely, but DeMille had his own distinctive approach to the material. As the title suggests, Male and Female plays up the romantic/erotic aspects of the role reversal, giving audiences of 1919 some of the steamiest situations then permissible.\n\nThe naughty tone is set early on, when an impish serving boy who works in the stately household of Lord Loam peeks through bedroom keyholes, giving us our first look at each major character via \"keyhole shot.\" The most dramatic intro is reserved for the beautiful, haughty Lady Mary (Gloria Swanson), who rises from her luxurious bed and is promptly accompanied by serving girls into her marbled bathroom for a descent into a sunken tub-and celluloid immortality! This bathing sequence was an instant sensation, and lives on in the textbooks as the most famous such scene in silent cinema. Today it's a little difficult to imagine what all the fuss was about, but I'll bet your eyes won't wander from the screen. Miss Swanson was at the peak of her youthful beauty at this time, with a special charisma all her own.\n\nOnce the plot gets under way the opening sequences set up the thesis question: can lovers who cross class boundaries find happiness, or is \"kind-to-kind\" the only formula that works? The question is put to the test on a South Sea voyage when the Loam family's rented yacht hits the rocks, splinters apart, and strands them on an uncharted island, along with loyal Crichton and scullery maid Tweeny (the adorable Lila Lee), who is slavishly devoted to him, but well aware of the charged relationship between he and Lady Mary. Crichton soon establishes himself as the only person present who knows how to live on an island: he can build a fire, hunt, and cook a good meal, so his authority is grudgingly recognized. Two years pass, and here's where the inescapably silly elements of the story kick in. Crichton is now the unquestioned but benevolent ruler of an idyllic jungle paradise. Like the Swiss Family Robinson -or Gilligan and his friends- our castaways live in elaborate \"primitive\" huts that look like rustic vacation cabins where everyone wears designer pelts. Clothes horse Gloria even has a Peter Pan-style hat with a feather! We note the altered relationship between the one-time butler and his former employers: Lady Mary, who commanded Crichton with such hauteur in the opening scenes, now literally fights with Tweeny over the privilege of serving him his dinner. And it's finally explained why Mary and Crichton repeatedly yet unwittingly quote a passage of Victorian poetry concerning antiquity. It seems that, in a past life, Crichton was a Babylonian King and Lady Mary was a Christian slave, a defiant captive the King was unable to subdue, thus compelling him to feed her to \"the sacred lions of Ishtar.\" (This is all enacted in a jaw-dropping flashback played absolutely straight.) The slave's dying curse is that the King will suffer for his deed throughout the ages, and so now, naturally, she is his superior and he waits on her-although on the island, of course, their roles have reverted to what they once were, back in ancient Babylon.\n\nAfter that bizarre episode there is little left to do but arrange for the timely rescue of the castaways and then conclude with Barrie's ironic finale, in which the class system reasserts itself and all our characters revert to type. Crichton earns himself a happy ending, however, and so does the long-suffering Tweeny. This movie was a smash hit in its day, and it remains a kitschy treat for silent film buffs who enjoy exquisitely produced hokum. If you can find a copy of Perelman's essay it may help to have it handy as a sort of Viewer's Guide while you watch Male and Female: he captures its grandeur as well as its absurdity with admirable precision.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0010418/"
}