{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alec Baldwin",
            "url": "/name/nm0000285/"
        },
        {
            "@type": "Person",
            "name": "Nicole Kidman",
            "url": "/name/nm0000173/"
        },
        {
            "@type": "Person",
            "name": "Bill Pullman",
            "url": "/name/nm0000597/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26084,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040620/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015560/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Person",
            "name": "Aaron Sorkin",
            "url": "/name/nm0815070/"
        },
        {
            "@type": "Person",
            "name": "Jonas McCord",
            "url": "/name/nm0566380/"
        },
        {
            "@type": "Person",
            "name": "Scott Frank",
            "url": "/name/nm0291082/"
        }
    ],
    "datePublished": "1993-10-01",
    "description": "A tale about a happily married couple who would like to have children. Tracy teaches art, Andy's a college dean. Things are never the same after she is taken to hospital and operated upon by Jed, a \"know all\" doctor.",
    "director": [
        {
            "@type": "Person",
            "name": "Harold Becker",
            "url": "/name/nm0000887/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Crime",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTA4NWFkOGItN2Q2NS00MDdlLTliMDYtZWEwNmU1MmVkMzQ4XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "surgeon,neo noir,femme fatale,serial killer,woman on top",
    "name": "Malice",
    "original_info": {
        "id": "Malice_1993",
        "name": "Malice",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Scarlet-22"
        },
        "dateCreated": "1999-10-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107497/"
        },
        "name": "See it once for the suspense, and again for the acting.",
        "reviewBody": "MALICE is one of those movies that you simply MUST see more than once to believe. The first time through, MALICE is a great psychological thriller, with twists and turns through a plot that contains rape, murder, life-and-death trauma, and a fight to the death...all within the first 45 minutes. The second time through, though, provides a look at all the things you might have missed the first time around...and a chance to savor an outstanding performance from perhaps the most underrated actor in Hollywood, Alec Baldwin.\n\nBill Pullman plays Andy Safien, an associate dean at a small New England college outside of Boston that's currently under siege by a serial rapist who claims his latest victim as the film opens. Nicole Kidman plays his wife Tracy, a volunteer in the pediatrics ward of St. Agnes Hospital. They're renovating a Victorian house and need $14,000 for the plumbing. Enter Alec Baldwin as Dr. Jed Hill, a former high school classmate of Andy's, who's brand new in town and needs a place to stay. Andy needs the money, Jed needs a room, so the two hook up and soon Jed is sleeping upstairs in the Safiens' home...usually not alone, and his sexual escapades are grating on Tracy's nerves. The rapes continue, Andy is fingered as a suspect, and in the midst of it all, Tracy collapses with a ruptured ovarian cyst. Jed operates to save her life (after a night of drinking and wild partying), but renders her unable to bear children...leading to a malpractice suit from Tracy and an incredible soliloquy on surgeons with a God complex from Jed during the deposition.\n\nBut once the first half of the film is over, things really start to roll. Without revealing the rest of the plot, suffice it to say that as Andy, Tracy, and Jed all try to start their lives over again, their fates become inextricably entangled.\n\nThe movie is worth seeing once as a thriller. But the second time around, Baldwin's mesmerizing performance is what stands out. Jed is charismatic, seductive, and as charming as a cobra as he weaves his spell over the Safiens. Baldwin's ability to jump from utterly charming to incredibly chilling in the blink of an eye is on full display here; it is truly the performance of a lifetime.\n\nSee it once for the suspense, and again for the acting.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3920298265",
        "name": "Malice",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDI3NzI0MWItMDAwOC00ZjdiLWEwNzAtY2UxOGQ2MWRkZmQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDI3NzI0MWItMDAwOC00ZjdiLWEwNzAtY2UxOGQ2MWRkZmQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:22:20Z",
        "url": "https://www.imdb.com/video/vi3920298265/"
    },
    "url": "/title/tt0107497/"
}