{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ronnie Masterson",
            "url": "/name/nm0557756/"
        },
        {
            "@type": "Person",
            "name": "Phyllis Ryan",
            "url": "/name/nm0752794/"
        },
        {
            "@type": "Person",
            "name": "Fiona O'Shaughnessy",
            "url": "/name/nm0642605/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 242,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103289/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031191/"
        },
        {
            "@type": "Person",
            "name": "Anthony Berkeley",
            "url": "/name/nm0075324/"
        },
        {
            "@type": "Person",
            "name": "Andrew Payne",
            "url": "/name/nm0668252/"
        }
    ],
    "datePublished": "2005-04-03",
    "description": "Dr. Edmund Bickleigh is married to a particularly overbearing woman who reminds him at every turn that he is living in her house. But the good doctor has outside interests to help him cope: many of the town's female population see...",
    "director": [
        {
            "@type": "Person",
            "name": "David Blair",
            "url": "/name/nm0004541/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Mystery",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTAwNTIzOTIyOTVeQTJeQWpwZ15BbWU3MDA2MDQ4MjE@._V1_.jpg",
    "keywords": "doctor,extramarital affair,buxom,rich wife,female topless nudity",
    "name": "Malice Aforethought",
    "original_info": {
        "id": "Malice Aforethought_2005",
        "name": "Malice Aforethought",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2013-03-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0433411/"
        },
        "name": "a murderous doctor in a small English village",
        "reviewBody": "From 2005, \"Malice Aforethought\" is another adaptation of the 1931 book by Anthony Berkeley, this one starring Ben Miller, Barbara Flynn, Lucy Brown, and Megan Dodds.\n\nThe story takes place in an English village between the wars and concerns one Dr. Edmund Bickleigh, married to an older woman, Julia (Barbara Flynn), who is an upper class, domineering snob. Edmund busies himself with doctoring, his art work, and an affair with Ivy (Lucy Brown), which the whole town seems to know about. When the flashy Madeleine (Megan Dobbs) moves into town, he becomes very interested in her. Anxious to marry her, he kills Julia over time by giving her a drug withdrawn from the market because it causes severe headaches, and helping the headaches with larger and larger amounts of morphine. When she dies, it's assumed from the injection sites that she was a morphine addict.\n\nThings don't work out for dear Edmund as he planned, however. Madeleine, it turns out, despite the fancy house, is broke and needs to marry someone with money, which she does. Ivy marries William Chatford (Richard Armitage) and confesses her affair with Edmund to him. He therefore hates Edmund and has an axe to grind against him. Before long, suspicion has fallen on Edmund, and he is forced to take desperate measures.\n\nExcellent story, and though I haven't read the book or seen the 1979 version, I liked it. I loved the production values, and Ben Miller made an attractive Edmund who tries to keep his cool in the face of some difficult questions.\n\nHywel Bennett played the role in 1979 and he has been described as \"darker\" - I'm sure his portrayal worked beautifully in that production. Here, I liked the fact that Miller didn't seem particularly menacing. Often narcissists or people out for themselves take the need to murder as a matter of course and feel it's a necessity, and that's how Miller played the role.\n\nThe rest of the cast was very good, and the ironic ending will be a cause for discussion if you're not aware of what happens.\n\nI get the feeling this version was given a lighter touch than previously. Because the story is so good, I think it works fine. Supposedly it differs from the book in some key spots, including the doctor's relationship with his wife. Enjoy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0433411/"
}