{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chevy Chase",
            "url": "/name/nm0000331/"
        },
        {
            "@type": "Person",
            "name": "Farrah Fawcett",
            "url": "/name/nm0000396/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Taylor Thomas",
            "url": "/name/nm0001795/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9966,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023403/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066682/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042119/"
        },
        {
            "@type": "Person",
            "name": "David E. Peckinpah",
            "url": "/name/nm0669757/"
        },
        {
            "@type": "Person",
            "name": "Richard Jefferies",
            "url": "/name/nm0420135/"
        },
        {
            "@type": "Person",
            "name": "James Orr",
            "url": "/name/nm0650561/"
        }
    ],
    "datePublished": "1995-03-03",
    "description": "A young boy refuses to accept his mother's new boyfriend, a lawyer, despite the man's attempts to win his respect. Meanwhile, disgruntled relative of a criminal he prosecuted seek revenge.",
    "director": [
        {
            "@type": "Person",
            "name": "James Orr",
            "url": "/name/nm0650561/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGE3MDZhMWYtYmZiMC00N2QwLWI1YTAtNjkwN2MxODU0NGFlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "gangster,threat,divorcee,single mother,district attorney",
    "name": "Man of the House",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2003-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113755/"
        },
        "name": "A Politically-Correct, Unfunny Comic Vehicle for Stars Chevy Chase and Jonathan Taylor Thomas...",
        "reviewBody": "There used to be a time when Chevy Chase was regarded to as a funny man. He used to be on an intelligent and extremely hilarious skit show started in 1975 called \"Saturday Night Live,\" but soon left to chase after a film career.\n\nWell, it's about twenty years later, and where is Chevy? Well, after a few hilarious \"National Lampoon's Vacation\" films, he's basically nowhere. He was funny in the seemingly endless line of movies (in general) for a while, but soon people tired of his smart-@$$ attitude that made him so famous, and they, his humble audience, turned on him, beginning to despise the poor fellow. Well, I can't really find it hard to feel sorry for him, because he probably still has more money than you or I will ever make in our lifetime.\n\nThe plot of \"Man of the House\" is less than a simple and contrived one. It is about 12-year-old Ben Archer (Jonathan Taylor Thomas) and his efforts to rid his house of the man who wants to marry his mom and become his stepfather. The man? Jack Sturgess (Chevy Chase). The mom? Sandra (Farah Fawcett--whose leakier than a faucet here). Jack is a tie-wearing, U.S. Justice Department lawyer who's got one angry Mafia boss on his tail because of a racketeering case he prosecuted. As the film turns out (big gasp), Ben and Jack work together at the end to save the day, and Ben thinks of Jack as a cool nerd. But what about the in-between process, you ask?\n\nBen makes an assortment of traps to try and get Jack to leave. He rigs the blender. He makes fun of him. He verbally insults him and makes digs at him. I ask myself what Disney is trying to prove here: That kids are smarter than stupid adults, or that kids have wittier one-liners than adults?\n\n But Jack stays around (much to the disappointment of Ben), who keeps on working at Jack to make him leave. He eventually makes Jack sign into a boy-scout-type program, where he nicknames Jack \"Squatting Dog.\" This is the best laugh in the movie. If you don't find that funny, like me, then you had better run from this movie, because that is one of many unfunny gags that try to be funny and end up in the gutter.\n\nThe film is anchored in every way towards children, but I ask myself if children really should be seeing a film like this. In \"The Parent Trap,\" two twins formed together to bring their parents back together. In \"Man of the House,\" a twelve-year-old single-handedly tries to rid a man from his and his mother's life. Choose your pick on which film is morally-harmless and which is morally-harmful. Times are changing, and that means films that were once provocative are not anymore. Divorce in films--especially children's films--used to be a big topic. But nowadays it seems because of the countless divorces out there, kids are immune to such things. But Disney is making it worse. They rub it in and open children's minds to things they need not worry about. If you take your child to see this, the next time you argue with your wife or husband your child could misinterpret this as divorce, because through films like these divorce is shown as arguing between parents who then break up. \"Man of the House\" isn't about divorce per se, but it is about something worse: The times proceeding a divorce. About parents dating again. Sorry, but I don't find this kind of thing suitable for innocent children. Kids don't need to be thinking about their parents dating people, but yet films manage to squeeze such material into countless films, whether they are funny (\"Sleepless in Seattle\") or not (\"Man of the House\"). I don't have a problem with \"Sleepless...\" because it isn't really a children's film, but when you take a children's film and center it ENTIRELY on split couples dating again, children start to think about things they need not worry about. Six-year-olds shouldn't be thinking about dating yet, much less their parents dating.\n\nThe laughs, if you can count them as such, come mostly from George Wendt (``Cheers' '' beloved Norm) and former Cirque du Soleil clown David Shiner.\n\n Wendt as an Indian Guides chief is the comic treat of the film -- he's a real live wire who packs a lot of heart into a surprisingly agile comic style. If you have read this far and STILL believe this film is for you, then George Wendt's performance can be added to your \"why-to-see-the-film\" list, because he is, truthfully, the only compelling reason to see this film.\n\nIn the end, \"Man of the House\" is a politically-correct comic vehicle that forgot about the script and the laughs. To Disney, kids during times like these should be thinking of parents' divorces and parents' dating, because it's happening around the world as we speak, and children need films such as \"Man of the House\" so that they realize this is normal (for parents to divorce and date again).\n\nTo me, films like \"Man of the House\" are reasons that divorce and single parents dating is becoming more normal and unshameful in today's culture. It's a paradox, really. Films like these are made because of times like these, when, in fact, times like these are here in the first place because of the films and media that are made to suit to the times we live in.\n\n1/5 stars -\n\nJohn Ulmer"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1853145369",
        "name": "Trailer [EN]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDNlNDZmOGUtZWU5NS00MmMyLWE2OWQtNjY4YTIzNGM0ZTEyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDNlNDZmOGUtZWU5NS00MmMyLWE2OWQtNjY4YTIzNGM0ZTEyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-01-14T20:15:15.640Z",
        "url": "https://www.imdb.com/video/vi1853145369/"
    },
    "url": "/title/tt0113755/"
}