{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Benoît Poelvoorde",
            "url": "/name/nm0688143/"
        },
        {
            "@type": "Person",
            "name": "Jacqueline Poelvoorde-Pappaert",
            "url": "/name/nm0688145/"
        },
        {
            "@type": "Person",
            "name": "Nelly Pappaert",
            "url": "/name/nm0660561/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 42110,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Man Bites Dog",
    "contentRating": "NC-17",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058482/"
        },
        {
            "@type": "Person",
            "name": "Rémy Belvaux",
            "url": "/name/nm0069715/"
        },
        {
            "@type": "Person",
            "name": "André Bonzel",
            "url": "/name/nm0095298/"
        },
        {
            "@type": "Person",
            "name": "Benoît Poelvoorde",
            "url": "/name/nm0688143/"
        }
    ],
    "datePublished": "1993-01-15",
    "description": "A film crew follows a ruthless thief and heartless killer as he goes about his daily routine. But complications set in when the film crew lose their objectivity and begin lending a hand.",
    "director": [
        {
            "@type": "Person",
            "name": "Rémy Belvaux",
            "url": "/name/nm0069715/"
        },
        {
            "@type": "Person",
            "name": "André Bonzel",
            "url": "/name/nm0095298/"
        },
        {
            "@type": "Person",
            "name": "Benoît Poelvoorde",
            "url": "/name/nm0688143/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDM3N2Q5MDktNTIyYi00ZTYxLWE4NWQtYjAyYzYxYmNlZTFmXkEyXkFqcGdeQXVyMTEyODk3NTgz._V1_.jpg",
    "keywords": "dark comedy,mockumentary,black comedy,satire,nudity",
    "name": "C'est arrivé près de chez vous",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "marcoklaue"
        },
        "dateCreated": "2013-04-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0103905/"
        },
        "name": "my viewing experience was a little different than I heard it would be.",
        "reviewBody": "I consider it a brilliant film, but also very very disturbing. I'd sooner warn people about it than recommend it, even though it's an amazing achievement. So, for what it's worth, here's my viewing experience: \n\nI heard about this film and was immediately hooked on the absurd idea of a serial killer, on the loose, as a willing documentary subject. I also heard that it was pitch-black comedy, and a commentary on violence, society, media, etc. -- blurring the lines between observing and becoming an accomplice and whatnot.\n\nWell, in the first two acts it certainly delivers on the absurdity and the black comedy. Both Ben and the filmmakers are as matter-of-fact about his prolific killing as if it were a documentary about urban architecture, and even in the middle of his murderous acts he remains an engaging conversationalist with all sorts of attributes our culture values: extroversion, confidence, charm, a sense of humor, and fairly informed views on diverse subjects. The juxtapositions are disturbingly hilarious. He laments that African immigrants like the one he just shot don't have equal opportunities in this racist society, or that the color and layout of a certain housing project encourages violence and other social evils. He kills an entire family in their home, then reflects on the waste of human life and how there \"should be a law\" against that sort of thing. He explains a lot of aspects of his trade (like how to dispose of bodies and which victims are most likely to carry money), but leaves other elements in the dark. He first seems like a murderous variety of the common robber, but then plenty of killings seem to have no material motive at all, while others are clashes with rival killers (the absurdity reaches meta-levels at some points). \n\nI was shocked by the violence and I was also laughing, and I was feeling uneasy about that.\n\nMany reviews talk about how the documentary crew moves from \"observers\" to \"accomplices\", but any court of law would already consider them \"accomplices\" within one minute of the film starting, so that development didn't register so much to me. Sure they started taking a more active part in the carnage, but this wasn't something I considered an unexpected development.\n\nWhat did register to me was the shift somewhere in the third act. Suddenly I was no longer watching a dark comedy. The violence escalates to a nasty scene that I couldn't even watch, and that left me disturbed and depressed for days. It's like the movie finally decided to show me what I was looking at and say, \"well, are you still laughing? Are you?\" And I realized: what was there about Ben that was engaging? Even his charming ways among his friends and family were just socially acceptable methods of getting his way and remaining the center of attention, just like killing people and starring in documentaries.\n\nSo among the unexpected things I found in this film was a chillingly believable portrait of a textbook sociopath. (The scary thing is that I know someone in my neighborhood who fits that profile as well.)\n\nThe film is brilliant and disturbing. Proceed at your own risk."
    },
    "url": "/title/tt0103905/"
}