{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Thompson",
            "url": "/name/nm0860233/"
        },
        {
            "@type": "Person",
            "name": "Matthew Le Nevez",
            "url": "/name/nm1342809/"
        },
        {
            "@type": "Person",
            "name": "Steve Bastoni",
            "url": "/name/nm0060561/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6756,
        "ratingValue": 4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014903/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0095134/"
        },
        {
            "@type": "Person",
            "name": "Steve Gerber",
            "url": "/name/nm0314153/"
        },
        {
            "@type": "Person",
            "name": "Hans Rodionoff",
            "url": "/name/nm0118566/"
        }
    ],
    "datePublished": "2005-04-21",
    "description": "Agents of an oil tycoon vanish while exploring a swamp marked for drilling. The local sheriff investigates and faces a Seminole legend come to life: Man-Thing, a shambling swamp-monster whose touch burns those who feel fear.",
    "director": [
        {
            "@type": "Person",
            "name": "Brett Leonard",
            "url": "/name/nm0502577/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzk4Mzc2M2YtZWRkNy00YWMzLTlmZTQtYTY4NWUzYjI1ODJiXkEyXkFqcGdeQXVyMTEyNzgwMDUw._V1_.jpg",
    "keywords": "based on comic book,marvel comics,swamp monster,man thing character,character name as title",
    "name": "Man-Thing",
    "original_info": {
        "id": "Man-Thing_2005",
        "name": "Man-Thing",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gothic_a666"
        },
        "dateCreated": "2005-11-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0290747/"
        },
        "name": "Pretty Decent",
        "reviewBody": "The Man-thing is your average monster movie, which is likely to appeal to the die hard fans of the genre, leaving all others wondering just what was the point of making it in the first place. \n\nYet, a few things stand out, mainly the scenery and the monster itself. The swamp was captured on film in a very ambiguous way, it that it is both realistic and somewhat nightmarish and disturbing. We owe that to the excellent cinematography, responsible for delivering an uncanny goldish light and the impressive shots of oozing green vegetation. \n\nNow, the monster. Apparently, it was based on some Marvel creature I have never heard of. Either way, for a B movie, it was a very competent display of half man, half plant beast, something that could have easily become ridiculous, especially since I doubt the FX team had a large budget to work with. Still, I believe we get to see a bit too much of the Man Thing, the more footage there is on the creature the less impact it usually manages to create on the viewer.\n\nAnother thing that surprised me about this flick were the deaths. They are gruesome and convincing, with roots and barks impaling people throughout the movie. Not extremely gory but still very graphic in terms of sheer violence. \n\nWhat kills this movie is the usual...a terrible cast, abhorred acting and a plot that is too shallow to hold. Everything is highly predictable and we all know who will die and who will make it. All that is part of the genre's conventions, and since the Man-thing aims to be a monster flick, and clearly is mostly concerned with the most dedicated of fans, I can say it achieved all of its goals.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0290747/"
}