{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Miroslav Caslavka",
            "url": "/name/nm0143764/"
        },
        {
            "@type": "Person",
            "name": "David Svec",
            "url": "/name/nm0840948/"
        },
        {
            "@type": "Person",
            "name": "Pavel Skrípal",
            "url": "/name/nm0804864/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1195,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0692645/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0692643/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0692644/"
        },
        {
            "@type": "Person",
            "name": "Wiktor Grodecki",
            "url": "/name/nm0342829/"
        },
        {
            "@type": "Person",
            "name": "David Svec",
            "url": "/name/nm0840948/"
        }
    ],
    "datePublished": "1997-10-23",
    "description": "Two gay teenage runaways thrown out of their repressive homes try to survive on the streets of Prague. Hunger and desperation forces them into a life of prostitution, drugs, and teen-porn.",
    "director": [
        {
            "@type": "Person",
            "name": "Wiktor Grodecki",
            "url": "/name/nm0342829/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3NTI2MDI3M15BMl5BanBnXkFtZTYwMzM1NTk5._V1_.jpg",
    "keywords": "gay teenager,gay,male full frontal nudity,male prostitute,homosexual teenager",
    "name": "Mandragora",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gradyharp"
        },
        "dateCreated": "2005-08-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119608/"
        },
        "name": "The Belly of the Beast",
        "reviewBody": "NOTE: According to the dictionary: Mandragora is 1) a plant of nightshade family: a plant with a forked root resembling a human body that was formerly believed to have magical powers and was made into a drug and 2) a 14th century alteration of medieval Latin mandragora, influenced by man, drake \"dragon\" (from its emetic and narcotic properties).\n\nMANDRAGORA, the astonishing film from the Czech Republic written by Wiktor Grodecki (who also directs) and David Svec (who also acts in the film), is aptly named: mandragora is the world of male prostitution that seduces young lads with promises of money and ultimately poisons them with the burning disease of loss of self respect and ultimately of life.Marek (Miroslav Caslavka in a stunning performance) is a beautiful 15-year-old kid from a little village in the Czech Republic who has aligned himself with petty criminals to have better things such as classy clothing, a lad whose single father (Jirí Kodes) demands he stay in school (yet is always in the background to salvage Marek's errant life situations) and who seems to be prepping his son for a better life. Marek hates school, which he sees as merely a path to be a welder like his father. The father and son collide after another crime spree and Marek leaves home for the big city promises of Prague.\n\nOnce in Prague Marek is observed by the pimp Honza (Pavel Skripal) who follows Marek, knowing that Marek's future in the city is doomed without Honza's 'protection'. Within a day's time Marek's luck with the slot machines dries up and Honza convinces him to be his 'rabbit' - a male prostitute. Marek's first encounter with an American 'john' ends disastrously and the beaten Marek returns to the streets where he encounters a fellow hustler David (David Svec). Together they forge an alliance to escape Honza's compound and begin a life of successful prostitution. They are bonded (the probability of Marek's actually being gay and physically attracted to David is strong) and together they encounter all manner of unseemly characters involved in the underbelly of Prague's male prostitution life.\n\nCharacters weave in and out of Marek's and David's life, each time leaving scars that grow more visible as does the threat of drug problems and AIDS. They eventually consent to embrace the lowest level of making gay porn where the cruel director forces Marek to be sodomized by David. They are raided by the police and Honza reappears as Marek's nemesis. Through a series of drug-induced hallucinations and dreams Marek envisions what his future holds and his descent is stamped. Yet at this point Marek's father journeys to Prague in search of his son, discovers his life style, is terrified and angry and tangentially passes Marek in a critical final scene that is devastatingly sad.\n\nThis film is dark, frank, cruel, realistic, and sweats with the evil of the belly of the beast that is Prague's underworld. Yet the direction is so fine and, equally important, the acting by Miroslav Caslavka so sensitive that we as the audience are swept into an overwhelming compassion for these unfortunate lads whose seemingly only hope for a better life is one of humiliating degradation. MANDRAGORA is a no holds barred examination of a dark life that maintains a precarious balance between caricature and character development. Yes, it is lengthy at 126 minutes, in need of editing in areas, has faulty subtitles, and a strange musical score by Wolfgang Hammerschmid who extrapolates Puccini's 'Nessun dorma' and Bach's 'Erbarme dich' and 'Ruhe sanft' from the St Matthew Passion for heavy effects, and very dark cinematography by Vladimír Holomek, but despite these sidebar problems, they only slightly mar the overall impact of a very important film.\n\nGrady Harp",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0119608/"
}