{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sidney Poitier",
            "url": "/name/nm0001627/"
        },
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        },
        {
            "@type": "Person",
            "name": "Tina Lifford",
            "url": "/name/nm0509824/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 644,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049118/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069955/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052980/"
        },
        {
            "@type": "Person",
            "name": "Richard Wesley",
            "url": "/name/nm0921759/"
        }
    ],
    "datePublished": "1997-02-16",
    "description": "On June 12, 1964, Nelson Mandela, along with numerous political detainees, was sentenced to life imprisonment in what remains the most sensational treason trial in the history of South Africa. The incarceration of Mandela and othe...",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Sargent",
            "url": "/name/nm0765121/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ5MTc5MDgxOF5BMl5BanBnXkFtZTcwNDQxMzgzMQ@@._V1_.jpg",
    "keywords": "africa,character names as title,nelson mandela character,winnie mandela character,f.w. de klerk character",
    "name": "Mandela and de Klerk",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "HotToastyRag"
        },
        "dateCreated": "2017-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119607/"
        },
        "name": "Focuses on Mandela's later years",
        "reviewBody": "Sidney Poitier plays Nelson Mandela in this television biopic Mandela and de Klerk. The film focuses on the later years of Mandela's imprisonment, giving only five minutes or so in the beginning to the first twenty years. This story shows his relationship with his wife Winnie, played by Tina Lifford, and the politically changing climate in South Africa. Gerry Maritz and Michael Caine, playing P.W. Botha and F.W. de Klerk respectively, have lots of meetings with their political cohorts to decide how to handle the social situation, as well as debating the political gains and detriments that would coincide with potentially freeing Mandela.\n\nWhile there is a very small side-plot that references Mandela's friendship with guard James Gregory, played by Ben Kruger, I wouldn't have even noticed that the real-life tidbit was included if I hadn't previously seen The Color of Freedom, a film starring Dennis Haysbert and Joseph Fiennes, that focused solely on that friendship.\n\nAll in all, the film feels a little cheap and obviously made for television. But, if you really like Mandela biographies, you can rent this movie to compare performances and help you choose a favorite actor among the many who have played him. While Sidney Poitier and Michael Caine don't look anything like the men they're portraying, they try very hard to do South African accents. Both speak very convincingly for about nine words, and on the tenth word they accidentally revert to their usual voices. But, it is a very difficult accent to master, so you can cut them a little slack if you'd like.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0119607/"
}