{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Danièle Ferraro",
            "url": "/name/nm0274162/"
        },
        {
            "@type": "Person",
            "name": "Michelle Wolff",
            "url": "/name/nm0938294/"
        },
        {
            "@type": "Person",
            "name": "Sally Kirkland",
            "url": "/name/nm0000476/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 455,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Sarah Brown",
            "url": "/name/nm1104499/"
        },
        {
            "@type": "Person",
            "name": "Sascha Rice",
            "url": "/name/nm1099660/"
        }
    ],
    "datePublished": "2004-03-20",
    "description": "\"Mango Kiss\" is a story about Lou whose world turns upside-down when she falls in love with her best friend Sassafras. They journey to San Francisco and stumble into the wild world of role-playing and non-monogamous S/M dykes. Com...",
    "director": [
        {
            "@type": "Person",
            "name": "Sascha Rice",
            "url": "/name/nm1099660/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2Njk5OTgyNl5BMl5BanBnXkFtZTcwOTEyMjcyMQ@@._V1_.jpg",
    "keywords": "female nudity,female topless nudity,sex scene,love,role playing",
    "name": "Mango Kiss",
    "original_info": {
        "id": "Mango Kiss_2004",
        "name": "Mango Kiss",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gelbel"
        },
        "dateCreated": "2005-08-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0304377/"
        },
        "name": "Worst movie I have ever seen",
        "reviewBody": "I wish I could give this movie a zero, or even lower, because sadly that's what it deserves. I honestly never walk out of a movie, but this one was so dreadfully awful that I couldn't stand another minute of it. Please,please, please- for the sake of mankind- skip this movie. If you want a hot lesbian movie that you can really delve into, this isn't it.\n\nIt has unattractive, unappealing leads, choppy structure, ridiculous dialog, and it is absolutely unconvincing in every imaginable way. On an absolutely basic level, it fails to entertain. Everything about \"Mango Kiss\" is so stagey, it is WORSE than any student film I have seen.\n\nAs if that weren't enough, the entire movie relies on constant (and I mean CONSTANT) voice over narration. The script writer may as well have written a novel, because they insisted on TELLING everything, instead of SHOWING it. We are just supposed to assume that Lou and Sassafras are the best of friends and have a special connection, even though there is no character development to illustrate this. Also, this film continues to introduce to new characters after the first five minutes, and not in a natural way, but in a freeze-frame of the characters with their name written over the screen. There is no introduction, no development of any of the characters. We don't really get to know any of them.\n\nThis is the most amateur movie I have ever seen.\n\nI am a gay woman, who watched this film with my roommate (another gay woman) and we both found this movie to be a depressing representation of queer cinema. I am beginning to think that lesbian and gay movies are a lot like Christian rock - it doesn't matter how atrocious it is, people will still flock to it, and champion it, no matter how poor the quality is. Please don't rent this!! Instead, let's encourage the production of QUALITY gay and lesbian movies by renting \"But I'm a Cheerleader\" or \"Fire\" or \"Heavenly Creatures\", instead of swallowing whatever mindless tripe they aim at the gay community (i.e. Queer as Folk).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0304377/"
}