{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Diane Keaton",
            "url": "/name/nm0000473/"
        },
        {
            "@type": "Person",
            "name": "Mariel Hemingway",
            "url": "/name/nm0000446/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 142331,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008432/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Marshall Brickman",
            "url": "/name/nm0108613/"
        }
    ],
    "datePublished": "1979-04-25",
    "description": "The life of a divorced television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGE2NjI5MjAtODQwYy00OGJkLWJiZTEtMTU0NzVlMTkzNjFjXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "17 year old,man wears eyeglasses,teenage girl,love triangle,central park manhattan new york city",
    "name": "Manhattan",
    "original_info": {
        "id": "Manhattan_1979",
        "name": "Manhattan",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "j30bell"
        },
        "dateCreated": "2005-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079522/"
        },
        "name": "Magical film about the city and those looking for love",
        "reviewBody": "Woody Allen once said that, whereas Scorsese had generated a host of imitators, he had generated none. This may be true; films like Manhattan certainly come along far too infrequently.\n\nThat this is such a gorgeous film may strike those following the formulaic, Hollywood approach to cinema as strange and heretical. The story is unexciting (restless male in love triangle), most of the characters are unsympathetic, at least on the surface (particularly Isaac), Allen leaves lose ends lying around all over the place, and there's certainly no action (unless you count the car-chase-without-a-chase-scene involving Diane Keaton, Woody Allen and a VW Beetle).\n\nSo why should any self-respecting member of the MTV generation spend time on this film? Well, here are a few reasons.\n\nThe script is wit of the highest order. This is not gag-a-minute humour like Friends, but an altogether more acute art form stemming from character, some wonderful dialogue and a fair amount of darkness (I love the bit about Isaac trying to run over his ex-wife's lover). Allen is also prepared to turn his biting satire to personal issues, such as being Jewish. Just don't expect someone to look shrug their shoulders, slap their forehead and with mid-rising intonation say d'uh! It's not that kind of comedy.\n\nThen there is the gorgeous cinematography. Woody loves Manhattan and you can certainly tell. If there is one criticism of the film, it is that it leaves a rather picture postcard impression of the city, but I suppose if it's love, then it's love. Much of the film appears to have been shot at either sunrise or sunset to soften the light, and there are spectacular views of the towers, bridges and waterways of America's finest metropolis.\n\nThen, I suppose, there is the fact that Manhattan is probably the archetypal Woody Allen film. Other films may be better, like Annie Hall or Hannah and Her Sisters but, in Manhattan, all the elements of Allen's style are in perfect balance. There's the jazz, the neurotic, unsympathetic lead, the choice between stable and highly-strung women, the self-mocking humour (hilariously done in the opening voice-over), the railing against intellectual snobbery, the deep unease with popular culture.\n\nAnd there are great performances. Allen is at his most difficult  and in some ways his least likable. As Isaac, he's trying to do the right thing, but is rarely selfless enough to follow through with it. Diane Keaton is great as Mary, the lynchpin between the two love triangles  vain, pretentious and yet you can see why Isaac falls for her. Well, all the actors are great, and very believable, but special mention must go to Meryl Streep, who manages to steal the show with her tiny cameo as Isaac's ex-wife, writing a book about their break-up and living with their son and her lover. She is magnificent.\n\nOf course, the film will also do nothing to dispel the popular rumour that New Yorkers are neurotic, self-obsessed and self-indulgent  at least that narrow social circle Allen so often writes about. If you don't mind that, though (and I'm English, so what do I care) you're in for a treat. As with the city itself, the memories of this film will stay with you forever.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Woody Allen's \"Manhattan\"",
        "duration": "PT3M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3163659033",
        "name": "Manhattan",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjdiZmNjNDktNDdhZC00NmFmLWIzNDYtOTM4NTAzMWIwZmM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjdiZmNjNDktNDdhZC00NmFmLWIzNDYtOTM4NTAzMWIwZmM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-01-02T06:19:42Z",
        "url": "https://www.imdb.com/video/vi3163659033/"
    },
    "url": "/title/tt0079522/"
}