{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Susanna Makay",
            "url": "/name/nm0538449/"
        },
        {
            "@type": "Person",
            "name": "Hajni Brown",
            "url": "/name/nm0113679/"
        },
        {
            "@type": "Person",
            "name": "Celia Farago",
            "url": "/name/nm0267015/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1212,
        "ratingValue": 2.8,
        "worstRating": 1
    },
    "alternateName": "Maniac Nurses find Ecstasy",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074484/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0299190/"
        },
        {
            "@type": "Person",
            "name": "Léon Paul De Bruyn",
            "url": "/name/nm0522332/"
        },
        {
            "@type": "Person",
            "name": "Eileen Woods",
            "url": "/name/nm1801919/"
        }
    ],
    "description": "Bizzare, often perverse yarn about nurses in a metropolitan hospital who seduce then murder male patients.",
    "director": [
        {
            "@type": "Person",
            "name": "Léon Paul De Bruyn",
            "url": "/name/nm0522332/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Action",
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUxNTgyNzIyM15BMl5BanBnXkFtZTYwMDAyMjk4._V1_.jpg",
    "keywords": "sexy,sexual pleasure,explicit sex,lesbian sex,female masturbation",
    "name": "Maniac Nurses",
    "original_info": {
        "id": "Maniac Nurses Find Ecstasy_1990",
        "name": "Maniac Nurses Find Ecstasy",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Scoopy"
        },
        "dateCreated": "2000-07-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0165870/"
        },
        "name": "Worse than merely bad",
        "reviewBody": "The full title is Maniac Nurses Find Ecstasy. Interestingly enough, Ecstasy was in Vermont, not far from Montpelier.\n\nHere's the formula to duplicate this movie: shoot some cheap videotape footage of women in white lingerie. You don't even need to shoot sound footage. In fact, it's more flexible without sound. Just make sure there are plenty of shots of the women from behind, so you can dub in some voices later without having to worry about lip-synching. This gives you the additional advantage of having the movie in any language for later distribution. Why just imagine your masterpiece in Catalan or Frisian, or even in Latin for its run in Vatican City. Include a little bit of nudity and gore, although this will have to be cut when the pope watches.\n\n \"Hey, now that I have the footage of them doing various things in my backyard, how does that become a movie?\"\n\nEasy, make up a story. Any story. Just watch an old episode of Alfred Hitchcock on Nick at Night, and copy down a plot summary. Now have one of your friends with a deep voice read your summary aloud, and tape him. Add this here and there throughout your footage as a voice-over narration. It worked for Blade Runner, and it can work for you.\n\n\"Hey, I did that and it's only 44 minutes long.\"\n\nNo problema, amigo. Here's how to lengthen it. Watch a travelogue on TV and tape it. Let's say it's about Venice. Choose about 10 minutes of good stuff, insert it in your footage somewhere near the end, and have one of the characters say something to another, something like \"you wonder how it all began? Your mother and I met in Venice, where I was working as a gondolier.\" Have him or her recite some background activities, some interesting facts about Venice, or just some generic thoughts like \"those were the good times, I tell you. Yessireebob\". If you have a friend who can say it with an Italian accent, all the better. Or for that matter, any accent will do. People who watch movies like \"Maniac Nurses\" can't tell the difference between a Chinese accent and Estonian.\n\n\"Hey, no travelogues on tonight. Just some shark specials on Discovery.\"\n\nNo problem, my friend. Just change the monologue to \"your mother and I met off the great barrier reef, where I was hunting the Great White with Captain Cousteau's crew.\" Pretty much any real-life footage will work.\n\n\"OK, done, now I still need another 15 minutes?\"\n\nEasily fixed. This is where you add some fine art which will make your film much admired at Cannes. Does your script take place over four days? That's three sunsets and three or four sunrises which not only add to the beauty of your masterpiece, but provide an all-important time marker for your film, and do so much more subtly than ripping the top page off one of those desk calendars. Do your characters live in a house? Surely there is a beautiful old home near you which will make for some good exteriors. Your narrator simply needs to say something like, \"meanwhile, in Stately Wayne Manor, ... \".\n\nFinally, perhaps one of your characters is reading some magazine. Right after the footage of the character, show some of the articles he or she was reading. If you show some warning signs of cancer or something, you'll not only add educational value but also provide redeeming social importance, which is so critical to those obscenity trials. And this has an added plus. Later in the film you can add the exact same footage back in as a flashback, while your character tries to remember that third warning sign. Use the same footage again and again to add to the fun, as you provide valuable insight into your character's psychological development, or deterioration, as the case may be.\n\nNow the only thing left to do is to dust off the mantlepiece, and make a little extra room for your Palm D'Or.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0165870/"
}