{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ashley Scott",
            "url": "/name/nm1008709/"
        },
        {
            "@type": "Person",
            "name": "Mitch Ryan",
            "url": "/name/nm2825507/"
        },
        {
            "@type": "Person",
            "name": "Woody Jeffreys",
            "url": "/name/nm0420345/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 413,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "alternateName": "Manny Dearest",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0490846/"
        },
        {
            "@type": "Person",
            "name": "Bryan Dick",
            "url": "/name/nm3507602/"
        },
        {
            "@type": "Person",
            "name": "Ken Sanders",
            "url": "/name/nm0006803/"
        },
        {
            "@type": "Person",
            "name": "Daniel West",
            "url": "/name/nm8062223/"
        }
    ],
    "datePublished": "2017-04-29",
    "description": "Single mom Karen Clark hires Alex, a manny (a male nanny or au pair) to help with her two young sons, never suspecting Alex has other plans and wants her family as his own, even if he has to murder to achieve his goal.",
    "director": [
        {
            "@type": "Person",
            "name": "Chad Krowchuk",
            "url": "/name/nm0472377/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2IwZTQ5YzQtMjk0Yy00NjlhLWEwZjctZjZjMjViZTQyYjUzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQyNDk2NzE@._V1_.jpg",
    "name": "A Stranger with My Kids",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wes-connors"
        },
        "dateCreated": "2017-06-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt5612874/"
        },
        "name": "Manny Poppins",
        "reviewBody": "In her bathtub, a beautiful blonde woman is drowned by a hooded intruder. As she succumbs, handsome killer Mitch Ryan (as Alex Smith) comes into focus, regretfully telling her, \"We could have been a family.\" We're sure he's the obviously deranged title character of the story. Quickly, we learn the murderous young man is a \"manny\". This fitting term is explained as a combination of \"man\" and \"nanny\". It's nice to learn new things by watching TV movies. Mr. Ryan's next job is at the big, lovely home belonging to beautiful blonde Ashley Scott (as Karen Clark). She's a single, working mother of two young boys. After a string of weird \"nanny\" and \"manny\" applicants, Ms. Scott happily hires Mr. Ryan. He's very attractive, great with kids, willing to clean her large house, and likes to cook delicious meals. In fact, he sounds too good to be true...\n\nOf course, Ryan sets out to become the real man of the house. He's a hard worker. Ryan has an obstacle, however, as Ms. Clark is very seriously engaged with three-years-sober and now responsible boyfriend Woody Jeffreys (as Greg Hitchens)...\n\nDirector Chad Krowchuk should win you over in his first scene, especially when Ryan exits the crime scene one step ahead of his victim's housekeeper. Two ships crossing in the night, and wonderfully placed. Ryan is quite believable as the psycho killer. Inviting and dangerous, he looks less like an actor having fun and more like a character on his mission. Even when director Krowchuk has Ryan spit in his rival's scrambled eggs, it's played straight. Supporting roles are all engaging. Eyes are drawn upon \"hot-to-trot\" Jordana Largy (as Cori) and manny-knowledgeable Fiona Vroom (as Gillian). Kid actors Dylan Kingwell and Jett Klyne (as Max and Rex Clark), plus bullying Cory Gruter-Andrew (as Brett Blainesfeld), are stellar. In a fairly substantial part, Dylan demonstrates particularly fine acting. Being called \"Maxi-pad\" when your name is \"Max\" has got to hurt.\n\n******* A Stranger with My Kids/Manny Dearest (2/5/2017) Chad Krowchuk ~ Mitch Ryan, Ashley Scott, Woody Jeffreys, Dylan Kingwell",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt5612874/"
}