{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Noam Chomsky",
            "url": "/name/nm0159008/"
        },
        {
            "@type": "Person",
            "name": "Mark Achbar",
            "url": "/name/nm0009788/"
        },
        {
            "@type": "Person",
            "name": "Karin Aguilar-San Juan",
            "url": "/name/nm5974575/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4812,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056314/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006414/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053578/"
        }
    ],
    "datePublished": "1992-11-06",
    "description": "A film about the noted American linguist/political dissident and his warning about corporate media's role in modern propaganda.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Achbar",
            "url": "/name/nm0009788/"
        },
        {
            "@type": "Person",
            "name": "Peter Wintonick",
            "url": "/name/nm0936092/"
        }
    ],
    "duration": "PT2H47M",
    "genre": [
        "Documentary",
        "Biography",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2NDY5Nzc3NF5BMl5BanBnXkFtZTYwNjEyNTQ5._V1_.jpg",
    "keywords": "media,east timor,manufacturing consent,media criticism,critical thinking",
    "name": "Manufacturing Consent: Noam Chomsky and the Media",
    "original_info": {
        "id": "Manufacturing Consent: Noam Chomsky and the Media_1993",
        "name": "Manufacturing Consent: Noam Chomsky and the Media",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "petermaxie"
        },
        "dateCreated": "2002-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104810/"
        },
        "name": "Get Sad, aka The Dirty Low Down Truth",
        "reviewBody": "I wonder how many conservatives, who disqualify this fine documentary and its book, are financially poor. I wonder if they realize that their attitude supports the rich folks who are responsible for their dire financial straits. \n\nI am not an activist. I admit that I'm a liberal because I was raised by liberals: poor, somewhat intellectual musicians; none of us, except for one sister, university graduated scholars; all libertarians, the oldest before the term was invented. We are, I believe, the common people to whom Chomsky is speaking quite directly. The ones who, because we constitute a fairly large proportion of society, could make a difference if we became activists for his described controlled anarchy, the purer democracy in which commoners would assume control of the economic, political etc. systems now concentrated within the control of a relatively small number of moneyed individuals and corporations.\n\nWhat is liberal? To me, it's strongest dictionary definition is the one that describes it as ideas that wish/work for change. Most liberals are for change because: there are many things wrong with the present system. The secondary definition is more on the idea of leniency. Both are valid, and both are despised by most conservatives. The conservative rejoinder to liberal ideas: 1) don't fix what's already working, and 2) there's too much moral/ethical leniency in our society. \n\nThe irony is that many conservatives also think there are things wrong with the system, but they blame liberals for moral/ethical changes during the past few decades (what we liberals know to be minor, but what conservatives consider to be drastic) and are therefore for a return to the more distant past, say the Victorian age, as a resolve. The problem with this conservative resolve, for one perhaps prime example, is that there are several more times the population of humans alive on Earth than there were during the 19th century. \n\nThe population growth has consequences. The rules have changed drastically because of technology and population growth. Land is no longer cheaply bought nor given away; like too many cells crowded, straining against one another for survival inside a small particle, human competition for survival has become ruthlessly detailed, more aggressive than ever before. Then liberals become the perfect scapegoat, or smokescreen for denial of this tough reality, like bigotry was once utilized for denial, killing Indians in the name of a phony over-protection in the wild, uncharted west.\n\nAmerican and western European conservatives are central to this matter as is evident by tight European border controls and American `white flight.' One imagines today's heads of state and corporate leaders conferring on attitudinal changes for our society, one of a return to aggressiveness in the old Machiavellian manner, utilizing the new technological tools and weapons, but for the same old genocide inflicted upon `Indians,' only now in more distant lands, and for the same rearmament purposes.\n\nWhat has changed little, is the economic system. The powerfully rich and their corporations are ever more powerful, mainly because there is a tremendous amount of power to be wielded by masses of laboring people. Note how difficult it would be for one extremely wealthy family, say the two Bush presidents and family, to completely buy out one relatively small town of twenty thousand people. Not possible. This is why persuasion is so vital to the powers in control of the money and ecopolitical policies. If the people were to attempt to rise up and overthrow this yoke of corporate power, which considering how few vote in presidential elections doesn't seem too crazy at first, it could certainly be done. But according to Chomsky, such a revolution is actually very difficult to achieve, and the reason is that so few common people have the will to do it.\n\nThe people's consent, to not attempt to overthrow their government's economic policies regardless how unfairly these powerful few treat the masses, has been manufactured through a number of different insidious manipulations. The mass media is controlled by the powerful corporations who, in agreement with conservative thinking, wish the economy to remain unchanged (status quo) for obvious reasons: to hang onto their money. Many other people, sometimes called yuppies, who've recently acquired, or are currently in the process of acquiring, large amounts of money also support the status quo so they don't miss the boat of riches. What puzzles is how poor conservatives, the largest of demographic groups, are also for keeping the status quo, since they stand to lose economically at almost every turn. This is one of the strangest of sociopolitical phenomenon. It's also the most important area of focused propaganda that has ever existed. Such blatantly fraudulent advertisements are what sickened me to television over the past few decades.\n\nBasically, the economically powerful, via mass media, utilize faith based ignorance prevalent in these poor conservatives, in an insidious manipulation of these faithful to harm themselves and everyone else by promoting status quo thus allowing the super rich to pilfer money that rightfully belongs to all of us in a more equal share of funds. The very idea I put forth here, and which is at the core of Chomsky's work, is socialistic and therefore to be derided by conservative capitalists. The conservative poor have therefore allowed the rich to bite off the noses of all the poor (the middle class no longer exists) so as to spite liberal change, which they traditionally hate. And the super rich are controlling it all along, which is an old Roman military strategy: divide and conquer."
    },
    "url": "/title/tt0104810/"
}