{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 47,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0115477/"
        }
    ],
    "datePublished": "2000-01-21",
    "description": "Marcus Garvey emmigrated from Jamaica to New York City in 1914, bringing with him a message of black empowerment. After touring the United States with his message, his organization started publishing The Negro World, a newspaper. ...",
    "director": [
        {
            "@type": "Person",
            "name": "Stanley Nelson",
            "url": "/name/nm0625747/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWE0MjUzOWMtM2FiNS00OGQyLTg2MTQtMTM3OGI2NTY3MmI2XkEyXkFqcGdeQXVyNjA1NTc4OQ@@._V1_.jpg",
    "keywords": "fbi federal bureau of investigation,african american,africa,new york city,jamaica",
    "name": "Marcus Garvey: Look for Me in the Whirlwind",
    "original_info": {
        "id": "Marcus Garvey: Look for Me in the Whirlwind: American Experience_2001",
        "name": "Marcus Garvey: Look for Me in the Whirlwind: American Experience",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2006-02-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0411630/"
        },
        "name": "a fascinating documentary about a forgotten man",
        "reviewBody": "When I first saw this video, I knew VERY little about Marcus Garvey. This isn't surprising, as MOST Americans have no idea who he or the UNIA was--even though they were a potent force in the early 20th Century. This Jamaican-born activist was at one time the most powerful and most feared black man in America and his spectacular rise and crash were well chronicled in this film. I especially appreciate it because much of the material on Garvey you find in books lacks objectivity--either portraying Garvey as evil or as an innocent man hounded by a racist federal government. The true story lies well in the middle--with his seeds of greatness as well as a powerful Achilles Heel (his ego). The documentary doesn't necessarily take EITHER view but presents the evidence and lets you make your own conclusion. All in all, a wonderfully made PBS film and well worth watching--particularly for teens and young adults.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0411630/"
}