{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maria Callas",
            "url": "/name/nm0006568/"
        },
        {
            "@type": "Person",
            "name": "Giuseppe Di Stefano",
            "url": "/name/nm0224339/"
        },
        {
            "@type": "Person",
            "name": "Carlo Maria Giulini",
            "url": "/name/nm0321338/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 79,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "datePublished": "1988-12-09",
    "description": "A decade after his original film on her, Tony Palmer returns to the subject of Maria Callas, this time for ITV's flagship arts show.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Palmer",
            "url": "/name/nm0658482/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Documentary",
        "Biography",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM1MjAwMzQxNV5BMl5BanBnXkFtZTcwOTIxNTcxMQ@@._V1_.jpg",
    "keywords": "female singer,greek woman,reference to maria callas,six word title,hyphen in title",
    "name": "Maria Callas: La Divina - A Portrait",
    "original_info": {
        "id": "Maria Callas: La Divina: A Portrait_2000",
        "name": "Maria Callas: La Divina: A Portrait",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Goingbegging"
        },
        "dateCreated": "2021-12-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0261051/"
        },
        "name": "She thought she was ugly",
        "reviewBody": "Every woman is convinced that some part of her body is a disaster. As a young woman, Maria Callas was told, not untruthfully, that the whole of her body was a disaster. Then she saw the impact Audrey Hepburn made, while shooting 'Roman Holiday', and decided to shed most of her bulk. That was one half of her transformation, quite as dramatic as anything that happened in her operas. The other half was falling in love for the only time, at thirty-five, turning her at last into a confident, graceful, glamorous figure (though she still thought her ankles were ugly, which they weren't, and kept turning down the role of Carmen, because it required her to dance.)\n\nThe problem was her choice of lover, Aristotle Onassis, who had apparently given her a lot of pillow-talk about eternal love. When he traded her in, quite casually one day, for Jacqueline Kennedy, she was shattered beyond hope, and would never be the true Callas again. Her addiction to sleeping pills seemed like a rehearsal for early death, commented one close colleague.\n\nWe can well remember her victim-talk at the time, her pang of regret that she had surrendered herself to him before demanding marriage. Otherwise she might have been one of the world's richest wives (though the evidence suggests that it would not have been a happy experience.) But Callas was no naive teenager. She was almost into midlife, and evidently a poor judge of men and situations. Her own marriage of convenience, to an obvious sugar-daddy (Giovanni Meneghini), had provided the funds for her extensive international training. And now a man had simply used and abused her in the same cynical spirit. A victim she was not.\n\nThis Greek tragedy, as it inevitably became known, is well-handled by director Tony Palmer, though we feel a bit put-out by his failure to identify most of these well-informed commentators and interviewees - too often for it to be coincidence. It's obviously a deliberate stylistic, and I suppose it could be called creative, though for some reason, the baritone Tito Gobbi and Callas's biographer John Ardoin are named, and the end-frame says 'With thanks to...' four other people.\n\nStill, we get plenty of chances to see what made her special: a perfectionism that often caused her to cancel performances when she was feeling just a fraction below her best, yet refusing to allow understudies, believing that nobody could double for the great Callas. Here is a good spread of arias, and a clip from her one film (Medea) that suggested acting talent independent of opera. Perhaps that is how she developed the innovation she is always credited with: taking opera-singing beyond recital and into drama.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0261051/"
}