{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gene Kelly",
            "url": "/name/nm0000037/"
        },
        {
            "@type": "Person",
            "name": "Natalie Wood",
            "url": "/name/nm0000081/"
        },
        {
            "@type": "Person",
            "name": "Claire Trevor",
            "url": "/name/nm0872456/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1211,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0144615/"
        },
        {
            "@type": "Person",
            "name": "Everett Freeman",
            "url": "/name/nm0293388/"
        },
        {
            "@type": "Person",
            "name": "Herman Wouk",
            "url": "/name/nm0941883/"
        }
    ],
    "datePublished": "1958-04-24",
    "description": "At 18, Marjorie Morgenstern is the proverbial New York Jewish-American princess on the cusp of womanhood. While she has in the back of her mind that she would like to become a stage actress, she is less certain about her personal ...",
    "director": [
        {
            "@type": "Person",
            "name": "Irving Rapper",
            "url": "/name/nm0710924/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWU2ZTA0NGUtZjJhZC00NmU1LTliYTYtNzIyZWI5YjE0NGU5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "playwright,new york city,musical revue,jewish,based on novel",
    "name": "Marjorie Morningstar",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "danaful"
        },
        "dateCreated": "2003-02-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051911/"
        },
        "name": "Good lord, no!!!",
        "reviewBody": "Great, great book. TERRIBLE movie. Natalie Wood is lovely, to be sure, but not a great actress. Gene Kelly is a great actor and dancer, but horribly miscast. The simpering! The overacting! Spare yourself. Read the book."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Eighteen year old Marjorie Morgenstern is a proverbial New York Jewish-American princess on the cusp of womanhood. While she has in the back of her mind that she would like to become a stage actress, she is less certain about her personal future. While she has burgeoning sexual feelings for her boyfriend Sandy Lamm, who she is expected to marry eventually in he being a nice Jewish boy, she isn't sure if she truly loves him. Marjorie wants some time away to discover in part if she should accept Sandy's proposal of marriage. In doing so, she meets several wannabe suitors, who will enter, leave and reenter her life over the course of her young adulthood, the one who she believes she is truly in love with being Noel Airman, fourteen years her senior, he the social director of South Wind, a summer resort in the Catskills, when they first meet. Much like Marjorie's chosen life path is against the tradition envisioned by her opinionated mother, Rose Morgenstern, in Rose hoping that acting is just a phase and that Marjorie will settle into a life as housewife and mother, Noel has taken a similarly unconventional life path, bucking an envisioned professional life for one in the arts, he adored as a genius by those at South Winds as he is writing a Broadway musical. What those at South Winds do not see is Noel's time away from South Winds, he who has a tendency not ever to finish what he starts, which may be in part the reason why he never sees himself getting married in his romantic relationships only lasting the short course of his time in any one given place. What may be more egregious in Rose's mind about Noel as a potential husband for Marjorie is the fact that he has turned his back on his Jewish heritage. As Noel contemplates settling into a more conventional life for Marjorie, the question becomes whether what they both see as the love they have for the other can overcome these many obstacles.",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi320586521",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmY4YWFkMzAtOTU4ZC00YjAwLWE1ZjktMWRhMTVlMGRjZDgzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmY4YWFkMzAtOTU4ZC00YjAwLWE1ZjktMWRhMTVlMGRjZDgzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-26T21:02:53.060Z",
        "url": "https://www.imdb.com/video/vi320586521/"
    },
    "url": "/title/tt0051911/"
}