{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        },
        {
            "@type": "Person",
            "name": "Joanna Pacula",
            "url": "/name/nm0001586/"
        },
        {
            "@type": "Person",
            "name": "Basil Wallace",
            "url": "/name/nm0908534/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23048,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051067/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003653/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Michael Grais",
            "url": "/name/nm0334457/"
        },
        {
            "@type": "Person",
            "name": "Mark Victor",
            "url": "/name/nm0896131/"
        }
    ],
    "datePublished": "1990-10-05",
    "description": "A retired DEA agent is out to hunt down and take out a Jamaican drug posse that has targeted he and his family for murder.",
    "director": [
        {
            "@type": "Person",
            "name": "Dwight H. Little",
            "url": "/name/nm0514546/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTEzOTNhODMtOTA5NC00YWM2LWJmYTEtOTAyNDVjZWQ3OTUzXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "drug lord,jamaican,female frontal nudity,nightclub,junkie",
    "name": "Marked for Death",
    "original_info": {
        "id": "Marked For Death_1990",
        "name": "Marked For Death",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2020-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100114/"
        },
        "name": "\"I want Hatcher dead\"!",
        "reviewBody": "The third one off the ranks (behind \"Above the Law\" and \"Hard to Kill\"), comes another three word title to the cycle. In what is a familiar one-note, bone-crunching action vehicle for Steven Seagal --- but hey that's the way we love 'em! Simple, little story and Seagal handing out plenty of point-blank beat downs. However he's hard-pressed to do so, until it becomes personal. Then it never lets up, so Seagal in his usual cool and collected manner does it easy. Somehow despite the vicious threats and explosive situations, never do you feel that he's in any real sort of danger. Although he does meet his match when he goes face to face with Screwface at the film's savage climax. It's a rarity, but yeah, he gets thrown around a bit. Just a bit. Still without leaving a scratch.\n\nAfter seeing his partner get shot-up on a botched undercover job, John Hatcher retires from the Drug Enforcement Agency to return back to his small hometown. Through one of his old pals he learns that a Jamaican posse led by drug lord Screwface have infiltrated his neighbourhood controlling the drug scene. At first Hatcher just looks away not wanting to get involve, but when he finds himself caught up in an incident between the Columbians and Jamaicans. Screwface vows that he and his family are now marked for death --- and when he lives up to that threat he goes after Screwface and his posse.\n\nAfter a blistering start, it does slow down before ramping things up again when Hatcher eventually breaks out his short-lived, self-pitying slumber when payback becomes a driving factor. It's so forced and overblown (this is all happening in a small town), but it's engagingly exciting and furiously staged with director Dwight H. Little's tight handling. The set-pieces, like the car chase/department store melee displays such confidence. The camera really likes watching Seagal in the grove, and his quick aikido abilities are simply are marvel to watch. Be it with a gun, sword or hand combat. It's all brutal and high-octane, and surprisingly at times it can become a nasty piece of work. The performances are acceptable with Seagal stoic as ever, but where it matters he's quick on his feet. Basil Wallace is a fearfully hammy treat as the commanding, over-the-top Screwface with those glaring green eyes. His presence just seems to linger, even when he isn't on screen and he does get some insane dialogues. Keith David is solid and so is Tom Wright. Joanna Pacula appears in a minor role and horror fans will recognize a young Danielle Harris.\n\n\"Marked for Death\" is excessive, ruthless, but mindlessly numbing early 90s action. Seagal's best was still to follow a year later.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from 20th Century Fox",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2610233625",
        "name": "Marked for Death",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWZlY2EyOTQtM2M3Yi00NzhlLTlhNzItYmU2YWE2NWFmZTE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWZlY2EyOTQtM2M3Yi00NzhlLTlhNzItYmU2YWE2NWFmZTE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:58:08Z",
        "url": "https://www.imdb.com/video/vi2610233625/"
    },
    "url": "/title/tt0100114/"
}