{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Herbert Lom",
            "url": "/name/nm0007042/"
        },
        {
            "@type": "Person",
            "name": "Udo Kier",
            "url": "/name/nm0001424/"
        },
        {
            "@type": "Person",
            "name": "Olivera Katarina",
            "url": "/name/nm0904236/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3505,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "alternateName": "Mark of the Devil",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019971/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0168154/"
        },
        {
            "@type": "Person",
            "name": "Michael Armstrong",
            "url": "/name/nm0035830/"
        },
        {
            "@type": "Person",
            "name": "Adrian Hoven",
            "url": "/name/nm0396998/"
        }
    ],
    "datePublished": "1972-04-05",
    "description": "In 1700s Austria, a witch-hunter's apprentice has doubts about the righteousness of witch-hunting when he witnesses the brutality, the injustice, the falsehood, the torture and the arbitrary killing that go with the job.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Armstrong",
            "url": "/name/nm0035830/"
        },
        {
            "@type": "Person",
            "name": "Adrian Hoven",
            "url": "/name/nm0396998/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "History",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUyMWNlOWItMWRlZS00YzNmLTg3ODctZmFkZGQzNTI2NWI2L2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "foot torture,sexploitation,video nasty,female buttocks,whipping",
    "name": "Hexen bis aufs Blut gequält",
    "original_info": {
        "id": "Mark of the Devil_1969",
        "name": "Mark of the Devil",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TonyDood"
        },
        "dateCreated": "2005-06-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065491/"
        },
        "name": "Repulsive, depressing and brilliant",
        "reviewBody": "There's no point trying to understand the draw of a film that rolls around in the mud of the darker aspects of human nature without shame--torture, mutilation, misogyny, injustice and despair as thematic content--there's nothing new or even so unusual about being attracted to these things, and no need for apology. If there's a market for something someone will try to fill the niche.\n\n\"Mark Of The Devil\" belongs in a category of exploitation film that is hard to define. It's not \"scary.\" It inspires dread, but hardly \"fear.\" It's not the goriest film ever made--it may have been at the time but is fairly tame today. It's not the sickest by far--Asian pseudo-snuff films and the \"Faces Of Death\" series raised the bar to its highest level of taboo-shattering. It IS exploitation, of course--whoever sees it is unlikely to be looking for an education on how witch hunts were once carried out. No--I put \"Mark Of The Devil\" in the same category as \"Cannibal Holocaust,\" \"Last House On The Left,\" \"Salo,\" and a greasy, dripping handful of other films that are not far from the exploitation genre of \"Sickies.\" These are movies that dare to point out, if they work for you, that is (there's always someone eager to point out how \"boring\" these movies are, of course) how truly nasty and relentlessly unpleasant life can be. Their message is, simply: \"As bad as you thought things were, they're far worse.\" Again, discussing the appeal of that message belongs in another review, I'm content knowing it exists, and that's why movies like \"Mark Of The Devil\" were created.\n\nFor my money, this old, old film delivers a wallop like no other. It's campy, trashy, ugly, and beautiful all at once. It's stupid, perverse, poorly executed and mean in an almost magic way. Like \"Cannibal Holocaust,\" it opens with a lovely, lyrical theme song that, in 90% of viewers at least, would normally inspire memories of sentiment, love, emotions of serenity and beauty. You are coaxed further along into this state by the lushly photographed panorama shots of a German countryside in full bloom, and the quaint and fascinating sight of horse-drawn carriages. Then, before you know it, you're pulled out of this reverie by being forced to witness a non-graphic but genuinely obscene depiction of the raping of a caravan of nuns. It's a nasty, ugly bit of business, and a cruel juxtaposition (not unlike similar, but somehow less revolting, moments in \"A Clockwork Orange\" which would come a few years later), all the moreso for the misleading score, which carries on as if the molestation of nuns is just more flora and fauna. The director knows it isn't--it's as if he's laughing sadistically at his audience perhaps--at the very least, he knew what he was doing, from a psychological stand point. This, and other similar moments in this film, are not accidental.\n\nAnd therein lies the genius behind these \"Sickies,\" above and beyond the standard, forgettable exploitation fare, no matter how realistic the gore or plentiful the nudity and foul language. Exploitation films like \"Mark Of The Devil\" were carefully designed to make you feel something you didn't expect to feel, something beyond fear or nausea...they get under your skin and work on your psychology. By the time the final victims are dispensed with in this type of film, the average viewer has been sated (or, most likely, overdosed) with the concept of Life As Garbage, and is invited to now return to whatever real life she/he exists in and compare. The \"missing ending\" to \"Mark Of The Devil\" notwithstanding, it is near impossible not to come away from the commonly seen end of this film without feeling depressed, angry, frustrated, exhausted and unclean. And, considering the focus of the movie is atrocity committed by man against his brothers and sisters...that reaction is certainly appropriate.\n\nIs this type of film necessary, or even entertainment? Obviously it is, or these films wouldn't have had the shelf life they've had. Exploitation movies come and go, but some of these films rise to the top of the swill. \"Mark Of The Devil\" has earned its blood-stained spot on the shelf of movies that go one step (or perhaps a few more) beyond where most viewers are comfortable or even interested in going, and over thirty years later this movie still has the power to offend, disgust, provoke and amaze. Considering the variety of exploitation material available today, that's quite an accomplishment, if you think about it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Mark of the Devil",
        "duration": "PT2M59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1073196825",
        "name": "Mark of the Devil",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODQ1NTA4YzUtZDEyNy00ZWY1LTkzNGItMWQ4ZTI2NDAzMGYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODQ1NTA4YzUtZDEyNy00ZWY1LTkzNGItMWQ4ZTI2NDAzMGYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2014-10-05T04:40:28Z",
        "url": "https://www.imdb.com/video/vi1073196825/"
    },
    "url": "/title/tt0065491/"
}