{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marlene Dietrich",
            "url": "/name/nm0000017/"
        },
        {
            "@type": "Person",
            "name": "Maximilian Schell",
            "url": "/name/nm0001703/"
        },
        {
            "@type": "Person",
            "name": "Annie Albers",
            "url": "/name/nm0016435/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 812,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051615/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150508/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011383/"
        },
        {
            "@type": "Person",
            "name": "Meir Dohnal",
            "url": "/name/nm0230648/"
        },
        {
            "@type": "Person",
            "name": "Maximilian Schell",
            "url": "/name/nm0001703/"
        }
    ],
    "datePublished": "1984-03-02",
    "description": "Retrospective on the career of enigmatic screen diva Marlene Dietrich.",
    "director": [
        {
            "@type": "Person",
            "name": "Maximilian Schell",
            "url": "/name/nm0001703/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTBlYzQ2ODctNDNlZS00MDhjLTg2MDktNThlZjU3NTliMzIwXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "actress name as title,marlene dietrich character,forename as title,reference to dante alighieri,diva",
    "name": "Marlene",
    "original_info": {
        "id": "Marlene_1984",
        "name": "Marlene",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2016-11-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085905/"
        },
        "name": "Strange and wonderful documentary",
        "reviewBody": "I've seen another documentary on Marlene Dietrich and also read her daughter's book. I was interested in this one for a bizarre reason- I once sat on the New York subway next to someone who had the script of this documentary with him. Being a big fan of Maximilian Schell's, I wanted to see it.\n\nSchell, who appeared with Dietrich in \"Judgment at Nuremberg,\" was able to convince the actress to do this documentary, but she would not permit herself to be shown on camera. \n\nShe was last seen in the 1978 film Just a Gigolo, heavily made up and behind a veil, but still looking mighty good to me. But if one reads her daughter's book, it's easy to see that as she aged, she became a little eccentric. She spent the last 11 years of her life bedridden and allowed very few people to see her.\n\nSo the famous Dietrich voice supplies a narration of sorts to the glorious film clips, clips of her in newsreels, and film of her doing her one-woman show. It is all glorious, showing how she evolved over the years, her excellent acting in films like \"Judgment at Nuremberg,\" \"Witness for the Prosecution,\" and \"Touch of Evil,\" and the incredible charisma and beauty she shared with the audience in her show. \n\nAt one point, Schell offends her and she lays into him. making a remark about him being a \"Swiss\", and telling him she'd sat at tables with politicians and dignitaries and no one had ever spoken to her like that. She went on for a while. Schell punctuates her words with images of flying film strips and a whizzing, distorted background.\n\nShe could be abrupt, but also emotional as she recites a favorite poem of her mother's. \n\nDietrich talks like she hated making movies, didn't do much to get into a role, her private life was private. It's hard to say now. One thing that wasn't gone into was her passion for Jean Gabin, nor was much of the documentary focused on her war work. \n\nMarlene Dietrich was a magical personality, an exotic beauty, a wonderful actress, and a magnificent performer. This documentary gives us plenty of examples of her magic and, if you don't appreciate her now, you will after seeing this. \n\nShe was the kind of star we won't see again - androgynous, earthy, and very much of her time. In her eighties when this was made, her attitude is very much like her final words in Touch of Evil: \"What does it matter what you say about people?\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0085905/"
}