{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tippi Hedren",
            "url": "/name/nm0001335/"
        },
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Martin Gabel",
            "url": "/name/nm0300010/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 51073,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0137799/"
        },
        {
            "@type": "Person",
            "name": "Winston Graham",
            "url": "/name/nm0334357/"
        },
        {
            "@type": "Person",
            "name": "Jay Presson Allen",
            "url": "/name/nm0696319/"
        }
    ],
    "datePublished": "1964-07-17",
    "description": "Mark marries Marnie although she is a habitual thief and has serious psychological problems, and tries to help her confront and resolve them.",
    "director": [
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTEwMzhiMDktMzFlMi00NTE1LTlkOTItZWI5ODA2Y2E5YjUzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "fear of sex,compulsive liar,employer employee relationship,kleptomania,marital rape",
    "name": "Marnie",
    "original_info": {
        "id": "Marnie_1964",
        "name": "Marnie",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jay_thompson680"
        },
        "dateCreated": "2004-06-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058329/"
        },
        "name": "Freud, Hitchcock, Sex and Suspense",
        "reviewBody": "Hitchcock's Marnie was a critical and financial failure when released in 1964. Some decades afterwards, the film was 'rediscovered' by film theorists fascinated by its engagement with issues such as Freudian psychoanalysis, sexual abuse, gender roles, trauma, sexual deviance. \n\nThe central plot revolves around Marnie, a habitual thief who goes to work for large corporations, steals from her (always male) boss, then flees - dying her hair, changing her name and then starting over again.\n\nOne employer, Mark Rutland, recognises her from one of her previous companies. When she robs him, he pursues and marries her. Playing Freud to her Jane, he alternates between trying to get her into bed and determining the link between her thefts and her fear of sex, thunder storms, the colour red and men.\n\nTippi Hedren is ideally suited for the role of Marnie; her trembling-but-firm voice and impassive, doll-like face give her the look and feel of a tough-yet-vulnerable child-woman, lost in a nightmare world. Sean Connery is terrific as\n\nRutland, and the interaction between his character and Marnie suggests (at times) a slight subversion of gender roles. She may be troubled, but she won't easily fall under his net (he likens her to a wild animal) - and will tell him!\n\nThroughout the film, there is a brilliant use of colour, and some memorably dreamlike shots: the opening of Marnie (her face unseen) with black hair, walking as if in a daze along a railway platform and through a hotel; the hand banging against a window, alarming the sleeping Marnie; the flashback to the woman's troubled past.\n\nUnfortunately - and other reviewers on IMDb have argued this - the film's editing is often lazy. Some scenes go on for far too long, and are way too chatty. More show and less tell, I say! There are those fake backdrops. They can be seen to suggest Marnie's detachment from the world (as Hitch once argued), but why couldn't he include them with every shot of her? Laziness, again?\n\nThen there's Lil, the sister of Mark's dead wife. Diane Baker gives a terrific performance, and there is the suggestion that Lil's attraction to her former brother-in-law might be deceptive... it could be Marnie she's after. Just check out the look she gives Marnie when they first meet and her remark ('Who's that Dish'?) But the lesbian subtext is never explored. Lil's character is never developed beyond a woman who alternates between smiling and scowling at Marnie, and then disappearing before the dramatic 'final confession'.\n\nOtherwise, a brave film, elegant to look at, and rich with issues for the film theorist AND the 'casual' viewer to explore."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Universal Pictures",
        "duration": "PT4M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2476212505",
        "name": "Marnie",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjNmOTE4NjYtZjVjNC00YWUyLTk3MzgtNzg3MjIwYjNiZDQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjNmOTE4NjYtZjVjNC00YWUyLTk3MzgtNzg3MjIwYjNiZDQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:10:28Z",
        "url": "https://www.imdb.com/video/vi2476212505/"
    },
    "url": "/title/tt0058329/"
}