{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Beau Bridges",
            "url": "/name/nm0000977/"
        },
        {
            "@type": "Person",
            "name": "Stockard Channing",
            "url": "/name/nm0000330/"
        },
        {
            "@type": "Person",
            "name": "Robert Sean Leonard",
            "url": "/name/nm0000494/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 994,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Janet Kovalcik",
            "url": "/name/nm0468293/"
        }
    ],
    "datePublished": "1993-03-26",
    "description": "3 unlike couples get to know each other thru a committee at a private NYC school.",
    "director": [
        {
            "@type": "Person",
            "name": "Arthur Hiller",
            "url": "/name/nm0002137/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY4ODUzMTcwMl5BMl5BanBnXkFtZTcwMjU2ODE1NA@@._V1_.jpg",
    "keywords": "independent film",
    "name": "Married to It",
    "original_info": {
        "id": "Married to It_1993",
        "name": "Married to It",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2000-09-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107523/"
        },
        "name": "One To Shout About",
        "reviewBody": "A common thread provides the bond that draws three diverse couples together, ultimately leading to a friendship through which they explore the foibles of life and love in `Married To It,' an engaging look at contemporary relationships and perspectives, directed by Arthur Hiller. There's John and Iris (Beau Bridges and Stockard Channing), a jaded social worker and the wife of many years who sees him through it all, has given him two children (now preteens) and only of late has come to realize that he's given up on her and on life in general; Chuck and Nina (Robert Sean Leonard and Mary Stuart Masterson), an ambitious investment broker and his wife, a school psychologist; and Leo and Claire (Ron Silver and Cybill Shepherd), a toy manufacturer and his second wife, a sophisticated woman of society who is unable to make a connection with his daughter, Lucy (Donna Vivino). A school function and commitment to a committee bring them together, and they soon find that although they each compete in different arenas of life, they are in the end not so different from one another after all. In fact, they soon come to depend and rely upon their newly founded friendships more than any of them could ever have imagined possible. Hiller has crafted an emotionally stirring study of want, need and expectation that will be readily identifiable to just about anyone who has taken part in the game of life. And it's skillfully delivered through an outstanding ensemble cast, highlighted by the exceptional work of Stockard Channing, a gifted actress who seems to thrive in a project like this. She brings Iris to life from the inside out and creates that necessary connection with the audience that spills over onto the rest of the cast, all of whom deliver dynamic performances as well, most notably Cybill Shepherd as the aloof sophisticate who finally realizes what is really important in life. But what really makes this movie work is the depth of character that each of the actors involved brings to the core of the story. It's as if the derive energy and incentive from one another; and when actors can give as much as they receive, as they do here, it shows in the polish of the finished product. That they all worked so well together also reflects the skill of the director, and Hiller obviously did a fantastic job of creating an atmosphere in which his actors could excel. Rounding out the supporting cast are Don Francks (Sol), Jimmy Shea (Marty), Nathaniel Moreau (Kenny) and Diane D'Aquila (Madeleine). One of the great things about the video revolution is that terrific movies like this one, that for whatever reason go largely unnoticed in theatrical release, get a second life and with any luck the attention they so justly deserve. `Married To It' is a sleeper you should shout about from the rooftops; it's a well made movie with exemplary performances, a great story and a terrific ending. A film as good as this simply cannot be ignored, because this, my friends, is what movies are all about. This is one you have to see and tell your friends about. I rate this one 9/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre",
        "duration": "PT3M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2442461465",
        "name": "Married to It",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTQyZTNmMDgtNDdlNS00NmJlLTgwZGYtNmNkYTAxOGJjOTJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTQyZTNmMDgtNDdlNS00NmJlLTgwZGYtNmNkYTAxOGJjOTJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:58:11Z",
        "url": "https://www.imdb.com/video/vi2442461465/"
    },
    "url": "/title/tt0107523/"
}