{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woo-seong Kam",
            "url": "/name/nm1165487/"
        },
        {
            "@type": "Person",
            "name": "Uhm Junghwa",
            "url": "/name/nm1105090/"
        },
        {
            "@type": "Person",
            "name": "Park Won-sang",
            "url": "/name/nm1059154/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1138,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Marriage is a Crazy Thing",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043365/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073647/"
        },
        {
            "@type": "Person",
            "name": "Ha Yoo",
            "url": "/name/nm1168564/"
        }
    ],
    "datePublished": "2002-04-26",
    "description": "Jun-young (Kam Woo-seong) is a man in his early thirties who has seen his friends and younger brother get married but has yet to open himself to a serious relationship. Rather he is happy floating through life with little directio...",
    "director": [
        {
            "@type": "Person",
            "name": "Ha Yoo",
            "url": "/name/nm1168564/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA3MTMxNzU4Nl5BMl5BanBnXkFtZTcwNzgyMzQyMQ@@._V1_.jpg",
    "keywords": "blind date,heterosexual,sexual,erotica,teacher student relationship",
    "name": "Gyeolhoneun michinjishida",
    "original_info": {
        "id": "Marriage Is a Crazy Thing_2002",
        "name": "Marriage Is a Crazy Thing",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shu-fen"
        },
        "dateCreated": "2004-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0315930/"
        },
        "name": "Marriage Is a Calculative Thing",
        "reviewBody": "Hip hip hurray! Quite a number of modern Japanese, Korean and Taiwanese women should feel pretty happy after seeing the retributive act of Yeon-hee to \"men\". She fulfils many women's wishes of money and sex, though not from one body but two (or even more if one dares ^-^): getting hold of her doctor husband's money, social status and the sexual satisfaction with Joon-young, in addition, without being noticed or caught.\n\nThough achieving better economy and international status, South Korea is basically a patriarchal, Confucius and conservative society where every family tries hard to keep everything in harmony, no matter true harmony or artificial. In general, women still don't have many to choose for their life, to have a \"capable\" (money + well-respected job like medical doctor or lawyer, and so that's why Joon-young is the odd man out on Yeon-hee's marriageable-men list) husband henceforth a stable family is still the ultimate destination of their life (even though it is already 21st century today and the tenth planet has been discovered in the Solar System we are living in). Many Korean women struggle to tolerate their husbands' affairs, no matter that's long or short term fun because financially they maybe depend on their husband to have a better or even luxurious life, or they just don't want to lose face even the marriage has become nominal. Seeing Yeon-hee's devilish but \"elegant\" machinations, the repressed women may give their cheer and applause.\n\nThe wedding at the beginning is a telling symbol that \"marriage\" is the pillar shoring up the society and human relationship. People still holds the thought that the elder in the family should be married off before the other younger ones. Joon-young somehow is true to himself, he doesn't want to commit to something he doesn't believe, unlike his brother, who is getting married with his fiancée and struggling painfully to keep the dangerous fire burning with his old flame. Hypocrite!\n\nHormone ignites the libido but heart searches for truth. While the campus hunk is in perplexity and her nerd hubby in the dark, she is the one who has the last laugh. Every play has its ending, happy or not. Joon-young needs to think about the ending with this merry wife of another man.\n\nEven since the Korean TV soap opera \"Autumn in my heart\" (\"Gaeul donghwa\") invaded Hong Kong in 2000, people here suddenly got crazy about the Korean pop culture: TV, electronic games and thousands and hundred of movies. You can see that many Korean movies on show in town but not other places. If Korean movies can reach the international stage, some credits should be given to Hong Kong film-makers, for sure, anyway.\n\nA good light entertainment for a Saturday afternoon, it just cost me US$0.13 to rent, what more can I ask for?\n\nOh, by the way, I am eager to know how Germaine Greer views this movie."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Marriage is Crazy Thing(2002)",
        "duration": "PT2M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1604824601",
        "name": "Main trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTg3MzQ3MTU4MV5BMl5BanBnXkFtZTgwOTg2MzM3MzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTg3MzQ3MTU4MV5BMl5BanBnXkFtZTgwOTg2MzM3MzE@._V1_.jpg",
        "uploadDate": "2014-12-17T22:45:05Z",
        "url": "https://www.imdb.com/video/vi1604824601/"
    },
    "url": "/title/tt0315930/"
}