{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carl Agee",
            "url": "/name/nm11396325/"
        },
        {
            "@type": "Person",
            "name": "Nigel Barber",
            "url": "/name/nm0053443/"
        },
        {
            "@type": "Person",
            "name": "John Callas",
            "url": "/name/nm2659620/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 418,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0388353/"
        }
    ],
    "datePublished": "2020-04-11",
    "description": "An epic journey revealing the real Mars, as you've never seen it before. Using data from orbiters and rovers to build accurate views of the red planet and uncover its secrets. On a single circuit of Mars from dawn to dusk, encount...",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Johnson",
            "url": "/name/nm1362703/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzg2ZjgxOWQtMDNjNS00NmQxLWFjYTYtMzRjMjdiNTA2NGE0XkEyXkFqcGdeQXVyNDQyNzc1MTg@._V1_.jpg",
    "name": "Mars: One Day on the Red Planet",
    "original_info": {
        "id": "Mars: The Red Planet Collection_2000",
        "name": "Mars: The Red Planet Collection",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "larryallred"
        },
        "dateCreated": "2020-11-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt12611334/"
        },
        "name": "1 out of 3",
        "reviewBody": "I'm a sucker for space science. I can get past the misleading ads and bait and switch plotlines as long as it looks cool and I learn something. There are two things that ruined this one for me.\n\nOne of the most important parts of any documentary is the narrator. I mean no disrespect to the fellow. I'm sure there's a good place for one who tries too hard to make the voice sound deeper, enunciates more harshly to make it seem more exciting and drones on so much that it takes away from the incredible imagery and discoveries.\n\nThen the \"trend\"... it started with America's Dumbest Criminals and has become a huge part of everything else. To break up a boring show add clips of people giving insight or opinion. They could be experts, wing-nuts, folks who have little or nothing to do with the program at all. Granted once in awhile there's a gem, a cute face, a tidbit of some sort, but a skillfully written and narrated documentary should hold your interest without having to resort to the latest tricks.\n\nHalfway through I started looking at my watch and taking breaks. Just before the end I turned off the sound. Those images are what I came for anyway, and they were great!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt12611334/"
}