{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tommy Kirk",
            "url": "/name/nm0456565/"
        },
        {
            "@type": "Person",
            "name": "Yvonne Craig",
            "url": "/name/nm0186051/"
        },
        {
            "@type": "Person",
            "name": "Byron Lord",
            "url": "/name/nm0520402/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1064,
        "ratingValue": 3.2,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062635/"
        },
        {
            "@type": "Person",
            "name": "Larry Buchanan",
            "url": "/name/nm0118041/"
        },
        {
            "@type": "Person",
            "name": "Tony Huston",
            "url": "/name/nm0404154/"
        }
    ],
    "datePublished": "1968-08-24",
    "description": "Dop leads his fellow Martians to Earth on an interplanetary quest for females. Dop proves that Martians have impeccable taste when one of his first conquests turns out to be sexy scientist Dr. Marjorie Bolen.",
    "director": [
        {
            "@type": "Person",
            "name": "Larry Buchanan",
            "url": "/name/nm0118041/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5NDY4Mzc0Ml5BMl5BanBnXkFtZTgwNTY2MDkwMzE@._V1_.jpg",
    "keywords": "theft,break in,car theft,subterfuge,gas station",
    "name": "Mars Needs Women",
    "original_info": {
        "id": "Mars Needs Women_1967",
        "name": "Mars Needs Women",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Uriah43"
        },
        "dateCreated": "2019-07-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060672/"
        },
        "name": "Mars Also Needs Better Actors and Writers",
        "reviewBody": "This film essentially begins with NASA receiving messages from outer space which upon being decoded read: \"Mars...needs...women\". Not long after that an alien from Mars named \"Dop\" (Tommy Kirk) teleports and explains the predicament his planet faces due to a mutation in their genes which doesn't allow females to be born to them. So with a race that is steadily dying the decision is made to send a handful of space travelers to Earth to acquire five female specimens. Unfortunately, rather than trying to understand their plight, the military leadership at NASA treats the situation as an invasion and as a result issues an order to kill or capture these aliens at all cost. Now rather than reveal any more I will just say that, while this low-budget science fiction film might possibly have been better received ten or fifteen years earlier, it definitely seemed out-of-place in 1967. And even then I may be giving it too much credit as the entire movie was rather boring from start-to-finish. To be more specific, there were too many scenes which focused on minor details and not enough on things that really mattered-like a decent script or a cohesive plot. Additionally, the acting and camera work were rather second-rate as well. In short, I don't consider this to be a good movie by any means and for that reason I have rated it accordingly. Below average.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0060672/"
}