{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ernest Borgnine",
            "url": "/name/nm0000308/"
        },
        {
            "@type": "Person",
            "name": "Betsy Blair",
            "url": "/name/nm0086198/"
        },
        {
            "@type": "Person",
            "name": "Esther Minciotti",
            "url": "/name/nm0591034/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25303,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074749/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0323142/"
        },
        {
            "@type": "Person",
            "name": "Paddy Chayefsky",
            "url": "/name/nm0154665/"
        }
    ],
    "datePublished": "1955-06-10",
    "description": "A middle-aged butcher and a school teacher who have given up on the idea of love meet at a dance and fall for each other.",
    "director": [
        {
            "@type": "Person",
            "name": "Delbert Mann",
            "url": "/name/nm0542720/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjgxMjQzZDYtNTk4NS00N2FhLWI5ZGQtM2ViOWNlNjYzODdhXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "dance hall,love,butcher,teacher,wallflower",
    "name": "Marty",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Nooshin_Navidi_MUSE"
        },
        "dateCreated": "2014-06-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048356/"
        },
        "name": "A timeless classic deserving of every award it won",
        "reviewBody": "On the surface, 'Marty' appears to be a simple love story about a butcher and a school-teacher, but there are many more layers to this film, which manages to be simultaneously funny & deeply moving without ever getting corny.\n\nThere's so much about this film that stands the test of time half a century later. It's no wonder it won so many awards that year (including 4 Oscars.) In her autobiography, Betsy Blair mentions that 'Marty' was the high point of her career; it made her a movie star overnight and she was never again in anything as important (though I thought her performance in 'A Delicate Balance' with Katherine Hepburn years later was even better.) She won the BAFTA for her role here, as did Ernest Borgnine, who deservedly swept every award that year for his role as Marty, including the Oscar and the Golden Globe. Borgnine is flawless in his performance & lovable from the very first scene. Esther Monciotti as his mother also delivers a standout performance. Some of the funniest and most memorable lines in the film belong to her and her on-screen sister. The rest of the supporting cast are also great to watch. The frank dialogue and the humanity of the characters make this a film you want to watch more than once.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Sentimental, heart-warming piece of Academy Award winning cinema...\n\nA beloved classic of American cinema, Delbert Mann's MARTY was the first ever recipient of the Palme d'Or at the 1955 Cannes Film Festival, as well as the winner of the Academy Award for Best Picture, one of only two films to ever win both organisations' grand prizes (the second being Billy Wilder's THE LOST WEEKEND).\n\n\"I've been looking for a girl every Saturday night of my life,\" says Marty Piletti (Ernest Borgnine, THE VIKINGS, VIOLENT SATURDAY). Yet, despite all his efforts, this 34-year old Bronx butcher remains as shy and uncomfortable around women today as on the day he was born. So when he meets Clara (Betsy Blair, IL GRIDO), a lonely school teacher who's just as smitten with him as he is with her, Marty's on top of the world. But not everyone around him shares his joy. And when his friends and family continually find fault with Clara, even Marty begins to question his newfound love... until he discovers, in an extraordinary way, the strength and courage to follow his heart. \n\nAdapted from an earlier teleplay written by renowned screenwriter Paddy Chayefsky (Network), Eureka Classics is proud to present MARTY in a special Dual Format edition, that includes the film on Blu-ray for the first time in the UK. The Special Features include the aforementioned teleplay broadcast on NBC in 1953, also directed by Delbert Mann and starring Rod Steiger in the title role.",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2597500953",
        "name": "MARTY (Eureka Classics) New & Exclusive HD Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmM5YzczMzItOGUzMS00NzM1LWIwNjYtYjZiNzJkMzQ5Y2ZlXkEyXkFqcGdeQXVyMTg2NTc4MzA@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmM5YzczMzItOGUzMS00NzM1LWIwNjYtYjZiNzJkMzQ5Y2ZlXkEyXkFqcGdeQXVyMTg2NTc4MzA@._V1_.jpg",
        "uploadDate": "2018-02-01T15:22:08Z",
        "url": "https://www.imdb.com/video/vi2597500953/"
    },
    "url": "/title/tt0048356/"
}