{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julie Andrews",
            "url": "/name/nm0000267/"
        },
        {
            "@type": "Person",
            "name": "Dick Van Dyke",
            "url": "/name/nm0001813/"
        },
        {
            "@type": "Person",
            "name": "David Tomlinson",
            "url": "/name/nm0866835/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 177174,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098836/"
        },
        {
            "@type": "Person",
            "name": "Bill Walsh",
            "url": "/name/nm0909556/"
        },
        {
            "@type": "Person",
            "name": "Don DaGradi",
            "url": "/name/nm0196119/"
        },
        {
            "@type": "Person",
            "name": "P.L. Travers",
            "url": "/name/nm0871308/"
        }
    ],
    "datePublished": "1965-06-18",
    "description": "In turn of the century London, a magical nanny employs music and adventure to help two neglected children become closer to their father.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Stevenson",
            "url": "/name/nm0829038/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Comedy",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmJkODczNjItNDI5Yy00MGI1LTkyOWItZDNmNjM4ZGI1ZDVlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "live action and animation,nanny,magic,female protagonist,banker",
    "name": "Mary Poppins",
    "original_info": {
        "id": "Mary Poppins_1964",
        "name": "Mary Poppins",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "orthogonal6"
        },
        "dateCreated": "2004-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058331/"
        },
        "name": "One for the ages",
        "reviewBody": "How good is Mary Poppins? I remember singing \"Let's Go Fly a Kite\" with my then four year old son when we first got it on a now-lost video. He is now a young man, and little brother is a teenager. I am going to buy the DVD for their children, who may not be born for ten more years. I'll watch it myself until then. It's that good. We all have opinions, and mine is that, in the long list of Disney classics and masterpieces, this one is at the top. It is the perfect combination of story, song, characters, actors, whimsy  you name it. I believe it is one of the best movies ever made in any genre.\n\nNeed proof? How many songs can you hum in the car or sing in the shower? Chim Chim Cher-ee; Spoonful of Sugar; Supercalifragilisticexpialidocious (thank God for copy and paste); Let's Go Fly a Kite. What about songs that put a lump in your throat and a tear in your eye? Feed the Birds. Great composing, great fit to the story. And Julie Andrews is as good a singer as you will find.\n\nMore proof? What about delightful scenes? A tea party on the ceiling. The fox hunt on merry-go-round horses. Dancing on the rooftops of London.\n\nMemorable characters? Bert, even with his horrible accent, is a blast. Old Mr. Dawes. Uncle Albert. Mrs. Banks, that independent woman (as long as it did not annoy Mr. Banks). Jane and Michael having the experience of a lifetime. And poor Mr. Banks, so concerned with being the lord of his castle but learning the important lessons in the nick of time. His illusion of control begins to unravel the moment that Poppins woman walked in the door, and he never figures out who she is and how she did it to him.\n\nNeither do we, really. She is both the cause of much madness but the stability within it as the story moves along. It is one of Disney's greatest talents to craft movies and stories that operate on multiple levels. Children love dancing penguins and fireworks. Adults may as well but they can register the message here of what is truly important in life. Poppins has the answers. It is better we don't analyze who she is  and or course she never explains anything. The Banks family is just glad she was there for a while, and we should be glad that Walt Disney left us with this masterpiece."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT 1E",
        "duration": "PT1M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2574362649",
        "name": "Mary Poppins: 50th Anniversary Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzhmOTEzZTctMmM3Yi00NDJkLWJiMDctM2Q1Zjg5YzEzMjAxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzhmOTEzZTctMmM3Yi00NDJkLWJiMDctM2Q1Zjg5YzEzMjAxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-12-13T07:49:12Z",
        "url": "https://www.imdb.com/video/vi2574362649/"
    },
    "url": "/title/tt0058331/"
}