{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Dylan",
            "url": "/name/nm0001168/"
        },
        {
            "@type": "Person",
            "name": "John Goodman",
            "url": "/name/nm0000422/"
        },
        {
            "@type": "Person",
            "name": "Jessica Lange",
            "url": "/name/nm0001448/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4871,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0377882/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076224/"
        },
        {
            "@type": "Person",
            "name": "Bob Dylan",
            "url": "/name/nm0001168/"
        },
        {
            "@type": "Person",
            "name": "Larry Charles",
            "url": "/name/nm0153078/"
        }
    ],
    "datePublished": "2003-08-08",
    "description": "A singer, whose career has gone on a downward spiral, is forced to make a comeback to the performance stage for a benefit concert.",
    "director": [
        {
            "@type": "Person",
            "name": "Larry Charles",
            "url": "/name/nm0153078/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTY4MDAxNDE3M15BMl5BanBnXkFtZTYwNjU1MDY2._V1_.jpg",
    "keywords": "concert,revolution,singer,jail,journalist",
    "name": "Masked and Anonymous",
    "original_info": {
        "id": "Masked & Anonymous_2003",
        "name": "Masked & Anonymous",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2005-12-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0319829/"
        },
        "name": "Gone Feral",
        "reviewBody": "This movie will mean little to you if you aren't my age (late fifties). That's because you actually had to be there when Bob Dylan was the most powerful man in the west, exchanging leadership with the merged Lennon and McCartney. Together they led us like no one had or has since in terms of immediacy.\n\nI'm talking about the period between his protest singing and his collapse into fundamentalism. From \"Tambourine Man,\" to \"Twist of Fate,\" with the John Wesley Harding period being his most profound. His method was simple, to let himself go and trust what he saw on the edges of his vision. It wasn't that he engineered himself to be at the front of us. Instead he advertised a small bit of conceptual thinking for the pop mind and we grew into it, in his direction almost as if by accident.\n\nThe point is that he was important, but never knew why. His insights and art were far more intelligent than he was. And when he fell into the fundamentalist stupor it probably seemed like a reinvention following all the others.\n\nThis business of not knowing is crucial to whether you should actually listen to him when he tries to say something.\n\nSo go and watch \"Renaldo and Clara\" which he co-wrote with one of our two greatest living playwrights. It has a grand shape, multiple people playing the same character; multiple characters played by the same person. Scintillating realities, shifting fundamentals. That's the Sam Shepard part. The Dylan part is so juvenile, so obtuse, so plain artless it carries its own message.\n\nAnd that's what we have here too. Except this time, the grand shape is by a cartoon writer instead of a master playwright. So we start with vapid notions of profundity. This writer believes that Dylan is still the man most thought he was 25 years ago. Even that was wrong: he simply saw rather than understood even then.\n\nWell, so we have this vast stroke of fate, Jake Fate (Twist of Fate, see?), this notion of the son of a broken God (John Wesley Harding, get it? nudge, nudge) and along the way scads of characters drawn to illustrate the various ways mankind has broken itself.\n\nThe good news is that many of these are played by first rate actors. Sam Shephard's wife has the role of \"presenter.\" But they are drawn so cartoonishly they miss any target they could have hit. They are not cinematic. This guy has no cinematic skills. They are not Dylanesque. Dylan has a very specific and consistent imagination that is more \"Hitchhiker's Guide\" than \"Seinfeld\" and \"The Tick.\"\n\nWe could have gotten an ensemble piece where talented actors synthesized their impressions of Dylan. Now that would have been cool, but they are kept separate.\n\nSo what we end up with is a lost soul who once was king, playing a lost soul who once was king, tries to recover  thinks he succeeds, fails miserably in front of our eyes and doesn't know it.\n\nTed's Evaluation -- 1 of 3: You can find something better to do with this part of your life."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Sony Pictures Classics",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3063415065",
        "name": "Masked And Anonymous",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTQyYzgxOGYtYzNiOS00MWNhLWEyMGEtZDE1ZjE1YzdmMjIwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTQyYzgxOGYtYzNiOS00MWNhLWEyMGEtZDE1ZjE1YzdmMjIwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:11:01Z",
        "url": "https://www.imdb.com/video/vi3063415065/"
    },
    "url": "/title/tt0319829/"
}