{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jimmy Wang Yu",
            "url": "/name/nm0911093/"
        },
        {
            "@type": "Person",
            "name": "Tien Wu Chu",
            "url": "/name/nm0160890/"
        },
        {
            "@type": "Person",
            "name": "Kang Chin",
            "url": "/name/nm0436340/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4626,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Master of the Flying Guillotine",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067226/"
        },
        {
            "@type": "Person",
            "name": "Jimmy Wang Yu",
            "url": "/name/nm0911093/"
        }
    ],
    "description": "After his students are killed by the One Armed Boxer, a vengeful and blind Kung Fu expert travels to a village where a martial arts contest is being held and vows to behead every one armed man he comes across.",
    "director": [
        {
            "@type": "Person",
            "name": "Jimmy Wang Yu",
            "url": "/name/nm0911093/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Action",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcwNjYxMDU2MV5BMl5BanBnXkFtZTgwNDAwMDM4ODE@._V1_.jpg",
    "keywords": "kung fu,psychotronic film,guillotine,cult film,violence",
    "name": "Du bi quan wang da po xue di zi",
    "original_info": {
        "id": "Master of the Flying Guillotine_1975",
        "name": "Master of the Flying Guillotine",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dee.reid"
        },
        "dateCreated": "2005-12-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0072913/"
        },
        "name": "\"Master of the Flying Guillotine\" is sick! This is definitely one for the ages!",
        "reviewBody": "\"As you may have gathered, a rational plot summary is pretty pointless - but rest assured there are epic martial arts battles and ludicrously inspired moments galore\" - IMDb plot summary.\n\n\"Master of the Flying Guillotine\" is one for the ages, no doubt. Those above words just about sum up everything there is to discover in this film. The plot is absolutely ridiculous and only lasts about five minutes total in the whole film. The rest of the movie is devoted to ludicrous yet well-staged action scenes that are sure to live long in memory after it's gone. \"Master of the Flying Guillotine\" is the most popular martial arts flick from the post-Bruce Lee age, and it's lingered for years on the late-night grindhouse circuit.\n\nI sat through the first five minutes and I fell out laughing. Mind you, I wasn't laughing because I couldn't believe it all (I couldn't) but because when you realize it, it's the most over-the-top kick to the head you'll ever experience. It's virtually impossible to take anything in the film seriously, but there's no way that should let you not walk away from it without getting something. The plot, as I mentioned before, is non-existent and any attempts in trying to rationalize the action are pretty pointless.\n\nThe plot can be summed up like this, in one sentence: After the beginning of the Ching Dynasty, the blind assassin, Fung Sheng Wu Chi (Kam Kang), goes on a murderous rampage, becoming a serial killer who starts offing one-armed fighters left and right, after receiving news (via carrier pigeon) that his two disciples have been murdered by the One-Armed Boxer (lead actor, writer, and director Jimmy Wang Yu) from the first film, and tracks his quarry to a martial arts tournament a la a plot device used in \"Enter the Dragon\" (1973).\n\nThat's about all there is to the plot. The Blind Assassin and his weapon of choice - the Flying Guillotine - a tethered device that looks like a hat is swung in any direction he chooses and hooks itself to a victim's head with the aid of razor-sharp blades on the inside and with one good jerk, he rips their head clean off. I don't think I mentioned that other than the fact he's blind, he is able to throw the flying guillotine with pin-point accuracy.\n\nOther unbelievable instances occur, including an Indian Fakir whose arms can stretch to twice his own body length, and in one sequence, the One-Armed Boxer battles a Muay Thai fighter (Tsim Po Sham) in a hut while his men light fires under it, essentially turning into a frying pan that literally gives both men hot feet. Then there's the equally unbelievable final confrontation between Wang and the Blind Assassin. The action is pretty bloody and intense, and the punching sounds are so exaggerated I honestly couldn't help laughing uncontrollably.\n\nIt's wildly insane stuff and it's no wonder Quentin Tarantino idolizes it so much and was able to pay some homage to it with his \"Kill Bill\" movies.\n\n10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0072913/"
}