{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Akira Kubo",
            "url": "/name/nm0473530/"
        },
        {
            "@type": "Person",
            "name": "Kumi Mizuno",
            "url": "/name/nm0594682/"
        },
        {
            "@type": "Person",
            "name": "Hiroshi Koizumi",
            "url": "/name/nm0463590/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3305,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Takeshi Kimura",
            "url": "/name/nm0454119/"
        },
        {
            "@type": "Person",
            "name": "Shin'ichi Hoshi",
            "url": "/name/nm0395948/"
        },
        {
            "@type": "Person",
            "name": "Masami Fukushima",
            "url": "/name/nm0298040/"
        }
    ],
    "datePublished": "1963-08-11",
    "description": "Shipwrecked survivors slowly transform into mushrooms.",
    "director": [
        {
            "@type": "Person",
            "name": "Ishirô Honda",
            "url": "/name/nm0393094/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGY0ODM0NjctZDU4OS00NmNlLWExZGUtY2E3ZjkyNWRhODU0XkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1_.jpg",
    "keywords": "ukulele,mushroom,radiation,mutation,disfigurement",
    "name": "Matango",
    "original_info": {
        "id": "Matango: Attack of the Mushroom People_1963",
        "name": "Matango: Attack of the Mushroom People",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kabumpo"
        },
        "dateCreated": "1998-12-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057295/"
        },
        "name": "Dark and Powerful",
        "reviewBody": "The cast of this film all consider it one of their proudest achievements. This film is about false friendships, utter hatred, and abandonment of values. Constructed from William Hope Hodgson's rather simple horror story, in which a man hailing a schooner for food tells how the virtuous (abstinent) unmarried couple (himself and his fiancee) were in a shipwreck and tried to make their home on an island encrusted with fungus, first in a ship and then in two tents on an unidentified sandy substance, only to eat the fungus and become it, takes on a whole new dimension by placing the man, here a psychology professor, and his student fiancee with a rich couple together only for the money, a serious writer, and the two-man crew. Though they never abandon the fungus-encrusted ship for tents, they soon become embittered over food, and the men all want the virgin, not the rich showgirl. Hodgson was on the way to becoming a minister before he was killed in WWI, and his story is explicitly Christian. This film takes out explicit religion (though the Japanese version has a brief scene related to Akiko's Shinto beliefs, which was deleted because most Americans wouldn't understand it), but retains the morals. The psychologist is unable to cope with the degrading values, particularly after the mate is shot over money (useless) and turtle eggs (food). The skipper takes the ship (which isn't his, Kasai wearing a captain's uniform to prove it (and how stuck up he is)) after repairing it, without anyone else, but he dies at sea, Murai soon finding the abandoned ship. The voyage reveals the true character of the relationships with one another, and their attempts to break down the virtuous couple, which ends with the psychologist in the asylum, where he tells his story. He gets succumbed, too. \"My friends are alive; I'm the one who died,\" he tells them. The crew dead, his friends are left on the island, slowly merging with the fungus...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0057295/"
}