{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rory Culkin",
            "url": "/name/nm0191412/"
        },
        {
            "@type": "Person",
            "name": "Ryan Kelley",
            "url": "/name/nm0445987/"
        },
        {
            "@type": "Person",
            "name": "Scott Mechlowicz",
            "url": "/name/nm1310709/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32583,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0109361/"
        },
        {
            "@type": "Person",
            "name": "Jacob Estes",
            "url": "/name/nm1096524/"
        }
    ],
    "datePublished": "2004-09-17",
    "description": "When a teen is bullied, his brother and friends lure the bully into the woods to seek revenge.",
    "director": [
        {
            "@type": "Person",
            "name": "Jacob Estes",
            "url": "/name/nm1096524/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjdhMDQwMTEtMmMyZC00Y2JjLWE5ODItOTM1NWNiOWQ4YTdhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "teenager,truth or dare,brother brother relationship,teen drama,coming of age",
    "name": "Mean Creek",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "anhedonia"
        },
        "dateCreated": "2004-09-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0377091/"
        },
        "name": "Intelligent, superbly acted and thoroughly absorbing",
        "reviewBody": "I knew next to nothing about this film when I went to see it. I knew it starred Rory Culkin, who was so good in 2000's best film, \"You Can Count on Me,\" and received some critical acclaim. But I knew nothing about the story and what a wonderful surprise \"Mean Creek\" proved to be.\n\nThis is an intelligent, engaging movie buoyed by some of the best acting by young actors this year. Writer-director Jacob Aaron Estes, who won a 1998 Nicholl Fellowship in Screen writing for his script, takes the basic premise of revenge against a school bully and turns it into a moving and gripping film. Incidentally, this is the second terrific movie to come out of that Nicholl class - the other was Karen Moncrieff's \"Blue Car,\" one of last year's best films.\n\nGiven the subject matter, \"Mean Creek\" could easily have been another after-school special masquerading as an indie feature. But Estes eschews the conventions of the genre to give his characters unexpected depth and create an engrossing morality play. None of his characters is a caricature; they're all flawed and unmistakably human. The moral issues they face are real and complex; the crises they create are dealt with expertly.\n\nWhat's special about \"Mean Creek\" are its fine young actors. Culkin again is convincing as a skittish young boy being picked on by the school bully, but the two startlingly brilliant performances are by Josh Peck as the bully George, and Carly Schroeder as Millie, the young girl unexpectedly dragged into the plot.\n\nPeck makes George captivating when he could just as easily made him a typical, one-note bully. Peck gives George substance and turns on the charm so well that we understand the others' reluctance to go through with exacting his comeuppance. George becomes likable, someone who seems to resort to bullying to hide inadequacies of his own. Peck draws us into his character; we feel sympathy for someone who is supposed to be unsympathetic.\n\nThe flaw in Estes' writing is that after making George someone who elicits compassion, Estes unwisely opts for an easy way out by forcing George to turn to his uglier side. Had George suddenly not turned mean, the moment would have been far more potent than it already is.\n\nYoung Schroeder is downright extraordinary. Her Millie is mature way beyond her years. She serves as the group's moral core and Schroeder's scenes in the immediate aftermath of a tragedy are so astonishingly raw, you're likely to forget she's a young teen actress. Hers is one of the best supporting performances the year. \n\n\"Mean Creek\" is one of the best coming-of-age films. All teenagers and their parents should see this, despite its R rating. It's unfortunate the MPAA gave \"Mean Creek\" an R rating because despite the use of the F-word, \"Mean Creek\" is far less offensive than much of the PG-13-rated garbage - the more recent \"Charlie's Angels\" movies, for instance - and provides more enjoyment and insight into human behavior in five minutes than almost any mainstream movie playing right now.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2141978905",
        "name": "Mean Creek",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTJiYjE0MTItNjllYi00Yzc4LTg3NTItMzg5NDcwNjk2Mzk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTJiYjE0MTItNjllYi00Yzc4LTg3NTItMzg5NDcwNjk2Mzk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:23:43Z",
        "url": "https://www.imdb.com/video/vi2141978905/"
    },
    "url": "/title/tt0377091/"
}