{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Cooper",
            "url": "/name/nm0000011/"
        },
        {
            "@type": "Person",
            "name": "Barbara Stanwyck",
            "url": "/name/nm0001766/"
        },
        {
            "@type": "Person",
            "name": "Edward Arnold",
            "url": "/name/nm0036427/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14078,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0135393/"
        },
        {
            "@type": "Person",
            "name": "Richard Connell",
            "url": "/name/nm0175028/"
        },
        {
            "@type": "Person",
            "name": "Robert Presnell Sr.",
            "url": "/name/nm0696190/"
        },
        {
            "@type": "Person",
            "name": "Robert Riskin",
            "url": "/name/nm0728307/"
        }
    ],
    "datePublished": "1941-05-03",
    "description": "A penniless drifter (Gary Cooper) is recruited by an ambitious columnist (Barbara Stanwyck) to impersonate a non-existent person who said he'd be committing suicide as a protest, and a social movement begins.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Capra",
            "url": "/name/nm0001008/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjJmOGYwNmItMjI5MS00ZGE2LWJlNDUtODZjYTBjNGQ1MTg5XkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_.jpg",
    "keywords": "typewriter,fired from a job,finger across throat,sign painter,free press",
    "name": "Meet John Doe",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbill-74877"
        },
        "dateCreated": "2018-09-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0033891/"
        },
        "name": "A little heavy-handed, but a wonderful film",
        "reviewBody": "Director Frank Capra lays it on pretty thick here, with a message combining the love of one's fellow man, the need to defend America's freedoms, and the power of common people to stand up to the rich and powerful when they band together and act out of decency and truth. This is a film filled with big idealistic speeches and moments meant to stir the heart. Capra knew that the democracy faced threats all over the globe as WWII loomed, but also that America, like any other country, faced threats within, that it was possible that an authoritarian may rise to power here by exploiting the masses, and controlling the media. This was a real possibility in the 1940's, and of course, is still relevant today. \n\nIt's very telling that at the beginning of the movie, a newspaper is being taken over by a rich industrialist, who wants to stimulate circulation at any cost. The plaque outside the building reading \"A free press means free people\" is chiseled away, and replaced with one reading \"A streamlined newspaper for a streamlined age.\" When a plucky young reporter (Barbara Stanwyck) keeps her job only by writing a fake letter from a John Doe, we're at first led to believe that the deception is for the better, because she uses the resulting column to push altruistic messages extracted from her late father's old writing. She and the newspaper editor (James Gleason) hire a local vagrant (Gary Cooper) to play the part of John Doe, and the message expands and catches on, so much so that 'John Doe Clubs' are being formed all over the country.\n\nThe message they push is one against all sorts of ills: the collapse of decency, corruption in local politics, graft in state relief, and hospitals shutting their doors to the needy. The idea is that if people could live up to Christian ideals all year round, rather than just at Christmas-time, that if they could simply 'love thy neighbor' and exercise tolerance for one another, they would not only feel better about life, but it would solve some of society's problems. All seems well, but lurking is the rich industrialist (Edward Arnold) funding the whole thing, initially for what seems to be the common good, but sure enough, he has ulterior motives. Thus, love your fellow man, but beware those seeking to control you. And for all his optimism and faith in man, Capra knew that a mob whipped into a frenzy was dangerous, and there are some dark elements in the film.\n\nEdward Arnold is brilliant as the industrialist, and Gleason is excellent as the editor. The two of them turn in great performances in their supporting roles, with Gleason's speech while drunk (\"Yep, I'm a sucker for this country...\") is one of the film's strongest. He extols the idea that the freedoms enjoyed in America to speak and live freely were important, and far preferable to the totalitarian governments at both ends of the political spectrum in the world (e.g. Fascist Germany and the Communist Soviet Union). If that sounds like a nationalistic message it is, but it was appropriate for the period, and more than balanced out by the socialist and anti-materialistic messages. \n\nBarbara Stanwyck is a delight to watch as always, and 1941 was a fantastic here for her ('Ball of Fire', also with Cooper, and 'The Lady Eve' came out that year). She's a wee melodramatic in the film's final scene though. Gary Cooper is just average in playing the bumbling everyman, and not as strong as Jimmy Stewart in similar roles for Capra. He is awkward and wide-eyed too often, especially early in the film. On the other hand, he shows a little bit of a devilish side in his subconscious, describing a dream of spanking Stanwyck at length (a scene which is a little odd). His best exchange with Stanwyck occurs when he senses she's also corrupt, and asks her \"Did you write this?\", referring to his next speech, she confesses yes but \"I had no idea what was going on\", and he pushes past her, remarking \"That's a swell bracelet you're wearing,\" noticing the expensive gift she's received. He then proceeds to stand up to a group of powerful men, speaking for the little guy (\"I'm just a mug and I know it. But I'm beginning to understand a lot of things. Why your types are as old as history. If you can't lay your dirty fingers on a decent idea, and twist it and squeeze it and stuff it into your own pocket, you slap it down! Like dogs! If you can't eat something you bury it!\")\n\nIf it's not already apparent, if you're cynical by nature, this is probably not the film for you. And, I have to say, Capra uses just a teensy bit too much of a heavy hand here, among other things likening John Doe to Jesus Christ (you know, that other great socialist who preached love and tolerance). However, he also has brilliant moments when he lets everything linger, such as when the crowd is disillusioned and wonders who is telling them the truth. That moment is simply spellbinding. Solid film, with wonderful messages.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A man needing money agrees to impersonate a non-existent person who said he'd be committing suicide as a protest, and a political movement begins.",
        "duration": "PT2M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2536358169",
        "name": "Original Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGNjZGIxMjEtMzE0Zi00OTU1LWFiYzAtN2JkMjVmMjFiNjJjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGNjZGIxMjEtMzE0Zi00OTU1LWFiYzAtN2JkMjVmMjFiNjJjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-12-15T16:04:29.953Z",
        "url": "https://www.imdb.com/video/vi2536358169/"
    },
    "url": "/title/tt0033891/"
}