{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gyu-ri Kim",
            "url": "/name/nm0453612/"
        },
        {
            "@type": "Person",
            "name": "Park Yejin",
            "url": "/name/nm0661975/"
        },
        {
            "@type": "Person",
            "name": "Yeong-jin Lee",
            "url": "/name/nm0498488/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3494,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "Memento Mori",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046745/"
        },
        {
            "@type": "Person",
            "name": "Jung-Ok In",
            "url": "/name/nm0408328/"
        },
        {
            "@type": "Person",
            "name": "Tae-yong Kim",
            "url": "/name/nm0453707/"
        },
        {
            "@type": "Person",
            "name": "Kyu-dong Min",
            "url": "/name/nm0590855/"
        }
    ],
    "datePublished": "1999-12-24",
    "description": "In this second installment of the Whispering Corridors series, a young girl finds a strange diary, capable of arousing hallucinations, kept by two of her senior fellow-students who seem to have an unusually close bond.",
    "director": [
        {
            "@type": "Person",
            "name": "Tae-yong Kim",
            "url": "/name/nm0453707/"
        },
        {
            "@type": "Person",
            "name": "Kyu-dong Min",
            "url": "/name/nm0590855/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Horror",
        "Romance",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGFhMGVkY2QtNTUxNy00NTdmLWE3ZDYtMjQyZWYxNzQwMzMzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "lesbian,sex,teen suicide,bloodstain,drink thrown into someone's face",
    "name": "Yeogo goedam II",
    "original_info": {
        "id": "Memento Mori_1999",
        "name": "Memento Mori",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "supernova88"
        },
        "dateCreated": "2001-09-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0266075/"
        },
        "name": "I don't know why I love it so much, but I do.",
        "reviewBody": "I have seen Memento Mori twice at the Melbourne International Film Festival and I think it's a very good film. My first impression of it was that it's quite like Virgin Suicides meets Carrie. And i maintain that it weaves between the romance and horror genres very effectively. I have not seen the original Yeogo Goedam but i assume it was more of a straight horror.\n\nBecause of it's genre crossing, Memento Mori adds to the horror theme of Shi-eun's return a sadness and tenderness that coagulates very strangely, but effectively with the terror-filled images of Shi-eun's body on the ground, and her haunting of the school. I really like the love story, but i see it as a horror film about adolescent love.\n\nI had the privilege to speak to one of the directors, Kyu-Dong Min at the festival, and he said the film was supposed to tap into the horror of being an adolescent. Which i think he and his co-director do very well. the school-girl scenes are all extremely realistic. Some parts are humorous but humour is placed so tightly in the middle of horror that things shift so quickly.\n\nthe production design must be commended. I particularly love the piano design at the end of the film. With the diary, however, (i know, it's really good), but Kyu-Dong Min actually mentioned that they researched heaps of teenage girls' diaries and many were much more elaborate than the one they made for the film. just a sneak.\n\nThe cinematography too, should gain praise. Most parts are shot with stark whites, blacks and deep greens and it's really effective in bringing out the emptiness of the school in the lives of Shi-eun and Hyo-shin. But it is also the photography of the two girls on the roof during sunset really got me. when you first see it, it's a love scene - they walk left and right, playing with socks and all. And when you see it at the end of the film, it becomes a nostalgic scene.\n\nLastly, i must praise the acting of all three leads. Kim Min Sun is really likeable as Min-ah. Lee Young-Jin showed great control as the living dead girl and Park Yeh-jin arguably holds the whole film's acting performances together, both in terms of performance and narrative.\n\nI really like Memento Mori. So far, it's in my top 3 films of the year. It's not exceptional. It's not one of those films with fantastically rapturous visual imagery, complex structure, or profound philosophical narrative. In fact, i don't know why i like the film as much as i do - apart from what i've just mentioned above. but i do. if i could see it again, i would. 9 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Tartan Films",
        "duration": "PT2M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2511077657",
        "name": "Memento Mori",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWE3ZjA3ODAtMDMyMC00Yzk5LTg5OGQtZWFiM2FjNDkxMzI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWE3ZjA3ODAtMDMyMC00Yzk5LTg5OGQtZWFiM2FjNDkxMzI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:24:10Z",
        "url": "https://www.imdb.com/video/vi2511077657/"
    },
    "url": "/title/tt0266075/"
}