{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Ryan",
            "url": "/name/nm0752813/"
        },
        {
            "@type": "Person",
            "name": "Aldo Ray",
            "url": "/name/nm0712731/"
        },
        {
            "@type": "Person",
            "name": "Robert Keith",
            "url": "/name/nm0445290/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2869,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020850/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        },
        {
            "@type": "Person",
            "name": "Ben Maddow",
            "url": "/name/nm0534693/"
        },
        {
            "@type": "Person",
            "name": "Van Van Praag",
            "url": "/name/nm0887753/"
        }
    ],
    "datePublished": "1957-01-26",
    "description": "During the Korean War, a battle-worn lieutenant and his platoon are behind enemy lines, and have orders to march to Hill 465 for possible relief.",
    "director": [
        {
            "@type": "Person",
            "name": "Anthony Mann",
            "url": "/name/nm0542649/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjZhM2Y0MzYtMzJkNy00MDRkLWFkZjUtNzBjYTU5ZmE4ZjMxXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "nco,squad,pedestrian,year 1950,american in asia",
    "name": "Men in War",
    "original_info": {
        "id": "Men in War_1957",
        "name": "Men in War",
        "year": "1957"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secondtake"
        },
        "dateCreated": "2017-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050699/"
        },
        "name": "Understated, realistic, rather stunning in its restraint",
        "reviewBody": "Men in War (1957)\n\nTake a small group of survivors in a hardscrabble part of Korea during that neglected war and watch them squabble and worry and scramble to stay alive. \n\nThis is an admired war movie for the simple reason that it is shorn of romanticism or heroism. Not that there aren't heroic acts, and true intelligence in expert soldiering. But the acting is vivid and honest, not pandering to our need for greatness in ordinary men. And the result is that these ordinary men are great. \n\nRobert Ryan is the star here, and he earns his keep. A smart, stubborn, hardened officer who knows the chips are down and isn't going to give in to excess or despair. The dry, open landscape with a few trees and some distant hills is almost a symbol for the movie, plain and unadorned, nothing unnecessary. The other actors are sharply seen, as well, some desperate and losing their grip, others just scared and watching, others subtle and observant. \n\nAnthony Mann is best known in the 1950s for his Westerns, and this isn't so far from that kind of landscape and battle to survive. His earlier film noir experience must have also taught him about storytelling and character. This is sharply seen and directed. The Pentagon hated it (because it shows a disorderly military unit, according to Wiki), and wouldn't help in the production, so the only real equipment in use here is a Jeep and some guns. And this helps in the end, since it forces the movie to focus on character and the ensemble acting.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0050699/"
}