{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cuba Gooding Jr.",
            "url": "/name/nm0000421/"
        },
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "Charlize Theron",
            "url": "/name/nm0000234/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 119923,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068765/"
        },
        {
            "@type": "Person",
            "name": "Scott Marshall Smith",
            "url": "/name/nm0809899/"
        }
    ],
    "datePublished": "2000-11-10",
    "description": "The story of Carl Brashear, the first African-American U.S. Navy Diver, and the man who trained him.",
    "director": [
        {
            "@type": "Person",
            "name": "George Tillman Jr.",
            "url": "/name/nm0863387/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjkxZGVmNzQtYjE0OC00MzVlLTkxODYtNzdkMjE3MmZjYjUxXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "african american,racial discrimination,1960s,hatred,prosthetic leg",
    "name": "Men of Honor",
    "original_info": {
        "id": "Men of Honor_2000",
        "name": "Men of Honor",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chrisbrown6453"
        },
        "dateCreated": "2002-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0203019/"
        },
        "name": "Much like the spirit of films like The Hurricane and Glory, Men of Honor grips us and makes us really feel for a man struggling to make his dream come true.",
        "reviewBody": "Men of Honor stars Cuba Gooding Jr., as real life Navy Diver Carl Brashear who defied a man's Navy to become the first African American Navy Diver. Sometimes by his side and sometimes his adversary there was one man who Carl Brashear really admired. His name was Master Chief Billy Sunday (Robert DeNiro). Sunday in a lot of ways pushed, aggravated and helped Carl become the man he wanted to be. \n\nI loved Cuba in this film. His portrayal here is as liberating and as powerful as Denzel Washington was in The Hurricane. Through every scene we can see his passion, motivation and stubbornness to achieve his dream. We can see the struggle within in him as he embarks to make his father proud. I also loved how the director created and brought forth a lot of tension in some of the key diving scenes. Brashear's encounter with a submarine during a salvage mission is heart-stopping and brilliant. \n\nThe only fault I could see would have to lie in the supporting cast. Cuba and DeNiro's characters are very intricate and exciting to watch. Which does make you a little sad when they have to butt heads with such two-dimensional supporting characters. The evil Lt. Cmdr. Hanks, Sunday's wife (Charlize Theron), the eccentric diving school colonel (Hal Holbrook) and Cuba's love interest are the characters I found to not have very much depth. What could have made these characters more substantial and more effective was a little more time to develop them. Why was that colonel always in his tower? How come Sunday's wife was so bitter and always drunk?\n\nAnother curious question has to be this. What happened to Carl Brashear's wedding? I mean if this film is chronicling this man's life wouldn't his wedding be an important event? Maybe it's just me. Men of Honor, however, is a perfect example of the triumph and faith that the human spirit envelops. This film will inspire and make you feel for this man's struggle. Which I do believe was the reason this powerful story was told. My hat goes off to you Carl Brashear. I really admire your strength.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from 20th Century Fox",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2158756121",
        "name": "Men of Honor",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTEyZTY0MzYtMjVmZC00MjNiLThjNWYtMDQwNjEyMTkwNjExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTEyZTY0MzYtMjVmZC00MjNiLThjNWYtMDQwNjEyMTkwNjExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:24:17Z",
        "url": "https://www.imdb.com/video/vi2158756121/"
    },
    "url": "/title/tt0203019/"
}