{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jim J. Bullock",
            "url": "/name/nm0120160/"
        },
        {
            "@type": "Person",
            "name": "Thom Cagle",
            "url": "/name/nm0128542/"
        },
        {
            "@type": "Person",
            "name": "Bryan Dattilo",
            "url": "/name/nm0202182/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 83,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "datePublished": "2004-09-07",
    "description": "Collection of seven gay men's shorts",
    "director": [
        {
            "@type": "Person",
            "name": "S. Leo Chiang",
            "url": "/name/nm0156981/"
        },
        {
            "@type": "Person",
            "name": "Maryam Karimi",
            "url": "/name/nm2089996/"
        },
        {
            "@type": "Person",
            "name": "Larry LaFond",
            "url": "/name/nm0480932/"
        }
    ],
    "genre": [
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGM3OTg3M2MtOGY5OS00NWJjLWJmMDEtYzE4ZWM2Mjc5ZTdmXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1_.jpg",
    "keywords": "gay,parody,masturbation,homosexual,gay bar",
    "name": "Men's Mix 1: Gay Shorts Collection",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aussie Stud"
        },
        "dateCreated": "2005-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0436584/"
        },
        "name": "Sub-par collection of seven short films with gay themes.",
        "reviewBody": "This collection of short gay films was half entertaining. The first few films were cute, one was actually very good. The remaining films were borderline terrible including one that absolutely stank.\n\nThe first story is \"Burls\", a cute tale narrated by Mark Hammill about a young pre-teen boy (who eerily resembles a young Jodie Foster) growing up in the 1960's, his eyes opening up after seeing a group of drag queens walking down the street, or \"boys dressed up as girls\" (hence the title \"Burls\"). We then follow his identity awakening as he tries on his mother's clothes and make-up, fantasizes about the hot young male working at the pet store and a run-in with what appears to be two revolting pedophiles (one in a gym locker room, the other in a car). This short was actually cute save for the rather abrupt ending.\n\nThe second story is \"Touched\" which is the best short film in the collection. It is about a middle-aged male who picks up a younger male in a night club, only to discover that the younger male has a different agenda. There are a lot of emotions in this one short, particularly concerning the middle-aged male. His agenda is to just \"touch\" someone out of loneliness, to be with someone, if only for an encounter. What happens when the two men reach out to each other is very powerful.\n\nThe third story is \"10 Pesos\" which really isn't \"gay\" at all (except for one scene involving an old man and a john). It's basically a short film that follows the path of a peso bill that travels through different hands and situations, starting in a night club and ending up in the street. The ending is actually quite stupid and I'm not even sure what the director was aiming for with all the money blowing around in the air.\n\nThe fourth story is \"Safe Journey\", and this is where the collection starts to go downhill. It is about a young man who gets beaten up on the street and seeks refuge in the home of a blind Asian man. The Asian man is seen at the beginning praying and reading braille, when by chance the young man who shows up in his house has some sort of connection to his prayers. There is supposed to be some sort of spiritual (though non-sexual) connection between the two via Buddhism or some Chinese God, but it's actually quite laughable really.\n\nThe fifth story is \"Shaving The Castro\", a rather boring documentary short on a barbershop that was established in San Francisco's Castro district in the 1940's with a clientèle of children and families, and how time has changed since then as the community is now predominantly gay.\n\nThe sixth story is \"Gaydar\", an absolutely horrid abomination concocted by someone who obviously never got past Judy Garland and every other gay stereotype known to man. For those of you not in the know, \"Gaydar\" is a term often referred to in the gay community as a gift to detect those who are gay and those who are not. The short itself is about a completely obnoxious gay office worker who discovers a \"Gaydar gun\" at a yard sale run by none other than Jim J. Bullock (in yet another grating and poorly-acted performance), who decides to take the gun to work and use it on a co-worker of whom he has the hots for.\n\nUnfortunately, this short just wasn't funny. Not only did the stereotypes get old REAL fast, but the characters were obnoxious, unsympathetic and screechingly vile, particularly the main character. And if that wasn't bad enough, Charles Nelson Reilly showing up in a completely embarrassing cameo as the main character's uncle was the absolute worst. What, wasn't Rip Taylor available? All the gay men are portrayed as big screaming queens, and the African-American co-worker had her sass down pat, right down to the \"Mmmmmm-hmmmm!\" and \"Oh no you dz'int!\". This short should have been scrapped as it brings down the entire collection. It is neither funny nor witty.\n\nThe seventh and final short is \"Masturbation\", a tongue-in-cheek satire on 1940's sexual health info-reels on masturbation techniques, including how-to tips on home-made devices carved out of cucumbers and sponges (let your imagination fill you in). The acting although intentionally cheesy mirrors that of a bad porno, and the short itself isn't all that funny either.\n\nSo basically the first two shorts are worth watching, but the rest are pretty bad. I'm not sure if this is worth the rental fee, but there's worse things to do on a night when there's nothing else to do.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0436584/"
}