{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dianne Wiest",
            "url": "/name/nm0001848/"
        },
        {
            "@type": "Person",
            "name": "Jane Birkin",
            "url": "/name/nm0000945/"
        },
        {
            "@type": "Person",
            "name": "Stanislas Merhar",
            "url": "/name/nm0580720/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 576,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055367/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086853/"
        },
        {
            "@type": "Person",
            "name": "Andrew Litvack",
            "url": "/name/nm0514817/"
        }
    ],
    "datePublished": "2003-12-03",
    "description": "A hot young phone sex addict and his narcissistic opera diva mom. A dangerously agitated hustler and a half-dozen dangerously agitated hustlers who look just like him. A tittering neurotic who thinks she's Vanessa Redgrave and Van...",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Litvack",
            "url": "/name/nm0514817/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ3NzE0NzY0NF5BMl5BanBnXkFtZTcwNzYyNjgyMQ@@._V1_.jpg",
    "keywords": "hustler,diva,lesbian,turandot,rent boy",
    "name": "Merci Docteur Rey",
    "original_info": {
        "id": "Merci Docteur Rey_2002",
        "name": "Merci Docteur Rey",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "talltale-1"
        },
        "dateCreated": "2005-08-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338249/"
        },
        "name": "And thank YOU, Andrew Litvak!",
        "reviewBody": "With a cast this good--and diverse--and a director who may not know how (or care) to produce standard comedy effects but clearly understands how to give good performers their best chance, MERCI DOCTEUR REY will probably become one of those movies that 10 per cent of us call classic and the other 90 loathe. Count me among the 10.\n\nA low-key paean to the delights of narcissism and diva-dom and a clever rap on the knuckles of sloppy psychotherapy, \"Merci\" brings together Dianne Wiest as an opera-star mom, her adorable son (Stanislas Merhar of \"Dry Cleaning\" fame), Jane Birkin as the titular shrink's patient, Bulle Ogier as an opera director, Simon Callow as \"the man\" and a great cameo from Vanessa Redgrave. (Even Jerry Hall seems at home in this illustrious company!) Writer/director Andrew Litvak has assembled a screw-ball comedy where the chuckles start small; if you're still there by film's ends (it has around four of them, but since three are hilarious, you won't mind), you may be sporting a grin as wide as your face.\n\nThe biggest gem among these actor jewels is Jane Birkin. Is there another performer who can use her gawky, horsey charm to such wonderful effect? Don't think so. The \"wallflower\" scene alone is worth a world of lesser movies. Merchant/Ivory-produced, the film didn't even make it into specialized release (though it appears to have been popular at certain film festivals). Thank god for DVDs!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0338249/"
}