{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liam Neeson",
            "url": "/name/nm0000553/"
        },
        {
            "@type": "Person",
            "name": "Aidan Quinn",
            "url": "/name/nm0001644/"
        },
        {
            "@type": "Person",
            "name": "Julia Roberts",
            "url": "/name/nm0000210/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32374,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0120075/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018776/"
        },
        {
            "@type": "Person",
            "name": "Neil Jordan",
            "url": "/name/nm0001403/"
        }
    ],
    "datePublished": "1996-10-25",
    "description": "Neil Jordan's historical biopic of Irish revolutionary Michael Collins, the man who led a guerrilla war against the UK, helped negotiate the creation of the Irish Free State, and led the National Army during the Irish Civil War.",
    "director": [
        {
            "@type": "Person",
            "name": "Neil Jordan",
            "url": "/name/nm0001403/"
        }
    ],
    "duration": "PT2H13M",
    "genre": [
        "Biography",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjE5NGFmMGYtNmU1MC00ZWQxLWIzMzEtZjgzZjljMWNmYjE1XkEyXkFqcGdeQXVyNTYzNDI3MzQ@._V1_.jpg",
    "keywords": "irish history,1916 easter rising,irish independence,irish republican army,british soldier",
    "name": "Michael Collins",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "poc-1"
        },
        "dateCreated": "2006-03-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117039/"
        },
        "name": "Deeply flawed but compelling",
        "reviewBody": "I saw this first in the now defunct Capitol Cineplex in Cork. I was surprised to see so many senior citizens in the cinema. The cineplex was so scummy it had to be something special to draw them in. Some of them might have been old enough to remember the civil war or at least to have had a close family member killed in it. Many of them were clearly moved by it particularly the end with its archive footage. It is a moving film, but you have to be careful. \n\nOne should never confuse history with entertainment and this is not a history lesson. All the major events are there, but there is a horrible bias from the director. I don't like DeValera or what he stood for, but what was hinted at the end in this movie is a travesty. If such a thing is true, you have to prove it, you can't slyly hint at it. There are other insidious things such as mortars and car-bombs which are clear reference to the 1970s-90s Northern conflict. Such weapons did not exist in 1916. To me this is an oblique way of implying that the Provos are somehow the legitimate heirs of the IRA in 1916 which of course they are not. \n\nDespite this I enjoyed the movie a lot. The production values and acting was so good, it really felt like a timewarp. Neil Jordan is a great director, Neeson and Rickman are superb in their parts. Rickman looks so much like DeValera it is uncanny. I even liked Julia Roberts. It looks like she made a fair attempt at a Dun Laoghaire accent and of course it sounded phony. Southside Dublin accents all sound phoney to me anyway so I didn't mind. The best moment was the scene where Collins starts the civil war sitting behind a howitzer aimed at the Four Courts and fires. You can see a huge explosion and bits coming out portico. I actually felt scared that they had damaged this famous Dublin landmark. This won't mean much to someone from overseas, but anyone familiar with the Four Courts and the resident lawyers (sorry \"barristers\") in their eighteenth century costumes would surely enjoy firing an artillery piece at the overpaid clowns. I wish I had a howitzer like that.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Michael collins",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3650683161",
        "name": "Michael Collins",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTMwMTI0NGMtNmEwMC00Njg3LWJlZWMtMjAyZmJiMDAzMGIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTMwMTI0NGMtNmEwMC00Njg3LWJlZWMtMjAyZmJiMDAzMGIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:15:21Z",
        "url": "https://www.imdb.com/video/vi3650683161/"
    },
    "url": "/title/tt0117039/"
}