{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Douglas Hodge",
            "url": "/name/nm0388061/"
        },
        {
            "@type": "Person",
            "name": "Juliet Aubrey",
            "url": "/name/nm0041411/"
        },
        {
            "@type": "Person",
            "name": "Trevyn McDowell",
            "url": "/name/nm0568329/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2586,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        }
    ],
    "datePublished": "1994-01-12",
    "description": "Middlemarch is a story of provincial life on the brink of momentous change and a deeply moving saga about a group of people striving to give meaning and value to their lives during the Industrial Revolution.",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcyNzAyMDA0M15BMl5BanBnXkFtZTcwMDkwMjgyMQ@@._V1_.jpg",
    "keywords": "period drama,card game,dysfunctional marriage,vote,victorian era",
    "name": "Middlemarch",
    "original_info": {
        "id": "Middlemarch_1994",
        "name": "Middlemarch",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "HotToastyRag"
        },
        "dateCreated": "2021-02-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0108858/"
        },
        "name": "Interesting story, a classic",
        "reviewBody": "George Eliot's classic was brought to life by BBC's miniseries in the early '90s. Starring Juliet Aubrey, the heroine who knows what's expected of her but can't ignore her heart, this compelling story is a must-watch (or must-read) for anyone who loves the genre. Social constraints, class structures, gossip, and daring melodrama feels right at home in this time period.\n\nMy heart completely went out to Patrick Malahide, though, so as much as I enjoyed watching this six-parter, I wasn't able to root for the other fellows. Patrick was just so sorrowful! Juliet marries him and is quickly disappointed in their marital life. He's a boring and strict reverend, but she knew exactly what she was getting when she accepted his proposal. In fact, she was drawn to his intellect from the beginning and wanted to learn from him. It turns out he's rather private and doesn't want to have lengthy, intellectual discussions with her; but is that really the end of the world?\n\nFor Juliet, it is. She wants more from her marriage. She has a brain, and she wants her husband to appreciate it as much as she does. But while she enjoys friendships with both the new doctor in town, Douglas Hodge, and her husband's cousin with a bad reputation, Rufus Sewell, it's less harmless than she thinks it is. Poor Patrick is also disappointed by his wife's behavior, and he sits at home with a broken heart when she's out galivanting and embarrassing him.\n\nThere's a lot more to this miniseries, though, and you'll be entertained by all the delightful characters and plot twists. It's always interesting to see the change in a town due to a railroad station. Progress also brings undesirable elements to an otherwise happy and peaceful community, and some people resent the modernization. You'll see Robert Hardy, Jonathan Firth, Elizabeth Spriggs, Trevyn McDowell, and more familiar faces. And does the voice of George Eliot sound familiar? It's Judi Dench!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Middlemarch (German Trailer)",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1601289497",
        "name": "Middlemarch (German Trailer)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzYzN2VmMmMtMWJkNi00ZTlkLTk5NWEtOThhMzk1YWJmODZkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzYzN2VmMmMtMWJkNi00ZTlkLTk5NWEtOThhMzk1YWJmODZkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-12T23:04:17.076Z",
        "url": "https://www.imdb.com/video/vi1601289497/"
    },
    "url": "/title/tt0108858/"
}