{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brad Davis",
            "url": "/name/nm0001113/"
        },
        {
            "@type": "Person",
            "name": "Irene Miracle",
            "url": "/name/nm0591968/"
        },
        {
            "@type": "Person",
            "name": "Bo Hopkins",
            "url": "/name/nm0005019/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 83303,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032235/"
        },
        {
            "@type": "Person",
            "name": "Oliver Stone",
            "url": "/name/nm0000231/"
        },
        {
            "@type": "Person",
            "name": "Billy Hayes",
            "url": "/name/nm0370907/"
        },
        {
            "@type": "Person",
            "name": "William Hoffer",
            "url": "/name/nm0388772/"
        }
    ],
    "datePublished": "1978-10-06",
    "description": "Billy Hayes, an American college student, is caught smuggling drugs out of Turkey and thrown into prison.",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Parker",
            "url": "/name/nm0000570/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDU1MjQ0YWMtMWQ2MS00NTdmLTg1MGItNDA5NTNkNTRhOTIyXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
    "keywords": "gay kiss,watching someone masturbate,social masturbation,1970s,prison drama",
    "name": "Midnight Express",
    "original_info": {
        "id": "Midnight Express_1978",
        "name": "Midnight Express",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Cinemanly"
        },
        "dateCreated": "2002-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077928/"
        },
        "name": "A Contemporary \"Jude Suess\"",
        "reviewBody": "Artistically, MIDNIGHT EXPRESS is quite well made... I do recall several media reports at the time of the film's release that led to contrary impressions, supporting the deliberate attempt by the filmmakers to do a hatchet job on the setting of this film. The first was Billy Hayes himself, when he first arrived on native soil, having pulled off his alleged escape; he said on TV, \"I like the Turks...it's the prison I had a problem with\" Easy to understand; few prisons are a joy ride, regardless of nation of origin. From this, I gathered he personally didn't have an animosity against the Turks, although MIDNIGHT EXPRESS goes out of its way to make everything negative about the country and culture. Only the \"Western\" characters are good and attractive, and the folks selected to play the Turks are corrupt, physically ugly and basically sub-human. The exterior scenes in Turkey itself have a grayish tint, implying the land is a hell-hole, and even the near-universally acclaimed cuisine gets a black eye.\n\nThe second thing from the (film's release) period I recall was a discussion on radio that claimed the prison Billy served time in was relatively modern, built in the mid-sixties... and not the Devil's Island PAPILLON setting depicted in the movie. (A 19th-Century British barracks in Malta was used for the prison.) Naturally, some artistic leeway is allowed here, since the movie's purpose is to paint a picture of a living nightmare.\n\nI recall reading the book years ago, and when our hero got his unfair sentence, naturally he was in despair... but at that moment, he felt an almost gallant, resigned acceptance. In contrast, when Billy gave his courtroom speech in the movie (which certainly was a defining moment of the film's ill-naturedness... to quote part of the speech: \"For a nation of pigs, it sure seems funny that you don't eat them! Jesus Christ forgave the bastards, but I can't! I hate! I hate you! I hate your nation! And I hate your people! And I f**k your sons and daughters because they're pigs! You're all pigs!\"), the three ugly judges actually hung their heads in shame. I wonder if there's a courtroom in any nation that would permit such a prolonged and loud outburst.\n\nThe August 30th post mistakenly referred to Turkey as an Arab nation.... so the user must not have seen \"Lawrence of Arabia,\" where the Arabs were the heroes and the Turks were the villains. It's interesting that in the rare Hollywood film where Arabs are portrayed \"positively,\" Turks still come across as barbaric.\n\nA Turkish-American friend has told me, contrary to what others here are thinking that the film couldn't really prejudice the viewer, that the film has achieved one of its purposes, to leave a sore, anti-Turkish taste in mouths. Keeping in mind that Americans are generally ignorant of the ways of many foreign nations, this film continues, even today, of being the only source of information most Americans have about Turkey. As cinematically effective and wonderfully made this film is, there's a disturbing side to MIDNIGHT EXPRESS that makes it mildly resemble a contemporary \"Jude Suess,\" or THE ETERNAL JEW (\"Der Ewige Jude\")."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Columbia Tristar",
        "duration": "PT1M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2878734617",
        "name": "Midnight Express",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWZhOTI3M2EtNGJlZC00OGY5LTk4YjgtOGZkZGE3MTY3ZTE0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWZhOTI3M2EtNGJlZC00OGY5LTk4YjgtOGZkZGE3MTY3ZTE0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:02:00Z",
        "url": "https://www.imdb.com/video/vi2878734617/"
    },
    "url": "/title/tt0077928/"
}