{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Cusack",
            "url": "/name/nm0000131/"
        },
        {
            "@type": "Person",
            "name": "Kevin Spacey",
            "url": "/name/nm0000228/"
        },
        {
            "@type": "Person",
            "name": "Jack Thompson",
            "url": "/name/nm0860233/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 40240,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010258/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019968/"
        },
        {
            "@type": "Person",
            "name": "John Berendt",
            "url": "/name/nm0073509/"
        },
        {
            "@type": "Person",
            "name": "John Lee Hancock",
            "url": "/name/nm0359387/"
        }
    ],
    "datePublished": "1997-11-21",
    "description": "A visiting city reporter's assignment suddenly revolves around the murder trial of a local millionaire, whom he befriends.",
    "director": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        }
    ],
    "duration": "PT2H35M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDVkZWRkZjktYmQzMS00YjE0LTgyMDUtZmIzNzJkZGM3MDNmXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "homosexual,savannah georgia,antonyms in title,true crime,murder",
    "name": "Midnight in the Garden of Good and Evil",
    "original_info": {
        "id": "Midnight in the Garden of Good and Evil_1997",
        "name": "Midnight in the Garden of Good and Evil",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "life_on_screen"
        },
        "dateCreated": "2005-04-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119668/"
        },
        "name": "Good Lord, I can't take my eyes off Kevin Spacey",
        "reviewBody": "Like every film Clint Eastwood makes, \"Midnight in the Garden of Good and Evil\" is fascinated by the mystery of masculinity: what it means to be a man, and what you have to do to be the kind of man you think you need to be -- whether that's a father, a member of a cultural group, or the ideal man in a certain social situation. Two highly-acclaimed recent Eastwood films -- \"Mystic River\" and \"Million-Dollar Baby\" -- mildly disappointed me by sinking into oversimplification and predictability. Possibly Eastwood's directing hand is more interesting when less \"self-assured,\" because 1997's \"Midnight in the Garden of Good and Evil\" follows these questions down less well-defined, and thus less predictable, paths. Maintaining a scrupulously neutral eye, the film recounts a complex tale of murder, involving characters who are recognizable types on the surface but carry deep difference underneath. It unfurls a slow, rich, and troubling narrative which answers the mysteries of its crime premise even as it opens much more difficult questions about the very things that murder stories are supposed to make simple: innocence, guilt, motivations, affection, and its characters' so-called morality.\n\nThanks in large part to a literally mesmerizing performance by Kevin Spacey (I'm riveted every time he appears on screen) and a well- balanced turn by John Cusack as the sympathetic investigating reporter, who charms us even as he maintains a total and focused receptivity to new information and strange events, the movie fills its two and a half hours with a slow-paced and carefully balanced story that brings us into the suffocating green world of Southern Gothic, with its all its mannered refinements, thick silences and passionate secrets. There's something in this film that would have pleased Tennessee Williams or Truman Capote, those cool-eyed investigators of the closeted South. John Berendt's nuanced book, Spacey's restrained, smoldering performance and Eastwood's lucidly hands-off direction have created a strange, slow gem of a film. It's not a gem appreciated by everyone, but two years before Spacey's turn in \"American Beauty\" struck a chord that resonated with the wider public, \"Midnight in the Garden\" asks similar questions in a context that is, at the same time, more precise, more exotic, and equally American.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3248029977",
        "name": "Midnight in the Garden of Good and Evil",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTc5MzE5YWMtMTgwYi00ZjBhLTljZGMtNTdiY2YwNzUwNjVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTc5MzE5YWMtMTgwYi00ZjBhLTljZGMtNTdiY2YwNzUwNjVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:15:42Z",
        "url": "https://www.imdb.com/video/vi3248029977/"
    },
    "url": "/title/tt0119668/"
}