{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carlos Santana",
            "url": "/name/nm0005396/"
        },
        {
            "@type": "Person",
            "name": "Stanley Crouch",
            "url": "/name/nm0189459/"
        },
        {
            "@type": "Person",
            "name": "Miles Davis",
            "url": "/name/nm0002537/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 224,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "datePublished": "2004-10-09",
    "description": "Documentary about Miles Davis' legendary gig at the Isle of Wight Festival, August 1970. Includes full live footage and recent interviews with band mates and others. .",
    "director": [
        {
            "@type": "Person",
            "name": "Murray Lerner",
            "url": "/name/nm0503635/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwNzA0NjE0OV5BMl5BanBnXkFtZTcwNjQ5MzcyMQ@@._V1_.jpg",
    "keywords": "band",
    "name": "Miles Electric: A Different Kind of Blue",
    "original_info": {
        "id": "Miles Davis: Miles Electric: A Different Kind of Blue_2004",
        "name": "Miles Davis: Miles Electric: A Different Kind of Blue",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dromasca"
        },
        "dateCreated": "2008-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0427541/"
        },
        "name": "splendid music at the core of this documentary",
        "reviewBody": "For folks who lived the times of the concerts of in isle or Wight, this remains one of the best musical moments of a generation that changed forever the landscape of jazz and rock music. In the biography of Miles Davis this is the peak of a change that brought a jazz musician who was already a legend, but only in the rather conscripted world of jazz on the world screen of the widely known pop music.\n\nThe documentary does a pretty good job explaining the transition undergone by Davis in the years before Wight, his permanent search of new means of expression, his discovery of the capabilities of the electric instruments and his push to fellow musicians which changed the life and art of no lesser names like Chick Corea, Carlos Santana, Herbie Hancock and other. These artists outlived Davis, and they tell their stories on screen, but I mostly liked the final homage brought by each of them in musical language at the end of the film. And in-between we have filmed excerpts of the concert which represented a MILEStone in the history of music.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0427541/"
}