{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alan King",
            "url": "/name/nm0454418/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Reaser",
            "url": "/name/nm0714147/"
        },
        {
            "@type": "Person",
            "name": "Eric Schaeffer",
            "url": "/name/nm0769703/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 959,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018909/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014869/"
        },
        {
            "@type": "Person",
            "name": "Eric Schaeffer",
            "url": "/name/nm0769703/"
        }
    ],
    "datePublished": "2004-03-13",
    "description": "Five seemingly unrelated people decide to take huge risks in their personal lives in an effort to find happiness.",
    "director": [
        {
            "@type": "Person",
            "name": "Eric Schaeffer",
            "url": "/name/nm0769703/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmYxNjA2YjItY2Y4MC00MGJkLWJjODQtODc3ZmRmNzYwNmY2XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "rape,vegan,speed dating,musician,father son relationship",
    "name": "Mind the Gap",
    "original_info": {
        "id": "Mind the Gap_2004",
        "name": "Mind the Gap",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "noralee"
        },
        "dateCreated": "2004-10-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0373152/"
        },
        "name": "An Uplifting Look at the Choices Even Quirky People Can Make",
        "reviewBody": "'Mind the Gap' is an enchanting spiritual quest by eccentric characters who by converging from the sylvan north, south, west and east to the gritty sidewalks of the island of Manhattan, face death, their own or a loved one's, in different ways and find salvation in accepting that no person is an island. \n\nWhile each is as damaged from relationships as the motley crew in 'Italian for Beginners,' this is far more than a romantic quest as these oddballs, who we on a rotating basis very gradually learn how they got so damaged, cannot have real relationships, including between parents and children, until they solve their spiritual malaise to make a positive choice. Their physical health and sensual perceptions are also linked to their emotional and spiritual well-being. \n\nWhile the film is very long as it leisurely follows these characters' twisted trajectories, the mostly strong acting (particularly by Alan King in what I presume was his last film role) and the intriguing situations and lively conversations keep us curious, though the precocious kids interact with the adults like Gilmore Girls. \n\nLike 'Magnolia,' we gradually find that some of the characters are linked in disturbing ways, others by coincidence (asymptotically cute) of need, time and place, but unpredictably. As brutally frank about the weaknesses, cruelties and foibles of human nature as the former film, writer/director/producer/co-star Eric Schaeffer is less cynical and more hopeful than Paul Thomas Anderson, without resorting to incredible magic realism to restore faith. \n\nWhile these characters literally face the notorious undertow of the waters of Spuyten Duyvil (spiting the devil, per Dutch folklore about the treacherous waters off the mainland) --and their uniform hatred of the NY Yankees-- to enter Manhattan, I didn't catch all the theological interpretations about the sins of the fathers to discern any particular philosophical consistency about forgiveness, including the Krishna Das tracks on the soundtrack. I do question the meaningfulness of a child granting forgiveness to an adult, but I think it's about the adults growing-up. \n\nCo-star singer/songwriter Jill Sobule's \"Bitter\" (available both on her CD 'Happy Town' and the compilation 'I Never Learned to Swim: Jill Sobule 1990-2000') serves as the satisfying culmination; five other of her songs, not specifically written for the film, are also featured as commentary, as she plays an isolated busker with a literal broken heart.\n\nSome recurring images I didn't quite get yet, particularly of a dancer in Times Square, perhaps going around and around at the crossroads of the world.\n\nOne of the most hopeful and uplifting movies I've seen in a long time, it will bring a smile to \"mind the gap\" every time I get on and off the subway -- the gap between reach and grasp, between nirvana and humanity."
    },
    "url": "/title/tt0373152/"
}