{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Taylor",
            "url": "/name/nm0001791/"
        },
        {
            "@type": "Person",
            "name": "Lilli Palmer",
            "url": "/name/nm0658339/"
        },
        {
            "@type": "Person",
            "name": "Curd Jürgens",
            "url": "/name/nm0432007/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 742,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098836/"
        },
        {
            "@type": "Person",
            "name": "AJ Carothers",
            "url": "/name/nm0139218/"
        },
        {
            "@type": "Person",
            "name": "Alois Podhajsky",
            "url": "/name/nm0687998/"
        }
    ],
    "datePublished": "1963-03-29",
    "description": "In 1945 the fate of Vienna's famous Lipizzaner stallions hangs into balance. American general Patton could save them but first he asks to see them perform.",
    "director": [
        {
            "@type": "Person",
            "name": "Arthur Hiller",
            "url": "/name/nm0002137/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjhmNjFiN2UtZmI0ZS00Y2VmLTlhNDctZWVlOTIwMGFiM2U2XkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "stallion,horse,world war two,year 1945,george s. patton character",
    "name": "Miracle of the White Stallions",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2020-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057312/"
        },
        "name": "Even if you don't love horseys, you'll like this one.",
        "reviewBody": "\"Miracle of the White Stallions\" is a most unusual film...one I'd never heard of until I stumbled upon it on YouTube. Think about it....a movie about the Nazis in Austria who work with the famed Lipizzaner stallions and saved them during the war! And, to top it off...it was made by Disney!! I can only imagine that the company hasn't put it on Disney+ because the company is probably worried about showing these Third Reich soldiers in a more politically correct age...though these men are decidedly anti-Nazi in their sentiments. It could also be that they have 'forgotten' about the film because it is a war film...something that doesn't exactly fit in with the Disney+ image.\n\nThe story is about a real life incident. Col. Podhajsky (Robert Taylor) is in charge of the famed Spanish Riding School in Vienna. When the movie begins, the war is going badly for the Nazis and Podhajsky is having great difficulty protecting this very special breed of horses...an Austrian national treasure in many ways. To make it worse, the higher ups won't allow him to evacuate the horses to the countryside as they don't want to acknowledge in any way how badly the war is going. This film is about his efforts to save the animals and preserve this tradition...and, fortunately, the real life Podajsky was on hand to make sure the film got the story right.\n\nThis film is blessed with a very impressive cast, including: Robert Taylor (Podajsky), Eddie Albert, Curd Jürgens, Lili Palmer and James Franciscus. It also is a story that offers a bit for everyone...especially horse lovers. The story is well written, based on true events and is quite inspiring....a film Disney should be proud to have produced.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0057312/"
}