{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "August Schellenberg",
            "url": "/name/nm0770763/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 271,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057495/"
        },
        {
            "@type": "Person",
            "name": "Matthew Hart",
            "url": "/name/nm3349959/"
        },
        {
            "@type": "Person",
            "name": "Toni Myers",
            "url": "/name/nm0616880/"
        }
    ],
    "datePublished": "1997-10-17",
    "description": "Mission to Mir is an unique tour of the Russian Space Station Mir. Filmed in space by American astronauts, the film examines their relationships with Mir's cosmonauts as they live, work, and entertain in a zero-gravity environment.",
    "director": [
        {
            "@type": "Person",
            "name": "Ivan Galin",
            "url": "/name/nm0302124/"
        }
    ],
    "duration": "PT40M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUyODI2NTgzMF5BMl5BanBnXkFtZTcwNDI2MTQyMQ@@._V1_.jpg",
    "keywords": "outer space,zero gravity,astronaut,russian,cosmonaut",
    "name": "Mission to Mir",
    "original_info": {
        "id": "Mission to Mir: IMAX_1997",
        "name": "Mission to Mir: IMAX",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2002-08-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119682/"
        },
        "name": "IMAX film on DVD, important step in space exploration.",
        "reviewBody": "How can you \"rate\" an IMAX space-exploration film? There's nothing to compare it to, so any vote makes sense, I suppose. That isn't important. What this 40-minute film does is show how far we have come since the cold-war days of the 50s and 60s that many of us grew up in. Back then the Russians were our \"enemies.\" And, we find out in this film, to them the Americans were their \"enemies\" who couldn't be trusted. Somewhere in all this a young girl in Oklahoma named Shannon set her sights on becoming one of those space explorers, even though she was told \"girls can't do that.\" But she did, as Dr. Shannon Lucid, with Russians aboard the MIR space station. Who would have ever predicted that?\n\nThe human interest story here is inspirational. American astronauts learning Russian, and living in the formerly top-secret training base outside Moscow. Training for two years to gain competence in operating the MIR space station. Russian cosmonauts visiting Houston, enjoying a backyard bar-b-que with Americans. Russians and Americans cooperating in this great step in space exploration, being able to smile over recollections of the cold war and how far we've all come.\n\nAs with any IMAX film the images and sound are superb. With a DVD player and widescreen HDTV, it is almost like viewing the film. When the rockets fire during launches the room shakes if you have a good subwoofer. The images of the rockets taking off, the travelers docking ships, the scientists moving about the MIR in zero gravity, the sights of them returning to Earth, it's all great stuff for anyone who takes an interest in space exploration."
    },
    "url": "/title/tt0119682/"
}