{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Roberts",
            "url": "/name/nm0000616/"
        },
        {
            "@type": "Person",
            "name": "Charlie Schlatter",
            "url": "/name/nm0772116/"
        },
        {
            "@type": "Person",
            "name": "Joyce Giraud",
            "url": "/name/nm0320788/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2729,
        "ratingValue": 2.2,
        "worstRating": 1
    },
    "alternateName": "Miss Castaway and the Island Girls",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0118146/"
        },
        {
            "@type": "Person",
            "name": "Bryan Michael Stoller",
            "url": "/name/nm0831546/"
        }
    ],
    "datePublished": "2008-01-28",
    "description": "A spoof that combines Cast Away with Miss Congeniality, Planet of the Apes, Love Boat, Gilligan's Island, The Sixth Sense, Jurassic Park, and more",
    "director": [
        {
            "@type": "Person",
            "name": "Bryan Michael Stoller",
            "url": "/name/nm0831546/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Adventure",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4NTc3Nzg0OV5BMl5BanBnXkFtZTcwMTM3MjAzMQ@@._V1_.jpg",
    "keywords": "parody comedy,island,boat,castaway,pilot",
    "name": "Miss Cast Away",
    "original_info": {
        "id": "Miss Cast Away and the Island Girls_2004",
        "name": "Miss Cast Away and the Island Girls",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nosiesnetnieuws"
        },
        "dateCreated": "2008-09-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0395669/"
        },
        "name": "Absolutely horrible -- another reason to pity Michael Jackson",
        "reviewBody": "There was a time when Michael Jackson was revered as the King of Pop. Then came a time when he attracted negative publicity as much as lemonade attracts wasps. Finally, it is now the time that we feel truly sorry for this man.\n\nThis 'movie' is another reason to. I promised a rabid Michael Jackson fan to watch it with her. You know the type of fan -- someone who tells him- or herself to like everything the object of affection ever did. While watching this movie, which she had seen twice already, I realized how far this fandom goes. Probably far enough to rate this movie above a 1/10, as some people miraculously did.\n\nThe movie attempts to be a parody of many other movies and series, most notably Cast Away, Lost and Jurassic Park. Unfortunately, it fails miserably at any level. The acting does not save the absolutely horrible story, the filming has the quality of a too-often played video tape, the special effects were better executed in Be Kind Rewind (for those who do not now this movie: with aluminum foil)... All this would be funny if the movie managed to be, well, funny. Unfortunately, it is not. It hurts to watch this.\n\nAnd then there is Michael Jacksons appearance in this garbage. He appears on a projection screen to deliver an important message, and manages to come across as mobile as Jabba the Hutt and as serious as a 4-year old. Just when I thought \"who is the terrible person that lured this poor man into participating in this movie and yet again making a total fool of himself\", I (finally) reached the ending credits and discovered that the movie was actually partially shot at Jackson's Neverland ranch. In other words: He. Likes. It.\n\nThis movie, and Jackson's involvement in it, is truly disturbing. Do not watch it even for the \"haha, a movie in the IMDb Bottom 100\" effect. Or be warned.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0395669/"
}