{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sanjay Dutt",
            "url": "/name/nm0004569/"
        },
        {
            "@type": "Person",
            "name": "Hrithik Roshan",
            "url": "/name/nm0004335/"
        },
        {
            "@type": "Person",
            "name": "Preity G Zinta",
            "url": "/name/nm0006689/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7335,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017834/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106826/"
        },
        {
            "@type": "Person",
            "name": "Abhijat Joshi",
            "url": "/name/nm0430785/"
        },
        {
            "@type": "Person",
            "name": "Suketu Mehta",
            "url": "/name/nm1252453/"
        },
        {
            "@type": "Person",
            "name": "Vikram Chandra",
            "url": "/name/nm0151512/"
        }
    ],
    "datePublished": "2000-10-27",
    "description": "A police officer adopts the son and sole survivor of a family he has massacred while pursuing a terrorist. After some time the foster son finds out what the stepfather did.",
    "director": [
        {
            "@type": "Person",
            "name": "Vidhu Vinod Chopra",
            "url": "/name/nm0006765/"
        }
    ],
    "duration": "PT2H34M",
    "genre": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzdhY2JjMjctMGE1Mi00MjMyLWI1OTAtYTJlMjBhYWU0OWRiXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "kashmir,revenge,nightmare,accident,missile",
    "name": "Mission Kashmir",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "akshaysharma2007"
        },
        "dateCreated": "2007-12-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0248185/"
        },
        "name": "A completely different brick in the wall !",
        "reviewBody": "A shikara sits on a still lake, the beauty of Kashmir resplendent in the background, a hazy mist clutching the mountains; it is quiet, calm, still. The stillness is shattered by an explosion, the Shikara is in flames to the strains of \"dhuan dhuan\" in the background, as if to reiterate the point of a burning Kashmir, once a stunning land, now ravaged by repression and terrorism, eaten by fear, divided by politics in the name of religion.... ...This movie is not a stereotype bollywood movie,its a mixture of an art movie & a commercial movie,a battle between love & hatred...MK is a DIFFERENT BRICK IN THE WALL..Technically, the film is on par with any Hollywood film with a bombastic climax....It truly gives a picture of the beauty of kashmir & its culture.I know some people feel it has not done that well despite huge commercial expectations at the box office.. but it turned out to be an international blockbuster, ranking among the top 50 rentals in the US and dubbed into most major languages around the world.Mission Kashmir is not an ordinary movie,even Hollywood can feel ashamed in front of such an extraordinary masterpiece with cutting-edge cinematic techniques and state-of-the-art sound direction. ,it is easily one of the finest Hindi films ever with flawless direction, mesmerizing locations, pleasant music,hi-fi special effects and some stunning performances by almost everyone in the cast, this really makes for a great movie experience.Vidhu Vinod Chopra captures the essence of Kashmir so beautifully that by the end of the movie you actually start feeling proud to have such a heavenly place in your country.The movies raises a hope that after all the mishaps that's going in kashmir, there will be peace. after the dark, there will be a morning. and love and peace will en cover the Kashmir. the Dal lake will again be filled with heavenly water replacing the live explosives.. The climax of the movie was the best climax I have seen in this genre..,the fight sequence,especially the technique... of Normal and Slow motion shots syncronised with sound... This end sequence would have been less than seen without that great artwork (Old and almost ruined wooden house with lifelike cobwebs and not to forget the swamps),.....excellent cinematography,innovative camera work,beautiful sets and awesome action sequences(one of the best in world cinema)makes this movie an unforgettable classic.The location in the climax shot at the dal lake was mind-blowing,the scene in which the lotus sub-merged was a true portrayal of kashmir under terrorism.Its a realistic movie dealing with terrorism,the weak point is confusing story line if you don't follow it properly & secondly some songs were not required to be there during some parts of the movie.Hrithik was awesome in the movie so as Sanjay and every other actor,Jackie Shroff who was once tortured by the Soviets in Afghanistan now runs a jihad against India funded by two shadowy agents and, behind them an equally shadowy Osama bin Laden look-alike. Indians should learn to praise such a gem movie instead of copying Hollywood flicks.Mission Kashmir is a masterpiece which can not be made again and again,if it would have been an American movie,it would have surely won the Oscar.Vidhu Vinod Chopra has made a cracker of a film, weaving together an intelligent and responsible film, blending and balancing big action with emotion and feeling, almost perfectly. MK is not just about bombs ,missiles & guns,it also has flowers,beautiful shikaras,excellent music,religion,innocence,love & romance.If you are a typical masala movie lover,this one is not for you but if you have the creativity and an artistic eye this one is a must watch for you....! Mission Kashmir is a realist yet artistic portrayal of terrorism and strife in... it is truly a patriotic movie must watch for every Indian,....a dedication to Kashmiriyat, the centuries old tradition of religious tolerance and harmony..!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT1M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1486487833",
        "name": "Mission Kashmir",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmEwMzgyN2EtNjI5NC00NjJlLWFhOGYtNDdlOWRmMjMyZTg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmEwMzgyN2EtNjI5NC00NjJlLWFhOGYtNDdlOWRmMjMyZTg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:17:42Z",
        "url": "https://www.imdb.com/video/vi1486487833/"
    },
    "url": "/title/tt0248185/"
}