{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "K么ji Tsujitani",
            "url": "/name/nm0875335/"
        },
        {
            "@type": "Person",
            "name": "Yumi T么ma",
            "url": "/name/nm0879486/"
        },
        {
            "@type": "Person",
            "name": "Masaaki Maeda",
            "url": "/name/nm1357303/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 917,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Mobile Suit Gundam F91",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024777/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002299/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007001/"
        },
        {
            "@type": "Person",
            "name": "Yoshiyuki Tomino",
            "url": "/name/nm0866707/"
        },
        {
            "@type": "Person",
            "name": "Hajime Yatate",
            "url": "/name/nm0946695/"
        },
        {
            "@type": "Person",
            "name": "Tsunehisa It么",
            "url": "/name/nm1049975/"
        }
    ],
    "datePublished": "2004-11-23",
    "description": "After a generation of peace, the Earth Federation's new space colonies becomes a battlefield. To save his friends and family, the reluctant warrior Seabook Arno becomes the pilot of a new Gundam which bears the code name F91.",
    "director": [
        {
            "@type": "Person",
            "name": "Yoshiyuki Tomino",
            "url": "/name/nm0866707/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWZiZjJmMzYtNGY2MC00YjVhLThkMDktNzBiZjMyZDI3NzI3XkEyXkFqcGdeQXVyNzgyNTQwMjE@._V1_.jpg",
    "keywords": "spacesuit,gundam,anime animation,attack,outer space",
    "name": "Kid么 senshi Gundam F91",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "xamtaro"
        },
        "dateCreated": "2009-08-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0159568/"
        },
        "name": "Despite its tumultuous production history, F91 still manages to capture the \"Gundam\" spirit",
        "reviewBody": "For those unfamiliar with the sad story BEHIND Gundam F91, here it is. Originally intended as a new 50+ episode Gundam series, bad economy and staff disputes threw the production into chaos. In the end, only 13 episodes worth of \"bare-as-bones\" story outline was produced. This story outline was then condensed into a 115 minute movie.\n\nThis condensation shows very jarringly throughout the entire film. The plot is truncated, and things literally jump from place to place. There is really no sense of time to the events that are happening on screen. One minute the characters are fleeing the battle at Frontier 4 colony, then they are in frontier 3. Soon before you know it, they are in Frontier 1 colony teaming up with a bunch of freedom fighters, and then the main character is suddenly back in Frontier 4.\n\nNew characters like a Federation vessel full of trainees, a team of commandos, a bunch of refugees and even enemy defectors just seem to appear from out of no where. There is even no attempt at introducing them other than by mention of their names through dialog. On screen, characters could have just met for only a minute and in the next scene they act like they have been working together for weeks.\n\nDespite the condensed nature of the show and the terrible pacing, Yoshiyuki Tomino manages to weave an engaging story with highly likable characters that capture the spirit of his previous Gundam productions.\n\nFor starters, more attention is given to the civilian reactions to what is going on. Instead of focusing solely on the main characters or the mobile suit battles, Tomino chooses to focus on the chaos and confusion as seen through they eyes of the common colony folk who at one moment were just enjoying themselves at the county fair, and the next moment, thrust into the nightmare of an invasion.\n\nAny viewer would have no difficulty in relating to the main characters. Their reactions to their situation are very realistically played out without over-doing the angst or the sorrow. Character development may seem rushed, especially for the side-characters as most of them are presented already in \"full view\" with hardly any form of subsequent character arc advancement. However, all their actions and decisions are carried out in a logical manner that leaves no room for suspension of disbelief. In fact I can go so far as to say that Seabook Anno, our main character and Gundam pilot, has a far more emotionally engaging and logically advanced character development within 115 minutes than Kira Yamato ever did in Gundam Seed's 50 episodes. Seabook's character arc advancement does not feel draggy in anyway, making him a thoroughly well rounded character by the time the movie reaches its climax. It is a pity that the other characters could not have been as thoroughly fleshed out as Seabook was. Thankfully, some very professional performances by the voice actors, for both Japanese and English voice tracks, saves the characters from falling into the domain of \"dull\". (I personally recommend watching this in English as many of the characters are either Caucasian or non-Japanese)\n\nBesides this, Gundam F91 also excels in its animation. Few anime have been able to show large scale battles without falling back on animation \"short cuts\" like repeated stock footage and this show is one of those few. Gundam F91's animation during Combat scenes are tight and fluid, while the art manages to maintain a consistently high level of detail. If it were not for its dated color scheme and sound effects, Gundam F91's animation could in fact hold its own against today's anime feature film productions.\n\nThis is a stand alone production with no prior knowledge of Gundam required. A short and sweet little teaser for any new fan wanting to jump into the greater Gundam universe. For the older fans, Gundam F91 would be like a \"best of...\" compilation album. Everything that made the various universal century Gundam series the international hits they are, packaged into 115 minutes. A real pity about the rushed story though.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0159568/"
}