{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tôru Furuya",
            "url": "/name/nm0299228/"
        },
        {
            "@type": "Person",
            "name": "Shûichi Ikeda",
            "url": "/name/nm0407454/"
        },
        {
            "@type": "Person",
            "name": "Hirotaka Suzuoki",
            "url": "/name/nm0840721/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1839,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Mobile Suit Gundam: Char's Counterattack",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0176394/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002299/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007001/"
        },
        {
            "@type": "Person",
            "name": "Yoshiyuki Tomino",
            "url": "/name/nm0866707/"
        }
    ],
    "datePublished": "1988-03-12",
    "description": "Amuro Ray and Char Aznable settle their rivalry once and for all during the Second Neo Zeon War.",
    "director": [
        {
            "@type": "Person",
            "name": "Yoshiyuki Tomino",
            "url": "/name/nm0866707/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTE5OGJjZmQtZmI0Ni00YzU1LWE1OGItZGI5MDc3ODhlYjc1XkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "outer space,gundam,anime animation,nuclear winter,meteor",
    "name": "Kidô Senshi Gundam: Gyakushû no Shâ",
    "original_info": {
        "id": "Mobile Suit Gundam: Char's Counterattack_1988",
        "name": "Mobile Suit Gundam: Char's Counterattack",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "xamtaro"
        },
        "dateCreated": "2009-08-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095262/"
        },
        "name": "Gundam concludes with bang",
        "reviewBody": "You have asked wondered \"who will survive\" and you have \"seen the tears of time\". Now, the final chapter of an anime legend, the Universal Century Gundam saga, comes to its mind blowing conclusion. \n\nChar's Counterattack is the culmination of years worth of Gundam storyline, in particular, the rivalry between Amuro Ray and Char Aznable that was established in the 1979 Gundam series but was never really followed through in the sequels.\n\nThe numerous factions from Zeta Gundam and ZZ Gundam have been done away with and we are back in familiar territory now;Char Aznable leads the Neo Zeon movement and Amuro Ray is part of the Londo Bell task-force sent to quell this uprising.\n\nAs a stand alone Gundam movie, Char's counterattack does not do much for the newer audience. It expects that the viewer is already familiar with Gundam lore and the established rivalry between Amuro and Char as it immediately throws you into the thick of the story and the heat of the action. A couple of new characters like Quess Paraya and Hathaway Noa are introduced but they come across as uninteresting and seem like throw-away characters whose only purpose is to fill up screen time when we are not focusing on Char or Amuro. There is a very uncomfortable attempt at creating a shaky love triangle story but the execution of that plot thread was not as good as it could have been.\n\nPoor attempt at romance aside, Char's counterattack features a number of other themes that the viewers can easily relate to. There is a coming-of-age theme in how Hathaway Noa desires to step out of his father's shadow and discover his own identity, and there is a good deal of wartime rhetoric thrown about by Char. That being said, only once Amuro and Char take center stage does the movie finally find its footing and delivers an engagingly entertaining experience. They are the perfect opposites, each representing widely differing views on war and the idealistic pursuit of peace.\n\nHow far is one willing to go to end a war? Can peace be attained only through bloodshed? Are people only a means to an end when one is so obsessed with pursuing an ideal? Questions like these pop up during the course of the narrative which challenges the viewer to think and question.\n\nSome fans have complained about the lack of character development of many of the cast, but i can only say this: Char's Counterattack should not be viewed as a stand alone movie. It is not a movie to develop the characters but a movie to bring about a RESOLUTION to the characters that have been developed over the course of the previous Gundam series. That is why i definitely recommend re-watching at least the original Gundam 0079 TV series or compilation movies before watching this movie. Re-watching \"Zeta Gundam\" would also add to a better understanding of Char's character development over the years. \n\nJam packed with epic action sequences thanks to a higher budget and more experienced staff, Mobile Suit Gundam: Char's Counterattack is the exciting concluding chapter in the grand sweeping tale of Amuro Ray and Char Aznable.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Bandai Entertainment",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi127336729",
        "name": "Mobile Suit Gundam: Char's Counterattack",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDljZjliYjQtZDAzNS00M2MwLWFmNGYtNzQ0ZjNlZWIxZDI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDljZjliYjQtZDAzNS00M2MwLWFmNGYtNzQ0ZjNlZWIxZDI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:04:39Z",
        "url": "https://www.imdb.com/video/vi127336729/"
    },
    "url": "/title/tt0095262/"
}