{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robin Wright",
            "url": "/name/nm0000705/"
        },
        {
            "@type": "Person",
            "name": "Morgan Freeman",
            "url": "/name/nm0000151/"
        },
        {
            "@type": "Person",
            "name": "Stockard Channing",
            "url": "/name/nm0000330/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4373,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0198885/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025957/"
        },
        {
            "@type": "Person",
            "name": "Daniel Defoe",
            "url": "/name/nm0214518/"
        },
        {
            "@type": "Person",
            "name": "Pen Densham",
            "url": "/name/nm0219720/"
        }
    ],
    "datePublished": "1996-06-14",
    "description": "The daughter of a thief, young Moll is placed in the care of a nunnery after her mother's execution, but the actions of an abusive priest lead her to rebel as a teenager, and she escapes to the dangerous streets of London. Further...",
    "director": [
        {
            "@type": "Person",
            "name": "Pen Densham",
            "url": "/name/nm0219720/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDZlODcwNGUtN2JhNi00Njc2LWJmZjYtNWI2ZWE1MTUyNDFjXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "lust,priest,prostitute,painter,pregnancy",
    "name": "Moll Flanders",
    "original_info": {
        "id": "Moll Flanders_1995",
        "name": "Moll Flanders",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "weirdophreak17"
        },
        "dateCreated": "2005-03-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117071/"
        },
        "name": "Loose Adaptation of the Book Works its Own Magic",
        "reviewBody": "This film, though nothing like the Daniel Defoe novel, was remarkably good. The tale begins with Flora, an orphan removed from her home in a convent in Europe, who is told that she is being taken to the Americas to become the ward of one Mrs. Allworthy, who is credited to have been the woman her mother served. Mrs. Allworthy's manservant and confidant, Hibble, is the one who is to both bear her to his employer, and also to read to Flora the diary of her mother, Moll Flanders, to explain her life to her.\n\nRobin Wright shines as the lost and ever soul-searching innocent Moll Flanders, who despite making many wrong choices in life seems to find her way to kind places again and again. Her unconditionally loving future husband, credited \"The Artist\" on screen but listed as John Fielding on this site, is played by John Lynch. Stockard Channing is Mrs. Allworthy, who we come to discover is the owner of a Bordello and is a manipulative woman who can sway any man into her power. Lastly, Morgan Freeman plays the part of gentle and world-wisened Hibble, and I think this is one of his best roles, as he interacts so swimmingly with Robin on camera.\n\nThe movie is rated PG-13 for sexual situations, nudity and some violence. Despite the subject matter, the film charms the soul. I recommend lovers of Gothic literature to read it, and for people who love the book to give this story a chance as a separate entity.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The daughter of a thief, young Moll is placed in the care of a nunnery after the execution of her mother. However, the actions of an abusive Priest lead Moll to rebel as a teenager, escaping to the dangerous streets of London. Further misfortunes drive her to accept a job as a prostitute from the conniving Mrs. Allworthy. It is there that Moll first meets Hibble, who is working as Allworthy's servant, but takes a special interest in the young woman's well-being. With his help, she retains hope for the future, ultimately falling in love with an unconventional artist who promises the possibility of romantic happiness.",
        "duration": "PT2M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi110871321",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjFhYjVhMjAtYTgxNS00ODc2LWEzOTYtNzE2NDlmZmFkMmU4XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjFhYjVhMjAtYTgxNS00ODc2LWEzOTYtNzE2NDlmZmFkMmU4XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-11T19:36:18.906Z",
        "url": "https://www.imdb.com/video/vi110871321/"
    },
    "url": "/title/tt0117071/"
}