{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Faye Dunaway",
            "url": "/name/nm0001159/"
        },
        {
            "@type": "Person",
            "name": "Diana Scarwid",
            "url": "/name/nm0769311/"
        },
        {
            "@type": "Person",
            "name": "Steve Forrest",
            "url": "/name/nm0002079/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16954,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Christina Crawford",
            "url": "/name/nm0186726/"
        },
        {
            "@type": "Person",
            "name": "Frank Yablans",
            "url": "/name/nm0944747/"
        },
        {
            "@type": "Person",
            "name": "Frank Perry",
            "url": "/name/nm0675068/"
        }
    ],
    "datePublished": "1981-09-25",
    "description": "The abusive and traumatic adoptive upbringing of Christina Crawford at the hands of her mother, screen queen Joan Crawford, is depicted.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Perry",
            "url": "/name/nm0675068/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNThlYzA1MjAtNjAwMy00ZmMxLWJjMTYtNjIwN2MzZjc1ZTU3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "narcissism,bad mother,abusive mother,child abuse,borderline personality disorder",
    "name": "Mommie Dearest",
    "original_info": {
        "id": "Mommie Dearest_1981",
        "name": "Mommie Dearest",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TJBNYC"
        },
        "dateCreated": "2001-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082766/"
        },
        "name": "Woman on the Verge of a Nervous Breakdown",
        "reviewBody": "There is no doubt that Christina Crawford's scathing 1978 memoirs did much initial harm to her late mother's reputation. The subsequent 1981 film has eclipsed even the bestselling book to become the standard by which the real-life Joan is judged. However, I'm inclined to believe that those who dismiss Joan today as a psychotic harpy and nothing more never even saw the film version of \"Mommie Dearest,\" and only heard secondhand reports of the most infamous scene (\"No...wire...hangers!\").\n\nMost tellingly, Christina Crawford reportedly hated the film version of her book, and wailed upon seeing it, \"They turned it into a Joan Crawford movie!\" She's right. With the exception of the two most graphic scenes (\"No wire hangers\" and the choking scene), Joan's \"abuse\" of Christina is not all that much different from what passed as \"discipline\" in those days--just ask your parents or grandparents--and despite Faye Dunaway's full-throttle acting, Joan always somehow comes off in a strangely sympathetic light.\n\nWhat we see is an insecure woman fighting for survival in an age-obsessed, male-dominated industry. Such scenes as Joan's heartless dismissal from MGM invite sympathy; while her snarling, veritable takeover of Pepsi Co. elicts cheers for her ballsiness and strength. Christina, on the other hand, is invariably depicted as either gratingly whiny or cardboard stiff. It's difficult to empathize with such an annoying character.\n\n\"Mommie Dearest\"'s grandest artistic achievement is through the impeccable art direction, which truly makes the audience believe they are watching a film unfold in the 1940's and 1950's. Its lasting legacy, however, is Faye Dunaway's career-ending performance, which, depending on your point of view, is either jaw-droppingly awful or unbelievably brilliant.\n\nDunaway's acting \"choices\" are nothing if not idiosyncratic: clutching her bosom frantically as she cries, \"You...deliberately...embarass me in front of a REPORTER!\"; copying the real-life Crawford's facial expressions from the horror flick \"Strait-Jacket\" in the axe-wielding scene; and, most famously, her odd, cross-eyed pose that she strikes not once, or twice, but three times: holding baby Christina on the staircase, rubbing moisturizer on her elbows after hiding Christina's dolls, and following her wire hanger/cleansing powder attack.\n\nIt is Dunaway's nostril-flaring, hair-pulling, bosom-clutching style that really sends this film into the camp stratosphere. On paper, such scenes as Joan swatting Christina on the butt for defying her orders, or Joan insisting that Christina finish her rare steak, would seem bland. In Dunaway's hands, they become something else altogether!\n\n Actually, Christina Crawford should thank Faye Dunaway; if not for her crazed, unforgettable portrayal, \"Mommie Dearest\" would have been just another trashy Hollywood memoir that eventually would've been forgotten (does anyone really care about B.D. Hyman's book about Bette Davis anymore?). And a film version without Dunaway would've been rightfully panned, forgotten, and relegated to cut-out bins at your local video emporium. Instead, Faye Dunaway has ensured its place in film immortality. It still stands alone among camp classics, but perhaps some re-evaluation of it (and of Joan Crawford herself) is due."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The abusive and traumatic adoptive upbringing of Christina Crawford at the hands of her mother, screen queen Joan Crawford, is depicted.",
        "duration": "PT4M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi50511385",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTE4Mzc0ZWEtZDI4OC00MzFjLWFjZmUtMDhiMGQyMTBiN2I0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTE4Mzc0ZWEtZDI4OC00MzFjLWFjZmUtMDhiMGQyMTBiN2I0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-07T09:19:02.941Z",
        "url": "https://www.imdb.com/video/vi50511385/"
    },
    "url": "/title/tt0082766/"
}