{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Philippe Torreton",
            "url": "/name/nm0868881/"
        },
        {
            "@type": "Person",
            "name": "Richard E. Grant",
            "url": "/name/nm0001290/"
        },
        {
            "@type": "Person",
            "name": "Jay Rodan",
            "url": "/name/nm0734421/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 897,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023892/"
        },
        {
            "@type": "Person",
            "name": "René Manzor",
            "url": "/name/nm0544528/"
        },
        {
            "@type": "Person",
            "name": "Pierre Kubel",
            "url": "/name/nm1310454/"
        }
    ],
    "datePublished": "2003-02-12",
    "description": "How could Napoleon, the man of war and pioneering military strategist, meekly accept being locked up on a storm-lashed rock in the middle of the Atlantic ocean? What system of defence, and thus of attack, can he dream up to loosen...",
    "director": [
        {
            "@type": "Person",
            "name": "Antoine de Caunes",
            "url": "/name/nm0004380/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Biography",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjExNDc5NDI0OF5BMl5BanBnXkFtZTcwMzMzMTkyMQ@@._V1_.jpg",
    "keywords": "jailer,st. helena,prison,prisoner,napoleon bonaparte",
    "name": "Monsieur N.",
    "original_info": {
        "id": "Monsieur N._2003",
        "name": "Monsieur N.",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dennsylvania"
        },
        "dateCreated": "2005-11-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0308595/"
        },
        "name": "Very well done! Great film!",
        "reviewBody": "Very well done! Great film! Well acted. Well written. Good directing. Good camera work. Beautiful visually from both the directing/camera work, and the picturesque scenery. Great acting performances all around.\n\nI like how the film isn't just in French, or just in English. The English characters speak English to each other, and speak French to the French. The French characters speak French. This gives the film a realistic feel. \n\nGreat storytelling. The viewer falls prey to Napoleon's charismatic charm as much as those who knew him in person, and we come to feel for him, as if he is a victim of his imprisonment, rather than a deposed tyrannical dictator paying for his vast crimes. His humbled situation brings out his humanity and weakness, yet he still retains his dominance, but through subtler control than his former meglomanical ways. It is almost as if he has lured the audience into routing for him and pitying him, while he secretly pulls our strings. \n\nIt is also refreshing to see the human side of a once powerful ruler, and brutal military commander, through witnessing his relationships and interactions with others. We tend to only see powerful world leaders in their public personas, without getting to voyeuristically peer into their private lives, and therefore, they seem larger than life, rather than a human being going through the things we all go through in life. Life plays no favorites, nor spares anyone based on title or fame. \n\nI am a history buff, and I enjoy most well made historical films, but I think anyone would enjoy this. It has intrigue, romance, action, dialog, storytelling, conjecture, moving moments, something for everyone. It is not \"boring history\", but the juicy bits that fell through the cracks, that cannot be found in a text book, the story within the story so to speak. The film is based on a combination of know facts, and explored theory. It is an intriguing conspiracy theory, that could well have happened. We may never know the whole truth about Napoleon's fate, but isn't it fun to explore the what ifs, especially the ones that make a glorious story? As with Billy The Kid, Jessie James, Elvis, & Jim Morrison, among others, Napoleon's legend is romanticized, and made even grander by the thought that he may have cheated death and fame, and \"rode off into the sunset\"... \n\nWatch the film, you'll enjoy it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0308595/"
}