{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charles Chaplin",
            "url": "/name/nm0000122/"
        },
        {
            "@type": "Person",
            "name": "Mady Correll",
            "url": "/name/nm0180900/"
        },
        {
            "@type": "Person",
            "name": "Allison Roddan",
            "url": "/name/nm0734467/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18158,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028083/"
        },
        {
            "@type": "Person",
            "name": "Charles Chaplin",
            "url": "/name/nm0000122/"
        },
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        }
    ],
    "datePublished": "1947-10-23",
    "description": "A suave but cynical man supports his family by marrying and murdering rich women for their money, but the job has some occupational hazards.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Chaplin",
            "url": "/name/nm0000122/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDhmZGU2OTMtYmFmMS00OGI0LWI5ZTItZmVkMWEyYjAyYjc5L2ltYWdlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "serial killer,black comedy,directed by star,murder,1920s",
    "name": "Monsieur Verdoux",
    "original_info": {
        "id": "Monsieur Verdoux_1947",
        "name": "Monsieur Verdoux",
        "year": "1947"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2014-01-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0039631/"
        },
        "name": "Far from the Little Tramp",
        "reviewBody": "As Charlie Chaplin put it when the tramp finally talked in The Great Dictator the magic was gone. Chaplin felt he had to come up with another character in order to continue his career and he got away from the lovable Little Tramp as far as he could with Monsieur Verdoux.\n\nA whole lot of people were shocked when Monsieur Verdoux came out and instead of the Tramp we got a Bluebeard murderer. Black comedy was not a genre popular in the USA at that time and a lot of people hated this film. None more so than Hollywood columnist Hedda Hopper who as a good conservative Republican cheered on the coming blacklist and beat the drums for Chaplin's deportation. No accident that Chaplin was hauled before the House Un-American Activities Committee at the time Monsieur Verdoux came out.\n\nBased on the famous French mass criminal Henry Desire Landru, Monsieur Verdoux tells the story of a bank clerk who lost his job and to support his family started marrying and murdering rich women. Verdoux keeps quite a schedule because he's marrying several of them at the same time. But always returns to wife Mady Correll and son Allison Roddan.\n\nFunniest marriage is to Martha Raye who not only is he unsuccessful in killing, she nearly does him in on a couple of occasions strictly by accident. That raucous laugh might elicit sympathy from a jury if anyone ever heard it and was condemned to live with it even part time.\n\nWith the marriage to Raye comes the film's funniest sequence Chaplin trying to kill Raye when they were in a boat on a lake in Switzerland. It will not escape your attention that the sequence is borrowed from Theodore Dreiser's An American Tragedy which was already filmed in 1931 and would shortly be filmed again in 1951 as A Place In The Sun. Ironic indeed how the same plot gambits can be played for laughs or deadly serious.\n\nSecond funniest is Raye showing up at Chaplin's wedding to Isobel Elsom whom he has targeted. It forces him to leave her at the altar not knowing at that time how lucky she was.\n\nTruth be told some of Chaplin's left wing political views are grafted into the film somewhat forcibly. It's what got Hedda Hopper's undergarments in such a twist. Still this an amusing film and not fairly judged by a lot of people at the time it came out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A suave but cynical man supports his family by marrying and murdering rich women for their money, but the job has some occupational hazards.",
        "duration": "PT1M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi19317529",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDk0ZGZlNzUtZmVhZi00NzBlLTgxZDEtYjFiODJhNTg0OWZiXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDk0ZGZlNzUtZmVhZi00NzBlLTgxZDEtYjFiODJhNTg0OWZiXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-13T17:42:09.721Z",
        "url": "https://www.imdb.com/video/vi19317529/"
    },
    "url": "/title/tt0039631/"
}