{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Donald Grant",
            "url": "/name/nm0335367/"
        },
        {
            "@type": "Person",
            "name": "Denise DuBarry",
            "url": "/name/nm0239180/"
        },
        {
            "@type": "Person",
            "name": "Claude Akins",
            "url": "/name/nm0015391/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2710,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017995/"
        },
        {
            "@type": "Person",
            "name": "Bob Dahlin",
            "url": "/name/nm0197088/"
        },
        {
            "@type": "Person",
            "name": "Peter L. Bergquist",
            "url": "/name/nm0074990/"
        }
    ],
    "datePublished": "1987-01-30",
    "description": "Paul Dooley, Paul Walker, John Carradine and Henry Gibson head up an all-star cast in this horror-comedy about a murderous but misunderstood monster!",
    "director": [
        {
            "@type": "Person",
            "name": "Bob Dahlin",
            "url": "/name/nm0197088/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGJjNzI1MTMtNjZmZC00NTZmLTg5ZGYtMTZiNTExZjI1ZjBiXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "psychotronic film,horror parody,voice over narration,california,scream",
    "name": "Monster in the Closet",
    "original_info": {
        "id": "Monster in the Closet_1986",
        "name": "Monster in the Closet",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FieCrier"
        },
        "dateCreated": "2005-01-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091544/"
        },
        "name": "cutesy movie with a bad monster but little violence",
        "reviewBody": "This was sort of a cute movie, nothing too great.\n\nIt starts off with a pre-credits sequence of people getting dragged into their closets, or walking into their closets, only to be attacked by something. We don't see the attack, since the camera takes a side view of the open closet door, and we hear screaming and cartoonish monster eating noises, as clothing is tossed out of the closet. John Carradine has a small role as one of these people, and blind man violently smashing his cane around his apartment looking for his guide dog (who the monster hung on the closet door).\n\nWe then meet a reporter who looks a lot like Superman's alter-ego Clark Kent, complete with big black-rimmed Clark Kent eyeglasses. He's named Richard Clark. He got his job at the paper through nepotism, and only does obituaries, but her wants something more. The lead reporter \"Scoop\" gives him a three-week old story about the people dying in their closets as a laugh.\n\nClark befriends a young boy at the police station while waiting to talk to the chief there. The boy is a bespectacled small version of himself, perhaps. He's doing some kind of experiment recording all different kinds of sounds, while his mother - a teacher at the local college, where some of the deaths occurred - talks to the chief, explaining how the bite marks found on the victims are somewhat consistent with snake bites. Clark angers the bespectacled mother by having let the boy have a chocolate bar. Everyone, including the mother, calls the boy \"The Professor.\"\n\nClark also meets an Albert Einstein-looking Nobel Priza-winning professor at the college, and gives him a claw he found at one of the crime scenes. We also see that the mother becomes speechlessly, motionlessly smitten with Clark every time he takes his glasses off.\n\nThey soon see the monster, who starts coming out of closets. There are elements of \"Alien\" and \"Close Encounters of the Third Kind\" to the monster and their attempts to communicate with it.\n\nThis movie could be appropriate for children, although be forewarned that there is a brief topless scene. A bit surprising for a PG-rated movie, but not altogether without precedent. Baby: Secret of the Lost Legend (1985) had a lot more. The scene it occurs in is one early in the movie, and comically spoofs the shower scene in Hitchcock's Psycho.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Troma",
        "duration": "PT2M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2929328409",
        "name": "Monster In The Closet",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTBkOTIxMzQtZDE0MS00OTNkLTgwZmYtNzk2MWU1NmQ4MjY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTBkOTIxMzQtZDE0MS00OTNkLTgwZmYtNzk2MWU1NmQ4MjY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:19:09Z",
        "url": "https://www.imdb.com/video/vi2929328409/"
    },
    "url": "/title/tt0091544/"
}