{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlize Theron",
            "url": "/name/nm0000234/"
        },
        {
            "@type": "Person",
            "name": "Christina Ricci",
            "url": "/name/nm0000207/"
        },
        {
            "@type": "Person",
            "name": "Bruce Dern",
            "url": "/name/nm0001136/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 155040,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051264/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0129644/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068448/"
        },
        {
            "@type": "Person",
            "name": "Patty Jenkins",
            "url": "/name/nm0420941/"
        }
    ],
    "datePublished": "2004-01-30",
    "description": "Based on the life of Aileen Wuornos, a Daytona Beach prostitute who became a serial killer.",
    "director": [
        {
            "@type": "Person",
            "name": "Patty Jenkins",
            "url": "/name/nm0420941/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4NzI5NzEwNl5BMl5BanBnXkFtZTcwNjc1NjQyMQ@@._V1_.jpg",
    "keywords": "prostitute,female serial killer,lesbian,borderline personality disorder,serial killer",
    "name": "Monster",
    "original_info": {
        "id": "Monster_2003",
        "name": "Monster",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TBJCSKCNRRQTreviews"
        },
        "dateCreated": "2005-04-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0340855/"
        },
        "name": "About as bleak and depressing as they get, but in no way a bad movie",
        "reviewBody": "After just seeing this film, I'm pretty much speechless. This is a tough film to comment on. This is mainly due to the fact that it's a serial killer film where you actually end up feeling sympathy for the killer. Near the end of the film, when it goes completely out of control for Aileen Wuornos, there's no feeling of \"justice is done once again\"... quite the contrary, actually. It's so moving and disturbing, following this person's life, through the last part of it. In the beginning, we get a fairy tale-like presentation of Aileen's hopes and dreams in her young years. Without warning, we're thrust into the hard reality of her current years, immediately afterward. From there on out, we're in her world, feeling her pain, experiencing her failures. We get to know her as the film goes on, but we feel for her from the very beginning, without even knowing why she is like she is. That says something about the masterful direction and writing of Patty Jenkins that is featured in this film. The plot is great, and it's surprisingly easy to follow the thought process of Aileen... we understand why she kills. The pacing is very good, there are only few scenes that seem to move slow, and I don't think there was really any point where I was bored. The locations is incredibly authentic. Jenkins actually went out of her way to get shooting done at several places where the real Aileen had been, and even cast people who had met her in smaller roles. Cinematography is great. Acting is pretty much flawless; both Theron and Ricci shine in their roles. The movie also has a unpleasant view of prejudice from the 'other side'(the people who become victims to prejudice), and hopefully this will act as a much needed wakeup call for the people who believe in and go by prejudice. What really makes this film have an impact is how dark and real it is. No happy ending, no silver lining... just tough, uncut reality. When you see it, you can't help getting engulfed in this person's world. The raw horror of her life moves you. I can't see anyone, no matter ignorance, beliefs or moral and ethic standpoint coming out after seeing this film and believing that Eileen was the 'bad guy' in this story. It's just not possible. I haven't seen any of the interviews with the real Aileen Wuornos and I didn't follow her case, but I would like to know more about her, find out what she was like to a greater extent than a movie of 1 hour and 45 minutes can tell me. That's what this movie did to me. It made me care for this person, and that says more than anything I can put in this review. You need to see this film, unless you refuse to watch anything that has harsh reality instead of a happy ending. I recommend this to anyone who can take it. This movie will depress most people, but after this one viewing, I consider it required viewing for just about anyone. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Monster",
        "duration": "PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi95922969",
        "name": "Monster",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDkxNTVlNjItZTdkNC00MDc5LTg2NmQtMWVkNTczNGFkMmQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDkxNTVlNjItZTdkNC00MDc5LTg2NmQtMWVkNTczNGFkMmQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2014-01-17T07:43:18Z",
        "url": "https://www.imdb.com/video/vi95922969/"
    },
    "url": "/title/tt0340855/"
}