{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Billy Bob Thornton",
            "url": "/name/nm0000671/"
        },
        {
            "@type": "Person",
            "name": "Halle Berry",
            "url": "/name/nm0000932/"
        },
        {
            "@type": "Person",
            "name": "Taylor Simpson",
            "url": "/name/nm0801231/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 91183,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048235/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Person",
            "name": "Milo Addica",
            "url": "/name/nm0995906/"
        },
        {
            "@type": "Person",
            "name": "Will Rokos",
            "url": "/name/nm0737993/"
        }
    ],
    "datePublished": "2002-03-01",
    "description": "After a family tragedy, a racist prison guard re-examines his attitudes while falling in love with the African-American wife of the last prisoner he executed.",
    "director": [
        {
            "@type": "Person",
            "name": "Marc Forster",
            "url": "/name/nm0286975/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTkyMzk3NTYtY2FiYy00MWIwLWIyYzctODIzNzVlOGQxZmYwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "interracial sex,electric chair,interracial relationship,prison guard,dysfunctional family",
    "name": "Monster's Ball",
    "original_info": {
        "id": "Monster's Ball_2001",
        "name": "Monster's Ball",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dfranzen70"
        },
        "dateCreated": "2002-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0285742/"
        },
        "name": "Excellent job of peeling away the layers of racism",
        "reviewBody": "Hank Grotowski (Billy Bob Thornton) is the middle generation of three generations of prison guards. His father Buck (Peter Boyle) is long retired and a near-invalid, using a walker and leaning on an iron lung. His son Sonny (Heath Ledger) is a novice guard. Hank and Sonny work together on Death Row and are among the guards responsible for the executions (Hank's in charge).\n\nThe first thing that strikes one about this particular group of men is the level of racism that's apparent in each one. Buck's the worst - he screams at young black kids who happen to wander onto \"his\" property (all three Grotowskis live together) and is liable to spout off some hateful rhetoric at any time. Hank's not a lot better, but his feelings seem tempered in contrast to Buck; he seems more weary than angry. And Sonny is actually friends with that same neighboring black family whose kids come over every now and then.\n\nThus the line of racism is significantly watered down as the generations progress. This is not to suggest that Sonny is an angel, or that Buck is the absolute devil. Sonny and Hank share the same hooker (though not at the same time); all three men drink, smoke, and cuss like sailors. In short, they're simply not nice folk.\n\nWhile Hank and Sonny are transporting a prisoner to the electric chair, Sonny takes ill and can't continue. Because of this, the prisoner (who had bonded a little with the compassionate Sonny earlier) suffers a little during his execution. Enraged, Hank attacks his son in the locker room after the execution, and the other guards have to separate them.\n\nThat's one relationship being examined - that of Hank and Sonny. The other is the more important one, however. The widow of the executed prisoner, Leticia Musgrove (Halle Berry), is trying to make ends meet as a waitress. But her car constantly dies on her, and after being late to work repeatedly, she's fired - shortly after her husband is executed. She has one overeating kid to feed, too. She does get another job as a waitress, but has to ditch the car when it dies a final time. Walking home in the rain, her son (who has to come with her; can't leave him home to binge) his hit by a car. Hank happens to be passing by, and with some reluctance (remember, he is racist, if not as bad as his father), he stops to help. \n\nThere's a wonderful dichotomy between the relationship between Leticia and her son and that between Hank and his son. Milo Addica and Will Rokos, who wrote the screenplay, weave a very effective tale that manages to keep all of the characters interesting and relevant. What makes Hank act the way he does? What are Leticia's motivations? And it would be very easy for the actors to portray the characters as nothing more than stereotypes - Hank the nasty, racist white male, and Leticia the vulnerable, victimized African American woman. But both Thornton and Berry rise above their characters' limitations - Hank's not the devil he might think he is, and Leticia isn't the angel that a lesser actress might make her out to be.\n\nIt's also worth mentioning that each of the two leads has something shocking and powerful happen to them near the beginning of the film, before they really meet. These two events have a huge impact on the characters - you might call the events \"life-altering\". The events allow us to see actual change in the character. Not sudden change, which can be jarring and unrealistic, but gradual, authentic, eminently believable change.\n\nThe performances by the leads are nothing short of sensational. Berry won the Oscar for Best Actress for her work here. Yes, you read right - Halle Berry. She of The Flintstones, Swordfish, and being married to David Justice fame. See, this is what happens when you give a good actress a great role. The best actresses will rise to the level of the role; the mediocre actresses will sink below it, collapsing under its weight.\n\nThornton has a tendency to pick offbeat, idiosyncratic roles, albeit usually with a Southern twist. His Hank is not a carbon copy of your stereotypical Dirty White Boy; he's a multilayered character with charm and evil mixed in. The film doesn't make him out to be a complete hero; just a flawed one. By the movie's end, he has come to grips (a little) with his failures and his shortcomings.\n\nBerry and Thornton have a great supporting cast in Boyle and Ledger. When you think of a hateful, misanthropic, misogynistic demon, you don't think of Peter Boyle, who's turning in great comedic work on the TV show \"Everybody Loves Raymond\". But after this movie, you sure do. Great job. And Ledger - well, I know him best from The Patriot, as Mel Gibson's oldest son. In that movie, he was tough, but he was still a boy in a world of adults. That boy's grown up, and Ledger proves his mettle as an actor in this role.\n\nThere will be some who find this movie too slow; granted, if you're looking for action, this won't appeal to you. But it's an excellent story, and not as simplistic as it may seem on the outside. It's very well written (meaning that there are few plot holes), and ably directed. You may be fascinated, as I was, with the character development from beginning to end. Things are not - pardon the expression - treated as black-and-white issues; there are varying grays that are resolved and not resolved by movie's end.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2761556249",
        "name": "Monster's Ball",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzc0MTcyYTMtN2EyZC00MWI3LWJhN2EtMTI1NzEzM2UyMjI3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzc0MTcyYTMtN2EyZC00MWI3LWJhN2EtMTI1NzEzM2UyMjI3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:19:13Z",
        "url": "https://www.imdb.com/video/vi2761556249/"
    },
    "url": "/title/tt0285742/"
}