{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Cleese",
            "url": "/name/nm0000092/"
        },
        {
            "@type": "Person",
            "name": "Terry Gilliam",
            "url": "/name/nm0000416/"
        },
        {
            "@type": "Person",
            "name": "Eric Idle",
            "url": "/name/nm0001385/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2696,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Graham Chapman",
            "url": "/name/nm0001037/"
        },
        {
            "@type": "Person",
            "name": "John Cleese",
            "url": "/name/nm0000092/"
        },
        {
            "@type": "Person",
            "name": "Terry Gilliam",
            "url": "/name/nm0000416/"
        }
    ],
    "datePublished": "2014-07-20",
    "description": "The reunion of the Monty Python team on stage for the first time in over 30 years, and for the very last time ever.",
    "director": [
        {
            "@type": "Person",
            "name": "Eric Idle",
            "url": "/name/nm0001385/"
        },
        {
            "@type": "Person",
            "name": "Aubrey Powell",
            "url": "/name/nm0694023/"
        }
    ],
    "duration": "PT2H42M",
    "genre": [
        "Documentary",
        "Comedy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzUzYzcxM2ItZDQ2MC00MzdkLTk2ZGItNzI2NjE5NGZhY2Q2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "sketch comedy movie,live show,live performance,monty python,reenactment",
    "name": "Monty Python Live (Mostly)",
    "original_info": {
        "id": "Monty Python Live!_2001",
        "name": "Monty Python Live!",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kep315"
        },
        "dateCreated": "2015-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3872778/"
        },
        "name": "Just as well if this is their last go-round",
        "reviewBody": "I found the whole thing to be rather flat and forced. The problem, in my opinion, stems from the Pythons putting on this big, extravagant, over-long show - perhaps to justify the high ticket cost of seeing the show there in London? - with endless dancing and musical numbers, and some celebrity guest stars (on the DVD we only see Mike Meyers and Eddie Izzard on stage with the troupe; Warwick Davis and Stephen Fry, among others, also appeared during the show's run, and can be seen, briefly, in the DVD extras. Brian Cox and Stephen Hawkins appear in a funny taped segment).\n\nThe old skits performed here feel tiresome; the clips from Flying Circus are too familiar to be funny. The only genuine laughs occurred when one of the Pythons deviated from the anticipated - either purposely (a new gag scripted into an old skit) or accidentally (because someone has flubbed/forgot a line or ad-libbed an unexpected joke). The longest and best laugh of the entire show came toward the end in the combination Pet Shop/Cheese Shop skit with Michael Palin and John Cleese.\n\nThe big thing missing was irreverence, not taking themselves too seriously. Things got off to a good start with a funny piece of animation that revealed Graham Chapman's head - which then got kicked like a football (English football). Unfortunately, this was followed up by the still-unfunny-as-it-was-back-on-MPFC llama skit, with John Cleese and the Pythons addressing the audience in Spanish (not French, as in the original skit, if I recall correctly). There were far too many musical numbers, which I found myself fast-forwarding through. Hey, at least that helped cut down on this DVD's long running time!\n\nMonty Python Live (Mostly) is the troupe taking a victory lap as establishment figures - not the take-no-prisoners comedy radicals that they once were. Besides, \"Sit on my Face\" seems awfully quaint in comparison to the potty-mouth kids of South Park. The end result here would've been much better if they'd allowed themselves to tweak their known skits and come up with something new and surprising, audience expectations be damned.\n\n(On a side note, the booklet accompanying the DVD gives thanks to Tim Brooke-Taylor for allowing use of The Four Yorkshiremen skit but doesn't credit Marty Feldman as co-writer of the skit. It was originally performed on the At Last The 1948 show by Feldman, Brooke-Taylor, Cleese and Chapman).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt3872778/"
}