{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hye-ja Kim",
            "url": "/name/nm1067547/"
        },
        {
            "@type": "Person",
            "name": "Won Bin",
            "url": "/name/nm1047193/"
        },
        {
            "@type": "Person",
            "name": "Jin Goo",
            "url": "/name/nm1918588/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 66832,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "Mother",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043365/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0197091/"
        },
        {
            "@type": "Person",
            "name": "Bong Joon Ho",
            "url": "/name/nm0094435/"
        },
        {
            "@type": "Person",
            "name": "Eun-kyo Park",
            "url": "/name/nm2977474/"
        }
    ],
    "datePublished": "2009-05-28",
    "description": "A mother desperately searches for the killer who framed her son for a girl's horrific murder.",
    "director": [
        {
            "@type": "Person",
            "name": "Bong Joon Ho",
            "url": "/name/nm0094435/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQzMTg0NDA1M15BMl5BanBnXkFtZTgwODUzMTE0MjE@._V1_.jpg",
    "keywords": "acupuncture,murder,golf course,golf ball,murder of a girl",
    "name": "Madeo",
    "original_info": {
        "id": "Mother & Son_2000",
        "name": "Mother & Son",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oOgiandujaOo_and_Eddy_Merckx"
        },
        "dateCreated": "2009-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1216496/"
        },
        "name": "Hilarious and insightful mystery, an emotional cornucopia",
        "reviewBody": "Bong manages to capture some of the poignancy of motherhood in his film Mother, which concerns an elderly single mother (played by Hye-ja Kim) and her son Yoon Do-joon (played by Bin Won). Do-joon is mentally disabled, he has a low intelligence and seems to have problems with his memory. His mother is absolutely devoted to her son. Bong throws light on that extraordinary capacity of some women to totally subjugate their own lives to those of their children, who live for the pep that they get seeing often unappreciative family members troughing their way through their latest offering.\n\nDo-joon is framed up fairly early on by the police for a murder that they can't really be bothered to investigate thoroughly. So mum is on the case, you'd better believe it! This involves for example bringing in drinks for all the members of the detective bureau on a visit to the precinct. There's a lot of tragedy in the movie, but it's offset by a comedy that is at times is almost outrageous in it's manipulativeness, Bong's really being directly provocative at times (though not in a salacious sense)! There's a grand surreal scene at one point where he convinces you that a very minor character is going to perform a deeply uncanny suicide, and then something totally banal happens instead. One of my favourite scenes is a scene on a golf course where a shot dollys across to some action taking place in sugar-white bunkers, which would not be out of place in a Fellini movie.\n\nBong was playing with my emotions throughout, he set up affiliations between me and other characters only to subvert them or rebuild them later, he builds scenes to emotional explosiveness just for the sake of it. The film leaves you emotionally confused at times, Bong's smashing all the buttons on the telephone, and so you don't really know what number is being dialled. The effect is deliberate.\n\nBottom line I think it's a celebration of motherhood, but it's not sugar-coated, it's really warts and all. Congratulations Mr Bong!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A mother desperately searches for the killer who framed her son for their horrific murder.",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3905684505",
        "name": "Mother: Trailer #1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTkxMDM0MzEyNF5BMl5BanBnXkFtZTcwODM1NjQxMw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTkxMDM0MzEyNF5BMl5BanBnXkFtZTcwODM1NjQxMw@@._V1_.jpg",
        "uploadDate": "2010-01-26T10:16:13Z",
        "url": "https://www.imdb.com/video/vi3905684505/"
    },
    "url": "/title/tt1216496/"
}