{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yahoo Serious",
            "url": "/name/nm0000635/"
        },
        {
            "@type": "Person",
            "name": "Helen Dallimore",
            "url": "/name/nm0197940/"
        },
        {
            "@type": "Person",
            "name": "David Field",
            "url": "/name/nm0275913/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1162,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026203/"
        },
        {
            "@type": "Person",
            "name": "Yahoo Serious",
            "url": "/name/nm0000635/"
        },
        {
            "@type": "Person",
            "name": "David Roach",
            "url": "/name/nm0730000/"
        }
    ],
    "datePublished": "2000-03-24",
    "description": "A very clumsy man and his UFO-obsessed girlfriend discover a plan made by his boss to market eggs laced with nicotine.",
    "director": [
        {
            "@type": "Person",
            "name": "Yahoo Serious",
            "url": "/name/nm0000635/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4MTg5MjQxMF5BMl5BanBnXkFtZTcwNjk1NTMyMQ@@._V1_.jpg",
    "keywords": "australian,candy cinema,egg,german shepherd,female stockinged feet",
    "name": "Mr. Accident",
    "original_info": {
        "id": "Mr. Accident_2000",
        "name": "Mr. Accident",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vchimpanzee"
        },
        "dateCreated": "2004-08-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0156807/"
        },
        "name": "He wasn't serious!",
        "reviewBody": "After the MGM lion, the first words we see are 'A Serious Film'. Don't you believe it!\n\nAs a child, Roger lived in a trailer, and his parents were cruel. They discouraged him from using his imagination, and because of the way he was brought up, he became obsessed with taking things apart.\n\nIn the present, Roger lives in a high-rise apartment building. We are introduced to a very accident-prone man. Then he goes to work at The Big Egg. More chaos! We later learn the only reason he has a job is that he is friends with Lyndon, one of the executives. Early in the movie, Duxton takes over the company from his brother. \n\nLyndon thinks Roger should go out and meet girls. So they go to a bar, and Roger's outfit makes a Hawaiian shirt look conservative. The night doesn't go too well, but Roger later meets Sunday, a dumb blonde who has moved into Roger's building. She was dating Duxton until he was a jerk. Sunday is actually quite smart at times, and she enjoys astronomy. This helps Roger get interested in the stars as well, but an even bigger influence on Roger is the Volkswagen hubcap he finds after one of his many accidents. At least the strange bald man SAYS it is a Volkswagen hubcap ...\n\nThis was a very funny movie, though aside from Yahoo Serious and possibly Helen Dallimore and Grant Piro, I don't think anyone really could act. The physical comedy was good, but not spectacular. Every once in a while, Roger had a series of accidents. One of the best of these scenes involved a trash avalanche. There was also a string of mishaps in a restaurant, and Roger's pathetic car often provided laughs. No matter what, it would run. And the air bags worked. Eventually.\n\nWhat exactly DO you do when a waiter hands you the cork from your wine bottle? You won't believe what Roger did. And don't ask him to make you a cappucino while you're on the phone discussing exports. Especially if you want to make Chile one of your new markets. \n\nDuxton was a cruel, cruel man. He gave a new meaning to 'downsizing'. See, he took old refrigerators to a do-it-yourself recycling place. If he had a grudge ... \n\nThe version I saw was cleaned up for TV, and there were still a few risque moments, but it wasn't too bad. There seemed to be a lot of bad language that had been edited, though. considering that this was a live-action cartoon, I would have thought it would be cleaner.\n\nThis movie was good for laughs. Not a real quality production, but fun."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A very clumsy man and his UFO-obsessed girlfriend discover a plan made by his boss to market eggs laced with nicotine.",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2549662233",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzZlNzM3ZWEtZDM4OS00ZDU5LWEzYzYtNTQxMGU2ZTM1ODAyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzZlNzM3ZWEtZDM4OS00ZDU5LWEzYzYtNTQxMGU2ZTM1ODAyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-05-24T19:32:32.052Z",
        "url": "https://www.imdb.com/video/vi2549662233/"
    },
    "url": "/title/tt0156807/"
}