{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Selleck",
            "url": "/name/nm0000633/"
        },
        {
            "@type": "Person",
            "name": "Ken Takakura",
            "url": "/name/nm0847264/"
        },
        {
            "@type": "Person",
            "name": "Aya Takanashi",
            "url": "/name/nm0847328/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11784,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064941/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014629/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049480/"
        },
        {
            "@type": "Person",
            "name": "Theo Pelletier",
            "url": "/name/nm0671142/"
        },
        {
            "@type": "Person",
            "name": "John Junkerman",
            "url": "/name/nm0432719/"
        },
        {
            "@type": "Person",
            "name": "Gary Ross",
            "url": "/name/nm0002657/"
        }
    ],
    "datePublished": "1992-10-02",
    "description": "Jack Elliot, once a great baseball player, is forced to play in Japan where his brash, egotistical ways cause friction with his new teammates and friends.",
    "director": [
        {
            "@type": "Person",
            "name": "Fred Schepisi",
            "url": "/name/nm0770961/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Comedy",
        "Romance",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTY0NDc2NzUtMmRkZi00NzIyLTg5YTctNmIyZjc0NzBkZmYzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "wrapped in a towel,man wrapped in a towel,taking a bath,bathing together,nudity",
    "name": "Mr. Baseball",
    "original_info": {
        "id": "Mr. Baseball_1992",
        "name": "Mr. Baseball",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LydiaOLydia"
        },
        "dateCreated": "2001-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104926/"
        },
        "name": "Actually, a very very good film.",
        "reviewBody": "I lived in Japan at around the period in which this film is set, and I must say--this film does an OUTSTANDING job of capturing the \"feel\" of what Japan was like. Unfortunately, the accuracy of this is not appreciated by most viewers. Whoever chose the shots and locations really understood Japan well.\n\nThe movie itself should rate among the best baseball movies EVER, but doesn't because it's not about American baseball. Take \"field of dreams\" or whatever. That basically boils down to some plot contrivance about ghosts and whatnot and is only REALLY about the game at a very superficial level (despite pretentions otherwise). This one has an intelligent and realistic view of many aspects of the game--clubhouse behavior, on-field action, player-manager interactions, the business of sports, and so on. If you're into baseball movies, view this one--and if you don't like it, I challenge you to find ONE other baseball movie that does as well as capturing so many aspects of the game intelligently with a minimum of sap.\n\nCharacterizations in this movie: yes, we all know that by the end of the movie the Tom Selleck character will do something to redeem himself. In this regard, except for one interesting plot nuance (not really a twist), the plot itself is straightforward. But the characters all stand on their own--I dont think there is a single bad characterization there with the possible over-stereotyped American agent. From Yoji the interpreter through the teammates who are Japanese jocks to the strong female love interest.. well.. let's put it this way.. if you still think all Japanese look and act alike, see this movie.\n\nClearly this isn't the best movie ever made, but I really like it on a lot of levels enough that on a scale of one to ten, I honestly have to give it a 10 (and I rate a lot of movies poorly). You probably won't like it quite that much, but I think you will enjoy it--whether you are male OR female, by the way. Definately a good rent."
    },
    "url": "/title/tt0104926/"
}