{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred A. Leuchter Jr.",
            "url": "/name/nm0504875/"
        },
        {
            "@type": "Person",
            "name": "Robert Jan Van Pelt",
            "url": "/name/nm0887721/"
        },
        {
            "@type": "Person",
            "name": "David Irving",
            "url": "/name/nm0410257/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5665,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Mr. Death",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046530/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0159436/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042992/"
        }
    ],
    "datePublished": "2000-01-14",
    "description": "A cinematic portrait of the life and career of the infamous American execution device designer and holocaust denier.",
    "director": [
        {
            "@type": "Person",
            "name": "Errol Morris",
            "url": "/name/nm0001554/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGEwNjI3N2MtMjQ3Yi00ZDE2LWE2YmMtYzU5YTQ0ODlkMjEzXkEyXkFqcGdeQXVyNTc4Njg5MjA@._V1_.jpg",
    "keywords": "death in title,execution,auschwitz,revisionist,gas chamber",
    "name": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr.",
    "original_info": {
        "id": "Mr. Death: The Rise and Fall of Fred A. Leuchter Jr._1999",
        "name": "Mr. Death: The Rise and Fall of Fred A. Leuchter Jr.",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jzappa"
        },
        "dateCreated": "2009-02-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0192335/"
        },
        "name": "An Executioner is a Derelict Anyway and Finds His Friends Where He Can.",
        "reviewBody": "Fred A. Leuchter, Jr., the subject of this documentary, is a lonely man, and so a man of narrow acumen, because he's just appreciative to be liked, even by Nazi sympathizers. Errol Morris conjoins montages and music into a movie that is more reflection than subjective report. Fred Leuchter, the son of a prison warden, relatively floundered into the Death Row business. An engineer by training, he was inspired by the urge for more competent and compassionate execution apparatuses. He'd seen electric chairs that fried their sufferers without killing them, poison gas chambers that endangered the witnesses, gallows not efficiently constructed to break the neck. He went to work fashioning better versions of these devices, and soon prisons throughout the US were taking his council.\n\nNotwithstanding his advance in trade, he was not, we understand, particularly well-received socially, though he does come to marry a waitress he meets owing to his habit of more than forty cups of coffee a day. We hear her offscreen voice as she balks at Fred's belief that their trip to Auschwitz was their honeymoon, where she had to wait in a freezing car, looking out for guards. Leuchter's visit to Auschwitz was the crossroads in his work. He was asked by a neo-Nazi Holocaust denier to provide a professional opinion at his trial. Zundel financed Leuchter's 1988 trip, where he chiseled off chunks of brick and mortar in buildings used as gas chambers and had them examined for leftover cyanide. He resolves that the chambers never had capacity for gas.\n\nThere is a fault in his report, needless to say. The lab technician who analyzed the samples for him protests that cyanide would sink into bricks but to the measure of one-tenth of a hair. By chiseling large bits, Leuchter had eroded his sampling by several thousand times, not even taking into account the ravages of half a century. To find cyanide would have been supernatural. No bother. Leuchter became a darling after-dinner mouthpiece in the neo-Nazi circle, and the camera captures how his face illuminates and his whole body appears to embrace their cheers and ovations, how thrilled he is to shake hands with his new friends. Other people might recoil from the derelict position of a Holocaust denier, to say the least. An executioner is a derelict anyway and finds his friends where he can.\n\nNo filmmaker can be accountable for those reluctant or unfit to take in his or her film with a discerning view. Anyone who leaves this deeply unsettling film concurring with Leuchter lays claim with him on the verge of psychosis. What's unsettling about the film is the way Leuchter is fairly honorable up till the point at which the neo-Nazis sink their talons into him. Those who are revolted by ethnic cleansing and other forms of government-sponsored genocide sometimes have no pangs when the state executes them one by one, testing them on elephants as is appallingly shown early in this film through dog-eared stock footage. One can even be a two-term president after governing the most restless American Death Row on record.\n\nIn cinema, the Holocaust intensifies melodrama in that the conquest of the soul never struck so victorious against atrocity, because the atrocity is so confounding. Morris's haunting documentary tries to do something distinct. It's to attempt to penetrate the thought process of denial. You meditate on the general concept of denial, not as some postwar sensation but as something that was intrinsic in the undertaking itself. Those people did those things. The mystery is how. It's about deciphering why Fred Leuchter holds these beliefs.\n\nThere is paradox in of so many U.S. states heaping tax money on this guy's work, just to oust him because of his distasteful affiliations. The capability of so many people to live contentedly with the notion of capital punishment may be a hint to how so many Europeans could live with the Holocaust: When you swallow the idea that the state has the right to kill someone and the right to decide what is a cardinal wrongdoing, you're nearly there. Mr. Death offers no complacent position of judgment. He doesn't make it obvious for us with light ethical categorizations, because people are formidably paradoxical and can get their minds around fearsomely peculiar notions.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0192335/"
}