{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ching-Ying Lam",
            "url": "/name/nm0482580/"
        },
        {
            "@type": "Person",
            "name": "Siu-Ho Chin",
            "url": "/name/nm0157785/"
        },
        {
            "@type": "Person",
            "name": "Ricky Hui",
            "url": "/name/nm0401204/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4191,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Mr. Vampire",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163276/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069083/"
        },
        {
            "@type": "Person",
            "name": "Ricky Lau",
            "url": "/name/nm0490605/"
        },
        {
            "@type": "Person",
            "name": "Cheuk-Hon Szeto",
            "url": "/name/nm1022277/"
        },
        {
            "@type": "Person",
            "name": "Barry Wong",
            "url": "/name/nm0938944/"
        }
    ],
    "datePublished": "1985-09-28",
    "description": "The planned reburial of a town elder goes awry as the corpse resurrects into a hopping, bloodthirsty vampire, targeting everyone responsible for digging the grave. A Taoist Priest and his two disciples attempt to stop the terror.",
    "director": [
        {
            "@type": "Person",
            "name": "Ricky Lau",
            "url": "/name/nm0490605/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Action",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWUyNGExOTYtZjlmNy00NWMwLThlYmMtMmUwMjkwNzdmYTgwXkEyXkFqcGdeQXVyMjc2NTQ1MTI@._V1_.jpg",
    "keywords": "corpse,taoist priest,kung fu,vampire,ghost",
    "name": "Geung see sin sang",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BA_Harrison"
        },
        "dateCreated": "2006-09-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089371/"
        },
        "name": "A highly influential Hong Kong comedy-horror classic.",
        "reviewBody": "Lam Ching Ying stars as a Taoist priest who, along with his two bumbling students (Ricky Hui, Chin Siu-Ho), is called upon to help re-bury a rich man's father. On exhuming the corpse, he discovers that the dead man has become a vampire. Before long, the priest must do battle with the fanged terror (Yuen Wah), whilst simultaneously dealing with a beautiful female ghost (Pauline Wong) who has entranced one of his assistants (and is capable of detaching her head when necessary!).\n\nDirector Ricky Lau skillfully blends slapstick humour, acrobatic martial arts and the supernatural to deliver a seminal piece of Hong Kong comedy-horror cinema that would prove be a major influence on many films to come (including the brilliant A Chinese Ghost Story). A rather slow first half hour introduces us to the characters and sets up the basic plot elements; the rest of the film sees our hapless good guys first falling foul of the otherworldly creatures and then battling to set things right.\n\nLess of a martial arts movie than a comedy, fans of fast and furious fight action will probably be disappointed, however those who love crazy Chinese humour (an acquired taste and one which I sometimes struggle with) will find plenty to enjoy as the gags come thick and fast (Ricky Hui is particularly funny as Man Choi, the assistant who gets bitten by the vampire and almost becomes one himself).\n\nBut by far my favourite part of the film is the stunningly captured scene which introduces viewers to the female ghost: in a mist enshrouded night-time forest, the supernatural seductress is carried by four spooky assistants, before gliding gently through the air to come to rest in a tree. Lovely cinematography accompanied by a haunting song make this a totally magical moment.\n\nMy second favourite moment is the introduction of the gorgeous Moon Lee as Ting-Ting, the rich man's daughter. With her impossibly cute features, Moon Lee is truly a delight to behold.\n\nAlthough I enjoyed Mr. Vampire, I don't seem to be quite as fanatical about it as some. However, I do agree that, even if you're not a huge fan of Hong Kong cinema, with so much craziness and energy packed into its 96 minutes, this highly influential classic is well worth a watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Mr. Vampire",
        "duration": "PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi406040345",
        "name": "Mr. Vampire",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGU1NjEzYWMtNTc5OS00NjY2LWEwMzktNjQyZDY2YmE5MTdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGU1NjEzYWMtNTc5OS00NjY2LWEwMzktNjQyZDY2YmE5MTdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2014-10-25T04:45:49Z",
        "url": "https://www.imdb.com/video/vi406040345/"
    },
    "url": "/title/tt0089371/"
}