{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tusshar Kapoor",
            "url": "/name/nm0969428/"
        },
        {
            "@type": "Person",
            "name": "Kareena Kapoor",
            "url": "/name/nm0004626/"
        },
        {
            "@type": "Person",
            "name": "Amrish Puri",
            "url": "/name/nm0700869/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1256,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Rumi Jaffery",
            "url": "/name/nm0415514/"
        },
        {
            "@type": "Person",
            "name": "A. Karunakaran",
            "url": "/name/nm0440269/"
        }
    ],
    "datePublished": "2001-05-25",
    "description": "Karan, a small time musician, tries to win over a girl named Pooja.",
    "director": [
        {
            "@type": "Person",
            "name": "Satish Kaushik",
            "url": "/name/nm0442479/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTJlYWEyM2MtZWFkOC00MmZkLTk4ZmQtYmIzYWI4ZGJiMWU1XkEyXkFqcGdeQXVyNTkzODE5NTg@._V1_.jpg",
    "keywords": "nightclub,dream,mother son relationship,love letter,slacker",
    "name": "Mujhe Kucch Kehna Hai",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shmsndr8"
        },
        "dateCreated": "2011-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0284328/"
        },
        "name": "A nice, refreshingly different love story",
        "reviewBody": "Boy meets girl. They fight. They fall in love and end up together after fights and misunderstandings. That is typical Bollywood love story for you. Which, fortunately, MKKH is not! Directed by Satish Kaushik, MKKH is a refreshingly different romantic story. The story centers on Karan (Tusshar) who is weak in studies but is good at heart. He helps friends and is good in music but is disinterested in studies. On a Diwali night, after being rebuked by his Dad (Dalip Tahil) for helping a friend in attempting to elope with a politician's daughter, he sees a girl for the first time on a road. He gets infatuated with this beautiful girl and would later come in contact with her. She is Pooja (Kareena).\n\nFate has Karan saving Pooja, almost dying in the attempt. Pooja and Karan become fast friends. Karan, who was already attracted to Pooja, falls madly in love with her. Despite repeated prods from friends and his sister (Rinkie Khanna), Karan fails to open up his heart to Pooja. One day, Pooja gets a chance to study in Harvard and off she has to go. Will Karan be ever able to tell her his feelings? A simple love story on the surface, MKKH has symbolic undertones that I guess very few can comprehend. On a Diwali night, the inner darkness of Karan is dispelled by the divinity in the form of Pooja, a bright student. It is also in a temple where fate brings him close to Pooja again. The point is clear, the divinity has plans to show Karan the true meaning of life through Pooja. Not for nothing does Karan feel that he has a timeless relationship with Pooja. It is actually divinity that touches Karan in the form of Pooja.\n\nSlowly, Karan transforms into a responsible man. He becomes mature enough to place his lover's interests above himself. What happens in the end, will move any romantic. View it from the light I pointed out and you are bound to find a very different meaning altogether at the climax. It is not only a tale of love. It seemed to me also as a story of a young, irresponsible man trying to find a goal in his life. In his case, it is love that shows him the way.\n\nBrilliant direction by Satish Kaushik with not one scene extra in the film and no excess KJo type emotions. Lilting music by Anu Malik. I particularly liked \"Rabba Mere rabba\", though other songs like the title track, \"Maine koi Jadoo\", \"Jabse Dekha Hai\", \"Dupatta Mera\" and \"Pyar Re\" are also great to listen to. \"Rehna Hai\" is also great. 10 years have passed and they frequently come back to my play-list.\n\nTusshar was nice as a newcomer. He was an excellent choice and the feeling you get of a mismatched couple when you watch him and Kareena together just makes it right for the film. Kareena seldom looked so beautiful and acted well, though she was a bit raw those days. Dalip, Amrish and the rest are first-rate too.\n\nOverall, a nice movie that can give you a long, lingering smile that will come back every time you remember about the film. In my case, it does."
    },
    "url": "/title/tt0284328/"
}