{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Beanie Andrew",
            "url": "/name/nm1019663/"
        },
        {
            "@type": "Person",
            "name": "Don Arrup",
            "url": "/name/nm0037482/"
        },
        {
            "@type": "Person",
            "name": "Emily Brannen",
            "url": "/name/nm1131113/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 147,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053299/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018083/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018574/"
        }
    ],
    "datePublished": "2001-06-13",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Earnhart",
            "url": "/name/nm0247434/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc1MzQ4MDg1OF5BMl5BanBnXkFtZTcwODA3NTAwMQ@@._V1_.jpg",
    "keywords": "vietnam war veteran,reenactment,horror filmmaking,kazoo,junkyard",
    "name": "Mule Skinner Blues",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jmarco68"
        },
        "dateCreated": "2002-02-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0290010/"
        },
        "name": "a review from brooklyn college",
        "reviewBody": "After viewing Mule Skinner Blues I came away realizing that it was not like many documentaries that I have seen before. I found it to be highly stylized and incorporated many elements from fiction films. Like fiction films it had an actual soundtrack. It wasn't the usual no frills soundtrack that one finds in a documentary film. The director used fantasy sequences to help us get inside the minds of the characters. There was one particular sequence when Steve Walker was describing Vietnam and the director spliced in footage of explosions and combat sounds to help paint a picture for the viewer. I liked the whole approach to the film and the idea in that it showed a slice of Americana that is not familiar to all of us. The movie shows a different slant on the American dream by showing that these people living in a trailer park have dreams and aspirations to become famous although their situation seems hopeless. The film also acts as a film about a community group. It shows how these former alcoholics and eccentrics band together as a community to help Beanie make his film. Another thing that contributed to my liking this film is the way the director kept the film somewhat fast-paced. He did not allow the editing to lag and become boring. He edited the sequences in such a way that it switched between characters, keeping your interest going and not staying on one character for too long. The director himself said \"For me, the greatest sin a filmmaker can make is to create monotony, so it's my goal to make a documentary film that's every bit as thrilling, engaging, and visually stimulating as the fiction genre allows.\" I also think that the director did an important thing by allowing us to see some of the footage that Beanie filmed with his camera. This helps to show that this is how Beanie really is. That footage was not shot by the director so we know that it is not influenced by his ideas; it is from the real authentic point of view of the character. All in all I enjoyed Mule Skinner Blues - I feel that it has the potential to change the documentary film genre because of the way it used elements of fiction filmmaking."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sundance Channel",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1218117913",
        "name": "Mule Skinner Blues",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWUzZGMxOTctMmMxYi00YWRjLThmNDUtYTRmMzcxZjA5ZDk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWUzZGMxOTctMmMxYi00YWRjLThmNDUtYTRmMzcxZjA5ZDk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:21:02Z",
        "url": "https://www.imdb.com/video/vi1218117913/"
    },
    "url": "/title/tt0290010/"
}