{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Loren Dean",
            "url": "/name/nm0000363/"
        },
        {
            "@type": "Person",
            "name": "Hope Davis",
            "url": "/name/nm0204706/"
        },
        {
            "@type": "Person",
            "name": "Jason Lee",
            "url": "/name/nm0005134/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9341,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003216/"
        },
        {
            "@type": "Person",
            "name": "Lawrence Kasdan",
            "url": "/name/nm0001410/"
        }
    ],
    "datePublished": "1999-09-24",
    "description": "In the small town of Mumford, a psychologist of the same name moves in and quickly becomes very popular, despite a questionable past.",
    "director": [
        {
            "@type": "Person",
            "name": "Lawrence Kasdan",
            "url": "/name/nm0001410/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmQ4NTc3YjAtMjk0MC00MGUwLTkzN2MtYjg0ODQzM2MyM2Q4XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "falling in love,assumed identity,starting over,psychologist,secret",
    "name": "Mumford",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SKG-2"
        },
        "dateCreated": "1999-09-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0140397/"
        },
        "name": "Sneaks up on you",
        "reviewBody": "There's a moment in MUMFORD where Mary McDonnell, who plays a woman obsessed with buying things, is talking to Loren Dean, who plays the main character, a psychologist whose name, Mumford, is the same as the town he and McDonnell live in, and she gets the look on her face which cartoon characters get when they think of an idea(and the light bulb goes on over their head), and all of a sudden realizes what's wrong with her. In a way, this movie from writer-director Lawrence Kasdan is like that. A lot of people have complained at how slow moving this is, but it's all the better for it to sneak up on you. And instead of just providing quick fix solutions for his patients, Mumford just gently prods and nudges until they find the path for themselves. Of course, this may just be an elaborate way of saying, \"Physician, heal thyself,\" but that may be the point.\n\nIf you look at this in one way, you might think Mumford is merely a passive character, who only comes to life when he falls in love and when his secret is revealed. But gradually, you come to realize what's going on. Not only is his reticence a cover(a good one until he's exposed), but it's a way of, as I said, just gently prodding his patients to the right path. So he is active, but just in subtle ways. You need a subtle actor to handle that, and Loren Dean does quite a good job in that department. Hope Davis, who if there's any justice in this world will become a star, is also good as the patient he falls in love with. Their scenes together reminded me of the relationship between William Hurt and Geena Davis in THE ACCIDENTAL TOURIST, a Kasdan film this shares a lot with. And the rest of the cast is quite good as well(it's also nice to see Elisabeth Moss, so good in IMAGINARY CRIMES, still getting work, though I hope it's bigger roles in the future).\n\nMy only complaint was the scene where Mumford explains to Jason Lee(also excellent) and us what his past really was. The details themselves were okay, but the sequence was shot in grainy video stock(I think; I'm not an expert here), which, while it pays off later, is distracting here, particularly with its point-of-view camera. Still, this is a minor quibble for a movie which will leave you with a big smile on your face the entire way through.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this comedy",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3792635673",
        "name": "Mumford",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjM2NzJhNzMtZmZhNi00MGIxLTk0MmYtNjcwYWExMjE0ZGUzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjM2NzJhNzMtZmZhNi00MGIxLTk0MmYtNjcwYWExMjE0ZGUzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:36:58Z",
        "url": "https://www.imdb.com/video/vi3792635673/"
    },
    "url": "/title/tt0140397/"
}