{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Helen Hunt",
            "url": "/name/nm0000166/"
        },
        {
            "@type": "Person",
            "name": "Chad Allen",
            "url": "/name/nm0020354/"
        },
        {
            "@type": "Person",
            "name": "Larry Drake",
            "url": "/name/nm0236952/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 640,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056700/"
        },
        {
            "@type": "Person",
            "name": "William Wood",
            "url": "/name/nm0940083/"
        }
    ],
    "datePublished": "1991-09-24",
    "description": "Pamela Smart knows exactly what she wants and is willing to do anything to get it. She is fed up with teaching, and her marriage offers little excitement. Looking for a way out she applies for a job at a local TV station. When her...",
    "director": [
        {
            "@type": "Person",
            "name": "Joyce Chopra",
            "url": "/name/nm0159154/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmViZmZlZjktMTAzMi00ODY3LWI0ZTQtNWM0MDM3MDgxMzM5XkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_.jpg",
    "keywords": "reference to van halen,reference to whitesnake,musician,christmas,twelve days of christmas",
    "name": "Murder in New Hampshire: The Pamela Smart Story",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MarieGabrielle"
        },
        "dateCreated": "2006-11-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102484/"
        },
        "name": "Helen Hunt as a nasty sociopath....",
        "reviewBody": "she does quite well in this made for TV film. She certainly provides the audience with the personality of a hate-worthy narcissist, who, once she cannot get her way, and rise to stardom on TV news, decides the way to solve her career problem is to have her husband executed.\n\nPamela Smart apparently was able to manipulate a student, Billy (well portrayed by a young Chad Allen). She worked as media director at a high school, but that was not good enough for her lofty aspirations, so she manipulated Billy and his friend to murder Greg Smart, promising them insurance money as pay-off. (There was no money). There is actually an amusing scene after her husband has been murdered, and Pamela Smart is worried about how she will look on the 6PM news.\n\nHank Stratton as Gregory Smart is a bit too innocent, but we do feel sorry for his fate. Seems an odd question, but did Pam Smart ever hear of divorce?.\n\nHoward Hesseman is not in the film long enough, but offers a good performance, and the courtroom scenes are thankfully left to a minimum. Michael Learned and Ken as Greg's well-meaning parents.\n\nOverall a decent docudrama which has probably been elevated to cult status by now, as Pamela Smart in real life is now petitioning for yet another appeal. 7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0102484/"
}