{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wesley Snipes",
            "url": "/name/nm0000648/"
        },
        {
            "@type": "Person",
            "name": "Diane Lane",
            "url": "/name/nm0000178/"
        },
        {
            "@type": "Person",
            "name": "Daniel Benzali",
            "url": "/name/nm0073137/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 31700,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009834/"
        },
        {
            "@type": "Person",
            "name": "Wayne Beach",
            "url": "/name/nm0063511/"
        },
        {
            "@type": "Person",
            "name": "David Hodgin",
            "url": "/name/nm0388227/"
        }
    ],
    "datePublished": "1997-04-18",
    "description": "A young woman is murdered in the White House. Homicide detective Regis investigates while Secret Service works against him. He's assigned agent Chance. She eventually cooperates after a man's framed.",
    "director": [
        {
            "@type": "Person",
            "name": "Dwight H. Little",
            "url": "/name/nm0514546/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2EyYTAyNjAtNGQ3MC00NTE0LThmNGItN2Q4MWY2YzMyYzczXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "african american,oval office,secret service,secret service agent,murder",
    "name": "Murder at 1600",
    "original_info": {
        "id": "Murder at 1600_1997",
        "name": "Murder at 1600",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-01-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119731/"
        },
        "name": "Bog standard, workman-like thriller",
        "reviewBody": "At a time when America's foreign policy has put them in a situation where American servicemen are being held in China and conflict is possible, things are complicated by the discovery of a young woman's body in a room in the White House (the 1600 of the title). DC Detective Regis is brought in to investigate the crime but finds himself hampered by the secret service covering up and classifying key evidence sources. Regis, with the help of Agent Nina Chance finds himself drawn up into a deeper conspiracy.\n\nThis is quite a workman-like thriller. It's not very good but it's not very bad either. The plot starts well but gets a little ponderous at times and perhaps requires more than a little suspension of disbelief at times (a point where Snipes breaks into the White House through underground tunnels and walks round dressed as a cleaner is perhaps a step too far!). However the overall concept is ok and it is easy to believe that the Secret Service would take any steps necessary to cover anything that could embarrass the Presidency. However it's also a big leap to take for granted that Snipes and co. could get quite as far as they do.\n\nSnipes is OK in the lead, however he doesn't quite get above the role of \"tough cop\" that we see in tonnes of cop movies. Attempts to give him a deeper character by having him build historical models in his spare time didn't really cut it for me. Similarly Lane is pretty much a non-entity in the film - I just didn't have any strong memories for her or her character at the end, I don't know if this was her fault or the fault of the script. The instantly recognisable Benzali is good and manages to bring a little menace to the role but doesn't have a great deal to work with. The role of National Security Advisor is well played by Alan Alda - he does a good job, but I did have a problem at the start of the film because I don't think of him in this type of film (Manhattan Murder Mystery - Yes, any other genres - not really), however once I got past this I was fine. Ronny Cox (he of so many screen bad guys) is given a small thankless role as the President. He doesn't have much to do and again it just never feels like he's comfortable with the role - contrast with his characters in things like Robocop and Total Recall to see the difference in his performances.\n\nOverall this is a standard thriller that isn't very memorable but will pass the time easily enough. Once watched I doubt that you'll rush to see it again."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2811691289",
        "name": "Murder At 1600",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzMyZDFmOTAtNzNhZi00ZGJjLWFjY2UtZmExMTQxNTMwNzBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzMyZDFmOTAtNzNhZi00ZGJjLWFjY2UtZmExMTQxNTMwNzBmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:07:37Z",
        "url": "https://www.imdb.com/video/vi2811691289/"
    },
    "url": "/title/tt0119731/"
}