{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter O'Toole",
            "url": "/name/nm0000564/"
        },
        {
            "@type": "Person",
            "name": "Siân Phillips",
            "url": "/name/nm0680795/"
        },
        {
            "@type": "Person",
            "name": "Philippe Noiret",
            "url": "/name/nm0634159/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3548,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "GP",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0242924/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0152396/"
        },
        {
            "@type": "Person",
            "name": "Max Catto",
            "url": "/name/nm0146386/"
        },
        {
            "@type": "Person",
            "name": "Stirling Silliphant",
            "url": "/name/nm0798103/"
        }
    ],
    "datePublished": "1971-01-15",
    "description": "A lone survivor from a British naval ship is obsessed with getting revenge on a German U-boat crew that massacred his shipmates in the water.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Yates",
            "url": "/name/nm0946811/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzMyNjJiY2YtMmU1OC00NjI3LWI1NDktMjExMTcwZTNkODY1XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "boat,sole survivor,seaplane,submarine,torpedo",
    "name": "Murphy's War",
    "original_info": {
        "id": "Murphy's War_1971",
        "name": "Murphy's War",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thinker1691"
        },
        "dateCreated": "2007-04-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067458/"
        },
        "name": "Revenge, and the Lone Survivor",
        "reviewBody": "It arises in every war. Destruction on a grand scale and then a private battle on a more secular stage. \"In every massacre\" quotes the sage, \"there is always a survivor.\" Such is the premise in the film \"Murphy's War.\" During the final months of World War Two, a German U-Boat commander, (Horst Janson) cruising the South American coast line, attacks and sinks a British ship of war, killing all aboard. Examining the ship's wreckage, the German commander is satisfied he not only destroyed the English ship, but did in fact kill the entire crew. Leaving the carnage behind, the audience realizes an English sailor from the stricken ship, survived. His name is Murphy, brilliantly played by Peter O'Toole. Having lived through the terrifying ordeal, many would believe, one should be glad to be alive and to seek a safe distance between himself and the deadly submarine. That is not the conclusion of seaman Murphy who believes the only way he will be able to rid himself of the nightmarish screams of his dying comrades is to seek out and destroy the German U-Boat. This might be a death-wish to some, but not to Murphy who believes that regardless of the inevitable outcome of the war, his sole purpose in life is revenge. Trying to convince him of this mad adventure is Dr. Hayden (Sian Phillips) a female doctor working among the tribal people of the Amazon. In addition, Murphy not only discovers a repairable English sea-plane, but an amiable, aging and exhausted Oil company employee, named Louis Brezon. (Philippe Noiret) Louie has worked in the forgotten, backwaters of the Amazon for years, patiently waiting the end of the war. Now with Murphy seeking his help and relentless revenge, Louie offer's a bit of sound advice. \"You're a small and lonely man Murphy, like me, the world will never build us a monument. The only difference is; I know that.\" Thus the confrontation between the obsessed man and the powerful Submarine easilly become classic drama. ****",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0067458/"
}