{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anil Kapoor",
            "url": "/name/nm0438463/"
        },
        {
            "@type": "Person",
            "name": "Sameera Reddy",
            "url": "/name/nm1213820/"
        },
        {
            "@type": "Person",
            "name": "Aditya Pancholi",
            "url": "/name/nm0659156/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1905,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0097738/"
        },
        {
            "@type": "Person",
            "name": "Sanjay Gupta",
            "url": "/name/nm0348495/"
        },
        {
            "@type": "Person",
            "name": "Sameer Malhotra",
            "url": "/name/nm1330848/"
        },
        {
            "@type": "Person",
            "name": "Milap Zaveri",
            "url": "/name/nm1179457/"
        }
    ],
    "datePublished": "2004-12-10",
    "description": "A small-time criminal, betrayed by his girlfriend and owing money to a fearsome crime lord, agrees to travel to Goa for a drug deal and becomes involved with a local woman and her much older husband, both of who want to kill each ...",
    "director": [
        {
            "@type": "Person",
            "name": "Sanjay Gupta",
            "url": "/name/nm0348495/"
        }
    ],
    "duration": "PT2H31M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2NiOTg5ZjgtNzkwNy00YmZhLWFhYjgtMzUwODlmNzM2ZjkyXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "keywords": "woman wrapped in a towel,wife murders her husband,husband wife relationship,drugs,drug deal",
    "name": "Musafir",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shehzada0"
        },
        "dateCreated": "2005-02-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0430381/"
        },
        "name": "The Kaante team is back and 'Yes' again with a bang",
        "reviewBody": "The banner white feather films are back with their third product after the successful KAANTE (directed by Sanjay Gupta) and box office dud PLAN (directed by Harish Shetty, once assistant of Sanjay Gupta). But again Sanjay Gupta is back on the directors seat.\n\nInspired by Oliver Stone's U-TURN (1997; Sean Penn, Nick Nolte, Jennifer Lopez, Billy Bob Thornton) but you can say that Musafir is 100 times better than the original.\n\nLucky (ANIL KAPOOR) wanted his own house, a wife, a family and starts a new life. Lucky is betrayed by his girlfriend, chased by a drug king Billa (Sanjay Dutt) and sent to Goa to do a drug deal to get his life back. Lucky meets many people in his life , who gives his life a new twist. After that what happens and will he be able to get his life back or death is waiting for him, you have to watch it by yourself.\n\nVishal-Shekhar's music is another portion that deserves strong marks. 'Ishq Kabhi Kariyo Na', 'Saaki Saaki' and 'Door Se Paas' are already popular and camera work is the best in the Koena Mitra track, ‘Saaki Saaki', which is one of the best erotic number in the Indian films. Cinematography is of first class.\n\nAfter PUKAR, this is the best performance and award winning performance of ANIL KAPOOR. After MUNNABHAI M.B.B.S., this is again the award winning performance of SANJAY DUTT.\n\nAfter a long long time, ADITYA PANCHOLI delivered something great though his role was small but still he manage to make his appearance felt and showed that he is one of the best performers of Indian film industry.\n\nAfter KAANTE, MAHESH MANJREKAR delivered one more confident performance and one can say that he delivers his good only in SANJAY GUPTA movies.\n\nThe surprise in this film is SAMEERA REDDYS performance which everybody will agree that this movie should be the launch pad of SAMEERA REDDY instead of the box office dud MAINNE DIL TUJHKO DIYA. She was confident in front of the senior actors.\n\nSHAKTI KAPOOR and KOENA MITRA performances were just about okay.\n\nOn the whole, MUSAFIR has style and substance. At the box-office, it will be a sure shot hit and will leave all the previous movies released back. 4 Out of 5 (same as KAANTE)"
    },
    "url": "/title/tt0430381/"
}