{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Meryl Streep",
            "url": "/name/nm0000658/"
        },
        {
            "@type": "Person",
            "name": "Cloris Leachman",
            "url": "/name/nm0001458/"
        },
        {
            "@type": "Person",
            "name": "Henry Dinhofer",
            "url": "/name/nm0227693/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12938,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013899/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Pamela Gray",
            "url": "/name/nm0336861/"
        }
    ],
    "datePublished": "1999-10-29",
    "description": "Story of a schoolteacher's struggle to teach violin to inner-city Harlem kids.",
    "director": [
        {
            "@type": "Person",
            "name": "Wes Craven",
            "url": "/name/nm0000127/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTU0ODZiNTktMTI0OC00NzZjLTlhZTMtYTE3ZjVlMmVhMmI4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "violin,teacher,school,female protagonist,musician",
    "name": "Music of the Heart",
    "original_info": {
        "id": "Music of the Heart: Bonus Material_1999",
        "name": "Music of the Heart: Bonus Material",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "luke-a-mcgowan"
        },
        "dateCreated": "2015-09-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0166943/"
        },
        "name": "Who'd have thought to find such a soaring feel good movie in the filmography of Wes Craven?",
        "reviewBody": "In honour of the passing of Wes Craven, I wanted to seek out a film of his. Of course, as the go-to-guy for horror movies, my least favourite genre, I had to scan through his filmography to find the bizarrely out-of-character film Music of the Heart. As the only non-horror film on the list, it won the honour fairly easily.\n\nIt surprises me to no end that a horror film maestro could create what is probably one of the best feel-good movies I have ever seen. I can pick a passion project when I see it, and I am positive that Craven was passionate about this story and to telling it right. When I was growing up, music lessons were everything to me. You could escape into a whole other world when you practised, and the instrument became a friend when none other might be. This film captured that more than any other I've seen. \n\nFor a character who looks and sounds like Meryl Streep, it is amazing how much Meryl Streep vanishes into Roberta. She captures with full conviction the passion she has for her music, whilst also layering her character with personality quirks that inform us why her marriage has broken down. Streep layers that with bursts of anger, sadness and even humour that never feel out of place because they feel like Roberta's real emotions. She could have walked into my high school's music department and wouldn't have felt even a little bit out of place. This is probably my favourite ever Meryl Streep performance. From an unknown supporting cast, Angela Basset is stunningly effective as Janet, a Harlem principal holding a school together with her bare hands.\n\nThe film essentially splits into two halves, with a ten year break in between. The first is Roberta's struggle to deal with the breakdown of her marriage and her desire to make the program work not to help the kids, but to make ends meet. But as the first act goes on, interactions with the kids show her how much the program means to them - even the troublemakers who give her flack but show up week after week in spite of everything. In the second half, ten years later than the first, Roberta's program is in jeopardy and she must fight to maintain it, because she has seen now how much good it can do. \n\nThe relationship between Roberta and the kids - especially Jade Yorker's DeSean and Victoria Gomez's Lucy - is beautiful and believable, even as she occasionally hits stumbling blocks associated with kids in Harlem - incidental murders, domestic violence and hostility from black parents. Screenwriter Pamela Gray does a terrific job avoiding the trappings of White Saviour but focusing more on how music helps children, regardless of who their teacher is. \n\nSometimes I felt that there were a few unnecessary subplots, such as Roberta's love life - both of her love interests fizzle out without much impact on the story. Other times, serious moments are swept over quickly, like when a father and daughter turn up to the concert announcing \"they took the car and violin\", which is quickly ignored. But I watched this film with a smile on my face the whole way through - just as the proud parents beamed at their underprivileged children performing beautiful music on stage. I would never have though to find such a feel-good movie in the filmography of a great horror director, but it just goes to show that just like music in the hearts of Harlem, you should never judge a book by its cover.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0166943/"
}