{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jessica Lange",
            "url": "/name/nm0001448/"
        },
        {
            "@type": "Person",
            "name": "Armin Mueller-Stahl",
            "url": "/name/nm0000090/"
        },
        {
            "@type": "Person",
            "name": "Frederic Forrest",
            "url": "/name/nm0002078/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8145,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094459/"
        },
        {
            "@type": "Person",
            "name": "Joe Eszterhas",
            "url": "/name/nm0000390/"
        }
    ],
    "datePublished": "1990-01-19",
    "description": "A lawyer defends her father accused of war crimes, but there is more to the case than she suspects.",
    "director": [
        {
            "@type": "Person",
            "name": "Costa-Gavras",
            "url": "/name/nm0002020/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDE3NjgxZWMtZGFhZC00NzMxLWE0MTEtYzI2N2Y2MmMzN2E3XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "war crime,looking at oneself in a mirror,reference to the chicago bears,reference to the chicago cubs,columbia tristar",
    "name": "Music Box",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ma-cortes"
        },
        "dateCreated": "2019-12-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100211/"
        },
        "name": "Very good film about an attorney who defends his father against accusations that has executed Nazi war crimes",
        "reviewBody": "A thought-provoking and intelligent film dealing with brooding and interesting deeds. The picture blends courtroom thriller, political post-boiler and domestic melodrama. It revolves around an advocate at law, Jessica Lange, defending her father , a too quiet Armin Mueller Stahl, of being a Hungarian war criminal, accused to commit grisly massacres in Hungary. The allegedly good father is a retired Hungarian blue-collar living in Chicago these last 37 years and is today framed of being head of a Hungary Special Section, a death squadron under Nazi supervision . If she loses, her daddy faces deportation charges, and then juzged at Hungary by a strict and expeditive criminal court . As the case progresses, she must struggle to remain objective, but things go wrong.\n\n Very fine drama with emotion, suspense, intrigue and a curiously impactanting finale. This thoughtful film provides a series of portrayals of some ethnic roles who result to be highly convincing. Awesome interpretation from Jessica Lange as the obstinate solicitor who comes to terms with the possibility his dad is culprit and adequate acting by Armin Mueller Stahl as the accused father who faces extradition counts . Most of the other interpretations are fine, as Donald Moffat, Frederic Forest as the prosecutor attorney, Cheryl Bruce, Michael Rooker as lawyer's boyfriend and a little boy, Lukas Hass, in spite his age he gives one of the best performances.\n\nIt contains an evocative and sensitive musical score by Philippe Sarde, including Hungarian and ethnic sounds. As well as atmospheric and appropriate cinematography by Patrick Blossier, being shot on location in Chicago and Budapest, Hungary . The motion picture was compellingly directed by Constantin Costa Gavras. He is a veteran filmmaker with a long career, nowadays, he's directing still, including several provoking, political and engaging movies, such as : Z, State of siege, The confession, The sleeping car murders, Missing, Hanna K, Conseil de Familie, Betrayed, Mad city, Amen, The axe, among others. Rating 8/10. Above average. Essential and indispensable seeing. Well worth watching.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A lawyer defends her father accused of war crimes, but there is more to the case than she suspects.",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4006855449",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjQzZDY5OGYtODVmMC00NjM1LWFjZTgtOTRjYmU0YTY2OWRiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjQzZDY5OGYtODVmMC00NjM1LWFjZTgtOTRjYmU0YTY2OWRiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-25T14:44:03.661Z",
        "url": "https://www.imdb.com/video/vi4006855449/"
    },
    "url": "/title/tt0100211/"
}