{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Arrow",
            "url": "/name/nm0037390/"
        },
        {
            "@type": "Person",
            "name": "Jimmy Buffett",
            "url": "/name/nm0119364/"
        },
        {
            "@type": "Person",
            "name": "Eric Clapton",
            "url": "/name/nm0002008/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 128,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "datePublished": "1997-11-28",
    "description": "On 15 October 1997, the artists Phil Collins, Arrow, Carl Perkins, Mark Knopfler, Sting, Elton John, Eric Clapton and Paul McCartney among others performed the concert \"Music for Montserrat\" in the Royal Albert hall in London for ...",
    "director": [
        {
            "@type": "Person",
            "name": "Julia Knowles",
            "url": "/name/nm0461536/"
        }
    ],
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxMjg2NjQyN15BMl5BanBnXkFtZTcwNzYxNjYyMQ@@._V1_.jpg",
    "keywords": "concert film,tv special",
    "name": "Music for Montserrat",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ccthemovieman-1"
        },
        "dateCreated": "2008-06-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0324983/"
        },
        "name": "Amazing To See All These Stars Sharing The Stage!",
        "reviewBody": "Wow, this was a shock to see rock mega-stars like Eric Clapton, Paul McCartney and Mark Knopfler side-by-side-by side on stage for a couple of numbers. Add in Phil Collins on drums, Ray Cooper on percussion, Elton John and Jools Holland on keyboards and more good backup musicians, plus an orchestra and big choir and it all made for a memorable night, I'm sure, for those at Royal Albert Hall in London in 1997.\n\nThe benefit concert in September of '97 for the residents of Montsserat, a Caribbean island which had been devastated by a volcano the year before. Many of the aforementioned artists had recorded some of their famous songs on that island at the Air Studios at Montsserat.\n\nIn addition to the above, there was Sting, Jimmy Buffet, Arrow & His Band and Carl Perkins. It's always a thrill to see and hear rockabilly legend Perkins doing \"Blue Suede Shoes,\" which he also was wearing! Sadly, Carl died a little over two years after this concert.\n\nMy personal likes of this concert included Buffet's catchy number \"Volcano,\" with new lyrics covering what happened at Montserrat; Phil Collins' entertaining \"Take Me Home;\" John doing his first hit, \"Your Song;\" a wonderful low-key collaboration between Clapton and Knopfler on \"Layla;\" Clapton's guitar solos and some good keyboard work by Holland on \"Same Old Blues;\" and the rousing finish of \"Kansas City,\" led by McCartney, who seemed to be the featured performer in this galaxy of rock stars.\n\nWith almost two hours of music, anyone can find enough material here to give them an entertaining night of music and when all of these guys get together for the final couple of songs.....well, that has to be seen to be believed. This is a real collector's item for music lovers.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0324983/"
}