{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Kelman",
            "url": "/name/nm0446986/"
        },
        {
            "@type": "Person",
            "name": "Lori Hallier",
            "url": "/name/nm0356590/"
        },
        {
            "@type": "Person",
            "name": "Neil Affleck",
            "url": "/name/nm0012682/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 23273,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051074/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0695373/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0782075/"
        },
        {
            "@type": "Person",
            "name": "Stephen A. Miller",
            "url": "/name/nm0589357/"
        },
        {
            "@type": "Person",
            "name": "John Beaird",
            "url": "/name/nm0063583/"
        }
    ],
    "datePublished": "1981-02-11",
    "description": "A decades-old folk tale surrounding a deranged murderer killing those who celebrate Valentine's Day turns out to be true to legend when a group defies the killer's order and people start turning up dead.",
    "director": [
        {
            "@type": "Person",
            "name": "George Mihalka",
            "url": "/name/nm0586198/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGQxOTg2ZTgtMTU4MS00MDI2LTgxZjYtNzg0ODI4YzNhYTE2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "slasher,slasher killer,canuxploitation,mass murderer,heart ripped out",
    "name": "My Bloody Valentine",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gavin6942"
        },
        "dateCreated": "2009-11-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082782/"
        },
        "name": "The Slasher That Paramount and the MPAA Tried to Kill",
        "reviewBody": "Twenty years ago, Harry Warden went nuts and slaughtered a bunch of people on Valentine's Day. The mining town he hailed from canceled subsequent V-Day dances, but when they try setting one up again, Warden seemingly returns with his pickax, ready to hack the local kids up and leave his mark. Things can only go bad from here.\n\nDirector George Mihalka brings us another holiday-themed slasher, riding the success of \"Black Christmas\", \"Halloween\" and \"Friday the 13th\"... and paving the way for \"April Fools Day\". But George is a nice guy and I don't want to say he's just one among the crowd. There were hundreds of 80s slashers, but only a few stand out today. \"Bloody Valentine\" is, of course, one of them.\n\nEven in its original, neutered glory (anywhere from three to nine minutes were cut) the film stands as a good film. Without any really notable actors or actresses (okay, so Neil Affleck had a brief role in \"Scanners\"), and being Mihalka's one big mark, the film carries itself on story, acting and blood. The blood, while lacking a times, comes gushing through in others. And like any good slasher, the killer's identity is not revealed until the end... leaving us guessing until the last twist of the knife (or ax).\n\nSlasher fans need to pick up the Lions Gate special edition. While the double-disc with \"April Fools Day\" is cheap and still worth watching, you don't really know this film until you've seen it uncut. The gore, oh my, the gore! It's actually a shame that it took so long for a company to come along and save this film because it was even better than we once assumed... Mihalka could have been one of the 80s greats (and, in my mind, he still is).\n\nIf you've been a horror fan and avoided this one, please see it. Sure, it's mostly mindless fun -- kids drinking and making out, getting hacked up -- but I can watch variations of this formula dozens, scores or hundreds of times. There's something fun about a simple stalking film that you can't always get from other films that try too hard to be clever. And I like thinking films, but a night with buddies and booze... you need a slasher. And this is the one you should pick.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Twenty years ago, a tragic accident in a mine on St. Valentine's Day took the lives of five miners. The disaster occurred while supervisors left their posts to attend the town's annual Valentine's Day dance. The only survivor, Harry Warden, was confined to a mental institution after the ordeal.",
        "duration": "PT1M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2283715097",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2RmY2U0OTctNGRiNi00MDY0LTljNjAtNzI2OTVmNmRiZmViXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2RmY2U0OTctNGRiNi00MDY0LTljNjAtNzI2OTVmNmRiZmViXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2019-01-19T01:13:11.142Z",
        "url": "https://www.imdb.com/video/vi2283715097/"
    },
    "url": "/title/tt0082782/"
}