{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chris Makepeace",
            "url": "/name/nm0538485/"
        },
        {
            "@type": "Person",
            "name": "Adam Baldwin",
            "url": "/name/nm0000284/"
        },
        {
            "@type": "Person",
            "name": "Matt Dillon",
            "url": "/name/nm0000369/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10120,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047553/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005168/"
        },
        {
            "@type": "Person",
            "name": "Alan Ormsby",
            "url": "/name/nm0650276/"
        }
    ],
    "datePublished": "1980-09-26",
    "description": "When a boy comes to a new school and gets harassed by a bully, he acquires the services of the school's most feared kid as a bodyguard.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Bill",
            "url": "/name/nm0082300/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmRhNDNkNGItODAzZC00OWFkLWE4MDAtMWIzMDlmNzQwZDNiXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "bully,locker room,chicago illinois,bicycle,boy protagonist",
    "name": "My Bodyguard",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thomandybish"
        },
        "dateCreated": "2001-03-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081207/"
        },
        "name": "Moving story of friendship and adolescence",
        "reviewBody": "Of all the teen flicks that came out of the 1980s, MY BODYGUARD is one of three that stands out as an intelligent and moving study of American adolescence that doesn't now look like a dated genre piece(THE BREAKFAST CLUB and SAY ANYTHING are the others). Sure, there's shaggy hair and all the other things that date the movie fashion-wise, but the characters shine with humanity and poignancy, and that makes the movie memorable. In fact, some could convincingly argue that the movie is all about the characters, people that movie audiences will care about. Add to that the situation of being the new kid and trying to survive the jungle of high school(something most every American teen can relate to), and you have a great little film. Chris Makepeace is the new kid who tranfers to a urban Chicago highschool from a private school and immediately runs afoul of school bully Matt Dillon. Searching for a solution to his predicament, Makepeace enlists Adam Baldwin, a silent, hulking classmate with a mysterious past, to protect him. What unfolds is a rare friendship between Makepeace and Baldwin, as we learn more about Baldwin's character and some terrible secrets he holds. Whether intentional or not, the film sends a message that the people we encounter everyday are just that, people with feelings and problems and not just the labels or stereotypes we assign them. Makepeace needs Baldwin for protection from Dillon, and Baldwin needs Makepeace's friendship to rescue him from the isolation he has endured as a result of past experiences. One unusual aspect of the movie is that several of the adult characters are sympathetic or even quirky, a rarity in teen films. Ruth Gordon shines as Makepeace's feisty grandmother, and Martin Mull puts in a turn as the bumbling but well-meaning father. And, unlike the nihilistic teens of today's current crop of movies, the teens(with the exception of Dillon and his cronies)are likable, friendly, and positive. They readily accept Makepeace and then Baldwin, after they see that the rumors about him are just that. This gives the movie a positive feel to it.\n\nDefinitely a winner. If you've ever been a teenager, wondered if you would belong, attended a high school or had to do battle with a bully, you'll find something to like about MY BODYGUARD."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this 80s film",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3216966937",
        "name": "My Bodyguard",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTM5YWZjMTAtNmYzNi00NmFlLWJhYjEtYThiMzk0NmI3OWFlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTM5YWZjMTAtNmYzNi00NmFlLWJhYjEtYThiMzk0NmI3OWFlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-28T04:48:36Z",
        "url": "https://www.imdb.com/video/vi3216966937/"
    },
    "url": "/title/tt0081207/"
}