{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ashton Kutcher",
            "url": "/name/nm0005110/"
        },
        {
            "@type": "Person",
            "name": "Tara Reid",
            "url": "/name/nm0005346/"
        },
        {
            "@type": "Person",
            "name": "Andy Richter",
            "url": "/name/nm0725200/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 30038,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Person",
            "name": "David Dorfman",
            "url": "/name/nm0233563/"
        }
    ],
    "datePublished": "2003-08-22",
    "description": "After a man is asked to house sit for his boss, he becomes determined to get closer to the boss's daughter, but events keep unfolding that stop him from achieving his goal.",
    "director": [
        {
            "@type": "Person",
            "name": "David Zucker",
            "url": "/name/nm0001878/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE4MjA0MzQ5OV5BMl5BanBnXkFtZTcwNTY3MDAwMQ@@._V1_.jpg",
    "keywords": "boss' daughter,crush,reference to o.j. simpson,kiss,housesitting",
    "name": "My Boss's Daughter",
    "original_info": {
        "id": "My Boss's Daughter_2003",
        "name": "My Boss's Daughter",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "m0rg16"
        },
        "dateCreated": "2004-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0270980/"
        },
        "name": "This is not a comedy, it's a tragedy.",
        "reviewBody": "I didn't like one bit of this movie. It was more like a Greek Tragedy play than a modern day comedy. It made me feel bad. Feel bad because the jokes were pretty bad, the plot was pretty bad and it felt like it was going to go on forever. Add to that, that we have seen this type of movies for years. We know how it's going to end. It tries to be somewhat serious at times. The movie brings up some issues that would better be left in dramas or TV Series. Not in comedy films, featuring Ashton Kutcher and Tara Reid.\n\nThe plot is about Tom Stansfield, that is working for some big publishing company. He has some great ideas for books, but is afraid of his boss, who happens to be a huge monster. At one point he starts to like this girl, who also works for the company. She asks Tom if he could watch her and her fathers house for her when she goes to a party. It just so happens that her father is Tom Stansfield's boss.\n\nOf course, Tom gets himself into numerous \"hilarious\" situations, which we all have seen dozens of times before. It's somewhat similar to Home Alone, in the way that Tom gets unexpected visits from a dozen uninvited guests that stir up some \"fun\" situations.\n\nI found myself extremely annoyed at Ashton Kutchers character. Because he was never developed, and all he ever did was getting yelled at by different people, and never has the courage to stand up for himself. Instead he just utters a couple of lines and accepts what's happening to him. This kind of cheap character development is extremely annoying. In the end scene he just \"pops\" up and suddenly he has developed and is brave enough to stand up for himself (how this happens, we never know).\n\nThe jokes are old, the movie is short, the plot is weak, the actors are crap, everything about this film is below par. Add to that that this so called \"comedy\" actually makes you depressed! That, if anything, warrants a \"Extremely Bad Comedy\" stamp.\n\nI give it a 3/10. We've seen it ALL before. Absolutely nothing new. And nothing funny..."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "HV CT #1",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3253706265",
        "name": "My Boss's Daughter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWVlZDA4NjgtNTM2Ny00ZTY3LWJmZmQtOGViZDQyMTk3NDI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWVlZDA4NjgtNTM2Ny00ZTY3LWJmZmQtOGViZDQyMTk3NDI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:37:28Z",
        "url": "https://www.imdb.com/video/vi3253706265/"
    },
    "url": "/title/tt0270980/"
}