{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Nia Vardalos",
            "url": "/name/nm0889522/"
        },
        {
            "@type": "Person",
            "name": "Lainie Kazan",
            "url": "/name/nm0443577/"
        },
        {
            "@type": "Person",
            "name": "Steven Eckholdt",
            "url": "/name/nm0248692/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1158,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046803/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093124/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036575/"
        },
        {
            "@type": "Person",
            "name": "Marsh McCall",
            "url": "/name/nm0564664/"
        },
        {
            "@type": "Person",
            "name": "Nia Vardalos",
            "url": "/name/nm0889522/"
        }
    ],
    "datePublished": "2003-02-24",
    "description": "The continued adventures of the Portokalos family from the film \"My Big Fat Greek Wedding\", starting when Nia and her husband return from their honeymoon.",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NzkzMDAtZDIwMS00OTA1LWFmZmMtMDNlNDI5MGM5M2Y1XkEyXkFqcGdeQXVyMTkzODUwNzk@._V1_.jpg",
    "keywords": "grammatical error in title,sitcom comedy,greek,spin off,cultural conflict",
    "name": "My Big Fat Greek Life",
    "original_info": {
        "id": "My Big Fat Greek Life: The Entire Series_2003",
        "name": "My Big Fat Greek Life: The Entire Series",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "eviljanet"
        },
        "dateCreated": "2003-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0340256/"
        },
        "name": "Must..unplug..laughtrack..",
        "reviewBody": "What was the first thing I noticed wrong about the sitcom version of \"My Big Fat Greek Wedding\"...besides the obvious absence of John Corbett? The stupid laugh track. I cringed when I heard that damn repetitious laughing at every stupid joke. As many of you, I greatly enjoyed the movie..and I was in the process of watching it on DVD when I realized that the TV show was about to come on. So, I put the movie on pause.\n\nIt was only when I got to the part where the family said to 'Thomas'...\"You look different!\" (a painfully obvious joke about the different actor, a lackluster Steven Eckhardt who played 'Mark' on \"Friends\").\n\n 'Cousin Nikki' was noticeably rounder..probably because she was either pregnant or just had her daughter when the pilot was filmed. No matter. It wasn't TOO noticeable. Gus was too..I don't know. Whiny, I guess. Lanie Kazan was pretty much the same. As was Nick, but more nosy about his sister's life.\n\nNow to Nia. First of all, I think it was just plain stupid to change the two main character's names. Why did they find that this was necessary? I personally liked the name Toula. It was cool. It was different. And I liked the named Ian. It wasn't cool, but he had the same name as Gandalf. Just because it was a different actor playing the part didn't mean that they had to change the character. Her acting in the sitcom was only sub-par. She seemed to be trying to hard.\n\nNow about Eckholdt. In the movie, Ian was sweet and willing to go the distance to be accepted into Toula's (or NIA's) family. Are we to believe that Thomas said \"To Hell with it!!\" after they married? It's possible. Maybe he decided he couldn't put up with her family's crap. Well, it has happened before. But I just found myself disliking Thomas more and more as the minutes droned on, until I wanted Nia to serve him some poisonous souvlaki to rub him out. The character I liked was Aunt Voula. Andrea Martin is wonderful. Thank God \"MBFGL\" still has her.\n\nI'm being too negative. As the show progressed, it grew on me a little until Gus pointed out that the house was across from the restaurant, not next door to him. Of course, I'm sure the show will grow..let the actors settle back into their characters, give them some material to work with that will ignite genuine laughs, not like the uncomfortable laughs derived from me during the pilot. Material that will not just give a cheap laugh. Material that would've probably been in the movie if it was a little longer."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Series Trailer",
        "duration": "PT1M51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1410447897",
        "name": "My Big Fat Greek Life: Complete Series on DVD",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTRmOTdiYWUtZTk3ZS00ZmM3LTg3NTMtZGNmN2YxMTAwNWZkXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTRmOTdiYWUtZTk3ZS00ZmM3LTg3NTMtZGNmN2YxMTAwNWZkXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2019-01-10T17:15:16.212Z",
        "url": "https://www.imdb.com/video/vi1410447897/"
    },
    "url": "/title/tt0340256/"
}