{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Ray Walston",
            "url": "/name/nm0001827/"
        },
        {
            "@type": "Person",
            "name": "Bill Bixby",
            "url": "/name/nm0084642/"
        },
        {
            "@type": "Person",
            "name": "Pamela Britton",
            "url": "/name/nm0110219/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2769,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-Y7",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052608/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049888/"
        },
        {
            "@type": "Person",
            "name": "John L. Greene",
            "url": "/name/nm0338804/"
        }
    ],
    "datePublished": "1963-09-29",
    "description": "Exigius Twelve and a Half, an exoanthropologist from the planet Mars, becomes stranded on Earth after his one-man spaceship narrowly misses a NASA rocket plane and crashes near Los Angeles. The alien is rescued by Tim O'Hara, a ne...",
    "genre": [
        "Comedy",
        "Family",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDg2NTMwMzA0M15BMl5BanBnXkFtZTcwMTQ2NDUxMQ@@._V1_.jpg",
    "keywords": "fish out of water,spaceflight,psychotronic series,1960s,alien on earth",
    "name": "My Favorite Martian",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2017-09-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056775/"
        },
        "name": "Landmark sci-fi comedy",
        "reviewBody": "From personal opinion, the 1960s was a great decade for television, seeing shows with creative concepts and memorable characters that fascinated and appealed at the time and still hold up now ('The Addams Family', 'The Munsters', 'Doctor Who', 'Bewitched' and 'I Dream of Jeannie' are just a few examples, have a soft spot for 'Batman' too).\n\n'My Favourite Martian' is another one of those shows. When it comes to sci-fi and comedy, individually and meshed together, 'My Favourite Martian' is a landmark and still holds up as enormously enjoyable. The third season sadly doesn't live up to the high quality of the first two, with story lines that were predictable, repetitive, disjointed (with them having one half of something and then a second half of something else entirely) and got overboard with the silliness to the point of redundancy, also relying on a formula that got stale too early.\n\nWith the first two seasons, the story lines were the complete opposite. They were engrossing, imaginative and clever, succeeding as entertainment and provoking thought. Likewise with the hilarious and intelligent writing, with dialogue that makes one laugh and think. The chemistry between the well-defined, the titular character one would go as far to say is iconic, characters is simply magical.\n\nIt is impossible to think of anybody else so well suited to the title role than Ray Walston, a role he was born to play. Bill Bixby shows remarkable and perfectly pitched comic timing and works so well with Walston. All the supporting cast are very good, J. Pat O'Malley is particularly fun and Pamela Britton is charming.\n\nProduction values don't look too primitive. Although 'My Favourite Martian' does look pretty good in colour, it fares to me better in black and white where things look smoother and more atmospheric. The sets and effects are pretty inventive. The music is a good fit and it is hard to forget the theme music.\n\nOverall, a genre landmark and a near-classic if it weren't for its disappointing last season. The 1999 film that bases itself on this is not worth bothering with, the only emotions one will feel watching it are sheer disappointment, anger and questioning the point of it. 9/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "My Favorite Martian: Who's Beep Beep Beep?",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3014376729",
        "name": "My Favorite Martian: Who's Beep Beep Beep?",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzYxZTRiZDAtNWU5Zi00MWM0LWI5ZTItNjBlMmUzNWQzMzZlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzYxZTRiZDAtNWU5Zi00MWM0LWI5ZTItNjBlMmUzNWQzMzZlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-16T19:39:25.209Z",
        "url": "https://www.imdb.com/video/vi3014376729/"
    },
    "url": "/title/tt0056775/"
}