{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Victoria Abril",
            "url": "/name/nm0000721/"
        },
        {
            "@type": "Person",
            "name": "Charlotte de Turckheim",
            "url": "/name/nm0876942/"
        },
        {
            "@type": "Person",
            "name": "Alain Bashung",
            "url": "/name/nm0059817/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 307,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "alternateName": "My Father, My Mother, My Brothers and My Sisters",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080706/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071455/"
        },
        {
            "@type": "Person",
            "name": "Philippe Giangreco",
            "url": "/name/nm0316202/"
        },
        {
            "@type": "Person",
            "name": "Charlotte de Turckheim",
            "url": "/name/nm0876942/"
        }
    ],
    "datePublished": "1999-06-16",
    "description": "Young single mother has two sons and a daughter by three different fathers who are completely unaware of having fathered them. Anne's mother conjures up a plot to make everyone involved to go on a beach holiday in Mexico at the sa...",
    "director": [
        {
            "@type": "Person",
            "name": "Charlotte de Turckheim",
            "url": "/name/nm0876942/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIyNTA1NTU0MF5BMl5BanBnXkFtZTcwNjEyODQyMQ@@._V1_.jpg",
    "keywords": "single mother,mexico,beach,f rated,overalls",
    "name": "Mon père, ma mère, mes frères et mes soeurs",
    "original_info": {
        "id": "My Father_1999",
        "name": "My Father",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OliverGbyrne"
        },
        "dateCreated": "2006-05-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0206151/"
        },
        "name": "OK but nothing great.",
        "reviewBody": "This film is about a woman with three kids each made with a different guy who's tricked by her mother to go on a trip were all three men will be there. Well first of all it is important to say that it was a first film for the director De Turkein so I forgive some of the faux pas it makes. First the good,Victoria Abril of course always beautiful and I just love when she talk French with that cute Spanish accent,she on her own makes the film worth watching.The scenery is splendid,the photography was one of the highest point of that film,it made me want to pack my back and go to an exotic location. Now the bad-The kids are annoying,not too much but at times they made me cringed,its not the children's fault,its their dialog at time what they say feels rather out of place.Especially the older brother , every five minutes he would turn violent and Angry and in my opinion much too violent for this type of film,its supposed to be a nice comedy and there you get scene with the older brother trying to strangle his mother over his father being nothing like she told him he was,it felt SO out of place in that type of movie.I felt the film was struggling between being a comedy and a serious drama and it just didn't know what exactly it wanted to be. There we go this film was watchable and I wasn't too bored viewing it but the dialogs was quite poor and the all film suffered because it. But I see some promise in De Turkein and I think that with time and a better writing staff she could make a much better film than this one.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0206151/"
}