{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter O'Toole",
            "url": "/name/nm0000564/"
        },
        {
            "@type": "Person",
            "name": "Mark Linn-Baker",
            "url": "/name/nm0513021/"
        },
        {
            "@type": "Person",
            "name": "Jessica Harper",
            "url": "/name/nm0363888/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10033,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000858/"
        },
        {
            "@type": "Person",
            "name": "Norman Steinberg",
            "url": "/name/nm0825799/"
        },
        {
            "@type": "Person",
            "name": "Dennis Palumbo",
            "url": "/name/nm0658850/"
        }
    ],
    "datePublished": "1982-10-08",
    "description": "An aging, dissolute matinee idol is slated to appear on a live TV variety show in 1954, and a young comedy writer is tasked with the thankless job of keeping him ready and sober for the broadcast.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Benjamin",
            "url": "/name/nm0000907/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjlhZTYwYzgtODA5MS00OWEyLWI1MWItZThjZmRlYTQ1MGE2XkEyXkFqcGdeQXVyNDI4ODM5MDM@._V1_.jpg",
    "keywords": "womanizer,male bonding,chauffeur,stuffed animal,balcony",
    "name": "My Favorite Year",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slokes"
        },
        "dateCreated": "2003-05-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0084370/"
        },
        "name": "Plastered Makes Perfect",
        "reviewBody": "Really fun movie, with a tone and style all its own. It has the same zippy sitcom character of the set which is its main stage, and the comedic acting is often over the top. Yet it drives through some very subtle and deep ideas about what makes a celebrity tick, the price culture extracts from its most ballyhooed figures, and the scars divorce and drink can leave on those with the smoothest of surfaces.\n\nThe secret to this film's success is O'Toole, who gives up some of his most intimate and affecting moments on screen and intersperses them with ass-over-elbow feats of physical schtick that would make a Ritz Brother proud. What a shock we never saw much else from him after this tour de force. Richard Benjamin did go on to direct other films like \"Shoot The Moon,\" but he never managed to get it all absolutely right the way he did here. It's so note-perfect, from the opening shot of midtown Manhattan 1954 with the cars, outfits, and bustle all coming together beneath the strains of Les Paul and Mary Ford's \"How High The Moon\" into a tight closeup of Benjy Stone carrying a cardboard cutout of his hero, Alan Swann, through an uncaring, jostling crowd.\n\nI almost wish they could have made a sitcom featuring the King Kaiser crew, with of course Joseph Balogna, Bill Macy, Adolph Green and the rest all reprising their roles in a kind of \"Remember WENN\"-style show. O, what roads left untravelled. Balogna is so good, managing to carry off his Sid Caesar-inspired role with the same kind of aplomb that made the original Caesar early television's most dynamic and celebrated comedy performer. There's a nice scene early on where Stone sticks up for a prone Swann by telling Kaiser he can't fire the swashbuckler. \"You're a big star now, and I'm sure you always will be,\" Benjy says. \"But suppose, and I know it will never happen, you end up like this. I hope nobody does to you what you're doing to him.\" Of course Caesar did end up like this, strung out on substance-use problems that derailed his post-50s career, and knowing that gives the scene, both funny and tension-filled, a certain undertone of poignancy for those in the know.\n\nMark Linn-Baker could have taken it down a notch or two, and the Brooklyn idyll was to die for, and not in a good way. I'd like to know how the hell I'm supposed to lock lips with the woman of my dreams by stuffing my face with Chinese food and showing her old movies, but I don't think my repeated viewings have helped my love life much. It has given me many hours of pleasure though. This is one film that keeps on giving. With lines like \"Plastered? So are some of the finest erections in Europe\" \"These must be his drinking socks\" and \"Tongue...Death,\" how can it do anything less?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3935354393",
        "name": "My Favorite Year",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTliNWJiOTAtYjBiMS00MTFmLTg1ZjAtZWM2NzBhZDNhYTRkXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTliNWJiOTAtYjBiMS00MTFmLTg1ZjAtZWM2NzBhZDNhYTRkXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-17T17:03:37.167Z",
        "url": "https://www.imdb.com/video/vi3935354393/"
    },
    "url": "/title/tt0084370/"
}