{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Albert Brooks",
            "url": "/name/nm0000983/"
        },
        {
            "@type": "Person",
            "name": "Leelee Sobieski",
            "url": "/name/nm0005447/"
        },
        {
            "@type": "Person",
            "name": "Rutanya Alda",
            "url": "/name/nm0017377/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5739,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063447/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058685/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042369/"
        },
        {
            "@type": "Person",
            "name": "Jill Franklyn",
            "url": "/name/nm0291589/"
        }
    ],
    "datePublished": "2001-10-26",
    "description": "A 17-year-old girl has a troubled relationship with a 49-year-old man.",
    "director": [
        {
            "@type": "Person",
            "name": "Christine Lahti",
            "url": "/name/nm0001441/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGMyMmFjNDItNTBiZC00MjAxLTg1ODctYzQ1MmE0NmJjNzBkXkEyXkFqcGdeQXVyOTM3NjgxNjQ@._V1_.jpg",
    "keywords": "intergenerational friendship,teenage girl,goth girl,man wears eyeglasses,female director",
    "name": "My First Mister",
    "original_info": {
        "id": "My First Mister_2001",
        "name": "My First Mister",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JohnDeSando"
        },
        "dateCreated": "2001-10-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0206963/"
        },
        "name": "I can't forget that first half, where 2 human beings, unencumbered by any expectation other than their own need for connection, follow none of the formulas but love on its own terms.",
        "reviewBody": "May to December can be the cruelest months if they're about a relationship between a young woman and an older man. `American Beauty' and more recently `Ghost World' carried the usual criticism of this socially questionable alliance, from downright damage in the former to uncertainty about how it could ever work in the latter.\n\nIn `My First Mister,' starring Albert Brooks and Leelee Sobieski, the union works so beautifully in the first half of the film I thought even I could try it. Director Christine Lahti, who won an Oscar for best short film, \"Lieberman in Love,\" concentrates on the flowering friendship between a Goth girl who needs a friend and a job and a 49 year-old haberdasher who has jettisoned everyone in order to live out his life painlessly for everyone.\n\nJill Franklyn, who wrote the \"Yada Yada\" episode of \"Seinfeld,\" pens perfect lines for the understated Brooks, such as when he first sees Sobieski: \"Scram. Shoo. Why don't you go get your eyeballs pierced?\" and another time when he says, \"I want the smallest tattoo you have. Can you give me a dot, or a period?\"\n\nDirector Lahti shows her originality by letting us painfully and slowly watch a purple-haired Sobieski pull out her nose and face rings. This film is the best I have ever seen to give respect to a much-maligned paring in movies. The 17-year-old punker helps him awaken to life's interesting couplings like cavorting mannequins, and he shows her love unalloyed. When the time comes for sex, as it always does in Hollywood, no one cares, even the audience, because the point is the friendship.\n\nIn the second half of the film Lahti lets go of her originality to indulge the genre with the usual fatal twist, easy reconciliation of family, and renewal for Sobieski found in a most unbelievable coincidence. Yet I can't forget that first half, where 2 human beings, unencumbered by any expectation other than their own need for connection, follow none of the formulas but love on its own terms."
    },
    "url": "/title/tt0206963/"
}