{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Colin Firth",
            "url": "/name/nm0000147/"
        },
        {
            "@type": "Person",
            "name": "Rosemary Harris",
            "url": "/name/nm0365281/"
        },
        {
            "@type": "Person",
            "name": "Irène Jacob",
            "url": "/name/nm0001393/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3081,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103613/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018129/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Person",
            "name": "Denis Forman",
            "url": "/name/nm0286339/"
        },
        {
            "@type": "Person",
            "name": "Simon Donald",
            "url": "/name/nm0232049/"
        }
    ],
    "datePublished": "1999-08-26",
    "description": "Memoir of the lives of a family growing up on a post World War I British estate headed up by a strong disciplinarian, her daughter, her inventor husband, their ten year old son and his older sister. Through the household comes a n...",
    "director": [
        {
            "@type": "Person",
            "name": "Hugh Hudson",
            "url": "/name/nm0399853/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODZjZDEwODQtMzg1Ni00ODlmLWEwYmUtZGRjNzhhYmM1NGIzXkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_.jpg",
    "keywords": "wet dream,voice over narration,temptation,swan,scottish highlands",
    "name": "My Life So Far",
    "original_info": {
        "id": "My Life So Far_1999",
        "name": "My Life So Far",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "countryway_48864"
        },
        "dateCreated": "2002-04-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120899/"
        },
        "name": "The true story of one of the founders of BBC/TV and Chairman of The Royal Opera House, when he was a child growing up in Scotland in 1920",
        "reviewBody": "This is one of the least know, but most charming films I have ever scene.seen.\n\nEvery child deserves to have a father like Edward Pettigrew (Firth). As Frazier describes his father, \" Father is an inventer and a genius!!!\"\n\nThe film begins with a toddler Frazier, disliking his rest time, decides to have an adventure by crawling around the roof of the family castle in Argyll, Scotland. Father climbs down the steep roof with a rope attached to his waist and rescues wee Frazier, all the while barking like a dog. Frazier, (who makes comments throughout the film), observes that at that time in his life, he and his father ONLY communicated in DOG, the language they both spoke best.\n\nNaturally the film has a romantic and potentially explosively moment between Father and his brother-in-law's fiance- a 24 year old French muscian who is quite beautiful and charming. She is also very wise for her years and managed to defuse the situation before it blows up. Never-the-less, the wife, played beautifully by Mary Elizabeth Mastreontonio, finds out at a crucial moment in the film and those rock-solid marriage nearly ends at a most tragic time in young Frazier's life.\n\nBut father, being a genius, finds a way to heal the wounds caused by his split-second decision to give in to his baser instincts. The WAY he gets his wife to forgive him and laugh again is pure magic.\n\nColin Firth never looked so handsome. Not even his glorious Mr. Darcy is so appealing. This role gives him the opportunity to show all his sides. His glorious, looney sense of humor as well as his gift for drama without words. Here he is active, leaping into a freezing cold Locke, running up and down stairs, inventing things, saving his son, dancing with his wife. He gets to laugh and cry and be HUMAN.\n\nFor those who discovered Colin Firth as Mr. Darcy, My Life So Far is the glorious update!\n\nMy Life So Far in DVD has a place on honor in my collection of over 500 DVD's and VHS' One of my favorites, and, I hope soon to be yours.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0120899/"
}