{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "River Phoenix",
            "url": "/name/nm0000203/"
        },
        {
            "@type": "Person",
            "name": "Keanu Reeves",
            "url": "/name/nm0000206/"
        },
        {
            "@type": "Person",
            "name": "James Russo",
            "url": "/name/nm0751638/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 58457,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Person",
            "name": "Gus Van Sant",
            "url": "/name/nm0001814/"
        },
        {
            "@type": "Person",
            "name": "William Shakespeare",
            "url": "/name/nm0000636/"
        }
    ],
    "datePublished": "1991-07-20",
    "description": "Two best friends living on the streets of Portland as hustlers embark on a journey of self discovery and find their relationship stumbling along the way.",
    "director": [
        {
            "@type": "Person",
            "name": "Gus Van Sant",
            "url": "/name/nm0001814/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDgxMGU3YTEtODEzOC00MGVlLTk4OWUtYmY0ODU0OTI1NmMxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "male hustler,narcolepsy,homoerotic friendship,portland oregon,shakespeare's henry iv",
    "name": "My Own Private Idaho",
    "original_info": {
        "id": "My Own Private Idaho_1991",
        "name": "My Own Private Idaho",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Asa_Nisi_Masa2"
        },
        "dateCreated": "2005-03-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102494/"
        },
        "name": "A triumph of pathos and bitter poetry",
        "reviewBody": "I adore this movie, have owned it on VHS long before there was anything else and have seen it an insane number of times. It isn't perfect, but with me personally, though I'm a European female and thus have no personal life experience that could resemble anything the main characters go through, it struck a chord of universality that made it heart-breaking. The pathos in it, the bitter poetry, the warped magic is just unbelievably beautiful... and painful. It is visually inventive and the casting - even Keanu Reeves's, which has been so often criticised - is top-notch. Reeves's character is a flippant, spoilt young man who goes through life acting in his own self-glorifying drama: what better actor to cast in that role than someone whose acting is so contrived? And Phoenix... well, what can I say... to me, this is THE River Phoenix role, the one that can single-handedly turn him into an immortal, a legend. The Shakespearian quotations I adored: the relationship between Prince Hal and Falstaff from Henry IV, Part II is among the most mesmerising of the Bard's dramatic repertoire - that play was like an emotional earthquake to me. My Own Private Idaho caught its spirit perfectly, and translated it into a context that was original in its own right yet more faithful to Shakespeare in feeling than a more literal transposition might have been. Also, I found the portrayal of Rome in the part in which River's character goes out there to search for his mother, refreshingly true to life and totally cliché-free. As an Italian from Rome, it's very rare that I see a non-Italian film portraying my city of origin with so much authenticity. The FEEL of the place at a given time - the late 80s - was spot-on. In conclusion: to me, not only was My Own Private Idaho one of the best adaptations of (at least parts) of a Shakespeare play that I've seen, but also a tragedy of almost Shakespearian intensity in its own right. It had it all: the unhealthy, consuming passion (the fatal flaw), the power struggles, the young heir in his reckless, youthful days eventually maturing into the arrogance of the privileged (Keanu), the parental ghost that one of the protagonists looks to as his prophetic voice, the voice that may give his life a meaning (River's search for and the flashbacks to the memory of his mother), the intense pathos throughout, the tragic deaths at the end... that film is just pure magic to me! Just writing about it makes me want to see it again - what, for the 20th time or something?! And the tragedy at My Own Private Idaho's core is so universal, it really becomes completely secondary whether it's about and between men, women, homosexuals or heterosexuals.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Fine Line",
        "duration": "PT2M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1536688409",
        "name": "My Own Private Idaho",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGJhZmM0MzEtOWQxOC00MzIyLWFlYzMtODY0OTI2MmUzMDQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGJhZmM0MzEtOWQxOC00MzIyLWFlYzMtODY0OTI2MmUzMDQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:09:34Z",
        "url": "https://www.imdb.com/video/vi1536688409/"
    },
    "url": "/title/tt0102494/"
}