{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nicholas Tse",
            "url": "/name/nm0874866/"
        },
        {
            "@type": "Person",
            "name": "Stephen Fung",
            "url": "/name/nm0298691/"
        },
        {
            "@type": "Person",
            "name": "Joey Yung",
            "url": "/name/nm1047242/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 399,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "alternateName": "My Schoolmate the Barbarian",
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044721/"
        },
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        }
    ],
    "datePublished": "2001-08-24",
    "description": "A brainy private school student is transferred to a far less elite institution, where he must fend off classmates who settle scores with fistfights.",
    "director": [
        {
            "@type": "Person",
            "name": "Siu-Hung Chung",
            "url": "/name/nm0156566/"
        },
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGU3OWRjNjEtMDc0YS00ZjBhLTk4YWMtYmE1MDhjM2IwYWMxXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
    "keywords": "school",
    "name": "Wo de Ye man Tong xue",
    "original_info": {
        "id": "My Schoolmate_2001",
        "name": "My Schoolmate",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "himboy32"
        },
        "dateCreated": "2005-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0295461/"
        },
        "name": "School Of Hard Knocks....Hell Yeah!",
        "reviewBody": "The story concerns Edward(Stephen Fung), a high flying scholar who after being expelled from his school because of an incident involving a window ledge and his ex-girlfriend, is enrolled into one of the worst schools in Hong Kong after a mix up in communication by his mother. \n\nWhile there he meets Fung, a young girl who has had a crush on Ed for a long time, he soon discovers that Students often settle their disputes using their fists rather then talking, he then finds out to his horror that the teachers do nothing to prevent this.\n\nThen in his first class he meets Stone(Nicholas Tse), who is the former \"King Of The Idividual Fight\" who had disappeared inexplicably for nine moths before returning to school\n\nUpon his return he found out that another student, named Mantis, had taken up his crown as \"King of The Individual Fight\"\n\nSoon Ed lands in big trouble with Mantis, so he asks Stone to help him.\n\nThis movie was just brilliant, it had a really cool manga comic vibe to it, very reminiscent of Volcano High(Another great movie)\n\nThe plot has some good surprises, which actually has a little room for some character development. \n\nThe characters are quite memorable,the way they are portrayed adds the the comic book feel.\n\nFrom the over baring father of the female lead to the over enthusiastic best friend of the female, to the annoying talkative croney of the villain each character adds in some way or another to the over all enjoyment of the film.\n\nThe fight scenes, directed by Chin Siu Tung of Hero fame, proves again why he's one of the best in the business, with rapid editing, good wire work and nice tight close ups of certain moves, it gives the movie a unique quality and again adds to the comic book feel.\n\nOne stand out performance came from Nicholas Tse, who comes off as the reluctant hero who must help out those who desperately need even though he does not want to get involved.\n\nI recommend this to anyone who like really fun comic book style action movies and doesn't mind having to be bombarded with goofy behaviour, I also strongly recommend you check this out if you've seen Volcano High and liked as this is right up your alley.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0295461/"
}