{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mae West",
            "url": "/name/nm0922213/"
        },
        {
            "@type": "Person",
            "name": "John Huston",
            "url": "/name/nm0001379/"
        },
        {
            "@type": "Person",
            "name": "Raquel Welch",
            "url": "/name/nm0000079/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3295,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "X",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Gore Vidal",
            "url": "/name/nm0000683/"
        },
        {
            "@type": "Person",
            "name": "Michael Sarne",
            "url": "/name/nm0765398/"
        },
        {
            "@type": "Person",
            "name": "David Giler",
            "url": "/name/nm0318429/"
        }
    ],
    "datePublished": "1970-06-24",
    "description": "After undergoing gender reassignment surgery, an aspiring actress travels to Hollywood, where she also wants to make a claim on her wealthy uncle's estate.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Sarne",
            "url": "/name/nm0765398/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzkxMzFiM2MtOTQxZS00ZWM5LTkxMDctODFkYmI3OTNmOWYxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "casting couch,movie theater,eating popcorn,transgender character,transgender protagonist",
    "name": "Myra Breckinridge",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hokeybutt"
        },
        "dateCreated": "2005-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066115/"
        },
        "name": "Only In The 60's, Baby!",
        "reviewBody": "MYRA BRECKINGRIDGE (4 outta 5 stars) Considering that this is historically considered one of the \"worst\" movies ever made, I didn't expect I was going to enjoy it... though I was curious to see how bad a train wreck it was going to be. Well, I was simply amazed at how well-done the movie actually is! To be honest, the movie is not for everyone... and I don't even know if I could actually recommend it to casual movie viewers in good conscience... but if you are a fan of truly bizarre and outrageous movies... this one is a must-see. Raquel Welch gives the best performance of her career... really! She never got many decent film roles but in this one she actually got to show that she was more than just a huge, heaving bosom. (Nonetheless, I also maintain that she probably never looked more attractive in a motion picture than she does in this one.) This movie really is a mess in certain respects but there is so much going on and most of it is so entertaining that I didn't mind the incoherence at all. The use of vintage movie clips to \"comment\" on what's going on in the storyline is brilliant. (The later HBO series \"Dream On\" also used this technique but I think this movie did it much better.) Rex Reed is perfectly cast as Myron, a gay man who decides on having a sex change (though Reed vehemently insisted throughout filming that he *wasn't* playing a gay man... uh, okay, Rex). Well, Rex turns into Raquel Welch and that's when the fun begins... he/she embarks on a quest to make men and women re-think the roles that society has imposed on them (I think that's sorta kinda supposed to be the point but it does get muddled a lot of the time). Mae West shows up for no real purpose... 76 years old and belting out her most outrageous sexual innuendos ever. (One of the recipients, a young Tom Selleck.) I never really cared much for Mae West in her prime... and was amazed how not-bad she was here! (I also am a bit reluctant to admit that I have been humming the Shirley Temple ditty that opens and closes this movie non-stop since hearing it.) John Huston probably gives one of his worst performances ever... but he's STILL worth watching... now THAT is star power! There are many classic scenes in this movie that will have you shaking your head in disbelief... could you imagine a Hollywood movie *today* that would have a buxom beauty wearing an American flag bikini, strapping on a dildo and using it on an unwilling male? I think not. Only in the 60's, baby!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "After undergoing gender reassignment surgery, an aspiring actress travels to Hollywood, where she also wants to make a claim on her wealthy uncle's estate.",
        "duration": "PT1M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2644493081",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmJlZjM2Y2QtZjI1NC00ZDhlLTk2ZTQtNTRkMzhiN2E2NjQ4XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmJlZjM2Y2QtZjI1NC00ZDhlLTk2ZTQtNTRkMzhiN2E2NjQ4XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-14T17:59:07.265Z",
        "url": "https://www.imdb.com/video/vi2644493081/"
    },
    "url": "/title/tt0066115/"
}