{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Stiller",
            "url": "/name/nm0001774/"
        },
        {
            "@type": "Person",
            "name": "Janeane Garofalo",
            "url": "/name/nm0000413/"
        },
        {
            "@type": "Person",
            "name": "William H. Macy",
            "url": "/name/nm0000513/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 68469,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024200/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0020061/"
        },
        {
            "@type": "Person",
            "name": "Neil Cuthbert",
            "url": "/name/nm0193854/"
        },
        {
            "@type": "Person",
            "name": "Bob Burden",
            "url": "/name/nm0120918/"
        }
    ],
    "datePublished": "1999-08-06",
    "description": "A group of inept amateur superheroes must try to save the day when a supervillain threatens to destroy a major superhero and the city.",
    "director": [
        {
            "@type": "Person",
            "name": "Kinka Usher",
            "url": "/name/nm0882330/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Action",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjZhZmY4NDctNWU5Mi00MGI0LTkzMGUtMjRiZWM2MTdiNjBkXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "superhero action,superhero,image comics,dark horse comics,based on comic",
    "name": "Mystery Men",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "film-29"
        },
        "dateCreated": "2003-06-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0132347/"
        },
        "name": "The Lord be praised! From time to time somebody remembers that a movie has to be entertaining!",
        "reviewBody": "If you think movies and art in general must also educate and moralize, well, it takes us to a more complex issue and I'm willing to discuss it some other time. That said, I'll cast the first stone: Is William Shakespeare educating, moralizing or just plain entertaining? But today, I'm here to celebrate this extremely funny movie. The actors brought together make a `super squad', especially the three original members of the `super team'. Ben Stiller is superb and his character `Mr. Furious' is hilarious. In fact, everyone performs his or her role perfectly. The cinematography, locations, effects, costumes, make-up, musiceverything in this movie is very well done and finely achieved. This movie also casts a beautiful actress, the waitress (Claire Forlani), who -- lo and behold! -- can act as well; and a great villain, Casanova Frankenstein (Geofrey Rush).\n\nThere's a hero, `The Shovel' (William H. Macy) who knows he's gifted but has taken numerous blows over the past twelve years, as his wife makes very clear whenever she has the opportunity. There's an Englishman from India, (the talented Hank Azaria) who throws his mother's silverware (to be precise he's a fork-thrower) There is an invisible man, who can become invisible only when nobody looks at him (himself included). There's an accursed young man who farts the enemy unconscious. There's a brave heroin, Baby Bowler (Janeane Garofalo) , whose devastating arm is a translucent bowling-ball that holds her father's skull, and when she's not throwing it against Casanova Frankenstein's evil forces, she quarrels with his father's skull, that of an anti-Communist, anti-gay autocratic and very bad tempered cantankerous old man. There are two possible outputs when one brings all of these unrealities together: One possibility is that of ending up with a ludicrous and altogether regrettable piece of junk. The other, that of this present case, one can achieve one of the funniest and most amazing pictures made in years."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Universal Pictures",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi463208729",
        "name": "Mystery Men",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjFiYTU3ZjYtMmNkMC00YTE5LWE5OWEtZmJjNmI5ZGE1MTFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjFiYTU3ZjYtMmNkMC00YTE5LWE5OWEtZmJjNmI5ZGE1MTFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:23:12Z",
        "url": "https://www.imdb.com/video/vi463208729/"
    },
    "url": "/title/tt0132347/"
}