{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Joel Hodgson",
            "url": "/name/nm0388273/"
        },
        {
            "@type": "Person",
            "name": "Felicia Day",
            "url": "/name/nm1260407/"
        },
        {
            "@type": "Person",
            "name": "Patton Oswalt",
            "url": "/name/nm0652663/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3868,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "alternateName": "Mystery Science Theater 3000",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0567173/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0632739/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0295946/"
        },
        {
            "@type": "Person",
            "name": "Joel Hodgson",
            "url": "/name/nm0388273/"
        }
    ],
    "datePublished": "2017-04-14",
    "description": "Kinga Forrester continues the B-movie watching experiments of her father and grandmother on a new test subject aboard the Satellite Of Love.",
    "genre": [
        "Comedy",
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjc0NGY5NzQtZWU5YS00NzY5LTk2YzMtMmYwZmYzNTAwNTZjXkEyXkFqcGdeQXVyNzUxNzY1NjM@._V1_.jpg",
    "keywords": "horror host,male horror host,usa horror host,usa male horror host,near future",
    "name": "Mystery Science Theater 3000: The Return",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dmhead777"
        },
        "dateCreated": "2017-04-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt6782014/"
        },
        "name": "Potential is there, but simple things ruin it",
        "reviewBody": "Mst3k is one of my all time favorite shows. Joel has never been a favorite of mine, but I really do enjoy the episodes when he is a host. When Mike became host, however, I think they polished the show exactly where they wanted it. Almost every joke was on point and hilarious. \n\nThroughout the entire run, there was almost a humble way of presenting it. They didn't need famous people or cameos at all and it seemed to do really well with the limited characters. It didn't need anything else. For a show with such a zany and not-so-serious premise, the story was great that you could follow it. If it had a cast change, they would make a comment or explain why a certain thing was a certain way. They would always acknowledge questions. The show also ended on a great note.\n\nWith the new season, it seems like it was painfully rushed and sloppy. The story is lackluster and doesn't answer a lot of questions you may have. For example, they have a lot of callbacks to previous episodes and seasons and seem to go into detail about certain things, but gloss over why the bots are back on the SOL in the first place. I know \"it's just a show and I should relax\", but with them including details to link the story to past seasons and then gloss over why the bots are back doesn't make too much sense.\n\nI actually don't mind the new cast. Jonah makes a good host that reminds me of Joel and the actor for Crow plays it very well. Tom Servo's voice however is rough. It seems like he is just trying to imitate Kevin Murphy's Servo most of the time. It is obvious because he doesn't seem to have a personality so far. I don't think it was a good casting choice, but it is the very beginning of the new season. Speaking of voices, Gypsy's new voice is terrible. I don't think that because it is a woman's voice, but because it makes the character no longer that interesting. Gypsy, to me, was always great because it was obviously a man imitating a woman. With this new voice it just doesn't add anything new. Also, her dropping in the theater to make a joke is super distracting. \n\nThe new mads are decent. I like Oswalt's character, but Kinga is far too overacted. Even for this show she is over the top and doesn't strike me as genuine like the past mads. She is rarely funny and doesn't scream \"evil\" to me. I may just have to get used to her because I found Pearl Forrester to be perfect in every way. I absolutely loved Mary's character and her timing.\n\nAs I said before, the riffs are too quick and the jokes are lackluster at best. They almost talk over one another and don't let the jokes breathe. They cram too much. Also, all these cameos are awful. They don't add anything to the show and it is not needed. I am hoping it gets renewed for another season as I think there is a lot of potential. Hopefully Joel lets Jonah make it his show a little bit rather than a rehash of Joel jokes. Overall it is a decent watch, but I don't think it demands repeated viewings.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "This season, Kinga subjects Jonah and the bots to a devious new experiment: a back-to-back marathon of six hilariously cheesy -- and riffworthy -- films.",
        "duration": "PT1M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2497821209",
        "name": "Season 2 Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjE1YzgzNmMtMmNkZi00ZWExLThiYjctNDkxOWUxNWY5YTc5XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjE1YzgzNmMtMmNkZi00ZWExLThiYjctNDkxOWUxNWY5YTc5XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-11-16T00:17:00.934Z",
        "url": "https://www.imdb.com/video/vi2497821209/"
    },
    "url": "/title/tt6782014/"
}