{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Joel Hodgson",
            "url": "/name/nm0388273/"
        },
        {
            "@type": "Person",
            "name": "Michael J. Nelson",
            "url": "/name/nm0625621/"
        },
        {
            "@type": "Person",
            "name": "Trace Beaulieu",
            "url": "/name/nm0064546/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25037,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0100393/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029768/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Person",
            "name": "Joel Hodgson",
            "url": "/name/nm0388273/"
        }
    ],
    "datePublished": "1988-05-10",
    "description": "In the not-too-distant future Joel Robinson is held captive by Dr. Forrester and TV's Frank, forced to watch B-Grade movies on the Satellite of Love with the help of his robot friends: Cambot, Gypsy, Tom Servo and Crow T. Robot.",
    "genre": [
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTA0OGRiYTMtMjliYS00ZjZkLWI2ODEtMWI5ZmM5OTBjYmNlXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "robot,robot sci fi,cringe comedy,near future,horror host",
    "name": "Mystery Science Theater 3000",
    "original_info": {
        "id": "Mystery Science Theater 3000: Gunslinger_1993",
        "name": "Mystery Science Theater 3000: Gunslinger",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aczilla-1"
        },
        "dateCreated": "2006-03-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094517/"
        },
        "name": "From Trash to Treasure: Rich Genius on a Salvation Army Budget",
        "reviewBody": "A mad scientist's plot to rule the world hurls an employee (and later a temp worker replacement) into space on a fully furnished satellite where, in the company of quick-witted robot friends, the captive is forced to watch real movies from nearly every genre imaginable that threaten to rob him completely of his sanity. That's all you really need to know to start watching, but it can't begin to scratch the surface of what you will encounter. Beneath the surface is a work of comedic genius that has held a stronger-than-cult following for almost 20 years.\n\nIn the Mystery Science Theater 3000 dictionary, you probably can find a picture of Joe Don Baker under the definition of \"irony.\" He is quoted with having threatened physical violence on the creator of MST3K after how they treated him in the film \"Mitchell,\" yet he played a trailer trash dad in \"Mars Attacks\" around the same time. It's these kinds of relationships between one movie and another, the throwbacks to our culture, and (most) performers' ability to be a good sport that makes MST3K such a brilliant program. It is only in the case of this series that too many writers don't spoil the ambiance; in fact, a large group of writers is essential to capture every flaw and possible remark that can be made about a single movie. If you grew up within the last 50 years, then you are bound to have seen most of the movies featured on MST3K. On the same token, you are bound to get most of the jokes the stars hurl at the screen, but don't be surprised if you catch something new every time.\n\nSci-fi and film purists have deemed MST3K detrimental to film genres in some arguments, and some viewers who saw the actual movies when they were released or were influenced heavily by a group of films might be taken aback by seeing their favorite movies torn to pieces for the sake of comedy. Nonetheless, MST3K has the ability to grow on virtually everyone who sees it... and has done so. The show is filmed with some of the most dated film technology while the robots and sets were literally sculpted from scraps of junk gotten from Goodwill, but the impact is lasting and any argument you may have over scientific mistakes are immediately addressed in the last line of the catchy theme song. Mexican wrestlers, Italian spies, Japanese giant monsters, 1960s-era juvenile delinquents, mad scientists, educational short films, rugged bikers, and even works of Shakespeare (well just one work but still) to name only a few types of the over-200 films featured in its 10-year run (many of which continue to hold high ranking on IMDb's worst films list), are the primary fodder of this brilliant undertaking, and you are hereby dared not to find the same amusement in every movie you see after experiencing MST3K for yourself and succumbing to its effects."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Mystery Science Theater 3000: Volume XXVI",
        "duration": "PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3369313817",
        "name": "Mystery Science Theater 3000: Volume XXVI",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGFhMTBlNjYtZDc5My00ZmU3LTlhOTQtMThhNWE3ZjcwNzkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGFhMTBlNjYtZDc5My00ZmU3LTlhOTQtMThhNWE3ZjcwNzkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-04-10T04:20:41Z",
        "url": "https://www.imdb.com/video/vi3369313817/"
    },
    "url": "/title/tt0094517/"
}