{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Abhishek Bachchan",
            "url": "/name/nm0045393/"
        },
        {
            "@type": "Person",
            "name": "Antara Mali",
            "url": "/name/nm0539507/"
        },
        {
            "@type": "Person",
            "name": "Riteish Deshmukh",
            "url": "/name/nm1299011/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 604,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098649/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137541/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137542/"
        },
        {
            "@type": "Person",
            "name": "Sulekha Bajpai",
            "url": "/name/nm1768251/"
        },
        {
            "@type": "Person",
            "name": "Musharaff Ali Khan",
            "url": "/name/nm1773660/"
        },
        {
            "@type": "Person",
            "name": "Pooja Ladha Surti",
            "url": "/name/nm1381758/"
        }
    ],
    "datePublished": "2004-11-12",
    "description": "Abhinav (Abhishek Bachchan) and Reva (Antara Mali) are two, middle-class citizens in the big city of Mumbai. Both are trying to get a breakthrough in their individual profession. Abhinav wants to be an actor and Reva wants to be a...",
    "director": [
        {
            "@type": "Person",
            "name": "Ram Gopal Varma",
            "url": "/name/nm0890060/"
        }
    ],
    "duration": "PT2H30M",
    "genre": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODA1NTQzZTktYzg4Zi00M2RjLThhMjUtZmFlNmI0MzNmNzNiXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "name": "Naach",
    "original_info": {
        "id": "Naach_2004",
        "name": "Naach",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ram-008"
        },
        "dateCreated": "2005-02-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0433605/"
        },
        "name": "Aaja Naach Le?",
        "reviewBody": "Naach A more detailed review can be obtained anywhere else in the web. This one is a good portrayal, although I do not agree with it entirely. Taran is a commercial guy and hence views from his angle only.\n\nRam Gopal Varma (RGV, seems like a political party) has created a marvel in Rangeela, so this one seems like a pale reflection of that one in some parts... I'm not even going to compare Urmila and Anthara.. both are good! The former has better acting talent, although the latter is catching up nicely.\n\nAnyways, I like Anthara's character. She is true to her art, not touched by any unnecessary emotion and definitely not too practical. She is a dance scientist, actually she is so sure of her theories that even comparing her to a scientist would offend her. Hey.. Donald Trump.. maybe you gotta ditch Melania, here is Anthara and you've already built a Taj Mahal... ain't this easy? Abhishek on the other hand is a practical fellow, who wants money, power, fame, etc. Hence these two albeit were struggling to get a break into the film industry, cannot get along, given their different styles and approach to life. This is very typical, but what I like about the movie is that it says what an Abhimaan would say in its total runtime, in one scene! What's new? This movie takes a different angle to the film industry and how different people get into it. There is always something different about RGV's movies, this one is different too, it is way too slow for his standards. In parts, it drags one almost to sleep.\n\nNoticeable It is tough to notice anything other than Anthara in the first half of the movie. I think this skin show was necessary for the dance sequences involved :-) Also, looks like Anthara is a pro in Yoga, she is way too flexible, almost like a Prabhu Devi. Aby Baby is improving as an actor with every movie. I am sure his filmstar blood is paying off rich dividends. The title song was really good, the music overall was above average.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0433605/"
}