{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Noriko Hidaka",
            "url": "/name/nm0383022/"
        },
        {
            "@type": "Person",
            "name": "Nathan Parsons",
            "url": "/name/nm1452155/"
        },
        {
            "@type": "Person",
            "name": "James Arnold Taylor",
            "url": "/name/nm0852517/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1888,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "Nadia: The Secret of Blue Water",
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0147938/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071695/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052417/"
        }
    ],
    "datePublished": "1990-04-13",
    "description": "A teen acrobat of mysterious origins and a young inventor find themselves entangled in a sinister plot that involves the fate of the world.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmU5ZDc0YzUtZjhmNi00ZWY4LWFjYjUtOWVjM2YxZWQ3NTRlXkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "falling in love,based on the works of jules verne,character name in series title,love,boy wears eyeglasses",
    "name": "Fushigi no umi no Nadia",
    "original_info": {
        "id": "Nadia: Secret of Blue Water_1989",
        "name": "Nadia: Secret of Blue Water",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kriitikko"
        },
        "dateCreated": "2008-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096591/"
        },
        "name": "Great anime series, if you can skip the filler episodes.",
        "reviewBody": "\"Nadia: the Secret of Blue Water\" (originally called \"Fushigi no umi no Nadia\", literally translating \"Nadia of the Mysterious Seas\") is 39 episodes long anime series, which was originally aired in the years 1990-1991. Series primary director was Hideaki Anno, who had previously worked as one of the animators in Hayao Miyazaki's film \"Nausicaa of the Valley of the Wind\" (1984) and who would later direct one of the most successful anime series ever; \"Neon Genesis Evangelion\" (1995-1996). The story of the series has been inspired by the novels of Jules Verne, especially \"20.000 Leagues Under the Sea\" (1870). Also Miyazaki's film \"Laputa- Castle in the Sky\" (1986) has inspired some elements of the story.\n\nSet in the year of 1890, Nadia, an orphaned acrobat girl working in circus, is trying to find a way to get to Africa to look her possible family and origins. While coming to Paris to perform, she is chased by a very Team Rocket- like gang of thieves, who try to steal \"Blue Water\", a mysterious blue stone Nadia is wearing around her neck. She is helped by Jean, a young inventor boy, who out of good heart decides to help Nadia to get to Africa. While trying to avoid any more contacts with the thieves, Nadia and Jean find themselves in the middle of a secret war between Captain Nemo, a mysterious scientist who lives in his submarine \"Nautilus\" with his crew, and Gargoyle, a power-mad masked villain. Just what is the secret of \"Blue Water\" and what is the connection of Nadia to both Nemo and Gargoyle? \n\nWhen I watched the series I was already well passed the age when the animations with good guys vs. evil world dominating villains were interesting. Yet, \"Nadia\" is not as simple as it may first look like. The characters are not just two-dimensional but have some real life in them. Especially Nadia's character; who first appears as temperamental and distrusting, but learns to become caring and what she most values in her life, when she nearly looses all. Also, her relationship with Jean is very realistic for a change. Music is captivating and the story telling dynamic. The animation itself is not the best possible quality but it really doesn't bother. Voice actors (I'm talking the original Japanese ones, for I have not heard either of the two English dubs) are doing a great job. Noriko Hidaka (who has done such great anime roles as Akane in \"Ranma 1/2\", Kikyo in \"Inuyasha\" and Near in \"Death Note\") really convinced me that she was voicing a 14 year old boy; Jean. Yoshino Takamori did a great job with temperamental but caring Nadia and Motomu Kiyokawa (Walter in both \"Hellsing\" and \"Hellsing OVA\" series) was absolutely chilling as Gargoyle.\n\nSadly, series does have one terrible down side to it: the filler episodes directed by Shinji Higuchi, that for some unclear reason were demanded in the middle of the series. During those episodes story hardly moved at all, characters loose their interest and almost every minute is spend with some of the worst anime humor ever. These filler episodes are episodes 23-29 and 32-34. Episodes 30-31 are worth seeing for the story actually moves there somewhat and the relationship of Nadia and Jean strengthens there.\n\nIf you can forgive some simple animation, unbelievable plot twists and skip the previously mentioned filler episodes, then you have a great and entertaining anime series here, that will keep you interested from the beginning to the end. Warmly recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Perfect Collection",
        "duration": "PT1M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi815530265",
        "name": "Nadia: Secret of Blue Water",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2VmYWRjY2QtOTRiNy00ZDIyLWIzNDAtOTBjOWFlYmI1NjQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2VmYWRjY2QtOTRiNy00ZDIyLWIzNDAtOTBjOWFlYmI1NjQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:23:37Z",
        "url": "https://www.imdb.com/video/vi815530265/"
    },
    "url": "/title/tt0096591/"
}