{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Spencer Tunick",
            "url": "/name/nm0876644/"
        },
        {
            "@type": "Person",
            "name": "Ron Kuby",
            "url": "/name/nm0473599/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Porcelli",
            "url": "/name/nm2078416/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 241,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036660/"
        }
    ],
    "description": "One year. Seven continents. More than 6,000 naked people--all willing to bare all for Spencer Tunick in the name of art. This globally scaled follow-up to the America Undercover documentary Naked States finds the celebrated and co...",
    "director": [
        {
            "@type": "Person",
            "name": "Arlene Nelson",
            "url": "/name/nm1315333/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWI3NWRmOWYtODc5Zi00NzllLWIxODItZWJlYjVlOTM5MjRjXkEyXkFqcGdeQXVyMjc5MDg0NDc@._V1_.jpg",
    "name": "Naked World: America Undercover",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "raymond-15"
        },
        "dateCreated": "2004-09-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0347607/"
        },
        "name": "It's barely art",
        "reviewBody": "I guess Tunick's work as a photographer will always be controversial. Is it pornography or is it art? May be neither. He does insist though that he does not want to replicate the work of others. He has gone out of his way to create something new...nudes en masse in public places. To use naked human beings thus is certainly original. He crowds thousands of them into his foreground...lying on their backs on cold damp pavements or kneeling with rear ends up. He is evidently trying to invent a new texture. It could be done with a thousand sheep (though difficult to control) but using humans in a public place is daring and adds a touch of eroticism.\n\nIs it a coincidence that in nearly every shot we see in the background an erect structure...a mast, a tower, a steeple or spire?\n\nSome of his experimental photos are better than others. One needs a lot of imagination to accept the prone figures lying haphazardly on the wharf below the \"Cutty Sark\" as a part of the ocean.. I ask you does it really look like a seascape of rippled water or rocky shore?\n\nThe most interesting part of the film is his interviews with people of different cultures and different attitudes inviting them to divest themselves of their clothes for the sake of \"art\". In his world tour he found the people of Montreal cooperative but not so in France or Japan. Amazingly 4000 turned up in Melbourne (Australia) to bare their bodies in rather bleak weather. Is it something to do with mass hysteria? As for Antarctica the few nudes in that icy region did not look at all relaxed and the penguins were rather perplexed too. It was contrived and senseless. A bare backside perched on an icy ledge has no meaning and verges on the ridiculous.\n\nOne soon gets used to the nudity which pervades this film. A number of people are asked why they agreed to be naked in front of the lens. The response in most cases was the same....it gave them a feeling of new found freedom.\n\nNote that in one scene there is a risk of danger in baring one's bottom in a public square. A man hurriedly dons his pants when an unexpected dog appears barking madly!\n\nThere is one detail which puzzles me. It's this....how do 4000 people find their clothes again after discarding them in some back alley?\n\nWhat will Spencer Tunick think of next and how long will this novelty last?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0347607/"
}