{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Allakariallak",
            "url": "/name/nm1354245/"
        },
        {
            "@type": "Person",
            "name": "Alice Nevalinga",
            "url": "/name/nm0638725/"
        },
        {
            "@type": "Person",
            "name": "Cunayou",
            "url": "/name/nm0192066/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12813,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0110877/"
        },
        {
            "@type": "Person",
            "name": "Frances H. Flaherty",
            "url": "/name/nm0280878/"
        },
        {
            "@type": "Person",
            "name": "Robert J. Flaherty",
            "url": "/name/nm0280904/"
        }
    ],
    "datePublished": "1922-06-11",
    "description": "In this silent predecessor to the modern documentary, film-maker Robert J. Flaherty spends one year following the lives of Nanook and his family, Inuits living in the Arctic Circle.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert J. Flaherty",
            "url": "/name/nm0280904/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg4Njk3MjU5Ml5BMl5BanBnXkFtZTgwOTIyODg5MTE@._V1_.jpg",
    "keywords": "inuit,igloo,kayak,canada,canadian arctic",
    "name": "Nanook of the North",
    "original_info": {
        "id": "Nanook of the North_1922",
        "name": "Nanook of the North",
        "year": "1922"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tomgillespie2002"
        },
        "dateCreated": "2012-09-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0013427/"
        },
        "name": "Still one of the greatest documentaries ever made",
        "reviewBody": "Explorer Robert J. Flaherty spent the majority of 1914 and 1915 along the Hudson Bay, doing research and exploring for a Canadian railway company. Being a keen photographer and potential film-maker, he took a camera along with him. He shot 30,000 feet of film, of the native Eskimo tribes and their alien, hunter-gatherer lifestyle. The test footage was met with universal excitement, only Flaherty dropped a cigarette on the highly-flammable nitrate film-stock whilst editing, and lost it all. He would return, only this time with the sole intent on making a narrative- driven documentary, about one specific family of Eskimos, and their highly-charismatic leader Nanook, a legendary hunter.\n\nThough it is now widely heralded as a masterpiece, and the film that gave birth to the documentary genre, the film is often criticised for its obviously staged dramatic scenes, and truth-manipulation in the search for a coherent narrative and to inject the film with an air of excitement and wonder. Personally, I have no problem with this approach, after all, one of my favourite directors Werner Herzog frequently does this in his documentary films to create a sort of artistic truth, opposed to the point-the-camera approach of cinema verite. In the modern age, we are treated to high-definition, sweeping footage of some of the most exotic and hostile corners of the planet, so it's a marvel to see where it all started, and Flaherty, faced with early, clunky film equipment and relatively little experience of film-making, created a magical documentary for an audience that, back then, knew little about the world outside their own country.\n\nAmongst the many set-pieces we are treated to, the greatest (and much- celebrated) is the building of the igloo. We watch Nanook build it with skilled precision, slab by slab, and even incorporate a window feature, in order to give the igloo some warmth, and a chunk of ice by the side of it to divert the sun's rays. With many Eskimos now adopting Western aspects into their livelihood, the film is definitely a window into the past (the Eskimos had in fact already done this, and even wore Western clothes, but Flaherty persuaded them to revert back in order to give the film more of a sense of wonder). For a film-maker who had only taken a three-week course in cinematography prior to Nanook, the film is rich with beautiful imagery. The scene that watches the family trudge into the distance as the mist blows over the snowy surface like fleeing ghosts, gives the film a gorgeous, eerie quality. If you can forgive the film's manipulations, then this is still one of the greatest documentaries features ever produced, and Nanook (real name Allakariallak) proves to be a charming protagonist.\n\nwww.the-wrath-of-blog.blogspot.com",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In this silent predecessor to the modern documentary, film-maker Robert J. Flaherty spends one year following the lives of Nanook and his family, Inuits living in the Arctic Circle.",
        "duration": "PT1M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi389858073",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWRjODJmODQtZDQ5Ni00MGNmLTk1YTAtN2Q3MGY2N2FlOTFhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWRjODJmODQtZDQ5Ni00MGNmLTk1YTAtN2Q3MGY2N2FlOTFhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-06T16:47:10.629Z",
        "url": "https://www.imdb.com/video/vi389858073/"
    },
    "url": "/title/tt0013427/"
}