{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "David McCullough",
            "url": "/name/nm0567184/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 380,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002033/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064369/"
        }
    ],
    "datePublished": "2000-11-08",
    "description": "Documentary about the rise and fall of one of the greatest military geniuses of modern times from his Corsican childhood to final exile in St. Helena.",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY2Njg3MDQ2OV5BMl5BanBnXkFtZTYwMzcyOTY5._V1_.jpg",
    "keywords": "french empire,post french revolution,napoleonic wars,character name as series title,napoleon bonaparte character",
    "name": "Napoleon",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2011-11-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0266164/"
        },
        "name": "Nearly perfect...",
        "reviewBody": "This has to be the best or among the best films about Napoleon. However, it's not quite perfect. Most of this is because at about 3 1/2 hours (not 240 minutes as is listed on IMDb), it's just not long enough or complete enough. What I mean by this is that considering what a HUGE impact he had on the world for a 20 year period, this just isn't enough time. In particular, his impact on Europe BEYOND his reign was never discussed--and deserves mention. In addition, it makes one common mistake--saying Napoleon was only 5'2\" (a common myth) when he was actually about 5'7\"--a very average height for this time period. But aside from this, it's exceptional throughout.\n\nLike so many of PBS's documentaries, this one is narrated by the historian, David McCullough. And, like these documentaries, it's full of interviews with various historians, paintings and recreations. However, unlike a typical PBS film, this one must have cost a fortune to make, as much of it was filmed in Europe--with Russian and French participants (among others). It's pretty, fascinating and compelling--even for those who are not huge history lovers. Well worth seeing.\n\nBy the way, one part of the film I found especially compelling was about Napoleon's Corsican roots. Apparently, he grew up HATING France, as this nation had conquered Corsica and forced it to become a part of their empire. In addition, when Napoleon went to the French military academy, he was looked down up for being Corsican. Could this explain how Napoleon was so willing to see so many French soldiers die for him? In other words, he was happy if his soldiers won but not all that sad to see them die either because of these early experiences.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0266164/"
}