{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Keith Carradine",
            "url": "/name/nm0001018/"
        },
        {
            "@type": "Person",
            "name": "Karen Black",
            "url": "/name/nm0000947/"
        },
        {
            "@type": "Person",
            "name": "Ronee Blakley",
            "url": "/name/nm0086867/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 27155,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021273/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037052/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Joan Tewkesbury",
            "url": "/name/nm0570219/"
        }
    ],
    "description": "Over the course of a few hectic days, numerous interrelated people prepare for a political convention.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Altman",
            "url": "/name/nm0000265/"
        }
    ],
    "duration": "PT2H40M",
    "genre": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDY0MzE3YWQtZTAzMS00ZmRlLWE3NzYtMjk0NDlkMmE4N2U2XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "assassination,altered version of studio logo,national film registry,sex scene,false promise of the american dream",
    "name": "Nashville",
    "original_info": {
        "id": "Nashville_1975",
        "name": "Nashville",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gftbiloxi"
        },
        "dateCreated": "2005-05-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0073440/"
        },
        "name": "Altman's Masterpiece: \"The Damnedest Thing You Ever Saw\"",
        "reviewBody": "Robert Altman is an extremely divisive director in the sense that you either \"get it\" or you don't--and those who don't despise his work and take considerable pleasure in sneering at NASHVILLE in particular. But there is no way around the fact that it is an important film, a highly influential film, to most Altman fans his finest films, and to most series critics quite possibly the single finest film made during the whole of the 1970s.\n\nAccording to the movie trailer available on the DVD release, NASHVILLE is \"the damnedest thing you ever saw\"--and a truer thing was never said, for it is one of those rare film that completely defies description. On one level, the film follows the lives of some twenty characters over the course of several days leading up to a political rally, lives that collide or don't collide, that have moments of success and failure, and which in the process explore the hypocrisy that we try to sweep away under the rug of American culture. If it were merely that, the film would be so much soap-opera, but it goes quite a bit further: it juxtaposes its observations with images of American patriotism and politics at their most vulgar, and in the process it makes an incredibly funny, incredibly sad, and remarkably savage statement on the superficial values that plague our society.\n\nWhat most viewers find difficult about NASHVILLE--and about many Altman films--is his refusal to direct our attention within any single scene. Conversations and plot directions overlap with each other, and so much goes on in every scene that you are constantly forced to decide what you will pay attention to and what you will ignore. The result is a film that goes in a hundred different directions with a thousand different meanings, and it would be safe to say that every person who sees it will see a different film.\n\nIn the end, however, all these roads lead to Rome, or in this case to the Roman coliseum of American politics, where fame is gained or lost in the wake of violence, where the strong consume the weak without any real personal malice, and where the current political star is only as good as press agent's presentation. For those willing and able to dive into the complex web of life it presents, Altman's masterpiece will be an endlessly fascinating mirror in which we see the energy of life itself scattered, gathered, and reflected back to us. A masterpiece that bears repeated viewings much in the same way that a great novel bears repeated readings. A personal favorite and highly, highly recommended.\n\nGary F. Taylor, aka GFT, Amazon Reviewer",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi393262105",
        "name": "Nashville",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTY2Mjc0MmQtNzc5ZC00ZGQ1LWFhMjgtM2U2MWM3ZWQzNTUwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTY2Mjc0MmQtNzc5ZC00ZGQ1LWFhMjgtM2U2MWM3ZWQzNTUwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-06-03T21:46:13Z",
        "url": "https://www.imdb.com/video/vi393262105/"
    },
    "url": "/title/tt0073440/"
}