{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Rohan Gunaratna",
            "url": "/name/nm2384254/"
        },
        {
            "@type": "Person",
            "name": "Terry McDermott",
            "url": "/name/nm4513695/"
        },
        {
            "@type": "Person",
            "name": "Patrick Fitzgerald",
            "url": "/name/nm2621631/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 521,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030960/"
        }
    ],
    "datePublished": "2004-01-25",
    "description": "Inside 9/11 provides insight into the events that led up to 9/11 by tracing the timeline from al Qaeda's earliest origins through the aftermath of 9/11 and the ongoing investigation.",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4MTEyNzk1M15BMl5BanBnXkFtZTcwMDM2MzczMQ@@._V1_.jpg",
    "keywords": "tv mini series",
    "name": "National Geographic: Inside 9/11",
    "original_info": {
        "id": "National Geographic: Guns_2005",
        "name": "National Geographic: Guns",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "prettyh"
        },
        "dateCreated": "2011-02-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0481590/"
        },
        "name": "An impressively thorough look at what culminated in one tragic day.",
        "reviewBody": "It's now 2011, ten years after the world as we knew it was changed by the attacks on 9/11. We've all seen endless news footage, documentaries, even Hollywood dramatizations of different elements of the tragedy and the subsequent \"War On Terror.\" I was deeply affected by what I saw on 9/11 and have read and viewed a great deal about it since then as a result, so for me to say that this 2-part DVD is probably the best, and most comprehensive, of its kind is significant.\n\n\"War On America\" gives exhaustive background into the long history between the US and much of the Middle East, focusing particularly on the last couple of decades and what went into the pressure cooker from both sides to make it explode in the way that it has. The documentary spends ample time explaining in detail how the American government came to have involvement with Osama bin Laden long before many of us had ever heard his now infamous name. The conflict of differing values between America and countries including the likes of Afghanistan and Pakistan is shown to us step by step, from its modern-day inception as we know it through the battles on the soil of both sides (the impact the Gulf War had on how America was perceived in the Middle East; the 1993 bombing of the World Trade Centre; the attack on the USS Cole; etc.). It gives us an excellent groundwork upon which we can begin to understand what factors were at work when 9/11 took place. \"War On America\" is approximately 105 minutes focusing on this very modern history, and it held information that I'd not come across elsewhere.\n\n\"Zero Hour\" revisits elements of 9/11 with which most of us are more familiar: it takes us step by step through what each of the terrorists did in the time leading up to boarding those planes, shows us what incredible luck they had on their side to have slipped the noose so many times in order to pull off bin Laden's \"masterpiece,\" and includes interviews with everyone from Intel to survivors to ticket agents who were at the airport the morning of the attacks. It, too, runs about 105 minutes, and in the end it feels as though you've looked at the tragic day from nearly all possible viewpoints.\n\nIf you want to watch just one examination of all of the known mechanics behind 9/11, National Geographic's \"Inside\" is the one you're looking for. It balances what is known with what is not, and manages to paint the fullest picture I've yet to see all in one place.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0481590/"
}