{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Kiley",
            "url": "/name/nm0453006/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 67,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005084/"
        },
        {
            "@type": "Person",
            "name": "Carol Hughes",
            "url": "/name/nm0400491/"
        },
        {
            "@type": "Person",
            "name": "David Hughes",
            "url": "/name/nm0400532/"
        }
    ],
    "datePublished": "1996-02-27",
    "description": "During a brutal drought in central Africa, this documentary from National Geographic follows the predicament of animals living along the dwindling Luvuvhu River.",
    "director": [
        {
            "@type": "Person",
            "name": "David Hughes",
            "url": "/name/nm0400532/"
        }
    ],
    "duration": "PT54M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDBkZjQzOGUtM2QzYy00MzdjLWE3NTgtOTMxZDQ3NjJiMDZlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzA1MzUwODk@._V1_.jpg",
    "name": "National Geographic: The Last Feast of the Crocodiles",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bellino-angelo2014"
        },
        "dateCreated": "2019-11-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt2049508/"
        },
        "name": "Great documentary about probably the worst drought ever witnessed in Africa",
        "reviewBody": "I have always loved National Geographic's documentaries and I have some in my DVD collection. And a few days I rewatched this one after a very long time. And I still that it's among the best of all the documentaries made in the 1990s. And it still holds up well after 23 years.\n\nThe documentary is set in the Luvuvu river in Africa. At the beginning the lake is full of water and the animals (including the crocodiles and hippopotamuses) have a peaceful existence, care for their babies, and some like the buffalos occasionally swim. Time passes and the water becomes to decline, and especially the crocodiles become very hungry and blood-thirsty to the point that drinking water is an hazzard for the poor animals including the nursing mothers. As the documentary progresses the lake becomes less and less watery and the animals are more and more nervous because of the lack of water. Neither a passing rain helps and... I won't spoil how the water returns, you should see it by yourself.\n\nThis documentary has great cinematography, especially for 1996 standards. It has a very haunting soundtrack and great narration by Richard Kiley. I have to warn viewers tho that there are a few scenes quite gory and I'll explain what is probably the most bloody: while some mandrills are near a river for relaxing, the crocodiles assaults a young male and a mother with her baby. The young male manages to free himself but ends up without his arm (and there is a long scene of the armless animal). As for the mother, she managed to free herself just in time but unfortunately, in an attempt of freeing her baby, it was too late. However, being this my only gripe I have to say that it's a great documentary that animal lovers must watch at least once!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt2049508/"
}