{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Neil Young",
            "url": "/name/nm0949918/"
        },
        {
            "@type": "Person",
            "name": "Ben Keith",
            "url": "/name/nm0445209/"
        },
        {
            "@type": "Person",
            "name": "Joe Lala",
            "url": "/name/nm0482329/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 135,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051769/"
        }
    ],
    "description": "Neil Young captured live in concert during his 'Trans' 1982 tour of Europe.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Lindsay-Hogg",
            "url": "/name/nm0512327/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Music",
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjMzZjE1NTItNWMwYi00NmFlLTg1OTItNzc0OTlkMDk4MjVhXkEyXkFqcGdeQXVyNjM4MTEyNg@@._V1_.jpg",
    "keywords": "concert film,independent film",
    "name": "Neil Young in Berlin",
    "original_info": {
        "id": "Neil Young: In Berlin_1982",
        "name": "Neil Young: In Berlin",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2011-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086002/"
        },
        "name": "Great Classics but Questionable New Stuff",
        "reviewBody": "Neil Young in Berlin (1983) \n\n*** (out of 4) \n\nCinnamon Girl / Computer Age / Little Thing Called Love / Old Man / The Needle and the Damage Done / After the Gold Rush / Transformer Man / Sample and Hold / Like a Hurricane / Hey Hey, My My (Into the Black) / Berlin \n\nThis 1983 concert film was actually shot on 10/19/82 in West Berlin, Germany and served as the final show in Neil Young's tour for the album \"Trans\". The actual concert featured 22-songs so taking a quick look at the setlist presented here you'll see that quite a bit of footage is missing but many artists and studios were hesitant to release full concerts thinking people would just buy the video and not worry about going to the actual event. As I work my way though Young's discography it's rather shocking to see how much he changed in terms of styles during this period as one album would be rock, the next country, the next some sort of electro and things would get even stranger. I always admire an artist not afraid to try different things even if they fail at doing them. I can't say I enjoyed \"Tran\" but the band Young surrounds himself with are extremely strong and this is easy noticeable in several of the classics. Including members of Crazy Horse as well as The Buffalo Springfield, the men do a terrific job at bringing a different sort of life into these tunes. 'After the Gold Rush' is clearly the highlight of the show but then again this powerful song could be the highlight of any show. 'Like a Hurricane' has a lot of fire behind it as does the powerful, acoustic 'The Needle and the Damage Done'. I think it's fair to say that the \"greatest hits\" tunes come out the best as Young's voice contains all that great energy and power and the band has no issues bringing them to life. The entire band are full of energy and it clearly shows in their playing. The problem for me are the newer songs, which just aren't my cup of tea. I don't exactly know what Young was going for in these electro tunes but I found them all rather annoying. If you enjoy the \"Trans\" album more then you'll probably end up rating this higher."
    },
    "url": "/title/tt0086002/"
}