{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emmanuelle Béart",
            "url": "/name/nm0000322/"
        },
        {
            "@type": "Person",
            "name": "Michel Serrault",
            "url": "/name/nm0785664/"
        },
        {
            "@type": "Person",
            "name": "Jean-Hugues Anglade",
            "url": "/name/nm0000767/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4854,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037028/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022244/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076944/"
        },
        {
            "@type": "Person",
            "name": "Jacques Fieschi",
            "url": "/name/nm0276466/"
        },
        {
            "@type": "Person",
            "name": "Claude Sautet",
            "url": "/name/nm0767110/"
        },
        {
            "@type": "Person",
            "name": "Yves Ulmann",
            "url": "/name/nm0880606/"
        }
    ],
    "datePublished": "1996-06-21",
    "description": "When Nelly, a woman being just divorced, meets by chance M. Arnaud, a mature salesman just retired, begins a strange and special relationship between the two personalities.",
    "director": [
        {
            "@type": "Person",
            "name": "Claude Sautet",
            "url": "/name/nm0767110/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGYzOTY0MGUtYTNjNS00OTg4LWJmNjktOGY4Zjg3ZmU5ODNhXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "character names as title,older man young woman friendship,rich man poor woman,paris france,ampersand in title",
    "name": "Nelly & Monsieur Arnaud",
    "original_info": {
        "id": "Nelly and Monsieur Arnaud_1995",
        "name": "Nelly and Monsieur Arnaud",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2003-03-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113947/"
        },
        "name": "Thoughtful and sensitive",
        "reviewBody": "In the 1995 film, Nelly and Monsieur Arnaud, director Claude Sautet depicts the relationship between an attractive young woman of 25 (Emmanuelle Beart) and wealthy retired judge (Michel Serrault). The setting is in upper middle-class Paris, replete with cognac, 1961 Chateau d\"Yquem, stacks of books on the shelf and comfortable looking apartments. As in another Sautet film, Un Coeur en Hiver, the subject is the fear of being involved. \"We all want love, but when we find it, we pull back. It scares us,\" states Monsieur Arnaud. \n\nAt the opening, Nelly is having marital problems with her husband Jerome (Charles Berling) who has not worked in a year. At a café one afternoon she is introduced by a friend to M. Arnaud and, after only a brief conversation about the state of her affairs, he surprisingly offers to give her 30,000 francs to help her get out of debt. She first refuses, then later agrees and also accepts his offer to type his memoirs on his computer. As she transcribes his verbally-dictated notes several hours a day, it becomes clear that he is paying her to be not only his assistant but his companion and personal confidant as well. The talk starts out with book-related matters but soon veers off into the personal. Though there is an unspoken yearning for closeness, their relationship develops into a power struggle over who can get the other to reveal their secrets. \n\nArnaud is attracted to the younger woman but does not pursue it for fear of rejection. He is reluctant to take risks and is content with the companionship he looks forward to every few days. Neither is comfortable with fully expressing their feelings. Nelly holds people at a distance, seeming to notice their needs but ultimately rejecting their advances with small but hurtful lies. She begins a relationship with M. Arnaud's book publisher Vincent (Jean-Hugues Anglade) but when she suspects that Arnaud is becoming possessive, she lies and tells him that she has slept with Vincent. Having made Arnaud jealous, she then callously dismisses Vincent when he asks her to move in with him. Some changes do seem to open up, however. Nelly leaves her husband and rents a studio apartment. Arnaud opens up and begins to share more of his life. There is a gallantry about the older man as he begins to communicate the pain of his divorce, his estranged relationship with his son, his financial dealings that turned bad, and his unfulfilled longings. \n\nNelly and Monsieur Arnaud is the type of film that comes to mind when we think of French cinema: thoughtful, restrained, and sensitive; a delicately nuanced character study performed by accomplished actors. The film is \"talky\" but the conversation is so thoughtful and civilized that we can just sit back and drink it up like a glass of vintage Sauterne. While the characters are not without flaws, they are nonetheless very human and Sautet makes us care about them, revealing their subtleties to us in a way that evokes our compassion. The film conveys the characters' deep longing for connection but, like many of us, they are more comfortable with maintaining the status quo. At the end, nothing much seems to have changed but when Arnaud's ex-wife (Francoise Brion) comes to visit, a hint that passion may have entered the picture in an unforeseen manner is unmistakable."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1802551577",
        "name": "Bande-annonce [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzIzYThiYjAtMmEwMS00OGU1LWFkZjUtYTFkNjcxZjdlMGZmXkEyXkFqcGdeQW1haXdlbm4@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzIzYThiYjAtMmEwMS00OGU1LWFkZjUtYTFkNjcxZjdlMGZmXkEyXkFqcGdeQW1haXdlbm4@._V1_.jpg",
        "uploadDate": "2021-01-13T15:25:27.553Z",
        "url": "https://www.imdb.com/video/vi1802551577/"
    },
    "url": "/title/tt0113947/"
}