{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Megumi Ogata",
            "url": "/name/nm0644527/"
        },
        {
            "@type": "Person",
            "name": "Megumi Hayashibara",
            "url": "/name/nm0370677/"
        },
        {
            "@type": "Person",
            "name": "Yûko Miyamura",
            "url": "/name/nm0594436/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14758,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "Neon Genesis Evangelion: Death & Rebirth",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071695/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060607/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002212/"
        },
        {
            "@type": "Person",
            "name": "Hideaki Anno",
            "url": "/name/nm0030417/"
        },
        {
            "@type": "Person",
            "name": "Akio Satsukawa",
            "url": "/name/nm0766364/"
        }
    ],
    "datePublished": "1997-03-15",
    "description": "A recap of the first 24 episodes of Neon Genesis Evangelion, followed by a 30-minute continuation of the plot that would later form the first third of The End of Evangelion.",
    "director": [
        {
            "@type": "Person",
            "name": "Hideaki Anno",
            "url": "/name/nm0030417/"
        },
        {
            "@type": "Person",
            "name": "Masayuki",
            "url": "/name/nm0556094/"
        },
        {
            "@type": "Person",
            "name": "Kazuya Tsurumaki",
            "url": "/name/nm0875453/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4YTY0MDUtYWNmMi00NTRiLWE4NmItM2JiMmIzYmEwNGQzXkEyXkFqcGdeQXVyNTkwNzYyODM@._V1_.jpg",
    "keywords": "older actors younger roles,purple hair,fourteen year old,fourteen year old boy,battle",
    "name": "Shin seiki Evangelion Gekijô-ban: Shito shinsei",
    "original_info": {
        "id": "Neon Genesis Evangelion: Death and Rebirth_1995",
        "name": "Neon Genesis Evangelion: Death and Rebirth",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "danieljtune"
        },
        "dateCreated": "2016-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0169880/"
        },
        "name": "Cool for Fans, Worthless to Anyone else",
        "reviewBody": "Neon Genesis Evangelion: Death and Rebirth is a 1997 film that acts as both a recap of the original series Neon Genesis Evangelion and a preview for the at-the-time upcoming film The End of Evangelion. The Death and Rebirth in the title refers to the two segments of the film; Death being the recap, and Rebirth being the first half an hour of EoE.\n\nAt the time of the film's release, the film was supposed to act as an alternative to watching the original 26 episode series, most likely to draw in non-fans to come and see End of Evangelion. In my opinion however, the film isn't a very good alternative to watching the original series. It's organised out of chronological order and forgoes a lot of the plot to give brief outlines of the main character's personalities, which could lead to a fair amount of confusion. Most of the animation in the \"Death\" segment is just reused footage from the series. The only parts of the film that are not reused are scenes where the three main leads practice classical music, which are more or less purposeless and really only serve as an excuse to listen to nice music. If you had not seen the original series before watching this, I would guess that you would be rather confused.\n\nHowever if you are a fan of this franchise (like me), you'll probably quite enjoy it. Though the recap is strangely organised, it's still Evangelion, which is inherently pretty cool if you love the show. The organisation can be seen as an interesting new way to experience the show, and it can also act as a nice refresher on the events of the series. While The End of Evangelion segment is kind of pointless, it's still the End of Evangelion, which, in my opinion, is one of the best animated films ever made, so watching a bit of it is hardly a bad thing.\n\nStill, the film only really functions as a curiosity piece for super fans. If you are not super invested in the franchise already, you probably don't even know it exists, and if you do, you probably don't care.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0169880/"
}