{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Bakewell",
            "url": "/name/nm0049049/"
        },
        {
            "@type": "Person",
            "name": "Laura Fraser",
            "url": "/name/nm0292182/"
        },
        {
            "@type": "Person",
            "name": "Hywel Bennett",
            "url": "/name/nm0071799/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2942,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049027/"
        }
    ],
    "datePublished": "1996-09-12",
    "description": "Richard Mayhew leads an ordinary life in London when one day a girl named Door falls, injured, across his path. The next thing he knows, his life is gone and he's pulled into the fantastical world of London Below. Pursued by the m...",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjhjY2I3NDctMjNhZS00YjE3LTk3OWUtYzgzZTk1MjRhNGE0XkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "chivalrous,platonic love interest,fish out of water,parallel dimensions,key master",
    "name": "Neverwhere",
    "original_info": {
        "id": "Neverwhere_1996",
        "name": "Neverwhere",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Fred_Paris"
        },
        "dateCreated": "2006-07-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115288/"
        },
        "name": "Not everyone can make it to the Underworld",
        "reviewBody": "You probably have to know London a bit to fully enjoy the story of Neverwhere (the series or the novel for that matter). The whole story relies on knowing a bit of the city layout, above and below :) And it's understandable that US viewers can be surprised by the low budget BBC production (unless they were familiarized with it through stuff like Dr Who which seems to be popular at the moment). Most European TVs don't get to sell their productions abroad so they won't invest as heavily as the US productions.\n\nI read the novel long before I could get my hands on the DVD (actually way before I was even aware of anything being available in filmed form, much less as a DVD). For some reason the only release seems to be for the US market.\n\nRegarding the Neverwhere series, yes, while the cast is mostly good, some of the actors are so-so. Even with the obviously shoestring budget, the sets and costumes are quite inventive and convincingly used. The directing unfortunately is really poor and it does quite a bit of damage to the effectiveness of the whole.\n\nIf you have read and enjoyed the novel, you will find the series to be something imperfect yes but also something that you can watch with fondness. Possibly a proper adaptation by a proper director with a decent budget would be nice. But it's unlikely it will ever happen. Isn't it better to enjoy what's available even if it could theoretically be better ?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Richard Mayhew leads an ordinary life in London when one day a girl named Door falls, injured, across his path. The next thing he knows, his life is gone and he's pulled into the fantastical world of London Below. Pursued by the murderous Messrs. Croup and Vandemar, Door and Richard with the help of Hunter and the Marquis de Carabas, attempt to find the Angel Islington, who knows the secret behind the murder of Door's family, and possibly a way for Richard to go home.",
        "duration": "PT29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3749233177",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGRjMjBhZDYtOWY5Yy00NmU4LWFiMWYtNGM4NDg1ODU0NWZlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGRjMjBhZDYtOWY5Yy00NmU4LWFiMWYtNGM4NDg1ODU0NWZlXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-08-18T17:20:55.275Z",
        "url": "https://www.imdb.com/video/vi3749233177/"
    },
    "url": "/title/tt0115288/"
}