{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frank Sinatra",
            "url": "/name/nm0000069/"
        },
        {
            "@type": "Person",
            "name": "Gina Lollobrigida",
            "url": "/name/nm0518178/"
        },
        {
            "@type": "Person",
            "name": "Peter Lawford",
            "url": "/name/nm0492444/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3219,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030901/"
        },
        {
            "@type": "Person",
            "name": "Millard Kaufman",
            "url": "/name/nm0442228/"
        },
        {
            "@type": "Person",
            "name": "Tom T. Chamales",
            "url": "/name/nm0150108/"
        }
    ],
    "datePublished": "1959-12-07",
    "description": "During WW2, the American OSS mounts covert operations with the native Kachin against the Japanese army in the jungles of Burma.",
    "director": [
        {
            "@type": "Person",
            "name": "John Sturges",
            "url": "/name/nm0836328/"
        }
    ],
    "duration": "PT2H5M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWE1OTM5ZTItMTgzZS00OGE4LWJiODAtNGVlMmNkY2UwMWM4L2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "year 1943,1940s,jungle,u.s. military,world war two",
    "name": "Never So Few",
    "original_info": {
        "id": "Never So Few_1959",
        "name": "Never So Few",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slokes"
        },
        "dateCreated": "2008-09-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053108/"
        },
        "name": "Something Stupid",
        "reviewBody": "\"Never So Few\" fails in so many ways; as a treatment of the Burma campaign in World War II; as a tough-nosed action picture; as an involving melodrama; and most especially, as a vehicle for star Frank Sinatra.\n\nSinatra was too busy playing soldier and practicing his cool look to bother constructing an interesting character; a strange bitter vibe hangs over his performance. Oddly, it was another actor who managed to take the little \"Never So Few\" had to offer in the way of career advancement: Steve McQueen. Up to this point, he had done \"The Blob\" and TV, but his comfortable natural bearing around Sinatra's star wattage shows he could hold his own with the big boys, even when the script gave him little to work with.\n\nMcQueen is Sgt. Ringa, a jeep driver who finds himself drafted for more dangerous duty when commando leader Tom Reynolds (Sinatra) takes a shine to his street-smart ways. Reynolds leads a small band of Kachin fighters in the hilly jungles of Burma, continually harassing a Japanese force many times its size.\n\n\"A regular Abe Lincoln in North Burma\" is what rich merchant Nikko Regas calls him. Regas is part of the other story in \"Few\", the man whose girl (Gina Lollabrigida) Reynolds wants. The exotic Lollabrigida and the world-weary chain-smoking Sinatra are clearly meant to invite comparisons to Rick and Ilsa, and Paul Henreid cements the impression by playing Nikko as much the same character he was in \"Casablanca\".\n\nNone of this comes together, though. In fact, the two parts fail to co-exist at all. You get 20 minutes of war followed by 40 minutes of earnest love talk, then back to the war. The war scenes are about as competently directed as an episode of \"The Rat Patrol\", with idiotically sequenced insert shots (like soldiers shooting up at people we then see falling in a river) and noble, servile Kachin dying with meek apologies to \"Dua\" Reynolds. War is hell for Tom, who loses both his monkey and his favorite gun caddy, a faithful Kachin who hands him a new automatic every time Reynolds empties a magazine on the enemy.\n\nThe romance is even worse. Sinatra and Lollabrigida have no chemistry, she can't act, and director John Sturges' idea of story advancement is to focus on her bustline and hope you don't notice the dialogue. And what dialogue!\n\nHim: \"I hanker for you alone.\"\n\nHer: \"Why don't you go back to the hills and play with your popguns!\"\n\nHenreid warns Lollabrigida he won't let her go then disappears for the rest of the movie, leaving Lollabrigida and Sinatra to kiss like dead fish in front of bad process shots.\n\nThe film generates a bit of interest an hour or so in, when Reynolds and his men discover the Japanese are not the only force they have to fight. But the resolution of this angle is both trite and ugly, involving the wholesale slaughter of captured prisoners while the camera focuses on Sinatra, looking so sad his previously disapproving medic (Peter Lawford, better than usual here) has to pat his shoulder to let him and the audience know it's alright.\n\nMcQueen at least mines his on-screen time to showcase his talents as an action man, and occasional scene stealer with the aid of handy props, like a slice of watermelon or a mortar. Competing with Charles Bronson, Brian Donlevy, and Richard Johnson as Reynolds' monocle-wearing British pal, McQueen hardly has to break a sweat.\n\nThe worst performance here is Sinatra's, who just drips with self-importance, whether wearing an ugly goatee (Mitch Miller must have really got to him) or trying to sound like Hemingway with stiff lines like: \"You have tasted the pain of wound in combat.\" Sinatra was not just good but great in parts where he allowed himself to project insecurity. But too often, when permitted to coast, he gave performances like this one, showcasing the boor he could be in life from time to time.\n\n\"Never So Few\" drags for more than two hours, long enough to listen to four of his Capitol albums. Guess which is a better investment of your time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "During WW2, the American OSS mounts covert operations with the native Kachin against the Japanese army in the jungles of Burma.",
        "duration": "PT2M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4163224345",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTQ3OTViMzAtYmFmNi00OWRhLWI4MTgtZGJiNzU0Zjg5MzA3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTQ3OTViMzAtYmFmNi00OWRhLWI4MTgtZGJiNzU0Zjg5MzA3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-13T16:42:04.485Z",
        "url": "https://www.imdb.com/video/vi4163224345/"
    },
    "url": "/title/tt0053108/"
}