{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlie Hunnam",
            "url": "/name/nm0402271/"
        },
        {
            "@type": "Person",
            "name": "Jamie Bell",
            "url": "/name/nm0068260/"
        },
        {
            "@type": "Person",
            "name": "Christopher Plummer",
            "url": "/name/nm0001626/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12879,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037384/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071970/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0098170/"
        },
        {
            "@type": "Person",
            "name": "Charles Dickens",
            "url": "/name/nm0002042/"
        },
        {
            "@type": "Person",
            "name": "Douglas McGrath",
            "url": "/name/nm0569790/"
        }
    ],
    "datePublished": "2003-06-27",
    "description": "A young, compassionate man struggles to save his family and friends from the abusive exploitation of his cold-heartedly grasping uncle.",
    "director": [
        {
            "@type": "Person",
            "name": "Douglas McGrath",
            "url": "/name/nm0569790/"
        }
    ],
    "duration": "PT2H12M",
    "genre": [
        "Adventure",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjQxNjMzODA3NF5BMl5BanBnXkFtZTgwMjU4MDcxMDI@._V1_.jpg",
    "keywords": "snow adventure,uncle nephew relationship,based on novel,alliterative title,character name as title",
    "name": "Nicholas Nickleby",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "foxly007"
        },
        "dateCreated": "2007-06-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0309912/"
        },
        "name": "From Some1 Who Didn't Read the Book",
        "reviewBody": "This is a film adaptation, if you follow what others said, an altered plot even *based* on the book. If you wanted to see the book dramatized, then I guess you'll be disappointed. But I, however, wanted to see Alan Cumming, so I rented it. I don't care that it's supposed to be Dickens. I had to convince my husband to watch it because he hated the book. In fact, ours would not be described as Dickens house. We are not fans. We don't attend literary societies and haven't gone to university for literature. Neither are we fans. The closest we can come to liking Dickens is Blackadder's Christmas Carol.\n\nWhat our perceptions are, will not be so elite as my fellow commenters here, but if you want a straight unbiased perspective on this film, do read on.\n\nWe found the acting inspirationally good. We would stop at times to comment to one another how excellent the acting is. Especially when Nicholas gets into a fury over his sister in Hawk's face. When he gets angry at the schoolmaster, Squeers, is equally good. The actors did a great job and the film was at once both charming and idyllistic and at other times, cruel and unforgiving. It definitely portraits a time long since past, a way of thinking, the gentry and the way society was at the time within a fictional story written by Charles Dickens. This is another version written by someone else. Regardless, it has its own merits. There are ALWAYS elitists around to hen scratch at any and all adaptations of classic works to film and usually it looks to me to be on principle alone if nothing else. The last comment said the acting was terrible, but really, it was fantastic, so I don't think they even watched beyond like 15 minutes of the film or whatever point they believed it deviated from the book. Let's face it, I haven't even read the book, but I know it would take many hours of time like the extended versions of the complete Lord of the Rings to capture it faithfully, in which case I wouldn't have finished watching it because it would be a) too damn long and b) far too boring because it'd be faithfully like Dickens. This version is shorter and appeals to me a lot more than the drivel shoved down my throat in the classroom at an age when I actually appreciated classic literature far more. And to reinforce this point, I don't remember a damn thing from that, because it was so boring.\n\nSo it is NOT the faithfully adapted verbatim snorefest it would have been. It is a very good film. I think only Dickens fans will moan about it. Otherwise, no one else would have a problem with it. Everyone's a critic. I don't usually post here, hardly ever post anywhere. But this is a great film and I came here to IMDb just to see who played Nicholas. Ladies will want to watch it just for his looks <.<"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Nicholas Nickleby",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2007237913",
        "name": "Nicholas Nickleby",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjBkNjM4NDAtMjczZS00NWUyLWJlZTAtZjdjZGQyY2IwNmFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjBkNjM4NDAtMjczZS00NWUyLWJlZTAtZjdjZGQyY2IwNmFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T04:59:46Z",
        "url": "https://www.imdb.com/video/vi2007237913/"
    },
    "url": "/title/tt0309912/"
}