{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fernando Ramallo",
            "url": "/name/nm0707979/"
        },
        {
            "@type": "Person",
            "name": "Jordi Vilches",
            "url": "/name/nm0897446/"
        },
        {
            "@type": "Person",
            "name": "Marieta Orozco",
            "url": "/name/nm0650485/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6212,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Nico and Dani",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071913/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000424/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046252/"
        },
        {
            "@type": "Person",
            "name": "Tomàs Aragay",
            "url": "/name/nm0032720/"
        },
        {
            "@type": "Person",
            "name": "Cesc Gay",
            "url": "/name/nm0310747/"
        },
        {
            "@type": "Person",
            "name": "Jordi Sánchez",
            "url": "/name/nm0844983/"
        }
    ],
    "datePublished": "2001-02-02",
    "description": "A Spanish coming of age story focusing on the antics of two 17 year olds, who have a posh beach house almost all to themselves one summer. This is also a summer of sexual awakenings.",
    "director": [
        {
            "@type": "Person",
            "name": "Cesc Gay",
            "url": "/name/nm0310747/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGY4ZWE4MDEtMDcyYy00ODJiLTkwYzktNjkwMjExOWM3ZTgwXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_.jpg",
    "keywords": "coming of age,gay,beach house,friendship between boys,loss of virginity",
    "name": "Krámpack",
    "original_info": {
        "id": "Nico and Dani_2000",
        "name": "Nico and Dani",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "terryhall2"
        },
        "dateCreated": "2007-01-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250478/"
        },
        "name": "Coming of age story that is totally natural",
        "reviewBody": "This delightful film, which the Spanish seem to excel at making, just looks at a section of life of two teenage boys sharing a summer together. Good friends, they are at an age where their hormones dictate what they are doing and Nico, who thinks he's much more macho and attractive than he is, wants to lose his virginity before he reaches 17. Very cute Dani likes his friend's company and like many teenage boys discovering their sexuality, these two masturbate each other when female company is lacking. However, two girls Elena and Berta turn up at the beautiful little coastal town and Nico's interest is piqued. Dani, who feels a deep attraction for his friend wants to spend more time with Nico and resents the interference of the girls presence. It's a summer of learning and acceptance for him that he is gay. The acting is superb, so natural and human. Many European films capture this humanity that American films find it difficult to do, because the latter are generally ruled by making money, not for the art form. In Nico and Dani no judgments are ever made, no sensitivities hidden or prejudices espoused, just the sincere and objective exploration of the human condition shown as natural as it occurs in life. People are people, not ridiculous super-heroes in contrived situations. There is also a maturity in European films, with excellent acting that draws you to believe these things are really happening, and the audience is expected to be a mature one too. It's a fresh, happy little film, well photographed and the subject matter intelligently handled. I recommend it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0250478/"
}