{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Taliesin Jaffe",
            "url": "/name/nm0043552/"
        },
        {
            "@type": "Person",
            "name": "Eric DaRe",
            "url": "/name/nm0201121/"
        },
        {
            "@type": "Person",
            "name": "Linda Weinrib",
            "url": "/name/nm0070557/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 311,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0226348/"
        }
    ],
    "datePublished": "2000-04-26",
    "description": "A poor Earth girl and NieA, a hotheaded alien girl of low class (\"under 7\"), bond in a world where aliens are part of every day society.",
    "genre": [
        "Animation",
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjkwODUzMzY0NF5BMl5BanBnXkFtZTcwMDE5NjAyMQ@@._V1_.jpg",
    "keywords": "anime animation,alien,absurd humor,shopping mall,near future",
    "name": "NieA under 7",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Druff"
        },
        "dateCreated": "2005-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0299357/"
        },
        "name": "FoolyCooly Jr.",
        "reviewBody": "I bought the entire NieA_7 series in one shot (DVD box-set) because I'm a fan of Serial Experiments Lain and Haibane Renmei, and NieA was made by some of the same creators. After all, I bought Haibane Renmei solely because it was by the same people who made Lain, and I was rewarded with a truly excellent anime. Last night I finished the first volume of NieA, and let me say that at this point my faith has been shaken.\n\nBased on the first four episodes, I'm struck by the close similarity to another anime called FLCL (a.k.a. Furi Kuri or Fooly Cool y, depending on your personal level of anime fan-hood/elitism.) I believe both shows debuted in Japan in 2000, so I doubt that either one is an intentional rip-off of the other. On paper, the basic premises are almost identical; A young girl leads a relatively mundane life in a very quiet town. The one thing that prevents her life from being completely ho-hum is the fact that she lives with a free-spirited female alien (named NieA) who is usually a source of trouble to the girl. All I'd have to do is change the young girl to a young boy and I'd be describing FLCL. It's the same drill. Events are seemingly random, with only a loose sense of any plot. Wacky, zany and bizarre are apt adjectives for the episodes I've seen. The NieA character is annoying, and the lead character never fails to overreact to the alien's shenanigans. One problem is that they've made NieA -too- annoying. So far she's entirely one dimensional. Her single minded obsession with food invariably causes her to be a selfish, obnoxious pest. She isn't funny or cool, unlike FLCL's Haruko. I'm sure as I get further into the show there will be some character development and I'll see the characters in a different light. As it stands now, I wish the NieA character would just go away. I'm an easy going guy. For a character to get on my nerves to this degree in only four episodes indicates to me that something is wrong. I'll continue to watch NieA_7 only out of a stubborn sense of duty. Not enjoyment. I finish this series even it if it kills me. For now I hope I like Texhnolyze more than this.\n\nNote to IMDb staff: Your automated \"follow the rules\" script for these submissions really needs some tweaking and bug-fixing. It wouldn't permit me to title this comment \"FLCL Jr.\" because it considered that to be \"shouting\". It wouldn't let me use \"F.L.C.L.\" either, because it regarded that as shouting as well. Finally, it wouldn't let me title it \"Fooly Cool y Jr.\" either. No matter how I try to change it, it automatically changes Cool y to Coolly. In fact, I've had to put a space between the l and y just to tell you this. \n\nIt would seem that even when I'm not watching the show, NieA is still finding ways to annoy me. ~_^"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Pioneer Entertainment",
        "duration": "PT1M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1236140313",
        "name": "NieA_7 aka Niea Under 7",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzk5Y2I0NjgtODc0Yy00M2MyLTk1OGQtODE3ZmZmOTRiZWVhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzk5Y2I0NjgtODc0Yy00M2MyLTk1OGQtODE3ZmZmOTRiZWVhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:30:06Z",
        "url": "https://www.imdb.com/video/vi1236140313/"
    },
    "url": "/title/tt0299357/"
}