{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbara Wyler",
            "url": "/name/nm0943726/"
        },
        {
            "@type": "Person",
            "name": "Jamie Scoggin",
            "url": "/name/nm0778615/"
        },
        {
            "@type": "Person",
            "name": "Stacey Lyons",
            "url": "/name/nm0529166/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2637,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080689/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        }
    ],
    "datePublished": "1985-02-22",
    "description": "God and Satan are on a train discussing the fate of three individuals. The stories of the people in question are told in a trio of very strange vignettes. One involves an insane asylums with some very interesting treatment plans. ...",
    "director": [
        {
            "@type": "Person",
            "name": "John Carr",
            "url": "/name/nm0139753/"
        },
        {
            "@type": "Person",
            "name": "Phillip Marshak",
            "url": "/name/nm0550696/"
        },
        {
            "@type": "Person",
            "name": "Tom McGowan",
            "url": "/name/nm0569710/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2Q4YzgxOTQtNTk3Zi00MTNjLTkyYzAtMWYzYmExZGM3Mjk4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "anthology,depiction of god,directed by several directors,edited from unfinished film,rock band",
    "name": "Night Train to Terror",
    "original_info": {
        "id": "Night Train to Terror_1985",
        "name": "Night Train to Terror",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bezenby"
        },
        "dateCreated": "2013-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087798/"
        },
        "name": "Everybody's got something to do - Except YOU",
        "reviewBody": "Man, is this a fine slice of fetid, aromatic eighties cheese or what? An anthology movie made from three films edited down, with added gore and effects, linked together by segments involving God and the Devil on a train, trading souls while a typical eighties band plays a song about how everyone's got something to do (except you). Great stuff.\n\nThe stories themselves are fine too, probably because of all the added blood and gore (and possibly the removal of all the boring bits). The first story involves a man who has been brainwashed into kidnapping people who are then tortured, cut up, and sold onto universities. Sure, it's daft, but way over the top in the gore and nudity stakes, so who's complaining? It's quite nasty, this one. I have no idea what the original film was called.\n\nYour second story here is a diluted version of a film called Death Wish Club, which I've heard of but never seen. This involves two young lovers trying to escape the influence of an evil gangster who doesn't want the girl to be free, and ropes (sometimes literally) the two into joining the Death Wish Club, where folks dice with death (rather graphically). Another winner here, although the ending is a bit abrupt and unresolved. I'd read that the stop motion bug thing was added later.\n\nLast and lengthiest is an edit of 'The nightmare never ends', another one I'd heard of but haven't seen. We have a Catholic surgeon and her husband, who has just written a book called 'God is Dead'. Meanwhile, you've got Cameron Mitchell on the trail of a seemingly immortal guy called Olivier, who seems linked to some gory murders (courtesy of some hilarious new footage). Olivier wants to recruit the surgeon's husband to work for Satan, but it's obvious to everyone within a 300 mile radius that the guy who doesn't believe in God isn't going to believe in Satan either, stupid. I'm guessing that The Nightmare Never Ends was a bit tame in the killings stake, as the new footage involves a stop motion demon stomping on badly animated people. I liked it and found it creepy in places.\n\nThe wraparound segment is a hoot too – how can you dislike a film with such a cheesy pop song running through it. This film is daft as hell and a lot of fun. What more do you want from a film? Look – if you're even looking at a review of a film called Night Train to Terror, I'm guessing you're probably not on the lookout for socio-political subtext and meaningful studies of the human condition. What you get here is beheadings, Lycra, sweatbands, boobs, faces exploding, demons, people melting. It's the kind of film where all is good in the world.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0087798/"
}