{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Garcia",
            "url": "/name/nm0000412/"
        },
        {
            "@type": "Person",
            "name": "Richard Dreyfuss",
            "url": "/name/nm0000377/"
        },
        {
            "@type": "Person",
            "name": "Lena Olin",
            "url": "/name/nm0000565/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8362,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025957/"
        },
        {
            "@type": "Person",
            "name": "Robert Daley",
            "url": "/name/nm1084359/"
        },
        {
            "@type": "Person",
            "name": "Sidney Lumet",
            "url": "/name/nm0001486/"
        }
    ],
    "datePublished": "1997-05-16",
    "description": "A newly elected District Attorney finds himself in the middle of a police corruption investigation that may involve his father and his partner.",
    "director": [
        {
            "@type": "Person",
            "name": "Sidney Lumet",
            "url": "/name/nm0001486/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmE1YWM5NWItYjNmZC00ZmVlLTg2OGEtN2M5NDRhNmJiYTlmXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "family relationships,metaphoric title,italian american,trailer,tv spot",
    "name": "Night Falls on Manhattan",
    "original_info": {
        "id": "Night Falls on Manhattan_1997",
        "name": "Night Falls on Manhattan",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "videorama-759-859391"
        },
        "dateCreated": "2016-09-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119783/"
        },
        "name": "Another Lumet must see",
        "reviewBody": "Here's yet another film with a too low IMDb average. Really 6.6. I'm so glad I came to view this film, a few years back. I just came to view it again, where I enjoyed it as much as last time. I love Sidney Lumet films. He makes good ones, rarely a bad one. I mean, he gave us Network, Equus, Family Business, and the lesser known, Guilty As Sin. This is just another one that holds up to the others, and another one on Lumet's notch of good films. This one has been constructed gingerly, attentively, as far as plot and story goes. One would even say judiciously, with great performances to boot, Dreyfuss, and Ron Leibman, a scene stealer, and terribly underused actor, most of his stuff t.v. related. Corruption runs high in a few cop beats, where Garcia's cop father (Holm, really good) is shot badly by a burst of machine gun fire, when a drug bust goes bad. Three beats were called in, where there should of only been one, which leads us to consider a few bad apples were involved. Even Garcia's father could be bad too like his partner and childhood mate, Joey (the late great Gandofini) a modest performance. Garcia, an ex cop, now a promising lawyer, is assigned to this criminal case, by Leibman who runs a law firm, to the disgust and anger of a slick lawyer adversary, Colm Feore (just another top form performance here), where the big black drug dealer, a nasty piece of work in a quite threatening performance, by Shiek Mahmud- Bey is caught, so it's really gonna get heated in that courtroom, where you don't want this black dude mad. Garcia's amusing remark, a moment I loved, sealed that deal. The turning point or second story, let's call it, takes off when a black book is recovered from one of the dead cops in that failed bust, a number of cops names including Holm's, all supposedly on the take are in there, and things get really juicy, plot wise, which sees Garcia back in the court room. This film has really been constructed thriller wise, as many characters, mostly the ones in question, aren't telling us everything. Dreyfuss's admittance about his teenage daughter to Garcia in those spa room scenes was something unexpected too. The film is very well written, all of it, it's treatment, etc, all shaped to perfection, solely by Lumet, the first scene in the lecture room, with budding lawyers, grabbing us straight away, with in your face frankness. The film has a very well researched feel, Garcia's performance though, not as good as the others. The character's choices and their situations, make sense, and we very well understand. If you're a cop and you go crooked, well the ball's in your caught, baby. Highly underrated and very much recommended cop/courtroom drama, Dreyfuss's performance as the black guy's defendant, the one you'll remember. He's brilliant.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2082389529",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDdhMjBmZTktYmM5YS00NjMwLWE3NDYtOWY1MmMzM2Y5ZjVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDdhMjBmZTktYmM5YS00NjMwLWE3NDYtOWY1MmMzM2Y5ZjVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-03T14:26:19.221Z",
        "url": "https://www.imdb.com/video/vi2082389529/"
    },
    "url": "/title/tt0119783/"
}