{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Craig Sheffer",
            "url": "/name/nm0001729/"
        },
        {
            "@type": "Person",
            "name": "David Cronenberg",
            "url": "/name/nm0000343/"
        },
        {
            "@type": "Person",
            "name": "Anne Bobby",
            "url": "/name/nm0090321/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 24544,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0033472/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041067/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045933/"
        },
        {
            "@type": "Person",
            "name": "Clive Barker",
            "url": "/name/nm0000850/"
        }
    ],
    "datePublished": "1990-02-16",
    "description": "A troubled young man is drawn to a mythical place called Midian where a variety of friendly monsters are hiding from humanity. Meanwhile, a sadistic serial killer is looking for a patsy.",
    "director": [
        {
            "@type": "Person",
            "name": "Clive Barker",
            "url": "/name/nm0000850/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWI4MTVlM2UtNTEzZC00MjdiLWE4ZjItNTZmM2U2NjUzNzI1XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "mad doctor,motel,surrealism,supernatural power,surprise ending",
    "name": "Nightbreed",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "PatrickH-2"
        },
        "dateCreated": "1999-08-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100260/"
        },
        "name": "Absolutely Fascinating",
        "reviewBody": "Fascinating is an excellent word to describe NIGHTBREED: it doesn't necessarily mean it is good or bad, just interesting. Indeed, Im still not sure whether or not this film is good or bad.\n\nOn the credits side, the sets, costumes, make-up, special effects, even the matte paintings are gorgeous, grotesque, perfect for what is required. I was amazed that such fantastic production values could be found in a movie that on the surface seems so schlocky. There is such a wealth of imagination here that one can hardly take time out to think about the flaws. I was so amazed by the knock-out apocalyptic finale that I could barely think about how silly the context is (a bunch of redneck Canadians blow-torching a cemetary.)\n\nhe film's biggest flaw is it's sheer magnitude- there are SO many characters, plots, subtexts, overlays, and so on, that no really coherent or involving center emerges. It can be interpreted as: a story about how love conquers the supernatural (a la Dead Again), a Silence-of-the-lambs-like psychodrama about a serial killer; a dreamy horror flick reminiscent of Nightmare on Elm Street and especially Little Monsters; a Gilliam-inspired fantasy (the teeming underworld city is strongly reminiscent of Brazil and the Fortress of Ultimate Darkness in Time Bandits, while other parts are reminiscent of The Adventures of Baron Munchausen); a symbolic tale of racial tolerance; and on and on. So much happens, so many characters are involved, so many subtexts present themselves, its hard to know what is going on at all.\n\nStill, one really does have to see the film to believe it. The underworld city is stunning, its atmosphere created perfectly by both the production design and a series of bizarre tableaux of its residents. It is a mark of Barker's screenwriting talent (so often evident in his other films if you can look beneath the shlock) that all the characters, even monsters seen only briefly, ring true in some strange way. The many stories are actually touching. Also, the ending is cleverly conceived; it doesnt go out of its way to leave the door open for a sequel, rather the open door is integral to the plot. I would love to see a follow-up just to know how Barker carries through the mythical aspects he introduces in this film's last part.\n\nPerhaps the film could have been more focused, with fewer subsidiary characters; perhaps the completely inappropriate (but obviously intentional) humor could have been dropped; perhaps the entire serial-killer sub-plot could have been excised completely. In any case, this film is a knock-out."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Extra (Clip) from 20th Century Fox",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2274951449",
        "name": "Nightbreed",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2ZiZmUxNzgtMTYwMS00M2RmLWJhMGItOGI1NDhhNzhiYzE2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2ZiZmUxNzgtMTYwMS00M2RmLWJhMGItOGI1NDhhNzhiYzE2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:14:55Z",
        "url": "https://www.imdb.com/video/vi2274951449/"
    },
    "url": "/title/tt0100260/"
}