{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Giulietta Masina",
            "url": "/name/nm0556399/"
        },
        {
            "@type": "Person",
            "name": "François Périer",
            "url": "/name/nm0673749/"
        },
        {
            "@type": "Person",
            "name": "Franca Marzi",
            "url": "/name/nm0555807/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 50097,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "alternateName": "Nights of Cabiria",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032861/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037407/"
        },
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        },
        {
            "@type": "Person",
            "name": "Ennio Flaiano",
            "url": "/name/nm0280919/"
        },
        {
            "@type": "Person",
            "name": "Tullio Pinelli",
            "url": "/name/nm0684083/"
        }
    ],
    "datePublished": "1957-10-16",
    "description": "A waifish prostitute wanders the streets of Rome looking for true love but finds only heartbreak.",
    "director": [
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTdhNmUxZmQtNmMwNC00MzE3LWE1MTUtZDgxZTYwYjEzZjcwXkEyXkFqcGdeQXVyNTA1NjYyMDk@._V1_.jpg",
    "keywords": "prostitute,house,rescue from drowning,italian woman,rome italy",
    "name": "Le notti di Cabiria",
    "original_info": {
        "id": "Nights of Cabiria_1957",
        "name": "Nights of Cabiria",
        "year": "1957"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2001-02-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050783/"
        },
        "name": "\"Nights\" of Fellini and Masina",
        "reviewBody": "A prostitute whose life is a veritable study in the resilience of the human spirit is the subject of `Nights of Cabiria,' directed by Federico Fellini. Giulietta Masina stars as Cabiria, a gentle soul at heart who manages to maintain a positive outlook even in the face of adversity. Experiences that would leave those of lesser mettle jaded she is seemingly able to ward off and emerge from intact, with a guarded optimism that nevertheless leaves her open to whatever ills life may have in store for her next. But it is just that optimism and her sense of joy in the simple things that makes her so endearing. She is proud, for example, of the fact that she owns her own house, hovel though it may be. Though not one to be easily duped, she is vulnerable to sincere persistence, which has in the past rendered her victim to those who would take advantage of her, which is succinctly established in the opening scene of the film. \tFellini's film is a study of how good may succumb to evil, and yet still triumph in the end (though open to subjective interpretation). It's something of an examination of endurance; how many times can one be knocked down before finally being unable to stand back up again. At the same time, however, it's an example of how purity can prevail against even the utmost cruelty. There is a humanity manifested in Cabiria that somehow gives absolution, not only to her lifestyle, but to those who would willingly do her harm. And it is in that very same absolution that we find a message of hope and redemption. \tAs Cabiria, the diminutive Masina gives a performance that is nothing less than superlative, filled with nuance and expression. She has a face and a manner that convey an unbelievable depth of emotion, and Fellini captures every bit of it with his camera to perfection. It sometimes seems that she is a sprite merely masquerading as a woman; she has a light, almost ethereal presence, though at the same time she exhibits an earthy quality that gives her character such complexity, which removes any semblance of stereotype one may assign to her character as a `lady of the evening.' It is a heartfelt, memorable portrayal that quite simply should have earned her an Oscar for Best Actress. Turning in a noteworthy performance, also, is Francois Perier, as Oscar D'Onofrio, the stranger who comes into Cabiria's life with an offer that ultimately seems too good to be true. \tThe supporting cast includes Amedeo Nazzari (Alberto Lazzari), Aldo Silvani (The Hypnotist), Franca Marzi (Wanda), Dorian Gray (Jessy), Mario Passante (Cripple in the `Miracle' sequence), Pina Gualandri (Matilda), Leo Cattozzo (Man with the sack) and Polidor (The Monk). `Nights of Cabiria' is a film of extraordinary depth that is beautiful as well in it's humanity; Fellini has created images, both visually and emotionally, that are stunning and indelibly realized. Highlighted by the performance of Giulietta Masina, this is a film that begs to be embraced, one that will stay with you long after the last shadow has passed from the screen into darkness. In Cabiria, Fellini somehow touches something eternal, for there is a lasting sense of innate goodness about her that simply cannot be forgotten. For seekers after wisdom and truth, this is definitely a film that must not be missed. I rate this one 10/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The new 4K restoration of Federico Fellini's NIGHTS OF CABIRIA, starring Giulietta Masina, opens April 17 at New York's Film Forum! Winner of the 1957 Academy Award for Best Foreign Language Film. rialtopictures.com",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1789181465",
        "name": "Nights of Cabiria - Restoration Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmJlNDAyYjYtM2MwMC00MmJjLTgyNWEtM2YwM2VjYmI2N2NlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmJlNDAyYjYtM2MwMC00MmJjLTgyNWEtM2YwM2VjYmI2N2NlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-06T20:12:47.562Z",
        "url": "https://www.imdb.com/video/vi1789181465/"
    },
    "url": "/title/tt0050783/"
}