{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Gere",
            "url": "/name/nm0000152/"
        },
        {
            "@type": "Person",
            "name": "Kim Basinger",
            "url": "/name/nm0000107/"
        },
        {
            "@type": "Person",
            "name": "Jeroen Krabbé",
            "url": "/name/nm0469103/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7943,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005883/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0082000/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0082004/"
        },
        {
            "@type": "Person",
            "name": "James Carabatsos",
            "url": "/name/nm0135829/"
        }
    ],
    "datePublished": "1986-12-19",
    "description": "A Chicago detective, seeking to avenge his partner's death, travels to New Orleans, where he unexpectedly becomes involved in a cat and mouse game of survival.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Pearce",
            "url": "/name/nm0669004/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTYzMzBlOTAtYjg4Zi00N2I3LThmZjktZGUxYjFmZTA2NmIyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "neo noir,car,u.s. car,oldsmobile,oldsmobile motor vehicle",
    "name": "No Mercy",
    "original_info": {
        "id": "No Mercy_1986",
        "name": "No Mercy",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "videorama-759-859391"
        },
        "dateCreated": "2014-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091637/"
        },
        "name": "Gere gets merciless with the merciless in average fare",
        "reviewBody": "We now see Mr Gere get tough as Eddie Jillete (dig the name, and he's not much of a shaver either), another Chicago cop who doesn't play by the rules. Opening with a funny stake out scene, with Gere and partner, who winds up dead, later, of course, (ooops! sorry to ruin it for ya) posing as car wash attendants, where they nab these two snitches, which leads to a higher chain of really bad dudes, who are part of a drug syndicate. Gere's partner being slayed, along with a contact supplier, has him on an adrenaline filled quest of revenge, (an excuse for the rest of the movie) that sees him travelling to the bayou, to find the mysterious and beautiful Michelle, the contact's girlfriends, who Gere doesn't mind slapping if, if slapped first as seen earlier, before all the bloodshed started. Gere's need for vengeance, is not a bad excuse, for a few reasons- you've got the beautiful Basinger, and a great action sequence that sees Gere and Basinger scarcely escaping the claws of the merciless head honcho, (Jerome Krabbe, an evily brilliant, masterful performance, way above his peers) fleeing across the river, from out of the pilings, and ending up in the swamps of Louisiana, drained, thirsty and hungry as hell. Personally, not buying the probability of them getting away clean like this, I also got drained watching them. The other reason besides Gere, purposely pranging the car of the contact's brother, who wasn't playing ball in the Q and A department, was the shootout scene in the abandoned hotel. Get this. Gere gave the proprietor a bunch of money for all the rooms, telling him \"There's no future in it\". The proprietor leaves as simply as that before Gere rigs the hotel with traps and guns. It is a great set up of tense atmosphere, before Gere has his moment of vengeance face to face with killer Krabbe. While really becoming a fan of Gere in the mid eighties, No Mercy, isn't one I held in memory. It was a good actioner, at viewing time, but nothing really stuck with me about it. A few weeks later it was totally forgettable, the only part, sticking with me, in those small weeks after, was them going through the mire and the swamps. Gere did bring out an intriguing new tough guy, unruly, who's disrespectful of women, he really needs a lesson in manners, and like the movie, his character wasn't one, you much cared about.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Chicago detective, seeking to avenge his partner's death, travels to New Orleans, where he unexpectedly becomes involved in a cat and mouse game of survival.",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3822371609",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmRmZGVmYmEtOTZhZC00ZjNlLWI0NmMtNjE4NWY4MmFkOWY0XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmRmZGVmYmEtOTZhZC00ZjNlLWI0NmMtNjE4NWY4MmFkOWY0XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-26T16:41:27.824Z",
        "url": "https://www.imdb.com/video/vi3822371609/"
    },
    "url": "/title/tt0091637/"
}