{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jon Cryer",
            "url": "/name/nm0001083/"
        },
        {
            "@type": "Person",
            "name": "Demi Moore",
            "url": "/name/nm0000193/"
        },
        {
            "@type": "Person",
            "name": "George Wendt",
            "url": "/name/nm0001841/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2324,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042549/"
        },
        {
            "@type": "Person",
            "name": "Craig Bolotin",
            "url": "/name/nm0093271/"
        },
        {
            "@type": "Person",
            "name": "Terence Mulcahy",
            "url": "/name/nm0611689/"
        }
    ],
    "datePublished": "1984-11-09",
    "description": "16 y.o. Charles loves to photograph. A cute girl's photo ends up in his camera. He later sees the older Laura singing in a bar. He takes a lot more photos of her and ends seeing her again, wishing to help her career.",
    "director": [
        {
            "@type": "Person",
            "name": "Jerry Schatzberg",
            "url": "/name/nm0770234/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTNhYWM2N2YtNzFiMy00Y2MzLTkxZGUtMWVjZDU4MDAyODJiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "love,bar,singer,female nudity,photography",
    "name": "No Small Affair",
    "original_info": {
        "id": "No Small Affair_1984",
        "name": "No Small Affair",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dannyfitzuk"
        },
        "dateCreated": "2006-02-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087810/"
        },
        "name": "Kitsch 80's film that never ceases to charm me!",
        "reviewBody": "I've seen this film about five times now and I never cease to be delighted by its charms.\n\nWhere do I start? Firstly Jon Cryer is truly excellent as the precocious adolescent amateur photographer who spouts sophisticated adult dialogue but is really naive on the romantic front. The way he blushes at the right moment is very credible. He plays the blushing virgin with gusto - we don't doubt for a moment that he's never had sex or kissed a girl.\n\nFirstly I must admit here to being a major fan of Demi Moore's films in the 80's. I've seen all of them from that period and I adore the characters she plays - Moore is what I call 'value added'. Whatever role she plays she brings something special, whether it is a brilliant range in temperament, downcast eyes, the husky voice, the tearful eyes the shiny hair. Most Hollywood actresses can't manage this, but Demi manages to be the girl next door and screen siren all in one.\n\nAnyway she plays this aspiring niteclub singer with bad taste in 80's clothes and even worse taste in music. To her credit she doesn't sing any of the songs as they were recorded by other people, so she just lip syncs along quite nicely. That song 'Hotheaded' is actually quite catchy in that Michael Bolton, Bar 'rawk' sort of way. Overall her character, Laura Victor comes over as a really likable human being. And the final scene at the airport is truly touching. Moore's says two simple words 'thank you' and we know she means it.\n\nAnother to reason to love this film is that it was filmed entirely on location in San Francisco, and studio interiors are very few and far in between. Most of the shots are on real locations which adds to the movie's overall charm. This combined with the corny dialogue: that scene where she barges into the High School language laboratory dressed in a coctail waitress (read hooker!) outfit in very high heels and pulls Cryer out of the language lab is really funny - especially when she says \"F*** Off ez Vous\" to the French teacher.\n\nSome of the scenes are chauvinistic, including the one with frat boys and the hired hooker - which really doesn't have any relevance to the overall plot. And I agree with a previous poster who says that Cryer's on screen mother is one of the most irritating characters to appear in movies. That line about the sausage of Cryer's brother going cold is truly risible. When I watch this film I try very hard to ignore the flaws!\n\nThis is corny, cheesy and highly entertaining. It really captures the spirit of the 80's. I'll never stop watching it - I love it.\n\nBonus: watch out for Jennifer Tilly and Tim Robbins in bit parts playing Cryer's classmates. Robbins was 28 when he played this role. Teenage high school student he ain't! But it's still good to see him in this. Also the very catchy song 'Eiffel Tower' by Malcolm McClaren and the McClarenettes.\n\nMoore wears some wacky clothes and has that 80's penchant for long evening gloves with hundreds of bangles, very Material Girl! I love that cabin on the boardwalk apartment she lives in while working at Jakes's as a singer. Very bohemian, very cool, very 1984!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi463077657",
        "name": "No Small Affair",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTk4OTU1ZGQtODI3NC00NzIyLTgyYzktOWQ3YTBlYWFiYTU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTk4OTU1ZGQtODI3NC00NzIyLTgyYzktOWQ3YTBlYWFiYTU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:16:37Z",
        "url": "https://www.imdb.com/video/vi463077657/"
    },
    "url": "/title/tt0087810/"
}