{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yûya Yagira",
            "url": "/name/nm1625874/"
        },
        {
            "@type": "Person",
            "name": "Ayu Kitaura",
            "url": "/name/nm1626086/"
        },
        {
            "@type": "Person",
            "name": "Hiei Kimura",
            "url": "/name/nm1625521/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29126,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Nobody Knows",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068649/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0059858/"
        },
        {
            "@type": "Person",
            "name": "Kore-eda Hirokazu",
            "url": "/name/nm0466153/"
        }
    ],
    "datePublished": "2004-10-21",
    "description": "In a small Tokyo apartment, twelve-year-old Akira must care for his younger siblings after their mother leaves them and shows no sign of returning.",
    "director": [
        {
            "@type": "Person",
            "name": "Kore-eda Hirokazu",
            "url": "/name/nm0466153/"
        }
    ],
    "duration": "PT2H21M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE5ZTA2YzQtM2M0My00OGNkLWE2YTAtYzA3YWE2YTQ0OWJmXkEyXkFqcGdeQXVyMTI3ODAyMzE2._V1_.jpg",
    "keywords": "child abandonment,japan,neglect,malnutrition,based on true story",
    "name": "Dare mo shiranai",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "s_cadzow"
        },
        "dateCreated": "2006-04-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0408664/"
        },
        "name": "Absolutely Astounding!",
        "reviewBody": "There are very few films I have seen that had the power to affect me as deeply as Nobody Knows. As highly as I recommend it, I must also forewarn, that this film has power, some very serious power. To call Hirokazu Koreeda's Nobody Knows anything less than a masterpiece would be an insult to the story it tells. The craftsmanship we witness here, from the masterful direction to the outstanding performances that the children were able to commit to, are all something of incredible proportions.\n\nNobody Knows, which is a true story, tells of four siblings, ages 5-12, from different fathers, who live in a small apartment in Tokyo. At first, they live in the apartment with their childish Mother who is hardly ever home. With the exception of the oldest, Akira, the mother snuck the children in to keep the rent lower and prohibits them from ever leaving the apartment, even the veranda, for fear of them being seen. The children do not go to school. As they look after each other, all they do is patiently and affectionately wait for their mother to come home.\n\nAs the story progresses, the children wake up one morning to some money on the kitchen table with a note from their mother saying that she'll be home in a month. As Akira steps up and takes charge of the apartment, the bills, and his siblings, the children still hold hope that mother will be home soon. And then, Nobody Knows hits you like a truck and goes right through you. Complete Abandonment. The smiles diminish and the childish affection for a mother that will never return is gone. Gone to play mother to another family, it is now entirely up to Akira, with money running out.\n\nKoreeda's direction of the children is exceptional, as if the film was shot entirely candid. The camera-work is sincere, as if we were one of the children stuck in that apartment. There are no gimmicks here, no slide of hand, or post-production miracles. Nobody Knows is raw, and thrives in Koreeda's ability to capture the distinct personalities of all four siblings, their hopes, and those secretive moments where Koreeda directs the children not for the stories sake, but for the sake of the children being children.\n\nPerhaps the most impressive aspect of Nobody Knows is the performances of the four children. All four children, who conjured phenomenal performances, were played by Japanese youths with no film backgrounds. After you see the film, it is likely that Koreeda preferred it this way, tapping into the honesty and energy that such youth had to offer. Their performances are so sincere and beautiful that on several occasions the tears will start to fall, the goose bumps will rise, and your heart will undoubtedly cry out to rescue these children, to grab them in your arms and set them free.\n\nWithout giving too much away, one of the most touching scenes to me, is on Yuki's birthday, the only thing she wants is to be able to go outside for a walk with her big brother Akira. So when the night comes, she puts on her little bear slippers, an ear to ear smile on her face, and with her hand in her brothers hand, they set her heart free for if not only a night.\n\nNobody Knows is a film that I will never let go of. This film impacted me so much and I found it so absolutely remarkable, that it hasn't left my mind since it's viewing. I almost feel that recommending this film just isn't enough, and all I can say is that I hope everyone gets the chance to enjoy this film for all that it is worth. As sure as it is to invoke emotion, it is as sure to please as a piece of cinema.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from IFC",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi43909401",
        "name": "Nobody Knows",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTdjZWM5MDgtNjE1YS00NTQ3LWJkOWQtN2MzMTAxYjYyM2Q0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTdjZWM5MDgtNjE1YS00NTQ3LWJkOWQtN2MzMTAxYjYyM2Q0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:29:40Z",
        "url": "https://www.imdb.com/video/vi43909401/"
    },
    "url": "/title/tt0408664/"
}