{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Duel Farnes",
            "url": "/name/nm1189290/"
        },
        {
            "@type": "Person",
            "name": "Nick Nolte",
            "url": "/name/nm0000560/"
        },
        {
            "@type": "Person",
            "name": "Anthony Edwards",
            "url": "/name/nm0000381/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5504,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029291/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0089709/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090798/"
        },
        {
            "@type": "Person",
            "name": "Mark Polish",
            "url": "/name/nm0689185/"
        },
        {
            "@type": "Person",
            "name": "Michael Polish",
            "url": "/name/nm0689187/"
        }
    ],
    "datePublished": "2003-08-01",
    "description": "Set in 1955, the residents of a small Montana community are forced to move their homes to make way for a new dam.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Polish",
            "url": "/name/nm0689187/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4ODE3ODEyMl5BMl5BanBnXkFtZTYwNTYwOTk2._V1_.jpg",
    "keywords": "view master,evacuation,caretaker,orphanage,dam",
    "name": "Northfork",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkeefe81"
        },
        "dateCreated": "2004-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0322659/"
        },
        "name": "stunningly shot, compelling",
        "reviewBody": "This film played for a criminally short time in Buffalo and of course was gone by the time I wanted to see it. I'm sure the beautifully shot, rugged western landscapes would have been great on a big screen, but unfortunately I had to settle for the video version on my 13\" TV. With that said, \"Northfork\" is that rare and elusive bird of movies: a commercial film that is worthy of the viewer's hour and a half and doesn't manage to be insulting. Despite the career sins of Nick Nolte and Darryl Hannah in the past, don't be turned off by their presence here. They are perfect in their respective roles, Nolte as world-worn mystic and Hannah as enigmatic ghost/angel/vision. Without rehashing a plot summary (which, I might add, is somewhat inaccurate on this site), let me say that \"Northfork\" is a kind of delirium, alternating between the dreamlife of a dying boy and the surreal landscape of a mostly empty town, peopled only by a handful of eccentric stragglers. The central plot, as it were, revolves around a group of state-sanctioned volunteers given the task of clearing out these final hangers-on before the town is flooded. The six deputized agents, clad in black and issued identical black sedans, speak in detached, banal fragments, going about their task with an odd fatalism. Although the dialogue and cold, alien demeanor owes heavily to David Lynch, it is sure to please fans of the eclectic and bizarre like myself. The other plot strand, that of the dying boy's fever visions, is a bit heavy-handed in places, with an overkill of its clumsy angel motif, but it manages enough ambiguity and originality to avoid queasiness.\n\nAbove all else, this film has the feel of a strange dream, mired in drab shades and an undercurrent of ominous mystery. The camera work is brilliant and, despite awkward moments, the film has the feeling of a deep, cold water reservoir running beneath a landscape familiar and unreal at once."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi765329689",
        "name": "Northfork",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTM4Yjc4NWItMjY4Yi00MDFhLWIxYTktN2VlNDExOWI3NjgzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTM4Yjc4NWItMjY4Yi00MDFhLWIxYTktN2VlNDExOWI3NjgzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:30:02Z",
        "url": "https://www.imdb.com/video/vi765329689/"
    },
    "url": "/title/tt0322659/"
}