{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chyler Leigh",
            "url": "/name/nm0500200/"
        },
        {
            "@type": "Person",
            "name": "Jaime Pressly",
            "url": "/name/nm0005326/"
        },
        {
            "@type": "Person",
            "name": "Chris Evans",
            "url": "/name/nm0262635/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 108786,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011134/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003654/"
        },
        {
            "@type": "Person",
            "name": "Mike Bender",
            "url": "/name/nm0070500/"
        },
        {
            "@type": "Person",
            "name": "Adam Jay Epstein",
            "url": "/name/nm0258418/"
        },
        {
            "@type": "Person",
            "name": "Andrew Jacobson",
            "url": "/name/nm0414795/"
        }
    ],
    "datePublished": "2001-12-14",
    "description": "A sendup of all the teen movies that have accumulated in the past two decades.",
    "director": [
        {
            "@type": "Person",
            "name": "Joel Gallen",
            "url": "/name/nm0302778/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWFkYmJiZjQtYWMzZC00OGIyLThkZjktY2JlNGI4MGU0NjY5XkEyXkFqcGdeQXVyNDUzNzgxODE@._V1_.jpg",
    "keywords": "teen sex comedy,cheerleader,incestuous desire,vibrator,female masturbation",
    "name": "Not Another Teen Movie",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Marc42"
        },
        "dateCreated": "2002-12-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0277371/"
        },
        "name": "Much better than expected",
        "reviewBody": "While it fails almost as often as it succeeds, there's so much going on here I couldn't help but like it. You REALLY have to be familiar with the material being spoofed, though. And part of the fun is ticking them all off in your mind if you're a movie geek like me.\n\nNATM has two levels and target audiences. For teens who have seen all the recent flicks, it's a direct, Mad magazine style parody. For 30 somethings like me, it's an homage to the 80's flicks. The opening scene is an obvious \"American Pie\" spoof, but in a much more subtle way, it's drawing on \"Sixteen Candles\". To top it off, the scene is still funny even if you haven't seen either targets. Bruce (Sam Levine from Freaks & Geeks) is a parody of Seth Green's character in \"Can't Hardly Wait\", but he's also an homage to Long Duk Dong.\n\nSeveral people have mentioned that kids probably haven't seen the old flicks and older people haven't seen the new ones. Well, if you're a kid, you don't need to have seen the old flicks to appreciate it as a broad parody. The 80's jokes tend to sit in the background- like the signs on the walls and the musical cues in the Molly Ringwald scene (which actually was a weak point IMO). And I've found that most people my age HAVE seen most of the newer teen movies. They came out just about the time we were starting to get married, buy houses, have real jobs. And they were a nice bit of nostalgia for our youth. Even if we didn't go pay $7.50 to see them, we've seen them on USA on saturday afternoon.\n\nIt's no accident the that soundtrack is almost entirely new, young bands doing covers of 80's songs.\n\nAs far as the gross-out factor goes, it's really not that bad. The filthy opening scene is forgivable because it's so dang funny. There is one gory joke on the football field. (A \"Lucas\" homage inside a \"Varsity Blues\" parody.) A sick unfunny scatalogical joke at the beginning of the movie pays off with a big laugh when it's turned around at the end. And the mother of all \"poo\" jokes is tempered by the fact that the victim is a delivering a tirade against \"poo\" jokes. And then there's granny's kiss- unfunny and nasty. But it's nowhere near the level of \"Scary Movie\". It's also nice to see a movie like this without any gay jokes or fat jokes. (There is a fat guy, but being fat isn't the joke.) Under the filth, this is a pretty gentle movie.\n\nI avoided this when it came out, but another 30-something friend recommended it to me recently. I'd recommend it to anyone who old enough to have seen \"Sixteen Candles\" in a theatre...as long as you've seen most of the newer flicks as well.\n\nOh...LOVED the slow clap guy!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Columbia Pictures",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi547225881",
        "name": "Not Another Teen Movie",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjM0YWVmODctYzAwZi00ZjMyLWJmMjYtZmMzM2RmODg4Y2QxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjM0YWVmODctYzAwZi00ZjMyLWJmMjYtZmMzM2RmODg4Y2QxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:30:04Z",
        "url": "https://www.imdb.com/video/vi547225881/"
    },
    "url": "/title/tt0277371/"
}