{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sally Field",
            "url": "/name/nm0000398/"
        },
        {
            "@type": "Person",
            "name": "Alfred Molina",
            "url": "/name/nm0000547/"
        },
        {
            "@type": "Person",
            "name": "Sheila Rosenthal",
            "url": "/name/nm0742827/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13843,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026481/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0183897/"
        },
        {
            "@type": "Person",
            "name": "Betty Mahmoody",
            "url": "/name/nm0537031/"
        },
        {
            "@type": "Person",
            "name": "William Hoffer",
            "url": "/name/nm0388772/"
        },
        {
            "@type": "Person",
            "name": "David W. Rintels",
            "url": "/name/nm0725766/"
        }
    ],
    "datePublished": "1991-01-11",
    "description": "An American woman trapped in Islamic Iran by her brutal husband must find a way to escape with her daughter as well.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Gilbert",
            "url": "/name/nm0317981/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzc4ZGIzZmItZjc2Ni00ZWQyLTg2ODAtYTJiNmJhMWJmMzI5XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "iran,mother daughter relationship,female protagonist,domestic violence,based on true story",
    "name": "Not Without My Daughter",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jash-1"
        },
        "dateCreated": "2004-10-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102555/"
        },
        "name": "Okay movie, disturbing comments",
        "reviewBody": "While I was re-watching bits of this movie a few weeks ago, I read the user comments here at IMDb and was very disturbed. Since it is still bothering me, I decided to write my own comments on the movie and on what has been said here.\n\nFirst, the movie. It is about an international custody battle. That is a very real problem in this day and age. When couples from different countries break up they often each want the children to live with them and grow up in the country (and culture) in which they were raised. Each naturally thinks the way he or she was raised is better for their children. \n\nThis movie is Betty Mahmoody's story. And the culture clash is between the United States and Iran. It takes place in 1984. The Ayatollah Khomeini was still very much the leader Iran and the Iran-Iraq war had been going on for 4 years and would continue for another 4. Iran was quite isolated from much of the world at that time. \n\nAnd 'Moody' Mahmoody, an Iranian-born doctor practicing in the U.S., brings his American wife, Betty, and their daughter, Mahtob, to Iran for a visit. When they arrive, Moody is dismayed at the changes in Iran, especially the breakdown of the education system and the resulting shortage of doctors. Then he becomes an ultra, ultra fundamentalist Muslim  so reactionary he makes suicide bombers look moderate. He demands that Betty dress and behave how he thinks a good Muslim wife should and wants their daughter to be raised to do the same. He becomes physically abusive to Betty. If she wants to return to America, it is fine with him, but Mahtob will remain with him in Iran. So Betty plans a dangerous escape for herself and her daughter.\n\nDoes the movie work? Somewhat. 'Women in peril' movies are always a guilty pleasure and Sally Field is a good actress. The biggest problem is with Moody's character. Alfred Molina is a wonderful actor, but it's hard to do much with a character that undergoes such a radical change in his basic character in a matter of weeks. I kept expecting to learn that he had once been diagnosed as psychotic or schizophrenic.\n\nIs the movie unfair to the Iranian people? Again, somewhat. Virtually all the characters in the movie except Betty and Mahtob are Iranian. Some are good. Some are bad. But you can't have a 'woman in peril' with no peril. And that is provided by Moody and his family. But the people who help Betty escape are also Iranian. What unfairness there is lies not in maligning the Iranian people (it doesn't do that) but in implying (and sometimes saying explicitly) that the Iranian culture is inferior just because it is not westernized. As a free American woman I would not want to live in any fundamentalist society, regardless of which religion was in control. But post-revolution Iran is no more representative of thousands of years of Persian culture than Italy under Mussolini was representative of a land that produced the Roman Empire and Michelangelo.\n\nIs the movie unfair to Moody? No, because this is BETTY's story. Talk to anyone in a bitter custody battle and they'll tell you all about why their ex is evil. And they wouldn't be lying. They are giving you their point of view. That doesn't mean Moody doesn't have a different point of view which is equally true and equally untrue (and which, I gather from the comments, was explored in another movie.) But 'Not Without My Daughter' doesn't pretend to be a sociological examination into the two sides of a dispute. Let me repeat for the third time, this is BETTY's story.\n\nThat brings me to why some of the comments disturb me so much. I would fully understand if some viewers thought the movie was silly or inaccurate or biased. But several writers have used their reviews as an excuse to joyfully bash the United States. My favorite was 'Who died and made Americans god to do movies about other countries??' That writer is from Sweden but doesn't seem to have a problem with Jan Troell making 'The New Land' (Nybyggarna) about America. And, were we to listen to her, we wouldn't have 'An American in Paris' or 'The Killing Fields' or 'Out of Africa' or 'Amadeus' (all of which are much better films than 'Not Without My Daughter.') But in the United States we have freedom of speech. That means that movie producers are free to make any movie to which they think they can sell tickets. And, as a member of the viewing public, when I disagree with what they are saying I have a very simple remedy. I don't buy a ticket."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An American woman, trapped in Islamic Iran by her brutish husband, must find a way to escape with her daughter as well.",
        "duration": "PT2M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2996093721",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWFlZDBjNTctOTBkYi00NDUxLWI0NGUtZjVlYjUwOTc0NTU5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWFlZDBjNTctOTBkYi00NDUxLWI0NGUtZjVlYjUwOTc0NTU5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-06T01:49:50.650Z",
        "url": "https://www.imdb.com/video/vi2996093721/"
    },
    "url": "/title/tt0102555/"
}