{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Lawrence",
            "url": "/name/nm0001454/"
        },
        {
            "@type": "Person",
            "name": "Tim Robbins",
            "url": "/name/nm0000209/"
        },
        {
            "@type": "Person",
            "name": "John C. McGinley",
            "url": "/name/nm0001525/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 47730,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009845/"
        },
        {
            "@type": "Person",
            "name": "Steve Oedekerk",
            "url": "/name/nm0644203/"
        }
    ],
    "datePublished": "1997-07-18",
    "description": "Nick's wife's in bed with his boss. He later gets a gun to his head by a carjacker but steps on the gas pedal. They end up friends after adventures together - holdups, burglary, reckless driving, revenge etc. Twists follow.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Oedekerk",
            "url": "/name/nm0644203/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDI4ZGFmMjUtMjU5ZS00ZDEwLWJlNjMtZTc3MDMwNzBhODhjL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "racial prejudice,heartbreak,profanity,african american,argument",
    "name": "Nothing to Lose",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thewag777"
        },
        "dateCreated": "2005-02-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119807/"
        },
        "name": "Best Black Guy, White Guy Comedy ever",
        "reviewBody": "Even better than Trading Places. (I will only spoil the first 20 minutes.) Nick Beam, well played by Tim Robbins, is an upper-middle class white man with a pretty wife, a successful career in advertising, and a nice home. His marriage seems happy, but one day he comes home early and sees his wife straddling another man in their bed. He doesn't say anything. She doesn't even know he was there. He finds his boss's cuff links on the way out, and therefore realises that it was his boss whom his wife was on top of.\n\nAfter driving in a daze at about 20 miles an hour, Nick Beam wanders into the ghetto. This is where Terrance, played by Martin Laurence, attempts to mug him. Well, Nick Beam is so depressed that he really doesn't value his own life, and takes Terrance for a little ride.\n\nThe rest of the movie is filled with their crazy adventures. A few robberies, and Tim's gradual transformation into a criminal. There is a hilarious scene where Tim has a spider on his head, freaks out, and... well you'll see. That scene alone would have made the movie worth watching even if the rest were terrible. But fortunately, there is plenty more wacky adventures for these two before the twist at the end.\n\nMost of this is comedy, but it does get a little serious at certain parts. How could the producers contrast the lives of a well-to-do white man with a struggling black man from the ghetto without going into social injustices? Nick Beam accuses Terrance of laziness and wasting his time robbing people instead of finding a job. Terrance never goes into details, but just tells Nick not to judge him. Then, Nick discovered several rejection letters to Terrance from potential employers. Furthermore, Terrance, a mugger, has a wife and kids and he seems to be a good father to them. It looks like Terrance is more than a common thug.\n\nLastly, I complement the musical choices. The spider dance scene was to the song, I think its called, 'The Scott Man.' Something like that. Its funny. Later in the movie, Pachebel's 'Canon' is played. The song at the end of the movie is a rap to the music of 'Canon.' I don't normally like rap, but I liked that, very creative.\n\nI give the movie a perfect 10. Its not a copy of Trading Places at all, but it does have a similar theme, rich white guy, poor black guy. This is one of the few movies that has made me laugh uncontrollably for more than a few seconds at a time. If you haven't seen it, watch it, and you will watch it many more times after, I guarantee.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Nick's wife's in bed with his boss. He later gets a gun to his head by a carjacker but steps on the gas pedal. They end up friends after adventures together - holdups, burglary, reckless driving, revenge etc. Twists follow.",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi328450841",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmFiM2ZiZGUtNGFlNS00NDdhLTgwNzctNDdjMmFhMDdiNGU0XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmFiM2ZiZGUtNGFlNS00NDdhLTgwNzctNDdjMmFhMDdiNGU0XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-04T23:10:11.057Z",
        "url": "https://www.imdb.com/video/vi328450841/"
    },
    "url": "/title/tt0119807/"
}