{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cary Grant",
            "url": "/name/nm0000026/"
        },
        {
            "@type": "Person",
            "name": "Ingrid Bergman",
            "url": "/name/nm0000006/"
        },
        {
            "@type": "Person",
            "name": "Claude Rains",
            "url": "/name/nm0001647/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 103074,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041421/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005025/"
        },
        {
            "@type": "Person",
            "name": "Ben Hecht",
            "url": "/name/nm0372942/"
        },
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        },
        {
            "@type": "Person",
            "name": "John Taintor Foote",
            "url": "/name/nm0285218/"
        }
    ],
    "datePublished": "1946-09-06",
    "description": "The daughter of a convicted Nazi spy is asked by American agents to gather information on a ring of Nazi scientists in South America. How far will she have to go to ingratiate herself with them?",
    "director": [
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Drama",
        "Film-Noir",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTc1NGViOTMtNjZhNS00OGY2LWI4MmItOWQwNTY4MDMzNWI3L2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "wine cellar,key,treason,undercover,mother son relationship",
    "name": "Notorious",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "heather_m1986"
        },
        "dateCreated": "2010-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038787/"
        },
        "name": "Romance -- Hitchcock style",
        "reviewBody": "Dark, cruel, beautifully photographed, and deeply erotic, Notorious in one of Hitchcock's very best. It's remarkably sexual and sophisticated story from a time in Hollywood where the power of the Breen Office was at its apex. Alicia Huberman (Ingrid Bergman) is the daughter of a convicted Nazi. American agent Devlin (Cary Grant) contacts her and convinces her to spy against some of her father's Nazi colleagues in Brazil. The chief of these of Alex Sebastian (Claude Rains), one of the most genial Nazis depicted on the silver screen, who has a crush on Alicia. Of course, Alicia has fallen madly in love with Devlin, and he with her, though he could never admit it, and instead pushes her to seduce Sebastian to obtain his secrets. He wants her for the mission when she accept, he brands her a whore. Only a whore would sleep with a man for his secrets, right? Hitchcock gathers some of Hollywood's best and casts them against type. Ingrid Bergman, who hitherto had played a fair number of virginal ingénues, plays Alicia Huberman, a powerfully sensual woman but also a drunken nymphomaniac. You get the sense that she can merely stroke Devlin's cold, frozen face and bring him magically to life. The great comic-acrobat-sophisticate Cary Grant is cast as the emotionally stunted and almost sadistic T.R. Devlin, a mysterious secret agent who recruits Alicia to work for the government. Cary Grant utilizes his inherent reticence to create a character who is isolated and closed off, who can lash out and act disinterested so easily toward the woman he loves. Claude Rains, with his rich English voice and amiable face plays Nazi Alex Sebastian, a rather nice fellow who happens be plotting against the United States. He is genuinely in love with Alicia and when he learns of her betrayal, his despair and terror is palpable and moving. Madame Constantin, imported especially by Hitchcock from Germany for this film is the brilliant and icy cold Madame Sebastian, Alex's powerful mother. In one particular scene she smokes a cigarette with a malice unequaled by any actress in Hollywood history. It's like she has it clasped in her talons. Louis Calhern is Devlin's boss, breezy, narrow minded, and casually misogynistic.\n\nNotorious is a very stylish production. Ingrid Bergman, who usually wore little makeup in her films, has a very natural sensuality and wears lovely 40s hats and suits very elegantly. Cary Grant is hitting his stride as the fashion icon he later became in the 50s. The suits are slimmer than they were in earlier roles and help emphasize Grant's lean and powerful, but graceful, physicality. Hitchcock's camera is characteristically authoritative, shaping the audience's impressions. It is very open to Bergman and very closed to Grant. Bergman is often shot in close ups and medium shots, and in flattering soft focus, and in accessible to the audience. Her heartrending luminosity, used so brilliantly in Casablanca is used again here by Hitchcock. Grant, on the other hand, is several times shot with his back to the camera, looking away from from the camera or with his face obscured by shadows. You suspect, but you never really KNOW what Devlin is feeling for the majority of the film. Grant is inscrutable and here is really demonstrating his economy --and brilliance-- as a performer. Sometimes he does seem a bit too stiff, especially since we know that he's capable of doing Dr. David Huxley and Editor-in-chief Walter Burns, but most actors wouldn't have dared to give such an understated performance as Grant does here.\n\nThe world of Notorious is very insular. Most of the film, with the exception of the love scenes, is indoors. Any other scenes that find the characters outdoors find the characters closed off. Barricaded between objects or people. All this gives the film a claustrophobic feel, like Devlin and Alicia have no place to hide and no place to breathe. People said that Hitchcock disliked actors. I don't think that's true, but Hitchcock seems to have extraordinary control over the technical aspects of filming. In order scenes to work actors must explicitly follow direction; they are the tools of film-making. All this attention to detail is absolutely necessary considering the complex composition of many of his scenes. The reputed \"Longest kiss in film history\" where Devlin and Alicia embrace and talk and kiss for several is a very intricate piece of blocking as the characters move from one room to another, Devlin speaks on the phone, reach, turn etc... If Hitchcock worked like someone like Howard Hawks, for instance, this sort of scene wouldn't be possible.\n\nSince this is a Hitchcock film, people may be mislead into thinking that it's a thriller. It's not. It's really a perverse romance. The characters are more intricately drawn than they are in thrillers. Indeed, plot and character development seem to be equally important. The story does not move quickly but you don't really notice, you're too busy being immersed in Hitchcock's world. Thrilling, sexy, and moving, Notorious is highly recommended",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer",
        "duration": "PT2M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1851243545",
        "name": "Notorious",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmZiNzE1YjItYTA4NC00ZTk0LThkNWYtZWFhNTFmNTFiMjA3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmZiNzE1YjItYTA4NC00ZTk0LThkNWYtZWFhNTFmNTFiMjA3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-03T17:16:32.246Z",
        "url": "https://www.imdb.com/video/vi1851243545/"
    },
    "url": "/title/tt0038787/"
}