{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sarah Adler",
            "url": "/name/nm0012239/"
        },
        {
            "@type": "Person",
            "name": "Nade Dieu",
            "url": "/name/nm0226383/"
        },
        {
            "@type": "Person",
            "name": "Rony Kramer",
            "url": "/name/nm0469656/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3048,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022201/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022244/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077366/"
        },
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        }
    ],
    "datePublished": "2004-05-19",
    "description": "An indictment of modern times divided into three \"kingdoms\": \"Enfer\" (\"Hell\"), \"Purgatoire\" (\"Purgatory\") and \"Paradis\" (\"Paradise\").",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkxNTk0MzMwMF5BMl5BanBnXkFtZTcwNDI0NDcyMQ@@._V1_.jpg",
    "keywords": "purgatory,hell,sarajevo,historical fiction,violence",
    "name": "Notre musique",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RJBurke1942"
        },
        "dateCreated": "2008-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0360845/"
        },
        "name": "Our Music-2004: Poses unanswerable questions that fail to support the conclusion.",
        "reviewBody": "This is not entertainment...\n\nI'd seen Contempt (1963) and Breathless (1960) many years ago and thoroughly enjoyed both. After 1964, I sort missed all that he directed until now, which appeared on late-night TV. And no wonder it was on so late at night...\n\nIt seems that, as many of us get older and maybe wiser, we like to expound on things philosophical. Bergman did it well, and without resorting to didactic circularity or confusion  and still managed to tell a good story. Woody Allen uses satire brilliantly for the same purpose.\n\nHowever, Godard here uses the bare bones of a simple, quasi-documentary style story  and one that it episodically fractured and with much symbolism  to reflect upon 'what it all means': that is, life, death and the whole damn thing. Using the current Israeli problem with Palestine and vice-versa, he explores the three concepts of Hell, Purgatory and Heaven, using each to show what humanity has done, what it's doing and where it should be going, respectively.\n\nThe first, Hell, is obvious: with a montage of cuts from a multitude of news and film clips, Godard shows us the extent to which we prey upon each other even as we pray for each other. So, there are some real  all too real  scenes of the dead, the dying and the executed during the many wars that have been documented during the last hundred years or so. Nothing new here at all...\n\nThe second, Purgatory (a place for waiting), is  well  an exposition about waiting: waiting for a bus, for a train, for a plane, for a meeting to start, for a bridge to be rebuilt, for a nation to recover from war, for people to begin to understand each other. And this is all done within the thin framework of the story of Olga (Nade Dieu), the Jewish journalist from Tel Aviv who is attending a lecture by Godard (playing himself) in Sarajevo, and who is trying to understand why human problems cannot seem to be resolved, no matter what. Significantly, by choosing just Olga, Godard has certainly brought his philosophy to a very personal level, and one with which we can all identify, more or less.\n\nAll of that is rendered moot when Olga appears to commit an unspeakable act when she returns to Tel Aviv. Perhaps Godard should have told her that it's not the end that matters but the journey to achieve that end?\n\nThe third  the shortest vignette  is our final destination: as a prisoner of Nature, complete with - American! - border guards who let Olga through to join the happy throng. Essentially: strip off civilization and return to our basics to find out who we really are...\n\nI think I'll stick with tackling prejudice, reducing global warming and trying to make a positive difference rather than taking Olga's choice.\n\nIt's well filmed, as you'd expect from Godard; the music is, at times, quite beautiful to hear; and the Sarajevo mise-en-scene is a stark reminder of our collective sins. An annoying aspect for me, however, is that not all dialog was translated and subtitled; perhaps it wasn't necessary? \n\nSo, while interesting visually and aurally, I'd recommend this only for those who like to reflect upon existential problems within philosophy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0360845/"
}