{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve Martin",
            "url": "/name/nm0000188/"
        },
        {
            "@type": "Person",
            "name": "Helena Bonham Carter",
            "url": "/name/nm0000307/"
        },
        {
            "@type": "Person",
            "name": "Chelcie Ross",
            "url": "/name/nm0743304/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11391,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014903/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069112/"
        },
        {
            "@type": "Person",
            "name": "Paul Felopulos",
            "url": "/name/nm0271552/"
        },
        {
            "@type": "Person",
            "name": "David Atkins",
            "url": "/name/nm0040575/"
        }
    ],
    "datePublished": "2001-12-14",
    "description": "A dentist finds himself a murder suspect after a sexy patient seduces him and steals all of the drugs from his practice.",
    "director": [
        {
            "@type": "Person",
            "name": "David Atkins",
            "url": "/name/nm0040575/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTMzOTU3NjUtZjRlMi00ODgyLWJlOTktYzI5MmRjMjI4NTlmXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_.jpg",
    "keywords": "frame up,dentist,black comedy,femme fatale,murder",
    "name": "Novocaine",
    "original_info": {
        "id": "Novocaine_2001",
        "name": "Novocaine",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2003-08-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0234354/"
        },
        "name": "Decent black comedy",
        "reviewBody": "I hesitate to call \"Novocaine\" a film noir, for those knowledgeable cinema buffs out there may harass me and tell me film noir is usually set in the forties, and so on and so forth. But the core of film noir is really the essential idea of the Everyman thrust into incomprehensible situations, not aware of what is happening, why, or how to stop it. Film noirs usually show our hero caught up in framed murder. In \"Novocaine,\" a dentist is thrust into a world of lies, deceit, sex, drugs, and murder. And if that doesn't tickle your fear, then maybe the fact that the dentist is Steve Martin will.\n\nFilm noirs are a tricky thing to make correctly. They can fail very easily, such as the incredibly disappointing \"D.O.A.\" They can stumble, mess up. When the rare \"Who Framed Roger Rabbit?\" comes along, it is time to rejoice. I must admit that when I went to see \"Novocaine\" with Steve Martin, I did not expect very much. I had already heard bad news about it, seen little previews for it, and generally expected it to be a bad movie. Steve Martin in a film noir about a funny dentist? Fortunately, I instantly realized I had made a mistake.\n\nOur tale begins with Dr. Frank Sangster, a mild-mannered dentist (isn't that how it always is in film noirs?) with a fiancé/co-worker, Jean (Laura Dern), and a generally nice, peaceful little world. But that world is shaken when a sleazy, lusty woman named Susan Ivey (Helena Bonham Carter) walks through the doors. She wants Novocaine, but Frank doesn't know this. After a night of passion in the dentist's chair, Frank agrees to give her Novocaine for pain she is having. But the next day, when he thinks he may have gotten away with everything, he finds out that Susan has increased the amount on the prescription he gave her from about 1 to 100, or something like that. Soon Frank is being checked out by the Three-Letter Government Corporations, and, unable to come up with excuses for the missing Novocaine, tries to find Susan and confront her about it. Before long he is caught up in a web of deceit, murder, perjury, all the stuff I said before.\n\n\"Novocaine\" is a sweet ball of darkness, laughs and film noir. It numbs you, leaving you breathless. It is as if the film itself is \"Novocaine.\" It isn't a terrific comedy, or a terrific film noir, but it is a heck of a lot better than you have probably been led to believe. Steve Martin is about the last person you'd expect to see in a film like this, but my favorite comedian pulls it off. His character, Frank, has no idea what is going on. He isn't experienced in the world of greed, lust and so on and so forth like Susan is--he is new to it, stumbling forward unsure of where to go next. As situations catch up with him, he runs farther, searching the darkness, trying to find answers.\n\nThis is a fun movie to watch, the kind of movie I've been looking for. The beginning credits, which show X-rays of the human mouth, set the tone for the film--it is a dark movie, and leaves you feeling dirty throughout. It is the type of movie where you want to sit back, shake your head and make ticking sounds with your mouth. It frustrates you, it leads the characters into wrong decision, and you want to yell at the screen to stop them from doing what they're doing. But when the dirty feeling of the film kicks in, the small laughs along the way provide a balance to the darkness. \"Novocaine\" is a very well-done film noir. When the credits start rolling, you will feel surges of anger, frustration, laughter and sadness, and then the numbness will kick in on the ride home, and you'll feel like you've just been given a dose of Novocaine.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi647627033",
        "name": "Novocaine",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTRiY2U3MDMtYzc4My00NDUzLTliNjMtMGE3N2JjM2Y1MzgwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTRiY2U3MDMtYzc4My00NDUzLTliNjMtMGE3N2JjM2Y1MzgwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:17:41Z",
        "url": "https://www.imdb.com/video/vi647627033/"
    },
    "url": "/title/tt0234354/"
}