{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Juliane Köhler",
            "url": "/name/nm0477810/"
        },
        {
            "@type": "Person",
            "name": "Merab Ninidze",
            "url": "/name/nm0632457/"
        },
        {
            "@type": "Person",
            "name": "Matthias Habich",
            "url": "/name/nm0352278/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13570,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Nowhere in Africa",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079008/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002257/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011145/"
        },
        {
            "@type": "Person",
            "name": "Caroline Link",
            "url": "/name/nm0512862/"
        },
        {
            "@type": "Person",
            "name": "Stefanie Zweig",
            "url": "/name/nm0959004/"
        }
    ],
    "datePublished": "2003-05-16",
    "description": "A German Jewish refugee family moves to and adjusts to a farm life in 1930s Kenya.",
    "director": [
        {
            "@type": "Person",
            "name": "Caroline Link",
            "url": "/name/nm0512862/"
        }
    ],
    "duration": "PT2H21M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTg2ODkxOWUtZTNlMi00NTJlLWE4NzktMDc3ODI1Mzg4N2Q2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "kenya,anti semitism,holocaust,adultery,world war two",
    "name": "Nirgendwo in Afrika",
    "original_info": {
        "id": "Nowhere in Africa_2001",
        "name": "Nowhere in Africa",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zachsaltz"
        },
        "dateCreated": "2003-07-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0161860/"
        },
        "name": "First Epic in a Long Time",
        "reviewBody": "Here is a grand epic in the scale of \"Gone With the Wind\", \"Lawrence of Arabia\", and \"Fitzcarraldo\". It is the best movie I've seen this year, and more than that, it was one of the most amazing film experiences of my life.\n\nIt is Caroline Link's \"Nowhere in Africa\", which won the Best Foreign Film Award when, in actuality, it was far better than the Best Picture of the Year. To call it a great or brilliant or majestic film is an understatement; in fact, I'm at a loss for adjectives to describe it.\n\nThe film tells the story of a German Jewish woman and her young daughter summoned to Kenya by her husband, circa. 1938. Adolf Hitler is on the brink of declaring his \"final solution\" of the Jews, and it is with great luck that Jettel and young Regina escape.\n\nIn Africa, they adapt slowly to their new rural life. While Regina befriends cook Owuor, Walter and Jettel's relationship threatens to destroy itself because of the hardships the family encounters.\n\nI will not spend too much time going into detail, for watching this masterful story unfold is a treasure in itself. This film is based on an autobiography by Stephanie Zweig, and when it is available in English, I will certainly read it.\n\nAlso, the language in this movie is truly beautiful. I saw \"Nowhere in Africa\" again, just days after watching it for the first time, and spent more time ignoring the subtitles and listening to the beautiful spoken German. \n\nAnd then there is one scene toward the end that I simply could not believe. It involves a locust invasion, and, quite simply, it was the first time I've ever seen something on the screen and asked myself aloud (as I did the first viewing), \"How did they do that?\" \n\nThe performances here are first-rate, too. Julianne Kohler, who was wonderful in the ultra-weird \"Aimee & Junger\" is perfect; we understand this woman fully, even when she doesn't speak. Merab Ninidze has some great scenes with Walter, the father; and Sidede Onyulo is simply magical as Owuor.\n\nBut the movie belongs to the two girls who play Regina. They look amazingly similar, and they are both stellar. Lea Kurka brings much hope as the adorable young Regina, and Karoline Eckertz is subtle and remarkable as the older Regina, particularly in a heartbreaking exchange with her father at her school.\n\nIt would be a shame to miss this film. No, it would be more than a shame. It would be downright wrong and discouraging. This film, along with the wonderful \"Whale Rider\" are two remarkable international films that bring beauty, grace, and majesty to the screen, and are perfect for adults and older children.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Zeitgeist Films",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1201537305",
        "name": "Nowhere in Africa",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWE3MTA1NzktM2JiOC00ODlmLWExMjItMWZiODE1YjVmZjRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWE3MTA1NzktM2JiOC00ODlmLWExMjItMWZiODE1YjVmZjRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:30:34Z",
        "url": "https://www.imdb.com/video/vi1201537305/"
    },
    "url": "/title/tt0161860/"
}