{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marietta",
            "url": "/name/nm0547358/"
        },
        {
            "@type": "Person",
            "name": "William Mayer",
            "url": "/name/nm0562535/"
        },
        {
            "@type": "Person",
            "name": "Lester Brown",
            "url": "/name/nm0114094/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1150,
        "ratingValue": 3.8,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016576/"
        },
        {
            "@type": "Person",
            "name": "Jack Caplan",
            "url": "/name/nm5506649/"
        },
        {
            "@type": "Person",
            "name": "Doris Wishman",
            "url": "/name/nm0822555/"
        }
    ],
    "description": "A rich rocket scientist organizes an expedition to the moon, which they discover is inhabited by nude women.",
    "director": [
        {
            "@type": "Person",
            "name": "Doris Wishman",
            "url": "/name/nm0822555/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Fantasy",
        "Romance",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmYyNzYxYjYtYzNlZC00OWY2LWI4YjAtYWNmMGViMjM3NjFiXkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_.jpg",
    "keywords": "independent film,moon,cult director,astronaut,exploitation",
    "name": "Nude on the Moon",
    "original_info": {
        "id": "Nude on the Moon_1960",
        "name": "Nude on the Moon",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Katterfelto"
        },
        "dateCreated": "2004-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056293/"
        },
        "name": "And The Heavens Brought Forth The Wonder of Woman!",
        "reviewBody": "If there were an Oscar category for most sincere performance in a ridiculous movie (and there should be!), Lester Brown and William Mayer would surely have been nominated for their work in Doris Wishman's \"Nude on the Moon,\" a jaw-dropping sci-fi \"nudie cutie\" in which Brown and Mayer play a pair of intrepid astronauts who discover the first interplanetary nudist colony.\n\nBrown, a handsome Wishman veteran who also appeared in Doris's \"Blaze Starr Goes Wild\" (1960), \"Gentlemen Prefer Nature Girls\" (1962), and \"Behind the Nudist Curtain\" (1964), plays dedicated young scientist Jeff Huntley, who decides to use his $3 million inheritance to finance a trip to the Moon along with mentor and colleague William Mayer (i.e., the \"Professor.\")\n\nOne of the amazing things about the film is the amount of time and care devoted to its exposition and set-up. The extended opening sequence is surprisingly well written, and is easily on par with any sci-fi \"B\" movie from the early sixties. Brown and Mayer are credible and convincing throughout, which only makes the lunacy (no pun intended) all the more surreal. Their straight-faced, deadpan performances help make the film the giddily preposterous gem that it is.\n\nTop billing is afforded nudie model \"Marietta,\" who appears in the double roles of Brown's secretary, Cathy, and the Moon Queen. She was obviously cast on account of her physical attributes, yet she's actually a decent actress, and her brief scenes as Brown's lovestruck secretary are sincere and believable. \n\nThe film opens with a cheesy and inexplicably lengthy shot of the twinkling heavens as might be viewed from the moon, accompanied by Judith J. Kushner's catchy title song, \"Moon Dolls,\" sung by Ralph Young, who would later partner with Belgian singer Tony Sandler to form the famous recording duo of Sandler and Young. (Another interesting footnote: Doc Severinsen of Johnny Carson's \"Tonight Show\" not only contributed to the musical score but also appears in the cast list, though I challenge anybody to recognize him as one of the half-naked \"moon men.\")\n\nOne of the great things about this movie is the sunny, Florida-travelogue photography. And there are one or two beautiful and almost breathtakingly unconventional shots of our heroes driving along rain-slicked Miami blacktop under a menacing canopy of thunderheads. \n\nThere's also a clever in-joke that occurs whilst our intrepid astronauts drive through Miami Beach on their way to the launch pad. Just as Clint Eastwood walked past a movie marquee advertising the Eastwood-directed \"Play Misty for Me\" in Don Siegel's \"Dirty Harry,\" Brown and Mayer drive past Miami Beach's Variety Theater, the marquee of which is emblazoned with the title of another Doris Wishman film, \"Hideout in the Sun\" (in \"Nuderama!\")\n\nThe great drive-in movie critic Joe Bob Briggs listed \"Nude on the Moon\" as one of his \"Sleaziest Movies in the History of the World,\" however I would respectfully disagree. For sheer sleaze, the film hardly measures up to Wishman's \"Bad Girls go to Hell\" (1965), \"The Amazing Transplant\" (1970), or her latest offering, \"Satan was a Lady\" (2001). In spite of the liberal above-the-waist nudity, \"Nude on the Moon\" is one of the least sleazy movies I've ever seen. I've seen many films with far fewer bared breasts that were a thousand times sleazier. If anything, this most famous of Wishman's films strikes the viewer not with its venality but its astounding innocence.\n\nOne of the most interesting things about the film was that it was shot at the oddball south Florida tourist attraction, Coral Castle, the bizarre history of which is detailed in Florida journalist Eliot Kleinberg's entertaining book \"Weird Florida.\" Coral Castle was also used as a location in James L. Wolcott's \"Wild Women of Wonga\" (1958) and Herschell Gordon Lewis's obscure fantasy opus, \"Jimmy, the Boy Wonder\" (1966).\n\nCult fans will immediately recognize blonde cutie Shelby Livingston in a non-speaking part as one of the fetching \"Moon Dolls.\" Shelby is best remembered for her role as disaffected housewife Bea Miller, who gets her arm hacked off in H.G. Lewis's southern-fried gorefest, \"Two Thousand Maniacs.\"\n\nA delirious mixture of campy humor, harmless nudity and Florida kitsch, \"Nude on the Moon\" is a priceless cinematic gem from a more innocent time. A silly, wonderful, charming little film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Nude on the Moon",
        "duration": "PT1M51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1603928345",
        "name": "Nude on the Moon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTZjZmVhNGMtODFjNy00NDc2LThjNGEtNjc0ZjI0YjFhNGQ0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTZjZmVhNGMtODFjNy00NDc2LThjNGEtNjc0ZjI0YjFhNGQ0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:17:46Z",
        "url": "https://www.imdb.com/video/vi1603928345/"
    },
    "url": "/title/tt0056293/"
}