{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Idle",
            "url": "/name/nm0001385/"
        },
        {
            "@type": "Person",
            "name": "Robbie Coltrane",
            "url": "/name/nm0001059/"
        },
        {
            "@type": "Person",
            "name": "Camille Coduri",
            "url": "/name/nm0168554/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8639,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103514/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Lynn",
            "url": "/name/nm0528718/"
        }
    ],
    "datePublished": "1990-03-30",
    "description": "2 criminals want out but their boss kills those leaving. When the men are ordered to rob the triad, they keep the money and hide from the boss, triad and police at a convent, dressed as nuns.",
    "director": [
        {
            "@type": "Person",
            "name": "Jonathan Lynn",
            "url": "/name/nm0528718/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODVkNjZlMmUtZGQwNC00NjE5LWIxYmYtZThlMTFiZDNmM2UyXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "on the run,nun,gangster,man dressed as nun,disguise",
    "name": "Nuns on the Run",
    "original_info": {
        "id": "Nuns on the Run_1990",
        "name": "Nuns on the Run",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oneguyrambling"
        },
        "dateCreated": "2011-12-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100280/"
        },
        "name": "Finally a decent cross-dressing flick with nuns.",
        "reviewBody": "Every few years someone thinks it would be a funny idea to have guys running around in girl's clothing or vice versa. (Occasionally a Wayans brother (or two) think it would be even funnier if they were also a different race as well as a different gender, but that's another, sadder story.) Nuns on the Run is most definitely a one-note premise milked dry, but it has enough jokes along the way to make it a worthwhile 90 minutes.\n\nBrian (Eric Idle) and Charlie (Robbie Coltrane) are reluctant robbers who lament the old classy days where violence wasn't necessary. Their boss Case is a hard nut who favours the new ways – guns n stuff – and the boys are dropped in the sh*t when he discovers that they want out.\n\nSo out of desperation the duo decide to 'heist the heisters', keep the ill gotten gains for themselves and zippedy-skidoo off to Brazil for the remainder of their lives.\n\nThings get complicated when 1/ Brian falls for a ditzy waitress named Faith, and 2/ the re-heist goes awry and they must lie low in the nearest safe place.\n\nOf course this is a nunnery, and despite looking like guys with horrible make up and sounding like guys doing women's voices badly none of the nuns are nun the wiser or something like that.\n\nWhat ensues is obvious and formulaic – but funny nonetheless.\n\nWe get to see these obvious non-nuns teaching impressionable young girls about religion, (and after phys-ed joining them in the showers!), hear confession, and watch ugly Brian ward off the local horny priest and keep his cover a secret from Faith who has managed to show up at the nunnery.\n\nAs the police, the triads and Case's gang all search for the boys and their stolen cash even the nuns start getting a little suss as to their true identities.\n\nEric Idle and Robbie Coltrane are both very strong comedic actors, though it must be said some of the bit parts were cast in haste, as some of the acting is quite atrocious.\n\nAll that said the banter is light and humorous and there are some genuine laughs at times. It's hard not to like Nuns on the Run, it isn't blasphemous or too racy and for the most part realises it is little more than an innocent flick with no delusions of grandeur.\n\nFinal Rating – 6 / 10. Hard to track down now, and admittedly a one-note flick. But a good one.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Eric Idle and Robbie Coltrane team up for this bad boy comic burlesque directed by Jonathan Lynn.\r\nIdle and Coltrane play Brian Hope and Charlie McManus, a pair of two-bit hoods who want to go straight, repulsed by the increasing reliance on guns and violence in their line of work. In thrall to vicious gangster Case Casey (Robert Patterson), the duo determines that their next job will be their last. \r\nWhen a large amount of money is extracted from a gang of Hong Kong drug dealers and it falls into the laps of Brian and Charlie, the two take off with the loot, with the Chinese Triads, Casey and the police in relentless pursuit. \r\nBut after their car inevitably runs out of fuel in front of a convent, Brian and Charlie act quickly to disguise themselves as two of the ugliest nuns imaginable. Passing themselves as nuns from a different order awaiting a missionary assignment, the two 'men' enjoy their undercover work amongst the youthful co-eds studying at the school. Meanwhile their pursers begin to close in on their trail in this uproarious and farcical comedy.",
        "duration": "PT2M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi502186777",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmY2NTA2YWQtMzA5NC00ZDQxLWE5NDQtYjYzYzAzYzlhYzUzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmY2NTA2YWQtMzA5NC00ZDQxLWE5NDQtYjYzYzAzYzlhYzUzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-22T21:06:01.740Z",
        "url": "https://www.imdb.com/video/vi502186777/"
    },
    "url": "/title/tt0100280/"
}