{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Boris Livanov",
            "url": "/name/nm0515104/"
        },
        {
            "@type": "Person",
            "name": "Nikolay Popov",
            "url": "/name/nm3640809/"
        },
        {
            "@type": "Person",
            "name": "Vasili Nikandrov",
            "url": "/name/nm0631634/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8100,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "October (Ten Days that Shook the World)",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0114100/"
        },
        {
            "@type": "Person",
            "name": "Sergei Eisenstein",
            "url": "/name/nm0001178/"
        },
        {
            "@type": "Person",
            "name": "Grigoriy Aleksandrov",
            "url": "/name/nm0017893/"
        },
        {
            "@type": "Person",
            "name": "John Reed",
            "url": "/name/nm0715487/"
        }
    ],
    "datePublished": "1928-09-24",
    "description": "A large-scale view on the events of 1917 in Russia, when the monarchy was overthrown.",
    "director": [
        {
            "@type": "Person",
            "name": "Grigoriy Aleksandrov",
            "url": "/name/nm0017893/"
        },
        {
            "@type": "Person",
            "name": "Sergei Eisenstein",
            "url": "/name/nm0001178/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTNmNjQxYjgtODNmYi00ZGEzLTk3NmYtNDI2ZDI0ZDI5YzY4XkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "october revolution,reference to alexander karensky,trotsky,leon trotsky,cossacks",
    "name": "Oktyabr",
    "original_info": {
        "id": "October_1927",
        "name": "October",
        "year": "1927"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2006-08-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0018217/"
        },
        "name": "Interesting documentary-like film about the Soviet Revolution",
        "reviewBody": "This film is highly reminiscent of Eisenstein's later work, POTEMKIN, in that it looks like like a typical historical film but more like a re-creation of the events--much like a documentary. However, like POTEMKIN, it too is a very politically driven propaganda film. While most of the moments on film are pretty realistic, Eisenstein and Alexandropov also intersperse little scenes that portray the Communists as noble peasants and the Kerensky government as patently evil. While depicting the Czarist regime that preceded the Kerensky government as evil is pretty accurate, the story of Kerensky isn't quite that cut and dry. While he did create his own downfall due to the foolish decision to continue the war against Germany after the May Revolution (the non-Communist revolution of 1917 that sought reforms and forced the czar to abdicate), Kerensky and his men weren't quite the evil pigs they were depicted as in the film. But, of course, considering the October Communist Revolution was still recent history when the film was made, this sort of hyperbole is rather understandable. Plus, given the control exercised over the Soviet film industry, it is doubtful that Kerensky and his cronies could have been depicted any other way.\n\nParticular standouts in the film are the interesting and very imaginative camera-work as well as the brisk pace and realism of the film. About the only negatives (other than the way they depicted the Kerensky government) were the excessive use of some footage to make a simple point--such as showing men scrambling out of a doorway again and again and again to let the audience know people are pouring into a room or returning to the same shot repeatedly. At the time, this was pretty forgivable and normal, but today it appears, at times, like it could have used a bit tighter editing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0018217/"
}