{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Toshio Furukawa",
            "url": "/name/nm0299192/"
        },
        {
            "@type": "Person",
            "name": "Edward Glen",
            "url": "/name/nm0322507/"
        },
        {
            "@type": "Person",
            "name": "Keiko Han",
            "url": "/name/nm0359168/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 199,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "alternateName": "Odin",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074964/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0261210/"
        },
        {
            "@type": "Person",
            "name": "Kazuo Kasahara",
            "url": "/name/nm0440378/"
        },
        {
            "@type": "Person",
            "name": "Toshio Masuda",
            "url": "/name/nm0557927/"
        },
        {
            "@type": "Person",
            "name": "Yoshinobu Nishizaki",
            "url": "/name/nm0632827/"
        }
    ],
    "datePublished": "1985-08-10",
    "description": "A distress signal from a point near Jupiter takes the crew of the space-ship Starlight on a voyage through the sea of stars to a mysterious planet called Odin, the possible birthplace of the universe.",
    "director": [
        {
            "@type": "Person",
            "name": "Takeshi Shirato",
            "url": "/name/nm0794168/"
        },
        {
            "@type": "Person",
            "name": "Eiichi Yamamoto",
            "url": "/name/nm0945412/"
        },
        {
            "@type": "Person",
            "name": "Toshio Masuda",
            "url": "/name/nm0557927/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWU2NGU3MDktNjhjNC00NTAxLThhNzQtOWU2YTM3ZTBjNTk3XkEyXkFqcGdeQXVyNzQzNzQxNzI@._V1_.jpg",
    "keywords": "outer space,f word,for grown ups animation,anime animation,odin",
    "name": "Ôdîn - Kôshi hobune stâraito",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "J-bot6"
        },
        "dateCreated": "2020-06-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0161122/"
        },
        "name": "If you like big-concept pulp sci-fi, then don't miss this movie.",
        "reviewBody": "I'm a huge fan of the bold and wild imaginative worlds presented by pulp sci-fi. And I'm also a big fan of anime, having watched shows like Yamato/Star Blazers, Galaxy Express 1999, Macross, and a ton of other notable animated epics.\n\nI'd seen the 90-minute U.S. cut of this film a long time ago and thought it was good, but not great. Recently though, I watched the 135-minute Japanese-language version twice in one week (yep, over four hours of viewing). My opinion on this movie has just jumped up a few notches. The more I watch this, the more I appreciate it. The design work is phenomenal and the soundtrack is excellent. In fact, I'm noticing a resurgence in interest in the band Loudness and the album that features songs from this film.\n\nFor me, I want a sci-fi film to take me places and this one certainly does. For a movie that has over a 2-hour running time, this one speeds along from location to location. In fact, it could use another hour. Regardless, the quick pace is fine with me, since that's a hallmark of the earlier days of science fiction (with 2001: A Space Odyssey being the exception).\n\nThis feature has many many influences, and pretty much every title I've mentioned in this review are among them. I noticed in the FAQ that people criticized this film for treading a similar path to Space Battleship Yamato. However, I don't see people saying the same about Legend of the Galactic Heroes or a few other features that also owe a great deal to Yamato. I'd go as far as to say that Odin actually improves on Yamato in a number of ways while adding in welcome elements like concepts from Fred Saberhagen's Berserker novels.\n\nThis movie stays on course and maintains a consistent tone. I can't say enough about the latter, since so very many sci-fi features go off the rails or insert silly characters or scenes for seemingly no reason. Odin, however, keeps things consistent and even manages to end the film on a very emotional and epic note.\n\nI salute the people who made this film possible and all the thought and hard work that they put into it. Bravo!\n\nThanks also to neo1024. You've done a man's job sir!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0161122/"
}