{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Douglas Campbell",
            "url": "/name/nm0132409/"
        },
        {
            "@type": "Person",
            "name": "Eleanor Stuart",
            "url": "/name/nm0835685/"
        },
        {
            "@type": "Person",
            "name": "Robert Goodier",
            "url": "/name/nm0328934/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 315,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0593497/"
        },
        {
            "@type": "Person",
            "name": "Sophocles",
            "url": "/name/nm0814668/"
        },
        {
            "@type": "Person",
            "name": "E.F. Watling",
            "url": "/name/nm2588740/"
        },
        {
            "@type": "Person",
            "name": "William Butler Yeats",
            "url": "/name/nm0947102/"
        }
    ],
    "datePublished": "1957-01-06",
    "description": "The land ruled by King Oedipus is plagued by ill-fortune and the people are promised relief by the gods if the slayer of the former king is apprehended and punished. This does not bode well for King Oedipus and his Queen. (Perform...",
    "director": [
        {
            "@type": "Person",
            "name": "Tyrone Guthrie",
            "url": "/name/nm0349310/"
        },
        {
            "@type": "Person",
            "name": "Abraham Polonsky",
            "url": "/name/nm0689796/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2UwOTAzOWEtZTk1My00YTU0LWJhMWEtNzkwMTc0NGUxNTM1XkEyXkFqcGdeQXVyNzQzNzQxNzI@._V1_.jpg",
    "keywords": "character name as title,oedipus character,jocasta character,two word title,mother son incest avoided",
    "name": "Oedipus Rex",
    "original_info": {
        "id": "Oedipus Rex_1957",
        "name": "Oedipus Rex",
        "year": "1957"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rpoz-918-701989"
        },
        "dateCreated": "2010-12-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050792/"
        },
        "name": "Feel the Pain",
        "reviewBody": "I first saw this film (in a movie theater) in 1962 and had no idea what I was watching. Years later, as a high school and college English instructor, I knew lots about Greek tragedy and this version of Oedipus the King remains one of my favorite dramatic experiences. You can't find William Butler Yeats' translation in print anymore because the (ahem) \"scholars\" have decided it's not totally accurate. Ever read any of the \"scholarly\" translations of Greek tragedy? Those professors can't write poetry to save their lives. They make tragedy boring and stuffy. Yeats makes it breathe. And Tyrone Guthrie made tragedy \"pop\" in this thrilling 1957 production. In tune with Aristotelean requirements, there is a bare stage with a representation of Oedipus' palace. The actors and chorus members wear masks (very close to the spirit of original masks found by archaeologists), and they chant and move in dance-like cadences. At first, it may seem bizarre, but when you understand that you are being transported 2000 years into the past and watching drama being born out of religious ritual, you can sense the raw power of watching arrogant Oedipus fall into ruin. The performances are visceral and dangerous, the colors beautiful, the effect shattering. And you also get to see a boyish William Shatner before he became Captain Kirk (you'll see him in the brief introduction; once he puts on a mask you'll have no idea which one he is). Unlike the pretentious film auteurs of today who meander on and on, Sophocles packed his cautionary tale of human frailty into 90 taut minutes. I used this video for years in my Advanced Placement English classes, but I've also watched it many times just for entertainment.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0050792/"
}