{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sergey Makovetskiy",
            "url": "/name/nm0538710/"
        },
        {
            "@type": "Person",
            "name": "Dinara Drukarova",
            "url": "/name/nm0238506/"
        },
        {
            "@type": "Person",
            "name": "Anzhelika Nevolina",
            "url": "/name/nm0627549/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4065,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Of Freaks and Men",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0137977/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014852/"
        },
        {
            "@type": "Person",
            "name": "Aleksey Balabanov",
            "url": "/name/nm0049326/"
        }
    ],
    "description": "Dariya the maid getting a boy to touch her large breast is just one incident that occurs when Yohan and Victor infiltrate two families, forcing young Liza and blind Ekaterina to appear in porn, but they are not so innocent themsel...",
    "director": [
        {
            "@type": "Person",
            "name": "Aleksey Balabanov",
            "url": "/name/nm0049326/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyNDMyNzU4NV5BMl5BanBnXkFtZTgwMTUwNDgwMzE@._V1_.jpg",
    "keywords": "obsession,female frontal nudity,female rear nudity,voyeurism,submissive woman",
    "name": "Pro urodov i lyudey",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jandesimpson"
        },
        "dateCreated": "2002-06-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0156849/"
        },
        "name": "A Russian oddball",
        "reviewBody": "Every so often one has the pleasure of discovering a film so unusual that it seems that nothing has influenced it in its creation of a world all its own. One such was David Lynch's \"Eraserhead\", another, Charles Laughton's \"Night of the Hunter\" and now to join the august company is Alexsei Balabanov's \"Of Freaks and Men\". By dressing up a most scurrilous plot in images of extraodinary elegance and beauty the director has created an astonishingly original entertainment. Turn of the century St. Petersburg is hauntingly captured in beautiful sepia visuals of waterways and bridges, classical exteriors and upper class salons. But behind this facade the very devil is at work in the form of a gang of pornographic photographers who insinuate themselves into the lives of two respectable families whom they summarily proceed to corrupt. In due course the daughter of a highly respected engineer is enjoying having her naked buttocks spanked by an old crone in front of the camera, while the blind wife of a doctor in the other household becomes infatuated with another member of the gang who is only there to satisfy his paedophiliac fascination with the adolescent boy Siamese twins she and her husband have adopted. And this only for starters! As things go from bad to worse and goings on become more depraved - although admittedly we see no more than the odd spanking - the visuals become ever more beautiful particularly when the twins travel to the snowbound east and the girl travels west to wander a townscape of blowing autumn leaves. I think Balabanov is trying to say something about the voyeuristic nature of the camera and the progress of photography from still to moving pictures. To probe for deeper meanings wound not be very fruitful from a film whose raison d'etre, I suspect, is simply to intrigue and delight.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0156849/"
}