{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Florina Rodov",
            "url": "/name/nm0734972/"
        },
        {
            "@type": "Person",
            "name": "Jason Brill",
            "url": "/name/nm0109340/"
        },
        {
            "@type": "Person",
            "name": "Eddie Malavarca",
            "url": "/name/nm0539008/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2284,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009645/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007554/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065166/"
        },
        {
            "@type": "Person",
            "name": "Elise MacAdam",
            "url": "/name/nm0531183/"
        },
        {
            "@type": "Person",
            "name": "Tom Kalin",
            "url": "/name/nm0435788/"
        },
        {
            "@type": "Person",
            "name": "Cindy Sherman",
            "url": "/name/nm0792398/"
        }
    ],
    "datePublished": "1997-12-03",
    "description": "A mousy office worker accidentally kills one of her coworkers, then proceeds to bump off a few others.",
    "director": [
        {
            "@type": "Person",
            "name": "Cindy Sherman",
            "url": "/name/nm0792398/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Comedy",
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDg2NTczMDctZmZmNC00MDczLTgyNjUtZWJiOTU4ZDBlOGU5XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "getting away with murder,title directed by female,slasher,workplace romance,socially awkward",
    "name": "Office Killer",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol-kay"
        },
        "dateCreated": "2005-10-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119819/"
        },
        "name": "Dead-Line",
        "reviewBody": "***SPOILERS*** Hard to take black-comedy that grosses itself out long before the ending credits. Mousey and introverted magazine proofreader Dorine Douglas,Carol Kane,is the most effective worker at the office. When it comes down the grapevine that there's going to be a major change-over at the magazine Dorine as well as most of the staff are sent home to do the work and e-mail it in via a new computer system that being installed. \n\nDorine looking harmless and nerdy has a deep seeded and unstable violent streak in her and it's this event that eventually bring it out to the surface with murderous results. Not wanting to be at home with her infirmed mother Chalotta, Alice Drummond,and away from her job and fellow workers at the office slowly turns Dorine's sick thoughts into violent actions and it's a quirk of fate that sets it all into motion.\n\nQuietly and secretly killing off her fellow workers at the magazine Dorine hides their bodies in her basement to keep her company. While all this was going on Kim, Molly Ringwald,a writer at the magazine becomes suspicious of Dorine not really knowing whats she doing but that she's somehow trying to get her fired from the job. \n\nDorine besides murdering her fellow workers is greatly disturbed with Kim who, besides being more popular, seems to be on to her and about to uncover what Dorine's really up to. There's also office manager Norah Reed, Jeanne Tripplehorn who Dorine feels has been embezzling the magazine coffers and is responsible for what's been happening there. \n\nTrying to murder Kim in a dark and empty stairway Kim gets away but is later fired for accusing \"sweet and innocent\" Dorine of trying to kill her. Norah who befriends Dorine, because her timely article saved the magazine from folding, invites her out to lunch. It's then when she's knocked out in the parking lot by her and brought back to Dorines basement and locked in with all the other stiffs. \n\nKim getting in touch with Norah's boyfriend Danial, Michael Imperioli, to warn him about how unstable Dorine is as well as Norah being alone with her that afternoon. This has has him driving to the Douglas house looking for her only to find that Kim was right about Dorine, dead right, and that he and Norah were soon to pay the price for not listening to her.\n\nStrange but interesting and not for everyones tastes \"Office Killer\" takes a while to get off the ground but once it gets going you can't really take your eye off it.\n\nCarol Kane as Dorine is her usual quite and passive self at first but slowly goes postal as the pressure of her job, and putting up with her nagging mom, gets to her and drives Dorine over the brink. We also get an insight of Dorine's relationship with both her mom and dad Peter Douglas, Eric Bogosian,in a number of flashback sequences. The flashbacks indicate that she not only was sexually abused by Peter when she was a young girl but was also responsible for the car accident that took his life, and ended up crippling her mom for life. Which may have well been the reason for her distorted mental state as an adult.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A mousy office worker accidentally kills one of her coworkers, then proceeds to bump off a few others.",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1183826713",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzFkMTcyZTktNDY5NS00ZDZkLTkzZTEtMjNlZWZlMzgzYmUwXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzFkMTcyZTktNDY5NS00ZDZkLTkzZTEtMjNlZWZlMzgzYmUwXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-28T16:52:40.077Z",
        "url": "https://www.imdb.com/video/vi1183826713/"
    },
    "url": "/title/tt0119819/"
}