{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maureen Lipman",
            "url": "/name/nm0513520/"
        },
        {
            "@type": "Person",
            "name": "Hugh Jackman",
            "url": "/name/nm0413168/"
        },
        {
            "@type": "Person",
            "name": "Josefina Gabrielle",
            "url": "/name/nm0300330/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2085,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Oscar Hammerstein II",
            "url": "/name/nm0358564/"
        },
        {
            "@type": "Person",
            "name": "Lynn Riggs",
            "url": "/name/nm0726704/"
        }
    ],
    "datePublished": "2003-11-22",
    "description": "Cowboy Curly McClain tries to win the heart of a girl in a singing and dancing extravaganza.",
    "director": [
        {
            "@type": "Person",
            "name": "Trevor Nunn",
            "url": "/name/nm0638080/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Musical",
        "Romance",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE4NTkzMTYyM15BMl5BanBnXkFtZTcwNzA0MDQyMQ@@._V1_.jpg",
    "keywords": "theatrical performance filmed for tv,kneeling to propose marriage,knife as weapon,murder trial,cowboy",
    "name": "Oklahoma!",
    "original_info": {
        "id": "Oklahoma!_1999",
        "name": "Oklahoma!",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "divaclv"
        },
        "dateCreated": "2004-06-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0216048/"
        },
        "name": "Oklahoma--MORE than OK",
        "reviewBody": "In 1943, \"Oklahoma!\" debuted on Broadway, and in doing so reinvented music theater. Roughly fifty-five years later, Trevor Nunn reinvented \"Oklahoma!\". The result is something very rare indeed: a production that not only captures the original appeal of its source, but also brings new facets and dimentions to a familiar work.\n\nThe story itself remains simple, almost quaint: young pioneers Laurie (Josefina Gabrielle) and Curly (Hugh Jackman), like a prairie-school Beatrice and Benedick, tease, flirt, goad each other, and otherwise go out of their way to avoid admitting their obvious mutual attraction. But hired hand Jud Fry (Shuler Hensley) nurses a much less wholesome desire for Laurie, and his obsession starts to boil over into a serious threat. Meanwhile in the comic subplot, cowboy Will Parker (Jimmy Johnston) tries to prove himself worthy of his sweetheart Ado Annie (Vikki Simon) before her father can marry her off via shotgun to an unwilling Persian peddler.\n\nBut presentation is everything, and it is here that Nunn's genius shines through. Gone are the clean gingham gowns and pristine landscapes of so many productions past. The sets have a weathered, hard-used look to them, with a cast to match. One can almost feel the sweat and dust clinging to them. This is a harsh frontier we're entering, where there is certainly joy and laughter but also lots of hardship, poverty, and desperation. It's no wonder so many characters cling to their pride, risking everything on a single grand gesture--their pride is one of the few things they can truly call their own.\n\nThe three lead actors are excellent, easily some of the best I've seen in the material. From the moment he strides onstage singing \"Oh What a Beautiful Mornin',\" Jackman is a captivating and fully-developed hero. He brings much of the same cocky bravado that has defined Curly over the years, but balances it with healthy doses of anxiety, bitterness, and sensitivity. Not to be outdone, Hensley's Jud (a creation which quite justly earned him a Tony Award) starts out as a somewhat sad and pitiful creature, but gradually reveals the explosive rage buried inside him. As the woman who comes between them, Gabrielle balances nicely between naivitee and cleverness, and sings in a clear, beautiful soprano.\n\nOf the supporting cast, Maureen Lipman is the standout as that quintessential pioneer matriarch, Aunt Eller. Wise as her years, hard as her life and tender as a sunset, she is the story's moral compass. Simon and Johnston are good, albiet rather conventional in their interpretations. As the peddler Ali Hakim, Peter Pollycarpou is the one false note in the cast, with a huckster attitude and an accent that sounds nearer to Manhattan than the Middle East.\n\nIs this \"Oklahoma!\" better than the 1955 film with Gordon MacRae and Shirley Jones? Arguments will abound for both sides, but at some point the comparison becomes superfluous. The two were created several decades apart, with different approaches and ideas about the story. Suffice it to say, this is and excellent performance, with solid direction, good choreography, and a strong cast. That is recommendation enough."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Oklahoma: Oklahoma!",
        "duration": "PT3M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3575432473",
        "name": "Oklahoma: Oklahoma!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjRkYjM0YzUtNTlhNy00MzJjLTk2MDgtMzlmMGEwZGU5NjYzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjRkYjM0YzUtNTlhNy00MzJjLTk2MDgtMzlmMGEwZGU5NjYzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-02-02T19:09:21.869Z",
        "url": "https://www.imdb.com/video/vi3575432473/"
    },
    "url": "/title/tt0216048/"
}