{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sam Smith",
            "url": "/name/nm0809857/"
        },
        {
            "@type": "Person",
            "name": "David Ross",
            "url": "/name/nm0743335/"
        },
        {
            "@type": "Person",
            "name": "Julie Walters",
            "url": "/name/nm0910278/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 819,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014525/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042731/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0340082/"
        }
    ],
    "datePublished": "2000-10-08",
    "description": "An orphan named Oliver Twist (Sam Smith) meets a pickpocket on the streets of London. From there, he joins a household of boys who are trained to steal for their master.",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU3OTkwODMyNF5BMl5BanBnXkFtZTcwMTIwNDUyMQ@@._V1_.jpg",
    "keywords": "character name as series title,oliver twist character,bill sikes character,fagin character,artful dodger character",
    "name": "Oliver Twist",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vox-sane"
        },
        "dateCreated": "2002-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0222608/"
        },
        "name": "What were they thinking?",
        "reviewBody": "In some ways, it's good to see some of the subplots that have to be snipped for time in shorter renditions. Unfortunately, what remains is twisted Dickens. Dickens wrote for serial, and sometimes wrote himself into corners. He didn't plan Oliver Twist out from the start, so characters like \"Monks\" wormed into later installments to help iron out a conclusion. OLIVER TWIST the book is therefore not to be read or judged like a modern novel, but rather a sprawling (though not so sprawling as the nearly contemporary, episodic, and wonderful PICKWICK PAPERS) epic view of Oliver's world, where many extraneous activities take place. Unfortunately, the writers of this \"Oliver Twist\" have manipulated Dickens to try to tie together all the extraneous material. They've also done unforgivable things to the characters. The way the \"Artful Dodger\" picked Mr. Brownlow's pockets and the aftermath was shocking. Fagin, a wonderful character in all his many incarnations, has been transformed from a man who teaches boys to pick pockets to a magician of sorts, so he comes off more like a thwarted music hall prestidigitator than a corrupter of morals. And the end of Bill Sykes, as written here, is perverted. Some margin of liberty should be granted movie adaptations. Because of time constraints, and the fact that Dickens' wonderful language cannot be easily transferred to the screen. But this version takes too many liberties and warps too many characters. It's a shame, because it has a nice look to it, and Robert Lindsay, a fine actor, might've been a great Fagin. The worst part of the movie is the backstory. Dickens shoves all of the tale of Oliver's parentage into the final pages of his tale, and much that was inexplicable is there explained. These people have expanded upon that to make a full two-hour stand-alone episode! This not only gives a fraudulent view of how OLIVER TWIST the story is constructed, it undercuts what mystery the book possesses. If you want a solid (if truncated) version of the book, David Lean's 1948 adaptation is still powerful; for an even easier to digest version, the Oscar-winning musical has a true Dickensian look and the characters are all true (Ron Moody, Oliver Reed, and Harry Secombe being standouts) and several tuneful songs. If you want a version where Fagin comes out a figure of persecution, try the one where Fagin is portrayed by George C. Scott. If you're a Dickens purist, give this version a miss; if you never intend to read Dickens, or have tried and don't like Dickens, you might like this version after all."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Oliver Twist",
        "duration": "PT1M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3179461657",
        "name": "Oliver Twist",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmRmNjUzMjEtMDg0MS00YjVkLWFhZDktM2UwZTRlZWM1MTFiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmRmNjUzMjEtMDg0MS00YjVkLWFhZDktM2UwZTRlZWM1MTFiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-22T21:43:19.141Z",
        "url": "https://www.imdb.com/video/vi3179461657/"
    },
    "url": "/title/tt0222608/"
}