{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gerard McSorley",
            "url": "/name/nm0574561/"
        },
        {
            "@type": "Person",
            "name": "Michèle Forbes",
            "url": "/name/nm3136250/"
        },
        {
            "@type": "Person",
            "name": "Brenda Fricker",
            "url": "/name/nm0002084/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1685,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103644/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0124832/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103528/"
        },
        {
            "@type": "Person",
            "name": "Paul Greengrass",
            "url": "/name/nm0339030/"
        },
        {
            "@type": "Person",
            "name": "Guy Hibbert",
            "url": "/name/nm0382505/"
        }
    ],
    "datePublished": "2004-05-22",
    "description": "An examination of the aftermath of the 1998 Real IRA bombing that killed 29 people in Omagh, Northern Ireland.",
    "director": [
        {
            "@type": "Person",
            "name": "Pete Travis",
            "url": "/name/nm0871428/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxNjY0MzQwMl5BMl5BanBnXkFtZTcwNDIyMjQzMQ@@._V1_.jpg",
    "keywords": "ireland",
    "name": "Omagh",
    "original_info": {
        "id": "Omagh_2004",
        "name": "Omagh",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2009-11-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0408056/"
        },
        "name": "Impacting initially but the material needed to be tighter to provide a stronger structure",
        "reviewBody": "I imagine that for almost everyone in Northern Ireland, the title of this film acts as a plot summary as well because the bombing in 1998 of Northern Irish town Omagh is etched in the mind. The afternoon detonation in a bust market street claimed many, many civilian lives and left many more injured. This film covers the bombing and follows the aftermath through the experiences of Michael Gallagher, who lost his son and headed up the efforts of a civilian group looking for results and enquiries.\n\nBy the very nature of the story the film starts very strong. The scenes where the crowds are moved away from the wrong area, essentially into the blast area sickeningly tense because we know what is coming. Indeed the immediate aftermath and the hunt for news is almost very moving and it reminded me instantly of how I felt when I heard the news of the attack. With this peak so early, the film has to work to keep things from feeling like they dip. Sadly, it doesn't manage it and the rest of the film doesn't engage as it should, nor does it inform or move. It is a shame but it is a bit messy in the telling – reflecting the sort of ongoing, lack of resolution that many murders have down the decades in Northern Ireland. The conclusion rests heavily on the police enquiry and, as such, it makes the film feel like it is putting the majority of the blame on the police rather than the terrorists who planted the bomb. This is not the case, but it is easy to see it that way with the second half of the film and the way it chooses to conclude as a story. This hurts it – not in terms of balance (although that is an issue) but just because it is part of the film not really having a handle on what it is doing once the aftermath moves from the immediate to the longer term.\n\nThe cast are hard to fault though and certainly McSorley does great work in the lead. He captures the unassuming Ulsterman character well – someone recognisable as being one of the sort of people we have in this country (we have countless others but his character reminded me of several relatives). He emotes really well and it is just a shame the film did not use his character better than it did. The rest of the cast are secondary to him but mostly are solid and convincing. The direction is good but it is the writing where it falls down to the point where it can't recover. It doesn't really flow and the structure is part of the problem.\n\nOverall this is a film with an impacting opening 40 minutes, that easily moves and angers in the way the events themselves did. However as a film it doesn't seem to have a tight focus on where to go from there and as a result the story is messy and unclear, leaving the viewer with a memory of emotion amid the collection of scenes that follow. Can't fault the intent but the delivery is lacking."
    },
    "url": "/title/tt0408056/"
}