{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve McQueen",
            "url": "/name/nm0000537/"
        },
        {
            "@type": "Person",
            "name": "Dave Aldana",
            "url": "/name/nm6769790/"
        },
        {
            "@type": "Person",
            "name": "Mark Brelsford",
            "url": "/name/nm10451787/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1462,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0119024/"
        }
    ],
    "datePublished": "1971-07-28",
    "description": "Documentary on motorcycle racing featuring stars of the sport, including film star Steve McQueen, a racer in his own right.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Brown",
            "url": "/name/nm0113164/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Documentary",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkxODMxNTM3MF5BMl5BanBnXkFtZTgwNjQ0Njg4MDE@._V1_.jpg",
    "keywords": "motorsports sport,extreme sport,motorcycle,motorcycle racing,three word title",
    "name": "On Any Sunday",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Trisub1960"
        },
        "dateCreated": "2004-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067527/"
        },
        "name": "Times do & don't change.",
        "reviewBody": "I saw this movie at 10 years old at a drive-in and I loved it. Bicycles, and especially motorcycles give you that RUSH and that free feeling; the wind on your face, surroundings flying past you. It's an activity that's almost always fun. \"On Any Sunday\" shows better than any other documentary what this past-time, and sport, is really like. It was almost 33 years since I last saw this movie and when my brother rented it, I remembered most of the words in that song that plays throughout the movie. I've had my misfortunes on bicycles/motorcycles, but I still ride occasionally, though quite less tempting of fate than I used to. This movie gives a lot of valuable information on the goods and possible bads of cycling. I like what that other comment writer, Adam, said about this movie, it was a time when most of us could do dangerous stuff on our bikes, but not the EXTREME stuff of now. People may have better equipment on their cycles nowadays, but I'd say the amount of fun is identical."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Mention the name Bruce Brown in any crowd and someone will reply: He is the reason I ride. \r\n\r\nFeaturing Steve McQueen with music by the famed Dominick Fronteirie, this is without a doubt the quintessential motorcycle film, now digitally re-mastered and loaded with never-before-seen extras.\r\n\r\nAcademy Award® nominated Bruce Brown highlighted this intoxicating race world filled with rugged road riders and the grueling excitement of muddy and murderous motocross, daring dune riding, slicing the ice and the tortuous mayhem of the Baja 1000. \r\n\r\nThe grandfather of motorcycle sport filmmaking now greets a new breed of sport riders and filmmakers, which include sons Dana and Wade, and grandson Wes with partner T.J. Barrack - all of whom had a hand in the Bonus Features for this incredible new DVD set. Wherever a reason, whatever the season, Bruce and his friends for decades, with familiar names like Malcolm and Mert, along with the new breed of riders, taking the sport to the extreme, can conjure up stories and tales of how they almost made it, jumped it, ate it, killed it or trashed it on practically every Sunday.",
        "duration": "PT2M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3550216729",
        "name": "On Any Sunday",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTMwNjUyMTkwMV5BMl5BanBnXkFtZTcwODIyOTg1Mg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTMwNjUyMTkwMV5BMl5BanBnXkFtZTcwODIyOTg1Mg@@._V1_.jpg",
        "uploadDate": "2009-05-23T08:33:59Z",
        "url": "https://www.imdb.com/video/vi3550216729/"
    },
    "url": "/title/tt0067527/"
}