{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbra Streisand",
            "url": "/name/nm0000659/"
        },
        {
            "@type": "Person",
            "name": "Yves Montand",
            "url": "/name/nm0598971/"
        },
        {
            "@type": "Person",
            "name": "Bob Newhart",
            "url": "/name/nm0627878/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4044,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Alan Jay Lerner",
            "url": "/name/nm0503585/"
        }
    ],
    "datePublished": "1970-06-17",
    "description": "A troubled young woman who visits a psychotherapist to help her quit smoking undergoes hypnosis and finds herself reliving a tragic Victorian romance from a past life.",
    "director": [
        {
            "@type": "Person",
            "name": "Vincente Minnelli",
            "url": "/name/nm0591486/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzdmZTE5NWItOGZiZi00OGE5LThiYTMtMDgyNjI5MDAyNDAyXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "lincoln center for the performing arts,cigarette,based on broadway musical,1810s,doctor",
    "name": "On a Clear Day You Can See Forever",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2021-03-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066181/"
        },
        "name": "Kind of fun...and kind of dumb as well.",
        "reviewBody": "After starring in \"Funny Girl\" and winning the Oscar for Best Actress, Barbra Streisand was on top of the movie world. However, in hindsight you wonder how such a talented lady would choose \"On a Clear Day\". Didn't she deserve better? Didn't she know that the script was, to put it nicely, a bit dopey? Regardless, the film was a clear step back for the singer/actress.\n\nThe story is about a kooky lady and her apparent past life back in early 19th century England. The story begins with Daisy (Streisand) going to college and taking tons of different classes and lectures. In one of them, the professor is demonstrating hypnosis...when Daisy, in the audience, becomes hypnotized! But her hypnosis turns out to be really strange, as it's a past life regression and much of the story bounces between the present and Regency Britain. And, in the process of learning more about herself, Daisy starts to realize her life with her uptight boyfriend isn't so hot...and the Professor (Yves Montand) is\n\nFirst, there is much to like. Streisand's kooky performance is a bit endearing and the music was really lovely...which you'd expect. As far as what I didn't like is that the film is clearly personality driven...to the point where you wish they'd focus LESS on how absolutely magnificent Streisand's alternate personality is. It was really obvious when it came to the costuming, where EVERYONE in Regency Britain is dressed for the period but Streisand clearly is not....and wears modern fashions which seem completely out of place and silly. Overall, a modestly enjoyable vanity project that is enjoyable to watch and utterly silly at the same time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0066181/"
}