{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        },
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        },
        {
            "@type": "Person",
            "name": "Joan Chen",
            "url": "/name/nm0001040/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 24521,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042267/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Ed Horowitz",
            "url": "/name/nm0395288/"
        },
        {
            "@type": "Person",
            "name": "Robin U. Russin",
            "url": "/name/nm0751547/"
        }
    ],
    "datePublished": "1994-02-18",
    "description": "A mystical martial artist/environmental Agent takes on a ruthless oil corporation.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzA1OGZiMjktYTA5YS00NmYzLTg2YWUtYTE0ZTg2YTE4MWI0XkEyXkFqcGdeQXVyMjU0NDExNDg@._V1_.jpg",
    "keywords": "snow adventure,oil,environmental,murder,tribe",
    "name": "On Deadly Ground",
    "original_info": {
        "id": "On Deadly Ground_1994",
        "name": "On Deadly Ground",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "barnabyrudge"
        },
        "dateCreated": "2004-10-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110725/"
        },
        "name": "Nice to see an action movie with a new locale and a few new angles, but a shame that on the whole the film is pretty inept.",
        "reviewBody": "What drew me to On Deadly Ground was that it had a few new ideas in its locker that I hadn't come across in many other action movies. The setting was Alaska, which sounded intriguing. The action was backed up by an environmental message, which also sounded intriguing. The hero was played by a wooden martial arts \"actor\", while the villain was played by a prolific, Oscar-winning superstar, which sounded like an irresistible pairing (just for the novelty value of seeing them on screen together). Add to that the fact that the music was by Basil Poledouris (whose scores for Conan the Barbarian and The Hunt For Red October are all-time great pieces of film music). On Deadly Ground seemed to have the promise and the potential to be something pretty interesting. Alas, the film fulfils very little of its potential. It's a particularly inept action flick.\n\nTroubleshooter Forrest Taft (Steven Seagal) works for an oil company in Alaska fronted by the unpleasant Michael Jennings (Michael Caine, not in his worst ever film but certainly providing his worst ever performance). Taft gradually begins to realize that the company he works for is responsible for appalling environmental damage, but he can't get them to approach their business with a more environmentally-friendly outlook.... so he does the next best thing - he kicks some butt! Taft goes on a worthy crusade against his callous, single-minded bosses. Hired mercenaries are brought in to stop him, but Taft either evades or kills them in the Alaskan wilderness, and ruthlessly closes in on Jennings.\n\nSeagal made a major mistake in directing the film himself. He lacks fluency as a director and has little grasp of how to link scenes correctly. Nor does he seem capable of coaxing decent performances from his surprisingly good cast. The film stumbles with near-random carelessness from one badly-acted scene to the next, diverting occasionally for the odd expensive-but-totally-soulless set piece. There are flashes of pretty cinematography, and in parts the action is crisply and competently choreographed, but generally the film is a disappointment. After the roasting that it received, Seagal's box office appeal took a permanent dip and Michael Caine stopped prostituting his talents in every film that was offered to him and actually started looking for scripts worthy of his ability.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2912813337",
        "name": "On Deadly Ground",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWJhZDNiMmQtMmFiNS00Yzg5LTg5ZmMtOGQ1ZGY0MjNjZmYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWJhZDNiMmQtMmFiNS00Yzg5LTg5ZmMtOGQ1ZGY0MjNjZmYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:31:44Z",
        "url": "https://www.imdb.com/video/vi2912813337/"
    },
    "url": "/title/tt0110725/"
}