{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Katharine Hepburn",
            "url": "/name/nm0000031/"
        },
        {
            "@type": "Person",
            "name": "Henry Fonda",
            "url": "/name/nm0000020/"
        },
        {
            "@type": "Person",
            "name": "Jane Fonda",
            "url": "/name/nm0000404/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32764,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059553/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103220/"
        },
        {
            "@type": "Person",
            "name": "Ernest Thompson",
            "url": "/name/nm0860125/"
        }
    ],
    "datePublished": "1982-02-12",
    "description": "Norman is a curmudgeon with an estranged relationship with his daughter Chelsea. At Golden Pond, he and his wife nevertheless agree to care for Billy, the son of Chelsea's new boyfriend, and a most unexpected relationship blooms.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Rydell",
            "url": "/name/nm0041932/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDhhMWU5YjYtNDM5OC00NDk2LThjYzEtN2FiNTAxMmZlOTFjXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "motherhood,teenage boy,1980s,nostalgia,character appears in newspaper",
    "name": "On Golden Pond",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbrumburgh-1"
        },
        "dateCreated": "2002-03-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082846/"
        },
        "name": "Warm, reflective, touchingly basic human drama, with Henry Fonda and Katharine Hepburn offering treasured performances in their twilight years.",
        "reviewBody": "\"On Golden Pond\" is simply an old-fashioned testimonial to long-lost youth and facing one's mortality, and, in its simplicity, becomes a life-affirming valentine to those who feel that time has become the enemy - a seemingly ageless, universal perception. If not for the magnificent acting duet between Henry Fonda and Katharine Hepburn, this lovely, sentient piece would have been ignored by most moviegoers. But buoyed by these two acting legends, it manages to circumnavigate the heavy, mawkish waters -- rising far above and beyond anybody's expectation. Earning a whopping ten Oscar nominations, Ernest Thompson's reflective screenplay won one of those Oscars, but, for me, it's Dave Grusin's soothing, glistening score that is the stronger selling point here, adding immeasurably to the film's ruminative tone and gently rustic surroundings.\n\nHenry Fonda plays brusque, cantankerous Norman Thayer, a one-time college professor approaching his 80th birthday with a mixture of anger, cynicism and fear as he shows signs of losing his faculties. Norman is not a particularly kind or considerate gent. Abrupt, callous, remote, and ill-equipped to offer nurturing support of any kind, living with Norman must have been quite an ordeal for those growing up under his roof. As a means of self-preservation, their only child, Chelsea, has long estranged herself from the family, unable to emotionally come to terms with her unhappy, unhealthy relationship with her father.\n\nFonda offers the most affecting, endearing performance of his durable career. He manages to use Norman's undesirable traits to his advantage, investing in his character a gruff charm and cynical sense of humor that is totally winning. He melts away the harmful, negative elements, as Carroll O'Connor managed to do for Archie Bunker, and makes Norman not only funny and entertaining, but loveable. As a result, Fonda becomes the glowing centerpiece of `On Golden Pond,' and it is this portrayal, along with his `Grapes of Wrath' Tom Joad, that will remain indelibly etched in our hearts and minds for decades to come.\n\nKate Hepburn is his Ethel, a loving, pragmatic anchor who obviously has played an important role in the lifetime success of this complicated man. Devoted to a tee, Ethel understands and compensates for the weaknesses of her husband. She valiantly assuages his deepening fears with good-natured kidding, feigned hopelessness, and careful but subtle guidance. She is Dulcinea to his Don Quixote. As a lioness would shield an endangered cub, she has automatically assumed the roles of caregiver, protectorate and confidence booster without pause or grief. Only for Ethel does Norman step out of his shield of emotional armor and display a genuine affection that is lost to others, including himself. Hepburn absolutely radiates with warmth and vitality, providing the film with a necessary center. Though less flashy and substantive, both she and Fonda were Oscared for their work here, with Hepburn winning a record-breaking fourth 'Best Actress' award. Incidentally, this was their ONLY screen pairing, yet they work together as if they've known each other all their lives.\n\nFifteen-year-old Doug McKeon manages to hold his own among the star power here as a young resentful upstart whose dentist father (Dabney Coleman) is romantically involved with Chelsea. Forced to play out the rest of his summer with the old folks while his father and girlfriend spend quality time together, he learns a delicate lesson or two as he develops an unlikely bond with Norman. Coleman himself has one edgy, amusing scene as he tries to gracefully deal with an overly wry Norman.\n\nSurprisingly, the weakest story link involves Norman's strained relationship with daughter Chelsea, played by Hank's own daughter, Jane Fonda (Oscar-nominated). The familial situation obviously parallels their own real-life lack of connection, but the scenes seem strangely shallow and self-serving as they forge through some mucky emotional moments as if striving for real-life closure. What should have been insightful and compelling comes off forced and distracting, particularly on Jane's part.\n\nHenry Fonda's own physical frailty at the time of shooting adds a special poignancy to the film. Ironically, Hepburn won her second Oscar in 1967 for playing another wifely Rock of Gibraltar in `Guess Who's Coming to Dinner?' The ailing Spencer Tracy died shortly after the completion of that film. Fonda would pass away a few months after winning his only Oscar.\n\nA most welcome and satisfying diversion that touches with its unpretentiousness, `On Golden Pond' is a lovely, lovely little film that should resonate for ages to come.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for On Golden Pond",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2694709529",
        "name": "On Golden Pond: Special Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2JhZTJiMmItNzZhOC00ZmFjLWIyMGYtY2U1N2JiOTI2NTRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2JhZTJiMmItNzZhOC00ZmFjLWIyMGYtY2U1N2JiOTI2NTRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:31:47Z",
        "url": "https://www.imdb.com/video/vi2694709529/"
    },
    "url": "/title/tt0082846/"
}