{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paulette Goddard",
            "url": "/name/nm0002104/"
        },
        {
            "@type": "Person",
            "name": "Burgess Meredith",
            "url": "/name/nm0580565/"
        },
        {
            "@type": "Person",
            "name": "James Stewart",
            "url": "/name/nm0000071/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 773,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015826/"
        },
        {
            "@type": "Person",
            "name": "Laurence Stallings",
            "url": "/name/nm0821716/"
        },
        {
            "@type": "Person",
            "name": "Lou Breslow",
            "url": "/name/nm0107756/"
        },
        {
            "@type": "Person",
            "name": "Arch Oboler",
            "url": "/name/nm0643443/"
        }
    ],
    "description": "Three short stories revolving around the topic of the daily question posed by the roving reporter to the readers of a daily newspaper.",
    "director": [
        {
            "@type": "Person",
            "name": "Leslie Fenton",
            "url": "/name/nm0272059/"
        },
        {
            "@type": "Person",
            "name": "King Vidor",
            "url": "/name/nm0896542/"
        },
        {
            "@type": "Person",
            "name": "John Huston",
            "url": "/name/nm0001379/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Comedy",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmU3OWY0NzMtNGQ5ZC00NmE1LTg1N2UtNDQ1ZGQyNzg3ZTM2XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "police officer,based on story,direct address,produced by star,classified ad",
    "name": "On Our Merry Way",
    "original_info": {
        "id": "On Our Merry Way_1948",
        "name": "On Our Merry Way",
        "year": "1948"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nicholas-salerno"
        },
        "dateCreated": "2006-05-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0040664/"
        },
        "name": "Ho-Hum...",
        "reviewBody": "Before I committed to buying the DVD of \"On Our Merry Way,\" I got it from Netflix and happy I am that I did so, for it's not likely I'd ever want to watch it again. \"On Our Merry Way\" is an anthology film in the manner of \"O. Henry's Full House,\" but while the latter has a no-nonsense framework with John Steinbeck introducing the episodes, \"On Our Merry Way\" uses the gimmick of Burgess Meredith talking directly to the camera every so often. It doesn't work; it seems more like a vanity project for Meredith and his then wife Paulette Goddard.\n\nNor do the stories work. They are shaggy dog stories that bore you long before they reach a conclusion. The Henry Fonda-James Stewart and Fred MacMurray-William Demarest episodes are simply not funny. \"On Our Merry Way\" is full of overacting (especially from Carl \"Alfalfa\" Switzer) and shtick (from Victor Moore and Hugh Herbert). Dorothy Lamour, on the other hand,comes off extremely well both as an addle-pated secretary and then with a song that satirizes her own career; for Lamour it's a triumph over inferior material.\n\nJohn O'Hara is credited for one of the stories, O. Henry is not, even though his \"The Ransom of Red Chief\" serves as the basis for the MacMurray-Demarest episode; for comparison, watch the Fred Allen-Oscar Levant take on the same story in \"O. Henry's Full House.\" It's only minimally better but it moves faster.\n\nIt's inconceivable to me that so many great directors, credited or un-, would produce such a mess.\n\nOne can't help be grateful to Kino for clearing the copyright problems which had long kept the film in limbo; after all, we do want to preserve the work of our great stars, no matter how bad. But once our curiosity is satisfied, \"On Our Merry Way\" becomes a shelve-it-and-forget-it film.\n\nFor a much better pairing of Meredith and Goddard, I'd recommend Jean Renoir's English-language version of \"The Diary of a Chambermaid.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0040664/"
}