{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marlon Brando",
            "url": "/name/nm0000008/"
        },
        {
            "@type": "Person",
            "name": "Karl Malden",
            "url": "/name/nm0001500/"
        },
        {
            "@type": "Person",
            "name": "Lee J. Cobb",
            "url": "/name/nm0002011/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 157614,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0218910/"
        },
        {
            "@type": "Person",
            "name": "Budd Schulberg",
            "url": "/name/nm0775977/"
        },
        {
            "@type": "Person",
            "name": "Malcolm Johnson",
            "url": "/name/nm0425711/"
        },
        {
            "@type": "Person",
            "name": "Robert Siodmak",
            "url": "/name/nm0802563/"
        }
    ],
    "datePublished": "1954-06-22",
    "description": "An ex-prize fighter turned New Jersey longshoreman struggles to stand up to his corrupt union bosses, including his older brother, as he starts to connect with the grieving sister of one of the syndicate's victims.",
    "director": [
        {
            "@type": "Person",
            "name": "Elia Kazan",
            "url": "/name/nm0001415/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2I0MWFiZDMtNWQyYy00Njk5LTk3MDktZjZjNTNmZmVkYjkxXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "murder,longshoreman,waterfront,ex boxer,dockworker",
    "name": "On the Waterfront",
    "original_info": {
        "id": "On the Waterfront_1954",
        "name": "On the Waterfront",
        "year": "1954"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CihanVercan"
        },
        "dateCreated": "2008-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0047296/"
        },
        "name": "More and more, the Rolled-out Dough will crook the Rolling Pin",
        "reviewBody": "Terry lives in the shadow of his smart brother Charley the Gent working for a double-handed businessman of the underworld. He had his best times of his life during his boxing career, and has brought his dimes in for his brother. Charley's boss named Johnny Friendly is the man who is behind Terry's fame, but he is also the same man who nibbled his dimes from boxing.\n\nThe curtain opens with Terry working for Johnny Friendly to be participated in a murder. He does his duty and the murder takes effect. The victim was a labor, whose labor leader also works for Johhny Friendly. Terry turns gloomy when he finds out that the victim has been only seeking his rights when he became a rebel. Especially when Terry meets with the victim's sister his suspects grew. She reasons with him that there are two opposite sides: Johnny Friendly's rich and still-growing syndicate versus the dependent and needy workers who are driven into Johnny Friendly's punitive sanctions. Provided that Terry finds a third side: His own.\n\nA run of the mill plot of the mid-20th century. Everybody is pretty much familiar with labor union issues. Mainly the subject gives nothing more than workers seeking out their rights. However, consider that it's Elia Kazan who ushers a new era of actors who rage the whole scenes and turn out heroes out of bums. On the Waterfront has surely inspired millions. For instance, in Robert De Niro's \"Raging Bull\", a prize-fighter like Terry Malloy turns out to be a stage actor and affirms Terry's speech of reproach to his brother, where no other words could describe his situation he fell into.\n\nMarlon Brando's can-do attitude created an inspirational movement, imprinting our memory, that \"If Terry Malloy can do this, yes; I can do this, and yes; everybody can do this\". Subsequently movie makers began to deliver efforts and accomplishments to the silver screen in order to catch viewers' appreciations. On The Waterfront, Elia Kazan and Marlon Brando are those to remember together in the motion picture history.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three Reasons Criterion Trailer for On the Waterfront",
        "duration": "PT1M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1817421337",
        "name": "On the Waterfront: The Criterion Collection",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzQ4ODRkNTMtNWRhMC00NjhhLTlhZTMtYzFjZmI2YzZlNmZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzQ4ODRkNTMtNWRhMC00NjhhLTlhZTMtYzFjZmI2YzZlNmZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-06-07T04:22:11Z",
        "url": "https://www.imdb.com/video/vi1817421337/"
    },
    "url": "/title/tt0047296/"
}