{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred Williamson",
            "url": "/name/nm0004365/"
        },
        {
            "@type": "Person",
            "name": "Gary Busey",
            "url": "/name/nm0000997/"
        },
        {
            "@type": "Person",
            "name": "Bernie Casey",
            "url": "/name/nm0143378/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 204,
        "ratingValue": 4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0119398/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022155/"
        },
        {
            "@type": "Person",
            "name": "Linda Williamson",
            "url": "/name/nm0932087/"
        }
    ],
    "datePublished": "2002-10-01",
    "description": "When a young basketball player entangles himself with drug dealers, he turns to an ex-cop and former private eye. Starring screen icons Ice-T, Gary Busey, Fred Williamson and Jim Brown.",
    "director": [
        {
            "@type": "Person",
            "name": "Fred Williamson",
            "url": "/name/nm0004365/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYwNzAyMjgyMV5BMl5BanBnXkFtZTgwMDQwOTkwMzE@._V1_.jpg",
    "keywords": "drugs,drug dealer,goon,ex cop,basketball",
    "name": "On the Edge",
    "original_info": {
        "id": "On the Edge_2002",
        "name": "On the Edge",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dolemite72"
        },
        "dateCreated": "2004-11-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0381469/"
        },
        "name": "Same old, same old.....",
        "reviewBody": "Just as ORIGINAL GANGSTERS (six or so years earlier) FRED WILLIAMSON tries to kick start the whole BLAXPLOITATION genre, with this well meaning (but lackluster) effort. WILLIAMS stars as 'Dakota Smith' (great name!) all-round good guy (ex-cop) do-gooder, who agrees to help a would-be basketball star, who's in trouble with shady drug dealers (played none other by ICE T, in what must have been his 43rd movie that year) First the dealers kill the wrong family (that turns out to be BERNIE CASEY's) and then the basketball players dad (RON O'NEIL T.N.T) all get together (plus a cameo by JIM BROWN) to take on the dealers (and a gang of 'crooked cops'(tm)) WILLIAMSON, who also directs under his (not-so) legendary PO'BOY production company, hasn't really come on much as a director since the seventies. This wouldn't be a bad thing, but there's only so many times you can watch inept gunmen (led by a spaced out GARY BUSEY!) miss easy (and slow moving) targets, such as our geriatric heroes, before the whole thing becomes laughable. Plus the main reason that genuine 'blaxploitation' works so well, is as a time-capsule, in 2002, however, with roaming gang banging killers everywhere, it seems a lot harder to buy into this 70's macho image in modern times. On a plus side, B-movie fans (like myself) will be in heaven, and the movie has a goodish soundtrack (and it's nowhere near as abysmal as recent ICE T/ALBERT PYUN sh*t-feasts) But the good soundtrack, sometimes drowns out a poor audio track (plus the music stops and starts whenever it pleases, this adds to the overall cheesiness of the picture)\n\nAll in all, it's a pretty good B-movie, but it'll do little to bring back the good old days of 'too-black-too-strong' style of film-making. Maybe WILLIAMSON should stay in front of the camera (he had a pretty good role in STARSKY AND HUTCH recently)\n\nA must-see (if only once) for fans of the genre, but HELL UP IN HARLEM, COFFY, TRUCK TURNER, SUPERFLY it isn't \n\n6 out of 10"
    },
    "url": "/title/tt0381469/"
}