{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Carlyle",
            "url": "/name/nm0001015/"
        },
        {
            "@type": "Person",
            "name": "Rhys Ifans",
            "url": "/name/nm0406975/"
        },
        {
            "@type": "Person",
            "name": "Kathy Burke",
            "url": "/name/nm0121755/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4587,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002948/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104092/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057092/"
        },
        {
            "@type": "Person",
            "name": "Paul Fraser",
            "url": "/name/nm0292211/"
        },
        {
            "@type": "Person",
            "name": "Shane Meadows",
            "url": "/name/nm0276349/"
        }
    ],
    "datePublished": "2002-09-06",
    "description": "After seeing his ex-girlfriend (Henderson) turn down a nationally televised marriage proposal, a small-time crook (Carlyle) returns to his hometown to try and win back her heart.",
    "director": [
        {
            "@type": "Person",
            "name": "Shane Meadows",
            "url": "/name/nm0276349/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU2ODkzOTExOV5BMl5BanBnXkFtZTYwMzk0NTk2._V1_.jpg",
    "keywords": "vandalism,underwear,teenage girl,panties,love triangle",
    "name": "Once Upon a Time in the Midlands",
    "original_info": {
        "id": "Once Upon a Time in the Midlands_2002",
        "name": "Once Upon a Time in the Midlands",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dannyell"
        },
        "dateCreated": "2002-09-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0301684/"
        },
        "name": "a curate's egg from a national treasure",
        "reviewBody": "Respect is definitely due to Mr Meadows. He has made films about Britain that qualify as top notch cinema. He is a true artist - he portrays conflict both within and between people with his own style and bizarreness. He is making films about the people that fill British streets but do not on the whole have their own biographical art. His insistent use of everyday public and private space (the yellow brick semi, the grubby flat, the suburban street, the dilapidated bunch of in-town shops) gives his films a hyper-realistic, hallucinatory quality, like memories of childhood made flesh again.\n\nThe kaleidoscope of humour that dazzles the viewer of `A Room For Romeo Brass' or the first half of `Once upon a time.' is a gorgeous normality - a concentrated sniff of the glue that keeps working people and families together. These films know that this humour is an art form - akin to any other kind of oral culture through history, its purpose is to give its user's lives meaning, be it while fighting predators, invaders or the daily grind.\n\nMeadows' plots are more overtly psycho-political than socio-political: the evil and darkness in his film comes from the past, from childhood. The families affected by that darkness tend to be the source of light and laughter which combats the darkness. Parents on-screen are loving and nurturing - it is orphans, or offspring of violent parents that bring this darkness from their off-screen histories to the films. This is where the dramatic power comes from - when Morrel in `Romeo Brass' alludes enigmatically to his violent father, our imaginations are left to their own devices. Similarly, though with less dramatic import, we are informed briefly in `once upon a time' that Jimmy is Carol's foster brother, and again we get that sense of how a fractured childhood creates a damaged adult.\n\nUnfortunately Meadows cannot keep the dramatic quality up in `once upon a time' in the same way that he did to such devastating effect in `24-7' and `Romeo Brass'. The cowboy conceit that is one of the strands of amusement and pleasure in the film's first half gets strangely discarded just as it might be most effective - when Dek the cowardly geek finds his manhood. It is replaced by a strangely witless and conformist soap opera seriousness as the two dads tussle for one family. The surrealist streaks are still there (for instance Jimmy's penchant for haircuts, which I'm sure says a lot about his character) but the overall feel is that Meadows and his co-writer Paul Fraser repressed what had previously made the characters interesting in a kind of commercial dumbing-down attempt. `If Eastenders can get 19 million people watching it 3 times a week', they seem to have reasoned, `Then surely we can get some of that Ganesh magic to rub off on us'.\n\n In the light of public indifference to Meadows' previous two glorious films, though, you have to be sympathetic to this. And it's worth watching for the first two thirds, some lovely acting (particularly by Rhys Ifans) and a kind of existential glow that I seem to get from Meadows' films and which makes him a top director in my book."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2712535321",
        "name": "Once Upon A Time In The Midlands",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzRjNDgxODAtZTU5Yy00OTA0LTk5ZWEtNjNjZGVhMmQ0MjdjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzRjNDgxODAtZTU5Yy00OTA0LTk5ZWEtNjNjZGVhMmQ0MjdjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:32:10Z",
        "url": "https://www.imdb.com/video/vi2712535321/"
    },
    "url": "/title/tt0301684/"
}