{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leonardo DiCaprio",
            "url": "/name/nm0000138/"
        },
        {
            "@type": "Person",
            "name": "Brad Pitt",
            "url": "/name/nm0000093/"
        },
        {
            "@type": "Person",
            "name": "Margot Robbie",
            "url": "/name/nm3053338/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 766535,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "alternateName": "Once Upon a Time in Hollywood",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0452101/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0159772/"
        },
        {
            "@type": "Person",
            "name": "Quentin Tarantino",
            "url": "/name/nm0000233/"
        }
    ],
    "datePublished": "2019-07-26",
    "description": "A faded television actor and his stunt double strive to achieve fame and success in the final years of Hollywood's Golden Age in 1969 Los Angeles.",
    "director": [
        {
            "@type": "Person",
            "name": "Quentin Tarantino",
            "url": "/name/nm0000233/"
        }
    ],
    "duration": "PT2H41M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTg4ZTNkZmUtMzNlZi00YmFjLTk1MmUtNWQwNTM0YjcyNTNkXkEyXkFqcGdeQXVyNjg2NjQwMDQ@._V1_.jpg",
    "keywords": "manson murders,place in title,1960s,violence,film within a film",
    "name": "Once Upon a Time in... Hollywood",
    "original_info": {
        "id": "Once Upon a Time in China_1991",
        "name": "Once Upon a Time in China",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheMovieDiorama"
        },
        "dateCreated": "2019-08-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt7131622/"
        },
        "name": "Once Upon A Time In Hollywood forced me to recall that the golden age of filmmaking was never this tedious.",
        "reviewBody": "Not even Tarantino with his blood-soaked trademark violence can save this year from mediocrity. It's abundantly clear that his ninth film is a passion project, his love letter to 60s Los Angeles when it was deemed cool for the hippie lifestyle to integrate with mainstream America. It's substantially glossy, kaleidoscopic, heck some may even describe this three hour long \"epic\" as, well, epic. The only thing epic about this behemoth is Dalton's beastly flamethrower as he incinerates a group of Nazis. This is, without a doubt in my mind, Tarantino's weakest film to date and another sign of his progressive downfall in quality. An ageing television actor, his swooning stunt double and actress Sharon Tate navigate the alterations of the Hollywood film industry, with the Manson \"Family\" providing a suitably bleak backdrop.\n\nTechnically, this comedy-drama is good, and I'm not just saying that to ease the scathing hatred that is inevitably flying my way from Tarantino fans. His directorial efforts were effortless. Managing to sustain multiple storylines with a wide array of cameos from his ensemble cast and allowing the lead actors to chew the scenery til it's just mulch. A tribute to the art of filmmaking whilst also providing insight in an actor's mind during vast changes within the industry that made him famous. Tarantino's foot fetish aside, his ability to swoop the camera from high octane tracking shots following a horse to sub-urban houses in Hollywood hills (mostly comprising of single takes) is unprecedented. Even with a simple conversational piece, much like when Dalton meets Fraser for the first time and talks about the novel he's reading and resembling, it's executed with such confidence that it immediately entrances you. Overextended and laborious? Absolutely. Yet witnessing Dalton come to terms with his acting talent, alongside the beautiful creature that is Olyphant playing James Stacy, is oddly engrossing.\n\nOf course, only possible due to DiCaprio's electric performance. Purposefully overacting, consistently shouting and harnessing the only developed arc out of all the characters Tarantino shoves into the film. His comedic timing, reminiscent of his venture in Scorsese's 'The Wolf of Wall Street', is impressive and allows a handful of laughs to sneak in, particularly when on the set of 'Lancer'. These characters all residing in a well-designed, precisely replicated and exuberant city that encapsulated the culture at the time. The production was immaculate, accompanied by a signature soundtrack that oozes sophistication and provides a mixtape for golden rock'n'roll.\n\nSo, like I mentioned, technically this is a very proficient film. Which begs the question \"why was I underwhelmed?\". Well, that's because nothing happens. A near three-hour collage of Cliff Booth driving across Los Angeles, Sharon Tate watching her own film and the Manson \"Family\" walking bare feet on lukewarm sand. It's so self-indulgent with no actual substance that it borders on being pretentious. The multiple storylines rarely mesh. Booth is the exact same character from start to finish and is only present to beat the smack down out of Bruce Lee. Tate has no purpose to the over arcing story whatsoever and diminishes the talent of Robbie who has considerably limited screen time. The entire Manson backdrop is utterly futile in terms of placement, that it seems incredibly forced during the last act (although ridiculously fantastic to watch) just so Tarantino can address the cult's motives. The length that various scenes last for was enough to send anyone to sleep, mostly due to the restrained writing from Tarantino that lacks the punch from his previous efforts. An unaccomplished conclusion that left me questioning the entire purpose of the film. Aside from Dalton being introduced to his neighbours, the start of the story is the exact same as the ending. No one has any development! When Tarantino alludes to something happening, like Booth investigating Spahn Ranch, he deviates and sets the pace back to pedestrian mode. Simply a mish-mash of cameos so that everyone working in Hollywood today can claim they were part of a Tarantino feature.\n\nFor a film that is designed to be a homage to the golden age of Hollywood, there is a distinct lack of gold to be found in this bejewelled ensemble presentation. Whilst technically proficient and wonderfully acted, the absence of substance and genuine character development makes a three-hour affair feel more like a five hour ordeal. And it pains me to say that, as I wanted Tarantino to be the saving grace of this lacklustre year.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1385741849",
        "name": "Watch Now on STARZ",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTQxODQzMGUtZTA0ZS00Y2NlLTljZjAtYzNlNzUxZjBjZmY4XkEyXkFqcGdeQXZ3ZXNsZXk@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTQxODQzMGUtZTA0ZS00Y2NlLTljZjAtYzNlNzUxZjBjZmY4XkEyXkFqcGdeQXZ3ZXNsZXk@._V1_.jpg",
        "uploadDate": "2020-03-24T23:11:08.115Z",
        "url": "https://www.imdb.com/video/vi1385741849/"
    },
    "url": "/title/tt7131622/"
}