{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "James Woods",
            "url": "/name/nm0000249/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth McGovern",
            "url": "/name/nm0001527/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 357544,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042559/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035468/"
        },
        {
            "@type": "Person",
            "name": "Harry Grey",
            "url": "/name/nm0340580/"
        },
        {
            "@type": "Person",
            "name": "Leonardo Benvenuti",
            "url": "/name/nm0073053/"
        },
        {
            "@type": "Person",
            "name": "Piero De Bernardi",
            "url": "/name/nm0207401/"
        }
    ],
    "datePublished": "1984-06-01",
    "description": "A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan 35 years later, where he must once again confront the ghosts and regrets of his old life.",
    "director": [
        {
            "@type": "Person",
            "name": "Sergio Leone",
            "url": "/name/nm0001466/"
        }
    ],
    "duration": "PT3H49M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGFkNWI4MTMtNGQ0OC00MWVmLTk3MTktOGYxN2Y2YWVkZWE2XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "gangster,prohibition,1920s,rape,flashback",
    "name": "Once Upon a Time in America",
    "original_info": {
        "id": "Once Upon a Time in America_1984",
        "name": "Once Upon a Time in America",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jeanpaul-3"
        },
        "dateCreated": "1999-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087843/"
        },
        "name": "Mesmerizing and haunting tale of love, greed, regret, betrayal and revenge",
        "reviewBody": "This is, for me, one of the finest examples of cinematic art. It isn't a simple, cut-n-dried 90 minute little package that gets wrapped up with a pretty bow at the end. You get pulled in by the enigmatic opening that unwinds the threads of the story to be found later. For many people having half an hour of purely visual story telling, of stories that are only mysteries at that point, before anything becomes truly linear is difficult to follow and discourages to many people. Our own memories are only snippets that only become linear as we concentrate on scenes from our lives. Once Upon a Time in America is like that as we follow Noodles through the `significant' part of his life - the times that formed him. When the story actually starts, we meet the girl that he always loved but could never have.\n\nDavid `Noodles' Aaronson (DeNiro) was a kid on the very mean streets of Brooklyn when organized crime was born in America and he grew into and out of it. That's the simplest synopsis of the plot. The reality is that this isn't a movie about gangsters. Being a gangster is the easiest way for Noodles to survive and get ahead, but it also alienates and ruins his one love. Whenever he is close to giving himself to Deborah he always gets pulled back into the gang, in some form or another.\n\nDeNiro's portrayal is of a gangster, through and through, who also has a conscience that, while not preventing him from being a ruthless killer, rules his life with regret, remorse and guilt. Leone takes a bit of poet/historic license by showing the Brooklyn Bridge being built in the background (the bridge had been built 40 years before), but it symbolizes Noodles' own growth. When the bridge is just pilings and incomplete towers, Noodles is just forming his future. By the time the bridge is complete, Noodles is nothing but a gangster and the bridge is majestic. When he returns 35 years later our view of the bridge is from under a freeway -- the world has moved along, but the bridge and Noodles are just as they were.\n\nThe length: If you're looking for a brief distraction that you'll barely remember 30 minutes later, this isn't the movie for you. However, if you are prepared and able to be undistributed for the nearly 4 hours that this film uses to compress a lifetime -- you will be rewarded with many facets of thought and examination."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 2 for Once Upon A Time In America",
        "duration": "PT2M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2777395225",
        "name": "Once Upon a Time in America",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2FkYzkxNDctNTFhZi00M2Y2LTg1MzUtYTFlMTU2NzVmMmJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2FkYzkxNDctNTFhZi00M2Y2LTg1MzUtYTFlMTU2NzVmMmJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-05-13T04:49:15Z",
        "url": "https://www.imdb.com/video/vi2777395225/"
    },
    "url": "/title/tt0087843/"
}