{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lauren Hutton",
            "url": "/name/nm0001381/"
        },
        {
            "@type": "Person",
            "name": "Jim Carrey",
            "url": "/name/nm0000120/"
        },
        {
            "@type": "Person",
            "name": "Karen Kopins",
            "url": "/name/nm0465789/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15423,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018084/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0016710/"
        },
        {
            "@type": "Person",
            "name": "Dimitri Villard",
            "url": "/name/nm0898001/"
        },
        {
            "@type": "Person",
            "name": "David Hines",
            "url": "/name/nm0385653/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Hause",
            "url": "/name/nm0369492/"
        }
    ],
    "datePublished": "1985-11-15",
    "description": "A vampire Countess needs to drink the blood of a virgin in order to keep her eternal beauty. It seems that all is hopeless, until she bumps into Mark Kendall.",
    "director": [
        {
            "@type": "Person",
            "name": "Howard Storm",
            "url": "/name/nm0832573/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjkxOWQ2MWItNWQ4Zi00MWRjLTkwYWUtYTBmMmYwOTUzZDgyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "vampire,halloween,virgin,drinking blood,femme fatale",
    "name": "Once Bitten",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-02-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089730/"
        },
        "name": "Decent if you're in the mood for a light comedy",
        "reviewBody": "Lauren Hutton is a vampire simply named \"The Countess\" who must bite a virgin three times per year (ending on Halloween) in order to retain her youth and beauty. However, living in California in the mid-1980s, it's becoming impossible to find a virgin.\n\nThis is a horror comedy that's not exactly atmospheric, thrilling or suspenseful (it's also completely free of gore), and not exactly hilarious. Rather, it's just a very lighthearted, mostly enjoyable film that happens to be about vampires, although it's primarily interesting for a one of the earliest, pre-fame appearances of Jim Carrey, and for nostalgia, as Once Bitten is firmly mired in mid-1980s pop culture.\n\nThe biggest flaw is that the mythology behind the film is not very well explained or followed. The Countess finds Mark Kendall (Carrey) fairly easily, but we're not shown her and her clan looking very hard until just before Halloween--they had all year. We're never told if the clan has to follow the same rules. It doesn't seem so in the end, but why not? It's never very clear why The Countess can't just go after, say, an eleven year old. When things are getting down to the wire near the climax of the film, there are other virgins around, but The Countess just ignores them as potential drinking fountains of youth. It seems like maybe she has to bite the same person, rather than three potentially different people, three times, but that's never directly stated. How long does it have to be between bites? Why couldn't she just bite the one person twice, then bite someone else three times within a few hours? \n\nAlthough I don't usually like to try to apply real world logic to films, in this case, I couldn't help it. Once Bitten isn't meant solely as a comedy, and there is a long sequence during the climax that should be as suspenseful as it is humorous. But the suspense was gone, because all I could think of where the questions above instead. To make it worse, the timeline of the film gets a bit muddled, and we lose any sense of when Halloween night is actually occurring. At one point, during a Halloween dance, that seems like that should be Halloween night, but then it seems like Halloween should be over already at a later point. At that later point, it seems like the dance must have been on a different, earlier day. That this crucial fact for suspense in the film isn't clear is a problem. Once Bitten suffers from sloppy scriptwriting and sloppy direction from Howard Storm, whose resume shows that he's much more comfortable with half-hour television sitcoms.\n\nBut if one can overlook some of those flaws, Once Bitten is worth at least one viewing. Carrey's performance is good. He easily shows why he became a star in later films. His transformation over the course of the film is great, and a scene with Carrey in full vampire make-up and clothing makes one long to see a serious vampire film with him as a star. I also liked the ice cream truck and took it as a nod to Phantasm (1979). There are enough comic moments that most viewers will at least be occasionally smiling, if not laughing out loud. A scene where Mark's friends are trying to check him for evidence of vampirism is a standout, as is much of the material where Mark and his friends interact. Carrey's scenes with his parents are even better, but there are too few of them. Both Hutton and Karen Kopins (as Mark's girlfriend, Robin) are sensuous. The Countess' vampire clan is severely underused, but they are okay when they do appear. And even the obligatory mid-80s music video/dance scene is mostly tolerable.\n\nI also enjoyed the subtext that sex is a means of protection from evil, rather than something dangerous to be avoided. Robin's attitude about Mark's relationships was also a nice change of pace.\n\nThis is definitely a film that needs to be approached with lowered expectations, but in the right mood, you just might enjoy it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Once Bitten",
        "duration": "PT1M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi250392857",
        "name": "Once Bitten",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWQ4YWJhOTItNDFhYy00ZDkxLWIwNmMtOWYyZDk5ZjM3OGFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWQ4YWJhOTItNDFhYy00ZDkxLWIwNmMtOWYyZDk5ZjM3OGFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-03-21T04:50:41Z",
        "url": "https://www.imdb.com/video/vi250392857/"
    },
    "url": "/title/tt0089730/"
}