{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Chad Michael Murray",
            "url": "/name/nm0614877/"
        },
        {
            "@type": "Person",
            "name": "James Lafferty",
            "url": "/name/nm0480798/"
        },
        {
            "@type": "Person",
            "name": "Hilarie Burton",
            "url": "/name/nm1122026/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 82726,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005035/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099647/"
        },
        {
            "@type": "Person",
            "name": "Mark Schwahn",
            "url": "/name/nm0777043/"
        }
    ],
    "datePublished": "2003-09-23",
    "description": "Half-brothers Lucas and Nathan Scott trade between kinship and rivalry both on the basketball court and in the hearts of their friends in the small, but not so quiet town of Tree Hill, North Carolina.",
    "genre": [
        "Drama",
        "Romance",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2Y0NzRjOTQtNGNmYS00NjNiLWIwY2MtZWIyZDI5ZDhhZmI1XkEyXkFqcGdeQXVyODIxOTMwMjk@._V1_.jpg",
    "keywords": "male protagonist,basketball sport,domestic drama,teen drama,2010s",
    "name": "One Tree Hill",
    "original_info": {
        "id": "One Tree Hill: Season 1_2003",
        "name": "One Tree Hill: Season 1",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jameslamont"
        },
        "dateCreated": "2005-02-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368530/"
        },
        "name": "A great teenage show that deals with many important issues and moral problems!",
        "reviewBody": "One Tree Hill is Warner Brothers latest effort to emulate the success of its popular 90's teenage show Dawsons Creek and it a very good job overall. This show really will appeal to the teenage audience, and young adults and it is very plot driven to this age range. The show deals with a lot of sensitive issues that teenagers face such as: sex, drugs,marriage, adoption, affairs, conflicts etc.\n\nThe show is set in the fictional town of One Tree Hill and it stars: Chad Michael Murray as honest, likable Lucas Scott, James Laferty as spoilt rich child Nathan Scott, Hillarie Burton as the lonely but good hearted Peyton and Sophia Bush as the feisty but popular Brooke. The actors and actresses cast in these young roles really are the eye candy of the show. They all put in good performances and are totally believable in their roles.\n\nBacking up the cast are a set of adult actors and actresses and these really add another depth to the show. Paul Johansson (Dan Scott) and Moira Kelly (Karen Scott) deserve mentions as they put in great performances as the respective struggling single mother and evil father of the boys. Craig Sheffer (Keith Scott) does a strong performance as Lucas step father and Dan Scotts bother, Barbara Alyn Woods (Deb Scott) makes a good long suffering wife and mother to Dan and Nathan look believable and Barry Cobin does a sturdy performance as Coach Whitey. The adult actors really shine in this show and they help to make the characters interact as well as the children on the show.\n\nUnderneath the shows skin is the running pulse of the conflict between long-lost brothers Nathan and Lucas Scott and that is what the whole show is built on. This show works so well is because it allows the adults as much air time as the teenagers and this lets the viewers care much more about all the characters, not just the teenage ones.\n\nThe characters are nearly all beautiful, teenage girls will droll over the eye candy of Lucas and Nathan and the teenage boys will droll over Brooke and Peyton. But the fact is that these characters are all very well written and it means that the audience identifies and likes each of the characters in their own unique way. They are certainly not two dimensional characters and as the actors and actresses can act means they are believable. \n\nOne Tree Hill is one of the most underrated shows on Television, and this is due to the fact that most people dismiss this show at first hand because they compare it with other teenage shows such as The OC and thats not really fair. This show has some human like quality that makes the show seem down-to-earth and relevant to many people. It does not have the fan base popularity that other teenage shows have, but it nevertheless has a very loyal set of viewers who tune in every week to watch the latest comings and goings on in Tree Hill.\n\nThere are some very good episodes of this show, but some others that aren't so good. But the show always churns out consistently good episodes and this means it is much harder to judge how good the show really is in its genre. If you want to see a good solid teenage drama that deals with real issues, in a human way, this is the show for you. Don't miss it 10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi362742041",
        "name": "One Tree Hill: Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjVmMTMyN2YtNjE1My00YzYzLWI2NWEtZjFhYzE1MWQ0YjAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjVmMTMyN2YtNjE1My00YzYzLWI2NWEtZjFhYzE1MWQ0YjAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:32:51Z",
        "url": "https://www.imdb.com/video/vi362742041/"
    },
    "url": "/title/tt0368530/"
}