{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Meryl Streep",
            "url": "/name/nm0000658/"
        },
        {
            "@type": "Person",
            "name": "Renée Zellweger",
            "url": "/name/nm0000250/"
        },
        {
            "@type": "Person",
            "name": "William Hurt",
            "url": "/name/nm0000458/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12363,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012893/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0183897/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Anna Quindlen",
            "url": "/name/nm0703683/"
        },
        {
            "@type": "Person",
            "name": "Karen Croner",
            "url": "/name/nm0188733/"
        }
    ],
    "datePublished": "1998-09-18",
    "description": "A career woman reassesses her parents' lives after she is forced to care for her cancer-stricken mother.",
    "director": [
        {
            "@type": "Person",
            "name": "Carl Franklin",
            "url": "/name/nm0002083/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGI0NmIwOTUtYzk1NS00ODAzLWFiYzEtY2ViYmVmYmE5MWU1XkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "cancer,female protagonist,melodrama,dysfunctional family,terminal illness",
    "name": "One True Thing",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zerve"
        },
        "dateCreated": "1998-09-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120776/"
        },
        "name": "Is more more?",
        "reviewBody": "Yes, at least in large part to Streep's performance. The more we learn of Kate and her character, the more we love her and her strengths. The same can be said about Ellen, Zellweger's role as daughter who has postponed fast track career to come home to be with Streep as Kate faces crippling and debilitating illness. Their relation ship at movie beginning is strained to say the least. Going into the theater I was mentally prepared for a very deep and emotional roller coaster ride. A slow start with character development was actually to the movie's benefit. In terms of personal growth, the main characters, except for Streep, were not the same people by movies end. We came to learn them as they learned about themselves. Zellweger and Hurt appear one dimensional, both focused on their writing and careers, with daughter idolizing father. Streep the same as a mother content with home making. But as the movie continues to unfold, we get to see all of these characters as real; their strengths and weaknesses both. Ellen's childhood flashback illustrate happy moments of only father at first, but as time goes on, she relives the same flashbacks and notes her mother's subtle, supportive role. All are challenged to assess their lives in the face of certain death of Streep, whose role as matriarch continues to impress as the tale is told. She was the 'light' of the film, as Hurt confesses. The bedroom conversation between mother and daughter is exceptional, when secrets are revealed and the realization that potential dreams are left unfulfilled. I doubt there was a dry eye in the house at this point. Follow that up with the New Year's Eve scene, a funny breath of fresh air at a difficult and emotional part of the movie. The movie was very good with very good performance by Hurt, Streep and Zellweger. I wouldn't call it the movie of the year, but consideration should go to Streep and Zellweger for nominations. Hurt lends his expected strong presence to both roles, and makes both characters all the better. Give it an 8 out of 10."
    },
    "url": "/title/tt0120776/"
}