{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Raquel Welch",
            "url": "/name/nm0000079/"
        },
        {
            "@type": "Person",
            "name": "John Richardson",
            "url": "/name/nm0724623/"
        },
        {
            "@type": "Person",
            "name": "Percy Herbert",
            "url": "/name/nm0378612/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9121,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103175/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060069/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045848/"
        },
        {
            "@type": "Person",
            "name": "Michael Carreras",
            "url": "/name/nm0140257/"
        },
        {
            "@type": "Person",
            "name": "Mickell Novack",
            "url": "/name/nm0636793/"
        },
        {
            "@type": "Person",
            "name": "George Baker",
            "url": "/name/nm1025909/"
        }
    ],
    "datePublished": "1967-02-21",
    "description": "Prehistoric man Tumak is banished from his savage tribe and meets pretty Loana, who belongs to a gentler coastal tribe, but he must fight caveman Payto to win her favors.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Chaffey",
            "url": "/name/nm0149548/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Adventure",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2E1N2Y1NGUtZmEzMS00ZTc2LTk0MzAtMzMwZDI3NTQzYzZkXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_.jpg",
    "keywords": "remake,fur clothing,fur bikini,prehistoric times,caveman",
    "name": "One Million Years B.C.",
    "original_info": {
        "id": "One Million Years B.C._1967",
        "name": "One Million Years B.C.",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mch-24"
        },
        "dateCreated": "2010-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060782/"
        },
        "name": "Cavewomen were stunning apparently.",
        "reviewBody": "One thing that newcomers to Hammer need to appreciate is that many of their films are low-budget, and kitsch, and One Million Years B.C scores high on the cheese-factor even by Hammer's yardstick. The film's tagline is laughably off-target – \"This is the way it was!\" – I am almost positive cavewomen didn't have immaculately coiffured hair, push-up loincloth bras, eyeliner, and waxed legs, while their primitive menfolk did battle with dinosaurs that scientifically speaking died out many millions of years earlier. Needless to say, a willing suspension of disbelief is a prerequisite to enjoyment of this movie.\n\nInappropriate marketing aside, if you can get past these hurdles, B.C is an entertaining, if mindless, action movie, and one which is elevated to ongoing cult status thanks to 2 main factors - Raquel Welch and Ray Harryhausen.\n\nEven if you have never heard of this film, chances are at some point you have been exposed to \"that picture\". Raquel Welch is THE reason this film's cult following is 95% male, and seeing her in her loincloth bikini is quite honestly a sight to behold. Fleeing from giant dinosaurs, and fighting with cavewomen, this role in a low-budget British monster movie is the one that put her on the map and created one of the greatest sex symbols ever to light up the silver screen.\n\nOnly just losing out to Raquel Welch as the star of the show, are the creatures themselves. Animated by the inimitable, legendary Ray Harryhausen (as far as I know the only special effects guru to become a household name in his own right) the creatures are brilliantly realised, and integrated seamlessly with the live-action elements. Aside from Jason and the Argonauts, and Clash of the Titans, this is some of his best work – the Allosaur attack on the shell-people's village being a real technical accomplishment and highlight of the film. The results are slightly marred though by the the integration of real animals, shot and superimposed to look massive. An early attack from a giant, half-asleep looking iguana is hardly menacing, nor is a (thankfully very brief) appearance by a gigantic tarantula that is trying to eat an equally gigantic cricket. These negative moments are forgotten though when Harryhausen's flawless stop-motion takes center stage, bringing us the iconic triceratops fight amongst other great set-pieces.\n\nThanks to the jaw-dropping \"talents\" of Raquel Welch, the rest of the cast are pretty expendable. Even main star John Richardson's character of Tumak could have been played by a monkey in a spacesuit when Welch was on screen, no-one would have noticed. Everyone plays as well as they need to though, given the grunt-riddled, running-away-from-an-imaginary-monster screenplay. The storyline is simplistic, (primitive man learns tolerance and civility) and is basically a thinly veiled cover for a series of awesome action set-pieces and monster vs human battle sequences, and a vehicle for the scantily clad Raquel Welch to run around getting sweaty and dirty, which can only be considered a bonus.\n\nIn summary, leave your brain at the door and you are likely to have a great time. This is a cult classic; a camp, entertaining showcase for Harryhausen's skills, and while shallow, has enough action and sex-appeal to please the average testosterone-laden viewer. Worth watching for Raquel Welch's magnetic presence alone.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this prehistoric romp",
        "duration": "PT3M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi261948953",
        "name": "One Million Years B.C.",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2U0NDhkYjMtZTIxOS00MGUwLThiZjItM2I4YmE5YWNmNjFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2U0NDhkYjMtZTIxOS00MGUwLThiZjItM2I4YmE5YWNmNjFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-07-11T03:22:39Z",
        "url": "https://www.imdb.com/video/vi261948953/"
    },
    "url": "/title/tt0060782/"
}