{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Art Blakey",
            "url": "/name/nm0086845/"
        },
        {
            "@type": "Person",
            "name": "Ron Carter",
            "url": "/name/nm0141909/"
        },
        {
            "@type": "Person",
            "name": "Walter Davis Jr.",
            "url": "/name/nm0204116/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 67,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021734/"
        }
    ],
    "datePublished": "2004-01-27",
    "description": "Considered one of the greatest nights in Jazz history, this film documents the reunion of 30 jazz greats from the Blue Note label filmed at Town Hall in New York City on February 22nd, 1985.",
    "director": [
        {
            "@type": "Person",
            "name": "John Jopson",
            "url": "/name/nm0429779/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTIxMjk4YjctNmNmMy00MzM3LWFjYjgtZWU4ZjM3ZGY0MzUyXkEyXkFqcGdeQXVyMTUxMDI0OTc@._V1_.jpg",
    "name": "One Night with Blue Note",
    "original_info": {
        "id": "One Night With Blue Note_1985",
        "name": "One Night With Blue Note",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DCroese"
        },
        "dateCreated": "2006-03-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0428914/"
        },
        "name": "All Star concert should appeal to a lot of jazz lovers",
        "reviewBody": "Even if you're not really into the typical Blue Note recordings, this concert is worthwhile watching/listening. With a wide range on artists this music offers a lot of different jazz. There is some nice hard bop, like Herbie Hancock, Joe Henderson, Freddie Hubbard, Ron Carter and Tony Williams on Cantaloupe Island and the same line-up (add Bobby Hutcherson) on a swinging Recorda-Me. There's some more advanced bop also, like the superb Woody Shaw/Jackie McLean combination + rhythm section (McCoy Tyner, Cecil McBee and Jack DeJohnette) on Appointment in Ghana. To complete the (earlier) Blue Note success story there's some nice Soul in the spirit of the Kenny Burrell, Jimmy Smith and Stanley Turrentine '60 sessions, and those stars are all included here. Somewhat odd to me is the appearance of Cecil Taylor who finishes this concert with a plus 12 minute solo, though it's decent stuff anyhow. Some nice extra's feature a selection of Francis Wolffs photographs for the label and nice album art work. This DVD should appeal to a lot of jazz fans, since it offers different styles of jazz and on the whole it's superbly played and swinging. It's nice to see that a lot of the artists including here can still swing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0428914/"
}