{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michel Piccoli",
            "url": "/name/nm0681566/"
        },
        {
            "@type": "Person",
            "name": "Marcello Mastroianni",
            "url": "/name/nm0000052/"
        },
        {
            "@type": "Person",
            "name": "Henri Garcin",
            "url": "/name/nm0305488/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1670,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "One Hundred and One Nights",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017285/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029168/"
        },
        {
            "@type": "Person",
            "name": "Agnès Varda",
            "url": "/name/nm0889513/"
        }
    ],
    "datePublished": "1995-01-25",
    "description": "Monsieur Cinema, a hundred years old, lives alone in a large villa. His memories fade away, so he engages a young woman to tell him stories about all the movies ever made.",
    "director": [
        {
            "@type": "Person",
            "name": "Agnès Varda",
            "url": "/name/nm0889513/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy",
        "History",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDA0N2E4Y2QtNDA3Ni00YmFiLWFjNmItODQ2Y2ZiMDg3YzU0XkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "costume,cafe trocadero los angeles,window blinds,france,cinema",
    "name": "Les cent et une nuits de Simon Cinéma",
    "original_info": {
        "id": "One Hundred and One Nights_1995",
        "name": "One Hundred and One Nights",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "reelreviewsandrecommendations"
        },
        "dateCreated": "2022-10-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112654/"
        },
        "name": "Feels Like It Lasted One Hundred and One Nights",
        "reviewBody": "Monsieur Simon Cinéma is nearly one-hundred years old, and his mind is not what it used to be. He spent decades making movies, but now is largely confined to his palatial villa, surrounded by fleeting memories of what once was. Though he is frequently visited by famous stars of the silver screen, he feels lonely and aged. Cinéma decides to hire a young lady named Camille to spent time with, to talk to him about his career and his greatest love: film. While he enjoys Camille's company, it transpires that she may have an ulterior motive for taking the job beyond bringing some joy back into an old man's life.\n\nAgnès Varda's 'One Hundred and One Nights' is a repetitive, hit-and-miss movie that's less a love letter to film than it is an exercise in navel-gazing. While the large cast of talented actors give mostly strong performances, the film repeats the same schtick over and over again and- what's worse- doesn't seem to have anything to say beyond \"cinema is wonderful.\" Many of Varda's films verge on the grandiloquent, but there's usually a plot involved; this feels like a flimsy excuse to get notable actors to do a five-minute walk-on part (or in the case of Harrison Ford and Clint Eastwood, a walk-by part of barely five seconds) for no other reason than to boost Varda's ego.\n\nThere is a subplot involving Camille's boyfriend, who wants to shoot a gangster film, which is arguably less compelling than the exploits of Monsieur Cinéma and his famous guests. A major problem with 'One Hundred and One Nights' is that few of the characters are in any way sympathetic or interesting; the young people are especially vacuous caricatures that leave you wondering why the subplot was included at all. It adds nothing to the overall film but more minutes to the run-time.\n\nOn the other hand, Eric Gautier's cinematography is striking, especially during Monsieur Cinéma's dream sequences, and the production design is undeniably rich and powerful. Cinéma's villa looks like a treasure trove of cinematic history any film-fan would want to explore. The costume design by Leila Adjir, Françoise Disle and Rosalie Varda is also strong; Monsieur Cinéma's elaborate outfits being particularly well-crafted. If only the terrific sets, costumes and visuals were featured in a film of substance.\n\nIt must be said that Michel Piccoli is utterly endearing as Cinéma, bringing intensity, passion and humor to the role that doesn't go unnoticed or unappreciated. However, the character is the only one in the film that's in any way appealing; and that's a serious issue. Audiences are probably meant to like Camille, but she comes across like a horrid, self-interested hussy of no charm whatsoever. Perhaps this is due to Julie Gayet's performance; though more likely it is Varda's direction and writing that is to blame. Camille's boyfriend- played by Mathieu Demy- is a conceited cretin and the rest of the characters are forgettable.\n\nAre there some funny moments in the film? Yes, Piccoli is consistently great and Henri Garcin's turn as his Alain Delon loving butler might give you a few chuckles. Some of the actors are quite good in their cameos as well- Marcello Mastroianni being a real stand-out. However, there isn't enough in the film to warrant a run-time of an hour and forty-one minutes. Had 'One Hundred and One Nights' been a short film, solely about Monsieur Cinéma and a couple of famous visitors talking about film, it would have worked much better.\n\nAs it is, the film is over-long and devoid of anything meaningful. To call it a waste of your time might be putting things a little too strongly; but it's certainly not far off the mark. Those who adore Agnès Varda and think she can do no wrong- and there are many of you out there- will probably call the film a masterpiece. It isn't though: it's pretentious, lengthy cinematic claptrap of the highest order.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1004715289",
        "name": "Bande-annonce [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDFmM2Y4MmEtZGQ4Yy00YmNiLTk4YTEtOGI0Nzk1NDIxM2Y1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDFmM2Y4MmEtZGQ4Yy00YmNiLTk4YTEtOGI0Nzk1NDIxM2Y1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-31T11:41:28.757Z",
        "url": "https://www.imdb.com/video/vi1004715289/"
    },
    "url": "/title/tt0112654/"
}