{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Douglas",
            "url": "/name/nm0000140/"
        },
        {
            "@type": "Person",
            "name": "Ankie Spitzer",
            "url": "/name/nm0819166/"
        },
        {
            "@type": "Person",
            "name": "Jamal Al Gashey",
            "url": "/name/nm0309101/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6102,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103812/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039323/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "2001-07-12",
    "description": "The Palestinian terrorist group Black September holds Israeli athletes hostage at the 1972 Summer Olympic Games in Munich.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Macdonald",
            "url": "/name/nm0531817/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Documentary",
        "History",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWI0MGJkOGEtMzViNS00YzRmLTllMGQtZmJhZjk0Mzg3YzhhXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "1972 summer olympics,munich 1972 summer olympics,black september,munich massacre,terrorist",
    "name": "One Day in September",
    "original_info": {
        "id": "One Day in September_1999",
        "name": "One Day in September",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudecat"
        },
        "dateCreated": "2002-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0230591/"
        },
        "name": "Don't watch this just before bedtime!",
        "reviewBody": "Watching this documentary is a harrowing experience. I think the DVD version is unique in that even its menu page looks terrifying. By the end of the film, however, I was more angry than scared, because of the amazing level of incompetence German and Olympic officials showed in handling the hostage situation. The media also behaved abominably, broadcasting play-by-play accounts of the police's plans right into the ears of the terrorists. It made me think that the Bush administration might be partially correct in keeping the media in the dark about American military activities in Afghanistan.\n\nI don't understand why some people felt the film didn't give the \"context\" of the kidnapping. I think Jamal al Gashey, the only kidnapper left alive now, explained quite clearly why he did what he did. But if the film had spent an extra hour discussing the Israeli-Palestinian conflict, would that have made a difference? In my mind, nothing justified the kidnapping of athletes who by their very presence at the Olympics were trying to further world understanding. I can't think of many things that do justify holding innocent hostages for ransom. The director seems to feel that way too. Apparently that makes the movie too biased for some viewers.\n\nAs for the comment that the movie \"demonizes\" the kidnappers, I don't agree. The filmmakers include a German official's statement that, if he had met him in a different situation, he would have liked the terrorist spokesman, Issa. al Gashey tells some very human stories, such as an ironic account of getting into the Olympic village with the help of American athletes out after curfew, and he insists that the plan was never to murder the Israelis. And al Gashey's brief but affecting account of being exiled from his childhood village does a lot more to argue the Palestinian side of the conflict than any brutal hostage-taking scheme. Too bad he never has realized that.\n\nInterestingly, filmmaker Kevin MacDonald wrote that in Israel he has been accused of giving too much time to the Palestinians. He also notes that Simon Reeve wrote a companion book to the movie, because \"there were many aspects of the story we could not include in a 90-minute film.\" It's a pity the existence of the book isn't publicized more (assuming it's any good).\n\nI do wish the film had spent more time discussing the aftermath of the tragedy, and that MacDonald had used his incredible opportunity of interviewing the last remaining terrorist to ask him some more hard-hitting questions, instead of being satisfied with a step-by-step account of what the kidnappers did that day. (However, I just read that it was extremely difficult for MacDonald to get al Gashey to talk at all.\n\nI wasn't completely convinced that the Germans colluded with the terrorists in the Lufthansa hijacking, and would have liked to see evidence for that. I would also have liked to learn more about the Black September group. Basically, I think the film should have been longer. If it was kept to its current length for some marketing reason, I think the sponsoring studio should rethink that rule.\n\nHowever, the only choice I really wish the filmmaker had not made was to accompany extremely gruesome shots of bodies with loud psychedelic music. It would have been more respectful to show the images in silence.\n\n Watching the film in light of the events of a day in September of 2001, and after, makes me think that the world hasn't come very far since 1972, in terms of solving the Middle East's problems."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Palestinian terrorist group Black September holds Israeli athletes hostage at the 1972 Summer Olympic Games in Munich.",
        "duration": "PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4010197785",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmU4OTNjNGMtM2Q5ZS00NzA1LWJhZjgtYzIyZjY1N2IwZjAyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmU4OTNjNGMtM2Q5ZS00NzA1LWJhZjgtYzIyZjY1N2IwZjAyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-02-04T13:27:51.024Z",
        "url": "https://www.imdb.com/video/vi4010197785/"
    },
    "url": "/title/tt0230591/"
}