{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brian Bosworth",
            "url": "/name/nm0098372/"
        },
        {
            "@type": "Person",
            "name": "Bruce Payne",
            "url": "/name/nm0668271/"
        },
        {
            "@type": "Person",
            "name": "Jeff Kober",
            "url": "/name/nm0462116/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1205,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "alternateName": "One Man's Justice",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049954/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074179/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071569/"
        },
        {
            "@type": "Person",
            "name": "Steven Selling",
            "url": "/name/nm0783413/"
        }
    ],
    "datePublished": "1996-07-26",
    "description": "When a man's wife and family are murdered, he plots revenge only to find out that the killer is under Federal protection and he must exact his own form of justice.",
    "director": [
        {
            "@type": "Person",
            "name": "Kurt Wimmer",
            "url": "/name/nm0934483/"
        },
        {
            "@type": "Person",
            "name": "Kurt Anderson",
            "url": "/name/nm0027044/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Action",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTI0NzEzYWItNmY5OC00MDA1LTgxYjYtMjM3MDQ1OGRmOGJhXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "child uses a gun,child,gun,murder of a child,body in a trunk",
    "name": "One Tough Bastard",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "PeterMitchell-506-564364"
        },
        "dateCreated": "2013-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113999/"
        },
        "name": "One tough actioner rides solid all the way",
        "reviewBody": "Bosworth shows us now, that he can act. He's very good here, putting a lot of heart into his performance. He plays Seargeant North who runs an army corp. Unfortunately for his little daughter and ex wife, they were in the wrong place in the wrong when they're witnesses to a shootout involving some bad guys, one being the ever villainous Kober of course. Bosworth comes a little too late, him taking a bullet too, but surviving. Only there's more dangerous people higher, corrupt DEA agents, led by the versatile Payne as Drew Savaak. Payne creates a real piece of work here, where killer Kober, a real piece of s..t here, is kept under his protection. Bosworth who finally has to pull the plug on his daughter's life support, where the wife'e was executed, starts asking questions and getting involved, as smelling the rats, where he exacts his own investigation and revenge. He forms a friendship with a black kid, Mikey, who helps him, while Bosworth may of found a new love, as he develops a soft spot for Mikey's mother, a social worker if memory serves me correct. Mikey has his own vendetta too, wanting to go after the guys who shot his friend. I loved the scene in the restaurant between the two, exchanging their resolutions on the killers, when they find 'em. Bosworth, a great role figure here, telling Mikey it's wrong to kill, warning him on the consequences. Mikey then asks Bosworth, \"What are you gonna do, when you find em\". Bosworth of course not stating the obvious, comes out with a safer answer \"This is different\". OTB is a solid actioner with heart too, you wouldn't expect the movie to be this good. Bosworth is a force to be reckoned with. I loved it when he was kicking a..e as you so much wanted him too. His acting, particularly at the start, really impressed. There's no denying, Payne's evil presence here is fantastic. He even brought some of his mob from Passenger 57 on board, a film I loved him in.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0113999/"
}