{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "John Newland",
            "url": "/name/nm0627950/"
        },
        {
            "@type": "Person",
            "name": "Robert Douglas",
            "url": "/name/nm0001888/"
        },
        {
            "@type": "Person",
            "name": "Olan Soule",
            "url": "/name/nm0815825/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1674,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038002/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064134/"
        },
        {
            "@type": "Person",
            "name": "Merwin Gerard",
            "url": "/name/nm0313975/"
        }
    ],
    "datePublished": "1959-01-20",
    "description": "A collection of tales about paranormal events, horrifying folklore, and the world of the unknowns.",
    "genre": [
        "Drama",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTI4ODMzNTE2Ml5BMl5BanBnXkFtZTcwNzM3OTQ5Mw@@._V1_.jpg",
    "keywords": "horror host,male horror host,usa horror host,usa male horror host,ghost",
    "name": "One Step Beyond",
    "original_info": {
        "id": "One Step Beyond_1959",
        "name": "One Step Beyond",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "telegonus"
        },
        "dateCreated": "2002-09-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0052442/"
        },
        "name": "Chilling Television",
        "reviewBody": "There have been so many comparisons between this show and The Twilight Zone I may as well add my own two cents on the subject. These two shows were both hosted and created by men who had been active in live television. Rod Serling had been one of the top writers of the live so-called \"golden age\" of TV drama in the fifties, while John Newland had been a prominent actor on the small screen during the same period. Alcoa Presents (rerun as One Step Step Beyond, and best-remembered by this title) actually preceded the Zone by half a second, and ran for less than three full years. TZ has a bigger cult audience, but OSB (as I prefer to call it), has its admirers, of which I am one. \n\nThe Zone was liberal in tone, dark and moody in its photographic style. Its set designs, particularly its street scenes, were reminiscent of film noir. While the Zone's stories were all fiction, many adapted from short stories, OSB's producers claimed that its stories were all based on fact. The different styles of the two shows can be seen in the way their hosts presented themselves. Serling was dark, intense, urban and verbose. Newland was light, mild, laconic and somewhat effete. While Serling seemed like the sort of guy you'd see at the ballpark or at the fights, Newland was the kind of guy one might expect to turn up at the opera. Serling came off as very American in all respects, while Newland could almost pass as British.\n\n OSB presented each episode as if it were the truth, only slightly dramatized. There was nothing on the surface to suggest that the show was in any way about the supernatural or ESP. The sets were unimaginative, prosaic, and often seemed flooded with light; as the overall visual style of the series was not that different from a commercial,--or an episode of the Loretta Young Show. What made the shows creepy were the acting, which was often excellent, and Harry Lubin's eerie, otherworldly music, which kicked in whenever something weird was happening. The actors tended to react to the strange goings-on realistically,--as it they were choking to death, had just seen a ghost, talked to a dead person or had witnessed a murder that had happened twenty years earlier--and the \"startle reactions\" on the faces of the players, plus Lubin's beyond the grave music, could send chills down one spine. This was a million miles from the often sentimental and didactic Zone, which seldom went for straight horror, straight sci-fi or straight anything unless there was a \"meaning\" (i.e. a point, a lesson), while the only lesson one learned from OSB was that \"such things exist, such things happen\". Chilling television, this was, and story-telling with a vengeance. \"You want meaning?\", Newland seemed to ask the viewer after each episode, \"Go find it for yourself. My job is to give you the facts\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "One Step Beyond",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2206973209",
        "name": "One Step Beyond",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGRhZDcxMGEtYzI5MS00Zjg0LTk2YTctZGQ1Y2VhNTJlNjA4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGRhZDcxMGEtYzI5MS00Zjg0LTk2YTctZGQ1Y2VhNTJlNjA4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-18T10:38:01.038Z",
        "url": "https://www.imdb.com/video/vi2206973209/"
    },
    "url": "/title/tt0052442/"
}