{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robin Williams",
            "url": "/name/nm0000245/"
        },
        {
            "@type": "Person",
            "name": "Connie Nielsen",
            "url": "/name/nm0001567/"
        },
        {
            "@type": "Person",
            "name": "Michael Vartan",
            "url": "/name/nm0890232/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 126066,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028932/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005432/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030755/"
        },
        {
            "@type": "Person",
            "name": "Mark Romanek",
            "url": "/name/nm0738796/"
        }
    ],
    "datePublished": "2002-09-13",
    "description": "A mentally unstable photo developer targets an upper middle-class family after his obsession with them becomes more sick and disturbing than any of them could imagine.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Romanek",
            "url": "/name/nm0738796/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWVkMjAzY2QtZTA4Yi00OWZmLTliMzctZTkyODU4NTc3MmRjL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "photography,photo lab,unfaithfulness,adultery,female rear nudity",
    "name": "One Hour Photo",
    "original_info": {
        "id": "One Hour Photo_2002",
        "name": "One Hour Photo",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-10-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0265459/"
        },
        "name": "Above average stalker flick that avoids some of the clichés",
        "reviewBody": "Seymour is a lonely nondescript man who lives by himself and works in the photo developing lab in a large mall. The only bit of cheer in his day is to develop very good photos in his lab, and he takes great pride in his work. His favourite customers are the Yorkin's, who have a son and regularly develop pictures. Seymour's like for this family goes beyond `like' and he feels part of their family and has all their pictures on his wall. However when both his job and the unity of his family are threatened he reacts.\n\nI saw this film in a free preview screening before it came out so I had no reviews to cloud me first. Happily most of them appear to feel the same as I did. In terms of plot this set up will be no surprise to anyone  we've all seen Single White Female and Pacific Heights etc, we know what happens that leads to the old bunny boiling etc.\n\nHowever One Hour Photo is different enough to justify watching. My wife complained that it was too slow and boring but I felt this approach helped it stand out. Instead of being a thriller it was more of a cold slow boiler than was more chilling than thrilling. The plot is well laid out  even the money shot of all the pictures on the wall is played out while we're distracted by a joke from the Simpsons on TV. The director's cold approach to story telling works very well and highlights Seymour's grey existence and cold life. Only occasionally does he go astray  the fantasy sequences don't always work for instance but for almost the whole film he does very well.\n\nTowards the end Seymour's behaviour goes erratic as we expect and I was worried that the film had eventually given way to cliché. Happily this is not the case. Yes, Seymour's change is a bit of a leap at first but the film cleverly pulls it back at the end. This makes it above the rest of this genre by a good head and shoulders. Clever touches abound in the film but don't always work. For example the director shows us that it is all about seeing by covering Seymour's eyes with objects in some shots to show he has lost his ability to watch, while the name Yorkin is a slight play on `Your Kin' or your family. These are clever but don't add very much  the eye theme felt a bit too clever and intrusive.\n\nWilliams is excellent. Having paid to see him mush around in Patch Adams I was worried here that eventually his emotions would run away with him. However Williams (and here's something you'd won't hear much) keeps it all in check and underplays wonderfully. His Seymour is likeable, sad, pathetic and chilling all at once. It's hard not to feel for him and he is better for being low-key. I truly felt Williams had turned himself into a `little' man  one of those people who you barely notice on the streets as they make no lasting image. Vartan (Alias) is good as Will and Nielsen is also good as Nina. They are also given firm support in the shape of Gary Cole and La Salle. However his is Williams show and, by underplaying, he steals it easily.\n\nOverall this has it's flaws but it is head and shoulders above the rest of this stalker genre. Directed with a clinic eye rather than a thrilling eye this is clever and different enough to more than justify checking it out."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4221436185",
        "name": "One Hour Photo",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGJjMmFkODctYWRkNS00NmJlLTgxODEtNWVkMDczYjYxZjM4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGJjMmFkODctYWRkNS00NmJlLTgxODEtNWVkMDczYjYxZjM4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:32:22Z",
        "url": "https://www.imdb.com/video/vi4221436185/"
    },
    "url": "/title/tt0265459/"
}