{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ralph Fiennes",
            "url": "/name/nm0000146/"
        },
        {
            "@type": "Person",
            "name": "Liv Tyler",
            "url": "/name/nm0000239/"
        },
        {
            "@type": "Person",
            "name": "Toby Stephens",
            "url": "/name/nm0827170/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8073,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103775/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052634/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0186110/"
        },
        {
            "@type": "Person",
            "name": "Peter Ettedgui",
            "url": "/name/nm0262167/"
        },
        {
            "@type": "Person",
            "name": "Alexander Pushkin",
            "url": "/name/nm0701090/"
        },
        {
            "@type": "Person",
            "name": "Michael Ignatieff",
            "url": "/name/nm0407199/"
        }
    ],
    "datePublished": "1999-11-19",
    "description": "Russia, 1820s: Onegin inherits his uncle's country estate and moves there from St. Petersburg. He befriends his neighbor, Lensky, and meets Tatyana through him. She falls in love with Onegin but he just wants friendship.",
    "director": [
        {
            "@type": "Person",
            "name": "Martha Fiennes",
            "url": "/name/nm0276397/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDk3NjE3Y2YtZjM2MC00MTk2LWJhNzItZDk3NTBlZjliYzcxXkEyXkFqcGdeQXVyMTgxOTIzNzk@._V1_.jpg",
    "keywords": "1820s,friend,period film,uncle nephew relationship,torment",
    "name": "Onegin",
    "original_info": {
        "id": "Onegin_1999",
        "name": "Onegin",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2000-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119079/"
        },
        "name": "interesting romantic drama",
        "reviewBody": "Fine performances highlight `Onegin,' a generally interesting version of Pushkin's complex love story whose contemporary significance shines through the tortured souls of its two main characters. Ralph Fiennes stars in the title role as a 19th Century Russian aristocrat who, like many similar figures in Russian literature of that time, suffers from the attenuating effects of enervation and ennui. Though the recipient of vast sums of wealth and property at the death of his uncle, Onegin finds no meaning or solace in life as he lives it. He is as bored by the stifling superficiality of the privileged elite languishing in splendor in the fancy halls and glittering ballrooms of cosmopolitan St. Petersburg as he is by the domestic dreariness of the provincials residing in the bucolic countryside where one of his uncle's vast estates is located. In the latter setting, while visiting Vladimir - a poet he has recently befriended - Onegin becomes drawn to Tatyana the beautiful younger sister of the man's fiancé. Both Onegin and Tatyana reflect a remarkably modern sensibility in their temperaments. For instance, though the attraction between the two is a mutual one, it is Tatyana who makes the first move, pouring out her unbridled love for this newcomer in a letter which Onegin politely rejects because he fears the deadening of the soul that he believes will inevitably accompany marriage and fidelity. One can't get much more contemporary in tone than these two characters, one stepping well out of the accustomed bounds accorded her sex in affairs of romance and the other reflecting the fear of commitment that is such a staple of modern times. Yet, fate plays its cruelest hand at the end, as Onegin finds himself, years later, trapped in an ironic role reversal as the now-married Tatyana is forced to rebuff the advances of the obsessed, lovelorn man whom she still admits to loving. As in many bleak works of Russian literature, the character is forced to live out his existence in a hell of his own making, suffering the torment of regret without end.\n\nThe personal drama unfolds against the fascinating backdrop of the subtly changing society of 19th Century Russia, a country that, then and now, has seemed to be always several centuries behind its European neighbors in its moves towards liberalization in the areas of basic human and civil rights. We see clearly the struggle between the empty ritualism and entrenched barbarism of the past, as reflected in the continuing institution of serfdom and in gun duels fought over affairs of honor, and the enlightened philosophy of the coming world, as many young aristocrats begin to champion both the abolition of serfdom and the growing acceptance of love as the foundation of marriage. Indeed, the two young lovers cannot extricate themselves from the entanglements that often accompany a time unsure of its traditions. Onegin, for all his talk about freeing his serfs, is himself forced to participate in a duel that both horrifies and disgusts him. And Tatyana, for all her comments about only marrying a man she loves, succumbs to the pressure of tradition, ultimately agreeing to a marriage based on class, money and position. Here are two people caught in a world not yet ready for them, who are forced to settle for the compromises their society has deemed fit and proper.\n\nThis well-acted, well-written and well-directed film may seem a bit slow at times, but the intelligence of the dialogue, the subtle underplaying of the cast and the quiet beauty of much of the direction lead us into a strange world of the past that still has resonance and relevance for the world of today."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sterling Home Entertainment",
        "duration": "PT2M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3482976537",
        "name": "Onegin",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmI4YzBjNjItYmFiNi00NGVkLTljZTEtNGQ5ZmIzNTNjMDUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmI4YzBjNjItYmFiNi00NGVkLTljZTEtNGQ5ZmIzNTNjMDUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:19:33Z",
        "url": "https://www.imdb.com/video/vi3482976537/"
    },
    "url": "/title/tt0119079/"
}