{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gena Rowlands",
            "url": "/name/nm0001687/"
        },
        {
            "@type": "Person",
            "name": "John Cassavetes",
            "url": "/name/nm0001023/"
        },
        {
            "@type": "Person",
            "name": "Ben Gazzara",
            "url": "/name/nm0001262/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11209,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0227864/"
        },
        {
            "@type": "Person",
            "name": "John Cassavetes",
            "url": "/name/nm0001023/"
        }
    ],
    "datePublished": "1978-04-17",
    "description": "A renowned actress teeters on the edge of a breakdown as she counts down the days toward a big Broadway opening.",
    "director": [
        {
            "@type": "Person",
            "name": "John Cassavetes",
            "url": "/name/nm0001023/"
        }
    ],
    "duration": "PT2H24M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGM3MWY5Y2MtYWM4MS00ZmE5LTk3MDgtYzM0MmZmZTI0YjM2XkEyXkFqcGdeQXVyMzU4ODM5Nw@@._V1_.jpg",
    "keywords": "artistic creation,alcoholic,obsessed fan,spiritualist,opening night",
    "name": "Opening Night",
    "original_info": {
        "id": "Opening Night_1979",
        "name": "Opening Night",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chaos-rampant"
        },
        "dateCreated": "2016-01-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079672/"
        },
        "name": "Meditations on the original face III",
        "reviewBody": "This is the film that nearly broke Cassavetes for good. It played in a single LA theater for a few weeks to empty seats before being shelved, never really opening. People would not have flocked to see it but it must have been dismay that shakes you to your core, to go through all this work and just shelve it at the end. In a few years time it would be playing in MoMA.\n\nCassavetes' whole project of making films is one of the most fascinating in the medium. We have only tidbits on screen really. The rest is tucked away in the filming process that went into discovering each film. It's in the hours of footage he never used. The four hour versions of Husbands and Woman we'll never see. His struggles to make each one are comparable to Welles, remarkable men both.\n\nThe story goes that he was so spent after making Woman that he was never the same again. He had said his piece and in the most pure way possible. Before and after are iterations of the same way of seeing anyway, as is always with makers who have something to impart and don't just show up for work. But he was fervent to keep going: he used the profits from that film to make Chinese Bookie and this out of pocket.\n\nBookie saw him reflecting on his own place as proprietor of lively improvisations while having to deliver a gangster plot to appease money men. It was not just cynical work. It was a meditative search for a true face from among different masks; suave playboy, entertainer, killer. It continues here, the same business with roles and faces.\n\nAs always, actors fumble and fret within the constraints of a story imposed on them. The camera swims as one of them would, as if culled from inside an actor uncertain about his presence, losing and finding again. The whole has that thick, viscous quality I love about him, it demands concentrated staying in that space where nothing is yet decided. This is Cassavetes' room. By this point you'll know whether you like it or not. \n\nThis is about an actress asked to go into that room and portray a role: woman pushing forty, childless and unmarried. It's for a play they're preparing for New York out in the sticks. She is all of those things in \"real life\" so what would make better sense than to portray truthfully?\n\nBut this is the whole thing with Cassavetes, why you deserve to have him in your life above all those other filmmakers who mollycoddle you with redemptions. With him truth is something you set out to find by shedding self, it's not handed down by any role and you have to make sure of that. It's what you find after you have stopped tossing the room for it. After words and guises have been peeled back, what is there? \n\nThis whole film is about an actress, Rowlands, fighting to shed that self that stands in the way of true expression. The play role expects middle-aged desperation about life, self- pity. Melodrama stuff. But she can't do it, won't. She could tap into those parts of herself but that would be giving into those parts, nurturing them, conceding to be the person the story says you must be.\n\nSo she won't do it. People plead with her, cajole, scold or lecture her but nothing does it, she is adamant. It has a few blunt devices along the way: seance and ghost of a younger self. Her refusal to do the sensible thing aggravates. In the all important premiere she finally arrives late and drunk and everyone concedes that it's not going to happen.\n\nAll of this ribs on Cassavetes own method of sustained, structured collapse where the point isn't to use actors to convey certainties of drama, it's to use drama to chisel the persons who will live through its effect on them. Whatever that comes to be. It all has to arrive to a point of intense uncertainty. A cessation of thought so that things will be free to mean themselves.\n\nYou'll see what he does in the end. It's Cassavetes and Rowlands on a stage in a culmination of a parallel life in which they never married. \n\nIt's marvelous. It doesn't really work and you will probably note that he misses. But if you're someone who tries to be the person you truly feel in your heart to be, you will rejoice to see the baring and nothing pretty, sad or redemptive salvaged out of it so we'll applaud. It's the reach that drives it, the transcendent reach for that idea all about masks dropping and having to face yourself bare, and in his reach he is as vast as Tarkovsky."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A renowned actress teeters on the edge of a breakdown as she counts down the days toward a big Broadway opening.",
        "duration": "PT4M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi433373977",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmFhOThkNzctN2YxYS00N2Y1LTg2YWItYzliNzY1M2EzOTI5XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmFhOThkNzctN2YxYS00N2Y1LTg2YWItYzliNzY1M2EzOTI5XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-25T15:14:49.773Z",
        "url": "https://www.imdb.com/video/vi433373977/"
    },
    "url": "/title/tt0079672/"
}