{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Donald Sutherland",
            "url": "/name/nm0000661/"
        },
        {
            "@type": "Person",
            "name": "Mary Tyler Moore",
            "url": "/name/nm0001546/"
        },
        {
            "@type": "Person",
            "name": "Judd Hirsch",
            "url": "/name/nm0002139/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 53957,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034515/"
        },
        {
            "@type": "Person",
            "name": "Judith Guest",
            "url": "/name/nm0346407/"
        },
        {
            "@type": "Person",
            "name": "Alvin Sargent",
            "url": "/name/nm0765091/"
        },
        {
            "@type": "Person",
            "name": "Nancy Dowd",
            "url": "/name/nm0235683/"
        }
    ],
    "datePublished": "1980-09-19",
    "description": "The accidental death of the older son of an affluent family deeply strains the relationships among the bitter mother, the good-natured father and the guilt-ridden younger son.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Redford",
            "url": "/name/nm0000602/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWU3MDFkYWQtMWQ5YS00YTcwLThmNDItODY4OWE2ZTdhZmIwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "psychiatrist,dysfunctional family,grief,boating accident,father son relationship",
    "name": "Ordinary People",
    "original_info": {
        "id": "Ordinary People_1980",
        "name": "Ordinary People",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Conrad-23"
        },
        "dateCreated": "2000-05-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081283/"
        },
        "name": "An Extraordinary Film of Humanity: 10/10",
        "reviewBody": "This film, without a doubt, is the best dramatic film I have ever seen. It is truly an extraordinary film of humanity. To start out, the film begins in complete silence and gently flows into Pachalbel's \"Canon in D\". It has become my favorite movie and I can say with 100% certainty that it deserved every Oscar it received. I cannot truly articulate with words what this movie did to me when I first saw it. I had an epiphany-like experience. I was born in 1980 and didn't see this film until shortly after I turned 19. The events portrayed by Timothy Hutton, Mary Tyler Moore, Donald Sutherland, Judd Hirsch, Elizabeth McGovern, Dinah Manoff, and Fredric Lehne are just as powerful and relevant in society today as they were 20 years ago. Timothy Hutton's performance of Conrad Jarrett, an 18 yr-old suffering from depression after the tragic death of his older brother is extraordinary. Being the age Hutton was when he made the film, when I first saw it twenty years later, I related to the emotions on every note. Teenagers are rarely portrayed in film as realistically as in real life. In my opinion, Conrad Jarrett in \"Ordinary People\" is the best portrayal on film of a teenage boy going through the good times and the bad, but mostly the bad. Timothy Hutton is a truly amazing actor. Mary Tyler Moore also deserved all of the praise and nomination for a role that is literally the opposite of anything she had ever played before. The way she portrayed the cold, cruel, yet emotionally-hidden Beth Jarrett is outstanding. Donald Sutherland and Judd Hirsch also gave performances that made them truly believable as Calvin Jarrett and Dr. Berger. Sutherland should have received an Oscar nomination. Elizabeth McGovern and Dinah Manoff's small character roles as Jeannine Pratt and Karen are just as vivid as in the novel. Jeannine provides the excellent uplift in the story; while Karen provides the semblance of reality that things are not as they seem. Every line and every scene in this film is as detrimental to the overall underlying theme as it is in the novel by Judith Guest. The words \"I love you\" and \"love\" have an immense importance in this film. Kudos to Robert Redford, who shows that he is not only an excellent actor, but also a truly excellent director. The color scheme, music scheme, setting in Lake Forest, Illinois and that \"perfect\" home all provide the exact backdrop to the circumstances going on between these characters and within Conrad himself. This film relies solely on the realistic interaction between \"ordinary\" people living through \"extraordinary\" circumstances. This film had an amazing impact on me and I'm sure it will do the same for anyone else who sees it. If you do not leave this film having gained that underlying insight that this film gives, then you did not truly understand the purpose of the film. You don't have to suffer from depression or go through the loss of a loved one to understand the message delivered by this film. It's definitely more than just a \"tissue\" movie. Truly one of the best films ever made.\n\nA 10 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3009198873",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjY2NWJjNDctNDAwYy00MWZmLWEwNDgtMzkzOTNmNzFhMTBjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjY2NWJjNDctNDAwYy00MWZmLWEwNDgtMzkzOTNmNzFhMTBjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-09-14T22:12:46.356Z",
        "url": "https://www.imdb.com/video/vi3009198873/"
    },
    "url": "/title/tt0081283/"
}