{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Antonio Banderas",
            "url": "/name/nm0000104/"
        },
        {
            "@type": "Person",
            "name": "Angelina Jolie",
            "url": "/name/nm0001401/"
        },
        {
            "@type": "Person",
            "name": "Thomas Jane",
            "url": "/name/nm0005048/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 57805,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036225/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036081/"
        },
        {
            "@type": "Person",
            "name": "Cornell Woolrich",
            "url": "/name/nm0941280/"
        },
        {
            "@type": "Person",
            "name": "Michael Cristofer",
            "url": "/name/nm0188165/"
        }
    ],
    "datePublished": "2001-08-03",
    "description": "A woman, along with her lover, plans to con a rich man by marrying him, earning his trust, and then running away with all his money. Everything goes as planned until she falls in love with him.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Cristofer",
            "url": "/name/nm0188165/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Drama",
        "Mystery",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODg3Mjg0MDY4M15BMl5BanBnXkFtZTcwNjY5MDQ2NA@@._V1_.jpg",
    "keywords": "sex scene,borderline personality disorder,erotica,mail order bride,passionate sex",
    "name": "Original Sin",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pookyiscute"
        },
        "dateCreated": "2004-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0218922/"
        },
        "name": "wow...",
        "reviewBody": "This movie was surprising to put it mildly. When I saw the cover, I figured it was going to be just your typical dark love story...ha ha, guess again. This movie was awesome! Not only does it keep you guessing throughout the entire story, you can't help but notice all of the eye stoppers. The cinematography was absolutely stunning, the filming locations were impeccable for beautiful scenery and spots, and the graphic love scenes...well, as much as I could have done without them, they certainly did add a lot to the film. Every part of the movie was exceptionally well done, and I fell in love with this piece.\n\nIf you're a movie buff like me, you might remember a little film that came out in 1994 with James Spader entitled 'DreamLover'. Now, although that movie is surpassed by Banderas and Jolie's hit, they do share a bit of the same flavor as one another. I remember seeing the Spader flick on t.v. one night and thought it was really great, however after seeing this I was reminded of the film, and thought that they shared similar traits. Though, as I said before, this movie was a lot better. Much more A quality, bigger names, bigger production, and basically more money was spent making it, which more often than not, is a good thing, and helps the film rather than hurting it.\n\nJolie and Banderas have never been favorites of mine, and in fact the only movie I ever liked Angelina in before this was 'Girl Interrupted', and Banderas in 'Two Much'. This one, though, made me think twice about both the actors abilities on screen. They executed such a great chemistry between one another. I found myself even crying by the end of the movie. It is truly unlike any other movie I've ever seen. Sure, the premise was similar to others that I have seen in the past, but the directing, acting and just whole feel of the film was so unique and so on its own. I loved it! I would recommend it to anyone who enjoys a great intense romance.\n\nI would advice, however, that some of the scenes especially at the beginning are a bit crazy (sexually that is). Bare breasts, and well, just a whole lot of nakedness kind of take over the movie from time to time, so parents caution.\n\nBut, otherwise I give the movie two thumbs up, it rocked! I give it a 10/10! Great story about love!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from MGM",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi451281177",
        "name": "Original Sin",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWIzMjVmMTQtNDVjYy00YmI0LWJhOWMtYWNkZWI1ZGY5ZjE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWIzMjVmMTQtNDVjYy00YmI0LWJhOWMtYWNkZWI1ZGY5ZjE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-05-30T00:19:09Z",
        "url": "https://www.imdb.com/video/vi451281177/"
    },
    "url": "/title/tt0218922/"
}