{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wendee Lee",
            "url": "/name/nm0283253/"
        },
        {
            "@type": "Person",
            "name": "Lara Cody",
            "url": "/name/nm0168594/"
        },
        {
            "@type": "Person",
            "name": "Kerrigan Mahan",
            "url": "/name/nm0536748/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 355,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Original Dirty Pair: Project Eden",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006858/"
        },
        {
            "@type": "Person",
            "name": "Haruka Takachiho",
            "url": "/name/nm0846997/"
        },
        {
            "@type": "Person",
            "name": "Hiroyuki Hoshiyama",
            "url": "/name/nm0395983/"
        }
    ],
    "datePublished": "1987-03-14",
    "description": "WWWA Trouble Consultants Kei and Yuri team up with a petty thief to stop a mad scientist and his legions of mutated creatures.",
    "director": [
        {
            "@type": "Person",
            "name": "Kôichi Mashimo",
            "url": "/name/nm0556325/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzM3MzM0NTAtOGZhYi00YmE4LWFhYTYtNmMwN2U3NjM2NGJlXkEyXkFqcGdeQXVyMTEwNDU1MzEy._V1_.jpg",
    "keywords": "2140s,22nd century,anime animation,thief,mad scientist",
    "name": "Dâti pea Gekijô-ban",
    "original_info": {
        "id": "Original Dirty Pair_1985",
        "name": "Original Dirty Pair",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2010-02-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0385668/"
        },
        "name": "DIRTY PAIR: PROJECT EDEN: Anime mix of action, comedy, romance and sci-fi",
        "reviewBody": "DIRTY PAIR: PROJECT EDEN (1987) is a Japanese animated feature film that stars Kei and Yuri, the sexy crimefighters known as the \"Lovely Angels,\" who work for the intergalactic police agency, WWWA. Their hated nickname is \"the Dirty Pair,\" a reference not to the provocative outfits they wear but to the property damage that frequently results from their actions. In the pre-credits sequence, their intervention in a smuggling caper results in the wholesale destruction of a space resort. (The bomb was left by the smugglers, yet quick thinking by the girls could indeed have moved it safely off the structure in time.)\n\nPROJECT EDEN was the girls' only theatrical feature (other than a cameo appearance in CRUSHER JOE, 1983) and the animation is quite spectacular throughout. The film is set in 2141 A.D. at a time when a substance called \"vizorium\" has been discovered that can power warp engines capable of rapid travel through space, resulting in 3000 independent space colonies on planets all over the galaxy. The plot takes the girls to the planet Agerna where rival vizorium mining operations in two opposing nations (Edia, a capitalist state obviously modeled after the U.S., and Uldas, a totalitarian state modeled after the USSR) set the stage for war after a pack of reptilian monsters attacks the government-run mining facilities of Uldas and their leaders blame Edia. Kei and Yuri investigate the damaged Uldasian facilities and run into one of the smugglers from the opening pre-credits caper, the hunky Carson B. Carson, who interrupts them as they take a bubble bath in an abandoned bathroom. They handcuff Carson and strip him down to his pink-with-black-polka-dots boxers before they eventually use him as an ally once he convinces them he can lead them to the culprit behind all the attacks. Besides, the voluptuous redheaded Kei develops quite a yen for him.\n\nThey eventually confront the aging mad scientist Professor Wattsman, who lives in a sprawling underground secret laboratory with his manservant Bruno and has spent years trying to create a new life form that he feels is lying dormant inside the rocks used to extract vizorium. The experiments lead to one kind of reptilian monster after another and the professor seems utterly oblivious to his creatures' murderous rampages. Kei, Yuri and Carson have their hands full fighting the monsters with their advanced weaponry and eventually make it to the professor's inner sanctum where he controls an even more monstrous creation.\n\nWhile there is plenty of excitement and action and the story keeps our interest, the mad scientist offers a most problematic villain. His motives aren't terribly compelling and his extreme eccentricity gets tiresome pretty quickly. He's powerful and his creatures are monstrous, but we needed more of a motive than his bizarre obsession with finding the advanced life form he believes exists within the rocks and his continued experimenting long after it becomes obvious that the best he'll get are these ravenous, scaly monsters. The dark planet interior where all this takes place is also a strange setting in which to place Kei and Yuri, two attractive, vain, witty, and happening young women who work best in a more cosmopolitan setting, as found in several episodes of their later ten-part OAV (original animation video) series (1989). While the massive, dark, abandoned mining facility here is very dramatic, it tends to cramp the Dirty Pair's more colorful, disco-ready style.\n\nThat said, however, the film does offer some great-looking 1980s character and production design. The girls look fantastic—better, in fact, than they do in the one-shot hour-long OAVs they appeared in before and after this film (\"Affair on Nolandia,\" 1985, and \"Flight 005 Conspiracy,\" 1990, both also reviewed on this site.) The settings, space vehicles, and mecha trappings are all intricately and imaginatively designed. Except for the grotesque monsters, everything else in the film is actually quite beautiful. There are nice opening and closing theme songs sung by Miki Matsubara.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from ADV Films",
        "duration": "PT1M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3589341465",
        "name": "The Original Dirty Pair",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmU3NjQ2M2QtYjYyNC00M2E5LWEzMDgtMDQwZjFiMWU5YTk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmU3NjQ2M2QtYjYyNC00M2E5LWEzMDgtMDQwZjFiMWU5YTk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:40:37Z",
        "url": "https://www.imdb.com/video/vi3589341465/"
    },
    "url": "/title/tt0385668/"
}