{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marina Golbahari",
            "url": "/name/nm1385208/"
        },
        {
            "@type": "Person",
            "name": "Zubaida Sahar",
            "url": "/name/nm1387181/"
        },
        {
            "@type": "Person",
            "name": "Khwaja Nader",
            "url": "/name/nm1442217/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9307,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0099862/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099863/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052417/"
        },
        {
            "@type": "Person",
            "name": "Siddiq Barmak",
            "url": "/name/nm1383995/"
        }
    ],
    "datePublished": "2003-06-27",
    "description": "After the rise of the Taliban in Afghanistan and the restriction of women in public life, a pre-teen girl is forced to masquerade as a boy in order to find work to support her mother and grandmother.",
    "director": [
        {
            "@type": "Person",
            "name": "Siddiq Barmak",
            "url": "/name/nm1383995/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg3NTM5MDAxMF5BMl5BanBnXkFtZTcwNTk0OTQyMQ@@._V1_.jpg",
    "keywords": "taliban,menarche,boy,girl,school",
    "name": "Osama",
    "original_info": {
        "id": "Osama_2003",
        "name": "Osama",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2004-10-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368913/"
        },
        "name": "harrowing view of life under the Taliban",
        "reviewBody": "I saw 'Osama' on the same weekend in which Afghanistan held its first-ever free elections. The contrast between that event and what we see in this film could not be more dramatic and striking.\n\nThis is the first film made in the country since the fall of the Taliban regime. It is a harrowing study of life under that brutal dictatorship as seen through the eyes of a terrified 12-year old girl. The Taliban considered being a woman as almost akin to sinning against God. As a result, women were not allowed to hold jobs, appear in public without male escorts, or show their face or any other part of their body when venturing outdoors. 'Osama' focuses specifically on the plight of war widows who were virtually forced into starvation as a result of these draconian rules. The film tells the tale of a young girl whose mother loses her job at a local hospital. To provide food for the table, the mother and the girl's grandmother devise an extremely dangerous plan to pass the youngster off as a boy, thereby allowing her to work as an assistant to a sympathetic shop owner. Even though the penalty is death if she is caught, the young girl reluctantly accedes to the plot. When she is rounded up with the other local boys to begin a program of religious indoctrination and military training, she must expend a great deal of effort to prevent her ruse from being uncovered.\n\n'Osama' is a short film, and it doesn't intend to do anything more than offer a very small glimpse into what life was like under this tyrannical regime. In that respect, the film provides an invaluable service to those of us in the West who find it hard to believe that such mind-numbing ignorance and cruelty can still exist in our modern world. We see it, of course, every night on the news, but until an artist can translate it into recognizable human terms, the reality often doesn't hit us in the way that it should. 'Osama' really brings it home to us. Through our experience with these characters, we come to understand how unutterably hopeless and miserable life can be for people trapped in a culture defined by a pre-scientific mindset of irrational bigotry and superstition. The girl, who is dubbed by one of the other characters 'Osama,' is no plucky little heroine who takes on the Bad Guys, indifferent to the dangers she is facing.\n\nShe is a passive victim living a life of paralyzing fear, a perfect symbol for all the other women of her country who were consigned to a similar fate.\n\nWriter/director Siddiq Barmak has employed non-professional actors to bring the tale to life. All of them do a remarkable job, especially young Marina Golbahari, who captures the wide-eyed terror of her character with vivid exactness. Golbahari becomes such an empathetic figure that her plight is understandable to any person from any culture.\n\n'Osama' is like one of the early works from the school of post-war Italian neo-realism: small, unadorned and devastating in its simplicity and humanity."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Osama Scene: She Will Be A Boy",
        "duration": "PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3252470809",
        "name": "Osama Scene: She Will Be A Boy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTZiOTEwN2EtYWNkMS00NDI4LTk5MDQtZmVlYTQ3M2E3NDBmXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTZiOTEwN2EtYWNkMS00NDI4LTk5MDQtZmVlYTQ3M2E3NDBmXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-03-03T19:04:30.341Z",
        "url": "https://www.imdb.com/video/vi3252470809/"
    },
    "url": "/title/tt0368913/"
}