{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        },
        {
            "@type": "Person",
            "name": "Ida Nowakowska",
            "url": "/name/nm1442278/"
        },
        {
            "@type": "Person",
            "name": "Agnieszka Wagner",
            "url": "/name/nm0905777/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5067,
        "ratingValue": 4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043393/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0166202/"
        },
        {
            "@type": "Person",
            "name": "Trevor Miller",
            "url": "/name/nm1428007/"
        },
        {
            "@type": "Person",
            "name": "James Townsend",
            "url": "/name/nm1329977/"
        }
    ],
    "datePublished": "2004-11-05",
    "description": "Billy Ray Lansing, a former covert agent turned survivalist, discovers that the foster program he is using to help a young girl is actually a human trafficking network. Lancing heads overseas to find the girl and shut down the ope...",
    "director": [
        {
            "@type": "Person",
            "name": "Po-Chih Leong",
            "url": "/name/nm0502987/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ3MTg1MDY3Ml5BMl5BanBnXkFtZTgwNzMwNjAwNzE@._V1_.jpg",
    "keywords": "murder of a child,offscreen murder,betrayal by a friend,scene of the crime,female police officer",
    "name": "Out of Reach",
    "original_info": {
        "id": "Out of Reach_2004",
        "name": "Out of Reach",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jessecrowder"
        },
        "dateCreated": "2004-07-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0377100/"
        },
        "name": "Seagal's Ship Is Still S(t)inking",
        "reviewBody": "Well, I have to say I am very disappointed. Again. I'd like to start this commentary by saying that I'm myself a fan of Mr. Seagal and have followed his career in motion pictures since I first saw the superb \"Above The Law\" back in 1989. This information is just to clarify, that I'm not here to bash Seagal just because it seems to be the \"hip\" thing to do.\n\nIt's fair to say that Seagal's cv hasn't looked very impressive since \"Under Siege\" over ten years ago. It's been a slow downhill with a few exceptions like fairly enjoyable \"US 2\" and dumb but entertaining \"Exit Wounds\". With his Hong Kong influenced \"Belly Of The Beast\" outing I dared to expect something of a comeback for our beloved thespian, but \"Out Of Reach\" sends him right back where he was with the dreadful \"The Foreigner\" and even more horrible \"Out For A Kill\". You could sum this commentary with one sentence: no more polish action films. The production values of \"OOR\" are minimal, script has holes for trucks to go through and the acting. Oh lord, the acting. Through out the entire film it is just plain torture to watch. Let's face it - Seagal has never been exactly Oscar material, but he has had his moments. Not in this one. I just don't get why on earth they have to dub his voice with these totally moranic voice overs? And this time it happens a lot, even in the middle of the scene in where he has spoke with his own voice in the beginning. \n\nSeagal has dropped some weight, but it is still a stretch to buy him as an action hero. His moves are slow (still the show them most of time in slow motion!!) and he uses stunt doubles a lot. Action in \"OOR\" is quite minimal and fairly up to basic standards even for a movie this scale. The brothel shoot out is OK, but the final duel between Seagal and Matt Schulze is a major let down. And while speaking of Mr. Schulze it should be noted that Seagal's acting really isn't the worse in \"OOR\". Schulze, who delivered good performances in \"Blade 2\" and \"The Transporter\" is totally lost with the role of Faisal The Ultimate Bad Guy. His pseudo sophisticated character is probably one of the most lame villains ever supplied with incredibly stale dialogue.\n\nLike noted, the acting in whole is pure crap and it seems that many of the polish actors don't even know English - they just repeat what the director or who ever tells them to say. There really are no good performances in \"OOR\" except the small cameo of Nick Brimble and momentarily the girl who plays Seagal's pen pal. There are numerous just idiotic scenes like the one where the little girl is held captive in the basement of a castle where villains are having a big party. She is guarded by one of the villains and asks him something like \"Why are you not invited to the party?\" The bad guy totally loses it and screams: \"Stop trying to get inside my head!\" Whoa. Then there are the goofy scenes where Seagal wanderers in the forest \"looking for injured animals\". It is of course a beautiful concept, but the guy looks like a lost-in-the-woods member of a motorcycle gang. And the final still picture before the end credits start to roll. What the heck were they thinking in the editing room? \"Wow, NOW this movie works like it should!\"\n\nI did my best to come up with even one positive thing about \"OOR\", but it just seems impossible. How can talented(?) people mess up this bad and what in heaven's name did Seagal see in this project that made him want to get into it? Is he proud of his Poland era of film making?\n\nIf you are a fan of Seagal you have to ask yourself a question: did you like him as the arrogant ass kicker from his Warner Brothers days or do you prefer this independent (no big studio wants to touch him with a ten foot pole?) filmmaker -version of him? If your heart beats for his neat ponytail wearing, black leather jacket and jeans -period then do your self a favor and leave \"OOR\" alone. As sad as it might seem.\n\nThis was a stink bomb. Please, let \"Into The Sun\" be better.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi899350809",
        "name": "Out of Reach",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDJjMjBiOTAtMTY4OS00MTQ5LWJjODYtN2IzMWQ0MWY1ZDMzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDJjMjBiOTAtMTY4OS00MTQ5LWJjODYtN2IzMWQ0MWY1ZDMzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:20:36Z",
        "url": "https://www.imdb.com/video/vi899350809/"
    },
    "url": "/title/tt0377100/"
}