{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        },
        {
            "@type": "Person",
            "name": "William Forsythe",
            "url": "/name/nm0001235/"
        },
        {
            "@type": "Person",
            "name": "Jerry Orbach",
            "url": "/name/nm0001583/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 24703,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0027715/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042267/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "R. Lance Hill",
            "url": "/name/nm0377792/"
        }
    ],
    "datePublished": "1991-04-12",
    "description": "The gruesome murder of a Brooklyn Detective will turn the case into a personal vendetta when the deceased's best friend and fellow officer will unleash an all-out attack against a psychotic Mafia enforcer's brutal gang.",
    "director": [
        {
            "@type": "Person",
            "name": "John Flynn",
            "url": "/name/nm0283500/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjU0ZjRjY2MtNTI4MC00Y2IwLThkNzctYjIwYjdlODMyMWJiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "murder of a nude woman,brooklyn new york city,psychopath,bar fight,aikido",
    "name": "Out for Justice",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "casey_choas66"
        },
        "dateCreated": "2002-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102614/"
        },
        "name": "****1/2 out of 5",
        "reviewBody": "For anyone who has seen a Steven Seagal movie you will notice that they all have their own set of pros and cons. Con- Seagal seems to play the same role in each of his movies. Pro- anyone who likes Seagal will find something to like in each of his movies. Con- Everyone who doesn't like Seagal will find nothing of intrest in his movies. With that sais this one ranks amoung Seagals best. Seagal is Gino, a gung-ho cop from Brooklyn who decides to take matters into his own hands when a violent ganster kills his partner, think A Bronx Tale mixed with Hard to Kill and Above the Law for good measure. Gino seems to cause trouble everywhere he goes as he uncovers a ring of corruption and lies that go a lot deeper than Gino had suspected. But with only a shotgun and his fists of steel he dispatches his own kind of street justice on everyone who gets in the way of him finding Richie, the man who killed his partner. There isn't as much martial arts mayhem as in previous Seagal outtings and the fights that are here don't seem as glorified as past Seagal works but nonetheless the violence meter is through the roof, there is a nicely entertianing car chase and there is also an unusually high level of profanity. Even though most of the film is a no brainer, Seagal still finds time to get a postivie message in there when he picks up a dog that someone through out their car window in a garbage bag. The film also ends on a humorous note as Seagal encounters the man who did that to the dog. Seagal has never been the greatest actor but he manages to put some heart into his work here with a suprisingly uplifting story about his father and also gets to crack out a few amusing one-liners. The major downfall here is the miscasting of William Forsythe as Richie who doesn't really live up to the hype that surrounds his character. In the end what we have is a highly entertaining and always thrilling little action/suspense film that fans of Seagal will love and maybe even a few nonfans will get into as well."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1033568537",
        "name": "Out For Justice",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjY4NGZjNDYtNmY5My00OGI4LWIyZTMtZGY3NjZhMzE2MjVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjY4NGZjNDYtNmY5My00OGI4LWIyZTMtZGY3NjZhMzE2MjVmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:20:31Z",
        "url": "https://www.imdb.com/video/vi1033568537/"
    },
    "url": "/title/tt0102614/"
}