{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Douglas Cheek",
            "url": "/name/nm0154877/"
        },
        {
            "@type": "Person",
            "name": "Walter Cronkite",
            "url": "/name/nm0004847/"
        },
        {
            "@type": "Person",
            "name": "Bob McChesney",
            "url": "/name/nm12410705/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6226,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063661/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0129962/"
        }
    ],
    "datePublished": "2004-10-06",
    "description": "Documentary on reported Conservative bias of the Rupert Murdoch-owned Fox News Channel (FNC), which promotes itself as \"Fair and Balanced\". Material includes interviews with former FNC employees and the inter-office memos they pro...",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Greenwald",
            "url": "/name/nm0339254/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyMzI1NDIxMl5BMl5BanBnXkFtZTcwNTg5NDYyMQ@@._V1_.jpg",
    "keywords": "fox news,brainwashing,political bias,media bias,propaganda",
    "name": "Outfoxed: Rupert Murdoch's War on Journalism",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "anhedonia"
        },
        "dateCreated": "2004-10-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0418038/"
        },
        "name": "What liberal media?",
        "reviewBody": "Liberal filmmaker Robert Greenwald's \"Outfoxed\" provides a fascinating insight into the Fox News Channel, which, those who watch it regularly with an open mind realize, really is an extension of the propagandist arm of the Republican Party. \n\nIf you believe that Fox News Channel is actually fair and balanced, then you probably also believe the moon is made of cheese, the war in Iraq actually was crucial to the war on terrorism and that \"a compassionate conservative\" runs the nation.\n\nFNC seems to believe that advocating and promoting rabid nationalism is the news media's responsibility and to that end it spouts the Republican Party and this administration's talking points. There's FNC host Bill O'Reilly damning as un-American anyone who disagrees with the war after it began because, apparently, one cannot voice opposition to the war and support our troops at the same time. And there's FNC cutting off dissenting opinions, fear-mongering (paranoia is patriotic, after all) and exploiting the American flag to make the most blatant of propagandists blush. FNC's motto should be, \"We propagandize because you shouldn't decide.\"\n\nThrough hundreds of hours of research, Greenwald assembled a good array of clips to prove his point that Fox is anything but fair and balanced. We see Neil Cavuto, anchor of FNC's business show, telling a guest, \"assuming the unthinkable happens and that Senator (John) Kerry becomes president...,\" and reporter Carl Cameron telling then-Gov. George W. Bush about how much Cameron's wife enjoys working for the Bush presidential campaign in 2000. Cameron then proceeds to interview Bush for a \"news\" story. That's fair and balanced at Fox. Cameron now covers the Kerry campaign and is the reporter who recently, soon after the first presidential debate in Florida, poked fun of Kerry in a story with fake quotes; the story then wound up on the Fox News Channel's Web site as a legitimate news article. Imagine the furor from conservatives and FNC had this happened about Bush at, say, at CNN or NBC.\n\nWe see O'Reilly completely distorting the views of one guest - the son of a Port Authority worker who was killed on 9/11 - because the young man disagreed with the Bush administration. O'Reilly seems obsessed by this guest, even berating him on air months later. Too bad Greenwald didn't include the clip of O'Reilly promising to apologize if the US found no WMD in Iraq.\n\n\"Outfoxed\" has flaws. Greenwald doesn't interview anyone from FNC - would they have agreed? - or FNC supporters. We do see FNC owner Rupert Murdoch telling Congress his channel employs liberals, but can only name two. Even without thinking about it, I can name more prominent conservatives at CNN, which Republicans accuse of being liberal, though it clearly puts more conservatives on its shows than Fox does liberals.\n\nGreenwald also doesn't differentiate between op-ed talking-heads, such as Cal Thomas, and so-called news anchors, such as Brit Hume. Then again, the line between opinion and news is blurred on FNC. One effective montage shows how FNC anchors use variations of \"some people say\" to spout their own opinion as news. Greenwald uses surveys showing how Hume's evening news show airs, by a 5 to 1 margin, more negative than positive stories on Kerry. If you watch Hume regularly, you will realize how slanted his show is.\n\nLiberal commentators and former Fox News employees and consultants opine on how unbalanced FNC's coverage is. There's former CIA analyst Larry Johnson, a contracted Fox News contributor, who, despite having 8 weeks left on his contract, isn't called back after telling Sean Hannity the war in Iraq would divert attention from the real war on terrorism, an opinion Hannity disagreed with. \n\nBut the most damning evidence against FNC: Internal memos from John Moody, senior VP for news, that show how slanted the coverage is, how FNC promotes the Bush administration and conservative agenda and how a lopsided view of patriotism trumps real news at Fox.\n\nIn one memo, Moody urges staff not to make the 9/11 Commission report into another Watergate. \"This is not 'what did he know and when did he know it' stuff. Remember the fleeting sense of national unity that emerged from this tragedy. Let's not desecrate that,\" Moody wrote. In another, he orders reporters to tout Bush's \"political courage and tactical cunning\" throughout the day. While on Sen. Kerry, Moody urges his staff to concentrate on the \"flip-flops\" and that Kerry's \"perceived disrespect for the military could be more damaging to the candidate than questions about his actions in uniform.\"\n\nWhat's frightening is how blindly FNC's viewers buy into the propaganda, especially when Greenwald points to surveys that show 67 percent of FNC viewers believe there's a link between Saddam Hussein and the 9/11 attacks. It's almost as if they're...dumb dittoheads. It would be nice if more people got their news from varied sources - newspapers, magazines and TV from around the world - instead of relying solely on a news channel that reiterates their beliefs.\n\n\"Outfoxed\" proves that just because FNC says it's fair and balanced doesn't mean it is. Just as saying you're a compassionate conservative doesn't make you one, or saying you're constantly pursuing the truth doesn't make it so, even if you have talent on loan from OxyContin.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0418038/"
}