{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jamel Debbouze",
            "url": "/name/nm0213354/"
        },
        {
            "@type": "Person",
            "name": "Roschdy Zem",
            "url": "/name/nm0954704/"
        },
        {
            "@type": "Person",
            "name": "Sami Bouajila",
            "url": "/name/nm0098793/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3995,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Outside the Law",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0133540/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0314924/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0314936/"
        },
        {
            "@type": "Person",
            "name": "Rachid Bouchareb",
            "url": "/name/nm0098953/"
        },
        {
            "@type": "Person",
            "name": "Olivier Lorelle",
            "url": "/name/nm0520569/"
        }
    ],
    "datePublished": "2010-09-22",
    "description": "A drama about the Algerian struggle for independence from France after WWII.",
    "director": [
        {
            "@type": "Person",
            "name": "Rachid Bouchareb",
            "url": "/name/nm0098953/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Crime",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5NzY0MTkwOV5BMl5BanBnXkFtZTcwNjU4NzcwNA@@._V1_.jpg",
    "keywords": "french algerian war,muslim prostitute,terror bombing,algeria,counter terrorism",
    "name": "Hors la loi",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gradyharp"
        },
        "dateCreated": "2011-07-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1229381/"
        },
        "name": "Days of Glory: Part 2 OUTSIDE THE LAW",
        "reviewBody": "Writer Director Rachid Bouchareb's first view of the Algerian involvement in France's participation in World War II as the extraordinary DAYS OF GLORY from 2006. Now he continues his story of the bravery of the Algerians in OUTSIDE THE LAW (HORS-LA-LOI) using many of the same actors but placed in different roles. This is a fast-paced film that covers a lot of territory and time and gives an insider's view of how the Algerian soldiers and the Algerian people struggled post WW II to gain freedom from French colonization. On many levels the films works well: on the level of character development and audience empathy it stumbles - but doesn't fall. \n\nThe film opens in 1925 when a family in Algeria faces the French representative who informs a family that the government is taking their ancestral land and home: Le père (Ahmed Benaissa), La mère (Chafia Boudraa) and their three sons Saïd, Messaoud and Abdelkader. Understandably devastated they pack their scant belongings and leave. Jump to 1945 and the massacre of Setif, an event that forces the family to disperse: La mère with Saïd (Jamel Debbouze) move to a shantytown for Algerian refugees outside Paris and Saïd becomes involved with organized crime in Pigalle to support his mother (he begins as a pimp, then as a Cabaret owner, and moves into more dangerous activities such as fixed boxing matches, etc). Messaoud (Roschdy Zem) has become a soldier with the French army in the fruitless war in Indochina (Vietnam) and observes as the French retreat that external colonization of a country will always fail because of the inherent patriotism of the indigent people. Abdelkader (Sami Bouajila), because of this participation in the resistance during the Setif Massacre, has been imprisoned in France where he gains insight from his fellow Algerians that they must revolt and fight to regain independence for Algeria. Once reunited Abdelkadan becomes the driving force behind the Algerian's FLN movement. He is the local figurehead and brains, while his brother Messaoud acts as the muscle and bodyguard. Brother Said continues his pursuit of money through shady night clubs and as a boxing promoter, but he is never far from his brothers' sides - even if he isn't quite as politically motivated. The film jumps to the 1950s and the early 1960s following the development of the Algerian resistance as it becomes a murderous group, assassinating the French officials and police, engaging in fierce gun battles, all the while under the malicious eye of their nemesis Colonel Faivre (Bernard Blancan). As deaths in the family occur the family dwindles but always with the promise to each other that Algeria will gain its independence, a fact the is revealed through historic film footage from 1962. \n\nThe film is a tense reenactment of battles and crime scenes, but there is a problem with the script in detailing the personalities of each of the characters beyond their devotion to Algerian independence. Even a marriage and the birth of a son and the death of the mother fail to substantially affect the three brothers beyond the expected reactions. The actors are all excellent but without the benefit of a script that allows them to offer us unique and meaningful individuals they become tropes. As a viewer remembering the brilliance of Days of Glory this film is strangely uninvolving. There is a sense that Rachid Bouchareb feared condemnation by either the Algerians or the French. Much can be said in favor of that stance: no one is 'right' or 'wrong' in war. But at movie's end we are left oddly outside the emotional aspect of the film that was the key to the success of Days of Glory. In the end this is a very well made and powerful film that answers many questions about the French Algerian conflict few of us understand. \n\nGrady Harp"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A drama about the Algerian struggle for independence from France after WWII, in which three brothers reunite for a common belief. ",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1047238937",
        "name": "Outside the Law",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTkwMDkxNDQ4NF5BMl5BanBnXkFtZTgwNDk0MTczMzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTkwMDkxNDQ4NF5BMl5BanBnXkFtZTgwNDk0MTczMzE@._V1_.jpg",
        "uploadDate": "2010-11-09T13:57:16Z",
        "url": "https://www.imdb.com/video/vi1047238937/"
    },
    "url": "/title/tt1229381/"
}