{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Troy Duffy",
            "url": "/name/nm0240627/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Baxter",
            "url": "/name/nm0062749/"
        },
        {
            "@type": "Person",
            "name": "Chris Brinker",
            "url": "/name/nm0109578/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4562,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0141225/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0158651/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0450533/"
        },
        {
            "@type": "Person",
            "name": "Mark Brian Smith",
            "url": "/name/nm0809242/"
        },
        {
            "@type": "Person",
            "name": "Tony Montana",
            "url": "/name/nm1503390/"
        }
    ],
    "datePublished": "2005-07-08",
    "description": "A documentary on the rise and stumble of Troy Duffy, the bartender-cum-filmmaker who was swept up by Miramax's Harvey Weinstein to turn his script for The Boondock Saints into a feature film.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Montana",
            "url": "/name/nm1503390/"
        },
        {
            "@type": "Person",
            "name": "Mark Brian Smith",
            "url": "/name/nm0809242/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY1MjU0NjE5M15BMl5BanBnXkFtZTYwODAwMTE3._V1_.jpg",
    "keywords": "entertainment documentary,writer director,rise and fall,filmmaker,film industry",
    "name": "Overnight",
    "original_info": {
        "id": "Overnight_2003",
        "name": "Overnight",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aussie Stud"
        },
        "dateCreated": "2004-06-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0390336/"
        },
        "name": "Like being caught in the middle of a very bad argument...",
        "reviewBody": "You know when you get yourself into one of those uncomfortable situations where several people are yelling at each other and you're stuck in the middle feeling awkward? That is what watching this documentary felt like.\n\nThis is a documentary seven years in the making that focuses on an arrogant, naive and very stupid bartender named Troy Duffy. Back in 1997, he literally \"overnight\" became the latest \"rags to riches\" success story in Hollywood where his script \"THE BOONDOCK SAINTS\" was bought by Harvey Weinstein (of Miramax Pictures) and was given the green-light to direct his own feature and provide music from his band for the soundtrack. Harvey was also considering co-owning a bar in West Hollywood with him, and it seemed like everything that Troy had worked hard for his entire life was finally coming to fruition.\n\nWell not really. He could have had it all, but like most stupid people, he wasn't satisfied with what he was given and he demanded more.\n\n Unlike Terry Gilliam's almost-comical \"LOST IN LA MANCHA\" which was plagued with natural disasters, bad scheduling, bad production and bad luck, Troy Duffy played his own hand in sending his dream project into assured failure.\n\nFor Duffy, his biggest enemy was himself. Although this documentary tries to make out Harvey Weinstein as some sort of Hollywood tyrant (which apparently isn't that far from the truth), Duffy was the one who ultimately destroyed his own career and that of his fellow band-mates who were too intimidated to stand up to him and tell him that he was going all about it the wrong way.\n\nFirst of all, Duffy's biggest problem is his attitude. It's BAD. He's one of those people who not only THINKS AND KNOWS that he is RIGHT, but certainly doesn't hold back any feelings when it comes to telling other people that they are wrong (even if they're not). \n\nWatching Duffy mingle with D-list celebrities like Paul Rubens, Patrick Swayze, Jerry O'Connell and Mark Wahlberg was nothing more than deliciously amusing, showing both sides of the industry kissing serious ass.\n\n Even for those who don't even know what this documentary is about, watching him destroy his dream and career is inevitable from the first few minutes when you get to explore his vulgar personality and character. He went into Hollywood with no idea and basically left barely any the wiser.\n\nThe people you feel most sorry for are his band-mates. Although they also had a part to play with the miserable launch of their so-called music career, watching Troy sink them as he tries to pull his imaginary strings in the music industry is a notch below humiliating, not to mention embarrassing. \n\nThe worst part was seeing him trade barbs with that slimy excuse of a man who headed the casting agency, watching them at the Cannes Film Festival revel in the value of the almighty dollar before getting any of their facts straight first. \n\nWhen it said that their album had sold 690 copies in six months (yes you read correctly, 690), there were a few awkward laughs in the audience. I don't think anyone in the audience really knew what to make of Duffy's actions. I felt not only embarrassment for him, but also disgust. He has quite a mouth on him and is not afraid to use it. One scene in particular shows him mouthing off in front his mother (who doesn't seem to be the least bit phased by it), and another scene showing him screaming into the speaker-phone about accusations of being called a liar. Watching it will really make your skin crawl.\n\nIt's hard to say as to who the documentary was trying to prove who the bigger tyrant was - Duffy or Harvey Weinstein. After all, Harvey has the comfort and leisure of being that way as he is a self-made man. Duffy on the other hand isn't. \n\nThere is one bizarre scene in \"OVERNIGHT\" that seemed like it came out of nowhere. It involved the premiere of Duffy's movie at a tiny cinema and his 'attempted' hit-and-run with an automobile that occurred outside. It's almost as if they tried to imply that Harvey Weinstein had ordered a hit on him or something, which only made Duffy look even more stupid.\n\nWhile the conclusion of the documentary shows that the only people who stood by him - his friends, the people he ended up alienating now working in construction or manual labor, you can't help but exit the screening with a bad taste in your mouth and ponder the idea as to whether he has learned anything from all of this.\n\nThere is no question as to whether Duffy has any talent - obviously he does as there seems to be a cult following to the movie \"THE BOONDOCK SAINTS\". However, whether he has learned anything from his experience in BOTH the music and film industry is doubtful. Time will tell with the release of his next project, a sequel to \"THE BOONDOCK SAINTS\". \n\nMy Rating - 9 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A documentary on the rise and stumble of Troy Duffy, the bartender-cum-filmmaker who was swept up by Miramax's Harvey Weinstein to turn his script for The Boondock Saints into a feature film.",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2449064729",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWFmOGZkOGQtYmZkNi00ZjUwLWE4ZmYtZjdmZGYyZTdjMWQxXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWFmOGZkOGQtYmZkNi00ZjUwLWE4ZmYtZjdmZGYyZTdjMWQxXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-05T17:58:06.676Z",
        "url": "https://www.imdb.com/video/vi2449064729/"
    },
    "url": "/title/tt0390336/"
}