{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ozzy Osbourne",
            "url": "/name/nm0005285/"
        },
        {
            "@type": "Person",
            "name": "Zakk Wylde",
            "url": "/name/nm0943711/"
        },
        {
            "@type": "Person",
            "name": "Robert Trujillo",
            "url": "/name/nm0874235/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 332,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094851/"
        },
        {
            "@type": "Person",
            "name": "David Thies",
            "url": "/name/nm1400438/"
        }
    ],
    "datePublished": "2002-06-25",
    "description": "Ozzy Osborne liven in concert!",
    "director": [
        {
            "@type": "Person",
            "name": "Jeb Brien",
            "url": "/name/nm0108879/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkzMzU1MTQxNl5BMl5BanBnXkFtZTcwNDI3NzkxMQ@@._V1_.jpg",
    "keywords": "heavy metal,live performance,concert film",
    "name": "Ozzy Osbourne: Live at Budokan",
    "original_info": {
        "id": "Ozzy Osbourne: Live at Budokan_2002",
        "name": "Ozzy Osbourne: Live at Budokan",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mentalcritic"
        },
        "dateCreated": "2002-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328228/"
        },
        "name": "How do you spell \"beautiful, doomy music\"? O-Z-Z-Y, of course!",
        "reviewBody": "I first saw this concert on DVD a few months ago, and while I was dubious about some of the newer material (I always felt that Down To Earth was a much lazier, more middle-of-the-road recording than its predecessor), the whole performance shows in living colour why Ozzy continues to attract an audience literally ten times the size of that for his imitators or his detractors. He still brings such a vibrant, over-the-top energy to his performance that even his audience can hardly keep up. Far from the doom and gloom black mass that fundies make it out to be, Ozzy's music is a beautiful affirmation not only of the joy of life, but of the joy of being able to think for yourself.\n\nZakk Wylde plays his guitar with the same spontaeneous, hardcore enthusiasm that Ozzy puts into his vocals, and it's no wonder that the two of them have collaborated on three albums that, in spite of their weaknesses, utterly stamp on anything the mainstream can try to put into competition with them. When No More Tears is played during this set, it just shows how utterly beneath Ozzy all the Bible-Belt-approved crap really is... try getting this enthusiasm for singing along with hymns!\n\nRobert Trujillo and Mike Bordin are interesting additions to the band. The music that both of these men have played before is nothing like what Ozzy normally makes. And before you try to tell me the latter was in a band that played a Sabbath cover, don't bother. Mike and guitarist Jim Martin were the only members of that band who could play the song like they'd actually heard it before. Robert really does amazing things with some of the songs that were written before he came to work with Ozzy, too - his bass playing during No More Tears is, dare I say it, even better than that of Michael Inez, who played it on the Live & Loud video.\n\nAll in all, this might not be Ozzy's best live set, but it is one that will continue to ride roughshod over the competition for years to come. However, if you do get this DVD, make sure you get your hands on Live & Loud, too. Both live sets are perfect for whiling away a boring evening, and they will help demonstrate to friends exactly what your DVD player/receiver combination is capable of.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0328228/"
}