{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Laura Linney",
            "url": "/name/nm0001473/"
        },
        {
            "@type": "Person",
            "name": "Topher Grace",
            "url": "/name/nm0333410/"
        },
        {
            "@type": "Person",
            "name": "Marcia Gay Harden",
            "url": "/name/nm0001315/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6398,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071970/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071294/"
        },
        {
            "@type": "Person",
            "name": "Helen Schulman",
            "url": "/name/nm1217860/"
        },
        {
            "@type": "Person",
            "name": "Dylan Kidd",
            "url": "/name/nm1071898/"
        }
    ],
    "datePublished": "2005-02-10",
    "description": "An unfulfilled divorced woman gets the chance to relive her past when she meets a young man who appears to be her high school sweetheart who died many years before.",
    "director": [
        {
            "@type": "Person",
            "name": "Dylan Kidd",
            "url": "/name/nm1071898/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY3MTY0NjQwM15BMl5BanBnXkFtZTcwMTA1MjcyMQ@@._V1_.jpg",
    "keywords": "sex addict,jealousy,sex,knee high boots,painter",
    "name": "P.S.",
    "original_info": {
        "id": "P.S._2004",
        "name": "P.S.",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "film-critic"
        },
        "dateCreated": "2005-02-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0380609/"
        },
        "name": "The Truth about Topher...",
        "reviewBody": "I must admit, I was very surprised by this film. When you see the previews for P.S. it looks as if it is nothing more than a simple romantic comedy of sorts that hints more towards originality than refurbished Hollywood. While there are elements of humor and greatness in this film, the preview can be a bit dissecting. This is a tragedy of sorts. It is the story of a woman still searching for her true self and cannot do that because of tragedy that has constantly fallen upon her during her life. It reminds me of It's A Wonderful Life when George Bailey finally realizes that perhaps he isn't needed anymore in town and decides to end his life. This is where our story somewhat begins with Louise (Laura Linney). While it isn't as dramatic as Jimmy Stewart on a bridge, Linney does give off this aura of depression and pensiveness. Where is her life, why does she continue with this repetitive routine at work, and what is her relationship with others around her are simple questions that become much larger as the film progresses.\n\nWhat really captured me with this film was the utterly beautiful chemistry between Topher Grace and Laura Linney. They really embraced this sense of adventure, comfortability, and fear of the unknown exceptionally well. From the moment that they shared screen time together until the rather poignant ending, I thought that the two of them made an award-winning pair. Topher is growing up quickly in Hollywood and this film should prove that he has the \"chops\" to play with the bigger boys. The same can be said for Linney that continues to prove that she can make movies that redefine the roles of both women in film and involved in film. While I think that her role in this film should have garnered her with an Oscar nomination over the over-hyped lackluster Kinsey. I am still honored to see her getting the praise that she deserves. Her emotions are so raw and real that you can literally get lost in her words and actions while forgetting that you are actually watching a film. I would be hard pressed to be able to name another actress that could do that with the material that she does.\n\nThe rest of the cast in this film supported our two characters with the greatest of ease. This film is the perfect example of small parts making a huge impact on a film. Gabriel Byrne is outstanding in a role that could have been very one-dimensional. He brings depth and almost a bit of \"evil\" to his character that he only helps give Linney that extra push into her climactic ending. The same can be said for Paul Rudd and Marcia Gay Harden whom may seem miscast or at least oddly cast in this film, but both prove with the greatest of ease why they continue to work in Hollywood. It was the strength of the cast that really brought this character study out of the ultimate fate of several others of the same nature. The characters/actors brought this story to life and gave it this unglazed vision of the real world where people struggle with past histories and long for the opportunity to see what life would be like if only one thing would have been different.\n\nThis leads me into my favorite part of the story which was the subtle themes and story that was happening behind the characters/actors. There was more than just one element happening to our characters which helped give so much depth to the story and people. It wasn't just Louise looking for love, but also the chance of a \"what if\" encounter that normally would never happen in your average person's life. I loved all the elements from Byrne's secret, to Harden's indiscretions, to Rudd's dual life that really built a strong point for this story. I felt as if these characters were real and that the elements that were facing them were not built by Hollywood, but instead crafted by the truth of another. That is what made this story work. There wasn't this all-powerful run to the airport at the end, but instead a somber moment that made you reflect back on the rest of the film, dreaming of another chance to watch.\n\nOverall, I really liked this movie. I felt that director Dylan Kidd did a very wonderful and bold job with this film proving that he can handle everything from simple themes to multi-layered moments that will reign supreme in your mind. Linney and Grace's chemistry was outstanding. I watched this film with the words, \"I didn't think it would go this far\" dripping from my mouth. It was different than the previews and overall better. I suggest it to all and hope that you will be able to see the vivid reality that Kidd has painted with his film, P.S.\n\nGrade: ***** out of *****",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2023424281",
        "name": "P.S.",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzNlMzI1NjItMGNjMC00MWJlLThhZmItYzg1NjIxMWYwMGNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzNlMzI1NjItMGNjMC00MWJlLThhZmItYzg1NjIxMWYwMGNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:21:15Z",
        "url": "https://www.imdb.com/video/vi2023424281/"
    },
    "url": "/title/tt0380609/"
}