{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shah Rukh Khan",
            "url": "/name/nm0451321/"
        },
        {
            "@type": "Person",
            "name": "Rani Mukerji",
            "url": "/name/nm0611552/"
        },
        {
            "@type": "Person",
            "name": "Anupam Kher",
            "url": "/name/nm0451600/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13634,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0125539/"
        },
        {
            "@type": "Person",
            "name": "Vijayadan Detha",
            "url": "/name/nm0221880/"
        },
        {
            "@type": "Person",
            "name": "Sandhya Gokhale",
            "url": "/name/nm1598284/"
        },
        {
            "@type": "Person",
            "name": "Amol Palekar",
            "url": "/name/nm0657505/"
        }
    ],
    "datePublished": "2005-06-24",
    "description": "A folk tale - supernatural love story about a ghost who falls in love with a newlywed woman.",
    "director": [
        {
            "@type": "Person",
            "name": "Amol Palekar",
            "url": "/name/nm0657505/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjNmMDJjZWEtMTRjMS00YzMwLWI2NzMtYjY3YjA2NzY3ZWViXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "based on folk tale,ghost,wedding night,village chief,magic",
    "name": "Paheli",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sandhirflora"
        },
        "dateCreated": "2005-07-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0451850/"
        },
        "name": "Paheli-Interesting like a puzzle",
        "reviewBody": "We always talk about the great Indian treasure we have in the form of literature but when it comes to adapting them for films for mass consumption, everybody for some strange reason adopted a ridiculous view that this cannot be commercially viable proposition. Paheli, here not only comes as a whiff of fresh air by being original but also as a tight slap on the face of all such advocates of escapist, masala cinema. Also its not an easy cake-walk for those \"Hollywood (now even other world cinema) DVDs-inspired fools\". Three cheers to Shahrukh for he took a great leap by lending his hands to this film by not just acting in it but also producing it. (Never mind if he is competing with fellow actor Aamir who produced \"Lagaan'). Based on book by Vijay Dan Detha, (it was adapted way back in 1973 by Director Mani Kaul for his film-Duvidha) it has captured everything with grandeur. Is it superfluous or sumptuous? May be to an extent but definitely it did not look like a patch as in cases of our Devdases and Blacks. The mind blowing Art Direction (Munish Sappel), Exotic Locations, Costumes (Shalini Sarna), Jewellery (Tanishq), everything falls seamlessly into place. Cinematography (Ravi K. Chandran) and Visual Efx (Eagle Video Films-Prime Focus) is first rate. The sequence where a ghost morphs into a Crow and then to a Squirrel, followed by a bird and finally a Man is mesmerizing. Rani Mukherji and Mr. Bachchan (in Cameo) are competent as usual. Amol Palekar, the director always delivers, never disappoints and same is the case here in his Ninth Film To top it not only he crafted an aesthetic, wonderful fairy-tale looking folklore but also manages his lead actor to perform wisely within the periphery of character, without going over the top. Look at the different number of expressions Shahrukh has given every time while mumbling same line-\"Phal..Phool Gulabjal\". No doubt a rare achievement. . It has some minus points too; the camel race is not shot well. May be it is difficult to capture and is also redundant. Sequence could have been shorter. Rajpal Yadav's Character is completely unnecessary and could have been avoided. Also can somebody please tell him not to play to the gallery for 'N'th time? Sub plot of Juhi Chawla and Suneil Shetty also has nothing to contribute to the narrative. Songs are too many and mostly out of situation. Also the drama quotient in climax is low, it could have been treated with more impact. Narrative of whole film would be more interesting if they played on subtle humor throughout the film. Nevertheless, all these come across as minor flaws. A word of advice for Shahrukh, stick to such cinema rather than doing those mindless NRI romances, as you will gradually find a rather larger audience never mind if it takes another 2-3 attempts. All in all, in one word the whole viewing experience can be described as \"Phenomenal\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3695753241",
        "name": "Paheli (2005) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmUzOTkwYzEtMDRhNS00NmUxLWFkYTgtNTk4NGE3OGM1NjVhXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmUzOTkwYzEtMDRhNS00NmUxLWFkYTgtNTk4NGE3OGM1NjVhXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-05-07T09:49:45Z",
        "url": "https://www.imdb.com/video/vi3695753241/"
    },
    "url": "/title/tt0451850/"
}