{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Li-hua Chang",
            "url": "/name/nm4555902/"
        },
        {
            "@type": "Person",
            "name": "Adam Cheng",
            "url": "/name/nm0155532/"
        },
        {
            "@type": "Person",
            "name": "Ting Chou",
            "url": "/name/nm1522751/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 264,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "Painted Skin",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074434/"
        },
        {
            "@type": "Person",
            "name": "Cheng Ah",
            "url": "/name/nm0155531/"
        },
        {
            "@type": "Person",
            "name": "King Hu",
            "url": "/name/nm0002254/"
        }
    ],
    "datePublished": "1993-08-18",
    "description": "A roving ghost spirit controlled by Ying Yang the Evil paints her face in the guise of a concubine. Her spirit can only be released by a ghostbusting monk who comes to her rescue.",
    "director": [
        {
            "@type": "Person",
            "name": "King Hu",
            "url": "/name/nm0002254/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjhjM2Y2MzQtNTc1YS00OTFhLTgzNmQtNzgwODhjMGQ4YjY3XkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_.jpg",
    "keywords": "ghost",
    "name": "Hua pi zhi: Yin yang fa wang",
    "original_info": {
        "id": "Painted Skin_1992",
        "name": "Painted Skin",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OllieSuave-007"
        },
        "dateCreated": "2016-01-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104455/"
        },
        "name": "It was a rather good Hong Kong ghost fantasy.",
        "reviewBody": "This is a ghost fantasy set in period times, starring Joey Wang as the spirit You Feng, who is controlled by the evil Demon King. She crosses paths with Wang Hsi-Tzu (Adam Cheng), who invites her to travel with him; he is at first ambivalent she is a ghost. You Feng needs help to reincarnate and as Wang attempts to help her, the Demon King wrecks havoc in his village and possesses his body. Therefore, You Feng seeks the powerful High Monk (Sammo Hung) for assistance.\n\nThis ghost fantasy may not be the conventional ghost comedies you've come to expect from Hong Kong, but it is a somewhat good piece of cinema that is suspenseful and intriguing during certain moments, especially the plot elements of You Feng trying to get her spirits released from the grips of the demon, and the search for the powerful priest who could defeat him.\n\nAdam Cheng and Joey Wang did pretty good as the lead roles, followed-by an equally serviceable job by co-stars Wu Ma, Lau Shun and Sammo Hung. There is also a very nice cameo appearance by Lam Ching-Ying.\n\nThe action choreography was done well and the drama and ghost elements were well-played - not too cheesy and not too sappy. I remembered watching this film with my dad and even he, as a big critique on Hong Kong movies, enjoyed it.\n\nThere are some drawn-out and slow moments in the film, but overall, it's rather entertaining.\n\nGrade B-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0104455/"
}