{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jennifer Jason Leigh",
            "url": "/name/nm0000492/"
        },
        {
            "@type": "Person",
            "name": "Ellen Barkin",
            "url": "/name/nm0000289/"
        },
        {
            "@type": "Person",
            "name": "Stephen Adly Guirgis",
            "url": "/name/nm0012289/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12634,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0107084/"
        },
        {
            "@type": "Person",
            "name": "Todd Solondz",
            "url": "/name/nm0001754/"
        }
    ],
    "datePublished": "2005-01-21",
    "description": "Aviva is thirteen, awkward and sensitive. Her mother Joyce is warm and loving, as is her father, Steve, a regular guy who does have a fierce temper from time to time. The film revolves around her family, friends and neighbors.",
    "director": [
        {
            "@type": "Person",
            "name": "Todd Solondz",
            "url": "/name/nm0001754/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTJkNmUzYzAtMWIxMy00Zjc2LWFjYmUtMGE4MmUzYmVlMDAzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "multiple actors for one character,13 year old girl,13 year old,teenage girl as protagonist,teenage protagonist",
    "name": "Palindromes",
    "original_info": {
        "id": "Palindromes_2005",
        "name": "Palindromes",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chris_Docker"
        },
        "dateCreated": "2005-05-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0362004/"
        },
        "name": "Remember it's only a film . . .",
        "reviewBody": "Palindromes is a film that is set to shock. The themes  abortion, child abuse, Christian fundamentalism, teenage pregnancy  are red rags generally too much at for TV soap operas, or comedy shows like The Office - yet apart from it's x-rated material, Palindromes has a certain amount in common with both of these genres.\n\nIn terms of film-making, it is fairly innovative in technique, although audiences who have tired of director Todd Solondz's previous offerings (which include 'Storytelling' and 'Happiness') may say it is more of the same thing. A central new twist with Palindromes is that the central character  a twelve/thirteen year old girl  is played quite convincingly by a wide array of characters that are physically very different (black/white, obese/skinny, young/old, and in one incarnation even a young boy). They all have an eerie likeness and it is a credit to Solondz that, even without being warned of the device, audiences have barely a second's hesitation in linking up that it is the same person.\n\nAviva (her name is palindromic - spelt the same forwards or backwards) is 12 or 13 years old but has a very strong desire to have a baby. This is presented as quite a core issue with her, rather than a passing whim. Her mother reels between hysterical intolerance and forceful supportiveness, trying to be a 'good mother', feeling inadequate at the job, and making strident attempts to steer her wayward daughter. When Aviva first expresses her wish it's along the lines of wanting lots of babies so she will always have someone to love (she is a sweet and lovable, slightly chubby, black child and the wish is not taken to mean immediate action at this point). When she makes fumbling attempts to realise her aim with a boy about the same age she knows, we start feeling worried, even though the scene is trivialised and offered as humour. Solondz repeatedly tempts us to laugh at or with the characters during tragically gruesome scenes and then feel guilty about it. Aviva doesn't give up, even when we know her quest has become impossible.\n\nOne of the ways we test a proposition is to say, 'what are the exceptions'? Does it apply under all conditions? An Internet psychology test used rapid responses to demonstrate that, even people who think they are not racially prejudiced, still instinctively tend to view black people differently. We have innate prejudices about colour, gender, age, size/obesity that are not easy to overcome. Palindromes, by taking one character and showing her in many physical forms, makes us ask ourselves if we think differently about her situation when we give her a different physical form. If we feel sorry for her in one incarnation but less so (or more so) when her physical appearance is changed, what does that say about us? Similarly, if we make a judgement about a person, or about what is 'best' for a person, would it be the same if we could see into the future or different futures? The film's apparent premise (stated within the movie) is that we are always the same, we can't change, even though we grow older, may have a boob job or sex change, we are fated to be the same person  we always come back to being who we are (a bit like a palindrome, that is spelt the same whether read left to right or right to left). 'How many times can I be born again?' screams a lapsed 'born-again' paedophile later in the movie. Is a person really fated to not be able to change? What might be truer would be to say that it takes a lot for people to change, to overcome natural hubris and unchanging habit  if we are each individually a product of our genes, our environment and our inner will (or 'soul' for religious people), then real change has to be not just more than skin deep but deep enough to overcome external influences and predispositions. (When watching Palindromes, look out for the Wizard of Oz references!) But ultimately Solondz neither philosophises nor moralises  he simply observes. That he observes such controversial, dilemma-ridden and offensive subject matter may provoke constructive thought in some (especially if you think he does it in a caring way) but derision in others. His pessimism is tempered by the fact that he gets away with it  quips Solandz - \"It says something good about mankind and people's discretion that when I walk in the street to pick up my groceries nobody has assaulted me.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3786277145",
        "name": "Palindromes",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWM0NmI4NzUtYjA0NS00ZmYxLWEwYmMtMDM0ZjVmYjQxZDVhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWM0NmI4NzUtYjA0NS00ZmYxLWEwYmMtMDM0ZjVmYjQxZDVhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:34:05Z",
        "url": "https://www.imdb.com/video/vi3786277145/"
    },
    "url": "/title/tt0362004/"
}