{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Boguslaw Linda",
            "url": "/name/nm0511277/"
        },
        {
            "@type": "Person",
            "name": "Daniel Olbrychski",
            "url": "/name/nm0646037/"
        },
        {
            "@type": "Person",
            "name": "Grazyna Szapolowska",
            "url": "/name/nm0843772/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3551,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058649/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043688/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Person",
            "name": "Adam Mickiewicz",
            "url": "/name/nm0585337/"
        },
        {
            "@type": "Person",
            "name": "Jan Nowina-Zarzycki",
            "url": "/name/nm1168605/"
        },
        {
            "@type": "Person",
            "name": "Andrzej Wajda",
            "url": "/name/nm0906667/"
        }
    ],
    "datePublished": "2000-01-21",
    "description": "In the early 1810s, Poles, part of Russia's client state of Lithuania, think independence will come if they join forces with Napoleon when he invades Russia. This unity of purpose, in one district, is undermined by two families, f...",
    "director": [
        {
            "@type": "Person",
            "name": "Andrzej Wajda",
            "url": "/name/nm0906667/"
        }
    ],
    "duration": "PT2H27M",
    "genre": [
        "Drama",
        "History",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgyMTgxMTY2MF5BMl5BanBnXkFtZTcwOTUwNzcyMQ@@._V1_.jpg",
    "keywords": "lithuania,1810s,napoleon bonaparte,poland,based on novel",
    "name": "Pan Tadeusz",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "marcin_kukuczka"
        },
        "dateCreated": "2009-11-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0170351/"
        },
        "name": "Experience for Eyes and Soul",
        "reviewBody": "In the modern times absorbed so much by computers, technology, materialism, it seems that such values like love, patriotism, sense of beauty and quest for the sublime belong to the days of yore, the days of fairies, poets and nobles. Yet, on such occasions like national holidays that usually serve to remind nations of their identities, human thoughts go towards our ancestors, those who created a nation, played a decisive role in what we are and who we are now. And in this very spirit, on November the 11th when my country celebrates the Independence Day, my friends and I have decided to see the significant movie by Andrzej Wajda. It is worth stating here that the film, the action of which takes place in 1811 and 1812, 16 years after Poland was entirely partitioned among Germany, Austria and Russia, is based on the key work of Polish literature --- 12 Books of Verse titled PAN TADEUSZ and written in Paris in the 1830s by the famous Pole Adam Mickiewicz (1798-1855). \n\nThe goals of watching being purely patriotic, the movie appeared to us as convincing, more to say, interesting from the very beginning. However, the experience of the movie was not merely a patriotic awareness that would truly be applied to a limited number of viewers but something much more, something I would like to share with other people no matter what nationality, upbringing, culture they are - a treasure that seems lost in most modern movies yet found in the great effort to craft cinematic productions based on classical literature. Certainly, it is a serious effort to adapt 1800s' romantic verses to the expectations of modern movie buffs...\n\n\"O Lithuania, my country, thou Art \n\nlike good health; I never knew till now \n\nHow precious, till I lost thee.\" \n\n(translation by Kenneth R. Mackenzie)\n\nThat is how PAN TADEUSZ by Adam Mickiewicz begins, that is how PAN TADEUSZ by Andrzej Wajda ends and what is in between? \n\nA great story of courage, love, sensation, uprising, honor, politics (in the times of Napoleon - a great hope for the partitioned Poland), confession and ... reconciliation: something classical, universal, touching, humane, pure and upright. One could indeed enumerate such adjectives... How does it work in practice? On the one hand, we have a particular focus on national identity and duty while, on the other hand, the emphasis is drawn upon particular characters. To view comes young Tadeusz Soplica (Michal Zebrowski) in love with two female characters: one is Zosia (Alicja Bachleda) – a 14-year-old girl of youthful, innocent joys; the other is Telimena (Grazyna Szapolowska) - a lady of extravagant behavior and tastes of luxury. In between come various characters, including impetuous Gerwazy (Daniel Olbrychski), young count-artist Horeszko (Marek Kondrat), and a humble priest Robak (Boguslaw Linda) who hides his secret till the very last hour of his life ... \n\nThe factor that goes with characters and, more specifically, the manner we perceive them is the strongest point of the movie: performances. Although the task to play the roles and say their lines in poem appears to be particularly difficult, most of the cast craft their performances with exceptional flair. It is thanks to them that we all may feel the story go on naturally. Daniel Olbrychski is magnificent as Gerwazy focusing on the aforementioned impetuosity, Boguslaw Linda can be referred to as 'convincing modesty', Ms Szapolowska says her lines with desirable elegance and Michal Zebrowski together with youthful Alicja Bachleda are a fine staff for the couple in love.\n\nSince Mickiewicz payed particular attention to the descriptions of nature, the film does not skip this aspect. It can boast wonderful shots of the green fields, memorable clouds, returning storks, silent forests and beautiful sunsets. Being filmed in an artistic manner, it evokes a unique atmosphere and constitutes a sort of moving painting of idyllic landscapes. The narration by Adam Mickiewicz portrayed by Krzysztof Kolberger adds more importance to it providing the emotions of the author. The brilliant direction by Andrzej Wajda and the musical score by Wojciech Kilar supply a viewer with undeniable experience. Moreover, some scenes remain so intensely in the memory that any sensitive viewer (sensitive to art) will truly be absorbed by watching. Here, I would like to mention famous bear hunting, confession of Jacek Soplica and witty but elegant coffee making sequence. Just a pity there is not a famous mushroom picking tour described widely by Mickiewicz.\n\nIf you asked me what this movie means to me, my answer would be simple: an experience for eyes and soul, great cinema which returns after a period of absence, which returns like the upright storks that long for the sublimity of patriot's homeland.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0170351/"
}