{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gabriel Mann",
            "url": "/name/nm0542759/"
        },
        {
            "@type": "Person",
            "name": "Laurence Mason",
            "url": "/name/nm0556808/"
        },
        {
            "@type": "Person",
            "name": "Murphy Guyer",
            "url": "/name/nm0349881/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 278,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050366/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0200047/"
        },
        {
            "@type": "Person",
            "name": "John G. Young",
            "url": "/name/nm0949714/"
        }
    ],
    "datePublished": "1996-11-07",
    "description": "Seth is a youth with artistic leanings, a fascination with Black pop culture, and a dead-end life in an Adirondack village. He's alternatively sensitive and brutal with Kristen, who wants a sexual relationship that he explosively ...",
    "director": [
        {
            "@type": "Person",
            "name": "John G. Young",
            "url": "/name/nm0949714/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcxMTc4NjgzN15BMl5BanBnXkFtZTcwNTcyNTY1Mw@@._V1_.jpg",
    "keywords": "gay,african american,young love,escaped prisoner,homosexual",
    "name": "Parallel Sons",
    "original_info": {
        "id": "Parallel Sons_1995",
        "name": "Parallel Sons",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Zen Bones"
        },
        "dateCreated": "2004-03-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114089/"
        },
        "name": "Finally- a gay film that's different!",
        "reviewBody": "You can count the number of gay films that have featured black actors as main characters (I actually know of four: two of which were documentaries and two were German films by Fassbinder). That's enough reason to make anyone sit up and take notice of this film even if it were bad. But the sad thing - in correlation to this obscure rating at IMDb - is that this is not a bad film. It's actually quite good. A young white male is having a hard enough time being gay in a rural town, on top of that he is obsessed with Afro-American culture, and African-American men. When a black man does show up on the lam from the law, the white guy takes him in and cares for him (the black man had been shot escaping from the police). This plot is in essence sort of an old-fashioned fairy tale, usually fashioned for a lonely young woman who takes in the misguided but non-dangerous criminal, nourishing him back to health. But despite the rather pat plot (why does the black guy always have to be a criminal?), there is an authenticity to the characters and to the town that surrounds them. You feel their desperation and sense of alienation. It's an old-fashioned movie with a 'modern' sensibility, but it thankfully never gets self-conscious about its black-gay twist. It's too busy being honest to the emotions of the characters (to all the characters - no one in the small town is stereotyped). At a time when gay films are becoming as bland and predictable as Hollywood films, and black films assume there are no black men who are gay, this film is a very bold, original experience."
    },
    "url": "/title/tt0114089/"
}