{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Damien Wayne Echols",
            "url": "/name/nm0248469/"
        },
        {
            "@type": "Person",
            "name": "Melissa Byers",
            "url": "/name/nm0125832/"
        },
        {
            "@type": "Person",
            "name": "Norris Deajon",
            "url": "/name/nm5002306/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9202,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031078/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048671/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        }
    ],
    "datePublished": "2001-03-12",
    "description": "The case of the West Memphis Three, its questionable circumstances and the parties involved are followed up years later.",
    "director": [
        {
            "@type": "Person",
            "name": "Joe Berlinger",
            "url": "/name/nm0075666/"
        },
        {
            "@type": "Person",
            "name": "Bruce Sinofsky",
            "url": "/name/nm0802501/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Documentary",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUwMTQ1MzczN15BMl5BanBnXkFtZTYwMTQxNjA5._V1_.jpg",
    "keywords": "scene of the crime,evidence,west memphis three,west memphis arkansas,triple child murder",
    "name": "Paradise Lost 2: Revelations",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "StevePulaski"
        },
        "dateCreated": "2012-01-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0239894/"
        },
        "name": "Hopefully we find a paradise and it's not as hokey and as gray at the one that has been endured for far too long",
        "reviewBody": "Paradise Lost 2: Revelations picks up just a few years after the original documentary, Paradise Lost: The Child Murders at Robin Hood Hills. During that documentary, we were informed massively about the murders and mutilation of three second graders on May 5, 1993 in West Memphis, Arkansas. The three convicted seemed to be judged by a shady, flawed confession by one of the men and their personal appearances and interests.\n\nThis is not only a sequel to a fantastic documentary, but it's a documentary that sheds light on something very, very frightening; a biased judicial system that reacts on present emotions, unclear evidence (when there hardly is any), and the personalities of the accused. It seemed that the three men were judged more on their likes and interests more than the actual murder. The three men are Damien Echols, now 24, Jessie Misskelley Jr., now 23, and Jason Baldwin, now 21.\n\nThe focus seems less on them and more on the smaller characters incorporated in the large story and the backlash and uproar the original HBO film caused. In the beginning of the documentary, we are acquainted with a local support group made up of people from all over the United States who saw the original Paradise Lost documentary, were outraged, and started their own support club. Three brave adults even came up with the idea to start a website in support of the nicknamed \"West Memphis Three\" (a surprising thing since internet was still pretty new and vague at the time).\n\nThe three people behind the website are shown at numerous points in the film accepting collect calls from prison from Damien Echols and holding a live, somewhat informal chat through their website. Damien is on speakerphone, people in the chat room ask him questions, and another writes down Damien's spontaneous responses as quickly as possible.\n\nJohn Mark Byers, the stepfather to Christopher Byers, one of the three boys mutilated in the woods, is brought to the foreground here. He has got to be one of the most unsettling, eerie, and vicious documentary characters I've ever seen. He speaks in the southern twang you can't ignore, and his six foot eight presence equipped with his strong, muscular build is astonishing. Although he appears to be an upset father about the death of his son, he copes with his anger in a mean-spirited, hateful way. In one scene he goes as far as setting up fake graves for Baldwin, Echols, and Misskelley Jr. and proceeds to douse the graves with lighter fluid before striking a match and incinerating it all.\n\nByers is suspected in being involved in the murders of the three kids, and is victim to much gossip. On one of the boys, I believe Stevie Branch, but I could be wrong, there appears to be a bite mark. The prosecution insists it's a belt buckle imprint, but it impeccably resembles a purposeful bite mark. Oddly enough a few years after the original film's completion, Byers' wife, Melissa, died of \"undetermined\" circumstances.\n\nAgain, despite noted limitations present in the film, directors Joe Berlinger and Bruce Sinofsky seem to have an unprecedented amount of access to everything case related. Sadly, because of the notoriety of the original Paradise Lost, the film has a few more limitations than the first one did. There are some instances where the film goes to a black title card saying Berlinger and Sinofsky were not allowed to film in the designated area at the designated time. Still, the video we do see is provocative, astounding, and shows us more than one may believe.\n\nParadise Lost: The Child Murders at Robin Hood Hills was a strong, turning point in documentary filmmaking because of its unbiased nature and its attitude to \"show it all.\" Paradise Lost 2: Revelations is an impressive and well made documentary as well and it has the power to sway our opinions of the case itself and/or drastically change them. All I can say at this point is that hopefully we find a paradise, and it's not as hokey and as gray at the one that has been endured for far too long by these boys.\n\nStarring: Damien Echols, Jessie Misskelley Jr., and Jason Baldwin. Directed by: Joe Berlinger and Bruce Sinofsky.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0239894/"
}