{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jackie Shroff",
            "url": "/name/nm0006763/"
        },
        {
            "@type": "Person",
            "name": "Anil Kapoor",
            "url": "/name/nm0438463/"
        },
        {
            "@type": "Person",
            "name": "Nana Patekar",
            "url": "/name/nm0007113/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3539,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045585/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106826/"
        },
        {
            "@type": "Person",
            "name": "Vidhu Vinod Chopra",
            "url": "/name/nm0006765/"
        },
        {
            "@type": "Person",
            "name": "Imtiaz Hussain",
            "url": "/name/nm0403960/"
        },
        {
            "@type": "Person",
            "name": "Shivkumar Subramaniam",
            "url": "/name/nm0837000/"
        }
    ],
    "datePublished": "1989-11-03",
    "description": "A man's friend, a police officer, is assassinated by gangsters in broad daylight. He discovers that his elder brother works in the same gang and decides to avenge his friend's death by infiltrating the gang.",
    "director": [
        {
            "@type": "Person",
            "name": "Vidhu Vinod Chopra",
            "url": "/name/nm0006765/"
        }
    ],
    "duration": "PT2H34M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA5ODU4ODU2MV5BMl5BanBnXkFtZTcwMTI3ODgzMQ@@._V1_.jpg",
    "keywords": "death of brother,henchman,betrayal,sex in bed,temple",
    "name": "Parinda",
    "original_info": {
        "id": "Parinda_1989",
        "name": "Parinda",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dreviews16"
        },
        "dateCreated": "2019-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102636/"
        },
        "name": "Un-Bollywood delivery from a Bollywood Movie",
        "reviewBody": "Late 70s and 80s were a time when alternate or parallel cinema entered the Hindi film industry. Shyam Benegal, Saeed Akhtar Mirza, Govind Nihalani, Mahesh Bhatt gave soul to some heart-wrenching narrative and created a cinema which was a long-call from the rosy, sanitized feature bollywood movies. Instead what we saw was dirt within the society, issues like Labour rights, Dowry deaths, Prostitution, Communal violence were dealt with openly and our favorite protagonists had to wrestle not against the stereotypical Bollywood Evil Banker or Industrialist but against the 'system' itself.\n\nIn this time period came along Vidhu Vinod Chopra with two feature movies, 'Sazaye Maut' (1981) and 'Khamosh'(1986). Made without a star-cast to speak of, the movies did not find many takers and despite being a brilliant start to his career they remained largely forgotten, till the internet era introduced them to a larger audience. The experience of making these movies perhaps led to some of the decisions which were reflected in Parinda. This movie which can be called as Realism's Gateway to Bollywood is a weird mix, feeling like a brilliant art-movie at times and a decent Bollywood feature at others. There are sequences of Anil Kapoor-Madhuri Dixit which are filled with rosy, romantic scenarios, while there are scenes between the two brothers or the ones featuring the impeccable Nana Patekar as Anna, which are filled with grim realism usually not present in the other features of the era. Take the plot for example, Prakash's death at the start to Brothers' fate towards the end are not your usual run-of-the mill scenarios in a Bollywood feature of the time. Besides having seen Jackie-Anil in Ram-Lakhan, Karma etc. I was expecting a movie where the heroes eventually trump all odds and win the day in the end.\n\nIt all was too unexpected for me until it dawned that this movie could be called the first place where Vidhu Vinod Chopra started using his own formula of movie-making which show-cased so well in Munnabhai MBBS, 3 Idiots etc.\n\nWe can only guess as to whether the failure of his brilliant Khamosh was the reason behind this approach, but this allowed him to tell his audience otherwise complicated stories in a crisp manner, where songs and some lighthearted sequences keep the story moving on forward, while he tells a tale dealing with issues in the Indian education system (Munnabhai 1, 3 Idiots) or the need for Gandhi's values in today's society. (Munnabhai 2) Here he does the same in a gangster saga of two brothers, where an otherwise decent tale is given both the formulaic Bollywood approach to keep the mainstream audience engrossed, while the gritty sequences dealing with Gang-violence, Anna's troubles and the rift between brothers provide a deeper understanding to the movie.\n\nMadhuri Dixit and Anil Kapoor were brilliant as usual while Jackie Shroff also provides a good support. But it is Nana Patekar's madness which lifts the movie to another level. His genius is scenes during a 'Shraad' scene, where he loses it after seeing fire being lighted. There are also other undercurrents visible within the movie, such as fate of turncoats, Musa's eventual victory over Anna due to his habit of making friends out of enemies. The music in the movie was done well with songs of the movie going on to become some of the popular songs of 90s."
    },
    "url": "/title/tt0102636/"
}