{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Juliet Stevenson",
            "url": "/name/nm0828980/"
        },
        {
            "@type": "Person",
            "name": "Maureen All",
            "url": "/name/nm0019820/"
        },
        {
            "@type": "Person",
            "name": "Gillian Hanna",
            "url": "/name/nm0360204/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 178,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0125717/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062840/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041263/"
        },
        {
            "@type": "Person",
            "name": "Andrea Weiss",
            "url": "/name/nm0918904/"
        }
    ],
    "datePublished": "1996-11-08",
    "description": "Female artists, writers, photographers, designers, and adventurers are settled in Paris between the wars.",
    "director": [
        {
            "@type": "Person",
            "name": "Greta Schiller",
            "url": "/name/nm0771652/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM5NDk3MDI4MF5BMl5BanBnXkFtZTcwNjAzOTYyMQ@@._V1_.jpg",
    "keywords": "colette,f rated,paris france,place name in title,city name in title",
    "name": "Paris Was a Woman",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Sylviastel"
        },
        "dateCreated": "2006-06-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114093/"
        },
        "name": "Remembering the Paris of another time!",
        "reviewBody": "This DVD made me long for Paris of another era and time. It was great to hear Janet Flanner's voice and see her in person. She was an amazing writer and human being. Of course, there was Gertrude Stein and her wife Alice B. Toklas in early home videos. The director and executive producer are also partners personally and professionally. This documentary only shows just a part of their lives in Paris, France during the era of expatriates. It was nice to see Sylvia Beach and hear Adrienne Monniere's voice as well as Stein and Toklas. Of course, Natalie Clifford Barney's housekeeper who was not gay recalls her husband killing partridges and giving them to Toklas. Of course, the map idea helped show the locations. Of course, it was not always as great as it appears to be. There were problems of course not mentioned, Janet lived with Solita Solano but had a lover in the country, Noel Haskings Murphy, and when she was in New York City during the War years took another lover, Natalia Danesi Murphy. After Gertrude's death, Alice was left destitute by the Steins. Before her death, she became a Catholic and was cared for by nuns who showed no judgment regarding her sexual orientation. One of the deleted scenes is worth watching believe me especially the fact that Ernest Hemingway lived with Gertrude Stein and Alice Toklas in their Paris home and was Stein's gopher. I wish there was more of Janet Flanner. I do now believe that Solita was the love of her life and constant domestic partner until she could no longer care for either herself or Janet. Djuna Barnes pronounced Juna also ended as a recluse in New York's Greenwich Village. Somehow, the documentary only shows a positive part of the Parisian life and the complicated relationships between these women and others. Of course, Janet's true love was Paris itself. Sadly, she died in New York City. I am impressed that the documentary does not focus so much on their relationships but the strive to achieve in a new foreign land where they were allowed to grow and prosper as artists.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0114093/"
}