{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jessica Raine",
            "url": "/name/nm3565962/"
        },
        {
            "@type": "Person",
            "name": "David Walliams",
            "url": "/name/nm0909144/"
        },
        {
            "@type": "Person",
            "name": "James Fleet",
            "url": "/name/nm0281424/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2517,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104998/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0545230/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "2015-07-26",
    "description": "Agatha Christie's crime-fighting duo, Tommy and Tuppence Beresford, solve mysteries and search for enemy spies in 1950s Britain.",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGMyZGU3M2EtMjFmNS00NzZiLTkxNjAtM2Q4YjBlOTI0ZDA4XkEyXkFqcGdeQXVyMjExMjk0ODk@._V1_.jpg",
    "keywords": "1950s,tommy and tuppence,detective agency,husband and wife sleuths,tv mini series",
    "name": "Partners in Crime",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "l_rawjalaurence"
        },
        "dateCreated": "2015-09-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3574152/"
        },
        "name": "Leisurely Plotted Remake with Strong B Movie Echoes",
        "reviewBody": "Twenty-four years ago London Weekend Television produced a series based on the Agatha Christie short stories with James Warwick and Francesca Annis in the leading roles, supported by a youthful Reece Dinsdale. Shot mostly on videotape, its principal focus centered on the relationship between the two amateur sleuths, Tommy and Tuppence, and their marital squabbles as they solved a variety of crimes. \n\nIn this more expensively mounted remake, director Edward Hall places far more emphasis on period externals - the fog-bound London streets, the fading Victorian glamor of a Norfolk seaside resort, the endless vista of a deserted beach. As with most BBC examples of the genre, there is a strong emphasis on period detail: antique cars (that almost look too shiny to be in regular use), Denby china, over-stuffed interiors, and oak-paneled pubs. The costumes are also well recreated, even down to the battered hats worn by Tommy (David Walliams) and his uncle Carter (James Fleet). In the \"N or M\" story, we even see a banner above the local town hall, telling us specifically that the action takes place in 1952.\n\nThe plots, as with most Christie adaptations, are preposterous - especially in \"N or M\" we ask ourselves why two part-time sleuths should be engaged on a vital mission to save Britain from destruction by a nuclear bomb. What is more important is to focus on how the adaptations build up suspense and deal with the resolution.\n\nThe plot unfolds at a leisurely pace, with plenty of establishing shots interspersed with comic interludes where Tommy and Tuppence banter with one another. They seem an ideally suited couple, their natural curiosity combining with a tendency to ignore everyone's sound advice and blunder on regardless. They end up in some difficult situations (forming a cliff-hanging coda to episodes one and two of each story), but their instinct for self-preservation carries them through.\n\nStylistically speaking, Hall's production contains strong visual echoes of the British \"B\" movie that flourished during the mid- twentieth century. There are chase-sequences making clever use of light and shade; sequences showing people getting into and out cars and driving out of shot; and interior sequences comprised of shot/reverse shot sequences. This is no bad thing: the detective thriller was a staple of the \"B\" Movie genre. The only real snag is that whereas most \"B\" movies lasted just over an hour, each one of these stories last nearly three hours. Some judicious pruning might have come in useful.\n\nThe dialogue sometimes veers towards the risible, but then it was never Christie's strong point. All in all, the adaptations are pleasantly watchable, even if they don't necessarily erase memories of the earlier version.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Agatha Christie's Partners in Crime",
        "duration": "PT1M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1585558041",
        "name": "Agatha Christie's Partners in Crime",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmE4MmFiNTItYTFlNC00YjZhLWFhZWYtNmM1ZTEzOWQyOGRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmE4MmFiNTItYTFlNC00YjZhLWFhZWYtNmM1ZTEzOWQyOGRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-11-11T07:03:15Z",
        "url": "https://www.imdb.com/video/vi1585558041/"
    },
    "url": "/title/tt3574152/"
}