{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Macaulay Culkin",
            "url": "/name/nm0000346/"
        },
        {
            "@type": "Person",
            "name": "Wilson Cruz",
            "url": "/name/nm0190497/"
        },
        {
            "@type": "Person",
            "name": "Seth Green",
            "url": "/name/nm0001293/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16630,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0088431/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031020/"
        },
        {
            "@type": "Person",
            "name": "Fenton Bailey",
            "url": "/name/nm0047259/"
        },
        {
            "@type": "Person",
            "name": "Randy Barbato",
            "url": "/name/nm0053190/"
        },
        {
            "@type": "Person",
            "name": "James St. James",
            "url": "/name/nm1306654/"
        }
    ],
    "datePublished": "2003-10-17",
    "description": "Based on the true story of Michael Alig, a Club Kid party organizer whose life was sent spiraling down when he bragged on television about killing his drug dealer and roommate.",
    "director": [
        {
            "@type": "Person",
            "name": "Fenton Bailey",
            "url": "/name/nm0047259/"
        },
        {
            "@type": "Person",
            "name": "Randy Barbato",
            "url": "/name/nm0053190/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjZlMWM1MGEtY2M5OS00MWZhLWI1OGUtYTAwY2JlM2U1ZTgwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "gay,homosexual,ketamine,true crime,bare chested male",
    "name": "Party Monster",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "HippieLizzie"
        },
        "dateCreated": "2004-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0320244/"
        },
        "name": "Breathtaking - Green steals the film",
        "reviewBody": "Living in the UK means you very rarely get to see some amazing films. Having read the book I heard about the film and as you do, immediately ordered it to be shipped over, not expecting to find it anywhere near as good as the book. Boy, was I wrong.\n\nMacaulay Culkin as Alig is annoying and my one pet peeve of the film. He just didn't make Michael real to me. His entire performance seemed to scream \"I was a child star, now I'm playing a gay addict! Look at me!\". The role was also written for him and I got the impression that because of this he felt he didn't have to act too hard to be brilliant. He never, despite his attempts, gave Alig another level. The accent didn't add anything to the character and by the end I was left wondering why everybody had loved Michael Alig.\n\nSeth Green on the other hand stole the film from right under Culkin's nose. His performance as James St James was one of the best I have ever seen in my life. He transformed himself until you didn't even realise it was the guy from Buffy you were watching. His mannerisms were spot on and really did St James justice. His voice was not as whiny or non descript as Culkin's, it was simply a prop used by him. His character managed to appear human throughout the entire film and his habit of touching his hair at least once a scene was fabulous. Green deserves an award for such an amazingly real, yet flamboyant performance.\n\nThe supporting cast were also fantastic and each and every person added to the story. The removal of Mavis from the film did annoy me slightly but after a while you forget she was ever there. The costumes, and behaviour of every single Club Kid in this film were fantastic. You really felt as though you were actually watching this happening. Marilyn Manson as Alig's first Superstar Christina was perfect, adding to a character not mentioned a lot in the book.\n\nAll in all an absolutely fabulous film that deserves far far more credit than was given to it. Seth Green really held the film together, showing rare glimpses of humanity amongst all the glitter. Green was perfectly cast and deserves at least some recognition for a fantastic performance. The only downside was Macaulay Culkin, who simply did not shine. He stood back and let the supporting cast, and especially Green turn this into their movie, not his."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Party Monster",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi279904537",
        "name": "Party Monster (2003)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2JkOGMwZjktMjRiYi00YTE4LTlkMTYtN2U2YWM5Njg2NzAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2JkOGMwZjktMjRiYi00YTE4LTlkMTYtN2U2YWM5Njg2NzAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:34:21Z",
        "url": "https://www.imdb.com/video/vi279904537/"
    },
    "url": "/title/tt0320244/"
}