{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Demi Moore",
            "url": "/name/nm0000193/"
        },
        {
            "@type": "Person",
            "name": "Eloise Eonnet",
            "url": "/name/nm0258250/"
        },
        {
            "@type": "Person",
            "name": "Hadrian Dagannaud-Brouard",
            "url": "/name/nm0196718/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3490,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005323/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013875/"
        },
        {
            "@type": "Person",
            "name": "Ron Bass",
            "url": "/name/nm0060103/"
        },
        {
            "@type": "Person",
            "name": "David Field",
            "url": "/name/nm0275914/"
        }
    ],
    "datePublished": "2000-06-02",
    "description": "A psychological romantic thriller where fantasy and reality become indistinguishable for a woman leading a double life in her dreams.",
    "director": [
        {
            "@type": "Person",
            "name": "Alain Berliner",
            "url": "/name/nm0075626/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama",
        "Mystery",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWNkYjYwOWUtNThmZS00YzYwLTk4ZGUtZmY5MTBjNDc1NjMwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "double life,multiple personality,dream,widow,female protagonist",
    "name": "Passion of Mind",
    "original_info": {
        "id": "Passion of Mind_2000",
        "name": "Passion of Mind",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "filmfanatic"
        },
        "dateCreated": "2000-07-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0160644/"
        },
        "name": "A tale of duality",
        "reviewBody": "In Alain Berliner's (Ma Vie en Rose) new film PASSION OF MIND Demi Moore (G.I. Jane) is torn between reality and a dream. When we first meet her she is Marie a mother of two daughters living in the French country side and reviewing books for a stateside paper. She lives as a recluse, pretty much, except for a friend (Sinead Cusack) who helps her deal with personal problems, including the death of her husband. We assume that Marie has some deep emotional problems but it isn't until she goes to sleep that we find out just how deep those problems are. You see, when Marie goes to sleep she dreams she is Marty, a New York literary agent. Marty is single and very independent. She has no children and is very passionate about her work. Marty has no time for relationships and keeps everyone at a safe distance emotionally. But, you can see in her face that she to has a secret. Yes, that's right when Marty goes to sleep at night she dreams she is Marie. Both Marie and Marty are fully aware of the other but neither knows which is dream and which is reality.\n\nIt is here that the story starts to get interesting. Marie meets William (Stellan Skarsgard,) an author whose book Marie panned. William, almost stalking, shows up one day and befriends one of Maries daughters and eventually works his way into Maries heart. Meanwhile, Marty encounters Aaron (William Fichtner,) an accountant doing business with her firm, who has an immediate attraction to her. And, just like Marie, Marty begins to have feelings for Aaron.\n\nMarie and Marty begin to realize they are in love. But, which one is real? In both lives there are therapists trying to help solve this very problem. Both Marie and Marty can feel each other's love. We, as the viewer, feel it too! Neither woman allows their respective men to get too close, believing something bad may happen if either of them are awakened in the middle of the night. Both women realize that their relationships cannot last like this. They must figure out which is reality and which is dream. If they make the wrong decision all could be lost. We try to decide, as well, which is real and which is dream. It's not until we start to unlock the past that we find out if we have made the right decision.\n\nThe writers (Ron Bass and David Field,) do a great job using the dream world to show how some people deal with traumatic events in their past by suppressing them into their subconscious. Everyone and everything in the dream life represents something significant in the real life past. The cinematography is also wonderful. Eduardo Serra (What Dreams May Come, The Wings of The Dove) shoots the French scenery marvelously making it seem very tranquil, while giving Manhattan a dark, cold and very overwhelming feeling. The director, Berliner, then takes this material and crafts it into a tale of duality, where one woman locks her feelings deep in her own mind and takes them out only in the privacy of her dreams."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A psychological romantic thriller where fantasy and reality become indistinguishable for a woman leading a double life in her dreams.",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1770963737",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDk0ODllN2EtYmMyNS00MGM5LWJiZDktYjY0MTgzZjhlMTdmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDk0ODllN2EtYmMyNS00MGM5LWJiZDktYjY0MTgzZjhlMTdmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-27T19:54:25.731Z",
        "url": "https://www.imdb.com/video/vi1770963737/"
    },
    "url": "/title/tt0160644/"
}