{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Gambon",
            "url": "/name/nm0002091/"
        },
        {
            "@type": "Person",
            "name": "Donald Sutherland",
            "url": "/name/nm0000661/"
        },
        {
            "@type": "Person",
            "name": "Alec Baldwin",
            "url": "/name/nm0000285/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3822,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0240889/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Person",
            "name": "Daniel Giat",
            "url": "/name/nm0316417/"
        }
    ],
    "datePublished": "2002-05-18",
    "description": "In the mid 1960s, President Lyndon B. Johnson (Sir Michael Gambon) and his foreign-policy team debate the decision to withdraw from or escalate the war in Vietnam.",
    "director": [
        {
            "@type": "Person",
            "name": "John Frankenheimer",
            "url": "/name/nm0001239/"
        }
    ],
    "duration": "PT2H45M",
    "genre": [
        "Biography",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmQzZWZmYTUtNDZjYS00NmE3LTg0MTMtNWI5YTFhZjEwNTBjXkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "lyndon b. johnson character,visiting a grave,speechwriter,the white house washington d.c.,american politics",
    "name": "Path to War",
    "original_info": {
        "id": "Path to War_2002",
        "name": "Path to War",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sddavis63"
        },
        "dateCreated": "2002-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0218505/"
        },
        "name": "Slow Spiral Of A Nation Into War",
        "reviewBody": "I tuned into this expecting to see something similar to the exciting, tension-filled \"Thirteen Days,\" but these two movies are not at all alike. Even the titles tell the difference. \"Thirteen Days\" (about the Cuban Missile Crisis) is a compact story, while \"Path To War\" deals with events spread out over several years, and as a result moves more slowly and often in much less detail. It is in its own way, however, just as gripping.\n\n\"Path To War\" is the story of the United States during the Lyndon Johnson administration as it spirals into war in Vietnam, almost against its will. Johnson is well portrayed by Michael Gambon, who manages to capture the complex situation the man was facing, both militarily and politically. Johnson, of course, assumed the presidency upon John Kennedy's assassination and inherited Kennedy's decision to increase US involvement in Vietnam. Johnson is constantly pushed by his military officials and Defense Secretary Robert McNamara (Alec Baldwin), a holdover from the Kennedy administration, to take just one more step, to commit just a few more troops, to bomb just a few more targets in order to win the war. Every step fails, which leads to another step being necessary, until Johnson is hopelessly trapped in a war he can't win but that he can't get out of either. Feeling unable to trust the people who had been Kennedy's advisors, Johnson turns to Clark Clifford (a great performance here from Donald Sutherland) who originally opposes increased involvement in Vietnam, but who eventually realizes that the spiral has gone too far to be stopped and becomes an advocate of stepping things up on the grounds that there is nothing left to do but put everything into trying to win. It's a fascinating study of an entire nation; one that carefully avoids the unfortunate stereotype of Johnson as a warmonger, and instead depicts him as desperate to find a way out of this mess; one that just as carefully notes that Johnson didn't create this mess - he inherited it from Kennedy.\n\nThat, of course, is the subplot of the movie. Johnson spends much of the movie (as he spent his presidency) fighting the ghost of John Kennedy and looking over his shoulder at Robert Kennedy, not able to trust those who had been close to the Kennedy's, but unable to simply jettison them.\n\nIt really is fascinating movie, well worth watching. It isn't \"exciting\" in the sense that you'd be on the edge of your seat, but it's gripping and holds your attention well enough. 7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0218505/"
}