{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mîna Tominaga",
            "url": "/name/nm0866697/"
        },
        {
            "@type": "Person",
            "name": "Briony Glassco",
            "url": "/name/nm0322035/"
        },
        {
            "@type": "Person",
            "name": "Julie Ann Taylor",
            "url": "/name/nm0397364/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4323,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Patlabor 2: The Movie",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032110/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136981/"
        },
        {
            "@type": "Person",
            "name": "Kazunori Itô",
            "url": "/name/nm0411872/"
        }
    ],
    "datePublished": "1993-11-05",
    "description": "When a terrorist attack is blamed on the Air Force, Special Vehicle Unit 2 gets caught in the middle of a growing political conflict.",
    "director": [
        {
            "@type": "Person",
            "name": "Mamoru Oshii",
            "url": "/name/nm0651900/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTQwZGJkMWYtZDg2OC00MGQ2LWJjMTktMTNmMzNkZWMyNjJjXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "coup d'etat,police officer,conspiracy,deep state,deception",
    "name": "Kidô keisatsu patorebâ: The Movie 2",
    "original_info": {
        "id": "Patlabor 2: The Movie_1993",
        "name": "Patlabor 2: The Movie",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vkn"
        },
        "dateCreated": "2002-08-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0124770/"
        },
        "name": "An impressive achievement, but not for everyone.",
        "reviewBody": "As with Patlabor 1, there's a facade of misleading marketing around this film. There's a picture of a big robot on the packaging, and any teaser will probably promise you a non-stop mecha blasting fest. This is, simply put, a shameless lie. Patlabor 2 is a political thriller (often likened to a Tom Clancy novel with good reasons), and a very slow, brooding, talky, philosophical one at that. Big robots just happen to exist in it's setting, but their presence in the film is so slight you'll hardly notice them.\n\nWhat you will notice, however, are some wonderful visuals and music, and a story that asks the viewer many daring, insightful questions about the world of today.\n\nThe plot centers around a few terrorist attacks on Tokyo taking place in the winter of 2002 (note that the film was made in 1993). Most of these attacks are really fake, or harmless makebelieve-attacks, but they're enough to create panic and to cause the established sense of security to crumble to bits. Captains Gotoh and Nagumo of the Special Vehicle Units try to unmask the man, and especially the ideas behind these staged attacks. Everything points to a certain Yukihito Tsuge, who's an old familiar of Nagumo.\n\nWhat makes this film special is the way we're given insights into Tsuge's beliefs through the dialogues. The viewer is directly confronted with some very powerful questions. The state of being that we call \"peace\" in the western world - just how peaceful is it really? How fragile is it, and how much do we deserve this relative 'peace' compared to the prices mostly others pay for it? The film is rife with such questions, and they leave a considerable impact on the viewer. I daresay Patlabor 2 is worth it's price alone for being confronted with such thought-provoking issues set to some of the most beautifully haunting images and music ever put on screen.\n\nThe animation is definitely finely-crafted (there's a scene where helicopters swoop over the city who's smoothness has to be seen to be believed), but it's biggest strong point is the way it's all been directed. Slow, sweeping shots of the intricate semi-futuristic cityscape are the order of the day, with many other impressively beautiful shots.\n\n But it's the music that really stole the show for me, with a wonderful use of mostly gentle and haunting melodies. The soundtrack is a true masterpiece, whose tunes will remain with you for a long time after viewing the film. It adds a dimension to the atmosphere that really can't be described very well on paper, so I'll just say it's powerful and beautifully-crafted stuff. The image of snowflakes drifting down onto tanks stationed all over Tokyo while a soft, ghostly melody plays in the background is a good example of the sort of moment where Patlabor 2 shines.\n\n It doesn't shine all the way, though. There are a few flaws to this film, which make it hard to recommend to everybody. The talkiness, for one thing, sometimes really goes over-the-top. Instead of showing you what happened, a pretty important development is sometimes only mentioned in a conversation. This makes it difficult to keep up all the time, especially as the viewer is sometimes assumed to be an expert on political powergames; -\"Some minister has just done something or other, and then this and that happened\" -\"I see... that means so-and-so plans to do yakkity-something...\" Dialogues like that pop up a few times in the film and manage to be pretty unpleasant. Likewise, there's no gentle introduction to Patlabor newcomers, so it's recommended that you've seen at least the first Patlabor movie before tackling this. While the few scenes of how the regular Patlabor cast have gotten on with their lives are fairly unimportant, being at least somewhat familiar with them is a welcome help in following a sometimes overwhelmingly complex film (I mean that in a good way, though ^^).\n\nPatlabor 2 will never be suited to general public tastes, as it's simply too complex, talky and basically 'different' for anyone just seeking some escapist fun. The DragonBall and Akira crowd need not look into this until they've learned to stop referring to the anime medium as 'ménga movies' while mistaking it for a slew of violent cyberpunk slop which they consider 'kewl' or 'kickass' or whatever. Same to the general Hollywood crowd who'd freak out at the idea of a film demanding efforts from the viewer - Patlabor 2 demands lots of efforts, but has something special to reward you with.\n\nPatlabor 2 serves it's doses of food for thought raw, and it takes some effort to swallow them. But I'd say that effort is well worth it. For the unique, powerful atmosphere alone, this is more than worth a look. I guess \"haunting\" is really the most suitable word to describe Patlabor 2's superb feel. It literally does haunt you, with questions about the state of the society we live in that you can't possibly turn a blind eye on (in fact, after the attacks on America in September 2001, Patlabor 2's messages have become ironically up-to-date in their relevance). And a film that achieves such effects so very well deserves to be seen and to be praised. And then there's -that- music. Absolutely brilliant, it makes this film a must-hear as well as a must-see.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2167521049",
        "name": "Trailer [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDI2YjAyYmQtNmM4YS00NzI1LTgzM2YtNzUwYTBlZDFhNjY3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDI2YjAyYmQtNmM4YS00NzI1LTgzM2YtNzUwYTBlZDFhNjY3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-11-26T14:24:16.945Z",
        "url": "https://www.imdb.com/video/vi2167521049/"
    },
    "url": "/title/tt0124770/"
}