{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ashley L. Anderson",
            "url": "/name/nm1950173/"
        },
        {
            "@type": "Person",
            "name": "Pamela Anderson",
            "url": "/name/nm0000097/"
        },
        {
            "@type": "Person",
            "name": "Camille Anderson",
            "url": "/name/nm1026272/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4897,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0178803/"
        },
        {
            "@type": "Person",
            "name": "Pauly Shore",
            "url": "/name/nm0001736/"
        },
        {
            "@type": "Person",
            "name": "Kirk Fox",
            "url": "/name/nm0289105/"
        }
    ],
    "description": "Hollywood's Pauly Shore loses everything, fakes his own death, and gets caught.",
    "director": [
        {
            "@type": "Person",
            "name": "Pauly Shore",
            "url": "/name/nm0001736/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWM2ZmEyODAtMjdjNi00OTFkLTk3NmUtNmU2MDg5ZGI4NWQwXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "2000s,failing career,riches to rags,faked death,los angeles california",
    "name": "Pauly Shore Is Dead",
    "original_info": {
        "id": "Pauly Shore is Dead_2003",
        "name": "Pauly Shore is Dead",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2012-02-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0284674/"
        },
        "name": "Well, At Least It's Better Than Bio-Dome",
        "reviewBody": "Pauly Shore Is Dead (2003) \n\n** (out of 4) \n\nThe entire gimmick of this \"documentary\" is that Pauly Shore realizes that he can't get a job anywhere so the only way to get any respect is to fake his death. After his \"death\" he starts getting talked about as a comic genius but his cover is blown and there's a backlash when people realize he's not really dead. I was twelve years old when Shore's career took off and I must admit that I enjoyed both ENCINO MAN and SON IN LAW. I continued to watch his movies but stuff like IN THE ARMY NOW, JURY DUTY and BIO-DOME were just three of the worst comedies ever made in history so it's good to report that this movie is much better than them. Shore directed, produced, wrote and stars in this comedy that is pretty much a spoof of Hollywood and it tries to answer the question as to why some fall and get back up while others just stay dead. The most amazing thing about this picture is that Shore got an incredible number of stars to line up for cameo appearances and this includes Charlie Sheen, Chris Rock, Tommy Chong, Pamela Anderson, Britney Spears, Todd Bridges, Carson Daly, Ellen DeGeneres, Andy Dick, Snoop Dogg, Dustin Diamond, Fred Durst, Dr. Dre, Corey Feldman, Paris and Nicky Hilton, Clint Howard, Kato Kaelin, Mario Lopez, Tommy Lee, Michael Madsen, Bill Maher, Jason Mewes, Adam Sandler, Tom Sizemore, Jerry Springer, Vince Vaughn, Whoopi Goldberg, Ben Stiller and Sean Penn. Yes, that Sean Penn. The amazing number of cameos here does make you wonder why these friends couldn't have gotten their buddy Pauly into a few more movies. Or, perhaps this was their way of helping and getting him to shut up about asking them to get him into movies. Either way, the end result really isn't anything special as it's clear Shore needed a better writing to whip the story together and make better sense out of it. I'm sure a more talented director could have made a much funnier film but PAULY SHORE IS DEAD works as a minor film that will mainly appeal to those who want to see all these stars and to see what Shore has been up to."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi162464025",
        "name": "Pauly Shore is Dead",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGE2NmI3ZTYtYjc4Zi00OTliLWJhOGEtM2ViM2E3YzkxZmNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGE2NmI3ZTYtYjc4Zi00OTliLWJhOGEtM2ViM2E3YzkxZmNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:34:33Z",
        "url": "https://www.imdb.com/video/vi162464025/"
    },
    "url": "/title/tt0284674/"
}