{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul McCartney",
            "url": "/name/nm0005200/"
        },
        {
            "@type": "Person",
            "name": "Linda McCartney",
            "url": "/name/nm0565371/"
        },
        {
            "@type": "Person",
            "name": "Hamish Stuart",
            "url": "/name/nm0835708/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 61,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Paul Is Live in Concert on the New World Tour",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103515/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0200096/"
        }
    ],
    "datePublished": "1994-03-22",
    "description": "Paul McCartney's \"Off the Ground\" tour features the album tracks, solo work, as well as several Beatle-era classics.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Godley",
            "url": "/name/nm0324137/"
        },
        {
            "@type": "Person",
            "name": "Aubrey Powell",
            "url": "/name/nm0694023/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2M5MmExNTMtMTg2OC00NzFhLTgwM2YtZjI4ZWUzYjMzMTczXkEyXkFqcGdeQXVyMTY1MTcxMzc@._V1_.jpg",
    "name": "Paul Is Live: In Concert on the New World Tour",
    "original_info": {
        "id": "Paul McCartney: Paul is Live in Concert_1993",
        "name": "Paul McCartney: Paul is Live in Concert",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ferbs54"
        },
        "dateCreated": "2012-05-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0401714/"
        },
        "name": "\"Na Na Na Na....\"",
        "reviewBody": "Filmed in the U.S., Australia, New Zealand and France during 1993's New World Tour, \"Paul Is Live\" finds Paul McCartney--aka The Big Macca and, as we used to call him when The Beatles first invaded America, \"The Cute One\"--in high spirits, looking well and healthy and pushing his latest album, \"Off the Ground.\" Here, he is backed by the band that he had formed in 1989: wife Linda on keyboards and vocals; Hamish Stuart on bass, guitar and vocals; Robbie McIntosh on lead guitar and vocals; Paul Wickens on keyboards and vocals; and Blair Cunningham on drums. Contrary to my expectations, this DVD does not document a single McCartney performance, but rather, as mentioned, a whole bunch. And we don't even jump from venue to venue with each successive song; instead, any one selection is likely to be comprised of footage from many different shows! Thus, the film changes from B&W to color, very often, from song line to song line, as do the performers' costumes, naturally, and the venues themselves! It is a bit jarring initially, but to the filmmakers credit, the bits and pieces have been so masterfully cobbled together that the net result is fairly seamless; \"Paul Is Live\" is a total triumph of the editing process. And as for Sir Paul himself (oops...I mean, just Paul; he wouldn't be knighted for another three years), at 51, he seems positively ebullient, and gives a very smiling and high-energy performance at each and every show that is captured for posterity here. What a class act!\n\nAs for the music itself, after a 10-minute film showcasing the history of the Fab 4 as well as various animal atrocities (the latter footage seems to have repulsed many viewers), the concert kicks off with a straightforward rendition of \"Drive My Car,\" accompanied, on the DVD, by shots of, uh, cruising cars. \"Let Me Roll It\" follows, some pretty heavy stuff, with Paul and his fellow guitar slingers elevated by a raised platform. Next up is \"Looking for Changes,\" one of five songs from 1993's \"Off the Ground\"--all of which this listener was unfamiliar with--to be included in this set; a shortish, hard rocker. This song is followed by another from that album, \"Peace in the Neighborhood,\" a likable ditty that I could almost imagine as a Steely Dan song; the band stretches out on this one, and McIntosh gets to give a nice guitar solo. A highly pleasing \"All My Loving\" comes next, and then Paul straps on his acoustic guitar and the band plays semi-unplugged for a good half dozen tunes: \"Good Rockin' Tonight\" (written by blues singer Roy Brown); a ragged but lovely \"We Can Work It Out\"; \"Hope of Deliverance,\" a catchy number from \"OTG\" featuring some nice acoustic picking from Paul; a gorgeous version of \"Michelle\" (but then again, this song is SO gorgeous that I could probably do a winning version by myself in the shower!); \"Biker Like an Icon\" (also from \"OTG\"), featuring solid slide work from McIntosh and shots of Brando from \"The Wild One\"; and an exquisite \"Here, There and Everywhere,\" one of The Beatles' loveliest tunes, arguably, and here played over video shots of Macca signing autographs for his fans, for some obscure reason. \n\nPaul then puts down his guitar and sits down at the piano for the next three songs: \"Magical Mystery Tour,\" suitably accompanied by psychedelic light FX; \"C'mon People\" (the last offering of the night from \"OTG\"), an initially undistinguished tune that nevertheless builds to an impressive finale; and \"Lady Madonna,\" during which Paul tickles the (ebony and) ivories most energetically. A rocking \"Paperback Writer\" follows, with thousands of flashing printed words in the background; a most impressive rendition, although, truth to tell, the modern-day tribute band Fab Faux rocks this one out even better. A winningly sincere performance of \"Penny Lane\" follows, and then Paul goes back to the piano for a very high-energy blast of \"Live and Let Die,\" accompanied at this venue (wherever it might be) by a spectacular light show and fireworks display. A smokin' interpretation of Leiber and Stoller's \"Kansas City\" is up next, featuring Paul's most frenetic vocals of the set, and then it's back to the piano seat for Paul, for a very fine version of \"Let It Be,\" featuring another sweet guitar break from Robbie McIntosh. \"Scrambled Eggs\"...I mean, \"Yesterday\" features Paul again on acoustic guitar--a short but pleasing version of this, the most covered song in music history--and \"Hey, Jude\" closes the show with Paul back on piano, when he isn't standing to exhort the massive crowd to \"na na na na\" along with him. In all, a very good demonstration of what Paul & Co. were capable of back in 1993. And from what I hear, the Big Macca continues to impress in concert today, almost 20 years later! My only beef with this DVD: no \"Uncle Albert\"?!?!?!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0401714/"
}