{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Affleck",
            "url": "/name/nm0000255/"
        },
        {
            "@type": "Person",
            "name": "Aaron Eckhart",
            "url": "/name/nm0001173/"
        },
        {
            "@type": "Person",
            "name": "Uma Thurman",
            "url": "/name/nm0000235/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 110369,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0819670/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022730/"
        },
        {
            "@type": "Person",
            "name": "Philip K. Dick",
            "url": "/name/nm0001140/"
        },
        {
            "@type": "Person",
            "name": "Dean Georgaris",
            "url": "/name/nm1212988/"
        }
    ],
    "datePublished": "2003-12-25",
    "description": "What seemed like a breezy idea for an engineer to net him millions of dollars, leaves him on the run for his life and piecing together why he's being chased.",
    "director": [
        {
            "@type": "Person",
            "name": "John Woo",
            "url": "/name/nm0000247/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Action",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTczMzU5NDk4MV5BMl5BanBnXkFtZTYwNDQxNzc3._V1_.jpg",
    "keywords": "time,pipe wrench,babe scientist,seeing the future,evil corporation",
    "name": "Paycheck",
    "original_info": {
        "id": "Paycheck_2003",
        "name": "Paycheck",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338337/"
        },
        "name": "Good action but the gimmick is difficult to accept because it continually forces you to accept it",
        "reviewBody": "Michael Jennings is a reverse engineer who, in exchange for big money, takes items apart in order to rebuild them for other companies. After every job his memory is wiped back to the moment he started the job. When he is offered a massive payday to do a three-year job for friend James Rethrick he accepts. Next thing he knows it is three years later and the job done. He goes to collect his money but finds that he has waived his right to it and replaced it with a package full of strange objects. When he is set up with the FBI he goes on the run and realises that the objects are all clues or aids in his mission - a mission that he himself has arranged.\n\nThere's nothing quite like a good action movie that allows you to accept whatever the plot is as it presents good solid action. This film almost manages it and it is ironic that the concept from Dick is what weakens it. The plot is a bit of a stretch but once you accept it you can move on - like Face/Off, once you get the idea and accept it you can enjoy the action. However with Paycheck you are only left alone for 10 minutes before you have to accept the stretched plot all over again. Every time an item perfectly fits a situation you have to accept the whole concept over again. The problem is that the items are far too specific. With the lottery number strip it works, however with the paperclip and the bullet it is too much of a stretch and took the enjoyment off the action a bit.\n\nHappily it is only a bit. The plot as an idea works pretty well but has been done better elsewhere (Bourne Identity and Total Recall for example) it is presented too full of holes that appear with the slightest picking. It would have been much better if the items had been bigger in terms of meaning rather than very specific (e.g. the lighter and hairspray), bigger clues and so on would have been better. However the action is still pretty good, not quite classic Woo but full or good touches. The film has a good steady pace to it and it keeps it up for the majority - very quickly getting through the set up and jumping to three years hence. The action is enjoyably slick and makes good use of effects; true, some of the set ups in the scenes is stretched, and some of the stuff about the weapons is just dumb (a fired bullet with it's casing, a bullet being fired by a thick piece of metal etc), however if you can accept the plot then I imagine accepting that Woo often takes style over substance shouldn't be a problem.\n\nThe cast is so-so despite having a surprising amount of famous faces. Affleck is better than usual; because he is quite ordinary he plays an everyman pretty well and it is easy to see him as a `normal' guy. Eckhart is reasonably good but he has limited screen time. It's good to see him in big films like this as he is an interesting guy, but I hope he doesn't just turn off his skills. Giamatti is in the film briefly and is OK comic relief but Thurman has been miscast. She does most of the film pretty well but her early scenes as an expert biologist are laughable she is so inept! The support cast features a really good turn from Feore as well as good roles from Morton and the wonderful Hall - although the roles are practically cameos.\n\nOverall this is an enjoyable little action movie but it is ironic that the story is both interesting and the film's weak point. The items are too specific and, each time Jennings uses one, it forces the audience to accept the unlikely premise all over again. Worth seeing for enjoyable action delivered by a director who recovers some of his form here."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M33S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3399155993",
        "name": "Paycheck",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWEwOWEzZDctM2M5NC00YTcwLTg1MjYtYzMwMjc4N2E5NGJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWEwOWEzZDctM2M5NC00YTcwLTg1MjYtYzMwMjc4N2E5NGJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:22:36Z",
        "url": "https://www.imdb.com/video/vi3399155993/"
    },
    "url": "/title/tt0338337/"
}