{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Ament",
            "url": "/name/nm0024610/"
        },
        {
            "@type": "Person",
            "name": "Matt Cameron",
            "url": "/name/nm0131674/"
        },
        {
            "@type": "Person",
            "name": "Stone Gossard",
            "url": "/name/nm0331600/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1182,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "datePublished": "2001-05-01",
    "description": "\"Pearl Jam: Touring Band 2000\" features twenty-eight full length songs from various cities on the band's 2000 U.S. tour. The video includes live music clips, videos, behind the scenes shots, and more: Live music set list: Long Roa...",
    "duration": "PT2H5M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA4ODk2NjI0NzVeQTJeQWpwZ15BbWU3MDY3NDkzMjE@._V1_.jpg",
    "keywords": "2000s,band,pearl jam,song,backstage",
    "name": "Pearl Jam: Touring Band 2000",
    "original_info": {
        "id": "Pearl Jam: Touring Band 2000_2001",
        "name": "Pearl Jam: Touring Band 2000",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "buscemi-4"
        },
        "dateCreated": "2001-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0277949/"
        },
        "name": "The Ultimate Cure for Pearl Jam Tour Withdrawal",
        "reviewBody": "Well it isn't seeing them in person, but it's pretty close. Anyone who has ever seen them live needs to own this. You will re-live the happiness that you enjoyed that wonderful night when you last saw them. And for anyone who has not been so fortunate as to see them live, you can see for yourself just what you have been missing.\n\nPearl Jam (Jeff Ament, Stone Gossard, Mike McCready, Ed Vedder, and Matt Cameron) open the set (songs taken from different shows from the 2000 tour) with a moving rendition of \"Long Road\" and then proceed through the early setlist rockers \"Corduroy\", \"Grievance\", and \"Animal\". Before \"Given To Fly\", Ed notices a woman who is translating what he says to the crowd in sign language. He invites her on stage for the next song, and then dances with her as the song closes. During the \"Rearviewmirror\" jam, a highlight of any Pearl Jam show, the video cuts from the performing band and shows some kind of distorted image of the band members walking around - like some kind of hallucination. Then as the jam ends, it cuts back to the performance video.\n\nAs the band finishes the first encore with \"Parting Ways\", the camera follows the band as they walk backstage, giving the audience an angle they never see. They return to the stage and rip through Neil Young's \"Rockin in the Free World\". During the song, Ed helps a young boy up on stage. As Ed sings, the boy just keeps on rockin out. During the closing jam, Ed puts the boy on his shoulders and carries him back alongside drummer Matt Cameron. Ed hands the boy some drum sticks and the boy plays along with Matt.\n\nThe DVD extra features are very nice as well. Included are three montages from the European leg of the tour, set to previously unreleased instrumentals. Also included are 3 Matt cam videos (\"Evacuation\", \"Evenflow\", \"In My Tree\") where the camera stays on drummer Matt Cameron for the entire song; as well as music videos for \"Oceans\" and the animated rocker \"Do The Evolution\".\n\nThis DVD is reason enough for any Pearl Jam fan to go out and BUY a DVD player. There is no better way to keep your sanity until the next tour, than with \"Touring Band 2000\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0277949/"
}