{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leon Isaac Kennedy",
            "url": "/name/nm0411531/"
        },
        {
            "@type": "Person",
            "name": "Wilbur 'Hi-Fi' White",
            "url": "/name/nm0925585/"
        },
        {
            "@type": "Person",
            "name": "Thomas M. Pollard",
            "url": "/name/nm0689507/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1160,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0508602/"
        },
        {
            "@type": "Person",
            "name": "Jamaa Fanaka",
            "url": "/name/nm0266668/"
        }
    ],
    "description": "A hitchhiker named Martel Gordone gets in a fight with two bikers over a prostitute, and one of the bikers is killed. Gordone is arrested and sent to prison, where he joins the prison's boxing team in an effort to secure an early ...",
    "director": [
        {
            "@type": "Person",
            "name": "Jamaa Fanaka",
            "url": "/name/nm0266668/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Crime",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjhjMDM4ZDItZGMxNS00YjMxLWI0MzAtYjA4ODllZWQ5MGI3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "prison,boxing,false accusation,convict,drifter",
    "name": "Penitentiary",
    "original_info": {
        "id": "Penitentiary_1979",
        "name": "Penitentiary",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2017-02-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079709/"
        },
        "name": "Fun Prison Flick",
        "reviewBody": "Penitentiary (1979) \n\n** 1/2 (out of 4) \n\nMartel Gordone (Leon Isaac Kennedy) comes to the rescue of a hooker who is being insulted by a couple white trash bikers. A fight breaks out and before long we see Martel in a prison where he quickly draws the wrong type of attention. The prison Lieutenant (Chuck Mitchell) tells him about a boxing contest, which could help him get out.\n\nPENITENTIARY comes from director Jamaa Fanaka and it's certainly one of the strangest but most entertaining prison movies from the decade. I guess you could say that if ROCKY was on crack cocaine and set inside a prison then you'd have something like this movie. There's no question that there are some truly awful performances and some incredibly campy moments scattered throughout the film but at the same time this here just adds to its rather goofy charm.\n\nWhat makes the film so memorable are the actual boxing scenes. There are some pretty wild fights here including an incredible one where Martel must fight his cell mate. This sequence has to be one of the longest and wildest fights that you're ever going to see and it certainly keeps you entertained. A lot of times I don't really like these types of exploitation movies lasting that long but I must admit that the 99-minute running time went by rather quickly.\n\nLeon Isaac Kennedy has become a cult figure over the years and while he wasn't the great actor, he at least has a certainly style and persona that leaps off the screen. He certainly keeps you drawn into the movie and adds a lot of fun. Fans of PORKY'S will also enjoy seeing Mitchell here in a good role.\n\nIf you're looking for class or high art then PENITENTIARY certainly won't be for you but those who like fun trash then dig in."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A hitchhiker named Martel Gordone gets in a fight with two bikers over a prostitute, and one of the bikers is killed. Gordone is arrested and sent to prison, where he joins the prison's boxing team in an effort to secure an early parole and to establish his dominance over the prison's toughest gang.",
        "duration": "PT4M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi227066649",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmUxMDFmZTEtNGIwZC00YTI5LTgwZWYtYzAwZDQyZWJhZmJmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmUxMDFmZTEtNGIwZC00YTI5LTgwZWYtYzAwZDQyZWJhZmJmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-22T00:10:35.013Z",
        "url": "https://www.imdb.com/video/vi227066649/"
    },
    "url": "/title/tt0079709/"
}