{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cary Grant",
            "url": "/name/nm0000026/"
        },
        {
            "@type": "Person",
            "name": "Jeanne Crain",
            "url": "/name/nm0002022/"
        },
        {
            "@type": "Person",
            "name": "Finlay Currie",
            "url": "/name/nm0192958/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6661,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Joseph L. Mankiewicz",
            "url": "/name/nm0000581/"
        },
        {
            "@type": "Person",
            "name": "Curt Goetz",
            "url": "/name/nm0324506/"
        }
    ],
    "description": "Dr. Noah Praetorius falls in love with Debra, a student who finds out that she is pregnant by her old boyfriend.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph L. Mankiewicz",
            "url": "/name/nm0000581/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDA0ODkzMmQtZmEwMy00MjAzLThiYzUtZDRjZTQ2OTY0MTczXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "jealousy,suspicion,private detective,kiss,ex convict",
    "name": "People Will Talk",
    "original_info": {
        "id": "People Will Talk_1951",
        "name": "People Will Talk",
        "year": "1951"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RJBurke1942"
        },
        "dateCreated": "2006-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0043915/"
        },
        "name": "People Will Talk  A comedy of the serious kind",
        "reviewBody": "When you get one of Hollywood's most powerful producers, Darryl F. Zanuck, working with a screenwriter/director, Joseph L. Mankiewicz, then you know you're in for a film that's a cut above the average.\n\nIn this story, Cary Grant is a hugely successful doctor (as Dr Noah Praetorious) with unusual healing practices; Jeanne Crain (as Deborah Higgins) is an aspiring medical student who falls in love with him; the almost legendary Finlay Currie is a mysterious assistant (as Shunderson) to the doctor; another great character actor, Hume Cronyn, plays the devious and deceitful Prof. Elwell; and there is Walter Slezak as Prof. Barker, who provides (with Grant) much of the comedy and witty lines.\n\nThis is an unusual story because it mixes genres: it's a comedy, it's a love story, it's a (double) mystery, and it's a drama. The first genre is provided largely by Cary Grant and Walter Slezak who bounce off each other with some of the best scenes and wittiest lines. The second, of course, is between Cary Grant and Jeanne Crain. The third is provided by Cary Grant and Finlay Currie, Grant being the doctor whose methods are suspect and his past under scrutiny by Prof. Elwell, while Currie is Grant's constant companion  aloof, quiet and almost robotic in his demeanour. But, who really is Shunderson? And the fourth is the drama between Dr Praetorious and Prof. Elwell, as the latter seeks to have the doctor expelled from the clinic and university for malpractice.\n\nWeaving those four elements together into a cohesive plot is no mean feat, but Mankiewicz succeeds brilliantly. The acting is superb, and even Jeanne Crain  not one of my favorites at all  manages to almost overshadow Hume Cronyn in a key scene where there is a battle of wills and words. The real surprise, however, is Finlay Currie who usually appears in biblical and/or historical dramas and who usually is given a lot to say in any of his film appearances. But, not in this one: in fact, he says hardly a word until almost the end, but simply maintains a deceptive and mysterious quietude at the side of Cary Grant. The resolution to that mystery is a tour de force  and with a twist.\n\nEven though I'm not a big comedy fan  it's the most difficult to portray on film  I'm very partial to Mankiewicz and his films. On that basis alone I'd recommend this film for you to see as another in the great tradition of Classic Hollywood Cinema. But, for anybody who likes the debonair Cary Grant, well, what are you waiting for?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Men, maids, morals and more in this trailer for the black and white classic",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2591033113",
        "name": "People Will Talk",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTA3OTRkNjMtNGM4ZC00MGQ1LWFjYTYtOWNiYzAxZDI0OWVjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTA3OTRkNjMtNGM4ZC00MGQ1LWFjYTYtOWNiYzAxZDI0OWVjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:41:19Z",
        "url": "https://www.imdb.com/video/vi2591033113/"
    },
    "url": "/title/tt0043915/"
}