{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fabrice Luchini",
            "url": "/name/nm0524528/"
        },
        {
            "@type": "Person",
            "name": "André Dussollier",
            "url": "/name/nm0244707/"
        },
        {
            "@type": "Person",
            "name": "Solange Boulanger",
            "url": "/name/nm0099446/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1480,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Perceval",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052216/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061460/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024077/"
        },
        {
            "@type": "Person",
            "name": "Éric Rohmer",
            "url": "/name/nm0006445/"
        },
        {
            "@type": "Person",
            "name": "Chrétien de Troyes",
            "url": "/name/nm0873944/"
        }
    ],
    "datePublished": "1979-02-07",
    "description": "The exploits of Sir Perceval, a legendary exemplar of knightly chivalry and one of the champions of King Arthur's Round Table.",
    "director": [
        {
            "@type": "Person",
            "name": "Éric Rohmer",
            "url": "/name/nm0006445/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmNjYWIyYmYtNDc5Yy00ZDM0LWJkMzktZDQ1MTkzNmQ0MTU3XkEyXkFqcGdeQXVyMjMxOTgyNTU@._V1_.jpg",
    "keywords": "12th century,king,king arthur,chivalry,female female kiss",
    "name": "Perceval le Gallois",
    "original_info": {
        "id": "Perceval_1978",
        "name": "Perceval",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2003-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078073/"
        },
        "name": "A magical vision",
        "reviewBody": "Eric Rohmer's Perceval Le Gallois transports us back to the Middle Ages, offering a magical vision of the Grail legend in poetry, music, and simple imagery. The film is set in the time of King Arthur and his roundtable. By using costumes based on religious paintings of the Middle Ages, and sets of miniature gold castles and metallic trees, standing silhouetted in front of a painted canvas backdrop, Rohmer creates a sense of childlike wonder. Though based on an unfinished 12th century novel by Chretien de Troyes, the text has been modernized for modern audiences. Female and male choruses sing the connecting narration in traditional rhyming couplets and, with true theatrical flair, actors speak not only their lines but also the thoughts of the characters. \n\nPerceval (played by Fabrice Luchini in a performance I found to be the film's biggest drawback) is a naïve youth who lives with his mother. When he is awed by his first encounter with a knight, he determines to go to King Arthur's court to become a knight. Securing the blessings of the King, he takes lessons in chivalry from the wise Gornemant de Goort (Raoul Billerey). His adventures and a subplot involving Gawain take up the remainder of the film. Perceval first captures the heart of Blanchefeur (Arielle Dombasle), then those of other fair maidens, always remembering the simple tenets taught to him by Gornemant. With a powerful depiction of the passion of Jesus Christ and an episode involving the Bloody Lance and the Holy Grail, Perceval gives us a modern insight into chivalry, and also allows us to glimpse the underlying mystery of life."
    },
    "url": "/title/tt0078073/"
}