{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lysa Apostle",
            "url": "/name/nm0032139/"
        },
        {
            "@type": "Person",
            "name": "Joanne Baron",
            "url": "/name/nm0056249/"
        },
        {
            "@type": "Person",
            "name": "Morena Baccarin",
            "url": "/name/nm1072555/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1063,
        "ratingValue": 3.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044205/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023874/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005714/"
        },
        {
            "@type": "Person",
            "name": "Michael Rymer",
            "url": "/name/nm0753382/"
        },
        {
            "@type": "Person",
            "name": "L.M. Kit Carson",
            "url": "/name/nm0141281/"
        }
    ],
    "datePublished": "2001-01-26",
    "description": "A week in the lives of a group of models, photographers, agents, reporters, publicists and other characters during a wild modeling show in New York City.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Rymer",
            "url": "/name/nm0753382/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM1Mjc1NTUwNl5BMl5BanBnXkFtZTcwNTQwMzcyMQ@@._V1_.jpg",
    "keywords": "new york city,new york,photographer,modeling,one word title",
    "name": "Perfume",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aimless-46"
        },
        "dateCreated": "2006-02-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0245356/"
        },
        "name": "Unexpectedly Ambitious",
        "reviewBody": "Wow, I never expected to find myself in the position of defending a film like \"Perfume\" which I only watched because Angela Bettis had a small role. But having recently viewed similar fashion industry/magazine films, \"Fashionably LA\" and \"The Intern\", I am unexpectedly well versed in this narrow sub-genre. Coming from that perspective \"Perfume\" is a lyrical masterpiece, both more ambitious and more successful than those two disasters. But since everything is relative this comparison may not translate into anything very useful for the prospective viewer. \n\nFirst on the agenda is a cautionary statement about the trailer, the DVD cover, and the general promotional campaign. The cast is grossly misrepresented. Carmen Electra is given first billing but appears in only one short scene, a wide shot of her talking to Paul Sorvino. Supermodel Estella Warren is highlighted on the promotional poster but is just window dressing in two scenes. The five biggest parts are played by Rita Wilson, Leslie Munn, Joanne Baron, Jared Harris, and Sorvino, none of whom are even mentioned in the promotional materials. \n\nBut promotional misrepresentation, even to this extreme, has no relationship to the quality of the film. What \"Perfume\" has going for it (like Robert Altman's \"Pret a Porter\") is success working on two levels, as a glimpse inside the fashion industry and as a metaphorical extension (of what it reveals) to our day-to-day struggle in the competitive world. Whether we are artists, artisans, robots, or drones; each day is one of struggle with external competitors and internal demons. \n\nHow well the film works for individual viewers will be determined by the identification process, which will naturally be easier for those familiar with the world of high fashion or with other environments where creativity is exploited for profit. \n\nAlthough \"Perfume\" was a scripted film there is considerable improvisation in the performances, with mixed results. For example, Harris and Mariel Hemingway do a photographer/model photo shoot where his improv is excellent and hers is somewhat lame. Although this initially seems like poor directing, on reflection it is more authentic than giving Hemingway carefully scripted lines and a smooth delivery. \n\n\"Perfume\" is recommended for those who might identify with its setting or its themes. The production design, the editing, and the soundtrack are first class. But if you are annoyed rather than challenged by films with an elliptical storytelling technique and many characters you would do well to give this one a wide berth. \n\nThen again, what do I know? I'm only a child.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A week in the lives of a group of models, photographers, agents, reporters, publicists and other characters during a wild modeling show in New York City.",
        "duration": "PT1M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi586793753",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzI2MWJiYjAtMTNkZC00MGRjLTk3NjItM2EwYjc0ZTE2ZmViXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzI2MWJiYjAtMTNkZC00MGRjLTk3NjItM2EwYjc0ZTE2ZmViXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-05T14:59:50.439Z",
        "url": "https://www.imdb.com/video/vi586793753/"
    },
    "url": "/title/tt0245356/"
}