{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Scolari",
            "url": "/name/nm0778642/"
        },
        {
            "@type": "Person",
            "name": "Darren McGavin",
            "url": "/name/nm0569000/"
        },
        {
            "@type": "Person",
            "name": "Catherine Mary Stewart",
            "url": "/name/nm0829252/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 491,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023274/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013021/"
        },
        {
            "@type": "Person",
            "name": "David Obst",
            "url": "/name/nm0643550/"
        }
    ],
    "datePublished": "1991-03-31",
    "description": "In a private school in the U.S. South, Mr. Sanders, a new choirmaster tries to reduce some of the prejudice and hostility of some of the students in his choir. Paul, a bully who feels he should be lead boy, is the worst offender. ...",
    "director": [
        {
            "@type": "Person",
            "name": "Will Mackenzie",
            "url": "/name/nm0533414/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Drama",
        "Family",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM5MjQ2MjQ2OF5BMl5BanBnXkFtZTcwMDE0NzQyMQ@@._V1_.jpg",
    "keywords": "teen movie,prejudice,private school,choir,teacher student relationship",
    "name": "Perfect Harmony",
    "original_info": {
        "id": "Perfect Harmony_1991",
        "name": "Perfect Harmony",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "edwagreen"
        },
        "dateCreated": "2007-08-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102653/"
        },
        "name": "Perfect Harmony- Love of Music Doesn't Cure Racism ***",
        "reviewBody": "The song goes that I'd love to teach the world to sing in perfect harmony. Unfortunately, in the area of racism and segregation, perfect harmony has yet to be achieved.\n\nThis film takes place in a South Carolina elite private school for boys in 1959, when segregation was the in-thing down south. The school supposedly prepares boys to take their place in the world-a world where they will continue to practice segregation.\n\nThe best performance in the film is given by Darren McGavin, the headmaster, who epitomizes the old southern tradition of bigotry. His daughter conveys an absolutely phony southern accent and her attempt to emulate Scarlett O'Hara is outlandish at best.\n\nYou would certainly think that the conflict between the new choirmaster and McGavin would come to the front due to the former's liberal ideas but this really doesn't happen. By the way, who was that brat of a young Klansman who attacks our white hero, Taylor, so viciously? We never find this out.\n\nThe film also deals with the coming friendship of Taylor and a black child, an orphaned grandson of the handyman, played nicely by the usually reliable Moses Gunn. Miscast in the film is Cleavon Little, as the town preacher. His call for justice is made in a voice that sounds too familiar from \"Blazing Saddles\" in 1974.\n\nIt has to be said that the boys exhibit beautiful choir singing.\n\nPaul, the promising student, is consumed by hatred. We see his typical rebelliousness due to being insecure, parents who never come to visit and his trend to sneaking a smoke in private areas.\n\nThe film should be praised for its attempt to wipe out bigotry. Unfortunately, this problem is too big to be conveyed in 1:33 minutes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0102653/"
}