{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kris Kristofferson",
            "url": "/name/nm0001434/"
        },
        {
            "@type": "Person",
            "name": "Marg Helgenberger",
            "url": "/name/nm0001339/"
        },
        {
            "@type": "Person",
            "name": "Ronny Cox",
            "url": "/name/nm0001074/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 583,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132334/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094955/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051008/"
        }
    ],
    "datePublished": "2000-02-27",
    "description": "About the infamous murder of six year old child beauty pageant contestant Jonbenet Ramsey and the hysterical media coverage that made the investigation even more difficult.",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxNjczOTIwOF5BMl5BanBnXkFtZTcwMjQ5OTUxMQ@@._V1_.jpg",
    "keywords": "tv mini series,1990s,boulder,police department,true crime",
    "name": "Perfect Murder, Perfect Town: JonBenét and the City of Boulder",
    "original_info": {
        "id": "Perfect Murder_2000",
        "name": "Perfect Murder",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "manuel-pestalozzi"
        },
        "dateCreated": "2006-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0221768/"
        },
        "name": "Americana",
        "reviewBody": "True crime docu-dramas are interesting because they allow you to get some insight into certain social conditions in a certain part of the world. Seen from that angle, this movie offers quite a lot. The viewers get to know the beautiful scenery of the town of Boulder, Colorado, a place most of us may like to live in. In the movie, it serves as the almost constantly perceptible background to a very sad story, the murder of a little girl. There is no happy ending. The person who committed this atrocious crime is not apprehended and very likely never will be. The movie does not participate in the guessing game. Instead it tries to document the tribulations of a community not used to the widespread attention the crime is given and the ensuing pressure from the media.\n\nWhat makes this story and the movie interesting is the feeling it conveys that there seem to be serious cultural differences within the USA (which I think is little known in my part of the world). The parents of the murdered girl had moved to Boulder from the Southeast not too long before the tragedy. They brought with them a lifestyle which to the people of Boulder might have seemed unusual and strange, and this seems to have furthered suspicions against them. The parents in their turn did not seem to trust their surroundings anymore once the tragedy happened and tried to get back East into safety\" immediately. One can only guess how many misunderstandings this general mistrust might have caused and how this prevented the crime from being solved.\n\nThe acting is very good, all characters are convincing, especially Deirdre Lovejoy as the young detective who is brutally left to her own devices in a very difficult and complicated situation and Sean Whalen as tabloid journalist Jeff Shapiro, a character who seems to be the screen writer's pet and offers some comic relief. The only thing that disturbed me is the title. Perfect Murder? I mean, I can understand the slightly ironic meaning of Perfect Town, but perfect murder, this indicates a criminal act someone profited from without getting punished. Who on earth should profit from the murder of a little girl?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0221768/"
}