{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rachael Blake",
            "url": "/name/nm0086697/"
        },
        {
            "@type": "Person",
            "name": "Robyn Malcolm",
            "url": "/name/nm0539137/"
        },
        {
            "@type": "Person",
            "name": "Madeleine Sami",
            "url": "/name/nm0759819/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1570,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022867/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058298/"
        },
        {
            "@type": "Person",
            "name": "Gaylene Preston",
            "url": "/name/nm0696414/"
        }
    ],
    "datePublished": "2004-02-26",
    "description": "A woman goes home with the best-looking stranger, only to discover she's been kidnapped.",
    "director": [
        {
            "@type": "Person",
            "name": "Gaylene Preston",
            "url": "/name/nm0696414/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5MjM4MTQzNF5BMl5BanBnXkFtZTcwODc2MTgyMQ@@._V1_.jpg",
    "keywords": "kidnapping,stranger,island,f rated,stockholm syndrome",
    "name": "Perfect Strangers",
    "original_info": {
        "id": "Perfect Strangers_2003",
        "name": "Perfect Strangers",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Void"
        },
        "dateCreated": "2005-04-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0325968/"
        },
        "name": "Imperfect strangers in an imperfect movie",
        "reviewBody": "As far as discreet, not noteworthy and surplus to requirements films from 2003 go, Perfect Strangers isn't a bad one. While the film isn't brilliant, or even good really, it's a fair way to spend your time and if you've got ninety minutes free, there's a lot worse things you could be doing with it. Like sticking rusty screwdrivers in your eyes, for example. The film exists in familiar territory, and follows the over-used plot formula of 'man meets woman, takes her home and turns out to be a psycho', but it mixes in elements of other genres and some down right strange ideas, and the result is a somewhat original take on the idea. Of course, most of the originality that is implanted into the plot fails, but you've got to admire a film for at least trying to be original, even if it doesn't completely pull it off. The movie's best moments are when it's doing it's best to be absurd, and it even manages to take on a black comedy feel when the story gets going. Of course, much of it's plotting is illogical or over acted or both; but then again, you could say that's your fault for taking a chance on it.\n\nSam Neil is the headline star of the movie, and does what he usually does. I don't like Sam Neil, I find him boring and I haven't seen many films that feature a truly convincing performance from him. Quite how he managed to achieve something resembling fame from just plodding around the set of whatever movie he's working on is one of cinema's great mysteries...but as long as he stars in movies that make money, I guess we're just going to have to put up with it. I suppose at least this one didn't make much. Neil is out-performed, out-shined and outcast by Rachael Blake, however, who stars alongside him, and like him, doesn't give a very convincing performance. That just goes to show how easy it is to outshine Sam Neil. Perfect Strangers falls down principally on the whole because of it's plotting. While the film is never actually boring, it starts off slow and just as it's about to pick itself up, it falls down again and after it's done this three or four times, it gets very annoying. Don't be too harsh on that front though, it is only ninety minutes long. I don't really recommend this film, but if you've just rented it and now you're on here wondering what it's like; I can tell that it's o.k.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from First Look Home Entertainment",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi128909593",
        "name": "Perfect Strangers",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmZmNWZjYzktNTdkNS00MmZhLWI3NWMtZWM4ZTA0NDdjMDE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmZmNWZjYzktNTdkNS00MmZhLWI3NWMtZWM4ZTA0NDdjMDE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:34:48Z",
        "url": "https://www.imdb.com/video/vi128909593/"
    },
    "url": "/title/tt0325968/"
}