{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Paré",
            "url": "/name/nm0001595/"
        },
        {
            "@type": "Person",
            "name": "Morgan Fairchild",
            "url": "/name/nm0000392/"
        },
        {
            "@type": "Person",
            "name": "John James",
            "url": "/name/nm0416625/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 112,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0225972/"
        },
        {
            "@type": "Person",
            "name": "David Giancola",
            "url": "/name/nm0316151/"
        }
    ],
    "datePublished": "2000-10-24",
    "description": "With police on his trail, escaped psychotic mental patient Vincent takes Terry, a woman in need of help, hostage.",
    "director": [
        {
            "@type": "Person",
            "name": "David Giancola",
            "url": "/name/nm0316151/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWM4NjViZTgtOTU3YS00MTZlLWFlZjctYWYzMTE2ZmIzZWIxXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "hostage,ticking clock,truck,negotiation,siege",
    "name": "Peril",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "NewYorkLondonParisMunich"
        },
        "dateCreated": "2001-01-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0217720/"
        },
        "name": "Ms. Fairchild and Mr. Pare must be nostalgic for the 1980s...",
        "reviewBody": "I found \"Peril\" in my local video shop back in Sofia, Bulgaria. Sure, straight-to-video-in-Bulgaria films tend to be real stinkers, but after the first 15 minutes of the film, I started to think I had found an exception to the rule. Michael Pare is a mental patient who goes on a violent rampage. Meanwhile, Morgan Fairchild is a harried housewife who accompanies her semi-disabled husband on a not-quite-legal treasure hunt. The husband falls into a storm drain and can't get out, and Ms. Fairchild goes for help because the water will start rising soon. So far, so good.\n\nUnfortunately, it's all downhill from here. Ms. Fairchild meets Mr. Pare, who kidnaps her. Pointless mayhem ensues, including crack police sharpshooters (okay, one guy sitting on top of a wobbly van...think he'll miss?), a hostage crisis in a gasoline-soaked grocery store, an old station wagon able to outrun a slew of Vermont police cars, and rising water that threatens the trapped husband (who lies moaning in agony, gripping his broken leg, when the plot requires him to be helpless, but can run with just a slight limp when the plot requires him to be helpful).\n\nBy the 30-minute mark, I found myself shouting helpful advice to the characters, particularly Ms. Fairchild, who must have read only the first few pages of the script before accepting this role (I'm giving her the benefit of the doubt here). By the 60-minute mark, \"Peril\" had crossed the line into the painful-to-watch category.\n\nLet's go back to the husband trapped in the storm drain for a moment. He's too heavy for the wife to lift him, so she goes for help. Now that the water is rising, shouldn't it help him? He can simply float up with the water and pull himself out, right? Nope, in \"Peril,\" the screenplay confuses his situation with the often-used movie crisis in which a person is held/chained down while the water's rising (like in \"Titanic\" or \"Hard Rain\"), and shows us shots of the water rising slowly up and over his body. You're not chained down, pal...use your arms and swim, already!"
    },
    "url": "/title/tt0217720/"
}