{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kyra Sedgwick",
            "url": "/name/nm0001718/"
        },
        {
            "@type": "Person",
            "name": "Parker Posey",
            "url": "/name/nm0000205/"
        },
        {
            "@type": "Person",
            "name": "Fairuza Balk",
            "url": "/name/nm0000103/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3795,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Personal Velocity",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012200/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0098568/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0163116/"
        },
        {
            "@type": "Person",
            "name": "Rebecca Miller",
            "url": "/name/nm0589182/"
        }
    ],
    "datePublished": "2002-12-20",
    "description": "Three women's escapes from their afflicted lives. Each struggles to flee from the men who confine their personal freedom.",
    "director": [
        {
            "@type": "Person",
            "name": "Rebecca Miller",
            "url": "/name/nm0589182/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzMwMDVkNDYtMWQ0MC00MTQ2LWE0NWUtNmE5ZGVjNGY3ZGJjXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "abusive husband,hand job,three stories,female nudity,female topless nudity",
    "name": "Personal Velocity: Three Portraits",
    "original_info": {
        "id": "Personal Velocity_2002",
        "name": "Personal Velocity",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2003-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0295238/"
        },
        "name": "Personal triumph",
        "reviewBody": "This film, directed and written by Rebecca Miller, is a very satisfying experience for a new director who, here, is adapting her own material with a lot of relish and savoir-faire. There's a certain elegance in the way she treats her characters, always respectful, yet incisive. The only complain we could raise is the fact that each story is very short, so when we are still savoring each one, individually, Ms Miller, for reasons of timing, pulls them from under us.\n\nThe first story, Delia, shows a woman's worst fears in being married to a wife beater of the worst kind. She might have had dreams of making a happy home for her family, but her man has another thing in mind. This woman is a step above white trash. She tries hard to get herself together but everything keeps interfering with her independence. Played with gusto by Kyra Sedwick, Delia ends up as a waitress in order to support herself and the children. Her encounter with the bully from the restaurant is an exercise in how low they want her to go, but she comes out a winner.\n\nThe second story, Greta, is the best of the three. With the help of the great Parker Posey, this Greta comes out as the tough woman she wants everyone to think of her, but deep down, inside her, she's a vulnerable and frightened and unfulfilled over achiever. Ms Posey has never shown so many nuances in a performance that is so economic in the terms that are dictated by the length of the story. We get to know more about her than the narrator ever tells us. Every expression on this actress face is true. It's surprising what has been achieved here with the collaboration of the director and the player.\n\nThe last story, Paula, is the weakest. It's all about a very confused young woman who's out on the road to see her parents. She has very deep problems. Along the way she picks up a hitchhiker who stays with her through the trip. Paula is in a voyage of discovering, but little does she know that what she needs is what she has left at home: her Haitian man, who obviously cares a lot about her. As played by Fairuza Balk, she shows the turmoil in her head that only she can resolve.\n\nWe hope Miss Miller's next time out will be very soon because she's got a feel for getting inside her characters and finding angles they didn't even suspect of having.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2611217689",
        "name": "Personal Velocity",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWNhODhmNzAtZDgyMC00NDU1LThlMTMtM2VmZTEyYTBkYmViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWNhODhmNzAtZDgyMC00NDU1LThlMTMtM2VmZTEyYTBkYmViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T05:07:45Z",
        "url": "https://www.imdb.com/video/vi2611217689/"
    },
    "url": "/title/tt0295238/"
}