{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Williams",
            "url": "/name/nm0931437/"
        },
        {
            "@type": "Person",
            "name": "William Finley",
            "url": "/name/nm0278073/"
        },
        {
            "@type": "Person",
            "name": "Jessica Harper",
            "url": "/name/nm0363888/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20389,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029124/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0783026/"
        },
        {
            "@type": "Person",
            "name": "Brian De Palma",
            "url": "/name/nm0000361/"
        },
        {
            "@type": "Person",
            "name": "Louisa Rose",
            "url": "/name/nm0741544/"
        }
    ],
    "datePublished": "1974-11-01",
    "description": "A disfigured composer sells his soul for the woman he loves so that she will perform his music. However, an evil record tycoon betrays him and steals his music to open his rock palace, The Paradise.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian De Palma",
            "url": "/name/nm0000361/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWI5NDk1MDgtYzYwZi00ZmZhLThiN2QtN2U5OGExNTBhOTZhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "cult favorite,black comedy,rock opera,rock 'n' roll,masked man",
    "name": "Phantom of the Paradise",
    "original_info": {
        "id": "Phantom of the Paradise_1974",
        "name": "Phantom of the Paradise",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "redbeard_nv"
        },
        "dateCreated": "2001-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071994/"
        },
        "name": "A long lost, but not forgotten Midnight Movie Classic",
        "reviewBody": "Still playing on double-bills with The Rocky Horror Picture Show in England, Brian DePalma's foray into the psychodelic world of the musical excesses that was the 70's becomes more than just another rock musical. With a fusion of Faust, Dorian Grey, Phantom of the Opera, the Twilight Zone (courtesy of an opening narration by Rod Serling)and Psycho, using multiple camera angles cleaved into split screens, we follow the tragic trials and tribulations of one Winslow Leech (William Findley, the scary side splitting surgeon of DePalma's \"Sisters\"), composer, whose music is stolen by mook henchman Philbin (George Memmoli, Joey Clams of Scorsese's \"Mean Streets\")on the orders of his boss, rock impresario Swan (song writer Paul Williams, in a role that must have had him giddy) to be used in the opening of his new rock palace, The Paradise.\n\nAttempting to get his music back, Winslow befriends a young, up and coming singer called Phoenix (Jessica Harper, who many have accused of being woefully miscast. Watch for her in \"My Favorite Year\"). Beaten by Philbin, set up on drug charges by Swan, subjected to stainless steel dentures because of Swan's own campaign to wipe out dental decay in the penal system, Leech escapes prison upon hearing his music on the radio, breaks into the record factory, and when caught, accidentally has his faced mauled by a hot record press, and sent moaning in pain into the East River.\n\nSwan continues his preps for the opening, using his former 50's doo-wop group, the Juicy Fruits, now a surfer band called The Beach Bums (Later, they become a Kiss-like bunch called The Undead. The band is made up of the same three actors, Archie Hahn, Jeffery Commanor and Harold Oblong. Watch for Hahn in many more films, including \"Innerspace\" as the deadly deliveryman), to perform Winslow's music. A shadowy figure, donning a leather bodysuit, lame lined cape and a hawk-like mask invades the Paradise and starts reeking havoc.\n\nFrom here, all the cliches play out from Phantom of the Opera, but in one absolutely looney twist is the addition of a fay glitter rock star called Beef (Gerrit Graham, singing voice by Ray Kennedy), who delivers a Hitchcock homage that will never let you look at Janet Leigh in the Bates Motel shower the same way ever again. Toss in a bit of Dorian Grey, with a videotape instead of a portrait taking on the years(and we wonder about Dick Clark's never aging profile!), a strange transformation of several musical themes, all familiar but somehow morphed into different personnas, and you have a cult classic on your hands.\n\nThis movie fits into so many different viewer interest groups. First, the DePalma fans, watching his early work before classics like \"Sisters\", \"Carrie\" and \"Dressed To Kill\"; for musicians/soundtrack fanatics, the mutation of a handful of themes into different works, as well as an incidental soundtrack filled with string quartets, classic piano and organ; for movie trivia fans, the appearance of the star of one of DePalma's all time suspense/horror classics as a production associate, not as an actress (I'm not telling you. watch the credits!).\n\nFor the rest of us, a great popcorn night movie that will leave you laughing, tapping your feet and wondering \"Where was I when this movie came out and how did I miss it the first time?\""
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3996434201",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjQ1MTQxMjYtN2I4NS00OTgwLThkYTUtMDBiYTBhNDY5NDc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjQ1MTQxMjYtN2I4NS00OTgwLThkYTUtMDBiYTBhNDY5NDc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-11-28T15:23:04.696Z",
        "url": "https://www.imdb.com/video/vi3996434201/"
    },
    "url": "/title/tt0071994/"
}