{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Phil Collins",
            "url": "/name/nm0002015/"
        },
        {
            "@type": "Person",
            "name": "Bridgette Bryant",
            "url": "/name/nm2319305/"
        },
        {
            "@type": "Person",
            "name": "Brad Cole",
            "url": "/name/nm2319259/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 82,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0111247/"
        }
    ],
    "description": "During his tour to support his hugely successful album 'But Seriously', pop's most famous singing drummer Phil Collins performs songs from his extraordinary solo career.",
    "director": [
        {
            "@type": "Person",
            "name": "James Yukich",
            "url": "/name/nm0950819/"
        }
    ],
    "duration": "PT2H41M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjZhYTdiNzctZTEzYy00OTQzLTk2Y2MtNGQwMGQ0YTU5MGI0XkEyXkFqcGdeQXVyMzY1MDM4MzM@._V1_.jpg",
    "keywords": "live performance,concert film,character name in title",
    "name": "Phil Collins: Seriously Live",
    "original_info": {
        "id": "Phil Collins: Serious Hits Live_1990",
        "name": "Phil Collins: Serious Hits Live",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ccthemovieman-1"
        },
        "dateCreated": "2007-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0824379/"
        },
        "name": "Phil Collins Gives You A Lot Of Bang For Your Buck - Almost Too Much",
        "reviewBody": "Phil Collins gives a long seriously long concert in Berlin, Germany, on July 25, 1990, doing 24 songs! This is one of the longest one-man concert videos I've ever seen. \n\nActually, as good as Collins' songs are, and as good a singer as he is, it's almost too much....at least for one continuous viewing. It's almost three hours of music! I was surprised all of this could fit on a VHS tape. I'm not complaining, just saying it is very hard to sit down and watch this whole thing in one viewing. After the first look, I wound up breaking it into segments, and even skipping a number of songs that didn't have as much appeal as others. That's hard to do on the VHS tape I had, but I assume much easier on the DVD, which I wouldn't mind acquiring one day.\n\nLike all good performers, he has excellent backup help, instrumentally and vocally. The lighting also is very colorful in here which definitely adds tot he view-ability of the concert. You need colors and other visual gimmicks (dry ice, in here), otherwise you're better off with just a CD. Phil, to his credit, is pretty animated, too, which also helps. He is so self-assured that feels comfortable with the huge crowd, even though he doesn't speak their language. (He has to read his German from a sheet of paper.)\n\nAnywhile, like Rod Stewart and others with unlimited energy, Phil just keeps going and going. Although some songs sound very similar, it's still very good, solid music and entertainment. You sure get your money's worth!\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0824379/"
}