{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Salman Khan",
            "url": "/name/nm0006795/"
        },
        {
            "@type": "Person",
            "name": "Abhishek Bachchan",
            "url": "/name/nm0045393/"
        },
        {
            "@type": "Person",
            "name": "Shilpa Shetty Kundra",
            "url": "/name/nm0792908/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2322,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132496/"
        },
        {
            "@type": "Person",
            "name": "Atul Sabharwal",
            "url": "/name/nm1387177/"
        }
    ],
    "datePublished": "2004-08-13",
    "description": "Tamanna Sahni (Shilpa Shetty) is a dedicated staff member of a top advertising agency; her ideas and designs have mainly contributed to the agency's success. She leaves for a college reunion and meets her college sweetheart Rohit ...",
    "director": [
        {
            "@type": "Person",
            "name": "Revathi",
            "url": "/name/nm0720763/"
        }
    ],
    "duration": "PT2H22M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjRlNmNkNTgtYzJmNy00ZWM2LTkzYWItYzQ4Mjk3YjYzMzRkXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "keywords": "love,reunion,hospital,court,advertising agency",
    "name": "Phir Milenge",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jmathur_swayamprabha"
        },
        "dateCreated": "2014-03-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0422950/"
        },
        "name": "AIDS and the hypocritical Indian work culture",
        "reviewBody": "The thing which I universally found in the various offices I remained associated with is the hypocrisy in the office culture. Your bosses / seniors may be having some reasons to punish / harass you but when they actually do it, upon asking the reasons, they seldom furnish the genuine reasons. Once the issue of injustice / harassment is raised by the victimized one, the oppressors cook up stories to justify what they've (unjustly) done without admitting the truth behind that. Shilpa Shetty, Salmaan Khan and Abhishek Bachchan starrer Phir Milenge (2004) made with the backdrop of the curse of the relatively modern disease - AIDS, highlights this phenomena only.\n\nPhir Milenge (we'll meet again) is the story of Tamanna Saahni (Shilpa Shetty) who is a committed career woman, always giving her best shot to her work in the company and contributing significantly to her employer organization's growth. Her boss (Raja Krishnamoorthy) is very happy with her (due to her astounding performance in the company). However destiny lands Tamanna into trouble when she happens to meet her boyfriend Rohit Manchanda (Salmaan Khan) after many years and gets intimate with him.\n\nAfter a few days, she comes to know that she is HIV positive. Supposedly she has been caught by AIDS because of her sexual intimacy with Rohit only who himself must be an AIDS patient. Once this fact is known to others, Tamanna finds herself as expelled from her employer company and almost lonely in the world. The people from her erstwhile employers, mainly her ex-boss, are not speaking out the real reason behind her dismissal which is her being AIDS patient. Instead, they cook up false stories regarding her inefficiency and negligence to work to justify their action.\n\nWhen Tamanna decides to fight against this injustice in the court, almost everybody discourages her terming her case as a very weak one and bound to lose the legal battle. However a young advocate Tarun Anand (Abhishek Bachchan) takes up her case upon getting encouragement from his senior and mentor (Nasser) and then starts the prolonged courtroom drama in which advocate Kalyaani (Meeta Vashisht) is the counsel of her opponents, i.e., the company. Finally, the courage and conviction of Tamanna and her counsel Tarun triumphs and she gets her social respect back by winning the case against the company. However Rohit dies after apologizing to Tamanna.\n\nThis movie has been publicized and talked about as a movie making people aware of AIDS and its disastrous consequences for the affected individual plus being human to the patients. However while watching this movie, I was able to relate to it time and again not on account of the AIDS issue but on account of the hypocritical Indian work culture in which a committed, dedicated and hard-working employee is victimized on account of false reasons. How ungrateful ! How ungrateful it is on the part of the senior officials of an organization when they victimize the person who has shed perspiration, who has burnt midnight oil and who has given his / her 100% to take the organization to the heights of success. \n\nIn the courtroom drama too, it is very emphatically and realistically shown that on one hand, the lawyer of the company (Meeta Vashisht) is trying to trap the aggrieved plaintiff, i.e., Tamanna in her web of words in order to get something from her mouth which may go against her (as is always expected of shrewd and cunning lawyers), on the other, her ex-boss and other associates (being the flatterers of the boss) speak a bunch of lies (under oath) to the court telling stories about Tamanna's negligence to her duties (because the real reason for her dismissal that she's got AIDS, cannot be admitted). How hurting it is for a hard-working, sincere and committed person when his / her toil is negated in this way ! Appears strange ? But true ! Very true in the context of the work culture (unfortunately) prevailing in India.\n\nAnd now for the issue of AIDS. The movie very correctly underscores the fact that the AIDS patients are also human-beings only and just because someone has caught this virus, he / she should not be considered as characterless and treated like a leper. Just like the cases of the transgenders, gays and lesbians; the case of HIV positives also needs to be treated on humanitarian grounds. Everybody has a right to live and his / her rights as a human-being cannot be denied just because he / she is an AIDS patient or having a biological gender abnormality or having offbeat sexual preferences. An employee who was being considered an invaluable asset to the organization till yesterday, is suddenly being considered a burden just because of her disease and since this reason is totally unjustified and unacceptable (especially in the court of law), false reasons are created to be given for her dismissal; this is how our organizations function and strengthen the prejudices of the society towards those who are worthy of sympathy and support in their crisis time.\n\nThe erstwhile heroine of Tamil movies as well as a few Bollywood movies - Revathy, has directed this movie very well However Tamanna's victory in the court case in the climax sounded a bit unconvincing to me but perhaps it was essential to end the movie on a positive note and render an air of hope for future.\n\nShilpa Shetty has delivered the performance of a lifetime in this movie. This actress mainly known for her item numbers, has finally showed in Phir Milenge that she has come of age as an actress. A splendid show from her. Abhishek Bachchan and Salmaan Khan have not shared screen space. Salmaan is in a guest appearance whereas Abhishek has got a meaty role. Both of them have done well. \n\nDespite not being a masterpiece, Phir Milenge deserves a watch by all the sensitive viewers.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0422950/"
}