{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Neil Dudgeon",
            "url": "/name/nm0240072/"
        },
        {
            "@type": "Person",
            "name": "George Anton",
            "url": "/name/nm0031201/"
        },
        {
            "@type": "Person",
            "name": "Boyd Gaines",
            "url": "/name/nm0301305/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 755,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017529/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073726/"
        }
    ],
    "datePublished": "1988-10-02",
    "description": "Stories of the men of the RAF Hornet Squadron during the early days of World War II.",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk2MDQ3OTI0N15BMl5BanBnXkFtZTcwOTUxODAwMQ@@._V1_.jpg",
    "keywords": "battle of britain,world war two,royal air force,1940s,food in title",
    "name": "Piece of Cake",
    "original_info": {
        "id": "Piece of Cake_1988",
        "name": "Piece of Cake",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Silent_Cal"
        },
        "dateCreated": "2012-05-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0157239/"
        },
        "name": "Don't Bleed on the Carpet, Dickie.",
        "reviewBody": "In the very first scene of \"Piece of Cake\", a squadron leader lands his plane in a ditch, and breaks his neck on his way to the ground. Things go from bad to worse: it's September 1939, and Britain and Germany have just declared war. RAF Hornet Squadron's first successful dogfight turns out to be an embarrassing friendly-fire incident. The young pilots' enthusiasm doesn't wane, however, and a new commanding officer soon arrives in a red sports car and immediately orders a bottle of champagne.\n\nIn France the squadron enjoys their comfy château with its full bar and squash court, as well as good food, good wine, and local women. In the air there is much confusion, as the pre-war RAF's tactics are gradually revealed to be inadequate in the face of the veteran German air force. The war heats up, things start to fall apart, and it all ends with the Battle of Britain in September 1940.\n\nThat should give you an idea of the tone and style of \"Piece of Cake\", a six-part miniseries based on Derek Robinson's 1983 novel. Much has been lost on the route from page to screen, including several characters and subplots. That's all right, since there were a lot of them to begin with. The cast fit into their roles smoothly and naturally: Neil Dudgeon plays the bullying Moggy Cattermole with easy charm; Tom Burlinson is the stalwart Australian flight lieutenant; Richard Hope is brilliant as the egg-headed intelligence officer Skull Skelton; and Tim Woodward brings an appropriate air of stubborn romanticism to the aristocratic Squadron Leader Rex.\n\nThere are plenty of vintage aircraft on display for those who like that sort of thing. The Spits are anachronistic, but excusable. You can also see a pair of Spanish-made Messerschmitts standing in for the Germans, and a few other old warbirds in the background. It's a relief to see the real things: not models, not computer-generated, and flying under bridges to boot.\n\nIs it realistic? Is it true to history? Who knows. The survivors of the battle are not likely to appreciate their warts-and-all portrayal, as you'd expect. That's fine. \"Piece of Cake\" does nothing to tarnish their legend, nor does it try to: the idea is to show the heroes of the Battle of Britain as people the audience can understand, and it works. Humor, irony, and tragedy are the stuff of real life. I'd rather have the daunted, wearied, and worn-out men of Hornet Squadron than the cardboard cutouts of myth.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0157239/"
}