{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Fiedler",
            "url": "/name/nm0275835/"
        },
        {
            "@type": "Person",
            "name": "Jim Cummings",
            "url": "/name/nm0191906/"
        },
        {
            "@type": "Person",
            "name": "Ken Sansom",
            "url": "/name/nm0763052/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8209,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0092035/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008970/"
        },
        {
            "@type": "Person",
            "name": "Brian Hohlfeld",
            "url": "/name/nm0389830/"
        },
        {
            "@type": "Person",
            "name": "A.A. Milne",
            "url": "/name/nm0590316/"
        },
        {
            "@type": "Person",
            "name": "Ted Henning",
            "url": "/name/nm0377427/"
        }
    ],
    "datePublished": "2003-03-21",
    "description": "When Piglet comes up missing his Hundred Acre Wood friends use Piglet's own Book of Memories to find him, discovering along the way just how big a role he's played in their lives.",
    "director": [
        {
            "@type": "Person",
            "name": "Francis Glebas",
            "url": "/name/nm0322368/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc5MzE2ODAyOF5BMl5BanBnXkFtZTYwNTcwNDg3._V1_.jpg",
    "keywords": "snow adventure,snow,little boy,animal character name in title,piglet character",
    "name": "Piglet's Big Movie",
    "original_info": {
        "id": "Piglet's Big Movie_2003",
        "name": "Piglet's Big Movie",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2003-09-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0323642/"
        },
        "name": "Piglet's Big Load of Crap.",
        "reviewBody": "\"Piglet's Big Movie\" seems to be another Disney sequel treated with total disrespect and disregard, only this time, it's not straight to video - it's in the theaters. Tigger had his own movie a few years ago (which was a joyful movie filled with a fair amount of humor), so with the success of that film Disney has decided to target a brand new film specifically at Piglet fans, though fans of the classic Piglet may be disappointed, as the new voice of Piglet sounds wholly different, and his size has decreased significantly (he used to be about half the size of Winnie the Pooh, now he's about the size of Pooh's paw).\n\nI've personally always hated Piglet. Pooh's had his own children's book series, his own short films from the mid-sixties, a cartoon series in the nineties, and a complete franchise built upon him. No one can complain he hasn't had his turn in the spotlight. Tigger is the most widely-loved character from the series (and I agree), and so he has had his own movie and is featured in many merchandise tie-ins. None of the other characters have had their own films until now. Quite honestly, many people favor Eeyore over Piglet, and so the next film will probably be \"Eeyore's Big Adventure\" or something. The question is whether we need films based soley upon characters who were never meant to be totally expanded upon in the first place.\n\n\"Piglet's Big Movie\" starts off in the Hundred Acre Wood. Winnie the Pooh (voice of Jim Cummings), Tigger (also Cummings), et al, are working on something and exclude Piglet because he is too small. Piglet, feeling ignored, runs away from home. It is then that the gang reflect on many different adventures they had in which Piglet paid major parts of (although Piglet's feats in \"Pooh's Grand Adventure: The Search for Christopher Robin\" are left unexplored, as that would be ripping off an audience even more than they already are being ripped off).\n\nI realize \"Piglet's Big Movie\" is for children, and in that respect I don't blame Disney for making it. But it is so obvious this film had no thought put into it that it hurts. First off, I watched it with children and they hated it. Second, I know that there are a lot of Piglet fans out there (mainly women) who absolutely adore the character, who wear pirated shirts with irons of Piglet stained on them, and by making this crap they're hurting their chances at respect from big-time fans.\n\nThere isn't any wonder in this film, there isn't anything fresh, to say it is a film entirely about Piglet and his Big Movie is lying. This is a rip-off cash-in that Disney has crafted just to make some extra cash through Piglet fans. They're hurting children and fans alike by making this trash. Midway through this cartoon adventure, a seven-year-old I was watching the movie with said, \"This is stupid.\" She then advised a friend, \"Whatever you do, don't buy 'Piglet's Big Movie,' it's stupid.\" If a seven-year-old has enough cinematic taste to realize \"Piglet's Big Movie\" is a rip-off, Disney may have to remarket their strategy - kids aren't as stupid and devoid of cinematic taste, it seems, as they think.\n\n2/5 stars -\n\nJohn Ulmer"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Buena Vista Home Entertainment",
        "duration": "PT1M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi896466969",
        "name": "Disney Presents Piglet's Big Game",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjg3ZDhhZGYtMWM2Yi00N2NlLTg5ZjMtNWU3MTE5YTk5YmIwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjg3ZDhhZGYtMWM2Yi00N2NlLTg5ZjMtNWU3MTE5YTk5YmIwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-29T03:37:35Z",
        "url": "https://www.imdb.com/video/vi896466969/"
    },
    "url": "/title/tt0323642/"
}