{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Keiko Masuda",
            "url": "/name/nm0557916/"
        },
        {
            "@type": "Person",
            "name": "Mie",
            "url": "/name/nm0625992/"
        },
        {
            "@type": "Person",
            "name": "Jeff Altman",
            "url": "/name/nm0022901/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 124,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059778/"
        }
    ],
    "datePublished": "1980-03-01",
    "description": "A musical variety show starring a popular Japanese musical duo and their comedian sidekick/translator.",
    "genre": [
        "Comedy",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTkyZmRlNDMtZTFkNy00MzYyLWE1NDYtOGY0MjdjMmNmNDIyXkEyXkFqcGdeQXVyMTEwODg2MDY@._V1_.jpg",
    "keywords": "comedian,variety show,nerd,cult tv",
    "name": "Pink Lady",
    "original_info": {
        "id": "Pink Lady and Jeff_1980",
        "name": "Pink Lady and Jeff",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "heckles"
        },
        "dateCreated": "1999-06-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080262/"
        },
        "name": "One of the most astonishing shows I've ever seen...",
        "reviewBody": "...for if TV is indeed a vast wasteland, this was the show found at the lowest elevation near the stagnant alkaline pool. We had world hunger and want in 1980, and NBC could have spent money to solve it, but inexplicably used the funds to put this show on the air for five episodes instead.\n\nDid Fred Silverman ever notice that the ability of Keiko and Mituyo to handle English was minimal at best? Heavily padded out with guest spots to cover this rather blatant shortcoming. (The first show featured as guest star...Sherman Hemsley. Be still my beating heart.)\n\nNot to mention Silverman's failure to consider America was not exactly a massive market for Japanese \"idol music,\" whose appeal to the Japanese is that it is entirely predictable. And yes, Jeff Altman -- with the exception of his own routine in the first show of a certain U.S. President trying to boogie -- is scathingly unfunny.\n\nI watched it out of the car-wreck syndrome, in other words it was so terrible I couldn't stop watching. And oh yes, if you stayed until the end of the show, a bikinied Keiko and Mitsuyo got into a hot tub with Jeff Altman. I guess I was easily bribed back then."
    },
    "url": "/title/tt0080262/"
}