{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Geldof",
            "url": "/name/nm0002097/"
        },
        {
            "@type": "Person",
            "name": "Christine Hargreaves",
            "url": "/name/nm0362959/"
        },
        {
            "@type": "Person",
            "name": "James Laurenson",
            "url": "/name/nm0491190/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 82533,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045569/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0623579/"
        },
        {
            "@type": "Person",
            "name": "Roger Waters",
            "url": "/name/nm0914166/"
        }
    ],
    "datePublished": "1982-09-17",
    "description": "A confined but troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Parker",
            "url": "/name/nm0000570/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Fantasy",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzYwMDZlZDktNGVlMC00OWVlLWI0MTktN2UwNTUxOWI1NjJhXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "drugs,loss of father,cheating wife,alienation,suicidal thoughts",
    "name": "Pink Floyd: The Wall",
    "original_info": {
        "id": "Pink Floyd: The Wall_1982",
        "name": "Pink Floyd: The Wall",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "deathrattleus"
        },
        "dateCreated": "2005-10-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0084503/"
        },
        "name": "I had forgotten that this was the greatest movie ever made",
        "reviewBody": "I recently rented and re-watched Pink Floyd The Wall for the 200th time, and I had forgotten, over the years, why this is my favorite movie. Surprisingly, the reason it is so good has little to do with a rock star having a mental breakdown. Pink being a rock star is almost incidental to the real message of the film. It seems as if director Parker took the initial idea of Pink Floyd's album and ran away with it. The film serves less as a study of one celebrity individual, instead serving as a cinematic indictment of all of our worst aspects as human beings: cruelty, brutality, insanity, herd mentality, fascism--all the most negative traits of twentieth century man are splashed upon the movie screen, as if the Director was asking the audience \"Why?\" This is a film in rebellion against the status quo. Funny then, that it should be driven by the music of a major rock and roll band. But, all in all, that is besides the point. The film of the Wall begins and ends with scenes of oppression by authoritarian figures (police men, skinheads, teachers, etc.)It is almost as if the entire sub textual content of the film is drawing a parallel between the internal alienation of a single individual and the social and global alienation that fostered the cruelties of World War 2, the holocaust, ad infinitum. Pinks degeneration is the degeneration of Everyman, confronted by a world that is (still) spinning increasingly out of control, away from the light, further behind the wall of its own nihilistic will toward self-obliteration. The violence of the imagery, the final \"Trial\", and the psychic attack of the final montage of disturbing images (masked children put into a meat grinder, cartoon teachers becoming hammers, neo-Nazis on a rampage) as the scene fades into a blank grey wall, are grand, satirical, operatic \"Theater of Cruelty\" in a cinematic framework. But it is the final lyric (sung by a repulsive, animated \"Judge\") that puts the entire scope of this picture into focus: \"I sentence you to be EXPOSED before your peers...\" The Judge , of course, is not merely talking to the fictional \"Pink\", but to the viewers of the film, and well, the entire world, for all that, and again, the Director has, seemingly, high jacked the \"rock opera\" format, and used it as a vehicle to ask that ultimate question: why is mankind so mutually interested in its own self-destruction? Why do nations and civilized cultures slide easily into fascistic thinking? How many war orphans are we still, to this day, creating?\n\nI am not, now, a fan of Pink Floyd's music, although all of the music in this film is beyond excellent. Oddly enough, I am the farthest thing from the dope-smoking \"hippy\" that is supposed to be a Pink Floyd fan. I am an Industrial musician and a writer. My favorite music, at this point, is anything by NON, Throbbing Gristle, etc. This film has, over the years though, shaped my own artistic outlook in ways I am probably not even aware of. One does not need to smoke dope, or even be a Pink Floyd fan, to be affected quite deeply by this film. Roger Ebert once said that Star Wars was, to him at least \"a perfect film\". Well, Pink Floyd The Wall, to myself, is a perfect film, whether you are a pothead or no. I have given this film ten stars, but it is a little beyond that. If it was simply a rock movie, it could be rated in a conventional manner. But Allan Parker has done something here that is beyond even the concept of the bestselling album that this movie is based upon. He has crafted a surreal essay on the madness and self-destruction that lurks within the human spirit. And he has created one of the most sobering, angry, and dizzying satirical pieces ever committed to celluloid. In short, this film is a work of sheer, jaundiced brilliance.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from MGM Home Entertainment",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2510554393",
        "name": "Pink Floyd: The Wall",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjFiNzZhMDktZTUxYy00OGM5LWJlNTktZWE5NGI2NzVjMzI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjFiNzZhMDktZTUxYy00OGM5LWJlNTktZWE5NGI2NzVjMzI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T05:09:26Z",
        "url": "https://www.imdb.com/video/vi2510554393/"
    },
    "url": "/title/tt0084503/"
}