{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Inger Nilsson",
            "url": "/name/nm0632227/"
        },
        {
            "@type": "Person",
            "name": "Maria Persson",
            "url": "/name/nm0675627/"
        },
        {
            "@type": "Person",
            "name": "Pär Sundberg",
            "url": "/name/nm0839090/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4979,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Pippi Longstocking",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044017/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100470/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0101134/"
        },
        {
            "@type": "Person",
            "name": "Astrid Lindgren",
            "url": "/name/nm0511807/"
        }
    ],
    "datePublished": "1969-05-09",
    "description": "Pippi Longstocking, a super-strong redheaded little girl, moves into her father's house Villa Villekulla, and has adventures with her next-door neighbors Tommy and Annika in this compilation film of the classic European TV series.",
    "director": [
        {
            "@type": "Person",
            "name": "Olle Hellbom",
            "url": "/name/nm0375224/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTk1MWJmMzEtMTkzYi00MjY3LTkxYjMtYTZmMWYyNDQ5MmNiXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "pippi longstocking character,character name as title,friendship,young boy,young girl",
    "name": "Pippi Långstrump",
    "original_info": {
        "id": "Pippi Longstocking_1974",
        "name": "Pippi Longstocking",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ryuuseipro"
        },
        "dateCreated": "2011-07-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0366905/"
        },
        "name": "Definitely the ultimate Pippi Longstocking movie, though it does its source material no justice!",
        "reviewBody": "This, the first compilation film of the PIPPI LONGSTOCKING TV series (which I reviewed elsewhere here on IMDb), is where most of the world got its first major exposure to Pippi! Especially here in the US, where it has become a children's cult film classic, presented at kiddie matinées, and being played on local television stations in the 70s and early 80s. My older sister remembered these from her childhood!\n\nI don't recall if the movie got released in Sweden, but it was originally compiled and released in West Germany (where the TV series was co-produced), where it's known by Pippi's German name, PIPPI LANGSTRUMPF. One point being that the film uses the German arrangement of Jan Johansson's theme song, \"Here Comes Pippi Longstocking\" (called \"Hey, Pippi Longstocking!\" in Germany) arranged here by Konrad Elfers (who also did the new soundtrack that completely replaces that of Georg Riedel from the Swedish version, although Elfers rearranges some of Riedel's songs from the show). While I prefer Riedel's compositions, Elfers' work is not half bad, either!\n\nHaving seen the entire Olle Hellbom-helmed TV series, starring the wonderful Inger Nilsson in the title role, it overall had a very strong continuity flow, and a lot of great moments in each episode. You only get a fraction of those great moments in this compilation film. The movie essentially takes all of the TV series' best moments, as well as all of its major plot lines, and puts them together, with the intent of making this the one ultimate Pippi Longstocking film. In the process, it makes the sequel PIPPI GOES ON BOARD rather redundant, especially in relation to the book of the same name. (Needless to say, the entire TV series is superbly made up of the first two books, PIPPI LONGSTOCKING and PIPPI GOES ON BOARD, with a few elements from the third book, PIPPI IN THE SOUTH SEAS. Combining the first two books, and usually ending with the latter, seems to be a very popular practice with most adaptations.) This is basically a very condensed version of the TV series, told at a clipped pace. Thus, if you're used to the series as a whole, its impact is somewhat lost in this compilation.\n\nThe English dubbing, supervised by Gordon Zahler, is a mixed bag (but something casual viewers will no doubt get a laugh out of). The voices for Pippi (Nilsson), Tommy (Pär Sundberg), Annika (Maria Persson), and the other children, obviously done by adults, are rarely convincing. Pippi, at times, sounds a little like Velma from SCOOBY-DOO! On the other hand, the adult characters, of course, sound just right. Most amusing is that Pippi's father Captain Longstocking (Beppe Wolgers) is dubbed with an Italian accent! Needless to say, the quality of the dubbing would be greatly improved with PIPPI GOES ON BOARD (where Fred Ladd took over dubbing the rest of the series).\n\nMaybe I'm being unfair to this film. Is it recommendable? Yes! Definitely. If you're a fan of Pippi Longstocking and Inger Nilsson, and you're looking for 90 minutes to spare, this film is still very fun, fast-paced, and never a dull moment. As a matter of fact, as far as feature-length Pippi movies go, you can't go wrong with this film!\n\nFor the trivially curious, Episodes 1, 3, 2, 5 (partly), 9, 10, 11 (brief scenes), 12, and 13, in that order, are the bases for this compilation.\n\nDespite the criticism of Pippi fans here in the US (myself included) and abroad, this film was a box-office success! So successful that the producers in Germany did the sequel compilation film, PIPPI GOES ON BOARD, to capitalize on this film's success.\n\nIn summary, despite its faults, this compilation film is definitely a classic! Undoubtedly THE Pippi Longstocking motion picture to watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0366905/"
}