{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        },
        {
            "@type": "Person",
            "name": "Jessica Walter",
            "url": "/name/nm0910055/"
        },
        {
            "@type": "Person",
            "name": "Donna Mills",
            "url": "/name/nm0005234/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29862,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0102264/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062759/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Jo Heims",
            "url": "/name/nm0374268/"
        },
        {
            "@type": "Person",
            "name": "Dean Riesner",
            "url": "/name/nm0718466/"
        }
    ],
    "datePublished": "1971-11-12",
    "description": "The life of a disc jockey is turned upside down after a romantic encounter with an obsessed fan.",
    "director": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjI4YTIyMWEtYjY4OS00ZDVmLWI5MjEtYmE3OGMxZDM4NmJlXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "directed by star,psychological manipulation,jealousy,loneliness,close up of eyes",
    "name": "Play Misty for Me",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2001-04-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067588/"
        },
        "name": "Edge-Of-Your-Seat Thriller",
        "reviewBody": "Clint Eastwood made his directorial debut with this 1971 suspense/thriller, `Play Misty for Me,' in which he also stars as Dave Garver, a late night radio disc jockey for a small station in Carmel, California. During his show, he opens the phones to take requests, at which times a frequent caller-- a woman named Evelyn (Jessica Walter)-- always asks for the same tune, `Misty.' Her obsession, it turns out, is not with that particular record, but with Garver, who is currently sorting out a relationship gone bad with a young artist, Tobie (Donna Mills), but which may be on the mend in light of the fact that Tobie has just returned to town after a lengthy absence in the wake of their breakup. In the interim, Garver has become entangled with Evelyn, a fan he soon discovers gives new meaning to the term `fanatic.'\n\n\tEastwood invades Hitchcock territory with this film, which it turns out was indeed a harbinger of the course his career would take from this point on, that of directing and starring in his own movies. With this one, it's apparent that he had that special touch from the beginning; he knows unequivocally what he likes, what works and how to deliver it. The only weakness in the film (if you can even call it a weakness), would be the use of longshots during a couple of scenes between Garver and Tobie that take place on the coast. It adds a scenic vista for a backdrop, but listening to the dialogue with the actors in the distance gives it a dialogue-added-later feeling. It's a minor flaw, however, that takes nothing away from the overall impact of the film, especially as Eastwood establishes a deliberate pace that allows the tension to mount throughout.\n\n\tIt would seem that for an actor to direct himself would be a monumental undertaking, especially the first time, but Eastwood proves here what has been corroborated over the years and with his films since, that he is his own best director. And it's a club to which few actor/directors belong, which puts him in the elite company of Welles, Branagh and most recently, Ed Harris (with `Pollock'), just to name a few of the select. As Garver, a minor celebrity whose biggest fan turns out to be his worst nightmare, Eastwood is thoroughly convincing, and though this may not be one of his most memorable roles, it is certainly well acted, and delivered with that subtle Eastwood charm. \n\n\tJessica Walter combines just the right amount of beauty, charm and menace for her role of Evelyn, which just may be her most memorable performance ever. She creates a character who is smoothly confident, if slightly vulnerable, and prone to instantaneous bursts of psychotic anger. It's an honest portrait of an extremely disturbed individual with the ability to conceal the true nature-- and danger-- of her mental state. Exceptionally well realized by Walter, Evelyn could be the older sister of Stephen King's Annie in `Misery,' a role for which Kathy Bates received an Oscar for Best Actress some twenty years after Walter inhabited the body of Evelyn.\n\n\tThe supporting cast includes John Larch (Sergeant McCallum), Jack Ging (Frank), Irene Hervey (Madge), James McEachin (Al Monte), Clarice Taylor (Birdie) and Don Siegel (Murphy). A film that will have you on the edge of your seat by the end, `Play Misty for Me' withstands the test of time and works every bit as well today as when it was originally released. A tale from the dark side, it's engrossing entertainment that may give you second thoughts about that casual acquaintance you've just invited to your house for dinner. Eastwood chose a perfect setting for his film, using one of the most beautiful spots along the California coast as a background against which to contrast the grisly events of the story. It all adds up to a wild ride for the audience, and an auspicious debut for Eastwood as the Man Behind the Camera. I rate this one 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi619364633",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWU0M2IwZTctY2U0NS00OTIzLTgyZjItMWRjOTU5ZDlmM2FmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWU0M2IwZTctY2U0NS00OTIzLTgyZjItMWRjOTU5ZDlmM2FmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-26T23:26:55.069Z",
        "url": "https://www.imdb.com/video/vi619364633/"
    },
    "url": "/title/tt0067588/"
}