{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woody Harrelson",
            "url": "/name/nm0000437/"
        },
        {
            "@type": "Person",
            "name": "Antonio Banderas",
            "url": "/name/nm0000104/"
        },
        {
            "@type": "Person",
            "name": "Lolita Davidovich",
            "url": "/name/nm0000357/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12137,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0120091/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002152/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Person",
            "name": "Ron Shelton",
            "url": "/name/nm0005421/"
        }
    ],
    "datePublished": "2000-01-21",
    "description": "Two best friends and former middleweight contenders travel to Las Vegas to fight each other for the first time.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Shelton",
            "url": "/name/nm0005421/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Comedy",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM2NjY1MTA2Nl5BMl5BanBnXkFtZTYwMzY2Mzc3._V1_.jpg",
    "keywords": "highway travel,boxing movie,road movie,casino,on the road",
    "name": "Play It to the Bone",
    "original_info": {
        "id": "Play It to the Bone_2000",
        "name": "Play It to the Bone",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mercury-26"
        },
        "dateCreated": "2000-07-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0196857/"
        },
        "name": "even a weak Ron Shelton film is worth watching",
        "reviewBody": "When you think of sports films, one name comes to mind: Ron Shelton. Five of his last six directorial efforts, not to mention writing efforts like \"Blue Chips,\" have been about sports. \"Bull Durham,\" of course, is his touchstone film, but \"White Men Can't Jump\" and \"Tin Cup\" are both excellent. Baseball, basketball, golf, and now with \"Play It to the Bone,\" boxing. But are they really sports films or are they simply character-driven comedies that use the sports world as a backdrop?\n\nOnly Shelton knows if it's intentional, but almost all of these stories follow a similar formula: he takes three characters, two men, one woman, who are all different things to each other. Sometimes it's a love triangle, sometimes it's not-but the woman always has a lot to teach one of the men in particular (Susan Sarandon's character in \"Bull Durham\" to Tim Robbins', Rosie Perez's character in \"WMCJ\" to Woody Harrelson's, etc.).\n\nOne of the men is a washed up has-been or never-was and the other is the egomaniacal flavor-of-the-month (Kevin Costner and Don Johnson in \"Tin Cup\"; Costner and Robbins in \"Bull Durham\"). The lone woman always uses psychology to enlighten the men on how to play the Game better, both of sports and of love (Rene Russo's character in \"Tin Cup\" is a psychiatrist). The entire story is about the contrast between the men's and the woman's view of life. Somehow, the woman always ends up the wisest of the three, while the men are allowed to behave irrationally because that's what men do. In the end, she finds that one of them is hopeless, and chooses him because of it. A woman never met a man she couldn't fix, at least not in a Ron Shelton film (the exception being \"WMCJ\": Rosie Perez' character does actually leave Harrelson's).\n\n\"Play It to the Bone\" is more of the same. This time, however, both men are washed-up has-beens--boxers--Vince and Cesar (Harrelson and Antonio Banderas). They both have a lot of kinks to work out in their lives. The only issue either of them acknowledges at first is money--they have none and are offered fifty grand apiece to fight as replacements on a Mike Tyson undercard. The two are best friends, both have been ranked as middleweight or super middleweight boxers, but they've never met in the ring. Instead of flying to Las Vegas, they drive from Los Angeles in Cesar's girlfriend's (Lolita Davidovich) car.\n\nDavidovich plays Grace, the aforementioned all-knowing woman, a Ron Shelton staple. She's dated both Vince and Cesar and knows exactly what buttons to push. She knows what makes each man fight better and, over the course of the road trip that eats up the film's first two acts, brings each to the proper mental state.\n\n\"Play It\" is like a rubber band: you keep pulling it back farther and farther, building up the tension until it's ready to break, then release. When the opening bell of Vince and Cesar's bout rings, Shelton's rubber band snaps. Grace's intention was for the two to fight each other and for both to do well, allowing each to unleash some of the frustrations they have in their lives. Her mistake was thinking that either man would hold back. By the fifth round, when they've beaten each other's faces bloody, we see the two aren't fighting each other any more: they're fighting themselves. Every woman knows that men don't talk about what's really on their minds. I admit it: We men generally deny what is true about ourselves until we're ready to explode. Shelton has a way of hitting the bullseye when it comes to human interaction, and does so again here.\n\nThe film's centerpiece, the final fight, is exciting and entertaining. It's more visual than anything Shelton has tried. As the men fight, they have visions that represent their respective life struggles. I found myself missing the Shelton of old, the one that just told it straight. Everything just felt more free and fun; loose. The story was always a free-for-all, a game with no rules, where absolutely anything can happen. With \"Play It,\" he seems too intent on making a point and becomes (gasp) a filmmaker. The story actually has (gulp) structure, whereas his others were directionless, but in a good way. For once, Shelton wrote the characters rather than letting the characters write themselves.\n\nMr. Shelton, leave structure to the hacks and keep making great films.\n\nGrade: C",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0196857/"
}