{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Duchovny",
            "url": "/name/nm0000141/"
        },
        {
            "@type": "Person",
            "name": "Timothy Hutton",
            "url": "/name/nm0000459/"
        },
        {
            "@type": "Person",
            "name": "Angelina Jolie",
            "url": "/name/nm0001401/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7787,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064908/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0097246/"
        },
        {
            "@type": "Person",
            "name": "Mark Haskell Smith",
            "url": "/name/nm0809245/"
        }
    ],
    "datePublished": "1997-10-17",
    "description": "A disgraced surgeon leaves his former life and reinvents himself as a gunshot doctor in the criminal underworld.",
    "director": [
        {
            "@type": "Person",
            "name": "Andy Wilson",
            "url": "/name/nm0933002/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTg4ZjdmNmQtNzhiMS00ZDJiLWIyMTEtNDU5NDYwYWU0ODU5XkEyXkFqcGdeQXVyNTE4MzAyNDk@._V1_.jpg",
    "keywords": "antihero,car,envelope of money,knocked unconscious,fbi federal bureau of investigation",
    "name": "Playing God",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2003-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119906/"
        },
        "name": "Could have been better",
        "reviewBody": "Eugene Sands is a drug addict doctor - although he has long since been barred from practicing medicine having been found operating high, leading to a girl's death. When he is at a club buying he witnesses a shooting and steps in to do enough to save a man's life. The owner of the club and criminal to boot, Raymond Blossom, takes an interest in Eugene and begins using him and his doctor. However the FBI are after Raymond and make moves to use Eugene to trap him.\n\nComing off as a slightly upmarket video thriller, this film could have been much better but ultimately fails to engage or rise to it's potential. The plot is OK but the script doesn't manage to lift the story up into something that is really strong and engaging. The delivery is a big part of the problem - it isn't that well directed, nothing very wrong but certainly the feel of a video film as opposed to a big screen thriller. The decision to have a voice over narrator is always a gamble; sometimes it works but sometimes it really doesn't.\n\nHere the narration doesn't work for two reasons. First of all, the narrator has to explain or develop so much because the film fails to do it as part of the story being told. To make matters worse Duchovny delivery is so flat that it really sucks any energy out of the film. His actual performance is not as bad as his voiceover but he doesn't exactly manage to lead the film. This leaves the way open for Hutton's villain, but he struggles with a lack of character and eventually gives into overacting. Jolie is good but again suffers from having no character. Regardless of performances, not having any buy in with the main people meant that I wasn't into the story as I needed to be. Support from Massee, Stormare and Dourdan doesn't so much add quality as add familiarity.\n\nOverall this was very much a workmanlike thriller. It is passable but really it is difficult to overlook the fact that the film has major weaknesses in most areas. The plot is good but the script can't do anything with it, the narration is rubbish and the acting is only reasonable on the whole. Worth watching once but it's hard not to feel let down by it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A disgraced surgeon leaves his former life and reinvents himself as a gunshot doctor in the criminal underworld.",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi319865625",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmE4ZjQ0MDYtMzA4NS00ZmMzLTk2NjEtY2VjNmZhZDNlMzcyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmE4ZjQ0MDYtMzA4NS00ZmMzLTk2NjEtY2VjNmZhZDNlMzcyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-20T00:58:21.795Z",
        "url": "https://www.imdb.com/video/vi319865625/"
    },
    "url": "/title/tt0119906/"
}