{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mickey Rourke",
            "url": "/name/nm0000620/"
        },
        {
            "@type": "Person",
            "name": "Danny Trejo",
            "url": "/name/nm0001803/"
        },
        {
            "@type": "Person",
            "name": "Frederic Forrest",
            "url": "/name/nm0002078/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1796,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035764/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045801/"
        },
        {
            "@type": "Person",
            "name": "James Bannon",
            "url": "/name/nm0052436/"
        },
        {
            "@type": "Person",
            "name": "Chuck Konzelman",
            "url": "/name/nm0465484/"
        },
        {
            "@type": "Person",
            "name": "Daniel Raskov",
            "url": "/name/nm0711261/"
        }
    ],
    "datePublished": "1998-12-15",
    "description": "Convicted corporate criminal Howard engineers a prison break as he and a number of fellow inmates are being transferred to a new facility. The escapees storm a shopping mall and take a group of shoppers hostage (after killing many...",
    "director": [
        {
            "@type": "Person",
            "name": "Matt Earl Beesley",
            "url": "/name/nm0066584/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY2MDM5MzQ5OF5BMl5BanBnXkFtZTcwMzQ3ODgyMQ@@._V1_.jpg",
    "keywords": "hostage,shopping mall,paint,murder,african american",
    "name": "Point Blank",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "abooboo-2"
        },
        "dateCreated": "2001-01-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0175047/"
        },
        "name": "AVOID!!!",
        "reviewBody": "May not be the sorriest I've ever seen, but it's very very close. It's certainly the worst I've watched in a good while, and keep in mind that I've seen \"The Haunting\". I am totally serious when I state that the title must be the filmmakers' admission that the film has no 'point', that it is literally an entertainment 'blank' or void.\n\nA bunch of hardened convicts break out of captivity and immediately take 8 or so hostages (business must be down) at a local mall? Then they hunker down and wait for their ruthless, business-guy ringleader to figure out what demands they're going to make as Local and Federal law enforcement surround the place? And one of the cons starts indiscriminately blowing away hostages as another con's former Marine (or something) brother shows up to dispatch the villains one by one Die Hard style? WHAT? HUH? WHAT? Who wrote this? Escaped cons would never do that. They would never ever ever do something like that. It is one of the most moronic concepts I've ever heard of. For starters, there would be like 40-50 points of access which they could not possibly guard. And why would they ever put their trust in someone (though he bankrolled their breakout) who they all despise and they know is stringing them along? Doesn't work. Can't do it. Better come up with something else, Mr. Screenwriter. He, like the ridiculous characters in this movie, boxes himself in and tries to blast his way out, with predictable results.\n\nEven given this premise's painful absurdity, the film could at least deliver on all of the routine but fairly dependable and mildly diverting staples of this genre, like say the way the ones starring Charles Bronson and I don't know, Michael Dudikoff do. But it fails badly when it even tries to do that little, as the action sequences are so gratuitously illogical and disconnected to narrative (what little there is) you will cry. And only two of the hostages are even given close-ups (a pretty girl in a mini-skirt and a slutty girl with a drug habit) so it seems like there's about 5 hostages or so, instead of the hundreds you'd think would be roaming the mall at the time of the takeover. Plus, there's lots of inertia in this movie, lots of standing around, as if the actors had to constantly be reminded that yes, they were taking part in the filming of a motion picture and that, don't worry, everything will come together in the editing room. (Uh, not quite.)\n\nAs if that weren't bad enough; self-pitying, disinterested Mickey Rourke is the putative star. The film is quite unspeakably ghastly on its own, to be sure, but Rourke's involvement is very much like dropping a ten ton elephant on an already sinking ship. He gives another one of those deadening, lobotomized non-performances that he first patented with that \"Harley Davidson and the Marlboro Man\" bomb about ten years ago. He shuffles and mutters his way through the debacle as if he'd lost some bet to the producers when drunk and had no choice. (Though he must've made them agree, I suppose wisely, that his participation was contingent on his not having to speak more than 50 words of dialogue.)\n\nRourke is an actor who at some point evidently decided that the drama and spectacle of his own strange life far surpassed that of any movie he could possibly be in. Every movie like this he does seems like a cry for help, just another installment in his sorry, self-conscious saga of self- (and career) destruction. Amazing when you consider how surprisingly good and professional he is in a fine made for TNT movie he appeared in around this time called \"Thicker Than Blood\".\n\nEvery film, no matter how bad, must have a central theme, and this one's seems to be that \"It's bad to hurt innocent people\". (At least, Rourke's character mentions something along those lines a few times.) Anyway, I think that's something we can all agree on.\n\nSo why make this film?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sterling Home Entertainment",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1202651417",
        "name": "Point Blank",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzk4M2E2MWEtMTI4OS00ZjhlLTlmZjItOWExODljOTk1MTY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzk4M2E2MWEtMTI4OS00ZjhlLTlmZjItOWExODljOTk1MTY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:35:52Z",
        "url": "https://www.imdb.com/video/vi1202651417/"
    },
    "url": "/title/tt0175047/"
}