{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ed Harris",
            "url": "/name/nm0000438/"
        },
        {
            "@type": "Person",
            "name": "Marcia Gay Harden",
            "url": "/name/nm0001315/"
        },
        {
            "@type": "Person",
            "name": "Robert Knott",
            "url": "/name/nm0461446/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28776,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015740/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022513/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023193/"
        },
        {
            "@type": "Person",
            "name": "Steven Naifeh",
            "url": "/name/nm0619674/"
        },
        {
            "@type": "Person",
            "name": "Gregory White Smith",
            "url": "/name/nm0808386/"
        },
        {
            "@type": "Person",
            "name": "Barbara Turner",
            "url": "/name/nm0193009/"
        }
    ],
    "datePublished": "2001-03-23",
    "description": "A film about the life and career of the American painter, Jackson Pollock.",
    "director": [
        {
            "@type": "Person",
            "name": "Ed Harris",
            "url": "/name/nm0000438/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDU0NjJkNGQtOGY0ZS00MTEyLTk4NDEtODA5MTc4NGY1NjZkXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "painter,artist,painting,pulitzer prize source,character name as title",
    "name": "Pollock",
    "original_info": {
        "id": "Pollock_2000",
        "name": "Pollock",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2001-04-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0183659/"
        },
        "name": "In The Abstract",
        "reviewBody": "The romantic notion of suffering for one's art has been cinematically rendered in countless films, depicting the lives of real life artists ranging from Van Gogh to Camille Claudel to Beethoven to Jim Morrison to Rimbaud; but rarely has a film penetrated as deeply as `Pollock,' directed by and starring Ed Harris as the abstract painter Jackson Pollock. The story begins in 1941 and chronicles Pollock's life until the early 50s. It's a vivid, and at times grim portrait of a true artist struggling for recognition, as well as with the inner demons that plague his soul and are reflected in his art and the way he lives his life. It is said that the artist `sees' the world differently than the average person, which may be true; and it is that unique `vision' that sets the artist apart. And Pollock was no exception to the rule.\n\n\tAs romantic as it may sound, the reality of suffering for one's art is just that: Suffering. For realizing that vision and bringing it to fruition is more often than not an arduous and tortuous path to tread. Coalescing the fragments of that vision and transferring that information into reality can be a painful process, and one of the strengths of this film is that it so succinctly conveys that sense of desperation and frustration that are seemingly an intrinsic part of `creating.' There's a scene in which Pollock, after having been commissioned to do a mural, sits on the floor of his studio with his back against the wall staring for days on end at the blank canvas stretched across the room, waiting for that spark of inspiration, that sudden moment when what he must do will crystallize in his mind's eye. It's a powerful, intense scene that allows you to share that creative process with the artist and experience the emotional turmoil of it, as well as the exhilaration of the moment when it all suddenly becomes clear, when the vision is realized. It's a stunning moment; Pollock's face fills the screen and you actually see it in his eyes, the exact moment of discovery. And it's absolute magic.\n\n\tAs Pollock, Ed Harris gives arguably the best performance of his career; he perfectly captures every emotional level of this complex individual, from the manic highs and lows (exacerbated by alcohol consumption) to the neutral moments in between. He totally immerses himself in the character, and what surfaces is a thorough and memorable picture of a tortured genius and flawed human being. It's an astounding piece of work, for which he most certainly should have taken home the Oscar for Best Actor.\n\n\tMarcia Gay Harden received the Academy Award for Best Supporting Actress for her portrayal of Lee Krasner, the woman who loved Pollock and devoted herself (even at the expense of her own career as an artist) to the man and his art. It's a terrific performance, through which Harden brings Lee to life, physically and emotionally. Her amount of screen time seemingly should have qualified her for a Best Actress nomination, but regardless, her work here is unquestionably deserving of the Oscar.\n\n\tThe supporting cast includes Amy Madigan (Peggy Guggenheim), Jennifer Connelly (Ruth), Jeffrey Tambor (Clement), Bud Cort (Howard), John Heard (Tony), Sada Thompson (Stella Pollock) and Val Kilmer (Willem de Kooning). Harris' triumph with `Pollock' does not begin and end with his extraordinary performance, however; though his acting is so exceptional it would be easy to overlook the brilliant job of directing he did with this film. And it is brilliant. The way this film is presented is the work of not only a seasoned professional, but of a professional artist with a unique vision of his own. One of the best films of the year (2000), hopefully it will in the future receive the acclaim of which it is so richly deserving. Hopefully, as well, Harris will direct again; for it is talent like his, and films like this one, that expand the Cinematic Universe as we know it. I rate this one 10/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Sony Pictures Classics",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi92340505",
        "name": "Pollock",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjIyYTI1MTItOTQ0Ny00NDJkLWJmYjUtNjZmODM5OGIwNWIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjIyYTI1MTItOTQ0Ny00NDJkLWJmYjUtNjZmODM5OGIwNWIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:42:22Z",
        "url": "https://www.imdb.com/video/vi92340505/"
    },
    "url": "/title/tt0183659/"
}