{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julian Lennon",
            "url": "/name/nm0502049/"
        },
        {
            "@type": "Person",
            "name": "Chris Roe",
            "url": "/name/nm0736206/"
        },
        {
            "@type": "Person",
            "name": "Richard Roe",
            "url": "/name/nm0736240/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 162,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "Pop and Me",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0075374/"
        },
        {
            "@type": "Person",
            "name": "Jesse Negron",
            "url": "/name/nm0624503/"
        },
        {
            "@type": "Person",
            "name": "Erik Arnesen",
            "url": "/name/nm0036212/"
        },
        {
            "@type": "Person",
            "name": "Juliann Jannus",
            "url": "/name/nm0417853/"
        }
    ],
    "datePublished": "1999-04-18",
    "description": "A father and son filmmaking team travel the world collecting candid and touching stories from fathers and sons, including Julian Lennon talking about his famous father John Lennon.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Roe",
            "url": "/name/nm0736206/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGI0ZDJmZDYtNDM4ZS00MTU5LWFhOWItYWM2NDI4NzUzODY5XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "eiffel tower paris,paris france,independent film",
    "name": "Pop & Me",
    "original_info": {
        "id": "Pop and Me_1999",
        "name": "Pop and Me",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2002-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0196002/"
        },
        "name": "\"Pop & Me\", a great film for men with adult sons (that's why the female vote is so low).",
        "reviewBody": "\"Pop and Me\" had an interesting genesis. \"Pop\" had turned 50 and was reminded that he had perhaps only 1/3 of his life left to live. He decided to take another trip around the world. The \"Son\" saw this as an opportunity to go along with dad, who would pay for the trip, and meanwhile make a film of the adventure. Pop realized that may become a little dull, but conceived of the idea that the film could include dads and sons all over the world. It turned out to be a brilliant idea, and after two years of planning they did it. A 190-day trip.\n\nFirst, a word about dad/son dynamics. It becomes clear very early that, in spite of their uncanny physical resemblance, dad and son are totally different. Dad is a gregarious, confident, left-brain planner and problem-solver. Son is a right-brain, sensitive sort with a little self-confidence problem which gets amplified when he is around his father. While dad always shines brightly, the son is not exactly the brightest bulb in the grand fixture of life. This fact contributes to the interest of the film, and points out the difficulty some people have of recognizing and accepting who they are (son, not dad).\n\nOne of the more interesting interviews was with Julian Lennon, on the beach at Monte Carlo. Julian shared his perspective that John Lennon was not a particularly good father, and that the songs he wrote did not reflect who he was. This motivated Julian to be a better person, to be more true to his music. This same theme came from \"pop\", when discussing his father, who he described as a \"drunk.\" He said he observed his father, and tried hard not to be like that.\n\nAround the world, they found fathers and sons to interview, and it is impressive how openly they shared. Not all was rosy, as the time in India when son became very ill, with all the symptoms of Dengue Fever, which was rampant at that time. He survived. Or the time when their visas had expired in Viet Nam and they could not leave until they were able to get them renewed. Or the periodic \"discussions\" they had concerning dad always wanting to take over. \n\nAll-in-all a very fine film, and a great film for adult men and their adult sons to watch. The DVD has some deleted scenes which I found more interesting than some of the completed film's content. I recommend it highly."
    },
    "url": "/title/tt0196002/"
}