{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Osvaldo Benavides",
            "url": "/name/nm0070282/"
        },
        {
            "@type": "Person",
            "name": "Rodrigo Cachero",
            "url": "/name/nm0128003/"
        },
        {
            "@type": "Person",
            "name": "Ana de la Reguera",
            "url": "/name/nm0478886/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 945,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003956/"
        },
        {
            "@type": "Person",
            "name": "Antonio Armonia",
            "url": "/name/nm0035550/"
        }
    ],
    "datePublished": "2000-10-13",
    "description": "Rocco (Osvaldo Benavides) and Rodrigo (Rodrigo Cachero) are cousins, but they're not at all alike. Rocco is the loose one, Rodrigo's uptight. But when their grandfather Rodrigo Carnicero (Xavier Masse) dies, the two are forced to ...",
    "director": [
        {
            "@type": "Person",
            "name": "Juan Carlos de Llaca",
            "url": "/name/nm0209800/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwMTU5NzA0MV5BMl5BanBnXkFtZTcwMzA2OTQyMQ@@._V1_.jpg",
    "keywords": "acapulco,brief breast,female nudity",
    "name": "Por la libre",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pifas"
        },
        "dateCreated": "2002-09-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0262698/"
        },
        "name": "Just a very light comedy",
        "reviewBody": "This movie comes as a very good example of how our cinema has walked just very little steps in recent years. Sure, the effort is there, but the levels it tries to reach with it's premise are kept constantly one or even two steps ahead in the motion. The screenplay it's not that bad, but it's main problem lies mostly with the acting; the people in charge are basically TV ones and they don't get to express all that I think was on the paper to give the characters a believable profile.\n\nThe premise involves the greed of a family and it's love disfunction. Mister Carnicero has died, and his two sons are on a vulture labor behind the money left. One of them is divorced, near to marry again, and has a son -with his first wife- named Rocco, a rebel kind of type guy who was the closest to the dead grandpa; the other one, played by renamed actor Otto Sirgo, has raised a restrained semi yuppie named Rodrigo. The family doesn't respect grandpa's last wishes like rejecting any kind of after death religious ceremony (they celebrate a mass post mortem}, and to throw as soon as possible Carnicero's ashes in the pacific ocean at Acapulco's shore {they keep delaying the task while trying to sell the big house in order to split the money}.\n\nSince here, the film takes a turn into a road movie. Full of frustration because of this, Rocco grabs grandpa's ashes and steals an old Mercedes that Rodrigo inherited {the one that his repressive father won't let him drive}, and head for Acapulco to accomplish mister Carnicero last wish: to rest in the ocean. Rodrigo watch this and gets in the car, Rocco explains what he's up to, and then both goes to the coastal city without permission and only a few pesos in the pockets. I won't tell more because I don't want to spoil anything but, it's supposed that this characters, Rocco and Rodrigo, doesn't like each other very much because of their antagonist minds. One's a yuppie and the other one is a rebel soul but they don't seem to have any problems getting along in the short trip, and once in Acapulco, it's even worst the showcase of different personalities. They actually have only one fist fight. I couldn't buy it even though I tried. The plot has in the middle a twist that gives us another perspective about all the circumstances surrounding grandpa's last wish, and despite it's a nice one, it's not enough to prop up the history.\n\nMy guess it's that Por la libre was intended to be a free spirit comedy about family relationships and at some point, how the youth is and behaves in Mexico, but in the end, this film only shows a mediocre display of resources that doesn't fit well in many points. Besides that, this isn't a terrible experience as a light comedy, but if you're looking for good recent mexican movies, try Amores perros or Y tu mama tambien, those two films sure are very strong, profound, and full of meanings.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0262698/"
}