{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Krzysztof Majchrzak",
            "url": "/name/nm0538048/"
        },
        {
            "@type": "Person",
            "name": "Adam Ferency",
            "url": "/name/nm0272295/"
        },
        {
            "@type": "Person",
            "name": "Krzysztof Globisz",
            "url": "/name/nm0322937/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 980,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043688/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090290/"
        },
        {
            "@type": "Person",
            "name": "Luc Bondy",
            "url": "/name/nm0094194/"
        },
        {
            "@type": "Person",
            "name": "Gérard Brach",
            "url": "/name/nm0102722/"
        },
        {
            "@type": "Person",
            "name": "Witold Gombrowicz",
            "url": "/name/nm0326822/"
        }
    ],
    "datePublished": "2003-10-17",
    "description": "Two intellectuals, a writer and a director, begin to play a mysterious psychological game in a peaceful countryside manor house during the Nazi occupation.",
    "director": [
        {
            "@type": "Person",
            "name": "Jan Jakub Kolski",
            "url": "/name/nm0464383/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkyNTY3ODE2OF5BMl5BanBnXkFtZTcwODMwNTQ4Mg@@._V1_.jpg",
    "keywords": "sex standing up,lift skirt,panties hit the floor,panties pulled down,fondling",
    "name": "Pornografia",
    "original_info": {
        "id": "Pornografia_2003",
        "name": "Pornografia",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "scrypt@rcn.com"
        },
        "dateCreated": "2004-06-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0357037/"
        },
        "name": "Ravishing attention to nuance; pity about the tone.",
        "reviewBody": "Recently, I saw the film Pornografia at the Walter Reade Theater. This offering by Polish director Jan Kolski is an adaptation of Wiltold Gombrowicz's difficult novel, in which minute sensory information is invested with meaning and sutured into intricate causal patterns that reflect the protagonist's paranoia.\n\nSo much of the narrative takes place in the main character's head that I'd thought the story impossibly non-cinematic. Yet Kolski manages to bring in several levels of nuance and rarefied metaphor. What's more, said nuances become sensual and aesthetic. \n\nUnfortunately, what Kolski leaves out of the film is the tone of the book, which reads like Beckett's version of Dangerous Liaisons. The film feels too elegiac, too post-tragic, even overtly moralistic -- it's as if the director were trying to correct Gombrowicz's narrator's amoral tone. This change creates unintentional ambiguities, flaws that don't exist in the book: for example, it is unclear why the two main characters turn against one of younger characters in the story. In the film, the main characters seem too ethical, too sensitive, to behave as they do. In the novel, their cynicism and casual sadism are everywhere apparent.\n\nIn the theater, I perceived a number of Polish members of the audience to be weeping at key moments; it occurred to me that the loss of a son or daughter was so commonplace in that country at one time that the film might have had an indigenous impact -- one that a third- or second-generation American would miss without clarification. Thus I'm not ready to dismiss the film as unclear or sentimental without knowing more.\n\n(For the record, neither the novel nor the film resembles Schindler's List; neither are about a concentration camp. And even if they were, Spielberg's melodrama is not the gold standard to which other holocaust films should be compared. Far earlier and better specimens exist, such as those by Louis Malle, Alain Resnais and Claude Lanzmann.)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0357037/"
}