{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ron Jeremy",
            "url": "/name/nm0000465/"
        },
        {
            "@type": "Person",
            "name": "William Margold",
            "url": "/name/nm0546735/"
        },
        {
            "@type": "Person",
            "name": "Al Goldstein",
            "url": "/name/nm0326155/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2680,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044356/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013237/"
        },
        {
            "@type": "Person",
            "name": "Scott J. Gill",
            "url": "/name/nm0318733/"
        },
        {
            "@type": "Person",
            "name": "Sean Skelton",
            "url": "/name/nm0804033/"
        }
    ],
    "description": "A light-hearted look at the life and career of porn star Ron Jeremy, from his devoted fanbase to his unlikely status as a sex symbol and his goal to achieve mainstream success.",
    "director": [
        {
            "@type": "Person",
            "name": "Scott J. Gill",
            "url": "/name/nm0318733/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM0NjYzOTg0N15BMl5BanBnXkFtZTcwNTQyMTQyMQ@@._V1_.jpg",
    "keywords": "porn star,hairy man,hedgehog,cult film,adult film actress",
    "name": "Porn Star: The Legend of Ron Jeremy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2002-05-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0282856/"
        },
        "name": "Interesting without getting it's hands dirty",
        "reviewBody": "A documentary looking into the up bringing, family, career and future dreams of porn star Ron Jeremy. It uses old footage, interviews and clips from his films to show a guy who wants to be centre of attention and be talked about.\n\nThis documentary is not one of the type I usually like to watch relating to porn. I usually like the ones that are done by people from outside  it tends to be less airbrushed! For example everyone should check out Channel 4's Hardcore (UK) it's an excellent documentary and will make it harder to get turned on next time you're watching porn. However this is more of a human interest story that a documentary  it's like those polished celeb features you see sometimes where a little bit of bad or unfortunate stuff is wheeled out, but not much. So we naturally have lots of porn celebs being interviewed as well as family and lots with Jeremy himself.\n\nHowever this is all still interesting  after all, how can you not be interested in a man who is one of the most famous males in porn for decades despite looking like a slob! But it does go beyond just the surface  we start with the idea that Jeremy is a pretty nice guy (not anywhere near as arrogant as you'd expect for a guy who gets sex so much!). But during the film little things come out  he is insecure, he wants to be the centre of things and maybe has too much importance put on himself.\n\nI did feel disappointed that it didn't push deeper when Jeremy was vulnerable. At times you can see sadness and hurt just behind his eyes but the director doesn't move at these times  instead the hurt is only really referred to in voiceovers by the narrator or by other people. It felt at times that the film was helping Jeremy to get exposure without actually letting us inside his character.\n\nHowever overall I enjoyed it. There is some nudity but it doesn't use the porn footage for titillation  instead most of the porn footage is old dialogue scenes. If you hate porn then this will be too glossy for your taste  but if you like it or just leave it alone then you should get something out of this."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Video Group",
        "duration": "PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4036755737",
        "name": "Porn Star: The Legend of Ron Jeremy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2Q4OTI0ZDctMTI5Ny00MTc2LTlhNTQtYmExNTVmMGY4ODUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2Q4OTI0ZDctMTI5Ny00MTc2LTlhNTQtYmExNTVmMGY4ODUyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:25:56Z",
        "url": "https://www.imdb.com/video/vi4036755737/"
    },
    "url": "/title/tt0282856/"
}