{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "James Napier Robertson",
            "url": "/name/nm1094036/"
        },
        {
            "@type": "Person",
            "name": "Kevin Duhaney",
            "url": "/name/nm0216594/"
        },
        {
            "@type": "Person",
            "name": "Emma Lahana",
            "url": "/name/nm1069611/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3381,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "TV-Y7",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0113687/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0135521/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010956/"
        }
    ],
    "datePublished": "2004-02-14",
    "description": "A team of unlikely personalities join forces to help save the Earth from the scheming Mesogog, a dinosaur-like villain who wishes to destroy humankind.",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWM2ZTFlYjYtMzhiNS00NWVlLWI4N2UtZGMwYTZhOTZiMTZmXkEyXkFqcGdeQXVyMTA1OTAyOTI@._V1_.jpg",
    "keywords": "shared universe,piloted giant robot,supervillain,actor reprises previous role,schoolteacher",
    "name": "Power Rangers DinoThunder",
    "original_info": {
        "id": "Power Rangers: Dinothunder_2004",
        "name": "Power Rangers: Dinothunder",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gothamite27"
        },
        "dateCreated": "2007-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0373587/"
        },
        "name": "The closest thing to a genuinely serious, contemporary Power Rangers show that can be enjoyed by audiences older than 5 years old.",
        "reviewBody": "I (like most other people my own age) grew up with the original Power Rangers series and lost interest soon after Zeo, when Tommy and the rest of them left. I came back into it a few times over the years, when my younger brothers got into it as all kids do, but overall, it faded into my childhood and I always dismissed it as something that couldn't truly be enjoyed by someone older than 5 years old.\n\nI found out recently that Jason David Frank (the legendary green, white and red Ranger from the first five seasons) returned as the 'mentor' character in Power Rangers: Dino Thunder. I decided to check out an episode, purely for the entertainment value of getting to see my old favourite get back into action. Funnily enough, I found myself enjoying it more than I thought I would and between downloads and DVDs, I ended up acquiring nearly a third of the whole series.\n\nMy thoughts? Well, it's still pretty silly. All of the exaggerated motions, the over-acting and the campiness one would expect from a Power Rangers show is all present, but for some reason it's toned down immensely. The main villain Mesogog, is dead-serious and so is his henchman Zeltrax. Neither of these characters are ever viewed as comic relief. Also, the Rangers are more three-dimensional than ever before. Instead of being a group of pure, wholesome best friends that constantly get straight As, the three main Rangers are a group of misfits: the jock, the alternative singer and the neurotic geek. The show actually shows them develop into true friends and better people over the course of thirty or so episodes, something that would be unheard of in the one-dimensionality of earlier series'.\n\nThe return of Tommy Oliver to the Power Rangers universe is just the icing on the cake. If this show wasn't as good as it was, it wouldn't have worked as well, but luckily, this was the perfect show to have Tommy come back to guide a new team. Tommy's character is slightly darker than the wholesome, gushy character we saw years ago. Tommy is well-versed in the kind of trials and tribulations that Power Rangers face, so he acts as a teacher to the younger, newer Rangers. Then of course, to please the fans, Tommy gets his own morpher and Powers early on in the series and becomes the Black Ranger (as cool as he's ever been).\n\nThe acting is somewhat above-par from what you'd usually expect from a Power Rangers show, but that's not to say that it's in any way decent. Frank plays the part he played for years well enough, Emma Lahana is fine as the spunky chick and Kevin Duhaney makes a decent nerd. Unfortunately, James Napier isn't exactly stellar as Connor McKnight and the Australian actor's American accent is horrible. It's as if he watched a western once, years ago, and based his accent off that. Throughout the series, evidence of his true heritage pops out blatantly in mid-speech, to the point where one wonders why he even bothers trying with the accent.\n\nOverall, this series is a lot of fun and isn't nearly as garish and offensive as other Power Ranger incarnations. Definitely one for all the family to watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi489858585",
        "name": "Power Rangers: Dino Thunder: Vol.1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTdmMjJkYzUtMzNmMy00ZGRhLWI3MWUtOWIzY2Y3NjUzNTAzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTdmMjJkYzUtMzNmMy00ZGRhLWI3MWUtOWIzY2Y3NjUzNTAzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-04-25T04:23:57Z",
        "url": "https://www.imdb.com/video/vi489858585/"
    },
    "url": "/title/tt0373587/"
}