{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kerr Smith",
            "url": "/name/nm0005445/"
        },
        {
            "@type": "Person",
            "name": "Lochlyn Munro",
            "url": "/name/nm0613147/"
        },
        {
            "@type": "Person",
            "name": "Angela Featherstone",
            "url": "/name/nm0004911/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1036,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054641/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010172/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0146656/"
        },
        {
            "@type": "Person",
            "name": "Richard Gale",
            "url": "/name/nm0301903/"
        },
        {
            "@type": "Person",
            "name": "Craig Brewer",
            "url": "/name/nm0108132/"
        }
    ],
    "datePublished": "2009-05-03",
    "description": "Two med students on a road trip are falsely accused of murder by a corrupt local Sheriff, setting off a wild chase and a deadly comedy of errors. As they struggle to survive, every move the students make sends them deeper into tro...",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Gale",
            "url": "/name/nm0301903/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY4MTUyOTQ3M15BMl5BanBnXkFtZTcwMzAzMDQyMQ@@._V1_.jpg",
    "keywords": "female reporter,female journalist,sheriff,cheerleader,abuse",
    "name": "Pressure",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "guilfisher-1"
        },
        "dateCreated": "2006-05-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283559/"
        },
        "name": "Terrific start",
        "reviewBody": "This 2002 thriller was directed by Richard Gale. It's his second film and shows that he has a terrific talent in starting out as a director. He also co-wrote the screenplay and shared camera operation as well. He chose great locations that suited the theme of this tale. I really liked the bar location, outside and inside, and the bridge. He captured the mood. The fact that he did the shoot of this film in 16 days is a tribute to how well he knows his stuff. Can you imagine what he can do with a bigger budget and more time? Go for it, Richard. If there's one picky thing I want to touch on, it's the easy way our hero was led astray by our leading lady, played wonderfully by Angela Featherstone. Like, that he gives in to her after making such a fuss to his friend about not staying. Oh, well guess there wouldn't be any plot if he nixed her invitation. Our hero, played by Kerr Smith, one of my favorite actors, since he first came to my attention in DAWSON'S CREEK, gave an honest and realistic performance as a guy who becomes the victim of events. Smith gives an underplayed performance which I felt fit in this sordid tale. A lot of Montgomery Clift style to his work. How about a film on Clift's life? It was hard to take him at times when he just stood and watched the action going on around him. But, that's the script. Example when his friend races across the bridge screaming at the top of his lungs to fall down. When he sees someone taking aim at him. Poor Kerr just stands there looking at his friend. Oh, well, getting picky. As the friend, Lochlyn Munro was perfectly cast and did an amazing job playing second fiddle to Smith. They balanced each other in the right way. Maybe star them in remake of An American Werewolf In London? Munro had the right charm and nonsense particularly in the bar with his gang of cheerleader companions. He stole the scene. Then he turns around and gives the right amount of sensitivity in the more serious scenes. Adrien Darval plays the heavy in this and he convinced me. Reminded me a lot of Albert Salamni. He was brutally real and convincing. Veteran actor Donnelly Rhodes also plays an unlikable character as the Sheriff of this back woods country. He's thorough in his interpretation and adds the drama needed to take this seriously. Michaelle Harrison as the girl he left behind, showed quite a lot of chutzpa in her few scenes. She held her own with all the craziness going on around her. You believed her. And a special mention for the sensitive performance of the Deputy played by David Neale. They say part of the director's job is choosing his cast. He chose well in this film. Each and every actor did well and made this small budget film into a major successful work of art. Thanks, guys, you were terrific. Oh hell, I'm giving this a 10. And I'm getting the DVD too.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from DEJ",
        "duration": "PT47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2340487449",
        "name": "Pressure (2002)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTliNWQwZjgtMTFkZi00YjFlLTk5NzktZmMwMTM0MTFjNGNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTliNWQwZjgtMTFkZi00YjFlLTk5NzktZmMwMTM0MTFjNGNiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:44:11Z",
        "url": "https://www.imdb.com/video/vi2340487449/"
    },
    "url": "/title/tt0283559/"
}