{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Olivia Bonamy",
            "url": "/name/nm0093740/"
        },
        {
            "@type": "Person",
            "name": "Audrey Tautou",
            "url": "/name/nm0851582/"
        },
        {
            "@type": "Person",
            "name": "Axelle Ade-Pasdeloup",
            "url": "/name/nm0011755/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 386,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "Pretty Devils",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029934/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076272/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0114248/"
        },
        {
            "@type": "Person",
            "name": "Serge Meynard",
            "url": "/name/nm0583697/"
        }
    ],
    "datePublished": "2000-02-09",
    "description": "Sisters Léa and Aurélie, 19 and 13, live in Paris with their mom. They miss their dad, who drowned. Their mom has a new man, Vincent, a cop. The girls are angry, stealing wallets from gymnasium locker rooms and running a con on me...",
    "director": [
        {
            "@type": "Person",
            "name": "Serge Meynard",
            "url": "/name/nm0583697/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGQ5NTQ3YjEtYTBkYy00MTQ3LTkzNTktMzQxY2EzN2EwOGM1XkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "female frontal nudity,female nudity,female full frontal nudity,paris france,sister sister relationship",
    "name": "Voyous voyelles",
    "original_info": {
        "id": "Pretty Devils_2000",
        "name": "Pretty Devils",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "przgzr"
        },
        "dateCreated": "2005-03-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0217136/"
        },
        "name": "Seventies are galaxies away",
        "reviewBody": "During the 70's France made dozens of teen comedies that US production of any decade can only dream about. They often took place in classrooms, because that's where teenagers spend (or at least should spend) most of their time. Even US teen movies admitted that teens were still going to school in that years, but it seems Grease-time is behind us. Today teen hits don't even mention schools, teens are on streets, on parties, on drugs and on each other. French didn't avoid sex themes, often showed them more open and even explicit, the way Hollywood authors never did (or weren't let to), and yet it all looked natural, realistic in all its fun and humour, never seemed to be dirty, never made adult public seem uncomfortable. Some of these movies had even serious background (war in Les turlupins, divorce in La boom in early 80's etc), some were basically dramas (Diabolo men the) but still full of fun, humour and some life optimism.\n\nToday French film isn't so playful any more. It became more adult even when dealing with teens. The times are hard for all of us, and teenagers feel it. They have new problems, or the old problems are more open and we make the teenagers feel them. So the moves became darker and bleaker (Petits freres, Ça s'appelle grandir). Even if humour is included, and some of the scenes remind us on that comedies that look ages old (so much our world has changed), we still can't be sure if this movie is a comedy at all, and if it's made for teens or adults. Probably the teenagers are more mature, and can cope the way movie has been made the same way as adults do. The world is more bitter, so the humour changes the same way (yet never becomes rude, vulgar, body-functional as in Hollywood blockbusters). And now even in these movies school isn't the main place, because the greatest problems are not related to school any more. Some of kids ended their schooling and now are unemployed, some ran away from the school and families, or even if they are on holidays their life is more miserable than during school lessons. What did we do with this world? 'Voyous voyelles' have been made only two decades after 'Sous-doués', and it looks as if it came from another solar system.\n\nIt's not a masterpiece, but it is good enough to be recommended to everyone except those who think the only world exists in American Pies, Scary Movies and Speeds. Audrey Tautou, a star of overrated 'Amelie', (a movie I feel gets good rating for the idea and what it could have been more than for what it is) plays a disturbed girl on the edge of suicide, Bonamy and Ade-Pasdeloup are even more interesting characters living on the edge of town, of society, of family. They help Tautou, though you can't tell who needs more help. There are moments recalling legendary 'Only Fools And Horses' - the environment, little frauds, relations between sisters whose age difference is big enough (like Trotters) that the older sibling takes care and influences on younger one more than parents (dead in serial, non-functional in movie). And there is a sadness in the laughter similar to later episodes of '...horses'. But otherwise this movie is French, in the best meaning of the word.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0217136/"
}