{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gina Gershon",
            "url": "/name/nm0000153/"
        },
        {
            "@type": "Person",
            "name": "Lori Petty",
            "url": "/name/nm0001614/"
        },
        {
            "@type": "Person",
            "name": "Marc Blucas",
            "url": "/name/nm0089456/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2017,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0089016/"
        },
        {
            "@type": "Person",
            "name": "Cheri Lovedog",
            "url": "/name/nm1118858/"
        },
        {
            "@type": "Person",
            "name": "Robin Shushan",
            "url": "/name/nm1120024/"
        }
    ],
    "datePublished": "2004-06-04",
    "description": "Prey For Rock & Roll is the story of Jacki and her all-girl rock and roll band, Clam Dandy, who are trying to make it in the LA club scene of the late 1980s. After ten years of being ignored by record producers, Jacki and the band...",
    "director": [
        {
            "@type": "Person",
            "name": "Alex Steyermark",
            "url": "/name/nm0829925/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY2MDI1MDE2MF5BMl5BanBnXkFtZTYwNDA3OTQ3._V1_.jpg",
    "keywords": "contract,1980s,female nudity,female female kiss,lesbian relationship",
    "name": "Prey for Rock & Roll",
    "original_info": {
        "id": "Prey for Rock and Roll_2003",
        "name": "Prey for Rock and Roll",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2009-09-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0307351/"
        },
        "name": "Breathing in the music.",
        "reviewBody": "Glamorous no way. The low-scale feature \"Prey for Rock and Roll\" is far from a sugar-coated rags-to-riches tale, but a scorching and soul-seeking drama (they might be making ends meat, but they enjoy and live for 'their' music than looking for fame but they slog it out the hard and long way to finally see it that way) set in the hot and heavy punk rock scene captured in an almost imitate documentary style. It wasn't what I was expecting that's for sure, as the music is its core (with some good musical pieces by Gina who did perform all of her own vocals and '6 minutes' was something special), but wrapped around it is a very conventional character formed, but strikingly biting story (based on rocker Cheri Lovedog's autobiographical) driven by its authentic grit and picture-perfect performances with excellent dynamics led by the outstandingly simmering Gina Gershon. She lives her character psychically, but also mentally through the highs and lows. Pouring out emotion (and there's a lot from anger to sorrow and pain that's effectively brought across), with roguishly pointed-tongue quips from an elastic script. Making up the rest of the chicks in her band is a rebelliously intoxicating Drea De Matteo, a sure-footed Lori Petty and a sassy doll-face Shelly Cole. In support are stable turns by Marc Blucas and Ivan Martin. Director Alex Steyermark instills a punching attitude and a genuine feel to his imagery with its all-too easy pace breezing by making the whole thing so engaging, even though it's a well-worn formula. The electrifying soundtrack to boot, pumps out the potent tunes and accordingly matches to the smothering atmosphere. You actually do feel like you're a passenger on the rock and roll ride. Enjoyable, but also confronting music/drama feature.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0307351/"
}