{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jimmy Smits",
            "url": "/name/nm0001751/"
        },
        {
            "@type": "Person",
            "name": "Maria del Mar",
            "url": "/name/nm0544691/"
        },
        {
            "@type": "Person",
            "name": "Jon Seda",
            "url": "/name/nm0781218/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 885,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061612/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0068512/"
        },
        {
            "@type": "Person",
            "name": "Phil Berger",
            "url": "/name/nm0074319/"
        }
    ],
    "datePublished": "2000-03-31",
    "description": "A father whose boxing career was derailed channels his love of the sport into coaching his three sons - but when an outside manager offers to take over, the family threatens to split in this hard-hitting drama.",
    "director": [
        {
            "@type": "Person",
            "name": "Carlos Avila",
            "url": "/name/nm0959665/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDYyNTg0YWMtYWNlNy00Y2ViLWFhN2ItZDJjYzFhYTk4YzIwXkEyXkFqcGdeQXVyNDAxNjkxNjQ@._V1_.jpg",
    "keywords": "boxing,loss of dream,brother brother relationship,mexican american,family conflict",
    "name": "Price of Glory",
    "original_info": {
        "id": "Price of Glory_2000",
        "name": "Price of Glory",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dkish"
        },
        "dateCreated": "2000-04-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0188160/"
        },
        "name": "Price of Glory opened more questions than answered them for me.",
        "reviewBody": "Price of Glory By Dean Kish\n\nRocky meets Mi Familia or is it more than that? Price of Glory chronicles the life of Arturo Ortega (Jimmy Smits) who lost his fighting edge early in his prize fighting career. Now thirteen years later, he trains his three boys to take him back to the top. What Ortega seems to forget is the boxing world is full of corruption, blood and honor. Can he help one of his boys reach the goal that eluded him? Price of Glory breaks some new ground in boxing films by mixing family conflicts with the high stakes of the boxing world. Another important part of this new ground was the Latino angle. I cant remember seeing a film about Latino fighters even though some of them are the best boxers in the world. It made me curious to see if the training and development of a boxer is different with a different cultural background. I believed that the boxing would be the bridge to stretch across the cultures.\n\nThere are some that will have a hard time with the detailed Latino content. It is at times hard to relate to that cultural barrier. Are some of the elements pressed upon these incorrigible youths from the society or a ploy by the writer himself? The intensity locked within Smits patriarch maybe that cultural barrier I couldnt quite understand. Stubborn, determined, passionate, proud and obsessed, Smits delivers a great performance but what exactly is this characters motives? Is he doing it for himself or to better his kids lives? These begging questions made you feel the frustration in the boys when their father would explode. He was the lord of the household and he ran their lives. Did this character have to be such a tyrant at times to get his point across? Or was this yet again a cultural thing? Price of Glory has a lot of great boxing sequences and I did like the evolution of the child boxer but being an outsider to this culture it is a little hard to grasp the motive locked within Smits beautiful portrayal. His questions are never quite answered. Even with the tragedy that grips the Ortegas there is never really see an answer. What we do see is a Rocky type finale which delves into the family pulling together to defeat the champion. I half expected to be brother against brother for the title but even though it was straight from Rocky it was nice to see a full Hollywood fight. Price of Glory opened more questions than answered them for me. (3 of 5) So Says the Soothsayer. (Opens March 31st)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "th pre, coming soon",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1419575577",
        "name": "Price of Glory",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDE4Y2FhMmItZjhlZS00ZmU3LTk1ZTktOGEzNzg2MDJiYjJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDE4Y2FhMmItZjhlZS00ZmU3LTk1ZTktOGEzNzg2MDJiYjJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:27:03Z",
        "url": "https://www.imdb.com/video/vi1419575577/"
    },
    "url": "/title/tt0188160/"
}