{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Linus Roache",
            "url": "/name/nm0730070/"
        },
        {
            "@type": "Person",
            "name": "Tom Wilkinson",
            "url": "/name/nm0929489/"
        },
        {
            "@type": "Person",
            "name": "Robert Carlyle",
            "url": "/name/nm0001015/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10680,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106129/"
        },
        {
            "@type": "Person",
            "name": "Jimmy McGovern",
            "url": "/name/nm0569568/"
        }
    ],
    "datePublished": "1995-03-24",
    "description": "A homosexual Catholic priest finds out during confessional that a young girl is being sexually abused by her father, and has to decide how to deal with both that secret and his own.",
    "director": [
        {
            "@type": "Person",
            "name": "Antonia Bird",
            "url": "/name/nm0000944/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzAyYzQ0ODQtNzNhMi00NWVkLTk1YTItODE4Y2U4YmE0NDgzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "church,catholic priest,homosexual,sexual repression,liverpool england",
    "name": "Priest",
    "original_info": {
        "id": "Priest_1994",
        "name": "Priest",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RachelLone"
        },
        "dateCreated": "2004-02-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110889/"
        },
        "name": "Definitely one of the most controversial films in cinema history",
        "reviewBody": "Father Greg Pilkinton (Linus Roache) is a young, dedicated, idealistic and yet conservative (comparing to his colleague, Father Matthew Thomas, played by Tom Wilkinson) priest who has recently arrived in his new parish. He works hard with total faith and devotion. Soon after moving in to Father Matthew's house, he discovers that Father Matthew has been having a relationship with his maid. Later on, a school girl, Lisa (Christine Tremarco) confesses to him that her father has been sexually abusing her, Father Greg faces his inner struggle on whether to reveal the truth to the authority, or remain silent in order not to break his vow.\n\nConfused and frustrated, Father Greg goes to a pub and meets Graham (Robert Carlyle) and later they have sex. They are to stay in an on-and-off relationship. Now Father Greg must confront his human desire and his sexuality. Eventually, he also has to deal with his being arrested while making love in a parked car and the devastating consequences.\n\nThis film challenges the entire system. Must a priest (or a nun) remain celibate? Should we leave out non-heterosexuals for being Catholics or whatever? Must a priest remain silent when hearing a serious problem or even an about-to-be-committed crime (which happens all the time in Northern Ireland) and do nothing? Can all priests honestly give themselves away completely to God and refrain from letting their human emotion, human desire flow? Don't some priests become child molesters because they've been trying to repress their human desire for too long (this seems outside the subject. On the other hand, not all priests commit such a crime)? Should we refuse to show compassion towards certain people simply because they are different from us and that their life styles are 'not accepted' by society or the usual moral standard? Still, who is the hypocrite here? Father Matthew's relationship with his housekeeper has never been revealed. If otherwise, he would be rejected, too. He leads a double life. Being a 'liberal' priest and breaking his vow of celibacy at the same time. But WHO are the hypocrites? Aren't we all?\n\n'Priest' is not about a story of one priest. It's about any one priest. And the movie is compelling and well-made. One thing for sure, the Roman Catholic Church would not be pleased with this film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Miramax",
        "duration": "PT1M57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1151140121",
        "name": "Priest",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWE2NGI4YTgtZjU0Ni00MjZmLWI3ZTYtOGM4YzVkOTUwYTJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWE2NGI4YTgtZjU0Ni00MjZmLWI3ZTYtOGM4YzVkOTUwYTJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:27:15Z",
        "url": "https://www.imdb.com/video/vi1151140121/"
    },
    "url": "/title/tt0110889/"
}