{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3842,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103289/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        }
    ],
    "datePublished": "1992-12-15",
    "description": "Detective Chief Inspector Jane Tennison's (Dame Helen Mirren's) investigation of a murder is complicated with the unexpected participation of her secret lover in her detective unit.",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU2ODczMjQ0Nl5BMl5BanBnXkFtZTcwNTM2MDAwMQ@@._V1_.jpg",
    "keywords": "murder,investigation,detective,detective chief inspector,suspect",
    "name": "Prime Suspect 2",
    "original_info": {
        "id": "Prime Suspect 2_1992",
        "name": "Prime Suspect 2",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2017-08-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0103516/"
        },
        "name": "Jane Tennison: The triumphant return",
        "reviewBody": "Absolutely loved the first 'Prime Suspect' series. It was to me some of the best television to grace my television set, and a classic example as to why the 'Prime Suspect' shows in general adapt Lynda La Plante's work the best (far more consistent than 'Trial and Retribution' and leagues ahead of 'Above Suspicion', the latter of which did little for me).\n\n'Prime Suspect II' is a triumph. It is every bit as brilliant as the first 'Prime Suspect' series, and while there will always be the debate as to whether it's better or inferior from personal opinion it's equal, though 'Prime Suspect II' feels a little more settled characterisation-wise and in the complexity.\n\nIt is stylishly and cleverly filmed, with slick editing and atmospheric lighting, and there is a consistently wonderful atmosphere throughout. It is very hard to forget the music score too. The scripting, like its predecessor, is some of the best there is of any mystery/detective drama, being superbly constructed and intelligent. The story is complex and easy to follow, utterly gripping from start to finish and with an incredible intensity and real emotional impact.\n\nStandout scenes are with the distraught mother, which will break the heart of even those without children, and the deathbed confession, have to completely agree that the latter is some of the most gripping television of its kind produced. The portrayal of racism features strongly and is quite harrowing but is never laid on too thick.\n\nTennison is every bit as interesting as in the first series, and gets even more development. The depiction of the police force is just as ahead of its time in Tennison's treatment from the other officers. The confrontations and procedural aspects have a lot of tension.\n\nHelen Mirren gives a typically magnificent performance in the lead, but the acting is great across the board as to be expected. Colin Salmon and John Benfield are more than up to Mirren's level.\n\nAll in all, a triumph. 10/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Prime Suspect 2",
        "duration": "PT2M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3380919321",
        "name": "Prime Suspect 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTcyNDJjN2MtMjdhMS00MTc1LThmODgtNWQwZWJlZDZhMDljXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTcyNDJjN2MtMjdhMS00MTc1LThmODgtNWQwZWJlZDZhMDljXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-22T22:19:32.007Z",
        "url": "https://www.imdb.com/video/vi3380919321/"
    },
    "url": "/title/tt0103516/"
}