{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Lindsay Wagner",
            "url": "/name/nm0905993/"
        },
        {
            "@type": "Person",
            "name": "Paul Michael Glaser",
            "url": "/name/nm0001274/"
        },
        {
            "@type": "Person",
            "name": "Robert Urich",
            "url": "/name/nm0001810/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 388,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072315/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044096/"
        }
    ],
    "datePublished": "1983-11-06",
    "description": "The lovely Daisy Valenski (Merete Van Kamp) is the daughter of Russian Prince Stash Valensky (Stacy Keach) and American movie star Francesca Valenski (Lindsay Wagner). After her parents are killed, she flees from her half-brother ...",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU2Nzc3MDkwN15BMl5BanBnXkFtZTcwNjMxOTQyMQ@@._V1_.jpg",
    "keywords": "tv mini series,twin,new york city,manhattan new york city,secret",
    "name": "Princess Daisy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "petershelleyau"
        },
        "dateCreated": "2002-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086140/"
        },
        "name": "Krantz does Kelly",
        "reviewBody": "Those hoping for a Scruples orgy of Lindsay Wagner will be disappointed or relieved as she only appears in the first 30 minutes of this 3 hour saga. Her one memorable moment is standing on a Big Sur cliff top reading a letter (as one does), while the wind blows the blonde tendrils of her scarfed hair around her head.\n\nWagner is Francesca Valenski, a former movie star who marries Russian Prince Stash (Stacy Keach) and bears him twin daughters, Daisy and Danielle. Regrettably Danielle is brain damaged, and institutionalised at birth, something Stash keeps from Francesca. When she finds out, she leaves him to go to America. However when Francesca is killed in a car accident, Stash takes the girls to live in England and returns Danielle to St Anne's. Although visited regularly by Daisy, she remains a secret, until Daisy's private life is exposed to international media by her spiteful half-brother Ram (Rupert Everett) when she becomes a cosmetics model in New York courtesy of tycoon Patrick Shannon (Robert Ulrich). Will the publicity ruin romance? And will make-up sales decline?\n\nThe teleplay by Diana Hammond, based on the novel by Judith Krantz, seems to have derived Francesca Valenski from the story of Grace Kelly. The only intriguing plot element is incest, and Daisy delivers a well-written speech to her commercial company boss Charles North (Paul Michael Glasser) about why she doesn't want to be his girlfriend. Otherwise this production directed by Waris Hussein is only notable for Ringo Star cast as a gay fashion designer, Keach eating a piece of toast, another brooding bad performance by Everett, and the indeterminate accent of Michelle Pfeiffer look-alike Merete van Kamp as Daisy."
    },
    "url": "/title/tt0086140/"
}