{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Oleg Menshikov",
            "url": "/name/nm0579823/"
        },
        {
            "@type": "Person",
            "name": "Sergey Bodrov",
            "url": "/name/nm0091074/"
        },
        {
            "@type": "Person",
            "name": "Susanna Mekhraliyeva",
            "url": "/name/nm0577277/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4605,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Prisoner of the Mountains",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079193/"
        },
        {
            "@type": "Person",
            "name": "Arif Aliev",
            "url": "/name/nm0019732/"
        },
        {
            "@type": "Person",
            "name": "Sergei Bodrov",
            "url": "/name/nm0091076/"
        },
        {
            "@type": "Person",
            "name": "Boris Giller",
            "url": "/name/nm0318851/"
        }
    ],
    "datePublished": "1997-01-31",
    "description": "Two Russian soldiers, one battle-seasoned and the other barely into his boots and uniform, are taken prisoner by an anxious Islamic father from a remote village hoping to trade them for his captured son.",
    "director": [
        {
            "@type": "Person",
            "name": "Sergei Bodrov",
            "url": "/name/nm0091076/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGZjMTc4ZDgtYTRkZS00NzY2LTlhMzMtODJmZGJhOTI4NjFlXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "chechnya,prisoner of war,russian soldier,caucasus,uniform",
    "name": "Kavkazskiy plennik",
    "original_info": {
        "id": "Prisoner of the Mountains_1996",
        "name": "Prisoner of the Mountains",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jlawrenc"
        },
        "dateCreated": "2004-05-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116754/"
        },
        "name": "These two Russian soldiers show the viewer the relationship and dynamic of the Russia that was and the Russia that is trying to emerge.",
        "reviewBody": "Like many other Russian films, the two main characters in `Prisoner of the Mountains' can be viewed as representative of the Russia that was and the Russia that is. Through their interactions with each other and the other characters in the movie, it is possible to draw conclusions about the state of the new Russia, the relationship between Old and New, and the problems and challenges that new Russia will face.\n\n Ivan, the young, innocent Russian soldier represents the new Russia. He is open, accepting, inexperienced, and most importantly, he is not filled with hate. The second Russian soldier in the film, Sasha, is the old Russia. He is experienced in war and killing; as he puts it, he did not start out a killer, but he learned to love it over time. He was not always so callus, but grew so because of his environment. He is hard, cold, and firmly believes in the limits that race and ethnicity place on people. These two are both captured, and as they spend time living amongst their captors, both seem to form relationships and bonds with them. Sasha, however, only does this to gain their trust, and without a moments hesitation kills Hasan, the mute, with whom he spent so much time. Ivan, on the other hand, creates genuine bonds, truly finding love with the young girl. Ivan is not caught up with the fact that his feelings are taboo; his young heart and his open mind do not have room for hate.\n\n Ivan is caught up in a war he has no part of; it is Sasha's war, not his. Because of the actions of Sasha, old Russia, the potential relationship between Ivan and the young girl, new Russia and Chechnya, is never realized. Ivan suffers because of the moves made on his behalf by the war mongering Sasha. Sasha has nothing to escape for, but he promises Ivan he will get him home. Sasha's method, however, only serves to worsen the situation. Even when Sasha is dead, it is too late for Ivan, the scars, distrust, and hatred run too deep to ever be mended, and new Russia is left dealing with the issues and hate it does understand that old Russia has left behind."
    },
    "url": "/title/tt0116754/"
}