{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Meg Ryan",
            "url": "/name/nm0000212/"
        },
        {
            "@type": "Person",
            "name": "Russell Crowe",
            "url": "/name/nm0000128/"
        },
        {
            "@type": "Person",
            "name": "David Morse",
            "url": "/name/nm0001556/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 57870,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0040620/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090310/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0112879/"
        },
        {
            "@type": "Person",
            "name": "Tony Gilroy",
            "url": "/name/nm0006904/"
        },
        {
            "@type": "Person",
            "name": "William Prochnau",
            "url": "/name/nm0698295/"
        },
        {
            "@type": "Person",
            "name": "Thomas Hargrove",
            "url": "/name/nm0362998/"
        }
    ],
    "datePublished": "2000-12-08",
    "description": "Alice hires a professional negotiator to obtain the release of her engineer husband, who has been kidnapped by anti-government guerrillas in South America.",
    "director": [
        {
            "@type": "Person",
            "name": "Taylor Hackford",
            "url": "/name/nm0000431/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMyODkwNzM3OV5BMl5BanBnXkFtZTYwMTc5Nzc5._V1_.jpg",
    "keywords": "hostage,ransom,pipeline,prisoner,jungle",
    "name": "Proof of Life",
    "original_info": {
        "id": "Proof of Life_2000",
        "name": "Proof of Life",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Shiva-11"
        },
        "dateCreated": "2000-12-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0228750/"
        },
        "name": "Proof that you can follow up a blockbuster with another good film",
        "reviewBody": "\"Globalization\" is one of those catchy buzzwords that shares the stage with the likes of \"abortion\", and \"capital punishment\"- while one group of people thinks it is a good thing that just might save the world, another thinks it is on par with the plague. There is however no dispute that with advancements in technology and the search for new capital markets, businesses are expanding abroad at a phenomenal rate into countries with little infrastructure or wealth and the ever-present danger of war. This expansion has also been the catalyst for a lucrative sideline business - kidnapping.\n\nPeter Bowman is a man trying to do the right thing. In order to build a dam to stop the killer floods in the South American country of Teclac he must work under the auspices of a large oil concern. As with any overseas project, Peter has to deal with many problems: lack of supplies, red tape, feelings of isolation, a crumbling marriage and living with the threat of terrorist activity. While on his way to work Terry is stopped at a roadblock and taken hostage by a band of guerrillas who demand a huge ransom for his release. Enter Terry Thorne, an insurance investigator whose specialty is \"K and R\" - kidnapping and ransom. Terry's job is to negotiate the release of kidnapped foreign nationals. And he is a very busy man.\n\nThis movie really piqued my interest and not because of the off-screen romance between Meg Ryan and Russell Crowe: the father of a good friend of mine is an international financial consultant, and he was almost kidnapped while working in SouthEast Asia. The attempt was foiled by the quick actions of the special security detail that intercepted details of the plan and whisked him out of the country. I spoke with him after seeing the trailers for the movie and he said that in country he is currently working in you do not anywhere without heavily armed escorts. The possibility of being kidnapped is viewed as the cost of doing business. I forgot to ask him if they had the appropriate insurance.\n\n\"Proof of Life\" grew out of a story in Vanity Fair and is loosely based on the kidnapping of an American businessman by Colombian guerillas. Taylor Hackford is a director who eschews the safety of studios, and opts for that extra touch of realism. In keeping with this goal, he took the cast and crew down to Ecuador, where he was met with erupting volcanoes, blizzards, a cast beset with altitude sickness, a coup in Quito, muggings, heart attacks on the set and the death of a stand-in. The final cut is an apt homage to those involved.\n\nTypically cast as the funny, quirky, girlfriend afflicted with endless mini-crises, Meg Ryan has been afforded few opportunities to demonstrate acting abilities. As Alice Bowman, she has the chance to flesh out a multidimensional character that doesn't spend her onscreen time whining, crying or laughing insipidly. And she does so admirably. Russell Crowe, riding high after the success of \"Gladiator\", once again delivers a solid performance. Crowe draws heavily on his own quiet, severe introspection to create a character conflicted between loyalties, expectations and realities and the feelings he tries to suppress for Ryan's character. Their real life tryst helped to establish the tone for the powerful, yet subtle scenes they share onscreen. David Morse is excellent as Terry, a man trying to hang onto his sanity in an insane situation. As he is marched across country, and endures humiliation, and beatings, he never loses sight of his goal to stay alive and escape. His transformation from clean cut businessman (I've never seen him with such a close shave) to disheveled captive is done slowly and deliberately, and the viewer appreciates what he's experiencing. Finally, it was interesting to see David Caruso - who has floated in the acting netherworld since he left \"NYPD Blue\" almost six years ago - as a rival K&R specialist who assists Terry with his mission. Caruso reminds us why he has not graced many marquees - he's not very funny, action is not his forte, and he is an average actor at best. The other star of the film is the location.\n\nWith most of the film having been shot in the mountains of Ecuador, (the guerrillas camp was literally carved out of the jungle) it is not surprising that the film looks gorgeous: tumbling waterfalls, plunging ravines and flourishing jungles are stock backdrops for the story and you begin to take them for granted. One of my favorite scenes was when the infinite expanse of greenery is broken by a band of camouflaged rebels who were totally invisible only moments earlier. I was surprised how tight the cinematography was given the expansive vistas, but nothing is sacrificed in the process. In addition to a well-written script that avoids most cliches, and contains palpable suspense, I was impressed with the way the relationship between Alice and Terry was handled. Rather than have the characters jumping into bed for a sweatfest the writers opted for an undercurrent of subtle tension with the characters exchanging occasional confused glances and moments of awkward silence when their hands brush.\n\nThe first entertaining intelligent film to come out of Tinseltown in a long while - maybe it bodes well for the Christmas rush."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3114074393",
        "name": "Proof of Life",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2NkZWFlNzctOTczZi00ODA0LThlYjAtMjAzNGE0Nzk3YjgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2NkZWFlNzctOTczZi00ODA0LThlYjAtMjAzNGE0Nzk3YjgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:28:01Z",
        "url": "https://www.imdb.com/video/vi3114074393/"
    },
    "url": "/title/tt0228750/"
}