{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rouxnet Brown",
            "url": "/name/nm0114601/"
        },
        {
            "@type": "Person",
            "name": "Shaun Smyth",
            "url": "/name/nm0810804/"
        },
        {
            "@type": "Person",
            "name": "Neil Sandilands",
            "url": "/name/nm1442644/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 675,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0110538/"
        },
        {
            "@type": "Person",
            "name": "John Greyson",
            "url": "/name/nm0340742/"
        },
        {
            "@type": "Person",
            "name": "Jack Lewis",
            "url": "/name/nm1440688/"
        }
    ],
    "datePublished": "2004-06-07",
    "description": "An interracial gay love story set in early 18th century South Africa about two men -- a black prisoner living in a Cape Town penal colony and a Dutch sailor -- who weather injustices as a result of their affair.",
    "director": [
        {
            "@type": "Person",
            "name": "John Greyson",
            "url": "/name/nm0340742/"
        },
        {
            "@type": "Person",
            "name": "Jack Lewis",
            "url": "/name/nm1440688/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzNjY1NDcxMV5BMl5BanBnXkFtZTcwOTcyNTY1Mw@@._V1_.jpg",
    "keywords": "aerial camera shot,colony,dutch,sailor,sodomy",
    "name": "Proteus",
    "original_info": {
        "id": "Proteus_2003",
        "name": "Proteus",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Havan_IronOak"
        },
        "dateCreated": "2004-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0379461/"
        },
        "name": "A well told story based on true life",
        "reviewBody": "This film, based on a true story tells of Rijkhaart Jacobsz and Claas Blank two men who were imprisoned and met on Robben Island 1718 and 1735. These two men met and fell in love on the island that would, many years later become the site of Nelson Mandela's life sentence.\n\nRijkhaart Jacobsz was a Dutch sailor that had been sentenced there for homosexuality. It is there that he met Claas Blank, a aboriginal (Hottentot) who had run afoul of the law and was acquitted of any crime because there was insufficient evidence of his committing any crime but was sentenced to 10 years hard labor because he had been accused.\n\nThe story also tells us of Virgil Niven a Dutch plant biologist who had come to South Africa to classify the plant life there but was afraid to return home after the Dutch in Amsterdam began a pogrom of homosexuals.\n\n While this story is NOT well known in South Africa today one hopes that with this film it will become more widely known. South Africa has one of the most enlightened constitutions in the world with an equal protection clause for sexual preference in their Bill of Rights.\n\nThe film uses a creative approach to anachronism to help tell its story, mixing modern day elements with what is essentially a historical costume drama. Many of these elements were reported by the director to have special historical significance to those that know the full history of Robben Island, for the rest of us it just makes for an interesting device that adds a bit of spice to what some may think is a too-drawn out story.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0379461/"
}