{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lance Henriksen",
            "url": "/name/nm0000448/"
        },
        {
            "@type": "Person",
            "name": "Jeff East",
            "url": "/name/nm0247532/"
        },
        {
            "@type": "Person",
            "name": "John D'Aquino",
            "url": "/name/nm0195383/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25509,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046277/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021078/"
        },
        {
            "@type": "Person",
            "name": "Ed Justin",
            "url": "/name/nm0433179/"
        },
        {
            "@type": "Person",
            "name": "Mark Patrick Carducci",
            "url": "/name/nm0136737/"
        },
        {
            "@type": "Person",
            "name": "Stan Winston",
            "url": "/name/nm0935644/"
        }
    ],
    "datePublished": "1989-01-13",
    "description": "After a tragic accident, a man conjures up a towering, vengeful demon called Pumpkinhead to destroy a group of unsuspecting teenagers.",
    "director": [
        {
            "@type": "Person",
            "name": "Stan Winston",
            "url": "/name/nm0935644/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTY1MWNkOTktNjIyMC00NDEzLWI5MGEtNWYxOTNmYjc2MzNmXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "demon,vengeance,monster,first part,evil",
    "name": "Pumpkinhead",
    "original_info": {
        "id": "Pumpkinhead_1988",
        "name": "Pumpkinhead",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2010-10-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095925/"
        },
        "name": "His enemies are mostly dead, he's mean and unforgiving.",
        "reviewBody": "Pumpkinhead is directed by Stan Winston and stars Lance Henriksen, Jeff East, John D'Aquino, Kimberly Ross & Joel Hoffman. Music is by Richard Stone and cinematography comes from Bojan Bazelli. Plot sees Henriksen play Ed Harley, a loving and devoted father raising his young son on his own after the death of his wife. His world is shattered when a group of adventure seeking teenagers accidentally kill his boy in a motorbike incident. Struck with grief and fury, Ed seeks out a mountain dwelling witch that can invoke the demon Pumpkinhead to do his vengeful bidding for him. However, calling up Pumpkinhead comes at a cost to Ed as much as it does to the teenagers it now seeks.\n\nTho in essence it is just a creature on the loose killing the teens movie, so a stalk and slash piece if you like, Pumpkinhead is more appealing than most of its ilk. It's an old fashioned movie, rich on atmosphere, presenting a moralistic tale that's steeped in rural folklore and horror legend. It's also propelled forward by a damn great performance from Henriksen. Special effects guru Winston directs assuredly, with a strong visual sense and a knowing that as his movie shifts to the inevitable kill after kill sequence; he had to develop his protagonist first. It's during the first half where Pumpkinhead earns its stripes as Winston takes time to fully form the relationship between father and son, it's tender and very believable, so when the tragedy happens, Ed's reaction is totally understandable. We too feel vindictive such is the way Henriksen has let us feel the love.\n\nOn to the second half where the magnificent creature makes its appearance and the blood starts to flow. Here the film is only let down by its relatively low budget and the fact that Winston has nowhere to go other than formula. The youths are the usual array of cocky, bickering shriekers, tho in fairness a couple of the girls here are at least scripted as being intelligent and capable of reasoning. But thankfully in amongst the carnage is Henriksen peeling off another emotional layer, as he starts to get conflicted about what he has done. A fine performance from an actor who is far better than his king of schlock reputation. Tho still rated averagely on some internet movie sites, Pumpkinhead (dreadful name in truth) has garnered, and earned, a big cult fan base. Popular enough to warrant a solid 20th Anniversary DVD release, there's a chance that it will find more fans along the way. It deserves it, if only for Henriksen, the creature, and the attention to art design and detail. And of course if you like the stalk and slash formula anyway? Well it delivers there too. 7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3155345177",
        "name": "Pumpkinhead",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGI2OTkzZWEtYjg5Zi00MWNmLWIzODUtZTFlNDBkODUyMzYwXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGI2OTkzZWEtYjg5Zi00MWNmLWIzODUtZTFlNDBkODUyMzYwXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-12-11T17:05:08.533Z",
        "url": "https://www.imdb.com/video/vi3155345177/"
    },
    "url": "/title/tt0095925/"
}