{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adam Sandler",
            "url": "/name/nm0001191/"
        },
        {
            "@type": "Person",
            "name": "Emily Watson",
            "url": "/name/nm0001833/"
        },
        {
            "@type": "Person",
            "name": "Philip Seymour Hoffman",
            "url": "/name/nm0000450/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 169004,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003580/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027686/"
        },
        {
            "@type": "Person",
            "name": "Paul Thomas Anderson",
            "url": "/name/nm0000759/"
        }
    ],
    "datePublished": "2002-11-01",
    "description": "Socially frustrated Barry Egan calls a phone-sex line to curb his loneliness. Little does he know it will land him in deep trouble and will jeopardize his burgeoning romance with the mysterious Lena.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Thomas Anderson",
            "url": "/name/nm0000759/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmE1OTY4NjgtYjcwNC00NWE4LWJiNGMtZmVhYTdlMWE1YzIxXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
    "keywords": "absurd comedy,seduction,sister,love,pudding",
    "name": "Punch-Drunk Love",
    "original_info": {
        "id": "Punch-Drunk Love: Bonus Material_2002",
        "name": "Punch-Drunk Love: Bonus Material",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jcdugger"
        },
        "dateCreated": "2005-10-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0272338/"
        },
        "name": "This movie is all LOVE!",
        "reviewBody": "Paul Thomas Anderson's Punch-Drunk Love is a fascinating film. Perhaps 2002's best movie - and one of the best drama/romantic-comedies to ever hit the silver screen.\n\nPT Anderson is an absolute genius. A talented and master film-maker. Boogie Nights and Magnolia, two of Anderson's previous films, were absolutely stunning. Boogie Nights, in particular, was a complete masterpiece. And Punch-Drunk Love is no exception, another great piece of film-making by what is quickly becoming one of the world's top Directors. I can't wait for whatever he does next.\n\nAlso, it's difficult to overstate the performance of Adam Sandler. I'm confident this will go down in history as his best work. Ironically, I thought I'd never see this movie because of Sandler starring in it. (I ONLY watched it because of my respect for PT Anderson - and I still waited 3 years to see it!). I enjoy most of Sandler's non-romantic comedies, but I couldn't even imagine him in a romantic movie, I thought he would be horrible. I couldn't have been more wrong. I wasn't prepared for such a great performance, as he stole the show from the opening scene. I can't remember ever being more surprised with the lead actor in a movie. He was simply great, a truly terrific performance.\n\nOn the flip side, Emily Watson, as the caring Lena, was wonderful as well. I've got the feeling we will be seeing much more of her, as she had a breakout performance here in PDL. I thought at first that she almost looked too beautiful to put up with the antics of someone like Sandler's character (as she would be in high demand with the males), but then we see the quirky side of her as well, and it all comes together. Great touch.\n\nI recommend this movie to anyone over the age of 25. If you're a teenager who's hoping for a few laughs from Sandler, you're going to be gravely disappointed. Buy the movie, store it in your closet, and pull it out when you reach 30 - and you'll love it! And please, don't let \"romantic comedy\" scare you (as it does me). I almost REFUSE to watch romantic comedies, but this one is much different. Romance and comedy surely aren't the first things that come to mind when I think of this film. It's a drama full of tension and embarrassment. It's an uplifting, yet shocking movie. To the intellectual mind, I can't recommend it enough.\n\nThank you for reading!...\n\nJD",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3365732633",
        "name": "Punch-Drunk Love",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDhmNDZkOWYtMzg4YS00NmE3LThhNTYtY2QwYmE0N2E4MjY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDhmNDZkOWYtMzg4YS00NmE3LThhNTYtY2QwYmE0N2E4MjY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:28:38Z",
        "url": "https://www.imdb.com/video/vi3365732633/"
    },
    "url": "/title/tt0272338/"
}