{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "K.K. Barrett",
            "url": "/name/nm0057187/"
        },
        {
            "@type": "Person",
            "name": "Roberta Bayley",
            "url": "/name/nm1179878/"
        },
        {
            "@type": "Person",
            "name": "Jello Biafra",
            "url": "/name/nm0080470/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1635,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028239/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0114980/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035637/"
        },
        {
            "@type": "Person",
            "name": "Don Letts",
            "url": "/name/nm0504824/"
        }
    ],
    "datePublished": "2005-07-04",
    "description": "A documentary on the music, performers, attitude and distinctive look that made up punk rock.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Letts",
            "url": "/name/nm0504824/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA5ODY4ODk2MV5BMl5BanBnXkFtZTcwMDAyMjIzMQ@@._V1_.jpg",
    "keywords": "punk,punk rock,musician,band,interview",
    "name": "Punk: Attitude",
    "original_info": {
        "id": "Punk: Attitude_2005",
        "name": "Punk: Attitude",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2010-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0446765/"
        },
        "name": "The roots a radical.",
        "reviewBody": "Punk: Attitude is a documentary directed by Don Letts. An important figure in the punk explosion in England circa 1976, Letts has always held the subject of punk rock close to his heart. Here he explores the \"punk\" revolution, its roots and its impact on modern rock music. The cast features the likes of David Johansen, Thurston Moore, Tommy Ramone, Chrissie Hynde, Henry Rollins, Captain Sensible, Jim Jarmusch, Mick Jones, Jello Biafra, Howard Devoto and Glen Matlock. To name but a few!\n\nAs the title suggests, this is about the attitude that is essential to the make up of the punk rock genre. This is not a film that is telling you lies about its time-lines or an attempt to ensure the viewers know how important punk was in the pantheon of music. It's refreshingly honest, in fact what is the most striking thing about Letts' movie is that this is no stroll down a rose tinted glassy memory lane. For sure there's warmth in recollections from many of the big shakers, while some of the old footage clips of the bands are sure to stir strong emotions in fans, but nobody is trying to hide the genre limitations of punk. Letts threads it nicely as a triple bill of birth, death and revival. Starting out with an attitude nod of acknowledgement to Jerry Lee Lewis and other more daring 50s & 60s acts, the film starts gaining its worth with some well spent time in the company of The New York Dolls, Velvet Undeground, MC5 and of course Iggy Pop & his Stooges. The influence of such luminaries of course comes as no surprise to any old punker such as I, but for new parties interested in punk this serves as an essential piece of film.\n\nInto the mid 70s where of course things got serious and both America and England witnessed what in all essence was \"thee\" punk rock explosion. Again the principals don't hold back, telling it as it was and even debunking some myths. There's even some resentment in there, but Letts is canny enough to not let this become another boorish America Vs England who started punk section of his film. He also widens the scope to involve many artists who never get a look in when the topic is covered on the page or on the screen. Rest assured this is not a Sex Pistols, Clash, Damned and Ramones retread overkill, time is rightly afforded to Poly Styrene (X Ray Spex), Howard Devoto & Pete Shelley (The Buzzcocks), Siouxsie Sioux (Siouxsie & The Banshees) & Ari Up (The Slits). Important movers with important and interesting things to say. And so it proves as the story arc moves forward to post 70s punk; New Wave/ No Wave, Hardcore et al, all given thought and time with the likes of Henry Rollins (Black Flag), Jello Biafra (Dead Kennedys) and Thurston Moore (Sonic Youth), who not only link the narrative, but expand it further too.\n\nObviously in a film such as this it's inevitable that not every genre fan will be happy. For every ten bands featured, there is another twenty bands who many will believe should have been put in for acknowledgement and opinion. As is the case for some of the offshoots of punk such as the Oi! movement or the British second and third waves that encompassed street and speed punk. In truth the 80s does get a little passed over due to the time afforded the 70s, but that's forgivable surely since that was the prominent time and the time when music got a kick up the backside. Besides which, to cover everything appertaining to punk we would need a film of Lord Of The Rings Trilogy type excess! 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0446765/"
}