{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mischa Barton",
            "url": "/name/nm0059215/"
        },
        {
            "@type": "Person",
            "name": "Cameron Van Hoy",
            "url": "/name/nm0887226/"
        },
        {
            "@type": "Person",
            "name": "Burt Reynolds",
            "url": "/name/nm0000608/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1762,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0087725/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009905/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070113/"
        },
        {
            "@type": "Person",
            "name": "Ash Baron-Cohen",
            "url": "/name/nm0038609/"
        }
    ],
    "datePublished": "2000-07-06",
    "description": "Rebellious teenager Stevie finds his mother's gun, and along with his girlfriend impulsively decides to rob a bank. The pair find themselves in over their heads as they take hostages and the FBI negotiates Stevie's absurd demands.",
    "director": [
        {
            "@type": "Person",
            "name": "Ash Baron-Cohen",
            "url": "/name/nm0038609/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzFjNmRiNjctZmM3ZC00Y2I1LTkzODgtNDMzNmFhNDY5MTVlXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "teen movie,fbi federal bureau of investigation,bank,hostage,tween girl",
    "name": "Pups",
    "original_info": {
        "id": "Pups_1999",
        "name": "Pups",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cyndrix"
        },
        "dateCreated": "2003-10-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0185101/"
        },
        "name": "It's heart is in the right place, but the execution is lacking",
        "reviewBody": "I respect what Ash was trying to do with this movie, and the guerilla film making style could have worked. To make a great movie, you don't need a huge budget, fancy distribution, or heavy promotions; but you do need a good script.\n\nWhen you're trying to watch a film that realistically depicts the angst of today's youth, cliche lines like \"what about when you touched me down there?\" only detract. Trouble is, this film is filled with cliches that tend to take away from the message.\n\nThe film also would have done better to just be honest instead of trying to prove it's cool factor. I mean, Kurt Loder??? The idea of having Kurt freaking Loder in a movie sounds more like the idea of a bunch of 50 year old balding executives wearing suits in a boardroom trying to be \"hip\" and \"cool\" than that of a director who actually is hip and/or cool. In fact, that pretty much sums up a lot of this film: it tries to be cool instead of just being cool. It almost seems like a big budget film trying to pretend it was made by a young hipster director on a tight budget.\n\nThen, why is the lack of professionalism sorely evident in the lackluster acting and weak script? The kids probably could have done a decent job with more time and coaching, but this seems like it was shot in a single day. The raw talent is there, it just isn't polished. The same can be said for the film making itself...I even saw the boom mic in one shot.\n\nPups is a decent movie that could have been great. There are seeds of truth in Pups and a fair amount of honesty. You just have to be willing to weed through the cliches, rammed down your throat morality, fake coolness, and Kurt Loder to see it. \n\nObviously, the studio didn't think much of this movie. The DVD isn't even widescreen. If you want to see a movie that is cool without trying so hard to be, then definitely watch Clerks or Doom Generation. If you want to see an average movie that perhaps offers a glimpse into the angst of teens without telling the full story, Pups is a decent romp. If you can imagine a younger version of SFW, that's pretty much what this movie is. \n\n Oh, by the way....Burt Reynolds, your career called. It said it's jumping off a cliff."
    },
    "url": "/title/tt0185101/"
}