{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christian Slater",
            "url": "/name/nm0000225/"
        },
        {
            "@type": "Person",
            "name": "Gil Bellows",
            "url": "/name/nm0004743/"
        },
        {
            "@type": "Person",
            "name": "Estella Warren",
            "url": "/name/nm0005535/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1704,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0142424/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014903/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0089252/"
        },
        {
            "@type": "Person",
            "name": "Maggie April",
            "url": "/name/nm1860653/"
        }
    ],
    "datePublished": "2006-09-20",
    "description": "A fast rising hi tech executive must protect his career and family from the ruthless tactics of a homicidal corporate headhunter.",
    "director": [
        {
            "@type": "Person",
            "name": "Kristoffer Tabori",
            "url": "/name/nm0846070/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWVjMTRiZWMtNDM3MC00NjcyLWJmZDgtYzllYTNhN2VlNzYzXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "poison,false identity,electrocution,blackmail,fall",
    "name": "Pursued",
    "original_info": {
        "id": "Pursued_2004",
        "name": "Pursued",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pierotti"
        },
        "dateCreated": "2005-11-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0385969/"
        },
        "name": "Corporate Crooks",
        "reviewBody": "I am going to disagree with every other person who seems to have commented on this film. The worst thing about it is Christian Slater, who plays what I like to think of as a \"Garden Variety Hollywood Psycho\". Think Bettlejuice with a better complexion in an Armani suit or Hannibal Lecter on a diet of espresso rather than Fava beans. Slater's character Vincent chews the scenery shamelessly and seems to have the omniscient information that these psychos always seem to have. I do agree that Gil Bellows is largely an empty cipher in the center of the movie, he's basically playing the same troubled weak guy he played in Ally McBeal. The only time he comes to life is when he's attacking Slater's character.\n\nAs Bellow's wife Estella Warren does her usual decent job, playing a woman confused by her husband's behavior, although the smart woman she seems to be would have seen through Vincent in about 5 minutes. She also needs to work on that anxious look she perfected in Planet of the Apes and uses as her predominant expression throughout most of this film. Still this movie does establish one thing. If Angelina Jolie has the finest lower lip in Hollywood, Estella warren definitely has the mosy sensuous upper lip. There is one scene where Warren comforts her PlanetOTA co-star Michael Clark Duncan, who plays, of all things, a venture capitalist.\n\nUnfortunately all this scene did for me was to think what a great General Thade (another classic Hollywood Psycho) Christian Slater could have been.\n\nThe continuity in this film seems odd. Key scenes of exposition, especially between the husband and wife, are missing. The wife appears to change her opinions about her husband and what is going on without ever having a scene where she realizes that Vincent is dangerous and her husband isn't crazy. There are also scenes of high tension with no payoffs. I especially would have liked a scene that wraps up how the situation with Vincent was resolved and whether the crooked cop got taken down. All we get is Vincent dies and Billy, er Benji's company becomes a success with no explanation how or why. I suspect that the filmmakers were trying to make the standard 90 minute film and cut out too much in their effort to meet this demand.\n\nTo conclude, if you like Hollywood Psychos and their near invincibility you will probably enjoy this film. If on the other hand you are bothered by bad editing and odd inexplicable motivations on the part of major characters you should probably save your money. On the other hand this is still a better movie than Stra Wars I or the Fantastic 4.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A fast rising hi tech executive must protect his career and family from the ruthless tactics of a homicidal corporate headhunter.",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1032373017",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2Q2MWI4Y2QtNTk2ZS00ZWRkLWIxNDUtYjFhODdlZjAwOGVmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2Q2MWI4Y2QtNTk2ZS00ZWRkLWIxNDUtYjFhODdlZjAwOGVmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-22T00:57:00.677Z",
        "url": "https://www.imdb.com/video/vi1032373017/"
    },
    "url": "/title/tt0385969/"
}