{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Cusack",
            "url": "/name/nm0000131/"
        },
        {
            "@type": "Person",
            "name": "Billy Bob Thornton",
            "url": "/name/nm0000671/"
        },
        {
            "@type": "Person",
            "name": "Cate Blanchett",
            "url": "/name/nm0000949/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29856,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023055/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079747/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035313/"
        },
        {
            "@type": "Person",
            "name": "Darcy Frey",
            "url": "/name/nm0294550/"
        },
        {
            "@type": "Person",
            "name": "Glen Charles",
            "url": "/name/nm0153036/"
        },
        {
            "@type": "Person",
            "name": "Les Charles",
            "url": "/name/nm0153080/"
        }
    ],
    "datePublished": "1999-04-23",
    "description": "A feud develops between two air traffic controllers: one cocky and determined while the other is restrained and laidback, which inevitably affects their lives.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Newell",
            "url": "/name/nm0001565/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmZiNmRmMGYtZTMwNS00ZGQ2LThmMTctZWNmZWQzZWE5Mzg3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "cheating wife,two word title,air traffic controller,air traffic control,marriage",
    "name": "Pushing Tin",
    "original_info": {
        "id": "Pushing Tin_1999",
        "name": "Pushing Tin",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "1999-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120797/"
        },
        "name": "Interesting, detailed characters and workplace. *** out of ****.",
        "reviewBody": "PUSHING TIN (1999) ***\n\nStarring: John Cusack, Billy Bob Thornton, Cate Blanchett, Angelina Jolie, and Jake Weber Directed by: Mike Newell Running time: 124 minutes Rated R (for language, and some sexuality/nudity)\n\nBy Blake French:\n\n\t\"Pushing Tin\" is really nothing more than a very interesting character study that maintains support from its script to succeed. So many movies these days have well-written characters but not the thriving screenplay to back them up. At last, we can enjoy a film with strong comic performances, smart dialogue, and an engaging atmospheric environment.\n\n \tThe film stars John Cusack as a hot shot air traffic controller named Nick Falzone, nicknamed \"the zone\" because he is truly the best at his profession. He lives in New Jersey with his happy housewife, Connie, and their son. (who is seldom mentioned or seen.) He has an intense, stressful work life, enjoys having fun with his co-workers, and seems to have a pretty optimistic look at life. \n\n\tAll things change, however, when Nick meets his new neighbor, Russell Bell. He's a roughneck motor cycle-driving, quiet and challenging man who really needs to shave. Nick immediately feels tension between Russell and himself. And it just so happens that Russell is also an air traffic controller, making things even more competitive between these two individuals. The two soon begin efforts to try to impress the other, in and outside the job. \n\n \tThe personal battles between Nick and Russell soon put each of them in bed with the opposite's wife. Nick is the first to commit adultery when he falls for Bell's highly attractive young wife, Mary. While he meant well, by taking her out for dinner after observing Mary sobbing at the grocery store, when they got home, things obviously got out of hand. \n\n \tThe movie is very detailed both in the workplace and in its colorful, intriguing characters. The original tasting flavor of being placed in an air traffic control tower is quite captivating. The characters stare at the plane monitors like children at a television screen while playing a video game. The characters themselves are relevant, ordinary people, which is why they are so easy to relate to. Even though some of their personalities and motives are instantly obvious, we still have lots of fun watching their everyday living style\n\n\tWhile some comedies would eventually regulate into a formalistic climax and follow predictable events, \"Pushing Tin\" is too smart for that. The ending is happy and light hearted, but it's most of the fun getting there. Mike Newell, director of \"Four Weddings and a Funeral,\" knows exactly what he wants out of the actors here, and they do exceedingly well at giving what he requires. Each fits their character perfectly, especially Cusack, Jolie, and contributing an Oscar worthy performance, Thornton.\n\n\t\"Pushing Tin\" offers a variety of characters and contrasts them effortlessly. In particular, during a just-for-fun basketball game, Nick makes a sudden bet for $100 that Russell can not make a hoop from a certain point in the court. Russell excepts. Nick nervously changes his gamble to fifty cents, but Russell stands firmly on the original amount. He shoots...and misses. \"Close enough, Russell,\" pardons Nick, \"Lets call it even.\" Russell walks over to him manly and states \"You either make it or you don't,\" as he hands Nick the cash promised. The chemistry between these characters is as effective as pouring oil in to water. And that is exactly how it is designed to be.\n\nBrought to you by 20th Century Fox.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A feud develops between two air traffic controllers: one cocky and determined while the other is restrained and laidback, which inevitably affects their lives.",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi356040985",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTM1YzEzOTEtMjgzMy00ZTZhLWEzNDItM2I3M2E4OWFjNmMxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTM1YzEzOTEtMjgzMy00ZTZhLWEzNDItM2I3M2E4OWFjNmMxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-30T11:11:15.954Z",
        "url": "https://www.imdb.com/video/vi356040985/"
    },
    "url": "/title/tt0120797/"
}