{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Greta Garbo",
            "url": "/name/nm0001256/"
        },
        {
            "@type": "Person",
            "name": "John Gilbert",
            "url": "/name/nm0318105/"
        },
        {
            "@type": "Person",
            "name": "Ian Keith",
            "url": "/name/nm0445246/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8158,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "H.M. Harwood",
            "url": "/name/nm0367814/"
        },
        {
            "@type": "Person",
            "name": "Salka Viertel",
            "url": "/name/nm0826554/"
        },
        {
            "@type": "Person",
            "name": "Margaret P. Levino",
            "url": "/name/nm0505996/"
        }
    ],
    "datePublished": "1934-02-09",
    "description": "Queen Christina of Sweden is a popular monarch who is loyal to her country. However, when she falls in love with a Spanish envoy, she must choose between the throne and the man she loves.",
    "director": [
        {
            "@type": "Person",
            "name": "Rouben Mamoulian",
            "url": "/name/nm0541149/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIyMjg1ODk4OF5BMl5BanBnXkFtZTgwNDA0NzkxMjE@._V1_.jpg",
    "keywords": "17th century,queen of sweden,f rated,character name as title,queen christina of sweden character",
    "name": "Queen Christina",
    "original_info": {
        "id": "Queen Christina_1933",
        "name": "Queen Christina",
        "year": "1933"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2007-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0024481/"
        },
        "name": "Garbo as Queen",
        "reviewBody": "Greta Garbo is the controversial \"Queen Christina\" in this beautiful 1933 film directed by the great Rouben Mamoulian, responsible for the resplendent 1941 \"Blood and Sand\" and many other films. Here, Garbo is reunited with a leading man from silent films, John Gilbert, and the two are marvelous together. It's so strange now to remember that there was supposedly something wrong with Gilbert's voice so when talkies came in, it wrecked his career. Obviously his voice was just fine, and in this film, he speaks with a classically trained voice and has great facility for the dialogue. Perhaps it's true that Mayer hated him and sped up his voice in his sound debut; but most likely, his alcoholism is what ultimately destroyed his career.\n\nThe script takes wild liberties with the real Queen's life, but it makes for excellent entertainment. Queen Christina was educated as a man at her father's directive so she could take over the throne, and she supposedly, as in the film, had some sort of relationship with her lady-in-waiting, Ebba. One site states that Christina abdicated her throne to be with Ebba; however, Ebba had already married and left the court by the time Christina abdicated. After her abdication, she traveled to Rome as a man and steeped herself in culture. Later on, she tried to become Queen of a couple of countries and became involved with a Cardinal, to whom she left her estate when she died at the age of 63.\n\nHere, Christina travels as a man and ends up sharing a room with an envoy of the King of Spain, Don Antonio (Gilbert), who becomes her lover. The bedroom scenes are quite controversial, though no sex is shown. It was thought that Garbo fondling different things in the room as she \"memorizes\" it was a symbol of her fondling something else - plus there is only bed in the room and the two were obviously in it, though the bed was curtained. And that's as explicit as one got in 1933. The scenes at the inn apparently wiped out any concern for Christina's kissing of Ebba (Elizabeth Young) on the lips earlier!\n\nThe acting is superb, particularly from Garbo, Gilbert, and Ian Keith (Magnus). Keith was a little known character actor, yet he was an accomplished stage performer who was very impressive in film - he can be seen as Joan Blondell's drunken husband in \"Nightmare Alley.\" As for Gilbert, what a shame - a wonderful, attractive actor who plays Antonio with great wit and intelligence. He and Garbo made a great team. Garbo is gloriously beautiful, and in a nice touch, walks in the same lumbering way as the actress who plays her as a little girl does. This is the film with possibly the most famous close-up in cinematic history - as Garbo supposedly thinks of \"nothing\" as she stands on the ship. The camera lingers on her for what seems like forever...yet it is somehow not long enough.\n\nThe exciting, final pairing of a great screen team is only enhanced by the subtle touches of Mamoulian and the beautiful cinematography. Don't miss it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3076570905",
        "name": "Queen Christina",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDdjOTEyNTUtMzNkNC00MjdlLTg5NGEtOGRmMTUxMDZlYWRhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDdjOTEyNTUtMzNkNC00MjdlLTg5NGEtOGRmMTUxMDZlYWRhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-01-17T17:02:18.758Z",
        "url": "https://www.imdb.com/video/vi3076570905/"
    },
    "url": "/title/tt0024481/"
}