{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Isabelle Adjani",
            "url": "/name/nm0000254/"
        },
        {
            "@type": "Person",
            "name": "Daniel Auteuil",
            "url": "/name/nm0000809/"
        },
        {
            "@type": "Person",
            "name": "Jean-Hugues Anglade",
            "url": "/name/nm0000767/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18149,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Queen Margot",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067540/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072956/"
        },
        {
            "@type": "Person",
            "name": "Alexandre Dumas",
            "url": "/name/nm0241416/"
        },
        {
            "@type": "Person",
            "name": "Danièle Thompson",
            "url": "/name/nm0860019/"
        },
        {
            "@type": "Person",
            "name": "Patrice Chéreau",
            "url": "/name/nm0161717/"
        }
    ],
    "datePublished": "1994-12-09",
    "description": "Young Queen Margot finds herself trapped in an arranged marriage amidst a religious war between Catholics and Protestants. She hopes to escape with a new lover, but finds herself imprisoned by her powerful and ruthless family.",
    "director": [
        {
            "@type": "Person",
            "name": "Patrice Chéreau",
            "url": "/name/nm0161717/"
        }
    ],
    "duration": "PT2H39M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTc4NTdjODgtZmI1MS00MDI5LWFhZjYtMjAzNTVhYzk1ZjFiXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "male frontal nudity,female frontal nudity,sex,female nudity,pubic hair",
    "name": "La reine Margot",
    "original_info": {
        "id": "Queen Margot_1994",
        "name": "Queen Margot",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Leducdor"
        },
        "dateCreated": "2002-11-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110963/"
        },
        "name": "Flawless cinema",
        "reviewBody": "This is not flawless filmmaking, but it IS flawless cinema. One won't bother recounting the story, or the plotline, a viewer can gather that from history, OR previous reviews, OR even a casual overview of Dumas novels. One would like to speak to the filmmaking here, and along the way, on the movie.\n\nIf one is at all interested in French history, one has already seen this movie a thousand* times, * meaning enough. However, a digital dvd transfer of the movie as it was originally intended to be seen by M. Chéreau, without subtitles, without interference,the VO [version originale] is stunning. The first and foremost difference is the lighting - il te frappe, as the French would say, \"it strikes you.\" Not being a technician, one can't speak to the difference between the film one saw on DVD and the film one saw in American theaters, or on American DVD, or even on VHS, French and/or American. The difference is striking. From the opening scenes, one is suddenly, almost frightfully, drawn into the 16th century, an epoch without the cushions of modern life. The light is everywhere, and it shines in a way that is pitiless and revelatory. This was never, unfortunately, appparent to theater goers here, and, I suspect, to cinema goers in France. If it had been, there would have been Oscars. One is not sure cinema projection equipment can convey what M. Chéreau did with this film. Where there is light, there is \"liminality\" and where there are shadows, even there there is light, but it is dim (thus not liminal), and the cadaverous flesh of the living players conveys more than anyone could ever say in dialogue - these are \"dead\" people, living out a drama that is already predestined for them, which is a marvelously conceived conceit of the filmmaker. M. Chéreau is playing with predestination and Fate here, and it is through the art of cinema that he is doing it. Mlle Adjani turns in a bravura performance, and it is only by grace of Jeanne Moreau's 1954 performance that we have any scale of comparison. Moreau's performance is cool, ice and politics, but Adjani's is heat, love and politics, and suited to her generation. Vincent Perez is suitably heroic (watch the rose tones come and go on his flesh as the light changes). The kudos for male performances, however, are shared by Jean-Hugues Anglade, long an underrated French actor, and Daniel Auteuil, too long appreciated for his bravura performances elsewhere and not given enough credit for what he can do with a gesture, with a line, with a look. M. Auteuil is almost always lit with cool hypocrisy, (ambers and greens) as suits his performance, but M. Anglade turns in one of the best roles of his career as the doomed Charles IX, and he never looks less than \"on death's door.\" A naturally sensitive actor, he adds a touch of \"soullessness\" to his Charles IX that is unforgettable - weak, yes, king, yes, momma's boy, yes, but also, in the end, needy child. It is stunning in its ultimate simplicity as a performance for cinema. Very few performances in film measure up to Virna Lisi's Catherine de Medici(s) [the s is French spelling]. She is \"incroyable\" (incredible), and something was wrong when she wasn't recognized universally as '94's best supporting actress. Her queen is multi-layered, loving, hating, deeply cynical yet naively superstitious, playing son against son and daughter against political reality, in other words a perfect incarnation of the 16th century in France. Any political woman you can think of could have sat at her feet and learned lessons on \"how to do it.\" Mme Lisi herself might have been a confidante to the real Catherine, she is that good in this role. She was crowned for this performance in Europe, but should have been crowned universally. Watch her as she vacillates between love and hate and politics, and especially watch the lighting - it subtly changes according to her role of the moment. Watch her carefully towards the end, as Fate winds things up, and watch an actress give herself up totally to the role, to the moment, in order to incarnate a character that is absolutely unforgettable.\n\nApparently, M. Chéreau lets his actors know what he is doing, because they respond in according \" shades\" of emotion. When the lighting is dim, or the focus is midrange, they \"fuzz\" a little, giving the viewer a sense of their uncertainty, but if he focuses, they focus, too, and there are frightening moments of soul-baring intimacy when you almost want to look away - it is like watching your intimates make love; too much, too intimate, too deep. Dominique Blanc turns in a nearly flawless performance as the over-the-top lady-in-waiting to Margot - watch her lighting, too, and how she responds. \"Conspiratrice\", duchesse, cynical woman in love despite herself, she is very, very good. Pascal Greggory as the future Henri III is wonderful, and the rest of the cast stand out. This was obviously a labor of love and intensity, and all gave their best to M. Chéreau.\n\nIn the end, one keeps wondering what it is about the film that was so memorable - and the french dvd transfer makes it perfectly clear. The performances, yes; the \"mise en scène,\" yes; the director, certainly. But it is the whole, the light and the shadows, the darkness and the glow, as in those candles in the marvelous square paper lanterns in the late night of the Louvre as the people begin to weave their plots, that make it memorable. Good actors, great performances, and a sure director - flawless cinema."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Queen Margot",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3588074777",
        "name": "Re-release Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDkwMjg0MTc2Nl5BMl5BanBnXkFtZTgwMDYxODk2MTE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDkwMjg0MTc2Nl5BMl5BanBnXkFtZTgwMDYxODk2MTE@._V1_.jpg",
        "uploadDate": "2014-04-30T05:23:39Z",
        "url": "https://www.imdb.com/video/vi3588074777/"
    },
    "url": "/title/tt0110963/"
}