{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Deacon",
            "url": "/name/nm0212577/"
        },
        {
            "@type": "Person",
            "name": "Brian May",
            "url": "/name/nm0006190/"
        },
        {
            "@type": "Person",
            "name": "Freddie Mercury",
            "url": "/name/nm0006198/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 454,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103338/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049664/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0138062/"
        }
    ],
    "datePublished": "2002-10-15",
    "description": "The first greatest hits volume 1 release from Queen.",
    "director": [
        {
            "@type": "Person",
            "name": "Derek Burbidge",
            "url": "/name/nm0120759/"
        },
        {
            "@type": "Person",
            "name": "Denis deVallance",
            "url": "/name/nm0990193/"
        },
        {
            "@type": "Person",
            "name": "Rudi Dolezal",
            "url": "/name/nm0230964/"
        }
    ],
    "duration": "PT3H20M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmEyNTAzZTktNzMwZS00MDVlLWE4MzUtNjdmMmExY2U3MDI2XkEyXkFqcGdeQXVyMjg3NTY4Nw@@._V1_.jpg",
    "keywords": "music video collection",
    "name": "Queen: Greatest Video Hits 1",
    "original_info": {
        "id": "Queen: Greatest Video Hits 1_2002",
        "name": "Queen: Greatest Video Hits 1",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Sir Didymus"
        },
        "dateCreated": "2003-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0363004/"
        },
        "name": "More than a fandango...",
        "reviewBody": "If The Beatles are the most inventive band of all time, then Queen must come a close second. For thirty years now their music has entertained millions in every corner of the globe, with sell-out tours of the UK, Europe, America, Australasia and South America - even Africa was bitten by the Queen bug. Their performance at Live Aid is widely regarded as the finest that day - and if they'd given the world nothing more than 'Bohemian Rhapsody' it would have cemented their names into the history books for all time.\n\nBut there is much more to them that the Rhap... and this dvd is a suggestion of some of that. Twenty-two performances of some of their most famous (and not so famous) hits from the first eight years of their chart career, from early classics 'Keep Yourself Alive' and 'Liar' to the camp curiosity that is 'Flash' (the signature theme for the 1980 cult hit 'Flash Gordon') - it's all there.\n\nEarly attempts at promotional footage give way to the land-mark 'Bohemian Rhapsody' video, and then a dozen or so further promos along with tv footage and live performances. Musically, this is some of the best of Queen - visually, they peaked much later on. Most of these videos are simple lip-synch-to-the-camera routines, as opposed to actually playing with the medium (as they did in the 1980s and beyond), but while they might be a little bit too much for one sitting they make perfect viewing you can just dip into once in a while.\n\nOn a more technical front, the dvd could be much better. The sound is impressive on the first disc - as sixteen tracks have been remastered into DTS 5.1 sound, and the backup PCM stereo track is adequate for the vast majority who don't have DTS (why there's is no Dolby Digital is beyond me). The audio commentary is just about worth hearing, but is really a one-listen affair. The documentary 'Inside The Rhapsody', on the other hand is an interesting (if badly designed and split into segments) look into the creation of the legendary 'Bo Rhap', in which Brian May plays back different sections of what remains of the original master tapes.\n\nPicture wise, however - this dvd is a mess. Whilst you can't improve some of the images that much (due to the videos being worn out and low budget), butchering 4:3 images into 16:9 by simply cropping the top and bottom has left several of these videos looking odd - especially on a standard television set. The 'Bo Rhap' promo in particular, with its kalidoscope imagery is ruined by the process - and it's not even consistent either, as of the six videos on disc two, four have not been converted and one has been altered to widescreen only to be mastered as a fullscreen image, stretched onto your tv set as a result!\n\nOn the whole then, this dvd is a great disappointment. For a band known to be perfectionists, this is sloppy. However, the chance to own these videos on a digital medium may win many people over, and if it doesn't, the alternate takes of 'We Will Rock You' and 'Bicycle Race' (now with uncensored fat bottomed, naked girls racing on bicycles) will grab many a Queen fan.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0363004/"
}