{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alex D. Linz",
            "url": "/name/nm0513281/"
        },
        {
            "@type": "Person",
            "name": "William Atherton",
            "url": "/name/nm0040472/"
        },
        {
            "@type": "Person",
            "name": "James Woods",
            "url": "/name/nm0000249/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 945,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0086543/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0040825/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006290/"
        },
        {
            "@type": "Person",
            "name": "Eric Gardner",
            "url": "/name/nm10996729/"
        },
        {
            "@type": "Person",
            "name": "Steven H. Wilson",
            "url": "/name/nm0934178/"
        }
    ],
    "datePublished": "2002-03-15",
    "description": "In the 1960s a young woman works at NASA as an animal trainer responsible for the chimpanzee who will go into space.",
    "director": [
        {
            "@type": "Person",
            "name": "Sean McNamara",
            "url": "/name/nm0573732/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTczNDUwMDA1NV5BMl5BanBnXkFtZTcwNTA5MTAwMQ@@._V1_.jpg",
    "keywords": "rhyme in title,outer space,animal trainer,nasa,chimpanzee",
    "name": "Race to Space",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vchimpanzee"
        },
        "dateCreated": "2005-06-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0167360/"
        },
        "name": "Pretty good",
        "reviewBody": "In this fictional version of the story of the first chimp sent into space, Billy is the new kid at school, the son of one of the scientists in charge of making sure we can join the Russians in the space race.\n\nSome of the kids are mean to Billy, calling him a Nazi, among other things. Billy's father starts bringing him to work to help him adjust to his new situation, and it is there that he discovers the chimp project. Billy's teacher wants him to do a paper on space flight, and he chooses the chimps as a topic, and he later gets to do important work in the program. Dr. McGuinness has an additional challenge to face, besides getting the chimps ready for the potentially dangerous flight. She's a woman, and female scientists are not being accepted by men the way they are today.\n\nMeanwhile, Roger Thornhill wants his company to build the rockets, and he doesn't appreciate the fact that Germans are the ones putting Americans in space.\n\nJames Woods is very convincing but often stereotypical as a by-the-book German scientist. Later on he shows a warm side, which was hinted at when Billy first got in trouble at school. In fact, he seems every bit as American as the other characters at times, except for that accent. The other German characters, unfortunately, seem like they belong in \"Hogan's Heroes\" and don't exactly inspire confidence.\n\nAlex D. Linz does just fine as Billy, who more than once gets the opportunity to save the day, which is fine for the kids watching the movie but not particularly realistic. And the chimp who gets to go into space does quite a capable job (I won't say which one it is). Mark Moses does a fine job as Alan Shepard, who in real life ends up as the first American in space. And Annabeth Gish is likable as the scientist in charge of the chimps.\n\nWilliam Devane is sometimes deliciously evil, and at other times just plain evil, as the executive who has devious plans for the space program. William Atherton is more stereotypical as the 'inside man' who helps Devane's character.\n\nWhat a appears to be a documentary on the space race starts the film, and similar footage is shown at other times. This is interesting.\n\nKennedy became president during the events of this film. This is okay even though the actual flight of the first chimp took place too soon for Kennedy to have been in office as long as he appeared to be here. People liked Kennedy and his comments in the inaugural speech add to the film. Another minor flaw: 1962 Chevrolets were not introduced until much later in 1961.\n\nThis movie isn't really a comedy, but it is funny at times. There may have been some editing, but overall, it seemed clean enough for most kids to watch. There are some frightening scenes involving the training and the actual flight, but this is to be expected with something as new as space travel was.\n\nThis was pretty good."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi27132185",
        "name": "Race To Space",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2FiZjFlMGYtNTdiOC00YTg3LTg5NTMtYmIzNDIzOWU4MTk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2FiZjFlMGYtNTdiOC00YTg3LTg5NTMtYmIzNDIzOWU4MTk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:29:40Z",
        "url": "https://www.imdb.com/video/vi27132185/"
    },
    "url": "/title/tt0167360/"
}