{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George D. Wallace",
            "url": "/name/nm0908647/"
        },
        {
            "@type": "Person",
            "name": "Aline Towne",
            "url": "/name/nm0250881/"
        },
        {
            "@type": "Person",
            "name": "Roy Barcroft",
            "url": "/name/nm0054117/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1125,
        "ratingValue": 4.5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020540/"
        },
        {
            "@type": "Person",
            "name": "Ronald Davidson",
            "url": "/name/nm0203477/"
        }
    ],
    "datePublished": "1952-01-09",
    "description": "Strategic targets on Earth are being destroyed by an unknown weapon. Government security head Henderson suspects it's an \"atomic ray\" originating from the moon! He assigns Commando Cody, scientist and man of action with a secret f...",
    "director": [
        {
            "@type": "Person",
            "name": "Fred C. Brannon",
            "url": "/name/nm0105175/"
        }
    ],
    "duration": "PT2H47M",
    "genre": [
        "Action",
        "Family",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjM3ZGQ0NWQtMzBiYS00OTY5LTgyMzEtZTJkNTg5MjFkMTIyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "1950s,20th century,rocket man,jet pack,alien invasion",
    "name": "Radar Men from the Moon",
    "original_info": {
        "id": "Radar Men from the Moon_1951",
        "name": "Radar Men from the Moon",
        "year": "1951"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "flapdoodle64"
        },
        "dateCreated": "2011-04-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0045064/"
        },
        "name": "Cody Goes Commando",
        "reviewBody": "(Or: 'Republic Recycles Rocket Man') In 1949, in one of their last bursts of inspiration, the thrill engineers at Republic produced 'King of the Rocket Men,' which capitalized on the popularity of the flying hero Superman, from the eponymous 1948 Columbia film serial. Although Rocket Man flew, he was in fact an ordinary human scientist who happened to have a helmet and rocket pack, and who battled the terrorist Dr. Vulcan.\n\nKing of the Rocketmen premiered 6-8-1949...3 weeks later, on 6-27-1949, the DuMont TV network premiered Captain Video, another science fiction hero who became one of the 1st bona fide superstars of early TV. After Rocket Man and Capt. Video, a number of science fiction heroes were popular on TV up through about 1955, when other trends began to dominate.\n\nCapt. Video's creators had been inspired by the movie serials. In turn, Columbia Pictures obtained the rights to the Capt. Video character, and produced the super-cheap but super-profitable 'Captain Video Master of the Stratosphere' serial. \n\nDuring this craze for quasi-military science-fiction heroes, Republic re-purposed the splendid Rocket Man flying footage and mixed in additional stock footage from about a dozen other serials to create Commando Cody. The name Commando Cody, BTW, was surely designed to capitalize on the popular TV character 'Commander Cory', of the hit TV series 'Space Patrol.' Thus it came to be that Republic was in the position of trying, late in the game, to jump aboard a trend that it inadvertently helped create! (But by the end of 1956, both the movie serials and the TV space heroes would be gone forever!)\n\nOne of the ways you can identify the re-used footage is when people in 1952 suddenly all hop into 1938 or 1946 automobiles for a car chase. You have to remember, cars from this era were fortunate to last 50,000 miles, so the idea that the streets of downtown Los Angeles of 1952 are suddenly filled with 1938 cars is not plausible. I lost track of how many times the characters all jumped into these automotive anachronisms...\n\nRecylcing old footage is not necessarily a crime...in fact, some of Republic's best serials featured loads of reused material. But this serial shows a seriously uninspired writer, and it all seems kind of forced. Not to mention, Rettik the Moon Man is not a particularly menacing villain, with the other Moon Men and their Earth gangster stooges also lacking in menace and brain power. The Moon Scenes are pretty bad, even when compared with the stuff from Flash Gordon, and there is not a lot of emotional energy.\n\nGeorge Wallace is physically unimpressive as the titular hero, but in the action scenes he does a surprisingly good job of conveying urgency. He is actually OK, as are his companions.\n\nProbably the best performance is by Clayton Moore, as one of the Earth gangsters inexplicably selling out his own planet for chump change. The performance is fun for everyone who saw his Lone Ranger performances and wondered what the guy actually looked like...well, here he is, and a he's a good actor, it turns out.\n\nThere are plenty of fight scenes, but nothing as inspired as the stuff from the early 1940's. Worst of all, the final chapter resolves the conflict without Our Hero getting into a suitable physical confrontation with the villain. This is rather unsatisfying.\n\nBy 1952, serials were fading fast, in terms of popularity and quality. This one is typical for that era. There are 2 other Rocket Man serials besides this one, the aforementioned 'King of the Rocket Men,' and 'Zombies of the Stratosphere.' Both King and Zombies are superior this serial, although this serial is an amiable waste of time.\n\nThe great Lydecker Brothers created some new FX for this serial, some nice shots of a rocket ship taking off and flying...these shots were reused in Zombies, as well as being used in the amazingly strange Republic quasi-TV series 'Commando Cody, Sky Marshall of the Universe.'",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0045064/"
}