{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brian Benben",
            "url": "/name/nm0000903/"
        },
        {
            "@type": "Person",
            "name": "Mary Stuart Masterson",
            "url": "/name/nm0000524/"
        },
        {
            "@type": "Person",
            "name": "Ned Beatty",
            "url": "/name/nm0000885/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3782,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071326/"
        },
        {
            "@type": "Person",
            "name": "George Lucas",
            "url": "/name/nm0000184/"
        },
        {
            "@type": "Person",
            "name": "Willard Huyck",
            "url": "/name/nm0404754/"
        },
        {
            "@type": "Person",
            "name": "Gloria Katz",
            "url": "/name/nm0441718/"
        }
    ],
    "datePublished": "1994-10-21",
    "description": "A series of mysterious crimes threatens the existence of a new radio network.",
    "director": [
        {
            "@type": "Person",
            "name": "Mel Smith",
            "url": "/name/nm0809321/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWRkYzc3YjYtNWY3Yy00Y2FmLTgyOTYtM2U2ZDg0MDA0MTIwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "radio,radio station manager,reference to rudy vallee,dressing room,reference to bing crosby",
    "name": "Radioland Murders",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Spleen"
        },
        "dateCreated": "2002-03-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110939/"
        },
        "name": "Didn't deserve to flop",
        "reviewBody": "You can see what critics in 1994 were complaining about. You can get a headache from this movie. Gags are too snappy (too packaged), editing is too rapid (if someone trips over the shot is only just long enough to cover the actual tripping over - we don't see the crucial bit at the start where they don't trip over, or the bit at the end after they trip over), and there's not a single moment of still contemplation which would allow all the feverish activity to be as funny as it deserves to be. And while it's nice to see a film that doesn't milk its gags for more than they're worth, at least that would be a fault on the right side. Some of the comic ideas are just begging to be WALLOWED in. For example (I'm going to end up recommending this film, so if you don't want its best sight gag ruined, for God's sake skip the next paragraph)...\n\nOne of the radio serials is about an aristocratic English explorer and his native jungle sidekick. We hear the former saying things like `What ho, I mean to say, steady on, old chap', while the latter is going, `Ooga booga - me mongo mongo man' - then we see that the African is being played by a dopey-looking white man, and the Englishman is being played by a black (in a tuxedo). It's a glorious moment. We realise what if their roles had been reversed they would BOTH have been demeaned ... as it is, they merely look like a couple of prize wallies. Unfortunately, that's IT. If we'd seen more of this radio play - and got to watch the bemused/assured/disgusted/bored expressions on the faces of the two voice actors - it would have continued to be funny; it would have got even funnier. But we cut to some other zany thing or other and the moment is lost.\n\n(To be fair, some throwaway gags - like the one involving the policemen and television - are true throwaway gags: snappiness suits them.)\n\nBut it works, on the whole. There are plenty of good jokes, many of which have been weakened by the style of presentation, but by no means destroyed. The radio performances are amazingly polished and varied - you'd swear that Lucas sent talent scouts back in time to 1939. Sure, the film wants to be more than a highly entertaining comedy variety show (it's also trying for murder mystery, love story, nostalgic reverie, and social commentary), so it fails on its own terms, but it IS a highly entertaining comedy variety show, which is good enough."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2659320089",
        "name": "Radioland Murders",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmQ1MDQzZmEtOTdmZC00ODhlLWEwNTktODk2MTM0OTQzMDA2XkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmQ1MDQzZmEtOTdmZC00ODhlLWEwNTktODk2MTM0OTQzMDA2XkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg",
        "uploadDate": "2008-04-11T15:48:16Z",
        "url": "https://www.imdb.com/video/vi2659320089/"
    },
    "url": "/title/tt0110939/"
}