{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sissy Spacek",
            "url": "/name/nm0000651/"
        },
        {
            "@type": "Person",
            "name": "Eric Roberts",
            "url": "/name/nm0000616/"
        },
        {
            "@type": "Person",
            "name": "Sam Shepard",
            "url": "/name/nm0001731/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1727,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "William D. Wittliff",
            "url": "/name/nm0937074/"
        },
        {
            "@type": "Person",
            "name": "Sara Clark",
            "url": "/name/nm2439909/"
        }
    ],
    "datePublished": "1981-09-18",
    "description": "A divorcee with two sons has an affair with a young sailor passing through her Texas town in 1944.",
    "director": [
        {
            "@type": "Person",
            "name": "Jack Fisk",
            "url": "/name/nm0279926/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTA1MDZiYmQtNjJhNy00Y2Y5LTg0ZDMtMWZmZmYyMDYwNWMzXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "shaving legs,legs,woman shaves her legs,leg shaving,redheaded woman",
    "name": "Raggedy Man",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TOMASBBloodhound"
        },
        "dateCreated": "2008-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082969/"
        },
        "name": "A good film. Hard to really say what genre it is.",
        "reviewBody": "Raggedy Man is an unusual mix of themes and styles, but maybe somehow that helps the film to work. The film has quite a lot going for it. The acting, casting, locations, and strong nostalgia are all there. And there is even a surprise twist ending that we see in so many thrillers today. Maybe the ending was a bit out of place. This just is a tough film to really put your finger on, but it basically works.\n\nSissy Spacek, who is as terrific as ever, plays a divorced woman working as a telephone operator in a small Texas town, and trying to raise two rambunctious little boys between phone call transfers. She desperately wants out of this job and the little town, but her boss keeps telling her she's \"frozen\" because a war is going on. The majority of the film does take place in 1944. Apparently changing jobs was not possible back then if you were doing civil servant type things while a war was going on. Who knows? But Spacek is stuck there in her house, and very lonely and unhappy. That is until one rainy night, a polite sailor comes to the door hoping to use her public phone. The sailor, played by a somewhat subdued Eric Roberts, learns on the phone that his girlfriend has just dumped him. With nowhere to stay before he ships out in four days, Roberts is taken in by Spacek. The two quickly discover they have feelings for one another, and this does not sit well with the gossipy small town.\n\nFurther complicating matters are a couple of local louts who have the hots for Spacek and get very jealous of the sailor. Also hanging around and peeping in windows is the \"raggedy man\" himself. Who is this mysterious deformed man who also seems to be taking an interest in Spacek and her boys? Well, the final twist pretty much answers that question. And this revelation is a bit difficult to swallow. The film ends somewhat violently, as the louts are dealt with. And things generally seem to be upbeat as the credits roll.\n\nThe film has some wonderful selling points. The acting is top-drawer by all involved. The casting choices were absolutely perfect. Especially in support. Tracey Walter and William Sanderson were born to play parts like the two louts. They are very recognizable character actors. If you don't immediately recognize Sanderson, just think, \"I'm Larry, this is my brother Darryl, and this is my other brother Darryl.\" Yes, he was Larry on Newhart. Look for little Henry Thomas who did this film just before E.T.. Bill Thurman of Last Picture Show fame has a bit part as the Sheriff. The town in this film looks a lot like Anarene in that film. If you were alive and recall the way things were on the home front during WWII, then this film will certainly take you back there mentally. The film is ultimately a strange cross between Summer of '42, To Kill a Mockingbird, and.... God knows what else. But somehow it all seems to work. The great cast can probably be thanked for that as much as anything. 7 of 10 stars.\n\nThe Hound.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A divorcee with two sons has an affair with a young sailor passing through her Texas town in 1944.",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1705886233",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzBlNmVjODYtM2Y4Ni00NjgwLTkwMTktOTU3YmQyZDEzNDQ2XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzBlNmVjODYtM2Y4Ni00NjgwLTkwMTktOTU3YmQyZDEzNDQ2XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-04-21T17:43:33.030Z",
        "url": "https://www.imdb.com/video/vi1705886233/"
    },
    "url": "/title/tt0082969/"
}