{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "Cathy Moriarty",
            "url": "/name/nm0001550/"
        },
        {
            "@type": "Person",
            "name": "Joe Pesci",
            "url": "/name/nm0000582/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 360108,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054262/"
        },
        {
            "@type": "Person",
            "name": "Jake LaMotta",
            "url": "/name/nm0483766/"
        },
        {
            "@type": "Person",
            "name": "Joseph Carter",
            "url": "/name/nm0141734/"
        },
        {
            "@type": "Person",
            "name": "Peter Savage",
            "url": "/name/nm0678014/"
        }
    ],
    "datePublished": "1980-12-19",
    "description": "The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Scorsese",
            "url": "/name/nm0000217/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Biography",
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjRmODkzNDItMTNhNi00YjJlLTg0ZjAtODlhZTM0YzgzYThlXkEyXkFqcGdeQXVyNzQ1ODk3MTQ@._V1_.jpg",
    "keywords": "jealousy,new york city,dysfunctional family,marriage crisis,domestic violence",
    "name": "Raging Bull",
    "original_info": {
        "id": "Raging Bull_1980",
        "name": "Raging Bull",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CihanVercan"
        },
        "dateCreated": "2008-09-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081398/"
        },
        "name": "It really is harder to Stay At the Top than to Reach the Top; just because Life has No Justice.",
        "reviewBody": "Whoever is dissatisfied by Raging Bull, I'm sure they watched it with expectations of watching a sports movie, like Rocky. Despite the AFI chose Raging Bull as the #1 sports movie of all time, you can't expect to see the most breathtaking boxing match nor to witness the best crochet of boxing history. Raging Bull can only be classified as a drama/biography. Director Scorsese chose to go with black&white cinematography only to keep the young viewers away from this masterpiece of art. It's not fair to compare Rocky with Raging Bull. Rocky was a populist movie mostly for young viewers, and Raging Bull is a cinematic masterpiece. From a wide point of view, for instance, if you look at one of the Michelangelo's paintings; at first you see a nude woman, if you look longer and deeper you realize that her nudity expresses some thought, if you look continuously and give a life to it in your imagination you discover that the women are not just their bodies. Accordingly, like it is not enough looking once to a painting to understand what opinion does it defend; it is not reasonable and not fair to watch Raging Bull so as to see a sports movie. Also it is not reasonable to see Raging Bull only once. Raging Bull is one movie that, every time you watch it you get a better taste, every time you watch it you discover something new. \n\nRaging Bull taught us that even if you are the best at some skill, even if you are the best of all; you need to create witnesses, admirers and supporters of your skill. It's the only way to reach the top. Moreover, it is harder to stay at the top than to reach the top. Not because someone better than you can defeat you, it's just because of the need to be accepted on every authority; like the Council of Judges, the Media and the Admiration of People. Director Scorsese draws benefit from the hypocrisy of fame. He empowers Raging Bull to make people ask to their conscience if the popular values that people choose can really cherish their values. \n\nIn Raging Bull, Jake La Motta was the best boxer of all, but people didn't like him. He was disrespectful, he was uncivilized, he was very ugly, he was arrogant, he was irritable and he didn't care; 'cause he believed himself. Despite the fact that he is the best, everybody disliked him. Soon, he was left alone; and in a very short time he lost everything he possessed. When he opened his eyes back to life, he found himself in prison. The scene that he is punching and butting the wall facing him is one of the most heart rending memorable scenes of the whole cinema history. \n\nAt the end, he finally throws in the towel of believing himself, he loses his faith and becomes to learn what he never wanted to learn: The Fame. He starts running his own business at a night club under his name, working as a stand-up comedian at the stage. People laugh at him for the jokes he made out of his memories, the jokes paraphrasing the bitter facts of life; including the very famous joke of the British King Richard-III which he said in the year 1485 just before dying: \"A horse, a horse... My kingdom for a horse!\". There we understand truly: For every joke there lies a share of a fact underneath.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Raging Bull",
        "duration": "PT1M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3633616921",
        "name": "Raging Bull: 30th Anniversary Edition Blu-Ray",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDY4ODAyNjgtMWY1OC00NzgwLWJjYmItYmY4NzVkYzE0MDA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDY4ODAyNjgtMWY1OC00NzgwLWJjYmItYmY4NzVkYzE0MDA0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-12-10T06:21:36Z",
        "url": "https://www.imdb.com/video/vi3633616921/"
    },
    "url": "/title/tt0081398/"
}