{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harrison Ford",
            "url": "/name/nm0000148/"
        },
        {
            "@type": "Person",
            "name": "Karen Allen",
            "url": "/name/nm0000261/"
        },
        {
            "@type": "Person",
            "name": "Paul Freeman",
            "url": "/name/nm0293550/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 979342,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071326/"
        },
        {
            "@type": "Person",
            "name": "Lawrence Kasdan",
            "url": "/name/nm0001410/"
        },
        {
            "@type": "Person",
            "name": "George Lucas",
            "url": "/name/nm0000184/"
        },
        {
            "@type": "Person",
            "name": "Philip Kaufman",
            "url": "/name/nm0442241/"
        }
    ],
    "datePublished": "1981-06-12",
    "description": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before the Nazis can obtain its awesome powers.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Spielberg",
            "url": "/name/nm0000229/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTU2ODkyY2MtMjU1NC00NjE1LWEzYjgtMWQ3MzRhMTE0NDc0XkEyXkFqcGdeQXVyMjM4MzQ4OTQ@._V1_.jpg",
    "keywords": "ark of the covenant,nazi,archeologist,archeology,egypt",
    "name": "Raiders of the Lost Ark",
    "original_info": {
        "id": "Raiders of the Lost Ark_1981",
        "name": "Raiders of the Lost Ark",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "PyrolyticCarbon"
        },
        "dateCreated": "2004-12-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082971/"
        },
        "name": "Excellent movie and brilliantly crafted entertainment with a superb casting",
        "reviewBody": "I remember seeing this movie when I was young, and it may well have been in the cinema with my Father, I can't quite remember (if he does, then please post the answer), anyway I do remember seeing it and being thoroughly entertained and that feeling of excitement and total fun staying with me to this very day as that is the feeling that the movie conjures up whenever I think of it.\n\nI think a part of that is down to the fact it's a complete retake on the old serial movies combined with obvious comic book style, and that is just perfect for kids and appeals to them no end, or rather it did then! So it was with excitement that I opened my presents on my birthday and found the boxset for the Indiana Jones Trilogy, and with even more excitement when I finally watched the first in the trilogy, Raiders of the lost Ark.\n\nIt was just as I remembered, fun, excitement, wise cracks, a tiny splattering of romance but with a manliness that kids would allow, and lots of stunts and action. It's a superb movie and captures that style of serials, adventure stories and comic books perfectly, how I know that for sure is only through repeats since I wasn't alive during those times.\n\nThe set pieces are fantastic, and although some of the wilder end sequences are slightly dated now, it hasn't lost the excitement factor. It's a perfectly crafted movie as well, moving from location to location without any distraction or superfluous scenes, it just feels like it's all there for a reason and that it belongs there.\n\nHarrison Ford is excellent in the role, and I'm inclined to think he was more Indy than he was Solo, but that's a personal opinion. He has many more facial movements and voice inclinations in this early movie than he does nowadays, now he belongs to the moody, quiet school of acting, then he was dynamic, adventurous, strong and as wisecracking as the best of them.\n\nThere are some excellent movie making moments in this with George Lucas and Steven Spielberg showing talent galore just oozing out of every pore (where did all that go for Star Wars I to III Mr Lucas?), and they end up making an excellently entertaining movie.\n\nSome could argue that there could be a bit more depth or seriousness to the story, but come on, it's a ripping adventure yarn, you don't need depth. Saving the Ark from the Nazi's, surely that's enough! An excellent movie and great fun too, without a doubt one of my favourite of all time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3747396377",
        "name": "Official HD Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGFhNTAyYjMtNGJlNi00NWFmLTllNTgtYzdhZjE5NmU4MTQ4XkEyXkFqcGdeQXJoYW5uYWg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGFhNTAyYjMtNGJlNi00NWFmLTllNTgtYzdhZjE5NmU4MTQ4XkEyXkFqcGdeQXJoYW5uYWg@._V1_.jpg",
        "uploadDate": "2018-09-14T22:27:11.915Z",
        "url": "https://www.imdb.com/video/vi3747396377/"
    },
    "url": "/title/tt0082971/"
}