{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ram Dass",
            "url": "/name/nm0022404/"
        },
        {
            "@type": "Person",
            "name": "William Alpert",
            "url": "/name/nm1138807/"
        },
        {
            "@type": "Person",
            "name": "Larry Brilliant",
            "url": "/name/nm1135454/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 467,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009261/"
        }
    ],
    "datePublished": "2001-05-21",
    "description": "After Richard Alpert was fired from Harvard in 1963 for conducting psychedelic drug research, he journeyed to India, found a guru and was renamed Ram Dass (\"Servant of God\").",
    "director": [
        {
            "@type": "Person",
            "name": "Mickey Lemle",
            "url": "/name/nm0501387/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY4MTg5MzI2Nl5BMl5BanBnXkFtZTcwMTU5NDkxMQ@@._V1_.jpg",
    "keywords": "harvard,psychedelic drug,research,india,spirituality",
    "name": "Ram Dass, Fierce Grace",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2003-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0310951/"
        },
        "name": "A gift of love",
        "reviewBody": "Mickey Lemle's documentary Ram Dass, Fierce Grace is a portrait of Ram Dass (Richard Alpert), author, 60s guru, spiritual teacher, cohort of Timothy Leary, and author of Be Here Now, one of the most influential books of the 1970s. The film begins in the present, as Ram Dass deals with the effects of a massive stroke he suffered in February 1997 that left him physically incapacitated, and with impaired memory and speech. Interweaving current conversations, interviews with people in his life, and archival footage, Lemle then looks back at his childhood, the controversy surrounding his research with Timothy Leary in psychedelics at Harvard, his studies in India with Neem Karoli Baba, who renamed him Baba Ram Dass (Servant of God), his work with the Seva Foundation in social action projects dedicated to relieving suffering in the world, and his impact as an author and guru to millions of followers. \n\nSeveral examples are shown of his compassion and his ability to feel the pain of others. In an early sequence, his beautiful \"Rachel's Letter\"* comforts a family after their daughter was murdered. In the final sequence, Ram Dass listens to a young woman struggling to overcome her grief at her boyfriend's violent death. She brings him to tears when she tells him about a dream she had in which her boyfriend speaks to her from beyond with a reassuring message. \n\nWhen Ram Dass received the \"fierce grace\" of being \"stroked,\" he admits he did not have any unusual spiritual epiphany. He recalls, \"Here I am, Mr. Spiritual, and in my own head I didn't orient toward the spirit. It showed me I have some work to do.\" He has written about the stroke in his latest book, Still Here in which he talks about slowing down, and finding out about the \"everything\" that is out there. For Ram Dass, aging has become a gift. \"I was galumphing through life before the stroke,\" he says. \"I'm at peace now more than I've ever been. The peace comes from settling in to the moment.\" \n\nEnhanced by the music of Krishna Das, the documentary is more than just a bio-pic or a meditation on the process of aging, it is an inspiring portrait of a man whose life can be summed up in one word -- service. Ram Dass has said, \"What one person has to offer to another is their own being, nothing more, nothing less.\" In Ram Dass, Fierce Grace, Lemle has given us Ram Dass's being, nothing more, nothing less. That is a gift of love.\n\n*http://www.ramdasstapes.org/rachels%20letter.htm"
    },
    "url": "/title/tt0310951/"
}