{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dilip Kumar",
            "url": "/name/nm0474801/"
        },
        {
            "@type": "Person",
            "name": "Waheeda Rehman",
            "url": "/name/nm0716851/"
        },
        {
            "@type": "Person",
            "name": "Mumtaz Askari",
            "url": "/name/nm0612614/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 987,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0140178/"
        },
        {
            "@type": "Person",
            "name": "Kaushal Bharati",
            "url": "/name/nm1538297/"
        },
        {
            "@type": "Person",
            "name": "Narasa Raju D.V.",
            "url": "/name/nm0006769/"
        }
    ],
    "datePublished": "1967-04-07",
    "description": "Abused by an oppressive brother-in-law Gajendra (Pran), Ramchandra (Dilip Kumar) runs away from home, and ends up in a small village where he is mistaken for Shyamrao (also Dilip Kumar), and must accept Ganga (Leela Mishra) and hi...",
    "director": [
        {
            "@type": "Person",
            "name": "Tapi Chanakya",
            "url": "/name/nm0151192/"
        }
    ],
    "duration": "PT2H51M",
    "genre": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmQ3YjIxZjktNzY0OS00ZjZjLTgxNWQtYmUxM2U4NWMzODAxXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "village,fight,false accusation,brother brother relationship,whip",
    "name": "Ram Aur Shyam",
    "original_info": {
        "id": "Ram Aur Shyam_1967",
        "name": "Ram Aur Shyam",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jmathur_swayamprabha"
        },
        "dateCreated": "2012-06-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062177/"
        },
        "name": "A laughter-bonanza from the Tragedy King",
        "reviewBody": "Though Dilip Kumar was labelled as the Tragedy King of Hindi cinema, he was quite skilled in comedy too. Today I am reviewing a movie which is a showcase of his comic talent. It's a classic movie which became a pioneer for twins-based stories in Hindi cinema later. This movie is Ram Aur Shyam (1967) which features Dilip Kumar in contrasting twin roles - one is a weak, coward and submissive person whereas the other one (the twin) is a daredevil and smart person. It's the latter which provided Dilip Kumar an opportunity to make the audience laugh and he did it with such finesse that till date his performance in this role is quoted as a classic comic performance.\n\nRam Aur Shyam is the story of twins who got separated in their childhood and brought up in utterly different environments leading to development of completely opposite personalities of them. Ram (Dilip Kumar) grows up in a rich household which remains under the tyranny of Gajendra (Pran) whereas Shyam (Dilip Kumar in double role) grows up in a village with the affection of Ganga Mausi (Leela Mishra) and the childhood teasings of Shaanta (Mumtaaz). For Ram also, the love of his affectionate sister-in-law - Sulakshana (Nirupa Roy) and niece - Kuku (Baby Farida) is there but they are helpless before Gajendra. Gajendra is greedy too and he decides to marry Ram to Anjana (Waheeda Rehman) who is the daughter of a wealthy man (Nazir Hussain) for the sake of getting a hefty dowry. Now comes the principle twist in the tale which forms the backbone of the story.\n\nDestiny takes Ram to the house of Shyam and vice-versa. Now Ram who has always been getting bashed and humiliated by Gajendra, gets warmth, love and respect too. Shaanta finds his 'Shyam' to have changed into a shy and submissive person and instead of teasing him (as she has always done to the real Shyam), she starts loving him. On the other side, Shyam enters the house of Gajendra as Ram and his daredevil activities prove to be a pleasant surprise for Sulakshana, Kuku and the servants of the house and on the other hand a nightmare for Gajendra whom he bashes like anything. He happens to meet Anjana and her parents and falls in love. Anjana also starts loving him and she is quite happy to be the fiancée of 'Ram'. The reality comes before everyone in the climax and the fact of Ram and Shyam being twins is also known to render a happy ending to the movie.\n\nRam Aur Shyam was a pioneer movie in Bollywood because it paved the way for follow-ups like Seeta Aur Geeta (1972) starring Hema Malini in lead role, Jaise Ko Taisa (1973) starring Jeetendra in lead role, Chaalbaaz (1989) starring Sridevi in lead role etc., the stuff being the same, i.e., twins separated in childhood and nurtured in entirely different environments to grow up into entirely opposite kind of individuals. However the comedy Dilip Kumar did as Shyam in Ram Aur Shyam could not be repeated by anybody, may it be Hema Malini or Jeeendra or Sridevi. Ram Aur Shyam can be watched any number of times to watch the brilliant comedy presented by the actor who is contradictorily known as the Tragedy King of Indian cinema.\n\nDilip Kumar is the heart and soul of this movie and he has done well in the submissive role of Ram too. Both the leading ladies alongwith the supporting characters have also done satisfactorily. Nirupa Roy as the sister-in-law of Ram and Baby Farida as her daughter and Ram's niece deserve special mention. Other than Dilip Kumar, if someone has made his presence prominently felt in this movie, it's none other than the most dreaded and notirious baddie of Bollywood cinema - Pran.\n\nNaushad has composed great music for this movie with the beautiful lyrics coming from the pen of Shakeel Badayuni. Two songs are immortal - Aaj Ki Raat Mere Dil Ki Salaami Le Le (Rafi) and Aayi Hain Bahaaren Mitay Zulm-o-Sitam (Rafi, Lata and chorus). Other songs - O Baalam Tere Pyar Ki Thandi Aag Mein Jalte Jalte (Rafi-Asha), Iss Nagari Ki Reet Hai Ulti (Asha-Mahendra Kapoor), Aaj Sakhi Ri More Piya Ghar Aaye (Asha and chorus), Maine Kab Tumse Kaha Tha Ki Mujhe Pyar Karo (Lata), Main Hoon Saaki Tu Hai Sharaabi Sharaabi (Lata) etc. are also good to listen (and to watch as well). Choreography in Aayi Hain Bahaaren Mitay Zulm-o-Sitam is just outstanding and it's a treat to watch this song on the screen.\n\nTechnical and production value aspects of the movie are all in order. The length of the movie is nowhere felt while watching because the complete movie is very interesting from beginning to end and at no place even an ounce of boredom has been allowed to creep in.\n\nAll in all, Ram Aur Shyam is a highly entertaining movie which should not be missed by either the fans of Dilip Kumar or the movie buffs in general. Those who have seen its remakes like Seeta Aur Geeta, Jaise Ko Taisa or Chaalbaaz should also watch it for getting a different kind of entertainment rendered by the Tragedy King's comic timing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0062177/"
}