{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elizabeth Berkley",
            "url": "/name/nm0000924/"
        },
        {
            "@type": "Person",
            "name": "J.H. Wyman",
            "url": "/name/nm0437249/"
        },
        {
            "@type": "Person",
            "name": "Frank Schorpion",
            "url": "/name/nm0774891/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 325,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063862/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046565/"
        },
        {
            "@type": "Person",
            "name": "Matt Dorff",
            "url": "/name/nm0233548/"
        }
    ],
    "datePublished": "1998-09-18",
    "description": "Elizabeth Berkley stars as a young and rising Public Relations executive who meets a strange man after a cocktail party, and she is framed for murder.",
    "director": [
        {
            "@type": "Person",
            "name": "Douglas Jackson",
            "url": "/name/nm0413465/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Thriller",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDU3NWQyYTgtNmVjYi00NWVjLTlmYmYtMmYxOTkwMDY5YTA3XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "1990s,public relations executive,public relations industry,public relations company,public relations",
    "name": "Random Encounter",
    "original_info": {
        "id": "Random Encounter_1998",
        "name": "Random Encounter",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vchimpanzee"
        },
        "dateCreated": "2006-02-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0130208/"
        },
        "name": "Jessie Spano is all grown up!",
        "reviewBody": "After Japanese tourists are killed in a rental car, Chicago public relations executive Allie Brayman sees this as an opportunity. Allie is up for a big promotion, and while she has a go-go-go lifestyle, with a BMW whose license plate says 'PRRRRR' (how cute!), she does make time for her family. It's a good thing, because her father is not in good health.\n\nAllie also has time for romance. At a work-related party at the Cook County Railroad Museum (actually the Canada Railway Museum), she meets Kyle. Unfortunately, Kyle has a jealous ex-girlfriend with serious drug and alcohol problems, and what happens next becomes a public relations nightmare for Allie.\n\nAnd just when Allie thinks things can't get any worse, they do. This movie becomes quite a chilling adventure, with lots of interesting twists.\n\nI didn't recognize Elizabeth Berkley at first. Before I turned this movie on, I didn't even know who was in it. I just concluded it looked interesting. Berkley wasn't anything special at first, and I was prepared to say that the best thing about her was how good she looked. Even that wasn't noticeable at first, since she looked completely professional in her first scene. Later, though, she effectively showed a number of different emotions, and being a public relations person, Allie would have to know how to lie convincingly. She did! Berkley had a number of good scenes.\n\nJoel Wyner did a great job as the mysterious Kyle. And Barry Flatman also impressed as Allie's boss.\n\nThere was some violence, but not too much. The real concern for parents, in addition to the adult situations, would be sexual content.\n\nThe railroad museum was one of my favorite parts of the movie, especially when old-style jazz music was played. I liked the old train cars.\n\nIt wasn't a great mystery/thriller, but I wouldn't say bad either."
    },
    "url": "/title/tt0130208/"
}