{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Francis Ng",
            "url": "/name/nm0628757/"
        },
        {
            "@type": "Person",
            "name": "Athena Chu",
            "url": "/name/nm0160803/"
        },
        {
            "@type": "Person",
            "name": "Chun Chung",
            "url": "/name/nm0161199/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 306,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "alternateName": "Raped by an Angel 2: The Uniform Fan",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010248/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078888/"
        },
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        }
    ],
    "description": "A dentist obsessed with young women in various uniforms stalks two sisters. The oldest sister is romantically pursued by a thug that was just released from prison. The dentist also has the hots for her and the two paths eventually...",
    "director": [
        {
            "@type": "Person",
            "name": "Aman Chang",
            "url": "/name/nm0151630/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Action",
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE3OTA3NDM3Nl5BMl5BanBnXkFtZTcwMjE4NzYyMQ@@._V1_.jpg",
    "keywords": "rape and revenge,dentist,rape,revenge",
    "name": "Keung gaan 2: Chai fook yau wak",
    "original_info": {
        "id": "Raped By an Angel 2: Uniform Fan_1998",
        "name": "Raped By an Angel 2: Uniform Fan",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BA_Harrison"
        },
        "dateCreated": "2021-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0278665/"
        },
        "name": "Uniformly deviant.",
        "reviewBody": "The Uniform Fan is the second instalment in the Raped By An Angel series, the first being the Cat III semi-sequel to Naked Killer (1992), which went by the alternative title of Naked Killer 2 in many parts of the world (can't see many branches of Blockbuster stocking a film called Raped By An Angel).\n\nJoe Tak-Chung Ma plays Philip, a demented dentist who sexually assaults his female patients while they're sedated, but who particularly enjoys raping and killing women in uniform. After pretty schoolgirl Jenny (Chun Chung) pays a visit to his surgery, Philip concocts a plan to have his way with the girl, suggesting that she and some friends spend time at his country home while they are out camping.\n\nWhat the youngsters don't realise is that Philip has drugged all of the food and drink in the fridge; when the kids are unconscious, he sneaks into the house, pops on a prophylactic, and has his way with Jenny. He then drags Jenny's boyfriend Peter into the room, sticks a condom on the lad, and jerks him off. While he's busy working away at Peter, Jenny comes round, so Phil suffocates her with a pillow, and then frames Peter by placing the comatose kid between the dead girl's legs.\n\nAs if getting Peter arrested for murder isn't bad enough, Philip then arranges it to look like the poor schoolboy has committed suicide, after which he sets his sights on Jenny's sexy sister, policewoman Po Wan Yu (Athena Chu). He also kidnaps Po's wannabe suitor, triad boss Kong (Francis Ng, playing the comic relief), torturing him with a power drill, and then bludgeons his dental assistant with a wooden stool for refusing to help him any more. This guy is definitely one of Cat III's most twisted villains! Meanwhile, Po Wan Yu, unconvinced by Peter's suicide note, does some investigating...\n\nThe ending sees Po turning the tables on Philip during a dinner date, with a little help from her grandmother (who cuts off the killer's penis with a kitchen knife - way to go, granny!).\n\nIt might not sound like it, but Raped By An Angel 2: The Uniform Fan is actually fairly restrained in terms of graphic sex and violence (being rated Category IIB); that said, it still makes for uncomfortable viewing thanks to the way it casually switches from dumb comedy to sexual abuse and murder. Even though it's no Red to Kill or The Untold Story, there's enough general sleaze and gratuitous nudity to make it an entertaining slice of trash, and worthy of a one time watch for fans of HK exploitation. 6.5/10, rounded up to 7 for IMDb.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0278665/"
}