{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jamie Foxx",
            "url": "/name/nm0004937/"
        },
        {
            "@type": "Person",
            "name": "Regina King",
            "url": "/name/nm0005093/"
        },
        {
            "@type": "Person",
            "name": "Kerry Washington",
            "url": "/name/nm0913488/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 150947,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0129170/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0112879/"
        },
        {
            "@type": "Person",
            "name": "Taylor Hackford",
            "url": "/name/nm0000431/"
        },
        {
            "@type": "Person",
            "name": "James L. White",
            "url": "/name/nm1343803/"
        }
    ],
    "datePublished": "2004-10-29",
    "description": "The story of the life and career of the legendary rhythm and blues musician Ray Charles, from his humble beginnings in the South, where he went blind at age seven, to his meteoric rise to stardom during the 1950s and 1960s.",
    "director": [
        {
            "@type": "Person",
            "name": "Taylor Hackford",
            "url": "/name/nm0000431/"
        }
    ],
    "duration": "PT2H32M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxNDQwNjQzOV5BMl5BanBnXkFtZTcwNTQxNDYyMQ@@._V1_.jpg",
    "keywords": "based on true story,betrayal by a friend,character name as title,based on real person,eyesight",
    "name": "Ray",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "8ofem"
        },
        "dateCreated": "2004-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0350258/"
        },
        "name": "Unexpectedly Brilliant Performance",
        "reviewBody": "Given that Jamie Fox's former leading credentials not that long ago were limited to the Fox comedy series In Living Color and the atrocity of film, Booty Call, this is a truly pleasant surprise break-out performance. Jamie Fox is Ray Charles in this movie. You never question it or even think of him as Jamie Fox. It truly is uncanny. He physically looks like him, especially with the glasses, but the true magic of the performance is that he acts just like him. He walks around and performs like him, smiles like him, and just does everything like him. This is the best rendering of a real-life character in film since Jim Carrey's depiction of Andy Kaufman in Man On The Moon. However, I'd venture to say that Fox's rendering of Ray is even better. The film itself is good too, though it fails to make a smooth transition in several parts of it and lulls in some parts, while not lingering long enough in others. Of course all films of this nature that are essentially biographies to some extent tend to suffer somewhat from things of this nature. It's hard to pack 70 years into 2 1/2 hrs. Thus, the script mainly traces his early days starting out in music up into the late 60's, with a few flashbacks into his childhood and a brief jump to a single event in 1979. This is the only film I have ever seen in which the entire audience, myself included, stood up and gave a standing ovation after the last scene. It's a celebration of the life of Ray Charles that must be seen by all of his fans. The film doesn't pull any punches though. Two of the main dramatic focuses of the picture are Ray's infidelity on the road and his heroine addiction. All-in-all, a good movie, a great Oscar-worthy performance, and a good way to spend 2 1/2 hrs. This movie held my attention so well throughout its entirety that I really couldn't believe it was nearly as long as a lengthy epic like Titanic. A few quick notes: Jamie Fox spent a lot of time with Ray Charles in preparing for this role. Jamie wore prosthetics during the entire filming of the movie that made him unable to see, so if you wonder why he acts like he's blind so well, it's because he was for the movie. Also, he did all the piano playing himself, as he is practically a professionally trained pianist himself. However, for the singing, Jamie lip syncs perfectly to Charles' vocals. Overall, 8/10 movie...10/10 Jamie Fox performance."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In celebration of the 15th anniversary of 'Ray,' we take a look back at Taylor Hackford's Oscar-winning film, starring Jamie Foxx, Kerry Washington, and Regina King.",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4293574425",
        "name": "'Ray' | Anniversary Mashup",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjg0NmYxZDAtMzA3Yi00YTA5LTk3OTctZjg5ZWY5OGJkODM0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjg0NmYxZDAtMzA3Yi00YTA5LTk3OTctZjg5ZWY5OGJkODM0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-10-29T20:39:48.612Z",
        "url": "https://www.imdb.com/video/vi4293574425/"
    },
    "url": "/title/tt0350258/"
}