{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "America Ferrera",
            "url": "/name/nm1065229/"
        },
        {
            "@type": "Person",
            "name": "Lupe Ontiveros",
            "url": "/name/nm0648913/"
        },
        {
            "@type": "Person",
            "name": "Ingrid Oliu",
            "url": "/name/nm0646488/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7796,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005861/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0129644/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0084164/"
        },
        {
            "@type": "Person",
            "name": "Josefina Lopez",
            "url": "/name/nm1058851/"
        },
        {
            "@type": "Person",
            "name": "George LaVoo",
            "url": "/name/nm0492215/"
        }
    ],
    "datePublished": "2002-11-08",
    "description": "In East Los Angeles, an 18-year-old struggles between her ambitions of going to college and the desires of her domineering mother for her to get married, have children, and oversee the small, rundown family-owned textile factory.",
    "director": [
        {
            "@type": "Person",
            "name": "Patricia Cardoso",
            "url": "/name/nm0136603/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTNlNzAxMjktZmViZi00ZmU4LWJjNTYtMzhlZmQzY2FhYzgxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "factory,mexican american,latino,los angeles california,religious icon",
    "name": "Real Women Have Curves",
    "original_info": {
        "id": "Real Women Have Curves_2002",
        "name": "Real Women Have Curves",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2003-05-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0296166/"
        },
        "name": "endearing slice-of-life drama",
        "reviewBody": "`Real Women Have Curves' feels a bit like a modern ethnic version of `Georgy Girl,' featuring a free-spirited young woman named Ana who doesn't quite fit the mold of what society believes a woman should look like. \n\n Ana is a somewhat `overweight' high school senior living in East LA who has dreams of being the first person in her family to go to college. Her parents, however, have other plans for her life, which basically involve marriage, motherhood and a job working in her older sister's dress factory. Ana faces the struggle common to many young people who happen to be first-generation Americans: should she conform to the old-fashioned customs and traditions of her family or should she set out to make it on her own with all the advantages and opportunities available to people in this society? `Real Women Have Curves' avoids becoming a culture clash cliché through its keen observation of the minutiae of everyday life. Unlike most films, `Real Women' actually explores the day-to-day struggles of the working class in this country. The people in this film worry about whether or not they will be able to make a go of their businesses, whether or not their bills will get paid, whether or not a promising young student will be allowed to go to college and make something of herself or just end up as a cog in the system that absorbs so many of the underclass. It's these slice-of-life details that make the film interesting.\n\nAna's main foil is her own mother, who believes not only that her daughter is overweight and, thereby, ruining her chances to make an acceptable marriage, but that she must forego college in order to help with the family business. The majority of the conflict in the film occurs between these two women, both equally hardheaded, moody and determined to get what they want. America Ferrara as Ana, Lupe Ontiveras as her mother and Ingrid Oliu as Estela, her hardworking, levelheaded sister, create characters who are believable, subtle and instantly recognizable. Writers Josefina Lopez and George LaVoo have a sharp ear for the way people actually speak. Director Patricia Cardoso doesn't try to impress us with fancy camera angles or clever cutting. Instead, she lets the story develop naturally, allowing us to eavesdrop on a milieu that may seem strange to some of us. Cardoso knows full well that the universal nature of what she is showing us will draw us into the story and these characters' lives. It's nice, too, to see a film in which the young people are spending their time trying to get into good colleges instead of indulging in all the high school hijinks and hoopla we usually see in more mainstream movies these days. \n\nTrue, the movie does sacrifice some of its verisimilitude by trying a bit too hard to be a `feel good' experience. One occasionally senses a certain straining for the upbeat moral message, as when Ana convinces her coworkers to strip down to their undies in the factory as a statement about how women should not be ashamed of their bodies just because they aren't a size six. But the film more than makes up for that in the unconventional way in which it treats Ana's departure from her mother at the end. \n\n`Real Women Have Curves' is a small movie but a universal one."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from HBO Home Video",
        "duration": "PT34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi444793113",
        "name": "Real Women Have Curves",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjY2YTFjZjAtMDY4Ny00OTA5LThjZDAtYzAxODE5NGM0YzYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjY2YTFjZjAtMDY4Ny00OTA5LThjZDAtYzAxODE5NGM0YzYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:50:03Z",
        "url": "https://www.imdb.com/video/vi444793113/"
    },
    "url": "/title/tt0296166/"
}