{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Winona Ryder",
            "url": "/name/nm0000213/"
        },
        {
            "@type": "Person",
            "name": "Ethan Hawke",
            "url": "/name/nm0000160/"
        },
        {
            "@type": "Person",
            "name": "Janeane Garofalo",
            "url": "/name/nm0000413/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 51369,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010434/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Helen Childress",
            "url": "/name/nm0157536/"
        }
    ],
    "datePublished": "1994-02-18",
    "description": "A documentary filmmaker and her fellow Generation X graduates face life after college, looking for work and love in Houston.",
    "director": [
        {
            "@type": "Person",
            "name": "Ben Stiller",
            "url": "/name/nm0001774/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWY1ZGEyY2YtNWZhNS00OGZhLTg3OWEtODE2M2U5NjE4YmUyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "chicago illinois,timeframe 1990s,generation x,love,directorial debut",
    "name": "Reality Bites",
    "original_info": {
        "id": "Reality Bites_1994",
        "name": "Reality Bites",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "morphion2"
        },
        "dateCreated": "2006-01-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110950/"
        },
        "name": "Third Review... and I think I finally get it.",
        "reviewBody": "The first time I reviewed \"Reality Bites\" I was 15, and I had missed much of the film's point, praising it without critique. The second time was after viewing the film again a year later, upon which I began to notice things that I had naively ignored, such as just what self-centred people the characters were. I re-reviewed it, this time with an overly negative response. It was not until my third watching, and third review, of the film that I returned to my initial opinion, this time with reasons rooted in aspects of the film it had taken me 2 years to spot.\n\nComedy star Ben Stiller is most well known for his comic portrayals of characters cursed with incredibly bad luck (see Meet the Parents, There's Something about Mary, Zoolander). His career as a director is not nearly as extensive as that of his acting, although he has appeared in every film he's directed. For those wondering, it all started in 1994, with romantic comedy \"Reality Bites\".\n\nWinona Ryder plays Lelaina Pierce, a fresh-faced college graduate who works a frustrated job as assistant producer for a cheesy talk show, while in her own time she enjoys filming her friends Vicky (Janeane Garofalo), Sammy (Steve Zahn) and good-looking rebel Troy (Ethan Hawke) in an amateur documentary on the disenfranchised lives of Generation X called 'Reality Bites'. In a mild car accident she meets Michael (Stiller), a sweet-hearted businessman, and they begin a romantic relationship, from which sparks talk of taking her documentary to the commercial network Michael works for. Amidst this, tensions between Lelaina and Troy begin to rise as his feelings for her become clearer...\n\n\"Reality Bites\" is the kind of film that is prone to misperception. The movie has an under-the-radar subtlety to it that was widely missed even by advocators of the film. While the characters are given sensitive treatment in the script and in performance, they are also portrayed with the hidden agenda of satirizing the generation they exemplify and the culture of that generation. On one level this is apparent: the constant 90's culture references, quotes such as Troy's response to promptings from Lelaina while documenting him: \"I am not under any orders to make the world a better place\". The more hidden layer of subtlety comes in the form of the film's general Hollywood treatment and product placement: the film makers chose a undeniably commercial approach to a subject that is widely presented as such (life and love in the 1990's), while the specific matters and characters in the movie were based around independent and \"un-commercial\" philosophy. This means the film is, by its very nature, ironic on more than one level.\n\nCritics of the film were mostly irritated by the main characters' stereotypical personalities and subsequently found them to be boring. This misses another of the film's points: the characters are deliberately stereotypical and too often were the naïve and condescending opinions of these characters, namely Lelaina and Troy, mistaken for the morals of the film. \"Reality Bites\" doesn't believe that Lelaina is a genius documentarian, it doesn't believe that Troy is a brilliant and secretly reliable guy and it doesn't believe Michael deserves the rotten deal he gets. It just shows how this kind of cultural mentality plays out in practice.\n\nThat being said, one very straight-forward quality of the film is the acting performances. All four members of the lead cast do excellent jobs; they nail their characters with succinct accuracy. Ethan Hawke is the stand out performance, as the brooding and condescending Troy, a character most unlike any of the others he has played before or since. Ryder is at her best here, in a performance topped only by that of Girl, Interrupted. Stiller, too, delivers solidly, even if the role is very similar to others he has played.\n\n\"Reality Bites\" may strike a resonate note of realism for members of Generation X, but that really isn't its ultimate goal. Essentially this is a film that doesn't necessarily wear its heart on its sleeve, but serves as moderately engaging entertainment of a slightly more insightful nature than others of its kind.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this coming of age comedy",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi393283353",
        "name": "Reality Bites",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODNiM2QxMzMtNDMwMC00NmUzLTkxODQtMzczNGIyZmZiYTk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODNiM2QxMzMtNDMwMC00NmUzLTkxODQtMzczNGIyZmZiYTk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:45:25Z",
        "url": "https://www.imdb.com/video/vi393283353/"
    },
    "url": "/title/tt0110950/"
}