{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nikolaj Lie Kaas",
            "url": "/name/nm0509263/"
        },
        {
            "@type": "Person",
            "name": "Maria Bonnevie",
            "url": "/name/nm0095013/"
        },
        {
            "@type": "Person",
            "name": "Krister Henriksson",
            "url": "/name/nm0377631/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7497,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0099756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0477096/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099757/"
        },
        {
            "@type": "Person",
            "name": "Christoffer Boe",
            "url": "/name/nm1061993/"
        },
        {
            "@type": "Person",
            "name": "Mogens Rukov",
            "url": "/name/nm0750000/"
        }
    ],
    "datePublished": "2003-09-26",
    "description": "A young man who thought himself already in love with a nice girl is drawn into a literary drama when he is captured by a deep and stimulating love affair.",
    "director": [
        {
            "@type": "Person",
            "name": "Christoffer Boe",
            "url": "/name/nm1061993/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzIyZGQ1NjktNzM5MC00NDhiLWE1NWQtOWYzZTVkM2E4YzIxXkEyXkFqcGdeQXVyMjgyNjk3MzE@._V1_.jpg",
    "keywords": "downward spiral,copenhagen denmark,writer,subway,hotel",
    "name": "Reconstruction",
    "original_info": {
        "id": "Reconstruction_2004",
        "name": "Reconstruction",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "noralee"
        },
        "dateCreated": "2004-09-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0366943/"
        },
        "name": "An Artsy \"Revenge of the Cuckold\"",
        "reviewBody": "\"Reconstruction\" is a clever, European take on \"Unfaithful\" where an older husband uses literary intellect instead of violence to attempt \"The Revenge of the Cuckold.\" \n\nBut we have no idea how much is real or imagined or roman a clef or the character of the author is identifying too much with his alter ego, as we are told from the outset that what we will be seeing is the magic of the storyteller or puppeteer, watching as he manipulates his characters, trying out different situations in different drafts of a novel, erasing and playing out different scenarios of chance and choice, where art replaces the memory science of \"Code 46.\" \n\nI don't think I was the only audience member, however, who was rooting instead for the tall, dark, handsome young man as Nikolaj Lie Kaas has captivating chemistry with Maria Bonnevie (and I feel really foolish that I couldn't tell from either the film or the Danish credits until I looked at the IMDb listing that she plays both the jilted girlfriend and the adulterous wife). \n\nThe author makes some lame justifications about women needing love and men accidentally falling into it, or some such, that doesn't quite make sense and the film is supposed to be illustrating the point that a man has to learn about hurt as a price to be able to love. The author's self-understanding I suppose is illustrated by him reading his book's dedication to his wife in a desperate plea for her to forgive him all his inattention, etc. as he needs her for his art, so she shouldn't look for passion elsewhere. \n\nBut we're left more with the very powerful visuals of the different versions of how he imagined her possible affair could have started (a la \"Brief Encounter\") and its ramifications or concluded, and the feeling that the older guy was a smug deus ex machina. \n\nIn the things one can learn from the movies department: we also get a nice tour of Copenhagen-- people can smoke anywhere, even on the subway, and do, constantly; restaurant bathrooms have real terry cloth towels; the Hilton is really luxurious; Danes and Swedes don't seem to exchange cell hone numbers; and, like in \"Italian for Beginners,\" Danes seem to think of Italy as the place to go for romance."
    },
    "url": "/title/tt0366943/"
}