{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean-Pierre Darroussin",
            "url": "/name/nm0201669/"
        },
        {
            "@type": "Person",
            "name": "Carole Bouquet",
            "url": "/name/nm0000962/"
        },
        {
            "@type": "Person",
            "name": "Vincent Deniard",
            "url": "/name/nm1563330/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2895,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Red Lights",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012976/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023471/"
        },
        {
            "@type": "Person",
            "name": "Georges Simenon",
            "url": "/name/nm0799442/"
        },
        {
            "@type": "Person",
            "name": "Laurence Ferreira Barbosa",
            "url": "/name/nm0274262/"
        },
        {
            "@type": "Person",
            "name": "Cédric Kahn",
            "url": "/name/nm0434806/"
        }
    ],
    "datePublished": "2004-03-03",
    "description": "Antoine and Helene drive to South France to return their kids from a holiday camp. The traffic is dense and the atmosphere growingly tense; he is an alcoholic and becomes increasingly drunk the more often they stop. After a fierce...",
    "director": [
        {
            "@type": "Person",
            "name": "Cédric Kahn",
            "url": "/name/nm0434806/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgxNDY2Mjk5N15BMl5BanBnXkFtZTcwMDcyODYyMQ@@._V1_.jpg",
    "keywords": "watching tv,france,car keys,cigarette,traffic",
    "name": "Feux rouges",
    "original_info": {
        "id": "Red Lights_2004",
        "name": "Red Lights",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2004-09-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0365190/"
        },
        "name": "One for the road!",
        "reviewBody": "This film, in my humble opinion, has been misunderstood by the public, judging by the comments I've heard about it. \n\nFirst of all, the director Cedric Kahn is one of France's most interesting figures to come out in the last years. He knows what he is doing, and what's more, he's being naughty in the way he presents his story that makes us see it one way, but is it what we are seeing real? The adaptation by M. Kahn and Laurence Ferreira Barbosa takes the Georges Simenon story from America to France.\n\nThe most interesting thing about Antoine is that he is an ordinary man. He is married to a Helene, who is a more successful person; Helene is a lawyer who must make a lot of money, much more than Antoine. As a couple, we can't see them together at all. Antoine is a man who is not handsome. Helene, on the other hand is a beautiful woman, and we wonder what brought them together in the first place? We witness Antoine going to the bathroom where he ogles his own wife in the shower. It appears their sexual life has ended long before we meet them.\n\nAntoine has a drinking problem. On the trip to pick up their children they encounter heavy traffic. As they take a detour from the main highway, their troubles start. We see the passing \"red lights\" of the different bars beckoning Antoine to stop and have another beer, or a beer with a chaser. To make things worse, they hear on the radio about the escapee from the Le Mans prison, near to where they are traveling. We see the roadblocks and the erratic way in which Antoine begins to drive.\n\nAfter one pit stop, Helene disappears. She has decided to take the train and leaves him a note. Antoine goes to the station, but he is late. Thus begins what will be a long night adventure along rural, nocturnal France.\n\nWithout giving away what happens, we watch Antoine waking up. Antoine's car is in a ditch and he must fix the tire if he wants to go to get the children. This awakening seems to me, the turning point of the story. Are we sure what we saw after Helene's disappearance and what happened in the road to Antoine with a stranger really occur? Mr. Kahn is playing with us. There are a lot of clues, but as detectives, the director is asking us to stay attentive to what is really going on, or isn't.\n\nThe film belongs to Jean Pierre Darroussin. He is an actor whose own appearance makes us not care for the man we see on the screen. On the other hand, M. Darrousin knows who this Antoine is and what makes him tick. His performance is subtle, yet he carries the film in a way no one would expect from a not well known star. \n\nCarole Bouquet is a bourgeois woman who seems to be living in the wrong marriage. In contrast with her husband, she is in control of her life; she appears, at least on the surface, not to care about Antoine, but she has stayed married for a while. We know that Helene cares for Antoine at the end of the film when the two meet at the hospital. \n\nThis film shows Cedric Kahn as a director to be reckoned with.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0365190/"
}