{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anthony Hopkins",
            "url": "/name/nm0000164/"
        },
        {
            "@type": "Person",
            "name": "Edward Norton",
            "url": "/name/nm0001570/"
        },
        {
            "@type": "Person",
            "name": "Ralph Fiennes",
            "url": "/name/nm0000146/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 279041,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Thomas Harris",
            "url": "/name/nm0365383/"
        },
        {
            "@type": "Person",
            "name": "Ted Tally",
            "url": "/name/nm0848217/"
        }
    ],
    "datePublished": "2002-10-04",
    "description": "A retired FBI agent with psychological gifts is assigned to help track down \"The Tooth Fairy\", a mysterious serial killer. Aiding him is imprisoned forensic psychiatrist Dr. Hannibal \"The Cannibal\" Lecter.",
    "director": [
        {
            "@type": "Person",
            "name": "Brett Ratner",
            "url": "/name/nm0711840/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTAwZDI1OTctN2Q5YS00OGNiLWIyMmUtYWM4ZGFjYWYyYzJjXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "fbi agent,criminal profile,blindness,tabloid reporter,based on novel",
    "name": "Red Dragon",
    "original_info": {
        "id": "Red Dragon_2002",
        "name": "Red Dragon",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Void"
        },
        "dateCreated": "2008-01-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0289765/"
        },
        "name": "Nothing on Silence of the Lambs and the novel it's based on, but a decent thriller in it's own right.",
        "reviewBody": "After the return of the infamous Hannibal Lecter to our screens in 2001 with Ridley Scott's film version of the best novel in Thomas Harris's Lecter trilogy, it's not surprising that a new version of the first novel in the series got an update a year later considering that it's previous screen version, Michael Mann's Manhunter, doesn't fit in with the other two films in the series. I do have to say that this version is both more true to Harris' novel and an overall better film than Manhunter; though it does have numerous shortfalls and has nothing on the masterpiece 'Silence of the Lambs'. The plot is quite similar to the one in Silence of the Lambs, and features a cop on the hunt of a serial killer and receiving help from the incarcerated Hannibal Lecter. FBI Agent Will Graham, the captor of Hannibal Lecter, is called out of retirement to help catch a serial killer dubbed \"The Tooth Fairy\" by the media. The killer has already slaughtered two families and the FBI believes that another one is soon to join them; meaning that Will Graham has no choice but to ask Hannibal Lecter for help with the case.\n\nThe casting is one of the things that many critics pick up on, and that's not surprising. Anthony Hopkins effortlessly slips back into the role that he will always be associated with; although he's far more comical here than in previous Lecter films. As anyone who has read the book will tell you, Edward Norton is completely wrong for the role of Will Graham as the role needed a grittier actor. Harvey Keitel is a great actor, but Scott Glenn from Silence of the Lambs fit the role of Jack Crawford much better. There's nothing wrong with the rest of the supporting cast, however, with Ralph Fiennes, Emily Watson and Philip Seymour Hoffman all fit into their respective roles well. There's not a great deal wrong with the plot pacing, although the film is a little slow at times and the book is much more exciting on the whole. Certain parts of the plot could have been cut out to streamline the film for the screen, although Ted Tally's screenplay is good in that it does encompass most of the important parts of the book. Obviously this film is always going to come under criticism for not being as great as Silence of the Lambs and it does have nothing on the book, but overall Red Dragon is a decent enough thriller in it's own right and I cant say I dislike it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Coming Soon\"",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi848298265",
        "name": "Red Dragon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODk1ZWZmODktZGJjOS00ZGMyLWI3MzYtYmExZTRmMTJkM2UyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODk1ZWZmODktZGJjOS00ZGMyLWI3MzYtYmExZTRmMTJkM2UyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:39:48Z",
        "url": "https://www.imdb.com/video/vi848298265/"
    },
    "url": "/title/tt0289765/"
}