{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Xuan Ngoc Nguyen",
            "url": "/name/nm0629138/"
        },
        {
            "@type": "Person",
            "name": "Barbara Sonneborn",
            "url": "/name/nm0814384/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 336,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030579/"
        },
        {
            "@type": "Person",
            "name": "Barbara Sonneborn",
            "url": "/name/nm0814384/"
        }
    ],
    "description": "In this film made over ten years, filmmaker Barbara Sonneborn goes on a pilgrimage to the Vietnamese countryside where her husband was killed. She and translator (and fellow war widow) Xuan Ngoc Nguyen explore the meaning of war a...",
    "director": [
        {
            "@type": "Person",
            "name": "Barbara Sonneborn",
            "url": "/name/nm0814384/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Documentary",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk4MzA2NDU5Nl5BMl5BanBnXkFtZTcwNzg5MDIyMQ@@._V1_.jpg",
    "keywords": "widow,interview,f rated,memory,air raid",
    "name": "Regret to Inform",
    "original_info": {
        "id": "Regret to Inform_2000",
        "name": "Regret to Inform",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DannyBoy-17"
        },
        "dateCreated": "2000-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0181786/"
        },
        "name": "Two sides, and the two deaths of war",
        "reviewBody": "This is a heartbreaking Oscar-nominated film, 7 years in the making, that brings a war I've only known as history, being 20, to vivid, poignant, and brutally honest life. Sonnenborn brings the Vietnam war home from a bold new perspective- the war's widows, both American and Vietnamese. Sonnenborn herself is such a widow, and so the film's journey to the past begins with her own personal trek to Vietnam, searching for the ordinary field where her husband Jeff was killed. As much as the film depicts the spiritual suffering of American soldiers and their families, it reveals the Vietnamese in the same suffering, a decent people forced to do the unimaginable to survive in war.\n\nSonnenborn brilliantly combines peaceful images of the modern Vietnam with brutal up-front news footage from the war. The soundtrack is a mix of atmospheric music, the testimony of Vietnamese survivors describing their ordeal, and American widows reciting their husbands' words, through letters sent home during the war.\n\nI don't know why it is we constantly separate the documentary genre- this is a drama, a social and political film, and just because it has no major actors and relies totally on reality should not disqualify it from showing in your local multiplex. It is a powerful, memorable picture, not just \"another documentary.\" It makes you think and reflect about why we went into war, and it provokes many of the emotions for which we all seek film. \"Regret to Inform\" piercingly reveals how the souls, the humanity, of soldiers and civilians die in war. Seek this film out, whether you lived through Vietnam or not. It will affect you."
    },
    "url": "/title/tt0181786/"
}