{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Affleck",
            "url": "/name/nm0000255/"
        },
        {
            "@type": "Person",
            "name": "Gary Sinise",
            "url": "/name/nm0000641/"
        },
        {
            "@type": "Person",
            "name": "Charlize Theron",
            "url": "/name/nm0000234/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 41041,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042119/"
        },
        {
            "@type": "Person",
            "name": "Ehren Kruger",
            "url": "/name/nm0472567/"
        }
    ],
    "datePublished": "2000-02-25",
    "description": "After assuming his dead cell-mate's identity to get with the other man's girlfriend, an ex-convict finds himself a reluctant participant in a casino heist.",
    "director": [
        {
            "@type": "Person",
            "name": "John Frankenheimer",
            "url": "/name/nm0001239/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Action",
        "Adventure",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjNmNWIwZTAtMjM1MS00ODNiLTljYzMtNGI1ZmRkMmIxYzJiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "casino robbery,planning robbery,casino,christmas,female frontal nudity",
    "name": "Reindeer Games",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bayardhiler"
        },
        "dateCreated": "2016-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0184858/"
        },
        "name": "Decent, Underrated Heist Flick by the Late Master Frankenheimer",
        "reviewBody": "\"Reindeer Games\" may not go down as one of the best written or brilliant films ever made (and truth be told be it not for the fact that it was directed by the late, great John Frankenheimer, and starred Ben Affleck or Charlize Theron, it wouldn't have nearly been as noticed on this site as it is), but that doesn't mean it's without its merits. At heart, it's a simple story: prison convict Rudy Duncan (Ben Affleck)and his cell mate Nick Cassidy (James Frain) are two days away from being released around the holidays when Nick is killed in a prison riot. Saddened and distraught, Rudy ends up being released but not without assuming Nick's identity when he steps out of the prison gates to impress the beautiful and hot Ashley (Charlize Theron) that Nick had been writing to and intending to shack up with. Rudy tells himself that it's only until after New Year's but unbeknownst to him, he gets a lot more than he bargained for when Ashley's brother, Gabriel (Gary Sinise with Lt. Dan's hippie hairstyle) and his crew of gun running thugs force him into robbing a Indian casino (disguised as, of all things, a group of Santa Clauses!) because they think him to be the actual Nick Cassidy, who, just happened to have worked for that very casino as a security guard. Gee, what are the odds! From there, it's a race against time as Rudy tries to stay one step ahead of the sadistic Gabriel and some how escape with his life in time for Christmas. But along the way, Rudy will see there are a couple of twists and turns and despite his best efforts, he may spend Christmas in the morgue.\n\nWhat makes \"Reindeer Games\" as watchable and decently entertaining as it is would primarily be the direction of the master thrill maker John Frankenheimer. With his eye for the camera, he's able to squeeze the most tension out of any performance or script, no matter how convoluted it might be and under his supervision, the atmosphere is tight, fast spaced, and the story never stalls. It also helps that the movie has decent performances, even from Ben Affleck himself. Though I can't say Ben Affleck is the greatest actor in the world, under the right set of circumstances, he is capable of doing good work, and under Frankenheimer's tutelage, he does pretty decent here. Also noteworthy is Charlize Theron as the seemingly innocent Ashley, Gary Sinise's performance as gun running truck driver turned robber Gabriel, who does a decent job of being the bad guy of the film - even if the character is one dimensional - as well as the fact that there are a couple of note worthy actors playing his henchmen, such as the always dependable Danny Trejo, the underrated but solid Clarence Williams III, and good old natured Donal Logue. Plus, you'll notice a few notable cameos like Isaac Hayes as a fellow convict, a really random one of Ashton Kutcher as a casino patron (huh?), and a small but noteworthy performance of the late Dennis Farina as a sleazy casino manager. \"Reindeer Games\" may not reinvent the wheel, but with Frankenheimer's direction (his final feature film), some good acting, decent action, and few decent plot twists here and there, it's not a bad way to waste some time. Merry Christmas!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0184858/"
}