{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fabrizio Bentivoglio",
            "url": "/name/nm0072768/"
        },
        {
            "@type": "Person",
            "name": "Laura Morante",
            "url": "/name/nm0603090/"
        },
        {
            "@type": "Person",
            "name": "Nicoletta Romanoff",
            "url": "/name/nm1238739/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4378,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Remember Me, My Love",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073684/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136752/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100746/"
        },
        {
            "@type": "Person",
            "name": "Gabriele Muccino",
            "url": "/name/nm0610831/"
        },
        {
            "@type": "Person",
            "name": "Heidrun Schleef",
            "url": "/name/nm0772144/"
        }
    ],
    "datePublished": "2003-02-14",
    "description": "The members of a comfortable Italian family each struggle with their own secret issues and dilemmas.",
    "director": [
        {
            "@type": "Person",
            "name": "Gabriele Muccino",
            "url": "/name/nm0610831/"
        }
    ],
    "duration": "PT2H5M",
    "genre": [
        "Comedy",
        "Romance",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWUzYTQ1YmEtZGZiYi00ODE2LThlYjAtNGFmMWNlNGExMDg4XkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_.jpg",
    "keywords": "alienation,sexism,sexist,chauvinism,betrayal",
    "name": "Ricordati di me",
    "original_info": {
        "id": "Remember Me_2003",
        "name": "Remember Me",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dlpatrick1"
        },
        "dateCreated": "2005-04-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0323807/"
        },
        "name": "The ties that bind our selfishness center on a longing for love and being loved",
        "reviewBody": "This movie is hard to absorb, partly because the dialogue is difficult in translation and partly because of the fading and mixing of scenes that introduce the 4 character stories within. Four people in a family so plausibly like middle class families everywhere, except here in Italy the members are more likely to be beautiful, handsome, suave, and worth staring at for some feature or another. Muccino shows us that the happiness we work for within a family is easily thrown away (no wonder there is so much divorce), but that the common need to have one place where we think we can be recognized and loved for who we are can bind even the most dysfunctional family unit. Each character here is struggling with ego. Carlo (the handsome Fabrizio Bentivoglio whose hair belongs on marble statues) wants romantic love and an escape from boredom of his job and family -- he ought to have had something different, but he doesn't, and honestly he is the middle of middle class personified -- a salesman working on number 8 sale. Guilia (Larua Morante -- among the most beautiful of Italian actresses currently) is hopelessly insecure but pictures herself as a great stage actress, which is might possibly be -- if it really was her obsession -- the real obsession being to retain the normality of her marriage facade. Valentina (Nicoletta Romanoff) is the a self absorbed teen age bod beautiful with the hips and hair of her generation -- so anxious for a bit role in a dreadful television programme to recognize her beauty. And finally Paolo (A Muccino relative surely) desperate for recognition of his specialness. All want recognition for the specialness and at the same time the security of the familiar. Every moment of this movie shows the tension between the desire for a self-perceived \"fame\" or \"happiness\" based on selfishness and the pull that conventional family love provides. These characters recognize true happiness when the routine is threatened and Fabrizio faces possible paraplegia. The other three cannot (although they do) contemplate anything but return to the beginning. Scene after scene develops the characters -- and portrays their dilemma of self versus family -- something many of us continually face when lucky enough to have a unit that is at the same time crushing of self and supportive of \"love\". The ending is perfect -- smile, Fabrizio-- One was left knowing that nothing had really changed for this family or the individuals involved although 3 of them appeared to get what they wanted -- and even Fabrizio got his \"break\" from routine. Maybe he was the unluckiest and had to smile the hardest as he built his selfish love on a dream that had no apparent fulfillment (NO BRIEF ENCOUNTER THIS -- just a desire for a Brief Encounter). I imagine this movie was very disappointing to many -- it was a treat to one who scoured the video store for something different and found a depiction of every day life that was hopeful and helpless and maybe the description of a happiness that is never fully satisfactory but we are required in the end to accept -- and to live without ever being fully aware.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Remember Me, My Love Scene: Scene 4",
        "duration": "PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1994310681",
        "name": "Remember Me, My Love Scene: Scene 4",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTQyZDg1OTEtOTBhMS00ZmQwLWFjZGQtYmMxMGQyNmQ1ODMyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTQyZDg1OTEtOTBhMS00ZmQwLWFjZGQtYmMxMGQyNmQ1ODMyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-03-03T19:05:17.472Z",
        "url": "https://www.imdb.com/video/vi1994310681/"
    },
    "url": "/title/tt0323807/"
}