{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Arthur J. Nascarella",
            "url": "/name/nm0621597/"
        },
        {
            "@type": "Person",
            "name": "Christian Maelen",
            "url": "/name/nm0535393/"
        },
        {
            "@type": "Person",
            "name": "Jon Doscher",
            "url": "/name/nm1410656/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 247,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0168711/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0109255/"
        },
        {
            "@type": "Person",
            "name": "Sandy Eiges",
            "url": "/name/nm1449762/"
        },
        {
            "@type": "Person",
            "name": "Nicholas Reiner",
            "url": "/name/nm0718011/"
        },
        {
            "@type": "Person",
            "name": "Charlotte Wise",
            "url": "/name/nm1453169/"
        }
    ],
    "datePublished": "2005-03-29",
    "description": "A NYC artist is witness to his best friend's murder - or was he? Due to a drug problem, he can't recall what happened. Now he is the prime suspect and desperately tries to remember before it's too late.",
    "director": [
        {
            "@type": "Person",
            "name": "Christian Maelen",
            "url": "/name/nm0535393/"
        },
        {
            "@type": "Person",
            "name": "Jon Doscher",
            "url": "/name/nm1410656/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYyNDA5ODEzM15BMl5BanBnXkFtZTcwNDEwOTcyMQ@@._V1_.jpg",
    "keywords": "murder,sex scene,cocaine use",
    "name": "Remedy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bigjackforno"
        },
        "dateCreated": "2005-05-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0375008/"
        },
        "name": "Gritty, Raw, Realistic & Dark Indie...",
        "reviewBody": "Hey, without referring to any past reviews specifically, I don't know what some reviewers are talking about when they say the performances were \"leaden\", NONSENSE!! These performances I thought were particularly well acted and well written. Especially the role of \"Detective Lynch\" played by Arthur Nascarella of \"The Cooler\", \"Copland\" etc....The guy seemed so real as an NYPD detective that I started feeling a little paranoid and guilty about the wacky tabacky that I had just finished off myself before sitting down to watch this fine indie gem of a movie. Oh Yeah, did I mention the fact that he spent 20 years as a real NYC cop... Can't get any more real than that. Also the role of the Junkie struggling to get his life together \"Will Bentley\" played by Christian Maelen of \"I Think I Do\" and \"Wisegirls\" was nicely executed with a real-life sense of the gritty street life that almost makes you feel as if the actor had once been there himself??...excellent work by both actors. As for the plot and storyline...O.K., it's no \"Chinatown\" or \"Citizen Kane\" but come on,let's be realistic. This is a small, dark and gritty indie film which I think made the most of and did pretty well with what was rumored to be a miniscule budget of $100K or so. All in all a real nice job of a raw indie film with some strong performances by some young up and comers, not to mention all the beautiful Lipstick Lesbo action..gotta love that! Oh yeah, and for all you Kiss fans out there, come on, you know who you are, did I forget to mention Ace Frehley!!...that's right ACE FREHLEY as the wise old dope dealer \"Johnny\". Really cool to see Ace in this kind of film, perfect for him, Right On...GO ACE!! Anyway, I say go check this one out, definitely worth adding to your DVD collection if you're a fan of movies with an indie edge ala \"Drugstore Cowboy\" and \"Requiem For A Dream\". P.S., Great surprise, twist ending also, definitely check this one out!!, Peace Out Indie Fans, Later - Big Jack.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0375008/"
}