{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sophie Skelton",
            "url": "/name/nm5310225/"
        },
        {
            "@type": "Person",
            "name": "Duran Fulton Brown",
            "url": "/name/nm1750377/"
        },
        {
            "@type": "Person",
            "name": "Nick Cornwall",
            "url": "/name/nm5020122/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 421,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0510248/"
        }
    ],
    "datePublished": "2016-03-01",
    "description": "When Ren is marked by a powerful ancient spirit she is forced to leave behind the family she has spent her whole life protecting and journey across the land to find the real meaning behind the mark she bears.",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODY1MTM0NTMyNl5BMl5BanBnXkFtZTgwNzkxMDA5NzE@._V1_.jpg",
    "keywords": "journey,heroic fantasy,fantasy world,female protagonist",
    "name": "Ren",
    "original_info": {
        "id": "Ren & Stimpy: Season 5 and Some More of 4_1995",
        "name": "Ren & Stimpy: Season 5 and Some More of 4",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2016-03-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt4229228/"
        },
        "name": "I am really looking forward to seeing more....",
        "reviewBody": "The last few years have been a truly revolutionary time for media. Traditionally, big companies and corporations controlled publishing, movies and television. Yet with the advent of the internet and eBooks, there is a great democratizing of these industries. Now, if the average Joe (or Josephine) wants to make a movie or write a book they can...and they can get it to the public rather easily. Not surprisingly, this has naturally resulted in a lot of crap...but, more surprisingly, it's also brought us some amazing products...many of which have been funded by fans, friends and family. There are many examples of tremendous films out there which have bypassed the traditional distribution system. For example, the Star Trek fan films have gotten so good and the special effects so realistic that Paramount recently began threatening to prosecute some of these fan produced products. I also wrote a couple months ago about a truly breathtaking webseries, \"Time Keeper\" (by Daryn Murphy)--a project that further helps to redefine what an independent film can be and how cinematic it can look. \n\nThe latest of these non-traditional films I've had the privilege of seeing is \"Ren: The Girl With the Mask\". And, like \"Time Keeper\", it's a webseries. Making a film in serial form makes sense, as the filmmakers can produce each installment as crowdfunding allows. After all, unless you are a multimillionaire who doesn't mind spending their inheritance or you have a huge studio itching to fund you, you can't do much without money. With a crowdfunded webseries, you can release your film in stages as money allows. So, the more fans appreciate your work and are willing to help fund it, the more installments you can make and the sooner you can get them to the fans. And, unfortunately, if funding isn't forthcoming, the series will die...which is awful if you've been sucked into these often very immersive stories. Fortunately with Ren, they've already made five episodes and more are already being produced. Episodes one and two are already online and episodes three, four and five will be released later this month. I have only seen episodes one and two...so, like the series' fans, I am waiting impatiently for more...but I really like what I've seen.\n\nThe series is set in a mythical world much like the Middle Ages. In this bleak world is poverty, hunger and misery. Ren (Sophie Skelton) is a lovely young woman who is a bit of a rebel and non- conformist when the series begins, however, soon her entire life is upended when she becomes possessed with the spirit of a dying woman! I would tell you more but don't want to spoil it...plus, at this point, I am waiting to see what happens next to Ren!\n\nSo why am I anxiously awaiting future episodes? Well, the film looks and sounds so gorgeous and professional. The soundtrack, the cinematography and the sets and costumes look brilliant...much better than you'd expect from most crowdfunded productions. But as I already said, it's still early in the series and there is a second season coming as well...so I can't really say whether I love it or not...though I have really liked what I've seen so far. With three more episodes coming very soon, we'll all have a greater idea where the story by Michelle Golder, Christopher Dane and Kate Madison (who also directs) is headed next. \n\nBy the way, since only two episodes have aired so far, I'm withholding a vote for this one and may return later to update this."
    },
    "url": "/title/tt4229228/"
}