{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Denver",
            "url": "/name/nm0001134/"
        },
        {
            "@type": "Person",
            "name": "Alan Hale Jr.",
            "url": "/name/nm0001308/"
        },
        {
            "@type": "Person",
            "name": "Jim Backus",
            "url": "/name/nm0000822/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1874,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026916/"
        },
        {
            "@type": "Person",
            "name": "Sherwood Schwartz",
            "url": "/name/nm0777442/"
        },
        {
            "@type": "Person",
            "name": "Elroy Schwartz",
            "url": "/name/nm0777215/"
        },
        {
            "@type": "Person",
            "name": "Al Schwartz",
            "url": "/name/nm0777129/"
        }
    ],
    "datePublished": "1978-10-14",
    "description": "The castaways must try to readjust to life in civilization after they are rescued from the island.",
    "director": [
        {
            "@type": "Person",
            "name": "Leslie H. Martinson",
            "url": "/name/nm0554169/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMwMTYzNjY2M15BMl5BanBnXkFtZTcwODQ0OTUyMQ@@._V1_.jpg",
    "keywords": "1970s,gilligan's island,hawaiian islands,polynesia,pacific islands",
    "name": "Rescue from Gilligan's Island",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zillabob"
        },
        "dateCreated": "2007-06-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078155/"
        },
        "name": "Just sit right back....",
        "reviewBody": "NBC, out of nowhere in 1978, announced this TV film \"Rescue From Gilligan's Island\" as a Movie of The Week(which they did so well in the day!). Much was made of the fact that Tina Louise declined to be in the film-a mistake on her part-feeling the Ginger role had 'ruined' her career. Judith Baldwin kind of faked her way in the sultry part, but truly it was Dawn Wells who was still da bomb of the two of them. The story was what everyone had wanted to see. Many of the cast had aged noticeably but once in familiar costumes, they jumped back into the roles easily from the get-go and they kept it with \"real time\" in that they'd been missing for 15 years. It has the familiar theme song from the start and the Professor finds out grave news-via one of his ingenious devices-they have to leave the island because it's sinking. Gilligan's incompetency in cooking a fish on the wooden raft of huts causes a fire-which attracts the Coast Guard-and gets them rescued. After a rather-highly budgeted location scene that had them return to the the Honolulu harbor they left from-the film descends into familiar territory, on studio sets, with two Russian spies pursuing Gilligan for a missing part (from a Soviet rocket)he's wearing for good luck. One by one the castaways find they can't really connect back into society after the lapse of 15 years and are drawn back together, for...another boat cruise. The film wound up being a ratings smash for NBC, with one of the highest ratings ever for a TV movie, apparently! So much so they commissioned two more very lame,set-bound \"sequel\" movies-The Castaways of Gilligan's Island, and The Harlem Globetrotters on Gilligan's Island. The former had them winding up-after another three hour tour-back on the same island(apparently it did not sink) and, within the first 10 minutes rescued again by a condo developer who'd been there already and, puts them in charge of their famous island as a resort getaway. The latter film really was threadbare, and a new low-point for guest stars Martin Landau and Barbara Bain as the \"bad guys\" who create robots to go head to head with The Globerotters on the island at a sporting event. Jim Backus-who had been suffering the terrible effects of Parkinson's Disease-had to step out and was replaced by his and Mrs Howell's long-lost son. Backus, apparently so cared for his cast mates, and the role that despite his crippling illness found some strength and gave it his all to do a very quick walk-on scene(he could barely walk) and one or two lines that were written in at the last moment. He was obviously visibly ill. It's hard to think that the core of the cast, save for Dawn Wells, Tina Louise and Russell Johnson, have passed on because the show was so immortal even for it's mere 3 seasons and 3 movies.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0078155/"
}