{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Valeria Golino",
            "url": "/name/nm0000420/"
        },
        {
            "@type": "Person",
            "name": "Vincenzo Amato",
            "url": "/name/nm0024188/"
        },
        {
            "@type": "Person",
            "name": "Francesco Casisa",
            "url": "/name/nm1197165/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4771,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073684/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021808/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004038/"
        },
        {
            "@type": "Person",
            "name": "Emanuele Crialese",
            "url": "/name/nm0187740/"
        }
    ],
    "datePublished": "2002-05-22",
    "description": "On an impoverished Italian island, a free-spirited woman is accused of madness by townspeople fed up with her antics.",
    "director": [
        {
            "@type": "Person",
            "name": "Emanuele Crialese",
            "url": "/name/nm0187740/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzkzYWFmOTktZjg2OS00NjY2LTk3ZDQtNzUwOTI3Njg1ZjFkXkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_.jpg",
    "keywords": "husband wife relationship,emotionally unstable,emotionally unstable woman,protective son,island",
    "name": "Respiro",
    "original_info": {
        "id": "Respiro_2002",
        "name": "Respiro",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2003-11-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0286516/"
        },
        "name": "Magic realism and natural beauty",
        "reviewBody": "Emanuele Crialese's Respiro is alive, sensual, and transcendent. Set in Lampedusa, an island southwest of Sicily, it is a film about mothers and sons, accepting differences, and the power of love to bring renewal and reconciliation. Gorgeously filmed by cinematographer Fabio Zamarion, Respiro captivates us with its bright Mediterranean sunlight and the expressive faces of the people, tanned and strikingly beautiful. Winner of the 2002 Cannes Critics Week award, the film is based on a local legend about a mother whose behavior was found to be offensive by the community and whose subsequent disappearance was the catalyst that brought the people together. Crialese's film has the feeling of myth and legend but also the overtones of the great Italian realist dramas of the 50s and 60s. \n\nAs gangs of unsupervised pre-teens carry out intermittent warfare among the desolate beaches and rocky landscapes, everyday life centers on fishing. While the husbands do the fishing, wives work in the fish processing plant and the boys help out their fathers and catch fish to use as trade for a chance to win an electric train set. Grazia (Valeria Golino) is the wife of macho but loving fisherman, Pietro (Vincenzo Amato) and mother of three: 13-year old Pasquale (Francesco Casisa), younger brother Filippo (Filippo Pucillo), and older sister Marinella (Veronica D'Agostino). Golina is radiant as the headstrong young mother and Casisa's performance as Pasquale completely captures the budding sexual awareness of a pre-teen. The film reflects the warmth of the Italian family and the closeness that Italian sons feel for their mothers but also depicts the old-fashioned attitudes of the tight-knit community, especially the subjugation of women.\n\n In a revealing scene, Pasquale's brother, the adorable but mouthy Filippo and his friends follow his older sister Marinella to a private meeting place where she is seeking privacy with a shy young policeman, Pier Luigi (Elio Germano). Affronted by their seeming public display of affection, Filippo, less than half their size, confronts the two lovers and threatens to beat them up unless his sister goes home immediately. Unfortunately, everything is not right on the island. Grazia's behavior is increasingly defined by erratic mood swings. She flings dishes across the room, swims naked with her sons, and releases a herd of dogs from captivity, but it is not clear if she is ill or just rebellious and the film walks a tightrope between suggesting madness or the eccentricities of a free spirit. \n\nIt is soon apparent that the community has their own thoughts about her actions and she is seen as a threat to the social order. When Grazia's antics threaten to reach the breaking point, Pietro's family decides to send her to Milan to receive psychiatric treatment. Pasquale, however, always understanding and protective of his mother, hides her in one of the many caves along the rocky shore, bringing her food and reporting news of the search for her whereabouts. The ending can be interpreted in many different ways but I was touched by its haunting beauty. Is it to be taken literally, a dream of Pasquale's perhaps, or a fairy tale constructed from legend? I'm not sure but in any case, Respiro's combination of magic realism, natural beauty, and humanistic message will have you pricing the tickets for a trip to Lampedusa.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from 20th Century Fox",
        "duration": "PT1M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3464691993",
        "name": "Respiro",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGZiM2FhYmItMmEwYy00ZTA4LWJlNzctMjE2YzE4YzYwOTRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGZiM2FhYmItMmEwYy00ZTA4LWJlNzctMjE2YzE4YzYwOTRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:52:34Z",
        "url": "https://www.imdb.com/video/vi3464691993/"
    },
    "url": "/title/tt0286516/"
}