{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jf Davis",
            "url": "/name/nm0204791/"
        },
        {
            "@type": "Person",
            "name": "Sage Kirkpatrick",
            "url": "/name/nm0456733/"
        },
        {
            "@type": "Person",
            "name": "Geno Buick",
            "url": "/name/nm0119624/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 178,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024037/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023943/"
        },
        {
            "@type": "Person",
            "name": "Rolfe Kanefsky",
            "url": "/name/nm0437490/"
        }
    ],
    "description": "Shortly after her wedding, a young bride is seduced by a randy apparition she encounters while staying in an old haunted house. Four paranormal investigators are brought in to free the woman from the ghost's lusty grip.",
    "director": [
        {
            "@type": "Person",
            "name": "Debra Black",
            "url": "/name/nm1458011/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDU0NjZiNTEtNjQxMy00MjRiLWEwNzAtNDU0M2YwNmIwODQyXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "erotic horror,missing wife,deal with the devil,confederate general,satan",
    "name": "Restless Souls",
    "original_info": {
        "id": "Restless Souls_2002",
        "name": "Restless Souls",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BloodTheTelepathicDog"
        },
        "dateCreated": "2010-11-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0382263/"
        },
        "name": "Legend of Hell House Meets Cinemax Late at Night",
        "reviewBody": "Now, the only reason I gave this a seven-out-of-ten is that is succeeds in what it set out to do: make an erotic ghost flick. This isn't horror nor is it softcore porn, but a melding of the two, and the makers of the film make it work.\n\nThe Westlakes, newlyweds, are forced to stay the night at what looks like an abandoned bed and breakfast. They \"check in\" but the lovely Mrs. Westlake never checks out. She, played by Amy Hite, is abducted by a sinister entity to be used as a Satanic sex slave. Needless to say, Mr. Westlake doesn't take this lying down. Days later he helps assemble a team of ghost hunter types to bring his wife back.\n\nThe ghost hunters enter the building but quickly fall victim to the place's sexual charm. Erotic entities take control of the hunters and attempt to keep them preoccupied while the demons behind the scenes search for the proper sacrifice.\n\nSTORY: $$$ (The story is what it is. There are numerous sexual couplings, but at least we have a supernatural element rather than the ol' repairman stops by for a fix).\n\nACTING: $$$ (Not that bad. Sage Kirkpatrick, who goes by many names, does the best job here as the chaste telekinetic. C. Johnston, as Mr. Westlake, also does a fine job while also getting busy with several female cast members).\n\nNUDITY: $$$$$ (Since this is an erotic horror flick, the nudity is in great supply. Sage Kirkpatrick is amazing to look at and Amy Hite is a heavenly beauty. Hite is a petite little gal with the greatest pair of come-hither eyes you're likely to see. Miss Kirkpatrick, although a capable actress, is clearly best known for those natural gifts that reside on her chest).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0382263/"
}