{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adam West",
            "url": "/name/nm0001842/"
        },
        {
            "@type": "Person",
            "name": "Burt Ward",
            "url": "/name/nm0911431/"
        },
        {
            "@type": "Person",
            "name": "Jack Brewer",
            "url": "/name/nm1229445/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2159,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014903/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043378/"
        },
        {
            "@type": "Person",
            "name": "Duane Poole",
            "url": "/name/nm0690830/"
        }
    ],
    "datePublished": "2003-03-09",
    "description": "When the Batmobile is stolen, Adam West and Burt Ward search for it while remembering their days as the stars of the Batman live action series.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul A. Kaufman",
            "url": "/name/nm0442237/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Biography",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkwNTA2NjQzOV5BMl5BanBnXkFtZTcwMTIzNjgyMQ@@._V1_.jpg",
    "keywords": "superhero,dc comics,lifting a male into the air,superhero action,lifting an adult into the air",
    "name": "Return to the Batcave: The Misadventures of Adam and Burt",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vox-sane"
        },
        "dateCreated": "2003-03-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0321359/"
        },
        "name": "The Best of Reunion Times",
        "reviewBody": "There are many kinds of reunion shows. One kind is where old actors are taken out of mothballs and set to recreate characters they haven't played for twenty or thirty years. These have mixed results. `Return to Mayberry', despite some silliness, was okay; `Return to Green Acres' as execrable (Eddie Albert used a word for the script I won't repeat here, but both it and the movie stink); `Rescue from Gilligan's Island' filled in a necessary gap in the story of the castaways, though the show itself was silly even from a `Gilligan's Island' viewpoint. In most cases, the scripts are weak; sometimes a silliness appears in the scripts that is too knowing  and in comedy it's nearly always fatal for the characters to know they're being funny. New characters are introduced who don't fit the mix. In the main, these reunion shows are pretty weak. A second sort of `reunion' show is the kind where the cast lays its past aside but sits around, telling stories, reminiscing, interspersed with flashbacks from the shows. Then there are movies based on the shows, which are rarely good; and movies based on the history of the show (`The Brady Bunch' has had both of these happen to it, with various results).\n\n`Return to the Batcave' uses nearly all the above, with a wonderfully twisted viewpoint, which makes it the best of the reunion shows, and has raised the bar for the others.\n\nAdam West and Burt Ward and summoned to a showing of the original Batmobile. While they are there, the car is stolen. \n\nThe Adam West of the movie is a man demented. He called Jerry, his butler, `Alfred'. He opens a bust of Shakespeare in his apartment and reveals a hidden pole to slide down to the parking garage. He's obsessed with being a crime fighter, when in fact he's merely a washed up actor. When the Batmobile is stolen he not only believes it's his duty as a crime fighter to recover it, he drags and unwilling Burt Ward in as his assistant.\n\nThe pursuit is largely loquacious, with West and Ward reminiscing about the old days. It is broken by `flashbacks' with actors playing West and Ward in the old days. The modern scenes and the `flashbacks' both have the wacky lack of reality the show maintained. There are also running gags that show West is able to make fun of himself: in Ward's book about his time on the show, he spoke frankly about West's libido and also his being a skinflint (West makes Ward pay for everything in their pursuit, down to tips and bus fare). The clues they follow, the characters they meet (even in flashback) all fit the mentality of the old series, and there are several homages, including a fist fight with written sound effects.\n\nThe whole thing is extremely funny and done with great panache. There are also cameos by Julie Newmar (looking like she's had one facelift too many) and Frank Gorshin, reminding us why he has such a cult following. Gorshin will be the Riddler when Jim Carey, his obvious successor, is long forgotten. The movie builds to a fairly obvious but funny climax.\n\n This show is a model for reunion shows  unfortunately, there are few that can fit the pattern. This show had actors replaying their old characters; young actors playing a movie about the making of the show; the actors West and Ward reminiscing; and a modern-day movie with the real Adam West playing the demented Adam West. It has everything. If you loved the old show, this is the stopper on the bottle.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Clip: Opening sequence",
        "duration": "PT2M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3850567961",
        "name": "Return To The Bat Cave",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDA2NzdjMjYtZjk5Ny00OTQ1LTg0Y2QtODhmMTdhMjk5MjEyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDA2NzdjMjYtZjk5Ny00OTQ1LTg0Y2QtODhmMTdhMjk5MjEyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:53:00Z",
        "url": "https://www.imdb.com/video/vi3850567961/"
    },
    "url": "/title/tt0321359/"
}