{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Takeshi Kaneshiro",
            "url": "/name/nm0437580/"
        },
        {
            "@type": "Person",
            "name": "Anne Suzuki",
            "url": "/name/nm0840551/"
        },
        {
            "@type": "Person",
            "name": "Gorô Kishitani",
            "url": "/name/nm0457240/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11409,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Returner",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028938/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055529/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0195909/"
        },
        {
            "@type": "Person",
            "name": "Takashi Yamazaki",
            "url": "/name/nm0945724/"
        },
        {
            "@type": "Person",
            "name": "Kenya Hirata",
            "url": "/name/nm1618246/"
        }
    ],
    "datePublished": "2002-08-31",
    "description": "A young woman from the future forces a local gunman to help her stop an impending alien invasion which will wipe out the human race.",
    "director": [
        {
            "@type": "Person",
            "name": "Takashi Yamazaki",
            "url": "/name/nm0945724/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWRhNDBhZjgtZTAwOS00MjM4LWJhNGItMDhmYzllZjdjNGI3XkEyXkFqcGdeQXVyODkxMTU1Njc@._V1_.jpg",
    "keywords": "hitman,the future,alien invasion sci fi,alien,time traveler",
    "name": "Ritânâ",
    "original_info": {
        "id": "Returner_2002",
        "name": "Returner",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Li-1"
        },
        "dateCreated": "2004-02-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0339579/"
        },
        "name": "Good sci-fi action entertainment.",
        "reviewBody": "Rating: *** out of ****\n\nOn first impression, I enjoyed Returner very much, but I can easily see why many others didn't care for it. The movie's plot is a rip-off of countless American blockbusters (just on first viewing I see E.T., The Terminator, Back to the Future, ID4, Stargate, Dune, The Matrix, MI:2, and even a little bit of The X-Files) and there's nothing really all that special in the way the story is executed but in general most Asian action flicks don't have much plot so I at least count it a blessing that ripping off all the aforementioned films gives the film enough story to sustain interest.\n\nTakeshi Kineshiro stars as Miyamoto, a mercenary who has an agenda against Yakuza boss Mizoguchi (Goro Kishitani). But before he can fulfill his vengeance, a time-traveling girl (Ann Suzuki) interrupts his task, giving Mizoguchi the opportunity to escape. Frustrated, Miyamoto takes the dazed girl back to his apartment. There, she informs him her name is Miri and that she's traveled back from the year 2084 to save the world from an incoming alien invasion.\n\nNaturally, he doesn't believe her, but finds he has no choice but to help her when she tapes a bomb to his neck. Miri informs him that an alien spacecraft has crashed and the surviving crew member will signal the mothership, thus instigating the war between humans and these aliens called the Daggra. Joining Miri's mission to kill this surviving alien, Miyamoto gradually believes her when he witnesses some astonishing sights. But what should be an easy task proves difficult when the Yakuza get involved and want the alien technology for themselves.\n\nJapan's first (or maybe they've done it before, I sure as hell don't know) attempt at crafting a summer blockbuster that can rival those of American cinema is an unqualified success as a work of great entertainment. It delivers what one would expect from a popcorn blockbuster: fast-paced thrills, big laughs, and visual spectacle, but there's a layer of genuine heart and emotion that propels this far above the crap one could expect from Michael Bay or Jerry Bruckheimer.\n\nTakeshi Kaneshiro is understandably one of Asia's biggest heartthrobs, the man looks great in tousled hair and long trench coats. But along with the cool exterior, he boasts solid acting talent to go with all that charisma. No doubt, he'll probably be Asian cinema's most popular star within the next five years. Ann Suzuki also impresses as the young teen who's had to grow up fast for her age. It's the natural and sweet rapport the two develop that raises the stakes; the addition of human interest makes the action and the story more compelling. As the hilariously laconic and irredeemably evil Mizoguchi, Goro Kishitani is fun to watch, his villainous performance evoking a mix of past work from Alan Rickman and Gary Oldman.\n\nReturner boasts numerous terrific action sequences, rousing gun battles that employ fluid camera-work and stylish slow motion. The opening setpiece, with Kineshiro taking down scores of Yakuza, is a total blast and the coolest opening sequence since Equilibrium. Some of the action scenes employ bullet-time techniques, but that's thankfully limited to only a few moments. There's a potentially cool motorcycle chase that ends way too quickly, but otherwise, the action is first rate.\n\nAs for the f/x, I was really quite impressed. I don't know what budget this film had to work with, but the visuals are mostly excellent. Most of the f/x are at least on par with a Sci-Fi Channel miniseries (like Children of Dune), and occasionally are up there with even expensive Hollywood blockbusters (the effects sure as hell are better than, say, The Core). The CGI work on the alien mothership is gorgeous, a definite improvement on the model work from Independence Day.\n\nReturner is not without its faults. There are a few moments that are simply too similar to its \"inspirations.\" The riffs from Independence Day go all the way down to the inclusion of telepathy, alien body armor, and force fields. The battle sequence between the aliens and the last human outpost is gripping. The sets, the direction, and the f/x are all impeccably handled in this setpiece. It probably should have been the film's highlight, but the scene is marred by some poor acting from foreign actors who clearly shouldn't be trying to fake American accents.\n\nBut despite its blatant unoriginality, Returner is spirited and thrilling. The climax, set aboard an ocean-bound oil rig, is an exhilarating race against time amid several blazing gun battles. There's some sentimentality on hand, and I'll even admit I got a bit choked up near the end. Admittedly, the movie runs a bit long after all the action, but there's a nice post-climactic plot twist that should please most sci-fi fans.\n\n(Major spoiler warning) I gather that the filmmakers were assuming that once Miri returned to the future, she'd still have the same memories of the former timeline (a la Back to the Future, Frequency), thus enabling her to save Miyamoto. But I'm not sure why she'd automatically return to the future after thwarting the war, or why she didn't arrive after Miyamoto realized she'd saved his life to spend some time with him (End spoiler).\n\nAnd what's up with playing a Lenny Kravitz song over the end credits? It's a bit of a distraction for an otherwise rather touching final scene. But on the whole, Returner is enthusiastically recommend to sci-fi action fans."
    },
    "url": "/title/tt0339579/"
}