{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlie Terrell",
            "url": "/name/nm0855818/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009921/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0175998/"
        }
    ],
    "datePublished": "2004-11-15",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Lucas",
            "url": "/name/nm0524239/"
        }
    ],
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWUxMDc3ODQtZDBiMS00Y2Q4LWJlYzgtNzBkNzk1MzNkZTg0XkEyXkFqcGdeQXVyMTY3NDU5NzM@._V1_.jpg",
    "keywords": "tv special,concert film,tribute,tribute concert",
    "name": "Return to 'Sin City': A Tribute to Gram Parsons",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2008-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0870194/"
        },
        "name": "Too Heavy",
        "reviewBody": "This is quite a disappointment. If you know Gram's music, you'll probably be offended by this.\n\nSee, the thing about Gram wasn't the melody or words, what is borrowed here. It was the lightness and sadness in the way they were sung.\n\nHis songs were patterned after ordinary country songs, which by design are simple and unassuming. His lyrics addressed a tragic life without the humor or detachment found in the originals. So they are notable in that respect, slightly.\n\nBut it was the way Hillman found a sparkling lightness with glittering small notes that were there only to fill the space as if they were sequins. And it was the way that on top of that, that Gram sung. His songs are delicate. Dylan's songs can survive any mangle, any approach. But Gram's were engineered for his voice and the way he surrounded his words with a perfect melancholy, so perfect that you suspect it, but so honest that you know in your heart he is a lost soul.\n\nIts Janis turned inside out, the female firefly urges hanging in the space around his face. Emmylou made this perfect by occupying that space and giving him something to surround. Something like that can never happen again, never. Its those moments we need to celebrate, not the burned corpse of the song, dragged across the country to be sung by talented posers.\n\nAnd the way they treat the material! Instead of a filigree, they give us a powertool. Instead of the lightness it owns, we are served a heavy boom a cucka thunking, the sort of thing that his vision has degenerated into. This is country rock now, where it once was cosmic Americana.\n\nThe Nora Jones solo is remarkable, not because of the song, nut just because she understands what it means to dance around a phrase. Its a different set of shapes than Ingram, but lovely nonetheless.\n\nThen we get Keith Richards. The final desecration. \n\nTed's Evaluation -- 1 of 3: You can find something better to do with this part of your life."
    },
    "url": "/title/tt0870194/"
}