{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vince Vaughn",
            "url": "/name/nm0000681/"
        },
        {
            "@type": "Person",
            "name": "Anne Heche",
            "url": "/name/nm0000162/"
        },
        {
            "@type": "Person",
            "name": "Joaquin Phoenix",
            "url": "/name/nm0001618/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14962,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030612/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058765/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019483/"
        },
        {
            "@type": "Person",
            "name": "Pierre Jolivet",
            "url": "/name/nm0427136/"
        },
        {
            "@type": "Person",
            "name": "Olivier Schatzky",
            "url": "/name/nm0770241/"
        },
        {
            "@type": "Person",
            "name": "Wesley Strick",
            "url": "/name/nm0834338/"
        }
    ],
    "datePublished": "1998-08-14",
    "description": "Two friends must choose whether to help a third friend who was arrested in Malaysia for drug possession.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Ruben",
            "url": "/name/nm0747849/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjIyZDZmNDYtNTk0Mi00N2MyLWFhN2ItZjhiYzY4ZGU2NjI4XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "death sentence,guilt,redemption,malaysia,prison",
    "name": "Return to Paradise",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ShelBaby"
        },
        "dateCreated": "2004-10-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0124595/"
        },
        "name": "Paradise Found: A Lush, Intelligent Character-Driven Film",
        "reviewBody": "This movie appeals on many levels... smartly written, with seductive cinematography, strong editing and acting throughout (with forays into brilliant). And, yes, the romantic sub-plot and un-\"Hollywood\" style ending DO make sense! Read on ... \n\n(NO SPOILERS)\n\nReturn to Paradise, a beautifully written, crafted and acted film is one of the few DVDs in my collection that I just keep coming back to.\n\nThe prologue in Malaysia begins during the credits and is worth the watch in itself. It grabs our interest, and establishes the dynamic between these three young men, who are off for a post-college fling before assuming their \"real\" lives. The music, hand-held camera effects, and MTV-style editing evoke the carelessness of youth, of a young man's idea of \"Paradise\".\n\nTony (played by David Conrad) is an opaque, friendly, architect/engineer who is Everyman in his pursuit of honor within the bounds of a satisfying, conventional life. Louis (Joachim Phoenix)  a gentle soul - whose plan is to stay in Southeast Asia and pursue Animal Rights ... and \"Sheriff\", played by Vince Vaughn - a tough, straight talking hustler from Brooklyn. It is Sheriff's journey that we stay with as the action moves over to America, then back to 'Paradise'. \n\nWe discover, along with the characters, what has happened to the friends since their idyll on Penang. When we rejoin Sheriff, it is a few years later. He is driving a limo, and living in a seedy NYC apartment, filled with books. He is on a path that stumbles as he irreverently, but wistfully, reaches for inner growth. We know enough about movies to know that SOMEthing interesting is about to happen to this good-looking guy. By the time the story wraps up, the character of Sheriff will have achieved an impressive depth of self-awareness, subtlety and tenderness that is a credit to the delicacy of Vaughn's acting in this piece. \n\nLouis and, in his stead, Beth (Anne Heche), believe that greater things lie inside of Sheriff. In the prologue, Sheriff, brash and careless, teeters when Louis asks him (with confidence in Sheriff's core of selflessness) to join a fight to save the orangutan. Much later, faced with a corresponding request from the compelling and volubly erotic character that Heche creates, Sheriff uses his affair with Beth as a catalyst to reach for the nobility in his soul. \n\nThings do not turn out as we (or they) expect. Character relationships reshuffle a bit near the end, but rather than being devices to surprise and tweak our emotions, these twists and turns of the plot help ensure that Sheriff's decisions are (as he tells his friend in a poignant jail cell meeting ) his own. Like Tony, Sheriff ultimately makes his choices, not on behalf of his friends ... but for himself.\n\nThe best thing about Return to Paradise is that there are no bad guys. A life 'hangs in the balance', but the competing forces are, as in the real world, created by the myriad of individuals all acting out their own interests with no real malice, yet perhaps without the purposeful empathy represented by the Louis character. We are absorbed by the compelling interplay between Beth, Sheriff, Tony, the Malaysian officials and MJ Major (the aggressive reporter played by Jada Pinkett-Smith in an acerbic, pivotal, cameo) all the way through to the final, cathartic, conclusion.\n\nDon't miss this one."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from PolyGram Video",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1956577561",
        "name": "Return To Paradise",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODQ5YWY0ZjMtZGZiYi00M2JhLWI0MzMtYmY4M2RlYTFlODc4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODQ5YWY0ZjMtZGZiYi00M2JhLWI0MzMtYmY4M2RlYTFlODc4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:35:27Z",
        "url": "https://www.imdb.com/video/vi1956577561/"
    },
    "url": "/title/tt0124595/"
}