{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Bill Pullman",
            "url": "/name/nm0000597/"
        },
        {
            "@type": "Person",
            "name": "Natascha McElhone",
            "url": "/name/nm0001523/"
        },
        {
            "@type": "Person",
            "name": "Michael Massee",
            "url": "/name/nm0557219/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1537,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009465/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142539/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017390/"
        },
        {
            "@type": "Person",
            "name": "David Seltzer",
            "url": "/name/nm0783544/"
        }
    ],
    "datePublished": "2005-04-13",
    "description": "Just before the start of the Apocalypse, a physicist and a nun race against the clock to see if the end of the world can be averted.",
    "genre": [
        "Fantasy",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzliNzc1OTMtMjc5OC00OWZlLWEyNDEtOTNiNmQxODliZGNhXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "armageddon,end of days,apocalypse,doomsday,male female partnership",
    "name": "Revelations",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mkham6"
        },
        "dateCreated": "2005-04-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0403795/"
        },
        "name": "It's the End of the World... and I feel fine",
        "reviewBody": "REVIEW: Wed + Sun 9pm NBC: \"It's as probable for a tornado traveling through a junkyard to produce Buckingham Palace than for life to emerge from the Big Bang,\" says the teacher at the start of Revelations and he's the scientist. The series, produced by Omen maker David Seltzer is relatively well done, with the likable Bill Pullman playing a scientist whose daughter has been kidnapped and murdered by a Satanist who excised her heart in a ritual sacrifice. Pullman goes to Chile and helps capture the fiend, and later is confronted by a Nun (the other-worldly Natasha McElhone – the wife in Solaris) whose sister has died in an apocalyptic cult in Africa, and who drags him to the bedside of a young brain dead Florida girl who was hit by lightning. Of course, this girl is talking.. in Latin, and it's about the end of the world. Evil secular doctors are eager to harvest her organs while the Sister's foundation staves them off (doctors love to pull the plug on speaking patients). The girl draws a stick figure (with ancient writing) that is the same as Pullman's daughter used to. The parallels with the Florida Schiavo allow-to-die circus are probably coincidental, but jarring. Signs abound: a shadow of Jesus on the cross on a Mexican cliff, a lone child pulled from floating wreckage of a Greek ferry, the Satanist chopping his finger off without bleeding.\n\nI personally love these apocalyptic movies, but feel this is in so many ways a sop to the religious right, whose penetration into government is alarming. It feeds the creationist fervor, the cheap exploitive political acts behind the Schiavo carnival of fools. At the first meeting the Sister wisely advises the dubious Pullman to start contributing to religion. \"All the signs and symbols are currently in place for the end of days.\" They allow Pullman to visit the killer of his daughter in prison, dubiously unmonitored, who chops his finger off in the feeding slot, and doesn't bleed. This sends Pullman on a quest for the Answers, being dragged kicking and screaming towards the Truth, like Gregory Peck so long ago in The Omen (actually saw that world premiere in LA). Portentous Bible quotes start each section. When the girl dies, Pullman holds her hand, and she.. awakes. Personally I don't think we should rush this apocalypse business- some nightmare virus may make it real for hundreds of millions soon enough. Not as intense as I thought, but then NBC isn't cable. Rating: 6 out of 10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Revelations",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1300675609",
        "name": "Revelations",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmQzODljMjMtZTEwNC00YTdmLThkYTAtOGYzN2ZlN2Q3MWVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmQzODljMjMtZTEwNC00YTdmLThkYTAtOGYzN2ZlN2Q3MWVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-22T22:46:55.542Z",
        "url": "https://www.imdb.com/video/vi1300675609/"
    },
    "url": "/title/tt0403795/"
}