{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Suzanne Hart",
            "url": "/name/nm1312405/"
        },
        {
            "@type": "Person",
            "name": "Jill Meyers",
            "url": "/name/nm1309009/"
        },
        {
            "@type": "Person",
            "name": "Candice Sharp",
            "url": "/name/nm1059426/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 83,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "datePublished": "2003-03-18",
    "description": "At an anger management camp for teenagers, someone is getting rid of the counselors and campers using very sharp instruments. By nighttime only a few are left, but who can they trust when they know one of them is the killer?",
    "director": [
        {
            "@type": "Person",
            "name": "Shawnee Mercer",
            "url": "/name/nm1046106/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDY5ZmIyNTUtZjI2Yy00ODMxLWE5MDUtNWNmODM3ZWM0NmRmXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1_.jpg",
    "keywords": "teenager,camp,female nudity,skinny dipping,sex",
    "name": "Revenge of the Unhappy Campers",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Linda83"
        },
        "dateCreated": "2005-06-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0350050/"
        },
        "name": "Good slasher flick, with some humor thrown in.",
        "reviewBody": "This movie begins with two counselors: Vicky and Ben (Stacy Ann Wilkins and Reuben Rox) walking in the woods looking for a perfect spot to have sex. After they are done, she decides to go swimming, he goes back to the camp, the camera follows him to the cabins where we meet some of the male campers: Angel, Oscar and James (Terrence Baker, Pedro Gutierrez and Michael Cruz), we also meet counselor Ned (Christopher Williams) who happens to be smoking pot in the bathroom. Once he is finished he walks out of the cabin bumping into fellow counselor Candy (Suzanne Hart), she's on her way to the girls cabin and as she enters we can tell they are already up, all of them are in the shower: Urzula, Sue, Chelita and Minnie (Jill Meyers, Candice Sharp, Maya Tesashita, Liza Moore). This was a very lenghty shower sequence inter-cut with the guys showering at the same time.\n\nAt the dining hall we meet the camp's owner Mrs Gere (Lynne West), nurse Tina (Alison Cuffe) and two more counselors: Gus and Mimi (Kent Gregory, Deborah Jolson). As campers and counselors are eating breakfast a fight breaks out between Angel and James, counselors Ben and Gus separate them, in the process Gus is cut with a knife, nurse Tina tends to him, they go to her office and make out.\n\nI guess all these scenes were for the audience to learn a little about all of the characters and they succeed as we quickly discover who are bitches, spoiled rich kid, the drug addict, the nice counselors, the counselors who don't give a damn, etc.\n\nAnd now the body count:\n\n1= Counselor Mimi - knife through mouth, little blood.\n\n2= Camper Angel - off-screen stabbed in eye with icicle, no blood. \n\n3=Counselor Ben - stomach slashed with machete, guts come out.\n\n4=Counselor Vicky - machete on shoulder while naked, some blood. \n\n5=Counselor Gus - ax buried in chest, quite bloody.\n\n6= Camper Chelita - ax to the head, little blood. \n\n7= Counselor Ned - beaten to death with shovels. \n\n8= Camper Oscar - drowned in lake. \n\n9= Nurse Tina - leg chopped off, lots of blood. \n\n10= Mrs. Gere - stabbed in the stomach with knife, bloody. \n\n11= Camper Minnie - off-screen, found dead on bed, throat cut open. \n\n12= Camper James - hand chopped off, foot stabbed with knife, scalped with machete, very bloody.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0350050/"
}