{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William H. Macy",
            "url": "/name/nm0000513/"
        },
        {
            "@type": "Person",
            "name": "Tom Selleck",
            "url": "/name/nm0000633/"
        },
        {
            "@type": "Person",
            "name": "Monica Potter",
            "url": "/name/nm0005321/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 790,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019928/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107188/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094479/"
        },
        {
            "@type": "Person",
            "name": "Scott Turow",
            "url": "/name/nm0878017/"
        },
        {
            "@type": "Person",
            "name": "Alan Sharp",
            "url": "/name/nm0788991/"
        }
    ],
    "datePublished": "2004-05-23",
    "description": "A corporate lawyer's interest in a decade-old murder case is piqued by a new confession that could clear the convicted killer, who sits on death row.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Robe",
            "url": "/name/nm0730500/"
        }
    ],
    "duration": "PT2H53M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzOTc0OTIxNV5BMl5BanBnXkFtZTcwOTQ0NjYyMQ@@._V1_.jpg",
    "keywords": "based on novel",
    "name": "Reversible Errors",
    "original_info": {
        "id": "Reversible Errors_2004",
        "name": "Reversible Errors",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmNutgm"
        },
        "dateCreated": "2004-05-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0382944/"
        },
        "name": "More Huffman and Macy/Might have worked better as a 3 hr. movie",
        "reviewBody": "This movie deals not only with a heinous crime, but with the relationships of two different couples (Huffman/Macy and Potter/Selleck) and how those relationships intersect and impact the criminal investigation. I prefer Scott Turow's writing to John Grisham's--mainly because I feel Turow's writing has better character development and dialogue--and he seems better able to write believable female characters--but, he keeps you guessing as to whether the \"good guys\" are going to survive--much less win-- and that can be exhausting.\n\nOther people have done a fine job of delineating the plot. I can only add that I felt the movie suffered every time the Selleck/Potter storyline was the main focus. I felt that it just didn't have the emotional resonance of the other subplots. Since I have not read the novel--yet--I don't know if this is the script's fault or the actors'. I DO know that I didn't want the story re: the defense lawyer and the judge to end. The movie brightened every time that couple was on the screen. Was it because of better writing or better acting or because I enjoyed seeing a married couple play a couple--who can say? I also must say that I felt since a character's life was literally at stake that it would have been nice if his plight was explored more fully. Movies or books can be interesting without a romantic subplot.\n\nThis film might have been more effective as a three hour movie shown on one night rather than a miniseries spread over two nonconsecutive nights. There were so many plot twists that I lost track of some characters' actions and names from one night to another. It also didn't help that CBS showed upcoming scenes and trailers that spoiled one of the key twists. I have never understood why networks or studios will spend a fortune making a movie than spoil it by giving too much away in the advertising! Perhaps it will play better--and tighter--on video."
    },
    "url": "/title/tt0382944/"
}