{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Macaulay Culkin",
            "url": "/name/nm0000346/"
        },
        {
            "@type": "Person",
            "name": "Edward Herrmann",
            "url": "/name/nm0001346/"
        },
        {
            "@type": "Person",
            "name": "John Larroquette",
            "url": "/name/nm0488662/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 70803,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "alternateName": "Richie Rich",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019968/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022730/"
        },
        {
            "@type": "Person",
            "name": "Neil Tolkin",
            "url": "/name/nm0866063/"
        },
        {
            "@type": "Person",
            "name": "Tom S. Parker",
            "url": "/name/nm0662678/"
        },
        {
            "@type": "Person",
            "name": "Jim Jennewein",
            "url": "/name/nm0421084/"
        }
    ],
    "datePublished": "1994-12-21",
    "description": "A rich young boy finds his family the target of an inside job, and must use his cunning to save them.",
    "director": [
        {
            "@type": "Person",
            "name": "Donald Petrie",
            "url": "/name/nm0677953/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWRhMWEzMjMtYTFiYS00MTNlLWIxZTItNjEwZGQ1NDk3Y2NmXkEyXkFqcGdeQXVyODU4MjAxOQ@@._V1_.jpg",
    "keywords": "villain,head of security,mansion,gardening,eavesdropping",
    "name": "Ri¢hie Ri¢h",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Atreyu_II"
        },
        "dateCreated": "2009-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110989/"
        },
        "name": "1994: the beginning of the end and success of Macaulay Culkin's career",
        "reviewBody": "In 1994, Macaulay Culkin stared in 3 films: 'Richie Rich', 'The Pagemaster' and 'Getting even with dad', none of them particularly interesting. The movies themselves did poorly at cinemas and in critical terms.\n\nIn 1994, Macaulay Culkin was 13/14 years old. He was in his early adolescence, so he was growing. A difficult phase for him. Ridiculously, people began to ignore him because of that - either that or they simply thought his cuteness was disappearing and gave him little value for that. But he always proved to be a terrific actor. True, there were many, many great child actors but he was one of them for sure. Sure, his cuteness took him far, but it was his talent that made him a legend.\n\nAfter playing a completely different role in the 1993 film 'The Good Son' (where he played a psychopath that could very well disguise that nature thanks to his angelical looks, a wolf in sheep's clothe), he returned to the roles of 'good guys' in all of his 1994 films.\n\n'Richie Rich' is not much of a film, but perhaps it's a little more interesting than 'The Pagemaster'. It's not a bad movie, but it's a somewhat complex film for me to give a fair rating. It has good moments but also very stupid moments, particularly from the 2nd half on (in my opinion, where the movie is at its weakest).\n\nMacaulay Culkin plays the title character. Richie Rich is rich (like his name suggests), lives in a fancy mansion surrounded by comfort and luxury and can even count with a chauffeur that takes him in his majestic and elegant Rolls-Royce Silver Cloud whenever it's necessary. But Richie realizes that there is one thing that money can't buy: happiness. He feels the lack of friends and possibly bored with his tedious life. He just wants to be like the other kids.\n\nAbout the things I found funny in this film, a good example of that is the line «Oh my God, I look like Michael Jackson!» by Richie's mother. Come to think of it... that's not untrue - lol. I'm surprised they put this line in the film because Macaulay Culkin stars in it and considering the friendship he had with the eccentric singer... Other funny details are, for example, the cute dog that has dollar signs instead of spots and appropriately named Dollar, and the scene when Richie doesn't wanna wake up but stares at his personal trainer when he realizes what a beauty she is (she is portrayed by the supermodel Claudia Schiffer).\n\nMacaulay Culkin had everything to be a great name of the cinema. And he was, for a few years, mostly thanks to the success of the first two 'Home Alone' films. He was talented, charismatic and good-looking. Too bad he trashed his life later, but I believe he turned out to be like this because of his personal problems.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Warner Bros. Pictures",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi226754841",
        "name": "Richie Rich",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjQ2N2VhZTgtZWI1Yi00OTliLWIxZGYtY2NlMTE0Y2MwNTZlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjQ2N2VhZTgtZWI1Yi00OTliLWIxZGYtY2NlMTE0Y2MwNTZlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:53:18Z",
        "url": "https://www.imdb.com/video/vi226754841/"
    },
    "url": "/title/tt0110989/"
}