{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Don Dunphy",
            "url": "/name/nm0242988/"
        },
        {
            "@type": "Person",
            "name": "Benny Paret",
            "url": "/name/nm1784739/"
        },
        {
            "@type": "Person",
            "name": "Emile Griffith",
            "url": "/name/nm1787680/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 374,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "description": "A story of violence, love, sex, politics and media centered around the life of Griffith, a six-time world welterweight champion.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Berger",
            "url": "/name/nm1282481/"
        },
        {
            "@type": "Person",
            "name": "Dan Klores",
            "url": "/name/nm0460031/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Documentary",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODQ4NzQ0ODM2NF5BMl5BanBnXkFtZTcwODIxMjAzMQ@@._V1_.jpg",
    "keywords": "gay interest,gay athlete,boxer,accidental death",
    "name": "Ring of Fire: The Emile Griffith Story",
    "original_info": {
        "id": "Ring of Fire: The Emile Griffith Story_2005",
        "name": "Ring of Fire: The Emile Griffith Story",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dtucker86"
        },
        "dateCreated": "2005-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0436720/"
        },
        "name": "a great documentary",
        "reviewBody": "I am a Sergeant in the Army stationed in Korea and was unable to watch this amazing film when it premiered on TV. I think they had an inkling of just how amazing it would be because they showed it without commercials. This is a heart-wrenching story not only of boxing but of society as well and how we have changed over the years. The movie opens the fatal night of March 24, 1962 with Don Dunphy announcing the fight between Emile Griffith and Benny \"Kid\" Paret with the title at stake. The two had already fought twice splitting the victory between them. They were sort of the Ali-Frazier of the middleweight division. Paret had cruelly taunted his challenger before the fight calling him \"maricon\" (faggot). This was a shocking slur the press didn't even report at the time. Griffith had to be restrained from attacking him at the weigh in. This fight will always be one of boxing's most infamous because it was the first time a nationwide audience saw a man killed before their eyes. Ironically, even before this fight Griffith had not been known for being savage in the ring or a hard puncher. His record going into the fight was 28-3 with only 10 knockouts. However, in Round 13, he pinned Paret against the ropes and delivered the most savage beating you will ever see a boxer give another. In less then ten seconds he delivers over twenty devastating blows to the head. The referee did not stop the fight in time and Paret dies ten days later. There were so many far reaching aspects of this tragic night in 1962. Many hypocritical politicians called for the abolishment of boxing. It was years before fights were ever televised again. Referee Ruby Goldstein, who had had a distinguished career otherwise, never called another fight. However, the most devastating consequences that night were for poor Emile Griffith as this documentary makes painfully clear. Today, there is no big deal about a celebrity admitting their gay. It seems you cannot have a hit TV show, for example, without a character being gay. We put people like Ellen DeGeneres up on pedestals and make them icons of our culture. However, in the world of 1962, an admission of this was career suicide especially in the manly sport of boxing. How could a champion be gay? Griffith's personal life is his own business, but its heartbreaking watching this film and how the tragedy basically ruined this poor man. Griffith fought another fifteen years and became a six time champ. He was never the same fighter however. He fought another eighty bouts after March 24, 1962 but only scored twelve knockouts. He relied on his superb boxing ability rather then brute force to win. He admitted he was terrified of killing another. What shocked me is that champions of his era made nowhere near the outrageous purses of those today. Gil Clancy, his trainer, pointed out that it was common for even a champion to get only $50,000 for a fight. Like so many, Griffith stayed in boxing long after he should have retired. He lost twelve of his final twenty three fights. Today Griffith is a broken old man who requires full time care. He suffers from pugilistic dementia and also from nightmares still. I think the most touching moments of this film are the end where Paret's son embraces the weeping old champion and tells him he is forgiven."
    },
    "url": "/title/tt0436720/"
}