{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yukie Nakama",
            "url": "/name/nm0620090/"
        },
        {
            "@type": "Person",
            "name": "Seiichi Tanabe",
            "url": "/name/nm0848948/"
        },
        {
            "@type": "Person",
            "name": "Kumiko Asô",
            "url": "/name/nm0039591/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9463,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "Ring 0: Birthday",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0204463/"
        },
        {
            "@type": "Person",
            "name": "Hiroshi Takahashi",
            "url": "/name/nm0847126/"
        },
        {
            "@type": "Person",
            "name": "Kôji Suzuki",
            "url": "/name/nm0840626/"
        }
    ],
    "datePublished": "2000-01-22",
    "description": "In this prequel to Ring, a young Sadako becomes an actress in hopes of escaping her troubled past. But strange visions and terrifying powers begin to manifest...",
    "director": [
        {
            "@type": "Person",
            "name": "Norio Tsuruta",
            "url": "/name/nm0875468/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGJjM2FhMzktYmIwOS00MmNmLWJlOGMtMTQ0NTBlYjdiYzJjL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "supernatural power,theater,horror icon,haunted videotape,cursed videotape",
    "name": "Ringu 0: Bâsudei",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Gafke"
        },
        "dateCreated": "2004-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0235712/"
        },
        "name": "Powerful",
        "reviewBody": "In Ring O, which takes place 30 years before the events of Ringu, we are introduced to Sadako Yamamura, a painfully shy young girl who is literally torn in two by her mysterious heritage. Sadako, haunted by frightening visions of ghosts and bloody omens of the future, is a tense and silent girl with an ethereal beauty. She has found happiness in a local drama troupe, despite the fact that few of her fellow actors like her - Sadako is too quiet, a little creepy, and always seems to have something \"standing behind her\" - something that no one can quite see. The cast of an upcoming play all begin to have similar dreams in which an old house, a forest by the sea and a crumbling well all make an appearance. When the star of the play dies unexpectedly, and Sadako is given her role, suspicion mounts. Odd occurrences plague the set, a news reporter with a secret agenda begins to investigate Sadako and Sadako herself falls in love with a handsome sound engineer named Toyama, the only one who believes that Sadako is innocent. But if she is, then what is causing the poltergeist activity in the theater? What is the source of the strange, eerie sound that everyone can hear? And whose voice said \"You will die\" on a recording made at the time of a young woman's death? \n\nThis is a strong entry in the Ringu series, more of a psychological drama than anything else. Sadako, like Carrie White, is a girl with no self-esteem, wandering through the film in dumpy clothes with her hair in her face. She is truly a good, sweet girl who is simply pushed too far at last. There are some creepy moments scattered through the film featuring grainy dream sequences, stricken corpses and a very creepy shot of Sadako's insane mother during a flashback. There's also a great climax featuring Sadako as we all remember her - hair in her face and clad in a long white dress - literally jumping into view and then creeping up on her two victims in a scene that was clearly shot backwards and then run forwards, giving her movements a hideous jerkiness. Yukie Nakama is very good as Sadako, giving us a tragic heroine who is good and pure and possesses the power to heal the sick. Your sympathy will lie with Sadako, even as her dark past is revealed. The good Sadako suffers unbearably and you will suffer with her, right up to the chilling, but inevitable, ending. \n\nThis is a must see for Ring fans. Very highly recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In this prequel to Ring, a young Sadako becomes an actress in hopes of escaping her troubled past. But strange visions and terrifying powers begin to manifest...",
        "duration": "PT1M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3279471385",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODM5N2I1NGQtYjFmNC00ZTM5LWJhYzUtMDE3ZjZlNDQ2ZjFjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODM5N2I1NGQtYjFmNC00ZTM5LWJhYzUtMDE3ZjZlNDQ2ZjFjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-02-17T16:03:56.512Z",
        "url": "https://www.imdb.com/video/vi3279471385/"
    },
    "url": "/title/tt0235712/"
}