{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "A.J. Cook",
            "url": "/name/nm0176882/"
        },
        {
            "@type": "Person",
            "name": "Bruce Payne",
            "url": "/name/nm0668271/"
        },
        {
            "@type": "Person",
            "name": "Ryan Northcott",
            "url": "/name/nm0636092/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2935,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0078025/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104580/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0237368/"
        },
        {
            "@type": "Person",
            "name": "John A. Curtis",
            "url": "/name/nm0193394/"
        },
        {
            "@type": "Person",
            "name": "Evan Tylor",
            "url": "/name/nm0878953/"
        },
        {
            "@type": "Person",
            "name": "Pat Bermel",
            "url": "/name/nm0075894/"
        }
    ],
    "datePublished": "2002-01-29",
    "description": "A massacre survivor (A.J. Cook) studies serial killers under a famous expert (Bruce Payne), but her classmates soon start dying at the hands of a Jack the Ripper copycat.",
    "director": [
        {
            "@type": "Person",
            "name": "John Eyres",
            "url": "/name/nm0264242/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmFjNjFlMWItMGUxNC00ZDZmLWIzMTgtYzA2ZDQ4YmE2ZjQ4XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "character name as title,characters murdered one by one,nickname as title,teen slasher,supernatural horror",
    "name": "Ripper",
    "original_info": {
        "id": "Ripper: Letter from Hell_2001",
        "name": "Ripper: Letter from Hell",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chrichtonsworld"
        },
        "dateCreated": "2007-03-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0268579/"
        },
        "name": "Tries to be different from slasher movies but fails",
        "reviewBody": "When I saw the title and cover I was hoping that the movie would be like \"Ripper\" (videogame 1996 starring Christopher Walken). It was an excellent game that combined the old legend about Jack the Ripper with cyber technology. The result a \"killer\" thriller. But sadly I have to report that \"Ripper: Letter from Hell\" is nothing like that game. It is just a slasher movie with a very pretentious story. First of all there were some good moments. But overall I missed tension. The murders seem brutal and bloody, but the violence isn't explicit. Also a big problem is that the characters are not very likable. So you won't care for them if they die. The only exciting thing is wanting to find out who the killer is. When the characters have a dialog in one scene it somehow doesn't connect with what happened before the scene. I got the feeling that scenes were missing. This should not have been a problem if the the story was straightforward and clear. This is not the case. The story is confusing as hell. (Maybe that is why we would need a letter to explain things.) And if you were hoping for a decent climax than you will be disappointed. The way it is presented leaves room open for different interpretations. Normally I would love such an ending. Here it isn't very effective. The ending doesn't clear up motive for the killings. Also the connection between Jack the ripper and the killer is not explained very well. There is very little background given on the original Jack the Ripper murders. Assuming that you are not familiar with the murders committed by Jack the Ripper you could easily put some other famous serial killer in his place. The end result would be the same. Since good old Jack still makes quite the impression today he deserves much better treatment. I could have forgiven the pretentious ending if the movie would have been entertaining and exciting but as I said earlier the movie lacked tension and is quite boring. Jurgen Prochnow and Bruce Payne should be ashamed with their performances. It clearly shows that they don't believe in this project and only are in this movie for the money. You know I get it sometimes you have no choice but to be in certain films in order to make a living. But is it that too much too ask that once you are involved you can give it a little effort.\n\nI know that like me some of you will be intrigued because of the name Ripper but believe me that nothing remotely interesting has been done with it. A giant waste of your time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0268579/"
}