{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kim Basinger",
            "url": "/name/nm0000107/"
        },
        {
            "@type": "Person",
            "name": "Robert Board",
            "url": "/name/nm0090155/"
        },
        {
            "@type": "Person",
            "name": "Eduardo Cansino",
            "url": "/name/nm0134444/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 225,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Caren Roberts-Frenzel",
            "url": "/name/nm4265038/"
        },
        {
            "@type": "Person",
            "name": "Elaina Archer",
            "url": "/name/nm0033653/"
        }
    ],
    "datePublished": "2003-09-09",
    "description": "Biography of 1940's sex goddess Rita Hayworth. Born Margarita Cansino, she studied dancing from the age of 5 and was soon part of the family's night club act. By age 18 she was married and pursuing a movie career. She reached her ...",
    "director": [
        {
            "@type": "Person",
            "name": "Elaina Archer",
            "url": "/name/nm0033653/"
        }
    ],
    "duration": "PT59M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU0NzI0MjM2NV5BMl5BanBnXkFtZTcwNjI2ODUyMQ@@._V1_.jpg",
    "keywords": "character name as title,rita hayworth character,actress name as title,alzheimer's disease,f rated",
    "name": "Rita",
    "original_info": {
        "id": "Rita_2003",
        "name": "Rita",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2005-10-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0380673/"
        },
        "name": "Whatever you write about me, don't make it sad",
        "reviewBody": "Though the above summary comment was a request that Rita made of the press, the life of one of the world's most charismatic and glorious looking stars comes off as being just that - sad. For all the joy she gave the world and continues to give it, there should have been a lot more personal joy in the story of Rita Hayworth.\n\nThis is a wonderful documentary because it incorporates the memories of Rita's family as well as friends and coworkers. She was obviously a warm and loving person but probably someone who would have been content as a wife and mother. Certainly her children brought her great happiness. The biographical film emphasizes her attraction to manipulative, controlling men, attributing this to her being her father's dance partner and his dance student from a young age. Though not mentioned, it has been brought up elsewhere that Rita and her father often registered as husband and wife when they toured as dancers and shared a bed. If this is so, the root of her problems can be traced to this abusive relationship. Rita, however, remained a devoted daughter to both of her parents as well as a loving sister to her two brothers.\n\nShe was unable to have a happy marriage, though she certainly fell in love with both Orson Welles and Prince Aly Kahn before moving on to loser Dick Haymes, who almost cost her her children, and James Hill, who, like Haymes, was apparently abusive. Her first husband, Edward Judson, viewed her as an investment only, and according to publicist Henry Rogers, was furious when she had an affair with Anthony Quinn during the filming of \"Blood and Sand\" - not because she was having an affair, but because she was having an affair with someone who wasn't in a position to do anything for her career. The first signs of Alzheimer's began to show in the early '60s, and when she died in 1987, she was bedridden and knew no one.\n\nSo this is a great documentary if only to show that great beauty and talent do not confer a great life, and that what you see on the screen very often is real, honest-to-goodness acting. Because no doubt about it, through life's unhappiness, Rita Hayworth was a true goddess. With that face, voice, body, smile, hair, her magnificent and vivacious dancing, her charm, the sexiness she exuded as well as the vulnerability, she was a true angel who walked among us. She left the world greater for not only her screen presence, but for bringing to the fore a horrific disease. Quite a legacy. Quite a lady.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0380673/"
}