{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tommy the Clown",
            "url": "/name/nm1815469/"
        },
        {
            "@type": "Person",
            "name": "Larry Berry",
            "url": "/name/nm2286839/"
        },
        {
            "@type": "Person",
            "name": "Dragon",
            "url": "/name/nm1967578/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3295,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0151672/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0113400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0118656/"
        }
    ],
    "datePublished": "2005-06-24",
    "description": "Rize chronicles a dance movement that rises out of South Central Los Angeles with roots in clowning and street youth culture.",
    "director": [
        {
            "@type": "Person",
            "name": "David LaChapelle",
            "url": "/name/nm0479999/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDNkZWZiMjMtNTY0Ni00Yjg0LWFlNjctNTRhMTI3MTU5ZjE2XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "lionsgate,dance,south central los angeles,gang,clowning",
    "name": "Rize",
    "original_info": {
        "id": "Rize_2005",
        "name": "Rize",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "crazypoohbear69_050"
        },
        "dateCreated": "2005-07-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0436724/"
        },
        "name": "A Beautiful, yet underrated master piece!",
        "reviewBody": "When I saw the \"Rize\" trailers at first I was afraid that this would be yet another movie depicting the African-American experience through slanted and distorted filters ignorance and the media would have \"White America\" and the rest of the world believe. After a few minutes though I found that I couldn't have been more wrong. \n\n\"Rize\" is a wonderful piece of cinematic gold. It shows us what movies can really accomplish. It shows that what makes a movie \"good\" isn't a \"Big budget\" rehash of the same mindless drivel Hollywood has shoved down our throats for the past years. But a movie with substance.\n\nIf you have read the other reviews and summaries for this movie me telling you about the \"plot\" or \"characters\" is a waste of space. Also If you have read the other reviews you will see that quite a few people believe that \"Rize\" is just \"You got Served\" with face paint. People who have written this make me believe that they must have been watching a \"spoof\" on TV or watching commercials, and coming to there own conclusions. \n\n\"You got Served\" is to the African-American Dance culture as \"From Justin to Kelly\" is to musicals. YGS was a the same type of group vs. rival group with \"mild\" drama of a betrayal of a former member that was depicted in \"Bring it On\" or \"Good Burger\" and countless other films for the 12-17 age demographic. It was a film mostly for fans to get a last few glimpses of the former music group B2k and leader of the former group immature (or IMX) together for the last time (sort of like \"Spice World\"). In this since it served its purpose well. \n\nKnowing this you can see that it would be a \"closed minded\" and \"ignorant\" person to even link these two movies together. And my advice to those who choose to do so is: To actually see the movies you choose to harshly critique. You may even find that \"One of these movies is not like the other\" As one is a documentary and the other a \"teen flick\". Also I have noticed in reviews previous to mine that the movie \"Be cool\" is mentioned due to its brief \"cameo-esque\" snippet of the dance style. \"Be Cool\" was mentioned to be the first discovery of the dance style. This is simply not true, as ONE of the first showings of this dance style can be credited to Missy Elliot in her music video \"I'm really Hot\". \n\nAnother method of discrediting this movie is by attacking the director for just being \"Christina's music video director\" or a \"photographer\". Though I can honestly say that I am nor have ever been a fan of Christina Aguilera's work...I certainly do not hold this against Mr. La'Chappelle because unlike most respected and honored directors who turn a blind eye to movies like this because they aren't \"Oscar worthy\" he stepped in, and in his own artistic and beautiful way shuns the myths and stereotypes that have plagued the African-American people. (Especially young people residing in urban areas and ghettos for no fault of there own are labeled as \"thugs\" and \"gangsta's\" are now being known as \"Artists\" and \"Visionaries\" due to them turning back to their roots in Africa). \n\nI hope more movies will come out like this and liberate all races from their own stereotypes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Lionsgate",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2844786969",
        "name": "Rize",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDU3YWNhMjEtMTcyMS00MDY0LWEwZDMtZjE4ZTg4YzdmZDZmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDU3YWNhMjEtMTcyMS00MDY0LWEwZDMtZjE4ZTg4YzdmZDZmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:41:24Z",
        "url": "https://www.imdb.com/video/vi2844786969/"
    },
    "url": "/title/tt0436724/"
}