{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bing Crosby",
            "url": "/name/nm0001078/"
        },
        {
            "@type": "Person",
            "name": "Bob Hope",
            "url": "/name/nm0001362/"
        },
        {
            "@type": "Person",
            "name": "Dorothy Lamour",
            "url": "/name/nm0483787/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3883,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Don Hartman",
            "url": "/name/nm0366942/"
        },
        {
            "@type": "Person",
            "name": "Frank Butler",
            "url": "/name/nm0124918/"
        },
        {
            "@type": "Person",
            "name": "Harry Hervey",
            "url": "/name/nm0381152/"
        }
    ],
    "datePublished": "1940-03-22",
    "description": "Two playboys try to forget previous romances in Singapore - until they meet a beautiful dancer.",
    "director": [
        {
            "@type": "Person",
            "name": "Victor Schertzinger",
            "url": "/name/nm0006276/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTc4MTI2ZmMtZmQyMy00MDczLTlhOWQtZjZiZGRlYTYzMGZiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDQzMDg4Nzk@._V1_.jpg",
    "keywords": "ocean liner,lighting a pipe,sailor,playing patty cake,double exposure",
    "name": "Road to Singapore",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lugonian"
        },
        "dateCreated": "2010-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0032993/"
        },
        "name": "Bachelors in Paradise",
        "reviewBody": "ROAD TO SINGAPORE (Paramount, 1940), directed by Victor Schertzinger, marked the initial pairing of crooner Bing Crosby. and funny man, Bob Hope, in what was to become the first in a series of \"Road\" adventures revolving around a guy, a pal and a gal. With no sequels originally intended, its popularity truly relies most not on the slight screenplay by Don Hartman and Frank Butler nor the few comedy routines, but the fine chemistry brought out by its leading players, Crosby, Hope and Dorothy Lamour. \n\nThe story revolves around Josh Mallon (Bing Crosby, in a role suited for a much younger actor), a free-spirited young man whose serious-minded father (Charles Coburn) wants him to carry in the family business of his multi-million dollar establishment, Mallon Steamship Company, as well as to settle down and marry an heiress, Gloria Wycott (Judith Barrett). Josh very much prefers spending time bumming around with his boyhood pal, \"Ace\" Lannigan (Bob Hope), who enjoys having him around for laughs. Following a social function where Josh and Ace entertain the snobbish guests, soon developing into a fist fight riot. The boys break away from civilization by boarding a ship bound for Singapore where they live as carefree bachelors in a bungalow near the port of Kaigoon. While in a cabaret, Josh and Ace witness the gaucho dance performed by Cesar (Anthony Quinn) and Mima (Dorothy Lamour). Due to Mima's attention towards the young Americans, a fight ensues between them and the jealous Cesar leading to another riot. As the boys leave, they take Mima with them. As Mima takes the position as their housemaid, the boys resent her changing their carefree style with orders and keeping the bungalow neat and tidy. Eventually, they find themselves falling for her and do whatever pranks possible to get her to themselves. More problems arise when Papa Mallon and Gloria track down Josh to take him back with them to the states, much to the dismay of his friends.\n\nAs Bob Osborne, host of Turner Classic Movies, mentioned in his profile on the the making of the film in its January 28, 2010 presentation, SINGAPORE was initially scripted for George Burns and Gracie Allen, and revised for Fred MacMurray and Jack Oakie before the screenplay finally went to Crosby and Hope. Worked into the script were songs by Johnny Burke and Victor Schertzinger, including: \"Captain Custard\" (sung and performed by Bing Crosby and Bob Hope); \"The Moon and the Willow Tree\" (sung by Dorothy Lamour); \"Sweet Potato Piper\" (sung by Crosby, Lamour and Hope); \"Too Romantic\" (sung by Crosby and Lamour); \"Kaigoon\" (by James Monaco and Johnny Burke, sung by natives); and \"Too Romantic\" (sung by Crosby). \"Too Romantic\" is the love song theme, slow in tempo, suited for the style of Crosby and Lamour, while the lively \"Captain Custard\" number demonstrates how grown men can still get by acting like mischievous little boys clowning around, and making eyes and chasing pretty ladies in the process. As much as these guys are full of fun, their on screen party guests think otherwise. Look fast for TV character actress Elvira Allman as a homely woman. Other members in the cast include Pierre Watkin (Morgan Wycott); Gaylord Pendleton (Gordon Wycott); Johnny Arthur (Timothy WIllow); and Benny Inocencio (The Native Boy), \n\nAs fate would have it, this simple and innocent story proved far more success as anticipated, paving the way for a series of \"Road\" comedies by re-teaming Crosby, Hope and Lamour in different character portrayals, different locales but similar situations involving two guys and a gal. Unlike their ventures that lead to ZANZIBAR (1941), MOROCCO (1942), UTOPIA (1945), RIO (1947), BALI (1952) and HONG KONG (1962), this initial entry contained nothing to the hilarity of in-jokes, constant ad-libs by its principals, un-billed guest stars, subtitles and/ or talking animals. There are two instances where the script allows for wild comedy, one where the trio enact a medicine show that turns disastrous, with Jerry Colonna (the one with the mustache, loud voice and big rolling eyes) and as its prime victim; and another during the native festival where Bob and Bing dress up as natives in order to get some free food. SINGAPORE has rare distinctions where it provides some background to its two characters: Crosby as a millionaire's son whose happiest being away from responsibility; an Lamour the native girl who teams up with a dancer (Quinn) following the death of her parent. There's not much background pertaining to Hope's character except for being a sidekick who fails in specializing in medicine shows. He shows the sentimental side to his nature in one somber moment between him and Lamour, quite unusual for a Hope comedy. The major ingredient SINGAPORE has that would be used in most subsequent films is Hope and Crosby's \"paddy cake\" routine, and of course Lamour enacting as their straight woman. \n\nDuring its cable TV era, SINGAPORE was shown on American Movie Classics (1992-2000) before traveling over to Turner Classic Movies where it made its debut August 3, 2004. TCM also has in its library a 1931 Warners drama bearing the same title starring William Powell but that ROAD TO SINGAPORE bears no resemblance to this edition. Over the years MCA Home video distributed it to home video in the 1990s before shifting this and the series to DVD. Regardless of being the lesser item in the series, ROAD TO SINGAPORE, which will never have the distinction of becoming part of American Film Institutes \"100 Greatest Comedies\" as ROAD TO MOROCCO (1942) did, but is one relatively known as the movie that started it all with Crosby, Hope and Lamour and their journey to adventure into comedy, music and romance. (***)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Two playboys try to forget previous romances in Singapore - until they meet a beautiful dancer.",
        "duration": "PT2M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3956195609",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDBiZWFmMDQtMjAzYy00ZGJjLWJiZDYtMmU4YTRlYTdiZmMyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDBiZWFmMDQtMjAzYy00ZGJjLWJiZDYtMmU4YTRlYTdiZmMyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-23T12:41:59.428Z",
        "url": "https://www.imdb.com/video/vi3956195609/"
    },
    "url": "/title/tt0032993/"
}