{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Page Fletcher",
            "url": "/name/nm0282088/"
        },
        {
            "@type": "Person",
            "name": "Maurice Dean Wint",
            "url": "/name/nm0935659/"
        },
        {
            "@type": "Person",
            "name": "Maria del Mar",
            "url": "/name/nm0544691/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2673,
        "ratingValue": 4.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042038/"
        }
    ],
    "datePublished": "2001-07-16",
    "description": "Thirteen years after the original Robocop, Delta City, considered to be \"The Safest Place On Earth!\", has become a futuristic city owned and operated by OCP, and RoboCop, Alex Murphy has begun to feel his age. Murphy finds himself...",
    "genre": [
        "Action",
        "Crime",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg2MDkwOTEwMl5BMl5BanBnXkFtZTcwNDA3NzcyMQ@@._V1_.jpg",
    "keywords": "superhero,robocop character,superhero action,superhero sci fi,robocop",
    "name": "RoboCop: Prime Directives",
    "original_info": {
        "id": "RoboCop: Dark Justice_2000",
        "name": "RoboCop: Dark Justice",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "robocop4"
        },
        "dateCreated": "2001-05-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0220008/"
        },
        "name": "Prime Dissatisfactions",
        "reviewBody": "On the first two RoboCop feature films, the producers hired renowned mime artist and choreographer Moni Yakim to help Peter Weller, who played the title role in those pictures, get a handle on the role's intense physicality, and the investment paid off handsomely. On \"Prime Directives,\" however, apparently such expenditures were deemed superfluous and eliminated from the budget. Yet, considering that RoboCop is the miniseries' main character, the character needing to be lavished with the most attention--especially with regard to issues of movement and ambulation, so as to ensure precise execution and verisimilitude--such an oversight on director Julian Grant's part is simply beyond the pale. The sad result: Page Fletcher, who plays RoboCop in \"PD,\" spends most of his time stumbling and bumbling about in the RoboSuit, fists eternally and inexplicably clenched, wildly swinging his arms to and fro in a bizarre echo of Rock'em Sock'em Robots, and walking as if there were a warm, freshly laid dump permanently ensconced in his RoboDrawers.\n\nTo add insult to injury, RoboCop's makeup FX in \"PD\" really leave something to be desired. They are so bad, in fact, that the RoboHelmet-less Fletcher looks like Mandy Patinkin from \"Alien Nation,\" replete with what appears to be a shopworn Tupperware bowl spray-painted a drab gray and hastily slapped onto the back of Fletcher's ridiculously enlarged noggin. What's worse, as the miniseries goes on, Fletcher's RoboSuit seems to fit him less and less snugly. At one point, when RoboCop visits his own gravesite, the suit's chin-guard seems to be floating independently from the rest of the RoboHelmet, careening away from Fletcher's jaw by several maddening inches.\n\nFurthermore, those who are familiar with Julian Grant's decidedly unimpressive B-movie oeuvre (most especially the utterly dreadful direct-to-video \"Airborne\") know all too well his pronounced limitations as an action filmmaker. Grant fancies himself an ace action director, in the mold of George (\"Mad Max\") Miller and James (\"The Terminator\") Cameron. However, unlike those esteemed cinematic kineticists, Grant has absolutely no sense of timing or geography when it comes to arranging action set pieces. To be perfectly candid, his \"style,\" as it were, is actually more in line with that of an unadorned hack like Roger (\"Battlefield Earth\") Christian. Grant's action scenes go on and on and on, in a way that oscillates between being boringly redundant and spatially confusing. Grant will repeat the same information time and again, such as having a procession of nameless, faceless bad guys meet repetitive, cookie-cutter deaths at the hands (or rather guns) of the good guys, and all the while within settings where it's difficult to tell where the bad guys are positioned at and/or coming from with respect to the good guys.\n\nThe verdict: 2 out of 4 stars.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2139357465",
        "name": "Robocop:Prime Directives",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTBlZGFmZDctNjM0YS00MzQ3LWIyNDgtNGFiZTgzNTU4ZjYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTBlZGFmZDctNjM0YS00MzQ3LWIyNDgtNGFiZTgzNTU4ZjYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:54:16Z",
        "url": "https://www.imdb.com/video/vi2139357465/"
    },
    "url": "/title/tt0220008/"
}