{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Ray",
            "url": "/name/nm0712830/"
        },
        {
            "@type": "Person",
            "name": "Rockets Redglare",
            "url": "/name/nm0714871/"
        },
        {
            "@type": "Person",
            "name": "Willem Dafoe",
            "url": "/name/nm0000353/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 83,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024627/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090416/"
        }
    ],
    "datePublished": "2004-09-03",
    "description": "Documentary on Rockets Redglare (aka Michael Morra), a colorful figure on the New York City art scene up until his death in 2001. In his life, Redglare was the bodyguard/drug dealer to Sid Vicious and Jean Michel Basquiat, a stand...",
    "director": [
        {
            "@type": "Person",
            "name": "Luis Fernandez de la Reguera",
            "url": "/name/nm1350325/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjMwZmM2NTItYWFhNS00YmJhLTlmODktNTg4MTMyNzQwZDYwXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "new york city,death,interview,actor,tragic event",
    "name": "Rockets Redglare!",
    "original_info": {
        "id": "Rockets Redglare_2004",
        "name": "Rockets Redglare",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "theLunchMovie"
        },
        "dateCreated": "2003-08-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0348866/"
        },
        "name": "a fascinating face in the crowd",
        "reviewBody": "Rockets Redglare was one of that legion of faces you recognize from movies without ever knowing his name or anything about him. I first took notice of him after \"Talk Radio\" -- a name like Rockets Redglare stood out from the credits.\n\nWhat the film \"Rockets Redglare!\" reveals about the man Rockets Redglare is that he led a life more traumatic, more sad, and -- amazingly enough -- funnier, than most of the movies he appeared in. He was a dyed-in-the-wool New Yorker who grew up in the 50's and 60's among hustlers and thieves. Rockets tells the camera some jaw-dropping stories about that world and how it contributed to his own addictions and compulsions.\n\nHis ability to get laughs out of his stories led him to become the black sheep of an extended family of artists and performers in the East Village in the early 80's. Members of that extended family appear here to tell you how they loved Rockets and how they never lost hope that he could \"get it together.\"\n\n\"Rockets Redglare!\" mixes home movies and photos of Rockets' past, clips from his film career and interviews taken with he and his circle in the last few years of his life. The result is multi-faceted -- a biography of a charismatic and unusual man, a document of a period in New York cultural history, a cautionary tale of excess.\n\nThe only possible flaw with this movie was that I wanted more of it. You are left wanting to hear more of his stories. This may not be a flaw, but the highest compliment for a documentary -- in 90 minutes it took me from knowing nothing to wanting to know everything about Rockets and his world.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0348866/"
}