{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        },
        {
            "@type": "Person",
            "name": "Talia Shire",
            "url": "/name/nm0001735/"
        },
        {
            "@type": "Person",
            "name": "Burt Young",
            "url": "/name/nm0949350/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 218276,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054262/"
        },
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        }
    ],
    "datePublished": "1979-06-15",
    "description": "Rocky struggles in family life after his bout with Apollo Creed, while the embarrassed champ insistently goads him to accept a challenge for a rematch.",
    "director": [
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjk2Y2FiYWEtNGViNy00ZDNkLThhZGItMDI5YjQ5NGYxYWJmXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "boxing,fist,boxer,sweaty man,muscular",
    "name": "Rocky II",
    "original_info": {
        "id": "Rocky II_1979",
        "name": "Rocky II",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kezop_male"
        },
        "dateCreated": "2005-10-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079817/"
        },
        "name": "Same Story, Both Continued AND Re-told",
        "reviewBody": "I'm old enough to remember the thrill of seeing each of the \"Rocky\" films during their original, theatrical runs. The magical component that Stallone achieved was to tell nearly the exact same story, twice in a row, with the same characters... and yet, he gives us a one-two punch that hits just solidly as the first.\n\nIt's truly a remarkable feat. Differences? We've already met all the characters. Gone is the sense of discovery, the sense of learning who these people are. We already know, don't we? Yet, Stallone's characters are sufficiently interesting enough for us to want to spend more time with them, seeing them in a world most of us don't know, living a life few of us would really want. While the sense of discovery about these characters is gone, our joy of being a voyeur into their world is not.\n\nIt's a toss up which movie, \"Rocky\" or \"Rocky II,\" asks us to suspend disbelief more. In \"Rocky,\" we have to accept that a nobody, unrated, club fighter could a) get the chance to fight the world champion. B) He could possibly defy all odds and go the distance. That's a huge stretch only possible in Hollywood movies, classifying the first movie as a fairy tale along the lines of Cinderella.\n\nSoap opera-esquire is not a bad way to characterize \"Rocky II\" because of the emotional ride, but I don't find it as trite as a soap opera. Rocky's actions are very believable, from his earnings feeling like a fortune to him (when they were obviously not), to his illiteracy and his unsophisticated, \"punch drunk\" boxer. The ramifications of his past are believable. He fritters away the money and is unable to capitalize on his 15 minutes of fame. Hey, it happens all the time. Very believable.\n\nWith a pregnant wife, no job, and no way to pay his bills, he's backed into a corner. What's a fighter to do? (And in this case, I mean \"a fighter\" in its most literal sense.) He's willing to risk his health and even his marriage to do what any man should do: provide for his family.\n\nAdrian's bit of drama is the single \"problem\" with the movie, but it's also the heart of the movie. It's not a movie about losing it all and coming back again, it's much more than that. It's about a simple man who's trying to do the best he can with the only tools he has. And when Adrian is first to go down for the count, it puts it all in jeopardy.\n\nIt's not until his wife is ready to accept him as he is, for what he is, that he can continue his quest, one more fight, for his family, for himself.\n\nThe story arc feels so similar to the first movie that this one is often tossed to the side, yet it truly is amazing how Stallone managed to re-imagine all the magic of the first movie and, better still, give us a second helping of it that's just as sweet. Enjoy!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Rocky II",
        "duration": "PT2M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2087782169",
        "name": "Rocky II",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDI5MjQ4YmEtMGVhNC00ZTYxLWEzNTctN2YzNTJiODg1OGY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDI5MjQ4YmEtMGVhNC00ZTYxLWEzNTctN2YzNTJiODg1OGY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:47:57Z",
        "url": "https://www.imdb.com/video/vi2087782169/"
    },
    "url": "/title/tt0079817/"
}