{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        },
        {
            "@type": "Person",
            "name": "Talia Shire",
            "url": "/name/nm0001735/"
        },
        {
            "@type": "Person",
            "name": "Burt Young",
            "url": "/name/nm0949350/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 592250,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054262/"
        },
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        }
    ],
    "datePublished": "1976-12-03",
    "description": "A small-time Philadelphia boxer gets a supremely rare chance to fight the world heavyweight champion in a bout in which he strives to go the distance for his self-respect.",
    "director": [
        {
            "@type": "Person",
            "name": "John G. Avildsen",
            "url": "/name/nm0000814/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTBkMjg2MjYtYTZjOS00ODQ0LTg0MDEtM2FiNmJmOGU1NGEwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "fist,rocky balboa character,low budget film,smash hit,boxer",
    "name": "Rocky",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheSixthChild"
        },
        "dateCreated": "2003-12-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075148/"
        },
        "name": "His whole life was a million-to-one shot...",
        "reviewBody": "When I was a kid there were only three major things in my life: food, wrestling and `Rocky'. My brother and I followed the numerous Rocky Balboa struggles religiously, and even today, there is no exception. Although the latest efforts of Stallone have been pitiful, the movie that made his career is the 1977 Academy Award Winner for Best Picture, `Rocky'. On top of that, `Rocky' also earned two more Academy Awards for Best Film-Editing and Best Director (John G. Avildsen).\n\nThis movie is unlike any other ever put on film. It's films like this that remind us of the beauty that is going to the cinema, and if only I was around during that year when such films as `Close Encounters of the Third Kind', `Jaws', `Saturday Night Fever' and `Network' were all playing in cinemas. The storyline takes place in Philadelphia, where Rocky Balboa (Sylvester Stallone) struggles to make a living as both a small-time boxer, and the brawn of a loan shark. Until one day, a sudden opportunity is handed to Rocky to compete for the World Heavy-Weight Title against the champion, Apollo Creed (Carl Weathers), a charismatic and flamboyant fighter labelled as `The King of Sting' and `The Master Of Disaster'. Attracted to Rocky's reputation as \"The Italian Stallion\", a match between Creed and the unknown boxer is set, which is subsequently advertised as a fight where a \"nobody\" can become a \"somebody\". Mickey (Burgess Meredith), is the owner of the gym where Rocky trains and later becomes Rocky's manager. Mickey is passionate about the world of boxing, and believes that Rocky has the potential to go the distance, instead of being `a cheap second rate loan-shark'. However, the central character in Rocky's life is Adrian (Talia Shire), a shy pet-store clerk, who acts awkwardly when Rocky even breathes in her direction. However, these almost completely distant outcasts are strangely drawn to each other. While one `didn't have much of a brain', the other `didn't have much of a body', so they worked on their opposites, only to end up together. The legend of this film when it was first released in the mid-70's was: `His whole life was a-million-to-one shot', but what Stallone did was prove to the world that `Rocky' is one-in-a-million.\n\nSeeing `Rocky' is both a cinematic experience and a religious experience. When first released, the film appealed to the widest audience, and all felt the emotion and intense passion which passed from the film, to them. The film's possession of realistic acting, superb dialogue and the most phenomenal music score by Bill Conti to date, indeed transformed the face of cinema. Stallone's wholesome performance of his own screenplay is electrifying as the film celebrates of the underdog battling to beat the odds. Fans of cinema aren't manipulated into thinking that the inevitable will happen as it does in every other tedious hero drama.\n\nOver 25 years on, `Rocky' still manages to let the audience's emotions explode; Rocky's blossoming relationship with Adrian, the seedy worlds of Mickey and Adrian's alcoholic brother, Paulie (Burt Young), and the affirmation of Rocky's inability to overcome Creed. And who could forget the excruciatingly compelling Balboa / Creed confrontation? Rocky's determination overturns the boxing fraternity, and supplies cinemaphiles with one of the greatest moments in cinematic history, as a body of spectators both on-screen and off applaud and chant for Rocky in unison. The following four Rocky sequels attempted to deliver the same magic as the original, however failed to convey it's message. `Rocky' illustrates how life itself is stifling and perplexing, but sometimes when you lose your way as well as your original intentions, you may just find something better.\n\nSimply put, if anyone has a free Friday / Saturday night, this is the film to go out and borrow from the local video store. It's unbelievable that this film was only voted in at #78 on the AFI Top 100 films of all time, and worse yet, was voted in at the SECOND best sports film of all time (the first went to `Hoosiers', starring Gene Hackman). C'mon people, be you black or white or brown or any other skin colour we have yet to discover, get out there and be inspired by Stallone's masterpiece, `Rocky'.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A small-time Philadelphia boxer gets a supremely rare chance to fight the world heavyweight champion in a bout in which he strives to go the distance for his self-respect.",
        "duration": "PT3M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1537524249",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzQ2M2E5NWEtOWQyZC00OWExLTkxOTgtMjVmOTAxM2Q3Njg4XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzQ2M2E5NWEtOWQyZC00OWExLTkxOTgtMjVmOTAxM2Q3Njg4XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-04-14T03:45:08.880Z",
        "url": "https://www.imdb.com/video/vi1537524249/"
    },
    "url": "/title/tt0075148/"
}