{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        },
        {
            "@type": "Person",
            "name": "Talia Shire",
            "url": "/name/nm0001735/"
        },
        {
            "@type": "Person",
            "name": "Burt Young",
            "url": "/name/nm0949350/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 142862,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026841/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054262/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150401/"
        },
        {
            "@type": "Person",
            "name": "Sylvester Stallone",
            "url": "/name/nm0000230/"
        }
    ],
    "datePublished": "1990-11-16",
    "description": "Reluctantly retired from fighting, Rocky takes charge of Mickey's gym and agrees to train a young protégé who's hungry for success.",
    "director": [
        {
            "@type": "Person",
            "name": "John G. Avildsen",
            "url": "/name/nm0000814/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM2Mzc4MTYxM15BMl5BanBnXkFtZTcwODY5NTk1NA@@._V1_.jpg",
    "keywords": "boxer,fighting movie,gym,muscleman,strongman",
    "name": "Rocky V",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Old Joe"
        },
        "dateCreated": "2002-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100507/"
        },
        "name": "He is going back to where it all began. When you're down and out, the best shot is, simply, to  Go for it!",
        "reviewBody": "When a doctor or a family member tells you that the only life you have ever know is over, that can be a pretty bitter pill too swallow. In Rocky V, Rocky Balboa is faced with such a scenario. This movie proves to me that you need to have more than one string to your arrow, as you never know when it might come in handy one day. Rocky V also points out that money and possession are not the important things in life, but family and (true) friends are!\n\nLosing it all does not mean a thing unless you've got something to lose And Rocky Balboa had it all. Times have changed, though, for former Heavyweight champion of the world. A lifetime of fighting has taken its toll, mentally and physically, and the maneuverings of an scrupulous accountant have left him financially strapped. But resiliency and the ability to come back have been trademarks of the Rocky legend. Just when it looks like the champ is down for the count, he discovers the raw talent of a young fighter named Tommy Gunn, who just might be Rocky's last chance for glory. In a world where achievement is marked by dollars and cents, and in a profession where success is measured in wins and losses, Rocky Balboa knows that, whatever the struggle, your only hope is to give it your best shot.\n\n This film is probably the weakest of the five films in the Rocky series. Yet there are some very good parts to it. The way we see Rocky get over bankruptcy was very good, as is the way he eventually makes his family the most important thing in his life. Again I found this story to be good, though I guess it lacked that real Rocky feel to it, mainly because the champ was unwilling or unable to get into the ring. Stallone has done a grand job in being the writer of all the Rocky films. \n\nThe cast make a final appearance, that is reasonably good. Stallone is good as Rocky once again. His character is still trying to make a contribution to fighting, after being told that he can no longer professionally fight in the ring. So he helps out fresh talent, Tommy Machine' Gunn, who is acted by real life boxer Tommy Morrison. I found this character to be just far to arrogant and stubborn, which in a way did not suit being a part of the Balboa corner. Tommy has had an interesting life, not only fighting wise, but in a personal way. He has been caught in drug rackets, drink driving and admitted to the world that he has contracted the fatal HIV virus. I am not so sure he is the greatest of actors though.\n\nThe normal cast members were good. Talia Shire's character Adrian, lets the world know that her husband is finished boxing and has nothing else to prove in the boxing ring. Making a special appearance was star from the first three films, that of Burgess Meredith. Just seeing him onscreen was really satisfying. Mickey was a favourite character of mine. I must mention that I liked seeing Stallone's very own son Sage, in Rocky as Rocky's son, Rocky Jnr. He was pretty good as the son that felt left out in the cold. He also has a mean punch like the old man as well. \n\nI found that all the Rocky films had terrific soundtracks. This is due to the great work by composer, Bill Conti. Bill has done a wonderful job in organising the music to go with all the fighting scenes and the poignant scenes which require that tune to set them off just nicely. Rocky five had probably the best song on any of the soundtracks, that being the Elton John hit Measure of a man'. I think it is a wonderful song, with some terrific lyrics. I have loved most of the music that the Rocky movies have given us.\n\nRocky V might not be the best movie ever made, but it certainly had some sort of impact on me. I believe if a movie only makes a slight impression on you, then it has achieved in a small way what it was meant to do. I heard that plans for Rocky VI were being made, with a script finished by Stallone just a few years ago. Personally, I feel that if it was to be made it would not be that great a film, because Balboa can no longer make a comeback in the ring, and if he does, he could well become as his wife said disabled'. All things being said, these films are a terrific avenue of motivation and can help any person get the spark back to turn their luck around in any venture they pursue.\n\nRating 3 Stars or 6.5/10"
    },
    "url": "/title/tt0100507/"
}