{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Caroline Ducey",
            "url": "/name/nm0239764/"
        },
        {
            "@type": "Person",
            "name": "Sagamore Stévenin",
            "url": "/name/nm0836683/"
        },
        {
            "@type": "Person",
            "name": "François Berléand",
            "url": "/name/nm0075710/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11266,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008182/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0020756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063732/"
        },
        {
            "@type": "Person",
            "name": "Catherine Breillat",
            "url": "/name/nm0106924/"
        }
    ],
    "datePublished": "1999-04-14",
    "description": "Frustrated by the lack of intimacy in her relationship, a young schoolteacher goes through a series of intimidating and often violent sexual partners.",
    "director": [
        {
            "@type": "Person",
            "name": "Catherine Breillat",
            "url": "/name/nm0106924/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGViMmNjMGEtMjUwMC00ZjNkLWE4YTItN2RmOWQyNTQ1OWU2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "ejaculation,female full frontal nudity,semen,masturbation,bondage",
    "name": "Romance",
    "original_info": {
        "id": "Romance_1999",
        "name": "Romance",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2009-08-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0194314/"
        },
        "name": "at best a few curious intellectualized moments and some (appropriately) uncomfortable real sex. the rest...",
        "reviewBody": "Someone hit the proverbial nail-on-the-head with Romance. A critic wrote that it's like a \"bad update of an Antonioni film\", and I think that's about as fair a description as one could ask for. It may also depend on how you feel already about Antonioni and his depiction of the precise lack of love or responsiveness of emotional contact in people - or, perhaps, if you've even actually seen an Antonioni movie. While Catherine Breillat probably (and, I would admit, rightfully) considers herself a thoughtful, passionate filmmaker interested in passionless people and in trying to pick apart the thoughts (or anti-thoughts) of a character like Marie, I have to ask after a while, in a film that doesn't have Antonioni-stature direction or compositions: what's the point? We have seen women like this in other movies, in loveless relationships or going out to spread or fulfill their empty wishes or such with others. Such as, yeah, Antonioni, but others too.\n\nIt's frustrating to watch, to say the least, but I wasn't ready at first to hold that against the movie. I wanted to see what it had to say, to see how Breillat would show people just having realistic sex, explicit in depiction (naturally, and believe you me its real sex) and talking like couples (or not-couples) do in such situations. I tried to stick with Marie's self-analyzing, her self-aggrandizing thoughts expressed in the first-person narration. In an odd way Caroline Ducey gives a good performance, or better than I remember at the time watching it, since she is good enough to not really need the narration to fill in the audience. Her face, her lack of expression, her inverted and bored and, perhaps, deep down f***ing scared self, show enough. The telling becomes overkill, even from a psychological stand-point.\n\nSome may not agree with this, and that's fine. Some may watch Romance and just love that it shows real people having problems and having such problems during real sex. For the first half I could stick with the movie even as it had its pretensions because I wanted to see where it headed with Marie's infidelity (with the unnecessary lie about being married). It's when the other guy at the school Marie teaches at, and takes her in and turns things up on the sado-masochist meter that I started to waver on it... and, odder still, got bored. It didn't interest me seeing how perverted this guy could get, or how accepting Marie was of it or how it was shot or scored or edited. I admired that it attempted at depicting such a torrid sexual situation so seriously, but it ultimately just didn't do it for me - not on the kind of level the old-school hardcore-serious-erotic films did (i.e. Last Tango in Paris).\n\nRomance is intelligent, and it does have something to say about women and loveless relationships. But was I moved by any of it or intellectually engaged after a certain point? No. It's a movie in a limbo where it wants to have something important to convey through art no matter what the cost, but the points aren't as interesting as its filmmaker thinks or terribly original. And if you just want to watch it for the sex, you're in for a not-too-good surprise. 5.5/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Romance",
        "duration": "PT1M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2827223321",
        "name": "Romance",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGU2MmMyMzctODEzYi00MDQxLTkzYjUtNDQ4MjNhMjZjOGQxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGU2MmMyMzctODEzYi00MDQxLTkzYjUtNDQ4MjNhMjZjOGQxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:55:13Z",
        "url": "https://www.imdb.com/video/vi2827223321/"
    },
    "url": "/title/tt0194314/"
}