{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Laurence Harvey",
            "url": "/name/nm0002131/"
        },
        {
            "@type": "Person",
            "name": "Simone Signoret",
            "url": "/name/nm0797531/"
        },
        {
            "@type": "Person",
            "name": "Heather Sears",
            "url": "/name/nm0780765/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6686,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103121/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065340/"
        },
        {
            "@type": "Person",
            "name": "Neil Paterson",
            "url": "/name/nm0665513/"
        },
        {
            "@type": "Person",
            "name": "John Braine",
            "url": "/name/nm0104050/"
        },
        {
            "@type": "Person",
            "name": "Mordecai Richler",
            "url": "/name/nm0725006/"
        }
    ],
    "datePublished": "1959-01-22",
    "description": "An ambitious young accountant plots to wed a wealthy factory owner's daughter despite falling in love with a married older woman.",
    "director": [
        {
            "@type": "Person",
            "name": "Jack Clayton",
            "url": "/name/nm0002338/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzQ3NDNkZTMtYzJlMC00MzRjLTk5ZGEtYzI2OTZmNTQ4NmUzXkEyXkFqcGdeQXVyMTAwMjAxOTU@._V1_.jpg",
    "keywords": "angry young man,infidelity,extramarital affair,cheating on girlfriend,class differences",
    "name": "Room at the Top",
    "original_info": {
        "id": "Room at the Top_1959",
        "name": "Room at the Top",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2009-01-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053226/"
        },
        "name": "What Price Success, What Price Class",
        "reviewBody": "Room At The Top filmed in 1959 takes place some ten years earlier in post war Great Britain as veteran Laurence Harvey takes it in his mind to rise from his lower class origins by any means possible. He's a devilishly attractive fellow and if that's what it takes to do it, than so be it. Not like it hasn't been done before on either side of the pond.\n\nHarvey's got no family so to speak, his parents were killed in his small town when a German bomb hit their house. He's rootless now and has a crying need to belong somewhere.\n\nThe similarities in character to novelist John Braine's Joe Lampton and Theodore Dreiser's George Eastman are too obvious to overlook. However unlike Eastman, Lampton as played by Harvey is courting two very different kinds of women. Boss Donald Wolfit's daughter Heather Sears is a young and somewhat inexperienced young lady who's easy prey for Harvey. Wolfit and his wife Ambrosine Phillpotts see what's happening with their daughter, but can't ultimately do anything.\n\nBut while they're trying Harvey falls in with the unhappily married Simone Signoret. She's married to Allan Cuthbertson who's a cheating dog himself. She's got a lot of passion left in her and even though Harvey's ten years younger, she knows how to show him one real good time. Being French she has a different moral view of things than the folks of her adopted country and she thinks Harvey does as well. He does, but Harvey has his priorities.\n\nRoom At The Top was something that still couldn't be made in America because of the Code, but at least it was shown here. What Makes Sammy Run, a work by Budd Schulberg never had a big screen adaption and it had similar themes to Room At The Top, Still it got great critical acclaim and two Academy Awards and other nominations.\n\nSimone Signoret got one of those Oscars, for Best Actress in 1959. It's a very subtle part she undertakes, in fact she's not the main character, Harvey is. Still when she's on the screen even Harvey's flashier character of Joe Lampton takes a back seat. Signoret is just fabulous as the older and still attractive woman, trapped in a loveless marriage will touch you dearly. She's one of the most beautiful and tragic figures ever done on screen.\n\nHarvey was up for Best Actor, but he and the film itself were running in the year of Ben-Hur. He and the picture itself lost to Charlton Heston and the noble character he created on screen. Hermione Baddely who had a role similar to Thelma Ritter's in All About Eve was up for Best Supporting Actress, but she lost to Shelley Winters for The Diary Of Anne Frank.\n\nRoom At The Top with its brutally frank talk of sex mixed with ambition has become a classic and Joe Lampton became Laurence Harvey's signature role. Two sequels with Joe Lampton, Life At The Top and Man At the Top, were spawned from the original, the latter with Lampton played by Kenneth Haigh as Harvey had died by then. It's an enduring classic of the British, nay the English language cinema and should not be missed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Room at the Top",
        "duration": "PT2M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2121336601",
        "name": "Room At The Top",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmM1MDYxNDUtMmRmMC00NmY5LTgwMGItNjI3MmE2YThmNmQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmM1MDYxNDUtMmRmMC00NmY5LTgwMGItNjI3MmE2YThmNmQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:48:05Z",
        "url": "https://www.imdb.com/video/vi2121336601/"
    },
    "url": "/title/tt0053226/"
}