{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mia Farrow",
            "url": "/name/nm0001201/"
        },
        {
            "@type": "Person",
            "name": "John Cassavetes",
            "url": "/name/nm0001023/"
        },
        {
            "@type": "Person",
            "name": "Ruth Gordon",
            "url": "/name/nm0002106/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 221867,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0142268/"
        },
        {
            "@type": "Person",
            "name": "Ira Levin",
            "url": "/name/nm0505615/"
        },
        {
            "@type": "Person",
            "name": "Roman Polanski",
            "url": "/name/nm0000591/"
        }
    ],
    "datePublished": "1968-06-12",
    "description": "A young couple trying for a baby moves into an aging, ornate apartment building on Central Park West, where they find themselves surrounded by peculiar neighbors.",
    "director": [
        {
            "@type": "Person",
            "name": "Roman Polanski",
            "url": "/name/nm0000591/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA5NWQwMmYtZjEyYS00Nzc2LTgwZjAtNTQ4NmFmZjNkNjg4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "paranoia,rape,coven,satanism,problem pregnancy",
    "name": "Rosemary's Baby",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Spleen"
        },
        "dateCreated": "2001-04-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063522/"
        },
        "name": "Reassuring to fine it's every bit as good as its staunchest champions would have you believe",
        "reviewBody": "Why aren't the horror directors of today as careful with their scripts as Polanski was? Not that this is really horror. Horror as we know it came into being with the slasher flicks of the late 1970s and early 1980s; \"Rosemary's Baby\" is rather the kind of thing that the term \"dark fantasy\" was coined to describe, by people of taste who noticed that the word \"horror\" promised audiences something distinctly unpleasant and nasty.\n\nThe film's construction is marvellous. Things start slow - one beat, so to speak, to a bar - and gradually pick up speed so that by the end we are nervously tapping out semiquavers with our feet. Polanski also understands the gentle art of hint-dropping. Many events are filed away as tiny puzzles to be solved later, and they ARE solved later; others we don't attach any particular significance to at the time Polanski invites us to re-interpret in retrospect, AND chooses the right moment to let us do so. And then, at the end, AFTER we've worked everything out, he presents us with a surprise - a delightful, gratuitous twist which nothing had prepared us for, which we couldn't have guessed, yet which doesn't cancel out the story as we'd understood it. (Alas, many people know what this surprise is in advance. I, for one. Yet this foreknowledge did nothing to spoil my enjoyment: a sure sign of superb construction.)\n\nAll in all, a film that tempts you to rank it with the best ever made - which is more, but not much more, than it deserves - simply because it's perfect. Everything went right. Rosemary is a wonderfully sympathetic heroine, powerless without being passive, largely ignorant of what's going on around her without being at all stupid, and Mia Farrow makes you care deeply about her. The cinematography is pellucid; the art direction is subtly right; there's also a fine, odd yet tuneful, musical score. I can't believe I waited so long to see this.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three Reasons Criterion Trailer for Rosemary's Baby",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3480790041",
        "name": "Rosemary's Baby",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODA5NjYzNmItYWM2OS00YTRiLWJmOWEtNGNlY2I0MWE2NTExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODA5NjYzNmItYWM2OS00YTRiLWJmOWEtNGNlY2I0MWE2NTExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-10-27T03:28:36Z",
        "url": "https://www.imdb.com/video/vi3480790041/"
    },
    "url": "/title/tt0063522/"
}