{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Felicity Kendal",
            "url": "/name/nm0447555/"
        },
        {
            "@type": "Person",
            "name": "Pam Ferris",
            "url": "/name/nm0274913/"
        },
        {
            "@type": "Person",
            "name": "Ryan Philpott",
            "url": "/name/nm0680974/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4937,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106806/"
        }
    ],
    "datePublished": "2003-08-30",
    "description": "Set amongst the stunning gardens of Europe, Rosemary Boxer and Laura Thyme, two professional gardeners, find themselves drawn into solving mysterious crimes.",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGNlYmY1MDYtNjNmYy00N2RkLTljYmUtNTcyNDIwNGI5ZDZjXkEyXkFqcGdeQXVyMjExMjk0ODk@._V1_.jpg",
    "keywords": "murder,character names as series title,cozy mystery,gardener,garden",
    "name": "Rosemary & Thyme",
    "original_info": {
        "id": "Rosemary & Thyme: Series 1_2003",
        "name": "Rosemary & Thyme: Series 1",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "catuus"
        },
        "dateCreated": "2008-03-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0377253/"
        },
        "name": "Delightful Marple clones lead us on the garden path.",
        "reviewBody": "It's well known that Brits generally do murder better than Yanks (or anyone else, for that matter). This trend started with Conan Doyle and continues right down to the present moment. Part of the reason for this is that Brit mysteries are genteel and intelligent. Yank mysteries are often written as if the main audience consists of cave men. Which is, alas, all too true. Even so, the Brit example is starting to sink in on this side of the pond. Virtually all of the main characters in superb series such as \"Bones\" and \"Numbers\" consist of nerds who actually use 3- and 4-syllables (and bigger) words. They also omit gratuitous violence (tiresome) and profanity (even more tiresome). Readers may also recall the spectacular success of \"Murder She Wrote\", set among the rural beauty of the Murder Capital of New England, Cabot Cove. Genteel, engaging, beautifully filmed, this was everything a good mystery ought to be. If you actually like urban grunge and gritty plotting, but want something from the Brits in that line, there's always Helen Mirren's \"Prime Suspect\". This is really good grunge and grit, especially if you want Brit quality instead of slipshod Yank stuff that uses gratuitous violence to distract you from the vapidity of what you're watching.\n\nThe problem is that good Brit mysteries outnumber Yank ones as the Chinese outnumber the Brits. This first decade of the 21st Century is no exception. From 2003 to 2007 we were treated to the wonderful \"Rosemary and Thyme\". All indications are that after 3 seasons (03, 04, 06/07) and 2 specials (04, 05), R&T are through. Well, we still have the long-running \"Midsomer Murders\" and the more recent \"The Last Detective\".\n\nRosemary Boxer (played wonderfully by Felicity Kendal) and Laura Thyme (played even better if possible by Pam Ferris) meet by chance as the latter's husband is deserting her. They go into business as professional gardeners and go about (mostly) rebuilding decrepit plantings. Lo and behold, very shortly they have a body in their garden. Unlike the Midsomer people, the R&T people spread the wealth of death around, taking their characters to beautiful places in England, France, Italy, and Spain. The gardens are often spectacular, and even if not (one episode involves a lawn; another, a grape grove), there is usually a beautiful and/or interesting building to compensate. What we don't get is the American favorite, (ugh!) urban grunge.\n\nThe mysteries themselves are all to brief  all episodes but 2 longer ones are only 48 minutes (as opposed to, say, 100 for Midsomer). In the beginning the girls don't solve the murder so much as they flush the guilty party into the waiting arms of the police. Mostly, however, they work out whodunit. These are good little conundrums, but it would be nice if they had more time in which to get worked out.\n\nThe scripts are clever and witty, informed by an insidious sense of humor. They're full of hilarious throwaway quips and verbal exchanges. This tendency reaches its height in the last episode in the set (the 2005 special), \"The Cup of Silence\". Here we get an actual black-out skit, á la Ernie Kovacs, which we should call \"The Donkey Shop\". It proceeds from the outré premise that somebody would actually try to make a go of a gift shop that sells nothing but donkey-related items. This builds in an exchange right out of Monty Python that leads to one of the most wonderful puns I've ever heard.\n\nBesides, any series that dares to have one of its characters quote the immortal limerick, \"While Titian was mixing rose madder\", can do no wrong.\n\nOK. Tiziano (Titian) Tecelli (1477-1571!) was a great artist. Despite its name, rose madder (root of the plant of the same name) is a brilliant red, often referred to a \"true\" red. OK, I had to look up the dates.\n\nAside from the witty scripts, the acting is on a par with them. There are several talented guest stars, including the brilliant Phyllida Law. One of the stars is a gizmo  that used to steam the grape groves in \"Cup of Silence\". Bless us, holy Rube Goldberg!! R&T comes on 9 DVDs in a compact case. The discs are just a little difficult to remove. The aspect is 16x9. Typical of Brit programs (and this is a serious flaw), there are no subtitles. One of the \"special features\" actually is special. The first DVD for each season (or \"series\", as the Brits refer to it) contains a featurette on the locations used for that season. These are informative and have some beautiful footage. The rest is silence (of which, as previously noted, you can get a whole cup with the last disc).\n\nNote on the lack of subtitles: luckily, the actors' diction is particularly precise and clear overall. Subtitles are not quite the necessity they normally are, although people who don't hear well, or at all, will find this lack damn inconsiderate.\n\nAs you might have figured, I highly recommend this collection. It will give you 18 hours of viewing pleasure at a cost only a couple of inches of shelf space.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Rosemary & Thyme: Season 3-Vol. 1",
        "duration": "PT47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi159956249",
        "name": "Rosemary & Thyme: Season 3-Vol. 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGJiY2IzNTYtNWMyOS00ZWM0LTg5NjgtODNkMDU5MGRjNGVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGJiY2IzNTYtNWMyOS00ZWM0LTg5NjgtODNkMDU5MGRjNGVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-18T06:08:54.516Z",
        "url": "https://www.imdb.com/video/vi159956249/"
    },
    "url": "/title/tt0377253/"
}