{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Miller",
            "url": "/name/nm1188016/"
        },
        {
            "@type": "Person",
            "name": "Irene Montalà",
            "url": "/name/nm0598890/"
        },
        {
            "@type": "Person",
            "name": "Paulina Gálvez",
            "url": "/name/nm0350638/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2320,
        "ratingValue": 3.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0027719/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100769/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019535/"
        },
        {
            "@type": "Person",
            "name": "Alberto Vázquez Figueroa",
            "url": "/name/nm0904723/"
        },
        {
            "@type": "Person",
            "name": "Miguel Tejada-Flores",
            "url": "/name/nm0854185/"
        }
    ],
    "datePublished": "2005-06-10",
    "description": "Dante travels across a desolate, futuristic Spain in search of his girlfriend, Ula. He is pursued by a bloodthirsty, cybernetic Rottweiler.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Yuzna",
            "url": "/name/nm0951206/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Action",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGNjOThmMWYtYzNjOC00M2JhLTlhNWUtMjM5NGI2MGRhMmQyL2ltYWdlXkEyXkFqcGdeQXVyNjM2NTM3ODA@._V1_.jpg",
    "keywords": "infidelity,cheating wife,sex scene,animal character name as title,natural horror",
    "name": "Rottweiler",
    "original_info": {
        "id": "Rottweiler_2004",
        "name": "Rottweiler",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2005-11-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0371920/"
        },
        "name": "That's a bad dog! That's a very bad genetically altered dog!!",
        "reviewBody": "In case you are slightly familiar with horror cinema, you must have heard of the name Brian Yuzna already. He started as the producer of some hugely successful horror flicks in the mid-80's (\"Re-Animator\", \"From Beyond\") but quickly went on to directing his own grotesque and spirited horror projects (\"Society\", \"Return of the Living Dead part 3\"). Personally, I'm a rather big fan of Yuzna. His movies are always very entertaining and stuffed with blood & gore, even though the stories are hardly ever impressive...or even 'good', for that matter. For his latest effort, \"Rottweiler\", the story is even completely and utterly retarded and then STILL this is a very amusing B-movie with loads of absurd aspects that genre fans will love! \"Rottweiler\" is set in Spain in a not-so-distant future (2018). In order to avoid further immigration, the misanthropic Kufard (small but terrific role for veteran Paul Naschy) arrests everybody who washes ashore Puerto Angel. One day, he also arrests the young American couple Dante and Ula. They were playing the rich-kids game of \"infiltration\", in which the players illegally have to cross country borders. That game is just asking for trouble, if you ask me... Some time later, Dante escapes from a prison-transport and heads back to Puerto Angel in order to save Ula, only he's chased by a partly robotic and bloodthirsty Rottweiler that rips every living thing to pieces. The movie is truly incoherent, with extended and unnecessary flashbacks, and often provokes unintentional chuckles. It's fast-paced, though, and contains loads of sleaze and bloody deaths. The Terminatoresque dog looks thrilling and the music as wells as the opening credits are very funky. The acting is atrocious, but that what happens if you recruits cheap Spanish actors and force them to play American characters. The lead guy looks a lot like Orlando Bloom but his acting skills are even worse. \"Rottweiler\" surely is a meaningless horror film, but it remains fun to watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0371920/"
}