{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Roberts",
            "url": "/name/nm0000616/"
        },
        {
            "@type": "Person",
            "name": "Alexandra Paul",
            "url": "/name/nm0000575/"
        },
        {
            "@type": "Person",
            "name": "Anne Openshaw",
            "url": "/name/nm0649068/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 814,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019289/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079339/"
        },
        {
            "@type": "Person",
            "name": "Jim Makichuk",
            "url": "/name/nm0538601/"
        }
    ],
    "datePublished": "2002-05-25",
    "description": "Having taken the blame for an accident beyond his control, pilot Mike Hogan has been on administrative leave indefinitely; however when the airline is desperately short of staff, he is offered to be first officer and accepts, with...",
    "director": [
        {
            "@type": "Person",
            "name": "Jon Cassar",
            "url": "/name/nm0143984/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzY1ODY5OTMtNGY1OC00Y2M0LWI2MmItZmExNTEzZWY2NTUwXkEyXkFqcGdeQXVyMjgxMTkzOQ@@._V1_.jpg",
    "keywords": "2000s,administrative leave,pilot,murderer,die hard scenario",
    "name": "Rough Air: Danger on Flight 534",
    "original_info": {
        "id": "Rough Air_2001",
        "name": "Rough Air",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol-kay"
        },
        "dateCreated": "2005-08-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0268586/"
        },
        "name": "Do you want to dead-head your way back or do you want to take the front seat.",
        "reviewBody": "**SPOILERS**Eric Roberts in one of his rare good-guy roles as 1st officer Mike Hogan is very good as a suspended pilot who's given a second chance to redeem himself under the most dangerous and trying of circumstances.\n\nWaiting for a Trans-Atlantic flight back to New York in London Mike is spotted by the airport manager of AJA airline, Mikes former employer, Arc Davis, Andrew Gillis, and asked if he could come on board as 1st officer since the plane, flight 534, is already two hours late and it's co-pilot isn't showing up. Mike is on administrated leave for crash landing a passenger plane at Boston's Logan Airport when he was supposed to fly the plane to it's original distention. what the board of inquiry wasn't told was that the plane was short on fuel and would have crashed, if Mike kept it airborne, killing everyone where by crash-landing the aircraft he saved all on board. Given a second chance Mike later runs into the same cut & save policies from AJA that caused him to lose his license to fly. \n\nWith the planes captain Jack Brooks ,Kevin Jumbinville,not wanting to wait any longer and with a cargo door dangerously unhinged Flight 534 takes off. Airborne at 30,000 feet all hell breaks loose as the giant passenger plane flies straight into an North Atlantic storm as the cargo door is torn out, causing the inside of the plane to decompress, knocking out Captan Jack as well as a number of passengers and leaving Mike Hogan all alone at the wheel with the planes fuel supply quickly being depleted. \n\nStandard heroics with Mike and his former girlfriend cute and frisky flight attendant Katy Philips, Alexandra Paul, taking over the co-pilot controls as he replaces the wounded and unconscious Captain Jack as Flight 534's pilot. Turning the plane around in mid-flight Capatin Mike steers the aircraft to the nearest landing site before he runs out of fuel and crashes into the Atlantic: foggy and windswept Keflavik Airport in Iceland. \n\nBesides Mike & Kathy there's also fugitive murder being brought back to stand trial in the US, Grant Blyth, Dean McDermott, who later, after he becomes religious, aborted his plan to skyjack the plane and risked his life to shut the cargo door. Thus giving Captain Mike the ability to turn and try to land the aircraft. \n\nBesides being a fugitive from the law Grant is also a computer whiz who's able to jump the planes wires and allow it to be flown manually by Mike,who's not at all that impressed with the planes modern computer technology, and not blindly by instrument control and thus be able to land it safely at Keflavik Airport.\n\nThere's also the sweet and able air traffic controller at Keflavik Sara, Leah Pinsert, who guided the flight to safely in almost zero visibility. You would have thought that the very qualified but conceded Captain Jack would have risen to the occasion, like almost everyone else in the movie did,when things got dangerous and out of control but he did the exact opposite.\n\nWanting to take the control of the aircraft away from the very able and courageous Mike Hogan Captain Jack almost caused the plane to crash with his moronic antics. Which were nothing more then to re-inflate his very bruised ego that was busted by Mike being able to do a much better job of flying, and landing, the aircraft then he did.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0268586/"
}