{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Libero De Rienzo",
            "url": "/name/nm0211144/"
        },
        {
            "@type": "Person",
            "name": "Lucilla Giagnoni",
            "url": "/name/nm3972514/"
        },
        {
            "@type": "Person",
            "name": "Alberto Colombatto",
            "url": "/name/nm5449739/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 652,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Round Trip",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0114953/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066197/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025719/"
        },
        {
            "@type": "Person",
            "name": "Marco Ponti",
            "url": "/name/nm1013665/"
        }
    ],
    "datePublished": "2004-04-02",
    "director": [
        {
            "@type": "Person",
            "name": "Marco Ponti",
            "url": "/name/nm1013665/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkxNzA3OTU4Nl5BMl5BanBnXkFtZTcwNzAyMjA0MQ@@._V1_.jpg",
    "name": "A/R: Andata+ritorno",
    "original_info": {
        "id": "Round Trip_2004",
        "name": "Round Trip",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chris Knipp"
        },
        "dateCreated": "2004-11-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0387960/"
        },
        "name": "Giddy, hip fun with a political conscience",
        "reviewBody": "Those of us who were hungry for something hip and entertaining in the San Francisco New Italian Cinema Event film festival were rewarded by Marco Ponti's new movie, \"Round Trip,\" yet to be seen here -- as is his slacker romance \"Santa Maradona,\" which was very well received in Italy. \"Andata + Ritorno\" has a double plot with echoes of Wong Kar Wai's \"ChungKing Express\"-- as well as many other non-Italian film allusions. A handsome slacker named Dante Cruciani goes to Spain around Christmas while Nina, a lovely flight attendant with a Spanish airline, gets stuck in his home town of Turin due to a general strike, and when all hotels are full up a hotel employee called Tolstoi, who's Dante's best buddy, sets her up in Dante's big but desolate pad. She adopts it and his friends and cleans it up and repaints it with their help, meanwhile -- having little else to do -- soaking up everything about Dante's life from his photos and journals and falling madly love with him. After switched bags and a short prison stay, and missing a large hunk of cash he'd borrowed from some criminals, Dante unexpectedly comes home and in the middle of the night climbs into his bed -- not noticing Nina. When they discover each other, Dante and Nina have a dreamlike transformative night of love. They wake up to the problem of what to do about the criminals who're around looking for their cash and threatening dire consequences if they don't immediately get it (though these are Italian heavies, and they're actually rather nice). Dante, Tolstoi, and his pals work out a successful lightening heist to restore the dough. When it's all over, Nina departs, like an angel come from on high.\n\nThe film stock is ultra high contrast, which gives Dante a fashionably shallow slacker look and makes all the images both dark and beautiful. The air hostesses wear tall caps that look like rooster crowns and give them a distinctive, campy silhouette. This is a buddy picture, a heist picture, and a fable-romance full of jokes, political ironies, and film references. Libero Di Rienzo is a perfect slacker hero, combining the requisite blank irony with masked soulfulness. He's a comer, in seven films since 1999 including Catherine Breillat's \"À ma soeur\". Tolstoi is veteran Indian star Kabir Bedi, who exudes a kind of macho mellowness worthy of Luc Besson's alter ego, Jean Reno. The good angel-flight attendant is the Spanish, but Italian-speaking actress, Vanessa Incontrada, who was the blonde deceiver in Pupi Avati's \"Il cuore altrove,\"\" The Heart Elsewhere.\" The whole movie has a kind of dark giddy energy that makes it feel smoothly executed even though it was made on a shoestring. \n\nLike Matteo Garrone (featured with a tribute at the festival) and Antonio Bocola and Paolo Vari, whose edgy \"Chemical Hunger\" was an entry, Ponti has a social and political conscience, but he's an entertainer. In \"Andata + Ritorno\", a cab driver gets himself and his fare stoned and goes completely bonkers and yells \"BERLUSCONI, NO! BERLUSCONI, NO!\" about ten times. It's a liberating moment and (as the previous entry here shows) the Italians' favorite line in the film. And when the heist is getting set up the planner, Dante Cruciani (Libero Di Rienzo), asks at one point, \"Have you any questions?\" and somebody comes forward and says, \"Yes. Whatever happened to Saddam's weapons of mass destruction?\" \"Andata + ritorno\" has Spanish as well as Italian in it because the flight attendants are from a Spanish airline. Ponti has shamelessly but cleverly combined elements of some of the more original directors of the Nineties such as -- besides Wong -- QuentinTarantino, Danny Boyle, perhaps Kevin Smith, with references to many filmmakers in passing, notably Mario Monicelli whose comic heist film, \"I soliti ignoti\" (\"Big Deal On Madonna Street\") provides the main character's name and alludes to Italian comic great Totò, who was the Dante Cruciani of the earlier film. Among \"Round Trip's\" many giddy pleasures are its fast movement and its sense of camaraderie. Ponti seems a talent destined to make a hit in America -- if he's but given a chance."
    },
    "url": "/title/tt0387960/"
}