{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ginger Rogers",
            "url": "/name/nm0001677/"
        },
        {
            "@type": "Person",
            "name": "Adolphe Menjou",
            "url": "/name/nm0579663/"
        },
        {
            "@type": "Person",
            "name": "George Montgomery",
            "url": "/name/nm0599787/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1825,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Nunnally Johnson",
            "url": "/name/nm0425913/"
        },
        {
            "@type": "Person",
            "name": "Maurine Dallas Watkins",
            "url": "/name/nm0914362/"
        },
        {
            "@type": "Person",
            "name": "Ben Hecht",
            "url": "/name/nm0372942/"
        }
    ],
    "datePublished": "1942-05-28",
    "description": "Roxie Hart signs a murder confession in order to attract publicity for her dancing career as dames don't swing in Cook County. Will everything go as planned?",
    "director": [
        {
            "@type": "Person",
            "name": "William A. Wellman",
            "url": "/name/nm0920074/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzVhY2EwN2QtYzg0NC00YzUyLWExNTEtNjg3ZjkxYjA1MzlkL2ltYWdlXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
    "keywords": "screwball comedy",
    "name": "Roxie Hart",
    "original_info": {
        "id": "Roxie Hart_1942",
        "name": "Roxie Hart",
        "year": "1942"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bunuel1976"
        },
        "dateCreated": "2010-01-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0035272/"
        },
        "name": "ROXIE HART (William A. Wellman, 1942) ***",
        "reviewBody": "This is surely among Ginger Rogers' more popular vehicles but, ironically, one she almost did not appear in – since, being a Fox production, it was originally intended for their resident star Alice Faye (but the latter became pregnant and had to bail out: she would, in any case, have been wrong for the part). The film, of course, is based on the play \"Chicago\" – already filmed as a Silent in 1927 and later musicalized, resulting in the surprise Best Picture Oscar winner of 2002. Anyway, Rogers (with rather unbecoming dark hair) is the titular character who confesses to a murder on realizing this will give her the exposure she so desires!; our heroine then secures the services of a notorious shyster lawyer (energetically played by Adolphe Menjou) – since she clearly does not plan to hang for the crime – not to mention constant press coverage of the whole cause celebre (young George Montgomery actually recounts the tale, complete with a nice final twist, in flashback). The latter stages of the film's succinct and briskly-paced 75 minutes (the pared-down script is by Nunnally Johnson) are taken up by the trial – which versatile director Wellman milks for all its comic absurdity (especially given the image-conscious judge and a gullible jury swayed as much by Menjou's various ruses as Rogers' unabashed exploitation of her own sexuality). ROXIE HART has an agreeably polished look to it besides, making for an altogether sparkling entertainment package...which, according to an Italian film magazine of some years ago, was also numbered among Stanley Kubrick's 10 all-time favorite movies!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0035272/"
}