{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stephen Chow",
            "url": "/name/nm0159507/"
        },
        {
            "@type": "Person",
            "name": "Man Cheung",
            "url": "/name/nm0156522/"
        },
        {
            "@type": "Person",
            "name": "Chingmy Yau",
            "url": "/name/nm0946873/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3902,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Royal Tramp",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015662/"
        },
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        },
        {
            "@type": "Person",
            "name": "Louis Cha",
            "url": "/name/nm0149222/"
        }
    ],
    "datePublished": "1992-07-30",
    "description": "The story of Wilson Bond, a pimp who after saving Chan, the leader of the Heaven and Earth society, a revolutionary group, is made a member. After a botched first assignment for the group, he is made a servant to the Prince, the v...",
    "director": [
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjQyNGRmMzQtMjgwMC00ZWU3LWI2NDMtZjJiMjA0MzJiMjUwXkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "wuxia,wire fu,sword,swordsman,sword fight",
    "name": "Luk ding gei",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "paul_haakonsen"
        },
        "dateCreated": "2021-01-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104770/"
        },
        "name": "A classic Stephen Chow movie...",
        "reviewBody": "\"Royal Tramp\" (aka \"Luk ting kei\") is a fairly straight forward, if not archetypical, Stephen Chow movie, for better or worse. If you are a fan of his movies, then you will definitely like \"Royal Tramp\", no doubt about it. However, if you are not overly keen on his work, I suppose this 1992 movie might be somewhat of a bitter pill to swallow.\n\nThe storyline in \"Royal Tramp\" is one that combines drama, action and, of course, comedy, in the usual Stephen Chow way. And that is what works for the movie, that is definitely something that I enjoy. However, these historical periodic dramas come a dime a dozen and tend to be a bit too trivial. Such is the thing with \"Royal Tramp\" as well, were it not for the injected elements of comedy.\n\nSomething that definitely works well in favor of \"Royal Tramp\" is the cast ensemble. Of course you have the always likeable Stephen Chow in the lead role. And he is joined by the likes of Chingmy Yau, Sandra Kwan Yue Ng and Man Cheung, just to mention some of the more recognizable of faces for those slightly familiar with the Hong Kong cinema. And I will say that people in the movie definitely performed quite well here. Sure, it was somewhat typical performances for a movie of this caliber, so it is not something new or innovative.\n\nThis is a watchable movie, although it is not one that is readily one you sit down to watch soon thereafter. I have seen the movie three times since 1992, so a fair amount of time needs to lapse between each viewing.\n\nWhile \"Royal Tramp\" is not the best of action comedy that the Hong Kong cinema has to offer, it is definitely one that could prove worth your time and effort to watch. My rating of \"Royal Tramp\" from writer and director Jing Wong lands on a six out of ten stars.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0104770/"
}