{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Don McKellar",
            "url": "/name/nm0001528/"
        },
        {
            "@type": "Person",
            "name": "Kira Clavell",
            "url": "/name/nm0165413/"
        },
        {
            "@type": "Person",
            "name": "Tara Spencer-Nairn",
            "url": "/name/nm0818166/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 618,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067241/"
        },
        {
            "@type": "Person",
            "name": "Soo Lyu",
            "url": "/name/nm1031010/"
        },
        {
            "@type": "Person",
            "name": "Edward Stanulis",
            "url": "/name/nm0822825/"
        }
    ],
    "datePublished": "2002-11-01",
    "description": "Three beautiful masseurs are committed to their upstanding clients and their jobs. But their new manager is trying to run an honest business. Will he be able to stop the girls from giving their customers a little something extra?",
    "director": [
        {
            "@type": "Person",
            "name": "Soo Lyu",
            "url": "/name/nm1031010/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDNmY2U0MDctOTk1MC00MmEyLWEzNjAtYWJmNmI0NTI0M2MyXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "massage parlor,security camera,breasts,female frontal nudity,male rear nudity",
    "name": "Rub & Tug",
    "original_info": {
        "id": "Rub & Tug_2002",
        "name": "Rub & Tug",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aimless-46"
        },
        "dateCreated": "2007-07-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0293563/"
        },
        "name": "Writer-Director's First and \"Last\" Feature",
        "reviewBody": "I'm afraid this one is pretty dreadful, despite several good performances and generally competent acting-for-the-camera direction. It's a first and last attempt by writer-director Soo Lyu. \"Rub and Tug\" (2002) is one of the unfortunate by-products of Canada's program to promote home-grown film-making. While the program encourages worthwhile efforts like \"New Waterford Girl\" it opens the door for untalented novices like Lyu who did not have to aggressively pitch this project but was green-lighted without an adequate examination of her script or her credentials. \n\nYou don't mind the low budget because the shabby production design, bad lighting, poor audio, and dreary docu-style shot selection is consistent with the subject matter; the workers in Canadian massage parlors. But the dialogue and the plotting doesn't give the actors anything to work with, the editor much to assemble, or a viewer any mental challenge other than suspension of disbelief. When your story is this simplistic the last thing you need is a muddled storytelling technique; even though nothing happens, the movie is hard to follow and point-of-view impossible to pin down. \n\nDon McKellar's performance as Conrad is several notches below his similar characterization in \"Exotica\". Lindy Booth's Lea is her standard quirky airhead; as always she is likable but here she is little else. Kira Clavell's Cindy is a pleasant surprise, a kind of Asian Shelley Duval. The only other role of any consequence, Tara Spencer-Nairn's street-wise Betty, more than cancels out her excellent performance in \"New Waterford Girl\". Her shallow performance in \"Rub and Tug\" should curtail any tendency to seek out other films in which she has appeared; unless you need further confirmation of \"Waterford\" director Alan Moyle's skill in working with young actors. \n\nYou quickly conclude that Lyu's reptilian brain cannot grasp concepts like plot complexity, so the need to insert a lazy and lame \"deus ex machina\" device toward the end is hardly a surprise. Still it could be worse, the listless story has so little internal logic anyway that the unlikely ending is not as painful as would normally be the case. \n\nThen again, what do I know? I'm only a child.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Velocity Home Entertainment",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi311492889",
        "name": "Rub and Tug",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjFlYzdhNTItZWZjNi00YWJhLWI3ODMtZmY0NDNjODI3MGYyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjFlYzdhNTItZWZjNi00YWJhLWI3ODMtZmY0NDNjODI3MGYyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:42:27Z",
        "url": "https://www.imdb.com/video/vi311492889/"
    },
    "url": "/title/tt0293563/"
}