{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Red Buttons",
            "url": "/name/nm0000999/"
        },
        {
            "@type": "Person",
            "name": "Ethel Merman",
            "url": "/name/nm0581062/"
        },
        {
            "@type": "Person",
            "name": "Mickey Rooney",
            "url": "/name/nm0001682/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2471,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093733/"
        },
        {
            "@type": "Person",
            "name": "Romeo Muller",
            "url": "/name/nm0612239/"
        }
    ],
    "datePublished": "1979-07-01",
    "description": "The Winterbolt is trying to make North Pole his evil wonderland, and it is up to Frosty the Snowman, Rudolph the Red-Nosed Reindeer and other icons to stop him.",
    "director": [
        {
            "@type": "Person",
            "name": "Jules Bass",
            "url": "/name/nm0060072/"
        },
        {
            "@type": "Person",
            "name": "Arthur Rankin Jr.",
            "url": "/name/nm0710230/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzMDc3NjAwMV5BMl5BanBnXkFtZTgwNTY1MzkwMzE@._V1_.jpg",
    "keywords": "christmas special,1970s,july,character names in title,rudolph the red nosed reindeer character",
    "name": "Rudolph and Frosty's Christmas in July",
    "original_info": {
        "id": "Rudolph and Frosty's Christmas in July_1982",
        "name": "Rudolph and Frosty's Christmas in July",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "YankeeDoodleDan"
        },
        "dateCreated": "2014-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079828/"
        },
        "name": "There was absolutely nothing wrong with this holiday special. Period.",
        "reviewBody": "I truly believe that most of the negative reviews are just a result of people jumping on the bandwagon about \"the Rankin and Bass special we're not supposed to like.\" One might ask then, why did it \"flop\" at the box office? It sounds like it was very poor marketing to have released it in July. Just because the story was set in July does not change the fact that it is a Christmas story in every sense of the word and should be shown at Christmas time. That was a tactical error which caused it to fail, obtain a bad reputation, and now everyone just agrees that it's bad without thinking for themselves. Judged on its content, it's a great story and the complaints against it make little sense. For one thing, it's a major mistake to compare this to the earlier Rankin and Bass specials, as if this movie was somehow made to be in competition with them. It was obviously created to complement them and it does an excellent job of it. Secondly, it is a delightful, heartwarming movie that anyone with a soul should enjoy. Thirdly, the movie does a very clever job of incorporating the many favorite Rankin and Bass specials together and reinforces the idea that it is all in one universe. It provides closure to many aspects of the specials, such as Frosty and Crystal's life and family together, their ongoing friendship with their former advisory Jack Frost, Rudolph's origin, and many other details. It even subtly explains Santa's more idiosyncratic behavior in past specials, such as his grumpiness in Rudolph The Red Nosed Reindeer and self-pity in Year Without A Santa Clause. He says to Mrs. Santa Clause, \"I'm not the easiest man to get along with\" and she says, \"Only when it gets close to Christmas Eve.\" It's really a very significant special and it's a shame that it's lost on some. So, folks, watch this delightful Christmas movie, don't be influenced by the hate that others have directed towards it, avoid holding it to crazy standards that no other fantasy movie would be held to, just lighten up, sit back, and enjoy Rudolph and Frosty's Christmas in July with an open mind and a happy heart.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0079828/"
}