{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tommy Lee Jones",
            "url": "/name/nm0000169/"
        },
        {
            "@type": "Person",
            "name": "Samuel L. Jackson",
            "url": "/name/nm0000168/"
        },
        {
            "@type": "Person",
            "name": "Guy Pearce",
            "url": "/name/nm0001602/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 48843,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045848/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0194542/"
        },
        {
            "@type": "Person",
            "name": "Jim Webb",
            "url": "/name/nm0916136/"
        },
        {
            "@type": "Person",
            "name": "Stephen Gaghan",
            "url": "/name/nm0300866/"
        }
    ],
    "datePublished": "2000-04-07",
    "description": "An attorney defends an officer on trial for ordering his troops to fire on civilians after they stormed a U.S. embassy in a Middle Eastern country.",
    "director": [
        {
            "@type": "Person",
            "name": "William Friedkin",
            "url": "/name/nm0001243/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Drama",
        "Thriller",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGZiYmU2YzAtY2YxZC00MWNlLTliYTgtYzczMGVjOGIxN2UwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "vietnam war veteran,the white house washington d.c.,suspense,violence,chanting",
    "name": "Rules of Engagement",
    "original_info": {
        "id": "Rules of Engagement_2000",
        "name": "Rules of Engagement",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nunculus"
        },
        "dateCreated": "2000-04-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0160797/"
        },
        "name": "A Few Good Men Go to My Lai",
        "reviewBody": "For extreme-right-wing, little-brown-person-denigrating, jingoistic, racist, xenophobic major-studio pap, you'd have to go back to the liberal journalist David Janssen following John Wayne around and finally seeing the light in the 1969 GREEN BERETS. \n\nThe proposition here is that Samuel L. Jackson is sent into the U.S. Embassy in Yemen to save the ambassador (Ben Kingsley, quivering with perfidy) and his family. He does--and even risks his life to run back and save the shot-up American flag. (Shtik like this was considered too corny not just in RAMBO, but in the RAMBO sequels.) As Sam and his Marines are about to make it out, shots--both from nearby snipers, and from a crowd of demonstrators gathered outside the embassy--are taking down Sam's guys. So he issues a command, which can be rendered on the IMDB as \"Waste those mudder fruggers!\" And Samuel L.'s jarheads waste not one, not two, not a handful of bad apples, but every last man, woman and child in that pile of mudder fruggers. The next day, the cover of the Washington Post looks like My Lai, or the Guyana suicides.\n\nThrough the course of the movie, Jackson's character never shows the slightest remorse--he isn't troubled in the least by the fact that at least a few of the people he shot (the six-year-old girls, say) might have been completely innocent. He's convinced he did what he had to do and what he was told to do--and anybody who disagrees is a conspiring, back-stabbing desk jockey keeping the godly warriors of our culture from winning the damn wars.\n\nThe movie is a Vietnam-compensation fantasy, like RAMBO or UNCOMMON VALOR...but we're in the year 2000, and it plays a little creepy. \"This is a different world,\" Jackson tells the Marine lawyer whose life he once saved (Tommy Lee Jones). \"No enemies, no friends, no lines, no Mom, no Pop.\" RULES OF ENGAGEMENT tests out an evil new template: the Islamic fundamentalist as the stand-in for the Viet Cong (or Soviet) savage. Behind the heroism, the flag worship, the supplicating honor-guard musical score, lies the presumption that American lives are just worth a hell of a lot more than Yemeni lives--or, to use the prologue as an example, Vietnamese lives, either. And though the director, William Friedkin, fastens ghoulishly onto images of charred, limbless or blood-spattered children, the implication is made, as in THE GREEN BERETS, that that cute little crippled girl just might pull out a pistol and blast your American manhood clean off.\n\nIs Friedkin just a super-competent dude looking for a comeback, or is he subverting this material? I'd like to buy into the latter. His focus on the injuries done by Jackson to children are not just EXORCIST-style morbidity--Friedkin seems to be making the point that the script refuses to make: that Jackson's actions are evil and insane, and arguably deserving of a roomful of gas pellets.\n\nSamuel Jackson, Tommy Lee Jones, and the producer, Scott Rudin, one of the most intelligent guys in studio movies, all deserve to hang down their heads in shame for this one. This is the case of smart people--I include Friedkin in this--testing the waters of the post-Clinton era to see if Reaganite jingoism might make a comeback as a story template for pop movies. But none of the Sly or Arnold movies of the eighties was as morally ugly as this one. And using a black actor to sell this patently racist bill of goods is the ultimate insult. The movie leaves you feeling unclean."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Rules Of Engagement",
        "duration": "PT2M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4268596505",
        "name": "Rules of Engagement",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjEyNDJjNWItOTk2Ni00NzE0LWJkZjctMzUyNzllMGZjOWFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjEyNDJjNWItOTk2Ni00NzE0LWJkZjctMzUyNzllMGZjOWFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-05-22T03:30:37Z",
        "url": "https://www.imdb.com/video/vi4268596505/"
    },
    "url": "/title/tt0160797/"
}