{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rush",
            "url": "/name/nm2000037/"
        },
        {
            "@type": "Person",
            "name": "Geddy Lee",
            "url": "/name/nm1441958/"
        },
        {
            "@type": "Person",
            "name": "Alex Lifeson",
            "url": "/name/nm0509820/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 825,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0118549/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0122416/"
        }
    ],
    "datePublished": "2003-10-21",
    "description": "First concert DVD ever from legendary rock trio Rush. Double-DVD set, containing 28 Rush songs. Bonus features include a tour documentary, multi-angle viewing options for certain songs, and behind-the-scenes footage. Recorded and ...",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel E. Catullo",
            "url": "/name/nm1410292/"
        }
    ],
    "duration": "PT2H51M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA0OTU5NTEwMF5BMl5BanBnXkFtZTcwMTg3NTcxMQ@@._V1_.jpg",
    "keywords": "rock music,rock concert,concert film",
    "name": "Rush in Rio",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jind"
        },
        "dateCreated": "2006-08-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0390441/"
        },
        "name": "one of best rock bands ever show how excellent they are in Rio",
        "reviewBody": "I have been a \"huge\" rush fan ever since \"moving pictures\" and this concert is simply and example to everyone who is a fan why Rush is so popular. They completely admitted to playing their biggest concert yet, and, despite the rain in a soccer arena, they still manage to give an outstanding performance from start to finish. A real example of this is during \"yyz\" the entire crowd start to sing along to it in a real classic manner, in perfect sinc. They really play all of everyone's favorite songs with a real powerful \"lust\" that rarely happens anymore. You get the best seat in the house for one of their best concerts given. The second DVD is a fascinating documentary of the band while they are in brazil and shows you a lot of the backstage things going on and it allows you to see them not just a musicians but as actual people in their everyday life. This DVD gift set is a must for any Rush fan young and old and is definitely a keeper for your DVD collection. Their is even a cd of the concert for those who just want to listen to the music. This DVD is worth it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0390441/"
}