{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve Blum",
            "url": "/name/nm0089707/"
        },
        {
            "@type": "Person",
            "name": "Jason Spisak",
            "url": "/name/nm1032853/"
        },
        {
            "@type": "Person",
            "name": "Carrie Savage",
            "url": "/name/nm1387237/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1145,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "s-CRY-ed",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006858/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046382/"
        }
    ],
    "datePublished": "2001-07-04",
    "description": "22 years ago, a bizarre uprising occurred in Japan's Yokohama region, destroying civilization, killing many, and causing the area to break off from Japan's mainland. This region came to be known as the \"Lost Ground\". Over the year...",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmIxNjFkNzMtMDdkMS00ZThiLWEwOTEtMDc0YjU3ZTk5MzRmXkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "superpower,post apocalypse,fight,powers,blue hair",
    "name": "Scryed",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OUKnight99"
        },
        "dateCreated": "2004-03-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0307427/"
        },
        "name": "Some decent action, but overall rather boring",
        "reviewBody": "S.CRY.ED takes place in what could be the distant future, a world where a catastrophic event has shaken a section of the earth, giving select individuals from a certain generation the ability to use \"alters,\" which is kind of a sort of magic, allowing them to transform objects and fight each other. (yes, you would think that they would find a good way to use these abilities, but no, all they do is fight each other.) There are two different types of alter users, \"native alters\" who live outside the walls of the city, simply trying to go on with their lives, and those alter users who are part of an organization known as HOLD, these alter users form an offshoot of HOLD called HOLY.\n\nKazuma is one such \"Native Alter\" with an amazingly strong alter. He works as a bounty hunter, until one day, HOLY comes, and everything changes.\n\n\n\nThe only thing I can really say about SCRYED, is that when everything is put together, what you basically get, is an OKAY anime. Nothing in the entire anime is really exceptional. The different Character designs are mostly rather unattractive, as are some of the characters themselves. Kazuma is your standard protagonist, strong and unpredictable, and always looking for a fight. Ryu, the strongest warrior from HOLY, is probably the coolest looking, but is still your standard antagonist.\n\nThe animation in this series is sometimes good, and sometimes rather bland. While none of the fights are what you would call jaw-dropping, since this IS an action anime, most of them come across as rather decent, if not rather silly.\n\nThe music switches between 80's punk rock, and some weird vocals that kind of sound like japanese hymns. Sometimes it fit, and sometimes it didn't. I did enjoy the opening theme though, and I always looked forward to watching it.\n\nThe last point I will bring up is the story, which started off simple enough, (I won't go into it, but it is pretty clear after watching just the first episode) but suddenly took a turn for the much more 'weird.' I don't really think the animators planned ahead, because after episode fifteen or so, the entire series is kind of a mess and by the end your just watching it to say you finished it, which is never good when your shelling out twenty bucks a dvd.\n\nOverall, like I said before, this anime is just okay. Had the series continued to get better as it did from episodes 1-15, then this series probably would have gotten an A grade, but with the mess of the second half, the highest I can give this anime is C-."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Bandai Entertainment",
        "duration": "PT1M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2357264665",
        "name": "S-Cry-Ed",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDcwZDk0M2YtMjM4YS00NWNjLTlkZDgtNjYzOTMyZWMzNWNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDcwZDk0M2YtMjM4YS00NWNjLTlkZDgtNjYzOTMyZWMzNWNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:44:13Z",
        "url": "https://www.imdb.com/video/vi2357264665/"
    },
    "url": "/title/tt0307427/"
}