{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rishi Kapoor",
            "url": "/name/nm0438501/"
        },
        {
            "@type": "Person",
            "name": "Kamal Haasan",
            "url": "/name/nm0352032/"
        },
        {
            "@type": "Person",
            "name": "Dimple Kapadia",
            "url": "/name/nm0438092/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1022,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0601433/"
        },
        {
            "@type": "Person",
            "name": "Javed Akhtar",
            "url": "/name/nm0015287/"
        }
    ],
    "datePublished": "1985-08-09",
    "description": "Raja, a fisherman is secretly in love with Mona. When wealthy Ravi comes to live with his grandmother, Kamladevi, he sees Mona and falls in love with her. Mona also reciprocates his love. Raja is devastated by this turn of events....",
    "director": [
        {
            "@type": "Person",
            "name": "Ramesh Sippy",
            "url": "/name/nm0802693/"
        }
    ],
    "duration": "PT3H6M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGQ3MzI3OWMtMzFiYS00MWY1LWE5ZDktNjNhZmIyZjg5M2NlXkEyXkFqcGdeQXVyOTIzODUxMjk@._V1_.jpg",
    "keywords": "lust,bar,love,village,friend",
    "name": "Saagar",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nadkarnisumeet"
        },
        "dateCreated": "2020-08-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0152256/"
        },
        "name": "Ramesh Sippys ode to Casablanca",
        "reviewBody": "Love triangle is a separate genre in itself as far as Bollywood cinema is concerned. From Andaaz (1949) to Sangam (1964), this trikon wala formula has found its share of success. Ramesh Sippy's Saagar was another addition to it.\n\nThe story was simple : Mona (Dimple Kapadia) falls for the richie rich Ravi (Rishi Kapoor) while her childhood friend Raja (Kamal Haasan) secretly loves her. Saagar or the sea forms the backdrop of this story and is a character in itself.\n\nJaved Akhtar's story was as old as the ocean but it was director Ramesh Sippy's brilliant execution which elevated Saagar to a cut above the commonplace. The way he shot each scene particularly the sunrise and sunset landscape made it a visual delight indeed. Saagar is completely a directors film!!\n\nRD Burman's melodious music was another big positive and all songs topped the music charts that year. Technically too, the film was far ahead of the mediocre actioners made in that era.\n\nComing to the cast, Rishi Kapoor and Dimple Kapadia reunited after their super successful debut in Raj Kapoor's Bobby (1973) and yep, their chemistry was just as sizzling. Kamal Haasan pitched in a fantastic performance and won the Filmfare award for best actor that year.\n\nDimple, already a mother of two, looked drop dead gorgeous even appearing in a fleeting topless shot which generated a lot of controversy at that time. Pitching in a powerful performance, Saagar wouldn't be half of what it is without her!!\n\nSurprisingly, the villain - an otherwise strong point in Sippy films from Gabbar to Shakaal - was relatively pheeka here and Shafi Inamdar just couldn't fit in as the main antagonist.\n\nIf compared with world cinema, Saagar is to Casablanca (1942) what Sholay is to The Seven Samurai (1954) - its Ramesh Sippys ode to these timeless classics. Unfortunately, the film could not replicate the success of Sholay and was an under performer at the box office.\n\nI had seen Saagar with my parents at Barkha cinema (of Badal Bijlee trio), Matunga and then multiple times on VHS. It is my favourite film in the love triangle genre.\n\nRegards Sumeet Nadkarni",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0152256/"
}