{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvia Sidney",
            "url": "/name/nm0796662/"
        },
        {
            "@type": "Person",
            "name": "Oskar Homolka",
            "url": "/name/nm0393028/"
        },
        {
            "@type": "Person",
            "name": "Desmond Tester",
            "url": "/name/nm0856469/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17660,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053065/"
        },
        {
            "@type": "Person",
            "name": "Joseph Conrad",
            "url": "/name/nm0175676/"
        },
        {
            "@type": "Person",
            "name": "Charles Bennett",
            "url": "/name/nm0071657/"
        },
        {
            "@type": "Person",
            "name": "Ian Hay",
            "url": "/name/nm0067308/"
        }
    ],
    "datePublished": "1937-01-11",
    "description": "A Scotland Yard undercover detective is on the trail of a saboteur who is part of a plot to set off a bomb in London. But when the detective's cover is blown, the plot begins to unravel.",
    "director": [
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGI3ZmVkMDItZTdiZi00OTg0LWE5ODEtMmNjMDBlNGMzZjExXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg",
    "keywords": "terrorism,imitating a bird,songbird,stabbed in the stomach,undercover police officer",
    "name": "Sabotage",
    "original_info": {
        "id": "Sabotage_1936",
        "name": "Sabotage",
        "year": "1936"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Steffi_P"
        },
        "dateCreated": "2009-07-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0028212/"
        },
        "name": "\"If gangsters looked like gangsters\"",
        "reviewBody": "In the mid-to-late 1930s Alfred Hitchcock held a unique position for a director. Since the successes of The Man Who Knew Too Much and The 39 Steps, his destiny as a suspense filmmaker had been revealed not only to himself but also to his bosses at Gaumont. He was now only assigned material suitable to his area of expertise, and given a considerable amount of freedom to play around with the form. At the tail end of his British period, at a time when standard cinematic technique and narrative convention were well established, Hitchcock was effectively a researcher, of the kind that hadn't really been seen since the days of Griffith.\n\nSabotage is adapted from the Joseph Conrad novel Secret Agent, and it's worth taking a peek at a synopsis of the book to see the differences in the movie version, two of which are very significant. Firstly the novel is a kind of anti-heroic piece told largely from the point-of-view of the villainous Verloc. You couldn't have that in cinema in the 30s, so Verloc's opponents are beefed up into morally sound protagonists. However, it is still revealed from the outset that Verloc is the culprit, and we the audience are always kept aware of his doings even when the heroes are not. Dispensing with the Agatha Christie form of \"whodunit\" is essential to the Hitchcockian mode of suspense building. Revealing the identity and intentions of a killer keeps the audience constantly wondering when and how he will strike again.\n\nThe other important difference between the novel and film, is that Conrad states quite explicitly that Verloc and co. are anarchists, delving quite deeply into their ideology, as well as implying that they are Russians. Hitchcock's picture however makes no mention of the politics or nationality of the villains. They are simply generic foreign terrorists, existing to make the plot work. Imagine how much weaker this picture would be if we were asked to think about Verloc's motives. He has thick eyebrows, a sinister accent and he puts bombs on buses. What more do you need? \n\nOn a purely formalist level, Hitchcock's method is becoming increasingly streamlined. This is perhaps the earliest of his pictures which really feels like it was planned shot by shot before a single camera rolled. Of particular note is Hitch's staging of drama through reaction shots rather than expository dialogue. For example, Oskar Homolka's reaction to Stevie talking about gangsters, or pair of close-ups after John Loder is pulled through the air vent that tells us one of the gang members has recognised him. There are a few pointless technical touches, such as Homolka's vision of London in the fish tank glass, or Stevie's face popping up among the crowd of boys, but these are not as distracting as they could be in Hitch's earliest pictures.\n\nHitchcock rarely gave his actors any coaching, and relied upon a good professional cast to deliver the goods. In Sylvia Sydney and Oskar Homolka he has two of the best leads he had worked with so far, and their restrained naturalistic performances make their climactic scene together incredibly effective. The supporting cast are not bad either, although as usual with Hitchcock the comedy characters are the real standouts. Little-known stage veteran William Dewhurst, who plays the \"professor\", is a joy to watch, and it almost looks as if his scenes are about to turn into Monty Python sketches.\n\nMuch as I detest the phrase \"experimental film\", this was truly an experimental era for Hitchcock, or at least one in which his pictures were going through a process of natural selection. He realised afterwards he had made a huge mistake in one aspect of the main suspense sequence on the bus – I won't reveal it here as it's a major spoiler – and would ensure he never repeated the error. In spite of what was for him an embarrassing flaw, Sabotage is a very enjoyable and effective thriller, not among the greatest of his British period, but certainly worth watching.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Scotland Yard undercover detective is on the trail of a saboteur who is part of a plot to set off a bomb in London. But when the detective's cover is blown, the plot begins to unravel.",
        "duration": "PT1M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2805908249",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWQ3OGQ5ZTAtZDFkMS00YTA1LWExNGMtMGVhYjhkZjRlMmM0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWQ3OGQ5ZTAtZDFkMS00YTA1LWExNGMtMGVhYjhkZjRlMmM0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-08T00:40:17.897Z",
        "url": "https://www.imdb.com/video/vi2805908249/"
    },
    "url": "/title/tt0028212/"
}