{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Humphrey Bogart",
            "url": "/name/nm0000007/"
        },
        {
            "@type": "Person",
            "name": "Audrey Hepburn",
            "url": "/name/nm0000030/"
        },
        {
            "@type": "Person",
            "name": "William Holden",
            "url": "/name/nm0000034/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 66949,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        },
        {
            "@type": "Person",
            "name": "Samuel A. Taylor",
            "url": "/name/nm0853138/"
        },
        {
            "@type": "Person",
            "name": "Ernest Lehman",
            "url": "/name/nm0499626/"
        }
    ],
    "datePublished": "1954-10-15",
    "description": "A playboy becomes interested in the daughter of his family's chauffeur, but it's his more serious brother who would be the better man for her.",
    "director": [
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmFlNTA1NWItODQxNC00YjFmLWE3ZWYtMzg3YTkwYmMxMjY2XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "attempted suicide,one word title,voice over narration,fashion,new york city",
    "name": "Sabrina",
    "original_info": {
        "id": "Sabrina_1954",
        "name": "Sabrina",
        "year": "1954"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2017-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0047437/"
        },
        "name": "Great Cast, Wonderful Direction and Terrific Romance",
        "reviewBody": "Sabrina (1954) \n\n*** 1/2 (out of 4) \n\nInsanely delightful romantic-comedy from Billy Wilder about Sabrina (Audrey Hepburn), a chauffeur's daughter who has always loved David Larrabee (William Holden), the son of the man her father works for. When she returns from Paris the youngest son begins to have a thing for her but he's promised to another woman and there's a major deal on the line. Older and much more mature brother Linus (Humphrey Bogart) decides to take Sabrina out until the deal is complete but soon he finds himself falling in love.\n\nWilder made so many great movies in his career that it's easy to overlook some of the ones that are meerly \"good\" or very good. SABRINA is a film that often gets overlooked when one discusses the director's career and that's a little shocking because this is an extremely good movie that works on all levels. Not only is the film extremely funny but it's incredibly romantic, charming and the director's master touch is scattered throughout the material. Not to mention you've also got three legends in the picture! \n\nTo me the film shows what a brilliant director Wilder was because it's true that the story is pretty much a small fairy tale that Hollywood did every year. There was always some sort of romance dealing with a dreaming girl and an overworked man who put love on the back burner. Wilder's touches throughout the film are obvious and it's really remarkable to see how well this material works. As I said, there are some very funny moments scattered throughout the picture but there's also a bit of intensity because you really do want to see the story work in the favor of the Bogart character. The way Wilder managed to make the romance work so well is a real strong inducator to what type of director he was.\n\nAs far as the cast goes, rumor has it that Bogart hated this role and the movie because he felt he was too old to be romancing such a young girl. You know, he was probably right but the film is so well-made and the performances are so great that this here really isn't an issue as you watch the picture. Bogart really comes across well here and he manages to play the broken-hearted quite well. Hepburn is wonderfully charming in a type of role that she is best remembered for. Bogart and Hepburn certainly have a burning chemistry that jumps off the screen. Holden is also extremely funny in his bit as the playboy. There's also some great supporting performances from John Williams, Walter Hampden and Francis X. Bushman.\n\nSABRINA does run on a bit too long but there's still no question that Wilder does a fantastic job, the romance is perfect and the three leads are simply divine."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi470793753",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjlkYjI2MjEtMjQ2MC00MzJlLWFkMTUtMzIzYTg3ZWFmNGM0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjlkYjI2MjEtMjQ2MC00MzJlLWFkMTUtMzIzYTg3ZWFmNGM0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-16T13:48:40.512Z",
        "url": "https://www.imdb.com/video/vi470793753/"
    },
    "url": "/title/tt0047437/"
}