{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julianne Moore",
            "url": "/name/nm0000194/"
        },
        {
            "@type": "Person",
            "name": "Xander Berkeley",
            "url": "/name/nm0075359/"
        },
        {
            "@type": "Person",
            "name": "Dean Norris",
            "url": "/name/nm0606487/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15625,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022993/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066669/"
        },
        {
            "@type": "Person",
            "name": "Todd Haynes",
            "url": "/name/nm0001331/"
        }
    ],
    "datePublished": "1995-06-30",
    "description": "An affluent and unexceptional homemaker in the suburbs develops multiple chemical sensitivity.",
    "director": [
        {
            "@type": "Person",
            "name": "Todd Haynes",
            "url": "/name/nm0001331/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODliOWEzMTUtZDQ5ZS00ZTBmLTgzNzEtMGVkOTlhYWNkYjE2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "psychiatrist,housewife,allergy,environment,psychosomatic illness",
    "name": "Safe",
    "original_info": {
        "id": "Safe_1995",
        "name": "Safe",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Zen Bones"
        },
        "dateCreated": "2003-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114323/"
        },
        "name": "My Kind of Thriller!",
        "reviewBody": "There are some that feel that a thriller has to be a rollercoaster ride with thrills and spills every minute. This film is not that kind of thriller. SAFE is like those chilling dreams where you are being dragged through something somewhat familiar yet otherworldly and just out of reach of total comprehension. Those sort of dreams are annoying, but we all have them anyway. Some people shrug them off, some think they can explain it away by analysis, and some just like to bask in the fact that they are mysterious, heart-palpitating, and fascinating. I'm in the latter category, and such is my love for this film. This film is like a kaleidoscope where the patterns seem fixed and definable, yet are constantly changing. \n\n There's no doubt that Todd Haynes has something to say about the toxicity of our environment, the toxicity of our relationships, the toxicity of our generic society, and even the toxicity of our venues of healing. Doctors and psychiatrists for example, are cold and sterile and seemingly wearing blinders and cotton in their ears when it comes to really seeing or listening to their patients. New Age healers on the other hand are warm and receptive and seemingly interested in seeing you, hearing you and knowing you. But they trod down the same path that religious fundamentalists do. If your faith isn't strong enough; you won't be healed. One recollects New Age healers' like Louise Hay who claimed that AIDS victims had subliminal desires to hurt themselves, but could be cured with a strong dose of self-love. An especially nasty ruse, when one considers how most of society has already blamed the victim. AIDS victims shouldn't blame themselves, but they shouldn't believe that enough' faith will heal them either. So we can feel for Carol White (as generic sounding a name as one could imagine!) who knows her illness to be real, but who feels guilty nonetheless because no one will let her own her illness. They don't even know she exists, really. And she, from the beginning of this film, isn't sure either.\n\nCarol is an enigma to herself. She's like a fish in an aquarium (her house in fact, looks sort of like a dungeon set in a space-age aquarium), only she never really saw her life as such until she reached the pinnacle of success defined by society. At the opening of the film, she's got it all': wealth, security, servants, friends', family' and health (well, for the time being). But what happens when you've reached the pinnacle of success? Just be happy going to dull social functions and decorate your proverbial palace? Carol begins to see her life her aquarium- from outside. It's dull, blue and facile. A person who has a sense of self could try to survive in the ocean' of life, but Carol isn't such a person. So it's not so unnatural that she might become so vilely inebriated by the blandness and inanity of her life that she can barely talk and ultimately, can barely breathe. One can get literally ill with an overdose of generic, stupefying life. Ever been stuck in a dentist's waiting room listening to the likes of Tony Orlando and Dawn or Linda Ronstadt? We're talking real nausea here! So imagine being a person who lives in a 24/7 world of pastel colours, pop musak, shopping, vacuous conversation with friends', and being married to a man who has less charisma than a houseplant. Depression of that magnitude would leave any person raw. Carol's blues (which we can see literally in the lighting of her house and in the God-awful furniture) have broken her. Once she realized how raw she'd become, she lost all sense emotionally and physically- in how to cope. Perhaps the reason that no one could help her was that they were all too busy enjoying the decor of their proverbial aquariums. Her husband, her friends, her doctors, even the new Age healers, LIKE the limited, appropriately fashioned, seemingly inoffensive world they've found their niche in. Gosh knows, I've thought myself nuts for not being part of the majority of the population that likes shopping malls, industrial architecture, Nike, Julia Roberts, or franchise coffee houses' that serve their overpriced coffee in paper cups. I kind of understand why Carol would want to bury herself in an igloo by the end of the film. But New-Agey as it may be, there is a glimmer of hope when she stands at the mirror and chokes out `I love you' to her reflection. It's not exactly Descartes' `I think, therefore I am', but its affirmation enough that she does indeed have a face and a heart. She does indeed exist. I think that's what Todd Haynes' message to us is. SAFE is a cry for us to take a good, hard look at the world around us, to recognize its variety of poisons, and to make a stand to save it and to save ourselves."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3649044761",
        "name": "Safe",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWM0ZmViYzUtZWFkOS00MDVkLWFiMzktOTJmZDQ4Mjk0MjY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWM0ZmViYzUtZWFkOS00MDVkLWFiMzktOTJmZDQ4Mjk0MjY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:41:07Z",
        "url": "https://www.imdb.com/video/vi3649044761/"
    },
    "url": "/title/tt0114323/"
}