{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jacques Gamblin",
            "url": "/name/nm0303826/"
        },
        {
            "@type": "Person",
            "name": "Denis Podalydès",
            "url": "/name/nm0687914/"
        },
        {
            "@type": "Person",
            "name": "Charlotte Kady",
            "url": "/name/nm0434432/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1550,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Safe Conduct",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022244/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069857/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076287/"
        },
        {
            "@type": "Person",
            "name": "Jean Devaivre",
            "url": "/name/nm0222157/"
        },
        {
            "@type": "Person",
            "name": "Jean Cosmos",
            "url": "/name/nm0181924/"
        },
        {
            "@type": "Person",
            "name": "Bertrand Tavernier",
            "url": "/name/nm0851724/"
        }
    ],
    "datePublished": "2002-01-09",
    "description": "In Nazi-occupied France, two filmmakers solve the collaborationism dilemma differently.",
    "director": [
        {
            "@type": "Person",
            "name": "Bertrand Tavernier",
            "url": "/name/nm0851724/"
        }
    ],
    "duration": "PT2H50M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGRjNjliMjEtOTlhZC00OTRmLTg4NzEtYzBkYzcyZmY0NWU3XkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_.jpg",
    "keywords": "german abroad,nazi occupied france,maquis,bicyclist,black market",
    "name": "Laissez-passer",
    "original_info": {
        "id": "Safe Conduct_2002",
        "name": "Safe Conduct",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "area01"
        },
        "dateCreated": "2003-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0269461/"
        },
        "name": "Safe (but slightly indulgent) Conduct.",
        "reviewBody": "It's really interesting that there are so few reviews on this film, as of 14.03.03! I caught it in a small University Film Theatre in Stoke-On-Trent, but surely this must have had a country wide release in France, so why not more reviews for this work from acclaimed French Film Director Bertrand Tavernier?\n\nThe film is nicely shot with an interesting story-line that looks at the lives of two men involved in the French Movie industry during the German occupation of Paris in the 40's. It has a frenetic camera style, and drops the viewer straight into the lives of the characters with no back-ground or build-up - so this, along with sub-titles (as I do not speak French), made for a bewildering first 15 minutes - however you soon adapt to this, and the lives of the two main characters are easy to follow.\n\nThere is a meandering, almost self-indulgent style to this film that made it a long 170 minutes for me. There would be lots of speedy camera moves around the great period movie set or Parisian streets, but no real point to these segments as it would not develop the story or characters. The character Jean Devaivre is always busy - so perhaps this is designed to capture some of that energy and the merciless deadlines of producing movies during this period. However, this style really grated on me after awhile and ended up being distracting, as there a very few \"stationary\" shots during the film.\n\nThe film explores life during extreme war-time experiences like Air-Raids, rationing, occupation, racism - and how people would deal with this. I refrain from using the term \"ordinary people\" as these characters (by there own admission) are French Bourgeoisie and almost exempt from the war as they are \"artists\". But they still feel compelled to resist in some way, and either do so by refusing to work for the German owned film company, or by aiding the French resistance where they can. Based on real events and people - this is the strongest aspect of the movie, however I felt this got lost in the meandering storyline, and blurred by the sub-plot concerning the politics of 40's film-making - with the lack of materials, writing talent and censorship. In my opinion it would have been better to concentrate on fewer aspects, had stricter editing and brought it in at 120 minutes - however that's just my view and story preference....\n\nAside from the above, this is a fine film and worth viewing if only to get away from the dominance of the Hollywood Movie Machine for a few hours. It will make you think, engage you and elicit some form of a reaction - as all good movie-making should."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Koch Lorber Films",
        "duration": "PT1M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1385234713",
        "name": "Safe Conduct",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2M4MDcwODUtNWY2Zi00MmYxLTk1ZjEtMmE3OGJkMzE0N2FhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2M4MDcwODUtNWY2Zi00MmYxLTk1ZjEtMmE3OGJkMzE0N2FhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:43:14Z",
        "url": "https://www.imdb.com/video/vi1385234713/"
    },
    "url": "/title/tt0269461/"
}