{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Greg Serano",
            "url": "/name/nm0784833/"
        },
        {
            "@type": "Person",
            "name": "Gina Ravera",
            "url": "/name/nm0712406/"
        },
        {
            "@type": "Person",
            "name": "Mary Mara",
            "url": "/name/nm0544721/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1027,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045933/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107062/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042087/"
        },
        {
            "@type": "Person",
            "name": "Doris Egan",
            "url": "/name/nm0250668/"
        },
        {
            "@type": "Person",
            "name": "Hans Rodionoff",
            "url": "/name/nm0118566/"
        },
        {
            "@type": "Person",
            "name": "Clive Barker",
            "url": "/name/nm0000850/"
        }
    ],
    "datePublished": "2006-09-16",
    "description": "In 1815 a monk, Tomas Alcala, unwittingly unleashes two female succubi, Munkar and Nakir, upon an unsuspecting 21st century. He is chosen by God to travel through the centuries and stop the demons' rampage.",
    "director": [
        {
            "@type": "Person",
            "name": "Joshua Butler",
            "url": "/name/nm0124991/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Fantasy",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA3MzI1MDg3NF5BMl5BanBnXkFtZTcwMTM0OTYyMQ@@._V1_.jpg",
    "keywords": "demon,monk,year 1815,dagger,priest",
    "name": "Saint Sinner",
    "original_info": {
        "id": "Saint Sinner_2002",
        "name": "Saint Sinner",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2004-06-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0313016/"
        },
        "name": "An Above Average Horror Movie",
        "reviewBody": "In 1815, the curious monk Tomas Alcala (Greg Serano) releases two evil female succubi called Munkar (Mary Mara) and Nakir (Rebecca Harrell) from a prison with the shape of a sculptured ball. The demons kill his brother eating his arm and escapes to the Twenty-First Century using a weird device stored in the monastery. Tomas is marked on his hand by a dagger, and the priests understand that, in accordance with God's wish, this would mean that he would be a saint and should travel in time to destroy the succubi, using the dagger as a kind of compass to direct him towards the demons. In the present days, he is helped by detective Rachel Dressler (Gina Ravera), who is grieving the loss of her father and believes on his words. Meanwhile, the two evil demons are feeding themselves of blood of human beings and fighting against Tomas and Rachel. I have just seen this movie on cable television and certainly it is above average. It has a reasonable screenplay and good special effects. The cast is not bad, but something is missing to be a good or excellent movie. Maybe with a better lead actor, and some more fun in the scenes of the two succubi might improve the story. Anyway, I am a great fan of horror movies and I found `Saint Sinner' a worthwhile entertainment, specially considering that it is made for TV. I do not know why most of the present horror movies uses the expression `God's Plan'. As far as I know, the Catholic Church does not have this cliché, but it is used in many stories to designate what God expects from a character or situation. Does God have a plan for the humankind? I find this expression not appropriated, but maybe it is my misunderstanding of language or lack of knowledge of religion. My vote is six.\n\nTitle (Brazil): `O Santo Pecador' (`The Saint Sinner')",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0313016/"
}