{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Gazzara",
            "url": "/name/nm0001262/"
        },
        {
            "@type": "Person",
            "name": "Denholm Elliott",
            "url": "/name/nm0001186/"
        },
        {
            "@type": "Person",
            "name": "James Villiers",
            "url": "/name/nm0898376/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2638,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064409/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003232/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0772829/"
        },
        {
            "@type": "Person",
            "name": "Howard Sackler",
            "url": "/name/nm0755274/"
        },
        {
            "@type": "Person",
            "name": "Paul Theroux",
            "url": "/name/nm0857623/"
        },
        {
            "@type": "Person",
            "name": "Peter Bogdanovich",
            "url": "/name/nm0000953/"
        }
    ],
    "datePublished": "1979-12-05",
    "description": "Jack Flowers, an American hustler in early-1970s Singapore, dreams of building a fortune by running a brothel and returning to the States to live a life of luxury.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Bogdanovich",
            "url": "/name/nm0000953/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGYxZGM3MTUtYzNlMC00MmFlLTllMzAtMDBiYTA3OWU3M2NhXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "american abroad,1970s,reference to fidel castro,reference to john f. kennedy,senator",
    "name": "Saint Jack",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2009-04-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079843/"
        },
        "name": "Ben Does Bogey",
        "reviewBody": "Saint Jack is a film short on plot, but long on character study, at least for the title character Jack Flowers, patron saint of the working girl in Singapore. Ben Gazzara plays the title role and if you can imagine Humphrey Bogart at his most existential running a brothel, than you've got Gazzara's character.\n\nAnd that's what Jack Flowers does, he served in Korea went to college on the GI bill and tried a hand at writing. He gave that up because he hadn't experienced enough of life in his own words, shipped out on a tramp freighter and wound up in Singapore managing a brothel. If he wanted to know about life, that's as good a place as any to get material for twenty books. And he's originally from Buffalo, New York, probably on the west side, unanglicized name Jack Fiore. \n\nGazzara's co-star is the city of Singapore in all its aspects, both the high and low end of it. Gazzara's got friends in high and low places, his most unusual friend is Denholm Elliott who is an accountant and sent by the front office in Hong Kong to do a yearly audit. They hit it off believe it or not, Elliott becomes kind of a role model of probity for Gazzara.\n\nHumphrey Bogart, starting in Casablanca did a lot of his films in exotic locations. But mostly he never got there, his films mostly done on studio back lots, The African Queen a shining exception. I'm sure Bogey would have jumped at the chance to do a location film in Singapore which in his day was involved in a nasty civil war after World War II.\n\nThere's not much of a story line, in fact Gazzara's not a terribly heroic character until the end when he does have an attack of conscience. For what that is you'll have to see Saint Jack.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0079843/"
}