{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carol Dempster",
            "url": "/name/nm0218781/"
        },
        {
            "@type": "Person",
            "name": "W.C. Fields",
            "url": "/name/nm0001211/"
        },
        {
            "@type": "Person",
            "name": "Alfred Lunt",
            "url": "/name/nm0526795/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 565,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054813/"
        },
        {
            "@type": "Person",
            "name": "Dorothy Donnelly",
            "url": "/name/nm0232704/"
        },
        {
            "@type": "Person",
            "name": "Forrest Halsey",
            "url": "/name/nm0357028/"
        }
    ],
    "datePublished": "1925-08-02",
    "description": "Judge Foster throws his daughter out because she married a circus man. She leaves her baby girl with Prof. McGargle before she dies. Years later Sally is a dancer with whom Peyton, a son of Judge Foster's friend, falls in love. Wh...",
    "director": [
        {
            "@type": "Person",
            "name": "D.W. Griffith",
            "url": "/name/nm0000428/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGM0ZTQ2ZGUtNzJiMy00N2Q3LWE5MmItZmM1NmJjMzczNGM2XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "circus,based on play",
    "name": "Sally of the Sawdust",
    "original_info": {
        "id": "Sally of the Sawdust_1925",
        "name": "Sally of the Sawdust",
        "year": "1925"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2011-04-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0016308/"
        },
        "name": "Technically well made but not exactly a comedy",
        "reviewBody": "Technically speaking, this movie is well done. The camera work is nice, the acting is pretty good and the story is well developed. Howeve, despite W.C. Fields in the lead, the film isn't particularly funny--and as a result, is very different from the 1936 version (\"Poppy\") which also starred Fields.\n\nThe film begins with a self-righteous family disowning their daughter when she runs off with a man they do not approve of nor were willing to consider for their fine New England family. Eventually, the woman ends up in a traveling carnival--pregnant. Later, she dies--leaving the baby with McGargle (Fields)--a shifty juggler and carney. The child (Sally) grows up in this less than honorable environment--totally unaware that she has rich relatives. As for Fields, he knows the truth but figures the child is better off not knowing--after all, they disowned her mother and were obviously not very nice people. Later, however, he decides that perhaps the carnival is not the best life for her, and so, broke, they head to Connecticut to find her family. But, some of them STILL are big butt-heads AND there's a romance waiting for Sally. What will happen next? Well, we sure know it won't involve comedy! While I am not a huge fan of \"Poppy\" (1936), it did have good comedy as well as being a rather sweet story. Here in the silent version, that sweetness and the laughs are missing and too much time is spent on her romance. As a result, it's decent but wholly unremarkable and a rather inauspicious film for Field--who looks a bit odd underneath that huge mustache. Mostly of interest to Fields completists.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0016308/"
}