{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frank Wolff",
            "url": "/name/nm0938231/"
        },
        {
            "@type": "Person",
            "name": "Salvo Randone",
            "url": "/name/nm0709951/"
        },
        {
            "@type": "Person",
            "name": "Frederico Zardi",
            "url": "/name/nm0953414/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3505,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039837/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042375/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033761/"
        },
        {
            "@type": "Person",
            "name": "Francesco Rosi",
            "url": "/name/nm0742940/"
        },
        {
            "@type": "Person",
            "name": "Suso Cecchi D'Amico",
            "url": "/name/nm0147599/"
        },
        {
            "@type": "Person",
            "name": "Enzo Provenzale",
            "url": "/name/nm0699039/"
        }
    ],
    "datePublished": "1962-03-01",
    "description": "The unclear and complicated twists between governal powers, independentist party and Mafia in the Sicily of the '40s culminate with the death of Salvatore Giuliano.",
    "director": [
        {
            "@type": "Person",
            "name": "Francesco Rosi",
            "url": "/name/nm0742940/"
        }
    ],
    "duration": "PT2H5M",
    "genre": [
        "Crime",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjZlMDE5ZGYtNzRmZS00YjRmLWEyNTAtZmVlYmQwYzU5ODIzXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "shot in a bed,firefight,post war italy,sentence,judgment",
    "name": "Salvatore Giuliano",
    "original_info": {
        "id": "Salvatore Giuliano_1961",
        "name": "Salvatore Giuliano",
        "year": "1961"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "federovsky"
        },
        "dateCreated": "2008-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055399/"
        },
        "name": "Matter-of-fact, yet punchy",
        "reviewBody": "Filmed in the actual Siciilian locations, this film is a fair attempt to strip away the myth surrounding bandit-cum-revolutionary Giuliano. In fact, he doesn't appear except as a gunned-down corpse at the beginning. The film winds back to unravel the events leading to his death, and forwards to its consequence. This is a clever method of achieving objectivity while at the same time subtly emphasising the man's elusive and mysterious qualities. To show Giuliano would have either been either hagiography or iconoclasm. The film rose above that and broadened its inquiry into the wider social and political context, effectively belittling him as the puppet of various forces jostling for position in Sicily after the war: bandits, police, local aristocracy, the Italian government, communists, and the Mafia.\n\nThis sets quite a challenge for itself, partly because of the vacuum at its centre, partly because of the obscurity and complexity of the real events. We are delivered to a chaotic courtroom to try to piece it together. The film finally latches onto Giuliano's lieutenant the only one who seems to know something of what is going on - but even he is silenced. It's all the more disturbing for the confusion. \n\nRosi is one of the best directors of crowds scenes and he gives raucous energy to any gathering of men, especially in the courtroom. He induces a kind of group hysteria in his actors; they are totally unaware of the camera and the result is an almost disturbing hyper-real feel (real crowds are dull in comparison)  it's really something to appreciate. To get into this film, you need to invest something in the passions of the various parties involved - if not sympathise with them, then at least understand them. Without this, the danger is that it all boils down to so much petty bickering. The same might be said of the Godfather, which clearly owes a huge debt to Rosi's style.\n\nInfluential then, somewhat brave, with some fine directorial moments, and an interesting history lesson. Hard to actually like, but hard not to admire."
    },
    "url": "/title/tt0055399/"
}