{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lee Eol",
            "url": "/name/nm1060442/"
        },
        {
            "@type": "Person",
            "name": "Ji-min Kwak",
            "url": "/name/nm1560374/"
        },
        {
            "@type": "Person",
            "name": "Yeo-reum Han",
            "url": "/name/nm1560630/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13815,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Samaritan Girl",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0119829/"
        },
        {
            "@type": "Person",
            "name": "Kim Ki-duk",
            "url": "/name/nm1104118/"
        }
    ],
    "datePublished": "2004-03-05",
    "description": "Jae-Young is an amateur prostitute who sleeps with men while her best friend Yeo-Jin \"manages\" her, fixing dates, taking care of the money and making sure the coast is clear. When Jae-Young falls in love with one of those man she ...",
    "director": [
        {
            "@type": "Person",
            "name": "Kim Ki-duk",
            "url": "/name/nm1104118/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWE0ZjZiZjQtMmY0Yy00YTQ0LTg3NWQtMmYzODM0NzVhMDcyXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "female nudity,girl kisses a girl,south korea,father,female rear nudity",
    "name": "Samaria",
    "original_info": {
        "id": "Samaritan Girl_2004",
        "name": "Samaritan Girl",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Boris-57"
        },
        "dateCreated": "2005-03-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0397619/"
        },
        "name": "Ki-Duk is getting very close to becoming my favorite director",
        "reviewBody": "This is my fourth film by Ki-Duk Kim (after Spring, Summer... / The Isle / 3-Iron), and he scores one minus (The Isle, despite stunning cinematography), one very good (Spring), and two absolutely magnificent. Despite the fact that I liked 3-Iron just a bit better because of the more straightforward story and consistent way of story telling, Samaria comes very close.\n\nI'm not going to spoil things for you, but I'd just point out that this is yet another highly symbolic film, so much in fact, that this second (symbolic) level is probably more easily understood than the basic story. Not that it's complicated, it's just that story and meaning are not as closely interwoven as in 3-Iron, where the overlap between the two made possible an ambiguous reality that led to sublimation. Here, it takes a while for the two levels to touch.\n\nThe feeling following 3-Iron was that of reaching an asymptote - only the infinite was beyond. In Samaria, you feel like some serious stuff happened but what's done is done and the road lies open. We're at a starting point, which is not quite zero but feels like it. Well now, you can hardly call that a spoiler 'cause I hardly understand it myself. But you'll see what I mean after seeing it.\n\nThe story, which seems to start out as something different that what it turns out to be, must be one of the most poignant symbolic depictions of the point at which a parent has to let his/her kid go and realise he/she's not needed anymore - or not like before. Also, silence, without being as overwhelming as in 3-Iron, plays an important role. In 3-Iron, good stuff happened because of silence; here, a lot of not so good things happen because of it, but some good things can happen in spite of silence. The ending can be very sad or neutral or have the potential for hope, if you choose my story interpretation. But who am I?\n\nWhat? Still reading this? - off you go to the video store. Chop chop!\n\nNote: does anyone realise just how brilliant Kim Ki-Duk is when shooting indoor scenes?! Framing, camera movement, light - you name it - sheer perfection."
    },
    "url": "/title/tt0397619/"
}