{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hiroshi Aoyama",
            "url": "/name/nm0031878/"
        },
        {
            "@type": "Person",
            "name": "Jun Hamamura",
            "url": "/name/nm0357307/"
        },
        {
            "@type": "Person",
            "name": "Osamu Hitomi",
            "url": "/name/nm3470801/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1774,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Samurai Spy",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007001/"
        },
        {
            "@type": "Person",
            "name": "Yoshiyuki Fukuda",
            "url": "/name/nm0297993/"
        },
        {
            "@type": "Person",
            "name": "Koji Nakada",
            "url": "/name/nm1794091/"
        }
    ],
    "datePublished": "1965-07-10",
    "description": "The legendary samurai Sasuke Sarutobi gets caught in a web of political intrigue, deception and espionage during the early 17th century.",
    "director": [
        {
            "@type": "Person",
            "name": "Masahiro Shinoda",
            "url": "/name/nm0793983/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzIzZTQ1YjEtNzQzZC00NzcyLWI2YjItMmQ1M2M2ODBhZmNkXkEyXkFqcGdeQXVyNjU3MjE2MzI@._V1_.jpg",
    "keywords": "japanese new wave,kiss,foreplay,female nudity,samurai",
    "name": "Ibun Sarutobi Sasuke",
    "original_info": {
        "id": "Samurai Spy_1965",
        "name": "Samurai Spy",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jrd_73"
        },
        "dateCreated": "2019-08-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059303/"
        },
        "name": "Heavily Plotted Samurai Film With A Few Good Scenes And A Good Lead Actor",
        "reviewBody": "Samurai Spy was the one film in Criterion's DVD box of four samurai films (called Rebel Samurai) that I had never before seen. While I would slightly recommend the film, it is a slow going motion picture with a lot of talk and intrigue.\n\nI know very little about Japanese history, so some of the film's plot was lost on me, but basically the film is set during a period of cold war between the two groups that control Japan. Sasuke (Koji Takashasi) belongs to a clan that is neutral. Sasuke has been in battle before and the fighting has left him tired and numb. He no longer sees the point in battles. . . this will not stop him from killing a couple dozen people during the film's running time. On the road, Sasuke meets up with an old friend who is planning the defection of a high ranking spy of one of the ruling clans to its rival. This friend only cares about the money he will make, but does offer Sasuke a portion if he helps with defection. Sasuke refuses, yet does come to his friend's rescue during an ambush. Slowly, Sasuke finds himself drawn into the plot somewhat against his will.\n\nSamurai Spy benefits greatly from Koji Takahasi's performance as a weary samurai tired of killing. In addition, the film also has some impressive moments. The deadliest villain dresses as a white ninja and is quick to show off his fighting prowess. The climatic fight between him and Sasuke is quick and startling. Director Masahiro Shinoda places a boy clutching a dead bird in the background of some of the scenes. I have no idea what the boy is supposed to represent, but the distraction is an asset. Finally, the film stages one excellent sustained action set piece where Sasuke has to rescue two prisoners.\n\nIn spite of these strengths, I could only get so interested in Samurai Spy. The plot incorporates a lot of elements. There is the initial defection plot, the persecution of Christians, a murder mystery element, a broken family subplot, two love interests, and two masterful swordsman rivals that Sasuke has to face. Shinoda (admittedly not one of my favorite Japanese directors) does only a fair job at balancing all of these elements. The ending should have meant more than it does considering all that happened leading up to it.\n\nSamurai Spy is not a bad film. I certainly can't say I was bored with it, even with the slow pace. I don't think I would watch it a second time though. Others might like the film more than I did.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0059303/"
}