{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Toshirô Mifune",
            "url": "/name/nm0001536/"
        },
        {
            "@type": "Person",
            "name": "Yôko Tsukasa",
            "url": "/name/nm0875362/"
        },
        {
            "@type": "Person",
            "name": "Gô Katô",
            "url": "/name/nm0441351/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13211,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "alternateName": "Samurai Rebellion",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0096017/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Shinobu Hashimoto",
            "url": "/name/nm0368074/"
        },
        {
            "@type": "Person",
            "name": "Yasuhiko Takiguchi",
            "url": "/name/nm0847668/"
        }
    ],
    "description": "The mother of a feudal lord's only heir is kidnapped away from her husband by the lord. The husband and his samurai father must decide whether to accept the unjust decision, or risk death to get her back.",
    "director": [
        {
            "@type": "Person",
            "name": "Masaki Kobayashi",
            "url": "/name/nm0462030/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTgyZDM1ZDctNzQzZS00NzBjLWI2ZTYtNjY2YzJjNTBkNTg2XkEyXkFqcGdeQXVyNjgxMDA4OTI@._V1_.jpg",
    "keywords": "feudal japan,forced marriage,feudal lord,concubine,sword fight",
    "name": "Jôi-uchi: Hairyô tsuma shimatsu",
    "original_info": {
        "id": "Samurai Rebellion_1967",
        "name": "Samurai Rebellion",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mlredr"
        },
        "dateCreated": "2005-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061847/"
        },
        "name": "One of the greatest films ever",
        "reviewBody": "If there is one thing to be said about this film, it is excellent in every detail - story, direction, cinematography, music, action, I could go on and on. There are few film makers who can turn a simple tale of feudal injustice into such a moving drama. \n\nAs the movie progresses, Toshiro Mifune's character slowly transforms into an epic hero - for his sense of honour and his love for his Son for which he is ready to defy his own honour-bound Samurai's oath, to rebel against the very world he lives in. The heroism and integrity of his sacrifice are presented in exquisite detail with poignant dialogue (even in subtitles). This in itself is an amazing achievement when the compared to the trend nowadays is to try to impress the viewer with visual trickery or mind-numbing fight sequences with excessive violence. \n\nI truly appreciate Masaki Kobayashi for the respect he shows to his viewer's intelligence, for intelligently presenting the true heroism of a human standing up against impossible odds.As an exercise, you may compare this movie with the over-budgeted disaster of a Hollywood movie called \"The Last Samurai\" to know what I am talking about. With an excellent story and great characters with potential for true heroism, \"The Last Samurai\" is one of the dumbest movies ever made. \n\nThis is also no dumb \"You killed my master so I will kill you\" Hong Kong movie or a \"Lone Wolf\" movie with it's absurd and senseless blood-spilling. All of you Action movie fans, this is also not a beat-each-other-to-pulp or chop-you-up-like-a-fish movie. \n\nThe fight sequences are excellently executed and are almost the best that I have seen so far (The fight sequences in Harakiri must be THE BEST ever).The character of Tatsuya Nakadai is interesting as well in that it is not really clear what his true intentions are - he seems torn between his selfish desire to better Mifune's character in a duel bound up with his loyalty to his clan against his honour as a friend. Warning: So watch it if you enjoy an excellently told social drama and you will see what makes a masterly piece of art.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0061847/"
}