{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "John Agar",
            "url": "/name/nm0000730/"
        },
        {
            "@type": "Person",
            "name": "Adele Mara",
            "url": "/name/nm0544711/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10829,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020540/"
        },
        {
            "@type": "Person",
            "name": "Harry Brown",
            "url": "/name/nm0113689/"
        },
        {
            "@type": "Person",
            "name": "James Edward Grant",
            "url": "/name/nm0335455/"
        }
    ],
    "datePublished": "1950-03-01",
    "description": "Haunted by personal demons, Marine Sgt. John Stryker is hated and feared by his men, who see him as a cold-hearted sadist. But when their boots hit the beaches, they begin to understand the reason for Stryker's rigid form of disci...",
    "director": [
        {
            "@type": "Person",
            "name": "Allan Dwan",
            "url": "/name/nm0245385/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Action",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzgxNGY1OWUtMTg1ZS00NjlhLWFjYzYtMjA0MzI1YzFlYTZiXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "shot to death,pacific war,u.s. military,military uniform,gunfire",
    "name": "Sands of Iwo Jima",
    "original_info": {
        "id": "Sands of Iwo Jima_1949",
        "name": "Sands of Iwo Jima",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2006-11-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041841/"
        },
        "name": "Exploiting A Symbol",
        "reviewBody": "Although Clint Eastwood's recent Flags of Our Fathers has told the real story about the flag raising at Iwo Jima, it hasn't diminished any of the impact that Sands of Iwo Jima has, either back when it was released or viewed today.\n\nIn fact because the three surviving flag raisers, Joseph Bradley, Rene Gagnon, and Ira Hayes all were in this film it's even more proof of how the symbolic flag raising has become mythologized.\n\nOf course the real heroism was in capturing the island that was less than a 1000 miles from the main islands of Japan and the airfields on Iwo Jima that could be used by our bombers for land based flights. It took about a month to do that, the flag was raised on the fifth day.\n\nI read a history of the United States Marine Corps from it's formation during the American Revolution. Over the course of its history it was interesting to learn that the Marines many times were threatened with extinction, to be folded into either the army or navy right up to and including World War I.\n\nRight after World War I a very farsighted man named John A. Lejeune became the Marine Corps Commandant and he saw that we would be in a war in the Pacific with the Japanese as our foes. He also saw that the survival of the Marines as an entity involved them training for a very specialized kind of mission, amphibious warfare. He started training them for that and come World War II they were certainly ready. \n\nJohn Wayne as Sergeant Striker got one of his most memorable parts of his career in Sands of Iwo Jima. Striker is a tough as nails Marine Corps lifer whose got a job to whip a lot of recruits into shape for the later Pacific landings after Guadalcanal. He's also got one lousy personal life as his wife's left him and taken their son.\n\nWayne got his first Oscar nomination for Best Actor in this part. There's a couple of other films he should have gotten a nomination for, but that's another story. Among his competition in 1949 was Kirk Douglas for Champion, Richard Todd for The Hasty Heart, and Gregory Peck for Twelve O'Clock High. Note three of the nominees were for World War II related films. But the winner that year was Broderick Crawford for All the King's Men. At least Peck and Wayne both got Oscars later in their careers.\n\nJohn Agar who was trying to carve out a reputation as being more than Mr. Shirley Temple back then plays the son of a former commander of Wayne's who has a problem with his Dad and takes it out on Wayne attitude wise as a surrogate father. Julie Bishop and Adele Mara play women drawn to both Wayne and Agar respectively.\n\nOf the supporting cast who play members of Wayne's platoon, my favorite is Wally Cassell, the wisecracking city kid who finds a tank to help his platoon out during a sticky situation.\n\nFlags of Our Fathers teaches us about how the flag raising symbolism became part of the Marine Corps heritage. Sands of Iwo Jima exploits that symbol in the best sense of the word. After almost sixty years, it's still a fine film with a grand performance by the Duke.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Republic Pictures",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi276889881",
        "name": "Sands of Iwo Jima",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzJlYTQ3NjgtMzU0ZC00ZGJmLTgwYjUtODFjYjYyNmQ2ZmQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzJlYTQ3NjgtMzU0ZC00ZGJmLTgwYjUtODFjYjYyNmQ2ZmQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:42:08Z",
        "url": "https://www.imdb.com/video/vi276889881/"
    },
    "url": "/title/tt0041841/"
}