{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Toshirô Mifune",
            "url": "/name/nm0001536/"
        },
        {
            "@type": "Person",
            "name": "Tatsuya Nakadai",
            "url": "/name/nm0619938/"
        },
        {
            "@type": "Person",
            "name": "Keiju Kobayashi",
            "url": "/name/nm0462013/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 39160,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Sanjuro",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0095216/"
        },
        {
            "@type": "Person",
            "name": "Ryûzô Kikushima",
            "url": "/name/nm0452878/"
        },
        {
            "@type": "Person",
            "name": "Hideo Oguni",
            "url": "/name/nm0644823/"
        },
        {
            "@type": "Person",
            "name": "Akira Kurosawa",
            "url": "/name/nm0000041/"
        }
    ],
    "datePublished": "1963-05-07",
    "description": "A crafty samurai helps a young man and his fellow clansmen trying to save his uncle, who has been framed and imprisoned by a corrupt superintendent.",
    "director": [
        {
            "@type": "Person",
            "name": "Akira Kurosawa",
            "url": "/name/nm0000041/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmY3MDlmODctYTY3Yi00NzYyLWIxNTUtYjVlZWZjMmMwZTBkXkEyXkFqcGdeQXVyMzAxNjg3MjQ@._V1_.jpg",
    "keywords": "massacre,diversionary tactic,corruption,samurai,warrior",
    "name": "Tsubaki Sanjûrô",
    "original_info": {
        "id": "Sanjuro_1962",
        "name": "Sanjuro",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "krasik"
        },
        "dateCreated": "2002-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056443/"
        },
        "name": "Physchology of leadership, the senselessness of war",
        "reviewBody": "Leadership. Sanjuro is able to lead men because he appears confident, and is confident. His presence subjugates men, as a man's presence subjugates boys. We see here how a group comes to have a leader. First one man stands out against him, the competitor for leadership, but Sanjuro's intuition and actions put him ahead. There is a beautiful marked difference between Sanjuro and the men. He is the lazy quiet tiger, seemingly passive yet containing an immense power - a tightly drawn bow. The men are barking puppies, energy spilling over, but to no good end.\n\nKurosawa presents a couple challenges to the viewer. THere is a terrible absurdity in the killing of all these men, for it becomes quiet clear with the symbol of the prisoner, that the average soldier is a frightened herd animal, not good or evil, but cowardly. Sanjuro recognizes this but has no choice, for he wants to live, and so must kill. Thus he must even kill the young men who he helps, when they foolishly come after him. The prisoner is won over by the old lady - so we see an almost christian ethic. In the tensions of the film one feels that the people, riled up by lies to fight for the enemy, quickly become targets of the just young men's swords - luckily it does not come to this, but one recognizes the horrible possibility and inevitability of such a struggle. Thus we are faced with a critic of war - men, scared like cattle battle under the flag of corrupt leaders, and those that may love them must kill them, if they are not to die by sword, or become slaves to tyrants.\n\n\"stupid friends are worse than enemies\" For you know who your enemies are, and that they wish to destroy you.\n\nIn Sanjuro we also see the soldier, so long in battle that he is unable to live a normal life. He can not wear the house kimoto, he is to bound up in fighting - he is samuri, warrior, and he cannot escape this, much as Achilles cannot return home to Pthia. And we sense Sanjuro must whilt in the easy domestic life, for his is the road of struggle. The pleasant scent of the straw in the barn, the pretty camillias are still able to touch him, but he cannot enjoy them; he is a soldier, and therefore his sensitivities must yeild to the demands of war.\n\nWe see only one man worthy standing with Sanjuro, and that is the uncle, the chamberlain, the horseface. These to stand out as burning stars against a massive black sky - the rest is horrifying; the chaos of tyranical men and the fear crazed soldiers, their supplicants."
    },
    "url": "/title/tt0056443/"
}