{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Errol Flynn",
            "url": "/name/nm0001224/"
        },
        {
            "@type": "Person",
            "name": "Olivia de Havilland",
            "url": "/name/nm0000014/"
        },
        {
            "@type": "Person",
            "name": "Raymond Massey",
            "url": "/name/nm0557339/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3973,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Robert Buckner",
            "url": "/name/nm0118758/"
        }
    ],
    "datePublished": "1940-12-28",
    "description": "In 1854, Jeb Stuart, George Custer and other graduates from West Point are posted to Kansas to help pacify the territory before railroad construction to Santa Fe can resume.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Curtiz",
            "url": "/name/nm0002031/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "War",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcxNzk0NTEtMGYzYi00MDdjLWJlOGQtMmJlOGU0ODZiNzhkXkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_.jpg",
    "keywords": "slavery,american civil war,steam locomotive,graduation ceremony,napoleon bonaparte quotation",
    "name": "Santa Fe Trail",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2007-05-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0033021/"
        },
        "name": "In The Tradition of Gone With the Wind",
        "reviewBody": "When Santa Fe Trail was released in 1940 it was to general critical acclaim. Though it is in no way a classic like Gone With the Wind, it's view of the coming Civil War is not too dissimilar from the David O. Selznick film that also had Olivia DeHavilland as one of its stars. It was a popularly held view of the time, the abolitionists were well intentioned rabble rousers who brought on the Civil War and as Errol Flynn as J.E.B. Stuart says, the south will settle the slavery issue in its own time.\n\nBack in the day even in A westerns like Santa Fe Trail, liberal use of the facts involving noted historical figures was taken. The fact that Stuart, Custer, Longstreet, Pickett, Sheridan, and Hood would all graduate West Point in the same class was really a minor bending of the rules. The following year with Errol Flynn as Custer in They Died With Their Boots On, they got Custer's graduation class right, but then compounded his life with more errors.\n\nOne interesting fact that no one mentions in this film is Henry O'Neill as the real life Cyrus K. Holliday (1826-1900) who considerably outlived just about everyone portrayed in the film. He's of critical importance in Kansas history as having built the Santa Fe railroad. His children neither went to West Point as William Lundigan, did graduating with all these Civil War heroes, nor did his daughter wind up marrying one.\n\nOlivia DeHavilland playing her usual heroine, gets out of the crinoline for a bit as a Calamity Jane type daughter to Henry O'Neill. I have to say she showed quite a bit more spunk than her normal range of leading ladies at the time at Warner Brothers. She certainly Errol Flynn and Ronald Reagan as George A. Custer on their toes.\n\nIf people remember anything at all about Santa Fe Trail today it is Raymond Massey as the fanatical John Brown. Yet even there, Brown has his hypocritical moments when he's quite ready to let a barn full of recent runaway slaves burn down so he can kill Errol Flynn in it. It doesn't ring true with the character as defined by Massey, I fault the scriptwriters there. Massey repeated his John Brown character in the later Seven Men From Now. Other than Abraham Lincoln it is the role that actor is most identified with.\n\nAs an action western though, Santa Fe Trail can't be beat. The battle scene with the army breaking John Brown's siege at Harper's Ferry is well staged. You really do think you are at Harper's Ferry watching a newsreel.\n\nThough it never was history and hasn't worn well in its interpretation, western fans will still like Santa Fe Trail.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this western",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1033700889",
        "name": "Santa Fe Trail",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWI3ODQ2ZjktNDE2NS00MDExLTgxNjAtMWRiMjg4ZmM1N2NlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWI3ODQ2ZjktNDE2NS00MDExLTgxNjAtMWRiMjg4ZmM1N2NlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-07-11T03:25:55Z",
        "url": "https://www.imdb.com/video/vi1033700889/"
    },
    "url": "/title/tt0033021/"
}