{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aamir Khan",
            "url": "/name/nm0451148/"
        },
        {
            "@type": "Person",
            "name": "Naseeruddin Shah",
            "url": "/name/nm0787462/"
        },
        {
            "@type": "Person",
            "name": "Sonali Bendre",
            "url": "/name/nm0007114/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26135,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0164560/"
        },
        {
            "@type": "Person",
            "name": "Hriday Lani",
            "url": "/name/nm1195250/"
        },
        {
            "@type": "Person",
            "name": "John Mathew Matthan",
            "url": "/name/nm0559877/"
        },
        {
            "@type": "Person",
            "name": "Pathik Vats",
            "url": "/name/nm1597736/"
        }
    ],
    "datePublished": "1999-04-30",
    "description": "After his brother is killed and father severely injured by terrorists, a young med student quits his studies to join the Indian Police Service to wipe out the terrorists.",
    "director": [
        {
            "@type": "Person",
            "name": "John Mathew Matthan",
            "url": "/name/nm0559877/"
        }
    ],
    "duration": "PT2H54M",
    "genre": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTljOTU3MjQtMjVjYS00NWM5LTljZjQtMjhiM2JmMDYxZjZhXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "police,terrorist,face smashed against a mirror,singer,terrorism",
    "name": "Sarfarosh",
    "original_info": {
        "id": "Sarfarosh_1999",
        "name": "Sarfarosh",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "devil.plaything"
        },
        "dateCreated": "2002-05-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0200087/"
        },
        "name": "A good movie, very good action scenes",
        "reviewBody": "The back of the DVD case claims that Sarfarosh is the first Hindi movie to take a look at some of the real reasons behind terrorism and insurgency in India. This seems like a fairly radical claim that I doubt they could really defend even though my knowledge of Hindi cinema is still far from complete. DIL SE seemed like a pretty honest examination of the subject to me, and that was several years earlier. I don't want to hold the claims on the DVD case against the movie though, as SARFAROSH is certainly an interesting take on the subject.\n\nAjay Singh's brother is killed and his father brain damaged by terrorists when Ajay is a small boy, because his father was going to stand up against them in court or something. Ajay takes this to heart (as you would), and as a young adult he devotes himself to becoming a police inspector and fighting against crime, and terrorists in particular. The movie is essentially about one case, where Ajay has to get to the roots of an operation smuggling guns into the country. The operation is backed by a Pakistani general, with the rationale that arming criminals in India is a cheap but effective way of waging war. The movie does push a fairly unbalanced \"Pakistan aggressors, India = victims\" message, though it is very careful/keen not to equate this with Muslim vs Hindu and turn it into a religious issue.\n\n The movie is fairly serious throughout - although there is a romantic interest (the lovely Sonali Bendre), it's not overplayed and does serve a useful function by building the character of Ajay and putting the case in the context of his life. For the most part though, the movie is focussed on the investigation and the encounters between the police and the criminals as they trace the criminal network closer to its roots. It's quite an action packed movie, and features some of the best action scenes I've seen in an Indian movie. No bullet ballet or kung fu, but quite realistic fights and shootouts that are never-the-less very well choreographed and filmed. The movie bears an 18 rating, because the action does get quite violent. A lot of people die in the course of the movie, and a few of them in quite gruesome ways. One thing I've noticed in quite a lot of Asian movies is that police violence is treated quite sympathetically - even as quite noble. The cops in Sarfarosh don't mess around - if threatening, beating or framing a criminal is the best way to get a result then they don't hesitate to do so. If a criminal happens to get killed in the course of an operation then they don't seem terribly upset either, unless it was somebody they wanted to interrogate .\n\nAjay Singh is played by Aamir Khan, an actor I haven't come across before. He's not a pretty boy by any means, but he does a very good job with the character. It's a good character too - well developed and believable, honorable without being sanctimonius. The rest of the cast all do a good job too, although Sonali Bendre doesn't have a lot to do except look pretty and dance around in the musical numbers.\n\nThe script for the movie is very tight, with both the criminals and the cops operations and motivations seeming quite convincing. The movie does veer a little towards preaching in places, especially towards the end, but this is forgivable. The direction is very confident and focussed, and sound and cinematography throughout are good throughout.\n\nAll round, a good movie worth seeking out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "After his brother is killed and father severely injured by terrorists, a young med student quits his studies to join the Indian Police Service to wipe out the terrorists.",
        "duration": "PT1M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi919125785",
        "name": "Sarfarosh (1999) Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGNjNTg2OWYtNTU0ZC00ZDQ0LTg2ZjQtMzJjNDcwNGQxYWNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGNjNTg2OWYtNTU0ZC00ZDQ0LTg2ZjQtMzJjNDcwNGQxYWNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-11-19T12:23:45.029Z",
        "url": "https://www.imdb.com/video/vi919125785/"
    },
    "url": "/title/tt0200087/"
}