{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Russ Tamblyn",
            "url": "/name/nm0848560/"
        },
        {
            "@type": "Person",
            "name": "Scott Brady",
            "url": "/name/nm0103722/"
        },
        {
            "@type": "Person",
            "name": "John 'Bud' Cardos",
            "url": "/name/nm0004616/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1116,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003091/"
        },
        {
            "@type": "Person",
            "name": "Greydon Clark",
            "url": "/name/nm0163990/"
        },
        {
            "@type": "Person",
            "name": "Russ Tamblyn",
            "url": "/name/nm0848560/"
        }
    ],
    "datePublished": "1970-05-08",
    "description": "The \"Satans\" are a very cruel biker gang led by Anchor. The gang goes to a diner in the middle of nowhere in the California desert where they begin to terrorize Lew and his patrons and his waitress, Tracy. After a little killing, ...",
    "director": [
        {
            "@type": "Person",
            "name": "Al Adamson",
            "url": "/name/nm0011467/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWZhOGRjNzAtMmEzYy00NzYzLTkxYjQtZGEwNDJkZWEyZmRjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "biker gang,motorcycle gang,bikersploitation,criminal,sadistic biker",
    "name": "Satan's Sadists",
    "original_info": {
        "id": "Satan's Sadists_1969",
        "name": "Satan's Sadists",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2006-01-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064939/"
        },
        "name": "the biker movie pathos, by Al Adamson",
        "reviewBody": "In order to get any enjoyment or entertainment, or just dumb-fun in a B-movie (if that) kind of way, like Satan's Sadists (not inappropriately released on DVD in some circles by Troma), is to take into context that it was, of course, the late 60's, and it remains in the sub-genre that is the biker-movie. I almost hesitate to slap the label 'exploitation flick' on it because one would have to take completely into mind what exploitation entails. Maybe there were many (maybe mostly) good-hearted bikers like the ones in Easy Rider that wanted nothing more than to get stoned and ride their wheels without too much trouble. But that is in a particular kind of movie that tries (and succeeds) to rise above the expectations of the enclave of biker movies. For the most part, as with Satan's Sadists and many others, a biker gang with a cool sounding name goes into a town, bothers the habitants to a point of total suspense and shock, and the filmmaker may or may not try to dig a little under the surface, go beyond the expectations up to a point.\n\nOne of the things that makes Satan's Sadists work, up to a point, is that producer/director Adamson usually doesn't mistake what it is that he's making. A film like this, when it played (where and if of course being part in question), would just be used as fodder for make-out sections and beer contests for those in the cars at the drive-ins, just good enough to not make anyone start chucking things at the screen. Adamson brings forth all the ideal elements- a gang of six (including the perennial grungy/sexy female) with attitude braced in their eyes and sunglasses, the older straight-laced couple, the good-looking younger couple, and plenty of room for tracking, driving shots of bikes. The gang here of the title run into a cop and his wife, a waitress, another young guy and the owner of a small pit stop in the middle of the California desert.\n\nBasically, describing the plot would be moot; say enough that it is as much of a usual biker film as it is a revenge picture (and usually the two go one in the same with these movies). To Adamson's credit, given a group of non-professional actors (or B/C/D movie actors) that are hit or miss (the bikers are all alright, as are the cop and his wife, but some of the other parts of the younger women are pretty bad), he tends to push some of the boundaries of what can be done within the framework of the structure. We have an idea of what will go on, of course, after a crucial moment in the film, but there are little things, like when the bikes brake-down in the desert, or when other minor female characters are introduced all of a sudden in the desert, or the impromptu dance scene in the restaurant (though that is a staple in many of these flicks, a cool one at that). It's when Adamson sometimes kids himself with what he's doing that it steers away, like a little mini-speech given by the groups leader about 'the man' versus the 'love' generation before a certain murder takes place. And the music, while with a cool opening number, is draining aside from an interesting drum solo here and there.\n\nI wouldn't say to start with Satan's Sadists if you're just starting to get into these kinds of films, as it is relatively hard to find and Adamson, while not without his cult fan-base, was unknown to me before seeing the film and really does nothing more than make your standard genre movie. However it's not to say that within the 'standards' there aren't some creative flourishes. I liked how there was always the one character clinging onto getting stoned and tripped whilst the others went on with their tough business, who even provides a couple of laughs. And where the film heads to is exciting on the most primitive, fast-food sort of level. There are certainly 'better' movies out there, probably with better acting and better use of music and locations. But at least in Adamson there is a little experimentation and touches of daring in his style; little insert close-ups and zooms/pans are interesting, and at times a certain zaniness tries to work its way into the steady shots. If a biker picture, in all of its likely exploitive tendencies and cardboard psychology, is more about attitude and using what is there within the limitations, Satan's Sadists is not bad, though not great.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0064939/"
}