{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kurt Raab",
            "url": "/name/nm0704624/"
        },
        {
            "@type": "Person",
            "name": "Margit Carstensen",
            "url": "/name/nm0141380/"
        },
        {
            "@type": "Person",
            "name": "Helen Vita",
            "url": "/name/nm0006742/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2053,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Satan's Brew",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0089865/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004806/"
        },
        {
            "@type": "Person",
            "name": "Rainer Werner Fassbinder",
            "url": "/name/nm0001202/"
        }
    ],
    "datePublished": "1977-03-02",
    "description": "A famous poet who hasn't written a word in two years unconsciously plagiarizes the work of Stefan George, while dealing with several mistresses, his dim-witted brother, and a murder investigation.",
    "director": [
        {
            "@type": "Person",
            "name": "Rainer Werner Fassbinder",
            "url": "/name/nm0001202/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjRhNjkwY2QtY2E4Ni00OGVjLWExNjgtOWIwYWFlYTg2OGE5XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "narcissism,pawned furniture,megalomaniac,money,public toilet",
    "name": "Satansbraten",
    "original_info": {
        "id": "Satan's Brew_1976",
        "name": "Satan's Brew",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2008-12-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075165/"
        },
        "name": "\"F*** flies\"",
        "reviewBody": "According to the description on the DVD I received of Satan's Brew from netflix this was the first actual full-on comedy that Rainer Werner Fassbinder directed. I imagine watching the film that it was something that was building up in him and basically, in a near literal expression in his art, exploded. This film is about as kinetic and sharp-tongued as Marx Brothers, as insane as the best Mel Brooks, and even has some of that completely f***ing gonzo sensibility that one only finds with other tales-of-writers like Fear and Loathing in Las Vegas which has little to do with actual writing and mostly to do with how far its creative genius will go in excess and other \"shenanigans.\" I can probably make more comparisons, but it might be unfair to the success Fassbinder pulls off here: it's as inspired as all of those, but it's all him, his natural excesses and *big* personality coming out in the cracks (big cracks) of the story and the character Walter (Kurt Raab).\n\nSimply put, this movie is not just funny, it's hysterical. It's so hysterical that you'll laugh at yourself while laughing at what's going on on screen. Fassbinder's tale of a writer who hasn't written in years, spends all of his advance money on whores, has a lunatic brother obsessed with flies and having his way with them, has a wife whom acts more like a mother than anything (albeit she reminds him it's been 17 days... no, 18 days since sex last happened), and then at the end of his rope financially and mentally and with a really (more than relatively) crazy sycophantic woman following him everywhere he goes turns to pretending he's a homosexual 19th century poet, is like a loaded baked potato. Really loaded; you'll wonder where something might suddenly pop, until something else interesting happens - Fassbinder will write his characters and direct his actors in moments of seriousness, taking us into moments that do feel real and not just super absurd pieces of German theater.\n\nSuffice to say it helps that Fassbinder has the exact right person to play this unlikely (very unlikely) anti-hero with Walter: Kurt Raab has a look that is devilish, diabolical, slightly seductive and with the possibility of violence or the unexpected at the drop of a hat. He's also as funny as the material can get him to be, which includes saying random lines like to a leering restaurant patron, \"Quiet, you person!\" Sometimes just his demeanor is amusing, and also frightening and highly charged; he is in a way like the Cartman ala South Park for Fassbinder, as a figure who is pretty twisted, verging on if not just evil (dont assume anything with that opening murder!), and surrounded by a league of people who he can manipulate or feel crossed by or just not know what to do with (his \"biggest fan\" whom he make walk out in the cold in a thin raincoat or stay under a friend's rug). Just watching him react to the brilliant actor playing so over the top the fly-fixated brother is classic stuff.\n\nTowards the end it becomes grim, and possibly stranger than ever. It's also overall not something you'll want to show your mother (unless, you know, your mother is a Fassbinder fan or into crazy German cinema). But for a certain niche audience it's about as uproarious as any anarchic comedy, and in fact as beautifully directed as anything of the great slapstick or surrealist days. In this case, they go hand in hand; it's one of the director's very best. A+",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0075165/"
}