{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alexander Brickel",
            "url": "/name/nm1451866/"
        },
        {
            "@type": "Person",
            "name": "Katheryn Winnick",
            "url": "/name/nm0935395/"
        },
        {
            "@type": "Person",
            "name": "Stephen Graham",
            "url": "/name/nm1726207/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6278,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0118889/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072994/"
        },
        {
            "@type": "Person",
            "name": "Jeff Lieberman",
            "url": "/name/nm0006639/"
        }
    ],
    "datePublished": "2004-05-06",
    "description": "A naive young boy unknowingly becomes the pawn of a serial killer.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeff Lieberman",
            "url": "/name/nm0006639/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWNhNzcxOGUtNjkyNy00ZTUzLTg3YmQtNmQwNzMyMzZkZWIyXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "slasher,boy,boy wears eyeglasses,handheld game,new boyfriend",
    "name": "Satan's Little Helper",
    "original_info": {
        "id": "Satan's Little Helper_2004",
        "name": "Satan's Little Helper",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Void"
        },
        "dateCreated": "2006-07-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0380687/"
        },
        "name": "Pitch black humour and laughs throughout",
        "reviewBody": "I had really low expectations going into this film as I haven't liked either of the Jess Lieberman films I'd seen previously (Squirm, Just Before Dawn); but what I found with this film was an inventive and moderately amusing little film that benefits from a talented cast and a clever screenplay. Satan's Little Helper is a pitch black horror comedy that finds time to poke fun at the American institution of Halloween, as well as ideas such as 'video games create killers'. The central idea is more than a little bit silly, but it also shows great imagination; as the idea of having a young boy unwittingly help a serial killer isn't immediately obvious, and the director does a good job of manipulating his characters into the situation he wants them in. Satan's Little Helper revolves around Douglas Whooly; a young boy obsessed with the video game, coincidentally called 'Satan's Little Helper', which was bought for him by his father. After witnessing the local serial killer arranging his victims outside his house, the kid mistakes it for an act and offers his help to the killer; which is duly accepted.\n\nThe fact that the lead character is a young boy gives the film a sort of childish horror feel; and Jeff Lieberman brilliantly offsets this with a number of amazingly gruesome scenes, which see things such as a cat being used to write 'boo' on the wall in blood, as well as intestines being used to tie a knot and a particularly grisly stabbing sequence towards the end. The director has also managed to pull in some good B-movie talent to act out his movie. Amanda Plummer is the biggest name on the cast list, and she bodes well with her role as slightly odd mother. The beautiful Katheryn Winnick was the highlight for me, and no doubt most other male audience members, as she looks great and her acting isn't bad either. Child actor Alexander Brickel, and Stephen Graham round off the central cast and overall, this movie doesn't have many problems where the acting is concerned. Jeff Lieberman's sense of humour may not be to everyone's taste; but I found it delightful, and the way the screenplay constantly harks back to earlier events is good. Overall, this may not be a brilliant film; but it's entertaining and fun and therefore gets a big thumbs up.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A naive young boy unknowingly becomes the pawn of a serial killer.",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi597607193",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjQxOGRjYWMtNGRjNS00Y2RmLWJlZjYtMDFlMTNkZDg1NDg5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjQxOGRjYWMtNGRjNS00Y2RmLWJlZjYtMDFlMTNkZDg1NDg5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-13T19:30:06.724Z",
        "url": "https://www.imdb.com/video/vi597607193/"
    },
    "url": "/title/tt0380687/"
}