{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hiam Abbass",
            "url": "/name/nm0007814/"
        },
        {
            "@type": "Person",
            "name": "Hend El Fahem",
            "url": "/name/nm1141276/"
        },
        {
            "@type": "Person",
            "name": "Maher Kamoun",
            "url": "/name/nm0436887/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 867,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066309/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063193/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063732/"
        },
        {
            "@type": "Person",
            "name": "Raja Amari",
            "url": "/name/nm1075853/"
        }
    ],
    "datePublished": "2002-04-24",
    "description": "After the death of her husband, Lilia's life revolves solely around her teenage daughter, Salma. Whilst looking for Salma late one night, Lilia stumbles upon a belly dance cabaret and though initially reserved and taken aback by t...",
    "director": [
        {
            "@type": "Person",
            "name": "Raja Amari",
            "url": "/name/nm1075853/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkxNTU0NzExOF5BMl5BanBnXkFtZTcwMzkzMzUxMQ@@._V1_.jpg",
    "keywords": "female protagonist,husband wife relationship,death of husband,mother daughter relationship,teenage girl",
    "name": "Satin Rouge",
    "original_info": {
        "id": "Satin Rouge_2002",
        "name": "Satin Rouge",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "argv"
        },
        "dateCreated": "2003-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0300453/"
        },
        "name": "interesting for americans, bold for the filmmaker, but simple for the film viewer",
        "reviewBody": "`Satin Rouge' is the second film from Raja Amari from Tunisia, an island off the coast of Libya in the Mediterranean Sea. As is usually the case with foreign films that go through scrupulous hurdles before making it to the United States, it's pretty good. The appeal to American audiences will probably be limited to the art-film culture, which is unfortunate, since what the film has most to offer is the stuff that mainstream Americans should see: a look into every day life in a Middle Eastern country where Arab and Western cultures integrate well.\n\nThe plot of `Satin Rouge' is rather simple: Lilia is a widow who wants to live life again. Her teenage daughter is getting interested in boys and integrating more western ways into her lifestyle. One night, while trying to follow her daughter's activities into the night, Lilia inadvertently discovers a cabaret. She enters to find women belly dancing in skimpy outfits, reacting both horrified and intrigued at the same time. Her desire to find her own individuality and break the moralistic mold of her upbringing has her frequenting the cabaret nightly. The other dancers befriend her, and before she knows it, she's belly-button deep in the club scene herself. As the plot thickens and romances develop, Lilia and her daughter both find themselves learning more about life than either of them bargained for.\n\nThere's no question this is a cute movie. The characters are amiable, although none of them are particularly deep, nor do they find themselves confronting and resolving difficult issues beyond the plot points. It's a simple little story, and Amari certainly has developed a great talent for writing and producing. However, `Satin Rouge' still looks and smells like a low-budget indi-film, which, despite it's clear entertainment value and obvious potential for future films, the movie is rough around the edges. The range of character profiles is limited, characters don't exhibit any dramatic `risk', and the plot line is moderately predictable, except for the very innovative and apt ending. Yet, the lead up to it was fully predictable, and the time spent getting there was longer than it needed to be. This is called, \"bridging\", and the idea is to avoid taking the viewer over an obvious path that will lead an inevidible other side. If we all know it's coming, either get there, or explore developments that contribute to the plot or character profiles. In this case, the delivery is \"adequate,\" but not exemplary, a common mistake made by newer filmmakers.\n\nThe best part of the film is the intimate lens peering into a world and culture that is totally unfamiliar Americans. The depiction of old-world Arab and Western cultures was done so matter-of-factly and unintentional  something that only we Westerners would notice  that I felt a great sense of authenticity that what we were seeing was truly real. This aspect of `Satin Rouge' is not necessarily unique. Most films that come from Iran also illustrate these same features of their society, which would surprise and encourage most Americans as well. To this end, I think it's extremely important for the film industry to encourage and assist in more films from the Middle East region get into our country. We need it."
    },
    "url": "/title/tt0300453/"
}