{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jon Lovitz",
            "url": "/name/nm0001484/"
        },
        {
            "@type": "Person",
            "name": "Rosanna Arquette",
            "url": "/name/nm0000275/"
        },
        {
            "@type": "Person",
            "name": "Dave Attell",
            "url": "/name/nm0040995/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 171,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "John Bowman",
            "url": "/name/nm0101337/"
        },
        {
            "@type": "Person",
            "name": "A. Whitney Brown",
            "url": "/name/nm0112944/"
        },
        {
            "@type": "Person",
            "name": "James Downey",
            "url": "/name/nm0235999/"
        }
    ],
    "datePublished": "2005-06-07",
    "director": [
        {
            "@type": "Person",
            "name": "Beth McCarthy-Miller",
            "url": "/name/nm0565063/"
        },
        {
            "@type": "Person",
            "name": "Paul Miller",
            "url": "/name/nm0589106/"
        },
        {
            "@type": "Person",
            "name": "Dave Wilson",
            "url": "/name/nm0933259/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2VjNzIxZWUtMjc2YS00NGM3LWFkOGEtYWYxODczYWNlMjlmXkEyXkFqcGdeQXVyMjM2ODYwMQ@@._V1_.jpg",
    "keywords": "tv special",
    "name": "Saturday Night Live: The Best of Jon Lovitz",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chip_douglas"
        },
        "dateCreated": "2007-06-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0899167/"
        },
        "name": "Now that's what I call Acting! - Thespian style",
        "reviewBody": "The season finale of the rather disastrous 1985-1986 season of Satuday Night Live ended with a cliffhanger: the studio was set on fire and Lorne Michaels could only rescue one cast member to take into the next season. He didn't pick Randy Quaid, Robert Downey Jr. or Joan Cusack, no, not even Anthony Michael Hall. He carried off Jon Lovitz. Only two other cast members made it into the next line-up, that would go on to define SNL in the late eighties: Nora Dunn (as she was romantically involved with Lorne) and Dennis Miller (because he was stuck to the Weekend Update desk). Lovitz was the star performer at the start of season 1986-1987, but was quickly knocked down from that position by newcomer Dana Carvey. He was also the first of this group to leave. Still, everyone agrees it has taken far too long for his very own 'Best of' special to arrive. By the way, the studio on fire cliffhanger is not on the Best of Jon Lovitz.\n\nOn the audio commentary track included on the DVD version, Lovitz comes over very humble and grateful to be honored with his own TV special. He also repeats himself quite a bit and is not afraid to laugh at his own jokes. He goes on to explain exactly who wrote which sketch (information that is sadly lacking on the credits to all of these shows)and mentions that of all the characters he played, three stood out as his personal favorites: Tommy Flanagan the pathological liar, Master Thespian and Harvey Fierstein. Naturally all three of them are present and accounted for. He also goes into some detail about which character actors inspired his characters (and in some cases, Phil Hartman's characters). Jumping back and forth between material from 1985 and 1990, the show begins and ends with the pathological liar. The first one features Jerry Hall as herself and the second Peewee Herman. Both of these skits are from Lovitz' first year, and he looks extraordinarily thin. Over the course of the show we see him getting progressively wider in girth and shrinking back again. There are two clips from the time Jon got to host the show 1997 (though not, as usual, the monologue). Of these clips, only one sketch (Dunkin' Donuts) is played out in full, featuring as it does Will Ferrell (got to have him on the every Best Of ).\n\nMaster Thespian appears only once, with aided and abetted his mentor Baudelaire (John Lithgow). Strangely enough it's the second appearance of Lithgow that's featured, not the better known original one. Likewise, the Tales of Ribbaldry skit featured here is not the famous one with Tom Hanks (and all the better for it as that skit is already on the Best of the Hankster) but one featuring Mel Gibson. A pleasant surprise indeed, as I hadn't expected to see that one again. Similarly, while the Best of Tom Hanks features the original 'Stand Ups' skit with Tom, Jon and Damon Wayans (all impersonating Seinfeld before he got famous), The Best of Jon Lovitz has the second version of the same skit in which Wayans is replaced by Dennis Miller (making an extremely rare appearance away from the aforementioned Update desk). Even the Girl watchers skit (again with Hanks - probably the host with the most recurring characters ever) differs from the one on Tom's compilation. Usually with these Best of's, viewers are treated to the same skits over and over again. For once, this show seems to have been put together with collectors of all the SNL specials in mind, seeing the lack of overlapping skits. Just one sketch appears on the Best of Phil Hartman as well as Jon Lovitz: 'One More Mission' aka Johnny O'Connor. This is because both Jon and Phil thought that this was their best work together.\n\nOver the course of an hour and a half, we get to see all of Lovitz' trademarks. Nobody does annoying characters better than Lovitz. Witness his Weekend Update correspondents 'Frenchie' and, of course, 'Annoying Man'. Even when he comes on as himself, he enticed the public to 'Get to know me'. He shouts, he sneers and naturally he lies a lot, but still we like him for it. He even gets to show of his considerably singing voice. Jon Lovitz definitely belongs in the Best of SNL line-up and this particular special is a great companion piece in between The Best of Phil and the Best of Tom. Now if only the nice people at Broadway Video could get their act together and release a Best of Bill Murray.\n\n9 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0899167/"
}