{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chris Farley",
            "url": "/name/nm0000394/"
        },
        {
            "@type": "Person",
            "name": "Mackenzie English",
            "url": "/name/nm2061003/"
        },
        {
            "@type": "Person",
            "name": "Christina Applegate",
            "url": "/name/nm0000775/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2419,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013731/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072315/"
        },
        {
            "@type": "Person",
            "name": "Andy Breckman",
            "url": "/name/nm0106563/"
        },
        {
            "@type": "Person",
            "name": "Tom Davis",
            "url": "/name/nm0205569/"
        },
        {
            "@type": "Person",
            "name": "James Downey",
            "url": "/name/nm0235999/"
        }
    ],
    "datePublished": "2000-04-05",
    "description": "A compilation of the best Saturday Night Live sketches as a tribute to the late Chris Farley, one of SNL's greatest Stars.",
    "director": [
        {
            "@type": "Person",
            "name": "Beth McCarthy-Miller",
            "url": "/name/nm0565063/"
        },
        {
            "@type": "Person",
            "name": "Dave Wilson",
            "url": "/name/nm0933259/"
        },
        {
            "@type": "Person",
            "name": "Tom Schiller",
            "url": "/name/nm0771680/"
        }
    ],
    "duration": "PT50M",
    "genre": [
        "Documentary",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIyNzIyNTg0N15BMl5BanBnXkFtZTcwMDE3MzczMQ@@._V1_.jpg",
    "keywords": "tv special,stand up comedy,saturday night live,compilation,motivational speaker",
    "name": "Saturday Night Live: The Best of Chris Farley",
    "original_info": {
        "id": "Saturday Night Live: The Best of Chris Rock_1992",
        "name": "Saturday Night Live: The Best of Chris Rock",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Norman Short"
        },
        "dateCreated": "2000-04-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0500100/"
        },
        "name": "A nice tribute",
        "reviewBody": "Chris Farley (Tommy Boy, Beverly Hills Ninja, Almost Heroes) was a great comic. He had a grasp of physical comedy that he didn't get full credit for. He came to Saturday Night Live during the same time as Adam Sandler, Phil Hartman, and David Spade, and left about the same time to pursue a film career. Adam Sandler is now a guaranteed money maker for studios, and David Spade has made good on television, as did Phil Hartman before his tragic death. So many great comedic actors have died before their time, and Saturday Night Live has had more than their fair share of them, that it's tempting to put Chris Farley as another person on the list and leave it at that. But I think he deserves some special mention. In the skits on this disc, The Best of Chris Farley he often worked alongside these other actors and stole the scenes; and many times you could tell the others couldn't help but laugh at his antics even when they were supposed to be serious.\n\nChris Farley was not only a big man, who thought that much of his comic appeal came from his size, but he was incredibly athletic and showed the grace and agility of a much thinner dancer. Besides being one of the best at pratfalls and other slapstick humor he often showed that agility in sketches where he would dance, figure skate, or do martial arts. That he had so many gifts makes it all the more sad that he died so young. We can only wonder what might have been.\n\nSaturday Night Live: The Best of Chris Farley is another in the \"Best of\" line but in this case is also a tribute to one of my favorites from the cast who is no longer with us. In that respect alone I would recommend this disc, but it has its own merits as well.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0500100/"
}