{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Travolta",
            "url": "/name/nm0000237/"
        },
        {
            "@type": "Person",
            "name": "Karen Lynn Gorney",
            "url": "/name/nm0331186/"
        },
        {
            "@type": "Person",
            "name": "Barry Miller",
            "url": "/name/nm0587944/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 82810,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056904/"
        },
        {
            "@type": "Person",
            "name": "Nik Cohn",
            "url": "/name/nm0169936/"
        },
        {
            "@type": "Person",
            "name": "Norman Wexler",
            "url": "/name/nm0923319/"
        }
    ],
    "datePublished": "1977-12-16",
    "description": "Anxious about his future after high school, a 19-year-old Italian-American from Brooklyn tries to escape the harsh reality of his bleak family life by dominating the dance floor at the local disco.",
    "director": [
        {
            "@type": "Person",
            "name": "John Badham",
            "url": "/name/nm0000824/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWU0NjZhMWEtMWU2Zi00NTgwLWI1OTQtNDJlNDAyNzdlZjljXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "nightclub,disco,dancing,disco dancing,1970s",
    "name": "Saturday Night Fever",
    "original_info": {
        "id": "Saturday Night Fever_1977",
        "name": "Saturday Night Fever",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bandit1974"
        },
        "dateCreated": "2006-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0076666/"
        },
        "name": "I Don't See Anyone Givin You A Raise Down At Unemployment",
        "reviewBody": "I am 31 so I was 3 when this movie came out. The first time I saw Saturday Night Fever was the \"Edited For Television\" version probably when I was 6 or 7 years old. At that point, it was about the music, the dance scenes and the clothes.\n\nIt wouldn't be until years later that I understood what a great story this is. It's a coming of age movie. It's a modern day tragedy. It's a love story.\n\nThe first thing that people think about when they hear Saturday Night Fever is disco and bell bottoms, but the story is timeless. Travolta plays Tony Manero, a loser in a nowhere job who only feels alive when he is on the dance floor at the local disco. There he is adored by his friends, by women and by strangers. There he is king. Everywhere else he is nobody. Even at home.\n\nTony becomes infatuated with a woman named Stephanie. On the surface Stephanie appears to be much better off than Tony. For the most part Stephanie is a big talker, but Tony is bothered by her observations.\n\n\"Let me guess. You work all week long at some dead end job and then you go and blow it at all at 2001 (the disco) on the weekends. You're a cliché. You're no one, going nowhere.\" As much as Tony is upset by her words he can't argue with them. Soon Tony becomes frustrated with his \"station in life\" and tells Stephanie he wants out (of Brooklyn).\n\nWhat makes Saturday Night Fever work so much for me is Tony is very typical of a lot of males who would rather have a good time and party now than build something toward the future. Bars are full of guys like Tony. Guys who are super stars in their local drinking establishments, but have no life outside of the night life.\n\nAnd of course there's the superb dance scenes that most people remember Saturday Night Fever for. The soundtrack is also one of the best out there.\n\nFor whatever reason, Saturday Night Fever also has my favorite closing shot of all time. It's really nothing special, but I get choked up every time I see it.\n\nSaturday Night Fever is also a snapshot of a period in recent American history. The movie took place in 1977. The country was a mess after the Vitenam war ended and before Reagan stormed Washington and once again instilled a sense of pride in Americans. There was no longer a war to protest, but the average American didn't have much faith in our country. I think Saturday Night Fever does an excellent job of capturing what was probably a common attitude among young adults during the late 70's. Live for the moment because the future is pretty bleak.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi890945049",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTA0Mjg2ZjItY2QxNC00NDBhLTliOGItNmM3YTY1N2VhOGI2XkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTA0Mjg2ZjItY2QxNC00NDBhLTliOGItNmM3YTY1N2VhOGI2XkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg",
        "uploadDate": "2020-06-30T11:57:30.201Z",
        "url": "https://www.imdb.com/video/vi890945049/"
    },
    "url": "/title/tt0076666/"
}