{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tracy Morgan",
            "url": "/name/nm0605079/"
        },
        {
            "@type": "Person",
            "name": "Fred Armisen",
            "url": "/name/nm0035488/"
        },
        {
            "@type": "Person",
            "name": "Alec Baldwin",
            "url": "/name/nm0000285/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 186,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "datePublished": "2004-09-07",
    "director": [
        {
            "@type": "Person",
            "name": "Beth McCarthy-Miller",
            "url": "/name/nm0565063/"
        }
    ],
    "genre": [
        "Documentary",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM1MjU0NzU4M15BMl5BanBnXkFtZTcwODUzMzU0Mw@@._V1_.jpg",
    "keywords": "sketch comedy movie,satire comedy,parody comedy,archive footage,sketch comedy",
    "name": "Saturday Night Live: The Best of Tracy Morgan",
    "original_info": {
        "id": "Saturday Night Live: The Best of Tracy Morgan_2004",
        "name": "Saturday Night Live: The Best of Tracy Morgan",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chip_douglas"
        },
        "dateCreated": "2006-07-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0769773/"
        },
        "name": "\"Best of\" = the culmination of years of hard labor on SNL",
        "reviewBody": "Other than Eddie the great, African American cast members continue to struggle for airtime on Saturday Night Live. Sure, Chris Rock hit it big, but had a hard time fitting in on SNL. Like Tim Meadows before him, Tracy Morgan remained in the background for a long time, having to be content with little scraps and stereotypical characters thrown his way. I would not go so far as to call SNL prejudice, but does seem to be a huge difference between the predominate 'White' sketches and the occasional 'Black' one. Having paid his due in the background for almost five years, Tracy finally got the chance to create some memorable recurring characters, with the emphasis on recurring (watch any two Astronaut Joneses' or Woodrow skits and you know what I mean). Indeed, Astronaut Jones appears twice in this collection (once guest starring Garret Morris), as does Tracy's best known break through recurrer, Brian Fellow. Thankfully Woodrow only pops up once.\n\nNow when Tracy would only appear once or twice a show, he often came over as a bit of a one-note performer. This compilation, however, featuring TM continually, proves otherwise. It makes clear to me that Morgan would not be misplaced heading one of those old fashioned comedy-variety shows they don't make anymore. His impressions of the likes of Harry Belafonte and Maya Angelou may not be spot on, but they certainly are laugh-out loud funny. His weekend update characters (Dominican Lou, Larry Smith), although usually just an excuse to do some stand-up, are different enough to disassociate him from the times he plays 'himself' (as in \"Talkin' to the stars\"). When playing a supporting part, as in the 'King Kong' sketch or 'Wong and Owens' (with Jim Breuer), Tracy adds a lot without claiming the spotlight. Still, his star shines brightest when accompanied by another colored guest star (Shaquille O'Neal) or host (Bernie Mac). The fact that a lot of these skits and bits were new to me also added to the enjoyment.\n\nIronically, the sketch shown under the end credits features poor Dean Edwards in a (joke free) supporting role. There's another one who never made it.\n\n7 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0769773/"
}