{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Belushi",
            "url": "/name/nm0000004/"
        },
        {
            "@type": "Person",
            "name": "Dan Aykroyd",
            "url": "/name/nm0000101/"
        },
        {
            "@type": "Person",
            "name": "Chevy Chase",
            "url": "/name/nm0000331/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 716,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0129175/"
        },
        {
            "@type": "Person",
            "name": "Michael O'Donoghue",
            "url": "/name/nm0640874/"
        }
    ],
    "datePublished": "2005-09-06",
    "description": "During his time at SNL, original cast member John Belushi created some of the most memorable characters in television history. One of the most brilliant comedic performers of all time, Belushi's rebellious presence and intensity c...",
    "duration": "PT1H18M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzODExNTI0OV5BMl5BanBnXkFtZTgwNDIyMTA2MDE@._V1_.jpg",
    "keywords": "tv special,character name in title",
    "name": "Saturday Night Live: The Best of John Belushi",
    "original_info": {
        "id": "Saturday Night Live: The Best of John Belushi_2005",
        "name": "Saturday Night Live: The Best of John Belushi",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chip_douglas"
        },
        "dateCreated": "2007-06-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0814302/"
        },
        "name": "Spotting the differences between the 1985 and 2005 versions.",
        "reviewBody": "John Belushi, SNL's original and baddest bad boy gets an updated 'Best of' compilation twenty years after the original release. Despite this one being almost twenty minutes longer, the material is basically the same. If you've already got the first one on tape, you'll get all the same stuff (but with less Blues Brothers) and a couple of extra's thrown in. The first one was co-produced by Belushi's widow, Judy Jacklin Belushi, who only gets a special thanks dedication on the new version. All the classic Belushi skits are accounted for: Samurai Delicatessen, Little Chocolate Donuts, Godfather group therapy, the Olympia restaurant, the last voyage of the Starship Enterprise, Liz Taylor and the St Patrick's Day rant from Weekend Update, The Blues Brothers performing Soul Man, Joe Cocker, King Bee and of course Schillers Reel: Don't look back in anger.\n\nThree segments that were on the original Best of John Belushi have been deleted: the second of three Beethoven gags (in which Ludwig breaks into 'My Girl'), another song by the Blues Brothers: B-Movie Boxcar Blues, and 'The Thing that wouldn't leave' promo. Also, the 1985 version featured a bunch of clips during the end credits, two of which are included in their entirety on the 2005 edition: Wilderness Comedian and the Superhero Party. I was especially pleased to see the Superheroes included here, even if it's more of an ensemble piece in which Belushi plays a supporting part as the Incredible Hulk. There's a guy dressed up as the Fantastic Four's Thing stealing scenes in the background too, and I'm still wondering who that was wearing the skin tight Spider-Woman outfit.\n\nOther additions are the opening sketch from the very first show, 'The Wolverines', another Weekend Update rant concerning Radio City Music Hall and the rarely seen 'Samurai Night Fever' co-starring O.J. Simpson. Also, the introductions to the musical acts which were truncated on the original release are shown in their entirety here. The same thing goes for the music that ends 'Don't look back in anger'. The eighties version cut to a reprise of 'Soul Man' at that point (the Blues Brothes were riding the wave of cult success by that time, so naturally the tape reflected this). The DVD also features John Belushi's original screen test, the nice retrospectivë: 'John Belushi: an Inside Look' and a clip from the Today Show in which Gene Shalit interviews Belushi and Aykroyd about their third and final movie together, 'Neighbors'.\n\nYet another version of the Best of Belush was aired as the SNL TV special 'A Tribute to John Belushi', hosted by Jimmy Fallon and Tina Fey. Apart from some linking material by then current Weekend Update anchors and a few clips from Belushi's movie career, that version of the Best of Belushi also proved Lorne Michaels would let Jimmy Fallon do anything, even wearing one of the old Bee outfits and mimicking Belushi's King Bee performance. Sorry FallonFey fans, these segments are not included on this DVD.\n\n8 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0814302/"
}