{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Albert Finney",
            "url": "/name/nm0001215/"
        },
        {
            "@type": "Person",
            "name": "Shirley Anne Field",
            "url": "/name/nm0276043/"
        },
        {
            "@type": "Person",
            "name": "Rachel Roberts",
            "url": "/name/nm0731499/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8799,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103083/"
        },
        {
            "@type": "Person",
            "name": "Alan Sillitoe",
            "url": "/name/nm0798105/"
        }
    ],
    "datePublished": "1961-04-03",
    "description": "A rebellious, hard-living factory worker juggles relationships with two women, one of whom is married to another man but pregnant with his child.",
    "director": [
        {
            "@type": "Person",
            "name": "Karel Reisz",
            "url": "/name/nm0718554/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODc1MGE3ZWUtOTEzYi00NzIxLWIyMjYtZjZkYzhlYWJkOGIyXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "factory worker,nottingham england,british new wave,kitchen sink realism,based on novel",
    "name": "Saturday Night and Sunday Morning",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "st-shot"
        },
        "dateCreated": "2007-11-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054269/"
        },
        "name": "Working Class Hero",
        "reviewBody": "Albert Finney is a rebel without a cause in this Kitchen Sink entry from 1960 that depicts the mind numbing existence of the British factory worker. Seaton is a hard worker but also a smart ass that rubs his work supervisor ( who calls him a Red ) and neighbors the wrong way. He is also sleeping with a co-workers wife.\n\nAlbert Finney as the surly Seaton is uncomfortably excellent. His bitter tone and attitude cuts like a power saw. Sooner or later his arrogance will be rewarded and you can't wait. He does display a tender side occasionally with Brenda the married woman but the softness is soon washed away as he rails against the system and his predicament. He is also a world class beer drinker which makes him even more unpleasant as he insults pub patrons and takes a nasty fall down a flight of stairs, only to lie there smiling. Pain is a major source of his existence and rowdy nights out like this serve in a perverse way to blunt it.\n\nDirector Karel Reisz moves the storyline along at a rapid pace capturing the grim existence of row house living and deafening factory work. It is a world of gray skies and defeated characters trying to make the best of what they have. They are not the \"Happy Breed\" of generations past.\n\nMade in the first year of the tumultuous decade that changed the world forever Night is pretty tame by today's standards. But in it's day it was condemned by the Catholic Church for its blatant immorality. One might venture that it had an influence on John Lennon who wrote \"Working Class Hero\" and on many occasions was witnessed to act like the unctuous Seaton in his life. It might also be argued that Seaton was a prototype for the futuristic angry young man Alex the Droog in Clockwork Orange.\n\nBetty Ann Field, Hylda Baker and Norman Rossington make up a convincing supporting cast in ably assisting Reisz in the world he depicts. Rachel Roberts is outstanding as the tragic Brenda. Smitten with Arthur and doomed by her predicament she perfectly conveys her situation with a tawdry lack of glamor.\n\nSaturday Night and Sunday Morning may be an unpleasant film but it is a powerful and important one.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A rebellious, hard-living factory worker juggles relationships with two women, one of whom is married to another man but pregnant with his child.",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi562479897",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjFlZGFhZjUtMTQxMC00OGEyLWFkNjgtMWEyZGRlOTQ5ODg2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjFlZGFhZjUtMTQxMC00OGEyLWFkNjgtMWEyZGRlOTQ5ODg2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-20T19:02:49.449Z",
        "url": "https://www.imdb.com/video/vi562479897/"
    },
    "url": "/title/tt0054269/"
}