{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dan Aykroyd",
            "url": "/name/nm0000101/"
        },
        {
            "@type": "Person",
            "name": "John Belushi",
            "url": "/name/nm0000004/"
        },
        {
            "@type": "Person",
            "name": "Steve Cropper",
            "url": "/name/nm0188936/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 604,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0082557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0098530/"
        },
        {
            "@type": "Person",
            "name": "Michael O'Donoghue",
            "url": "/name/nm0640874/"
        }
    ],
    "datePublished": "2005-09-06",
    "description": "A new collection of Dan Aykroyd's most memorable sketches and characters performed during the first four years of Saturday Night Live.",
    "director": [
        {
            "@type": "Person",
            "name": "James Signorelli",
            "url": "/name/nm0797526/"
        },
        {
            "@type": "Person",
            "name": "Dave Wilson",
            "url": "/name/nm0933259/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE1MDMwNzc1OF5BMl5BanBnXkFtZTgwMTAxMjA2MDE@._V1_.jpg",
    "name": "Saturday Night Live: The Best of Dan Aykroyd",
    "original_info": {
        "id": "Saturday Night Live: The Best of Dan Aykroyd_2005",
        "name": "Saturday Night Live: The Best of Dan Aykroyd",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chip_douglas"
        },
        "dateCreated": "2007-09-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1093389/"
        },
        "name": "Laraine Newman would say: Hmm, that's great Aykroyd!",
        "reviewBody": "Before Will Ferrell was the 'everyman' cast-member on whom all the SNL writers could count to deliver the laughs during the nineties, before Phil Hartman was 'the glue' that held each sketch together in the eighties, there was Dan Aykroyd in the original, seventies cast of 'Not ready for prime time players'. He was always there to give support, to take on any less-than-savory character that needed to be done, and of course, to perform those rapid delivery commercial pitches of his. This compilation, an updated version of the 1986 'Best of Dan Aykroyd', features all of his most famous characters (Beldar Conehead, George Festrunk, Irwin Mainway, E Buzz Miller and of course, Fred Garvin, male prostitute) as well as some of his most memorable impressions (Presidents Nixon & Carter, Tom Snyder and the unforgettable Julia Child). Every sketch stars good ole' Danny boy (with the possible exception of 'The Nerds and the Norge' in which he makes a late appearance) and as such there is very little of Aykroyds bosom buddy John Belushi (Just the Blues Brothers, Bad Ballet and Family Feud). In fact, Steve Martin appears more prominently than Belush (in the Wild and Crazy Guys and two Coneheads skits). No wonder people often mistakingly think Martin was a part of the cast at the time.\n\nWe've grown accustomed to Saturday Night Live cast members making it on the big screen (or at least an attempt to). Maybe it's because they're working with movie stars as guest hosts most of the time, that the Not ready for prime-time players and their followers all set their sights on a career on the celluloid screen instead of the small one. Of course, Aykroyd's tendency to fill in as strong supporting characters/second fiddle (or should that be banana?) would continue into his movie career. In all of his best known pictures, he is giving support to another comic, usually one from SNL (Belushi in 'The Blues Brothers', Murphy in 'Trading Places', Murray in 'Ghostbusters' even Chase in 'Spies Like Us'. That last one was actually developed around 1980 with Aykroyd and Belushi in mind, as was 'Three Amigos'. Whenever Aykroyd had to carry the comedy on his own, the film failed at the box office ('Doctor Detroit', 'My stepmother is an Alien' and the truly awful 'Loose Cannons'). Still, Danny has made more big screen outings than most of the aforementioned alumni (except Eddie Murphy). Like his character in Ghostbusters, he always seems to be the most enthusiastic to jump into another crazy endeavor (like writing and directing the extremely weird 'Nothing but Trouble). He gladly put on Beldar's cone again for the 'Coneheads' movie (riding on the success of Wayne's World) and made a lot of cameo appearances on his old show, finally hosting in in 2003. None of these appearances are on this compilation, though, this is strictly 1975-1979.\n\nThe main differences between the 1986 version and this one are: the former had The Coridda, Crazy Frank, The Coneheads at Halloween and E. Buzz Miller's Animal Kingdom, whereas the later includes The Nerds and the Norge, Tomorrow (with Mick Jagger), Ask President Carter, the Coneheads at home, Coneheads Family Feud, E. Buzz Miller's Art Classics plus Auto Mechanic Bedtime Stories. So, even if you know the first one by heart, this collection (copyright dated 1998) is a good deal for all Aykroyd fanatics and classic SNL lovers in general. As with the Belushi Best of, this collection has less emphasis on the Blues Brothers (just one performance) then there was in it's eighties counterpoint. It must also be noted that Tom Snyder was already considered dated enough by 1986 not to merit an inclusion (except for a brief snippet during the end credits) but managed to have a whole skit to his own on the 1998 version all the same. The original Best of did feature some unique animation linking the material together and a quick fire collection of clips during the aforementioned end credits, while the current collection features the same kind of credits as the Belushi and Gilda Radner DVD's. Special features exclusive to the DVD include Aykroyd's original screen test and another one of those 'Inside look' retrospectives.\n\n9 out of 10 \n\nIsn't that amazing?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt1093389/"
}