{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gilda Radner",
            "url": "/name/nm0705717/"
        },
        {
            "@type": "Person",
            "name": "Dan Aykroyd",
            "url": "/name/nm0000101/"
        },
        {
            "@type": "Person",
            "name": "John Belushi",
            "url": "/name/nm0000004/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 139,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072315/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0098530/"
        }
    ],
    "datePublished": "2005-09-06",
    "description": "A compilation of Gilda Radner's funniest skits and most memorable characters from the first five years of Saturday Night Live.",
    "director": [
        {
            "@type": "Person",
            "name": "Tom Schiller",
            "url": "/name/nm0771680/"
        },
        {
            "@type": "Person",
            "name": "James Signorelli",
            "url": "/name/nm0797526/"
        },
        {
            "@type": "Person",
            "name": "Dave Wilson",
            "url": "/name/nm0933259/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM5NzAyODUxMl5BMl5BanBnXkFtZTcwNTE5MjIyMQ@@._V1_.jpg",
    "name": "Saturday Night Live: The Best of Gilda Radner",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chip_douglas"
        },
        "dateCreated": "2007-09-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1093390/"
        },
        "name": "Gilda's finest, with some good Curtin & Murray stuff as well.",
        "reviewBody": "The great Gilda Radner never became well known over here in Europe, and it is probably for that reason that the 1989 version of The Best of Gilda Radner was never released on video in my neck of the woods (altough neither was the Best of Chevy Chase) So, unlike the best of Belushi, Aykroyd and Murphy, I cannot compare the content on this new Broadway Video with the original compilation. On the other hand, it means that watching the 1998 version of Gilda's finest, treats me to a lot of material that's either new to me or that I haven't seen for years. It strikes me that we also get a lot of good material from Jane Curtin (albeit as a straight-woman to Gilda) and Billy Murray, neither of whom have gotten a Best Of of their own as of this writing. For example, we see Curtin cringing as Radner appears on Weekend Update as Roseanne Roseannadanna and Emily Litella (both of whom appear twice) and Murray's Todd DiLaBounta attempting to woo Lisa Loopner (also in two separate helpings). In fact, as we watch the love story of Lisa and Todd unfold before our very eyes, we meet the rest of the DiLaBounta family (father Buck Henry and older brother Richard Benjamin). Aykroyd and Belushi are represented as well, but in much smaller doses, and as usual Larraine Newman and Garret Morris get the short end of the stick as far as screen time is concerned. Even one and a half seasoner Chevy Chase appears more than Garret here. \n\nThe compilation is a glowing tribute to perky Gilda, as it truly encompasses some of her best and most beloved work. The range of Gilda's character's never ceases to amaze: going from her own sweet self during the cold opening to nasty Candy Slice, past disgusting Roseannadana, the extremely stupid Lisa (a different one) and the even more stupid Fern (Candice Bergen) for the Right To Extreme Stupidity League, and the rib crushing imagination of Judy Miller. And then there are the sweet, poignant skits like 'Dancing in the Dark' with Steve Martin, Tom Schiller's 'La Dolce Gilda' and the wordless 'Laudromat' skit that ends the compilation. For lovers of SNL's commercial parodies, there are no less than four starring Gilda at several different ages (well in the land of make believe anyway): 'Jewess Jeans', 'Aunt Jane Creeley's Vegetable Soup', 'Autumn Fizz' and 'Hey You'. Another highlight is black and white 'I Love Lucy' skit spoofing the episode they always seem to show clips from whenever Lucy footage is needed: the one where Ball is squirting whipped cream on deserts passing on a conveyor belt (in the SNL version, she's handling nuclear weapons). Danny A. puts on a fabulous over the top voice as Mr. Witherbottom, an infection often imitated by Phil Hartman in later years in skits opposite Jon Lovitz. Almost everyone concerned only has sweet things to say about her on the accompanying short documentary 'An Inside Look' (which, like the similar features on the Belushi and Aykroyd discs, seems to have been recorded around the same time as 'Live from New York: the first five years of SNL'. And watching Gilda in her element never fails to bring a smile to once's face.\n\n8 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt1093390/"
}