{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Molly Shannon",
            "url": "/name/nm0788340/"
        },
        {
            "@type": "Person",
            "name": "Ben Affleck",
            "url": "/name/nm0000255/"
        },
        {
            "@type": "Person",
            "name": "Alec Baldwin",
            "url": "/name/nm0000285/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 204,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062559/"
        }
    ],
    "datePublished": "2001-03-20",
    "description": "Shannon's unmistakable comedy antics are in full effect in this collection of sketches from SNL's wild alumna. Laugh along with her fearlessly funny characters like brazen schoolgirl Mary Katherine Gallagher and Joyologist Helen M...",
    "director": [
        {
            "@type": "Person",
            "name": "Beth McCarthy-Miller",
            "url": "/name/nm0565063/"
        },
        {
            "@type": "Person",
            "name": "Paul Thomas Anderson",
            "url": "/name/nm0000759/"
        }
    ],
    "duration": "PT1M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTUzNDU3MzI4M15BMl5BanBnXkFtZTcwNDg2NjQyMQ@@._V1_.jpg",
    "name": "Saturday Night Live: The Best of Molly Shannon",
    "original_info": {
        "id": "Saturday Night Live: The Best of Molly Shannon_1995",
        "name": "Saturday Night Live: The Best of Molly Shannon",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chip_douglas"
        },
        "dateCreated": "2005-11-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0486767/"
        },
        "name": "I'ts all the same to me",
        "reviewBody": "This \"Best of SNL\" compilation seems a to offer a bit less variety than usual, because Molly Shannon's characters are so repetitive. I mean that literally: she repeats and shouts everything (probably trying to coin another SNL catchphrase). They never know when to stop either: Helen Madden and Sally O'Malley always seem to overstay their welcome. Of course she can be really funny in small doses and is very good when teamed up with other female SNL-ers, like Ana Gasteyer on 'The Delicious Dish' or Cheri Oteri in 'Leg Up'. This is not meant to sound mean, but Molly excels at portraying different ages. When playing Helen Madden opposite Matthew Broderick she seems older than him, yet as Mary Catherine Galleger (who appears in two skits) she looks suitably young. Strangely enough, her other teen character, Goth Talk's Circy Nightshade never appears in this collection.\n\nThe 'Top ten bruises on my body' joke during the 'Courtney Love Show' made me wonder how many of those bruises were make up, for Shannon obviously likes to do her own stunts and throws herself against the wall in every other sketch. Like Chris Farley, there does not seem to be much padding involved, as her underwear is visible practically every time. I enjoyed her rendition of Courtney Love, though her Anna Nicole in MTV's FANatic just seemed a bit pointless. Of course they included a sketch where she breaks character (Stand up comic Jeanie Darcy). Molly has a tendency to look straight into the camera anyway. And just like on the live broadcasts they save the worst skits for last, so do all of these Best of specials end with a whimper instead of a bang. Still, I should not be so negative, in the male oriented SNL world very few female cast members get a compilation like this.\n\n7 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0486767/"
}