{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Luiza Erundina",
            "url": "/name/nm0259940/"
        },
        {
            "@type": "Person",
            "name": "Fábio Freire",
            "url": "/name/nm0293846/"
        },
        {
            "@type": "Person",
            "name": "Ezequias Lira",
            "url": "/name/nm0513900/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 45,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Saudade Do Futuro",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031201/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007432/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029162/"
        },
        {
            "@type": "Person",
            "name": "Marie Clémence Andriamonta-Paes",
            "url": "/name/nm0086972/"
        },
        {
            "@type": "Person",
            "name": "Cesar Paes",
            "url": "/name/nm0655941/"
        }
    ],
    "datePublished": "2001-03-14",
    "description": "Dreaming of a better life, migrants from the Northeast of Brazil speak about the city of São Paulo, and sing it in prose, songs, stories and multiple sounds.",
    "director": [
        {
            "@type": "Person",
            "name": "Cesar Paes",
            "url": "/name/nm0655941/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAzMzI0Mzk2N15BMl5BanBnXkFtZTcwNDE3MzUyMQ@@._V1_.jpg",
    "keywords": "city",
    "name": "Saudade do Futuro",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stormy724"
        },
        "dateCreated": "2015-05-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0261971/"
        },
        "name": "a slice of rural Brazilian life in the big city",
        "reviewBody": "\"Saudade\" is a Brazilian Portuguese word meaning longing, missing or nostalgia, often bittersweet. \"Saudade do Futuro\" roughly means \"Longing for the Future.\"\n\nThis 2000 documentary centers on the lives of nordestinos (north-easterners) who have migrated to São Paulo, a city of 16 million, looking for a better future. Most nordestinos are considered to be unwelcome hillbillies who ought to stay in the drought-prone sertão (hinterland). \n\nSome are successful in São Paulo, including Dona Erundina who became mayor (1989- 1992) and Emanoel Araujo, an internationally-known sculptor who is a respected member of São Paulo's art scene. Many end up as street vendors, laborers, or the musicians who are the heart and soul of this film.\n\nClearly related to rap, the musical style featured in the film evolved from African rhythms ad is called \"repente.\" \n\nRepentistas tap out music on tambourines, guitars, flutes, or drums while improvising verses, often saudades for the simpler life in the Northeast, the hardships of the big city, or humorous (& often sexually suggestive) insults hurled at each other or audience members who gather to listen and donate money. \n\nInterspersed between the music are everyday nordestinos who work long hours at mundane jobs for little pay in São Paulo. Their lives are enriched by their social events, dancing, and the repente music which is both humorous and a celebration of their lives.\n\nI lived in the Northeast of Brazil in the late 1960's. I saw, in the varied nordestinos of this film, the faces I had lived with every day during my time there. The faces are filled with the combination of warmth, despair, optimism, and humor that creates the wonderful improvised music that infests the film with rhythmic beats that are uniquely Brazilian. \n\nThere is no narration. The characters tell their own stories through words or verses. The stunning photography of bustling São Paulo makes New York traffic look like a rural joy ride. The film may not be for everyone, but for those who would enjoy seeing a unique slice of Brazilian life, it is \"maravilhoso!\" Marvelous!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0261971/"
}