{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maggie Cheung",
            "url": "/name/nm0001041/"
        },
        {
            "@type": "Person",
            "name": "Leon Lai",
            "url": "/name/nm0481709/"
        },
        {
            "@type": "Person",
            "name": "Scott Leung",
            "url": "/name/nm0504991/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 308,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "alternateName": "Sausalito",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050080/"
        },
        {
            "@type": "Person",
            "name": "Sap Sam Chan",
            "url": "/name/nm1113644/"
        }
    ],
    "datePublished": "2000-04-20",
    "description": "Ella is a divorced Chinese American taxi driver who spends her days ferrying people around the roads of Sausalito, San Francisco. After work, she spends time with her 8-year old son, Scott. Ella meets Mike at Sky House, an infamou...",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Lau",
            "url": "/name/nm0490487/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTY0Mjc2NzU2Nl5BMl5BanBnXkFtZTcwNjY5ODAyMQ@@._V1_.jpg",
    "keywords": "taxi driver,chinese,virtual world,gay,nightclub",
    "name": "Yi jian zhong qing",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "leekandham"
        },
        "dateCreated": "2003-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0240880/"
        },
        "name": "Fun",
        "reviewBody": "It's rather nice occasionally to see a romantic movie that's not based on teenage puppy-love, and Sausalito falls right into this category.\n\nMaggie Cheung plays Ellen, a single mother in her mid-30s and makes a living as a taxi driver in San Francisco. Meanwhile, Mike (Leon Lai) is the CEO of his successful internet start-up company. However, it's developing its own cash problems, and business problems are hitting his own personal life. On one night to get away from it all, Leon borrows someone he doesn't know, Maggie, for a trick to woo the chicks, but instead attracts the attention of Maggie. And so a bumpy taxi-ride lies ahead.\n\nSausalito is a feel-good movie about life in a world that you begin to realise are full of strangers. The story is well written, with some very good scenes that involve her son, Scott.\n\nAlthough I wouldn't call this an outstanding film, there is a lot of good subtext in the film, and the story flows very well. The story also acknowledges San Francisco culture by including addressing many of the bigotries that people outside of San Francisco may not be readily accepting as yet, one of which is the inclusion a homosexual, multi-racial couple of contrasting ages.\n\nThis is definitely one to add to the 'To Watch' list.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0240880/"
}