{
    "@context": "https://schema.org",
    "@type": "Movie",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025679/"
        }
    ],
    "genre": [
        "Documentary"
    ],
    "keywords": "year in title,20th century,1940s,1990s,world war two",
    "name": "Saving Private Ryan 1944-1998",
    "original_info": {
        "id": "Saving Private Ryan_1998",
        "name": "Saving Private Ryan",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "antellcircle"
        },
        "dateCreated": "2020-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt2396438/"
        },
        "name": "Alter of Freedom",
        "reviewBody": "This movie contains a lot of bloody scenes as should be expected with any war movie; Hence it is not for the weak. However, if young children are watching zombie movies, then they should be watching historical American honor movies. America history is built upon conflict & I like to remind others that this movie is set during a war that we (the Allies) WON together.\n\nI personally like how it represents the many personalities from hard places with fight, flight and freeze psychological reactions. The writers have written many great quotes in this film to dedicate a website. Mine was when Gen George C Marshall read the letter to a mother who lost all five of her sons in battle; \"I feel how weak and fruitless must be any words of mine but attempt to beguile you from the (great) grief of loss so overwhelming; I cannot refrain from tendering to you the consolation that may be found in the thanks of the Republic they died to save...to have laid so costly a sacrifice upon the alter of freedom. Yours very sincerely and respectfully, Abraham Lincoln\"\n\nI watch this movie frequently to place myself in my step-father Franklin James Tossas shoes. He had gone to the Olympics for Puerto Rico in 1972 and after joining the forces was frequently dropped into capture situations to rescue soldiers as he told me stories in my teens. His daughter is unable to care for him from Germany; So I care for him now at Ft Sam Houston from Bexar county San Antonio, TX. Keep my seat warm dear father. There is still much to do 🙏",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt2396438/"
}