{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cary Elwes",
            "url": "/name/nm0000144/"
        },
        {
            "@type": "Person",
            "name": "Leigh Whannell",
            "url": "/name/nm1191481/"
        },
        {
            "@type": "Person",
            "name": "Danny Glover",
            "url": "/name/nm0000418/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 431075,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0137447/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021715/"
        },
        {
            "@type": "Person",
            "name": "Leigh Whannell",
            "url": "/name/nm1191481/"
        },
        {
            "@type": "Person",
            "name": "James Wan",
            "url": "/name/nm1490123/"
        }
    ],
    "datePublished": "2004-10-29",
    "description": "Two strangers awaken in a room with no recollection of how they got there, and soon discover they're pawns in a deadly game perpetrated by a notorious serial killer.",
    "director": [
        {
            "@type": "Person",
            "name": "James Wan",
            "url": "/name/nm1490123/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2M1MzI1MWYtYmM2ZC00OWY3LTk0ZGMtNmRkNzU1NzEzMWE5XkEyXkFqcGdeQXVyODUwOTkwODk@._V1_.jpg",
    "keywords": "surprise ending,locked in a room,trapped in a room,mind game,flashback",
    "name": "Saw",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Superunknovvn"
        },
        "dateCreated": "2005-03-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0387564/"
        },
        "name": "The best thriller in years",
        "reviewBody": "Since \"Nattevagten\" I have not seen a thriller that has kept me on the edge of my seat as well as \"Saw\". Right from the beginning this original story sucks you in and doesn't let you go until the very end. Thrillers as gripping as this one have become extremely rare in times like these, where people have seen almost everything and can guess any twist during the first half of the movie. With \"Saw\" James Wan and Leigh Whannell, the creative heads behind this project, set new standards. Think you're hard-boiled? Think again and watch \"Saw\", a movie that will creep you out and surprise you beyond your expectations.\n\n\"Saw\" has been advertised as the new \"Se7en\" and while both movies are definitely in the same tradition, \"Saw\" does a much better job at actually being creepy. Jigsaw is the most gruesome killer the cinema has seen in a loooong time. Wan and Whannel really came up with a monster that has no peer. Where many movies drift into ridiculousness trying to establish the villain as an almost superhuman evil being, \"Saw\" does never get anywhere near that trap. Sure, the cops are depicted way too stupid and the killer is unrealistically smart, outshining each and every opponent with his perfect plans, but hey, \"Se7en\" and \"Silence Of The Lambs\" didn't care too much about realism, either, did they?\n\n\"Saw\" does have some flaws. Those sped-up tracking shots have just been used too many times by now, the structure of the script is weird and jumps from one period of time to another, some characters' lines are a bit clichéd. However, considering that this movie was made in only 18 days by two independent filmmakers with literally no budget at all, it's really inappropriate to be petty about technical subtleties, when Wan and Whannel came up with such an original and stirring movie.\n\nI can't remember the last time I've been surprised by a movie's final twist, but \"Saw\" has an ending that I didn't see coming at all. This thriller is the most original piece of independent film-making since \"Cube\". I'm really looking forward to seeing how Wan and Whannell's career develops after this fine sleeper.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Watch the 10th Anniversary trailer for Saw.",
        "duration": "PT1M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi8957721",
        "name": "10th Anniversary Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTA1MDc0NzE3NDBeQTJeQWpwZ15BbWU4MDk2NTEyODIx._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTA1MDc0NzE3NDBeQTJeQWpwZ15BbWU4MDk2NTEyODIx._V1_.jpg",
        "uploadDate": "2014-10-01T13:49:43Z",
        "url": "https://www.imdb.com/video/vi8957721/"
    },
    "url": "/title/tt0387564/"
}