{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nastassja Kinski",
            "url": "/name/nm0000176/"
        },
        {
            "@type": "Person",
            "name": "Hart Bochner",
            "url": "/name/nm0000952/"
        },
        {
            "@type": "Person",
            "name": "William Baldwin",
            "url": "/name/nm0000287/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 699,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0147256/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0040970/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075260/"
        },
        {
            "@type": "Person",
            "name": "Madeline Sunshine",
            "url": "/name/nm0839372/"
        }
    ],
    "datePublished": "2001-12-16",
    "description": "An unfulfilled married woman becomes intrigued by an alluring suitor whose attention soon becomes obsessive.",
    "director": [
        {
            "@type": "Person",
            "name": "Allan Moyle",
            "url": "/name/nm0610496/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODFlOGFlZTctMWQzZC00MDcwLTkxNmEtNjQ2ZjU4NTM5ZDIwXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "talking to a mirror,ex model,cheating wife,voice over narration,shower",
    "name": "Say Nothing",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tomc123"
        },
        "dateCreated": "2003-01-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0288808/"
        },
        "name": "Beautiful Unfaithful Wife With An Average Story Line",
        "reviewBody": "Brief marital infidelity comes back to haunt loving wife Grace Needham (portrayed by the always sexy Nastassja Kinski).\n\nShe had left town, and her depressing husband, to embark on a trip to sunny Miami, where she was pursued and ultimately seduced by Julian Grant, a handsomely evil and manipulative business executive, who is portrayed very well by William Baldwin (why do all of the Baldwin brothers play evil people so damn well?)\n\nThe seducing of Grace took place as the two drank champagne on a deserted beach they reached privately by sailboat. Grace admitted she drank too much for her own good and revealed the many problems in her marriage. Julian gained her confidence by claiming he would never allow those types of problems to occur, if he had a relationship with Grace. Julian's manipulation continued as he described a \"lost at sea\" fantasy involving the now uninhibited Grace, who sat near, listening to his every word and becoming more and more engaged with his romantic dream.\n\n His manipulation paid off as a few subtle nudges led to Grace's soft kisses, paused momentarily by her pulling back as if suddenly thinking to herself `What am I doing? I'm a wife. I'm a mother. I have a real life. Real responsibilities. Sure, the two of us have talked about being together, lost at sea, but that is just a fantasy. Look at what we're doing here. The consequences are real. We're really alone on a secluded beach. Am I going to let this fantasy really happen?'\n\nShe succumbs to the dream, as her kisses became more passionate. The once guarded Grace, who used to respond to men's propositions by saying \"I'm married\" enjoyed watching as Julian unbuttoned her shirt, leading to more kisses, body caresses and her climbing onto Julian's lap! She smiles, kisses, moans, laughs and frequently looks up at the sun throughout what unfortunately was a brief love-making scene in which everybody seemed to have most of their clothes on.\n\nWhile I thoroughly enjoyed the look of illicit passion on Grace's face as the once devoted wife was being thoroughly satisfied by having sex with a man that clearly enjoys manipulating others, I will say that on the whole, the scene was undeserving of the movie's \"R\" rating.\n\nJulian returned home to find her husband rejuvenated from his securing of a high paying job, and she is excited about being able to return to a normal life where she can once again be a loving wife and caring mother.\n\nBut the evil Julian Grant reenters the picture and is not willing to give up so easily on Grace. Grace has a plan to rid her life of Julian, but will it work?\n\nObviously, I don't want to ruin the remaining story line for you. However, I will say that I always enjoy movies involving sexual pretense by a wife (especially when she exhibits uninhibited attraction and behavior that is normally reserved for her husband) but in actuality, is seeking revenge against the antagonist. This movie would have been much, much better if the movie had included more of that in the story line. My feelings are if the movie brings it up, then the movie should finish it. And this movie definitely brought it up. Unfortunately, certain constraints in the story line prevented this from being significantly pursued. There are many other movies available that succeed with that very point, and I'll include their titles in the \"recommendations\" portion of this section. I'm also open to receiving emailed suggestions of other movies that contain a good story line involving sexual pretense on the part of a seemingly devoted wife.\n\nOverall, Nastassja Kinski and William Baldwin are both very good. The movie is not.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi612434201",
        "name": "Say Nothing",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTlkYjU0ZDMtYjZmNy00OTgxLWIzNjEtMzgzZDliNDYyZTY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTlkYjU0ZDMtYjZmNy00OTgxLWIzNjEtMzgzZDliNDYyZTY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:42:55Z",
        "url": "https://www.imdb.com/video/vi612434201/"
    },
    "url": "/title/tt0288808/"
}