{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Falk",
            "url": "/name/nm0000393/"
        },
        {
            "@type": "Person",
            "name": "Mickie Cold",
            "url": "/name/nm10113906/"
        },
        {
            "@type": "Person",
            "name": "Doug Cronin",
            "url": "/name/nm0188757/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 831,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0088148/"
        },
        {
            "@type": "Person",
            "name": "Arnold Shapiro",
            "url": "/name/nm0788461/"
        }
    ],
    "datePublished": "1978-11-02",
    "description": "The filmed depiction of a program where convicts tell troubled kids about the horrors of prison life.",
    "director": [
        {
            "@type": "Person",
            "name": "Arnold Shapiro",
            "url": "/name/nm0788461/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Crime",
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM5NjE1NTYwNF5BMl5BanBnXkFtZTcwNDQ0ODAyMQ@@._V1_.jpg",
    "keywords": "prison,convict,juvenile delinquency,prison deterrent program,vulgarity",
    "name": "Scared Straight!",
    "original_info": {
        "id": "Scared Straight!_1978",
        "name": "Scared Straight!",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dtucker86"
        },
        "dateCreated": "2003-10-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078205/"
        },
        "name": "A trip into hell",
        "reviewBody": "This became one of the most legendary documentaries ever made. I rented the video once and taped the show when it came on tv. Even though this film was made a quarter century ago, its effect is still as powerful and its message still as important. I have always supported programs like Scared Straight because there are some kids who don't respond to kindness. To all those bleeding heart people who think these convicts were so mean to these kids, just remember they didn't get there for being boy scouts. Good kids don't go into someone's prison. One of the lifers told the group that if someone had talked to him like that he wouldn't be in prison. Another lifer tells the group that the police can make a thousand mistakes but you can only make one. The speaker that scared the kids the most was this one guy named Ali. He had a loud screeching voice and seemed the most angry of the convicts. He told the kids \"I'm here for murder, kidnapping, armed robbery...\". He showed them his eye was missing, taken right out of its socket in a prison fight. I feel the convicts \"in your face\" approach was the right thing to do. They had experimented before with a kinder gentler approach, and guess what folks it didn't work! The kids actually wanted to go back to the prison because they thought that the convicts were a nice bunch of guys! I watched interviews they did with those kids before they went into Rahway and I wanted to slap the snot out of some of them at the things they were saying. I was thinking to myself, what a bunch of punks! I'll tell you this, they didn't act like that after it was all over. In 1998, they did a follow up special called Scared Straight Twenty Years Later. Danny Glover was the host of it. It profiled the kids and the convicts. Only two of the group that went to Rahway for the documentary became career criminals. One was in prison and one had died. The others were useful and productive members of society. None were rocket scientists, they had mostly blue collar jobs, but the point is they had lived honest lives and all of them talked of how greatful they were for the program and what it did for them. Three of the lifers had died (one of natural causes, one of AIDS and one of an overdose). Two of them were still in prison and the rest had been released and had lived honestly since. The one with the missing eye was so different. They interviewed him and he seemed like such a nice old guy. He had a beautiful family and said he had everything he wanted and that he loved himself. It was wonderful to see."
    },
    "url": "/title/tt0078205/"
}