{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anna Faris",
            "url": "/name/nm0267506/"
        },
        {
            "@type": "Person",
            "name": "Jon Abrahams",
            "url": "/name/nm0009016/"
        },
        {
            "@type": "Person",
            "name": "Marlon Wayans",
            "url": "/name/nm0005541/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 268823,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001823/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052918/"
        },
        {
            "@type": "Person",
            "name": "Shawn Wayans",
            "url": "/name/nm0915465/"
        },
        {
            "@type": "Person",
            "name": "Marlon Wayans",
            "url": "/name/nm0005541/"
        },
        {
            "@type": "Person",
            "name": "Buddy Johnson",
            "url": "/name/nm0424688/"
        }
    ],
    "datePublished": "2000-07-07",
    "description": "A year after disposing of the body of a man they accidentally killed, a group of dumb teenagers are stalked by a bumbling serial killer.",
    "director": [
        {
            "@type": "Person",
            "name": "Keenen Ivory Wayans",
            "url": "/name/nm0005540/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGEzZjdjMGQtZmYzZC00N2I4LThiY2QtNWY5ZmQ3M2ExZmM4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "spoof,crude humor,parody,movie theater,telephone call",
    "name": "Scary Movie",
    "original_info": {
        "id": "Scary Movie_2000",
        "name": "Scary Movie",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2000-12-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0175142/"
        },
        "name": "amusing parody",
        "reviewBody": "Like most movie parodies, `Scary Movie' starts out well then begins to head downhill as it exhausts the possibilities of its limited material. Certainly, few genres are as rife for self-satire as the teen slasher films that have proliferated in theatres ever since the early 1980's. Seeing, however, as even some of the earliest `Friday the 13th' and `Halloween' films seem like ancient history to today's core movie going public, `Scary Movie' draws upon more contemporary examples of the genre like `Scream' and `I Know What You Did Last Summer' as its source of inspiration. In its opening stretches, `Scary Movie' has a great deal of fun parodying the many ludicrous conventions that have long defined these films: the use of 30-year old actors to portray empty-headed, nubile adolescents; the heavy emphasis on teen sexuality and partial nudity; the inane actions of the killer's victims who seem to do everything possible to hurl themselves into dangerous situations; and the oh-so-predictable false scare (usually caused by a leaping cat) followed immediately by the inevitable killer's attack.\n\nDirected by Keenan Ivory Wayans and boasting a screenplay concocted by no fewer than six (count em SIX) writers, `Scary Movie' establishes a high speed rhythm and pace that the filmmakers manage to sustain through most of the film's 88-minute running time  though there is a noticeable tendency on the part of the film to lag in the last half hour. Part of the problem could be that, as with most films made up essentially of sound and sight gags haphazardly strung together, it is inevitable that some of the bits will succeed better than others and that, as the movie rolls along, the inspiration will run a little dry and the humor will become less spontaneous and more forced. Indeed, this type of movie genre parody has always worked best when applied in small doses on TV series like `Saturday Night Live,' `In Living Color' and even the `Carol Burnett Show.' Stretched out to full length, such concepts often suffer the curse of diminishing returns.\n\n Occasionally, the screenplay edges so close to the limits of good taste that one may question whether or not the material is truly appropriate for the age group at which the movie is obviously targeted. The crudity is actually much more comically effective when it is merely hinted at than when it is so openly spelled out and displayed. But then subtlety is not exactly a strong suit of the straight horror movie genre either. \n\n`Scary Movie' is, at least, blessed with a winning, game cast made up of appropriately post adolescent actors who understand well the mannerisms and speech patterns of the stereotypes they embody. The overall good-natured quality of the film and its fairly high laugh ratio of gems to clunkers make `Scary Movie' an imperfect but generally likeable popcorn entertainment."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Scary Movie",
        "duration": "PT1M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4046298137",
        "name": "Scary Movie: Blu-Ray",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTBiNGQ2YjAtOGU3Ny00NGI1LTlmYTItMzAzMWVkNzZmYjM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTBiNGQ2YjAtOGU3Ny00NGI1LTlmYTItMzAzMWVkNzZmYjM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-08-17T03:29:30Z",
        "url": "https://www.imdb.com/video/vi4046298137/"
    },
    "url": "/title/tt0175142/"
}