{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ray Greene",
            "url": "/name/nm0998576/"
        },
        {
            "@type": "Person",
            "name": "Roger Corman",
            "url": "/name/nm0000339/"
        },
        {
            "@type": "Person",
            "name": "David F. Friedman",
            "url": "/name/nm0293354/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 626,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0253876/"
        },
        {
            "@type": "Person",
            "name": "Ray Greene",
            "url": "/name/nm0998576/"
        }
    ],
    "description": "A look at several legendary 'exploitation' film-makers from the golden days of drive-in movies, and how they had a lasting effect on the movie landscape in general.",
    "director": [
        {
            "@type": "Person",
            "name": "Ray Greene",
            "url": "/name/nm0998576/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzg1MjM3MTM3Ml5BMl5BanBnXkFtZTcwODg3MjQyMQ@@._V1_.jpg",
    "keywords": "2000s,secret history,exploitation filmmaking,grindhouse film,grindhouse filmmaking",
    "name": "Schlock! The Secret History of American Movies",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BaronBl00d"
        },
        "dateCreated": "2006-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0286944/"
        },
        "name": "The Birth of the Independent Film and the Discovery of an Untapped Audience",
        "reviewBody": "Generally well-done, highly introspective detailing of the birth, evolution, rise, and demise of all those exploitation films of the fifties and sixties primarily. Ray Greene narrates, produces, and directs with obvious love for these films and those that made them. Along for informative interviews are Roger Corman, Samuel Arkoff, Harry Novak, David Friedman, and Doris Wishman. The film looks at the rise of these films in an almost clinical/historical approach. Greene tries to relate the film types - gore, nudie cutie, roadshow, etc... - within the historical context surrounding the times. While this undertaking might not seem all that complicated, the films and their distinctive types are legion. Greene does address most of them with enthusiasm and applicable film clips. It was very interesting hearing Corman and Dick Miller reminisce about some of their work in particular, and the documentary definitely got me excited about seeing some films I might not have otherwise seen. That is always a strength of any medium. The DVD has lots of very cool extras which include more interviews and even a weird short from a power company. I wish further examination had been explored into the 70s, perhaps the heyday of these films as far as I am concerned. And though the documentary has a distinct academic nature for a subject you would think could not lend itself to such treatment, everything provided is done so in a most entertaining way. If you love any of these films from the period, the documentary is definitely worth a look or two.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0286944/"
}