{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Katharina Wackernagel",
            "url": "/name/nm0905228/"
        },
        {
            "@type": "Person",
            "name": "Niels-Bruno Schmidt",
            "url": "/name/nm0773134/"
        },
        {
            "@type": "Person",
            "name": "Marlene Meyer-Dunker",
            "url": "/name/nm0583424/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 394,
        "ratingValue": 5,
        "worstRating": 1
    },
    "alternateName": "School's Out",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049524/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043143/"
        },
        {
            "@type": "Person",
            "name": "Kai Meyer",
            "url": "/name/nm0583222/"
        }
    ],
    "datePublished": "1999-11-10",
    "description": "After escaping from a nearby mental institution, a violent lunatic and sexual deviant terrorizes a group of seniors at their end-of-the-year high school dance.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Sigl",
            "url": "/name/nm0797459/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2RlMDdiMjktMzViMy00YzJmLWE2ZjktZjZhZTI5MmI2ZTEzXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "slasher,teen slasher,teen horror,slasher killer,serial murder",
    "name": "Schrei - denn ich werde dich töten!",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dellamorte_Dellamore07"
        },
        "dateCreated": "2004-08-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0220025/"
        },
        "name": "Tricked me, dammit!",
        "reviewBody": "This movie had a cool case, and the summary on the back actually sounded kinda cool (can't go wrong with people getting trapped inside something and stalked by a masked killer), but after two minutes of watching the this trash The word FAST FORWARD, or better yet EJECT popped into my mind continuously. The plot involves four teens and one of the guys sister getting locked in a private school while trying to set up tricks for their teachers, they also haven't heard the warning on the radio that a lunatic has escaped. WOW!..don't get me wrong, I love slasher pics, NEED them actually, i could watch a lot over and over, it's not about the story, but mainly what the director does with the material. There is little gore, the characters are ugly and boring (no it wasn't the REALLY BAD dubbing, but that still annoyed me)and there was no suspense.\n\nThe direction is to basic, what he thinks as stylish confuses me. How many times is he going to flash the killers weapon in front of the camera and hold them while the soundtrack blares it's epic over the top ho hum sleaze. There was only one little thing in this slop that interested me was the stalk sequence involving all these school board maps. That was pretty cool (Visual wise) but cut way to short. The chick as the opening victim (?or is she?) was dumber then rocks and freaking annoying. ON the back case summary it says the teens are \"preaparing for the big rave\", what rave?..that shitty excuse where their serving wine with plastic cups???..nice rave. Avoid this, especially if your a fan of slasher pics where people get trapped inside an enclosed area (michele Soavi's STAGEFRIGHT is a perfect example of this type of thing done right), this film is a childish excuse for SLASHER."
    },
    "url": "/title/tt0220025/"
}