{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Laurence Fishburne",
            "url": "/name/nm0000401/"
        },
        {
            "@type": "Person",
            "name": "Giancarlo Esposito",
            "url": "/name/nm0002064/"
        },
        {
            "@type": "Person",
            "name": "Tisha Campbell",
            "url": "/name/nm0132896/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7670,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029134/"
        },
        {
            "@type": "Person",
            "name": "Spike Lee",
            "url": "/name/nm0000490/"
        }
    ],
    "datePublished": "1988-02-12",
    "description": "A not so popular young man wants to pledge to a popular fraternity at his historically black college.",
    "director": [
        {
            "@type": "Person",
            "name": "Spike Lee",
            "url": "/name/nm0000490/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Comedy",
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODQzYzI5OTctMTAzMi00YWQ3LTliNWEtMmY2NjkzYTdiNGIxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "satire,male frontal nudity,male nudity,male rear nudity,fraternity hazing",
    "name": "School Daze",
    "original_info": {
        "id": "School Daze_1988",
        "name": "School Daze",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Jaime N. Christley"
        },
        "dateCreated": "1999-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096054/"
        },
        "name": "a blunder, but an early one",
        "reviewBody": "There are things I liked about \"School Daze.\" In particular, there was the scene near the end of the film between Giancarlo Esposito's Julian and his girlfriend. It's when he breaks up with her for sleeping with another student, all the while completely aware that he made her do it. I've actually seen guys do this -- trick their girlfriends into doing something that, later on, they can use as cause to dump them -- and the reality of the scene carried such a raw, emotional weight that it nearly derailed the rest of the film.\n\n\"School Daze\" is, first and foremost, a period piece of 1980s pop culture. Many of the sequences, especially the ones requiring dancing and choreography, are hopelessly dated, like early break-dancing videos.\n\nDated is okay, as long as there are other elements to counterbalance its datedness. Example: \"All That Jazz\" is a relic of Bob Fosse's toxic, overindulgent mind, a '70s time capsule item. However, the untouchable authority and supreme confidence he brought to it, along with the visual beauty, and the letter-perfect performances, made up for any drawbacks, and then some. \"...Jazz\" went from silly to sublime inside of sixty seconds.\n\nLee's direction is alarmingly hesitant and amateurish, giving no hint of the originality, vitality, and sheer genius he would display in his later films. It's certainly difficult to believe he made this film between \"She's Gotta Have It\" and \"Do the Right Thing.\" His editing is sloppy, his staging is slapdash, and the performances from his actors and actresses range from sleepy to histrionic. The stories lose their punch through careless juggling, and the illogical \"Wake Up!\" scene at the end is unearned and unwarranted. Most disappointing of all, the thing I value his films for most -- his constant pushing of the cinematic envelope in all sorts of unexpected ways -- is all but totally absent.\n\nI love most of Lee's films. I'll go so far as to say that he's one of the last risk-takers left in the business (Stanley Kubrick is dead, Quentin Tarantino is MIA, and anything done by Spielberg, God love him, automatically becomes non-risk). His \"Do the Right Thing\" is as good as any other film released in the '80s. The best thing I can say about this one is: I'm glad he got it out of his system."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2867773465",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTEyMjM2NTUtNWQ5YS00NzJmLThkMTktNWQxYzY4ZDUzMmQ5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTEyMjM2NTUtNWQ5YS00NzJmLThkMTktNWQxYzY4ZDUzMmQ5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-04-29T20:20:25.094Z",
        "url": "https://www.imdb.com/video/vi2867773465/"
    },
    "url": "/title/tt0096054/"
}