{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Neve Campbell",
            "url": "/name/nm0000117/"
        },
        {
            "@type": "Person",
            "name": "Courteney Cox",
            "url": "/name/nm0001073/"
        },
        {
            "@type": "Person",
            "name": "David Arquette",
            "url": "/name/nm0000274/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 357527,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055428/"
        },
        {
            "@type": "Person",
            "name": "Kevin Williamson",
            "url": "/name/nm0932078/"
        }
    ],
    "datePublished": "1996-12-20",
    "description": "A year after the murder of her mother, a teenage girl is terrorized by a masked killer who targets her and her friends by using scary movies as part of a deadly game.",
    "director": [
        {
            "@type": "Person",
            "name": "Wes Craven",
            "url": "/name/nm0000127/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2NjU5MTg5OF5BMl5BanBnXkFtZTgwOTkyMzQxMDE@._V1_.jpg",
    "keywords": "serial killer,slasher,masked killer,female protagonist,telephone call",
    "name": "Scream",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MadReviewer"
        },
        "dateCreated": "2001-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117571/"
        },
        "name": "Hate To Admit It, But It's Great",
        "reviewBody": "There's more than a few reasons to hate `Scream'; the main reason would be that the film single-handedly resurrected the teen-slasher genre, a movie category that had long been beaten to death. Because of the success of `Scream', witless horror crap like `I Know What You Did Last Summer' and `Urban Legend' got greenlighted, half the teenage casts of various WB television shows got summer acting jobs, and some awful scripts that should've been left dead and buried `Teaching Mrs. Tingle' got to see the light of day. `Scream' is responsible for a lot of garbage. But the truth of the matter is, `Scream' is also a phenomenal movie.\n\nThe plot of `Scream' is very simple: a masked knife-wielding maniac is busy stalking the students of High, killing them off one by one. The killer's inordinately obsessed with one girl, Sidney Prescott (Neve Campbell), who of course gets involved in the quest to unmask the killer. The catch (in case you don't already know it), though, is brilliant. Everyone in the film is familiar with all the slasher film conventions. They know that you shouldn't walk in the woods alone at night. They know that having wild sex is an unwritten invitation to be hacked to pieces. They know not to say things to each other like `I'm going outside for a cigarette; I'll be right back.' -- such statements are virtual death warrants. One of the best examples (and best characters) of this is Randy (Jamie Kennedy), the film-obsessed nut of the film, who actually goes so far as to muse what `real' actors and actresses should play the other characters in the film, going so far as to joke about who gets to be Tori Spelling. All the dumb conventions of slasher films are pulled out of the shadows, exposed for what they really are . . . and then, some of them get used anyway, because the characters willingly choose to ignore those conventions. Some cliches are thrown away, while others are embraced. `Scream' really turned the horror/slasher film genre on its ear, becoming the first truly suspenseful and exciting slasher film in many, many years simply because it suddenly had a million new avenues to explore. The film's self-awareness allowed to move in brand-new directions . . . and suddenly, scenes that used to be predictable in other slasher films suddenly become incredibly intense in `Scream'.\n\nDirector Wes Craven was perfect for this film -- as director of slasher classics like `Nightmare On Elm Street', he easily sets the visual feels and style of film to perfect evoke all the slasher films of yore . . . and then, much like `Scream's' script, chooses to either faithfully follow the tried and true, or to go off in competely unexpected directions. Either way, Craven manages to create a lot of absolutely nail-biting, thrilling scenes. He also doesn't hold back with the gore, which is always a plus in great slasher films. The acting ranges from barely mediocre to good -- Neve Campbell's okay as Sidney; Courtney Cox is pretty good as tart-tongued reporter Gail Weathers; Jamie Kennedy rules as Randy the film geek; and David Arquette is utterly bland and forgettable as Deputy Dewey Riley, the sad-sack policeman. But casts in slasher films don't particularly matter anyway; the good ones are all about suspense, terror, and gore. And in `Scream', Wes Craven provides massive amounts of all three of those criteria.\n\nThe irony is, `Scream' spawned dozens of imitators, and by spawning imitators, all the new avenues opened up by `Scream' quickly got old and boring once more. Still, purely on its own merit, it's an excellent film. The best slasher film of all time is still John Carpenter's `Halloween', without question, but `Scream' actually runs a close second. It's well worth watching. Grade: A-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Scream",
        "duration": "PT1M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1175821337",
        "name": "Scream: Blu-Ray",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGVhM2VmYzktZTUzOS00NmMzLWFhM2UtMThiY2I1YjRhYTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGVhM2VmYzktZTUzOS00NmMzLWFhM2UtMThiY2I1YjRhYTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-08-20T03:34:22Z",
        "url": "https://www.imdb.com/video/vi1175821337/"
    },
    "url": "/title/tt0117571/"
}