{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "József Madaras",
            "url": "/name/nm0534508/"
        },
        {
            "@type": "Person",
            "name": "György Cserhalmi",
            "url": "/name/nm0190691/"
        },
        {
            "@type": "Person",
            "name": "Ferenc Kállai",
            "url": "/name/nm0477570/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 148,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Season of Monsters",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044449/"
        },
        {
            "@type": "Person",
            "name": "Gyula Hernádi",
            "url": "/name/nm0379795/"
        }
    ],
    "description": "Monsters season - a teacher celebrates his 60th birthday at a rural summer house. Existentialism and philosophy is discussed among professors and students. A scary mystery play opens.",
    "director": [
        {
            "@type": "Person",
            "name": "Miklós Jancsó",
            "url": "/name/nm0417352/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2Q1NGVhYjAtZGMzZi00ZWFkLWExNTMtZDIxNDYyMDE5ZWIzXkEyXkFqcGdeQXVyNjM0NzMyNTQ@._V1_.jpg",
    "keywords": "teacher",
    "name": "Szörnyek évadja",
    "original_info": {
        "id": "Seasons: IMAX_1987",
        "name": "Seasons: IMAX",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ofumalow"
        },
        "dateCreated": "2020-08-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094094/"
        },
        "name": "The camera as perpetual motion machine",
        "reviewBody": "An academic returns from abroad to join others in celebrating their mentor's retirement. But after he's interviewed on television, he's found in his hotel room, having apparently committed suicide. The old professor's retirement party continues nonetheless, amidst songs, pyrotechnics, harassing helicopters, circus performers, random violence, TV monitors, naked women, and fragmentary philosophical arguments.\n\nIt's always hard to know with Miklos Jancso just how much meaning is lost on non-Hungarian audiences, but sometimes the ideas are universal enough and/or the camera choreography is riveting enough to transcend that. Here...not so much. As usual, there is definitely visual stimulus in the long, elaborate shots weaving through actors and actions that don't seem to have much purpose beyond being part of that photographed pageantry. The plot, such as it is, is a sort of murder mystery that escalates into full-scale carnage. Yet this too feels like a pretense for the stylistic acrobatics, particularly since Jesus himself (played by none other than a late-arriving Bela Tarr) is able to \"resurrect\" all the fallen victims without much effort.\n\nAs to just what all this meant as political metaphor in 1987 Hungary, it beats me. Perhaps the near-farcical chaos is representative of a state system that was on the verge of collapse, whether it knew it or not, though that or any other interpretation is somewhat weakened by the banality of the way in which comely young women (but never men) only seem to be here to shed their clothes-not so unlike a drive-in sexploitation movie, a genre that this director otherwise has absolutely nothing in common with. Jancso is never without interest, but I can't say this is the movie that would make a convert out of you, or would provide a good place to start with him.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0094094/"
}