{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Travis Potter",
            "url": "/name/nm1161065/"
        },
        {
            "@type": "Person",
            "name": "Brett Schwartz",
            "url": "/name/nm2372849/"
        },
        {
            "@type": "Person",
            "name": "Jake Jakovich",
            "url": "/name/nm2841837/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0225183/"
        }
    ],
    "datePublished": "2004-04-07",
    "duration": "PT40M",
    "genre": [
        "Documentary",
        "Short",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5NjQ0Nzg3MV5BMl5BanBnXkFtZTcwNTY0OTQ1MQ@@._V1_.jpg",
    "keywords": "wave,surfing,surfer,island,indonesia",
    "name": "Second Thoughts",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "spookyrat1"
        },
        "dateCreated": "2020-04-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1143910/"
        },
        "name": "Surfers Meet Survivor!",
        "reviewBody": "Second Thoughts\" deservedly won Movie of the Year at the 2004 SURFER Poll and Video Awards, putting its major creative force and narrator Timmy Turner front and centre in the surfing media spotlight. Over the span of three years and numerous trips to an uninhabited Indonesian island, Timmy documented himself and few of his compadres enjoying epic waves over dangerous reefs, as well as braving the elements and near-starvation in an at times, genuine struggle to survive on their island paradise.\n\nThe companions' on land adventures is what really separates Second Thoughts from other surfing films which concentrate more simply on the surfers and the waves they catch. Celebrating the extreme independence of both his film-making and his island lifestyle, Turner labels his film a feral production and in doing so, again loudly celebrates many surfers long - held beliefs, that as far as surf travel and adventures are often concerned less is more.\n\nThe boys arrive on the island in a rickety old fishing boat, which contrasts markedly with a modern extravagant cruiser which we see sidle up into the bay late in the film, carrying surfers paying $2000- for a 10 day trip. They bring an old dinghy, ostensibly to assist them get to waves, but which they admit never worked. They bring limited water and food rations, which they supplement with a goat and chooks, as well as what they can harvest through their own fishing. At various times we see them run short of food and water. Solutions include the slaughtering of the goat to make kebabs and water collection from an extremely suspect, scummy - looking brackish pond.\n\nThe waves are plentiful though and though the photography is not achieved on the most expensive, professional equipment, it undeniably has certified authenticity with plenty of early evidence at what Go-Pros were capable of, before every man and his dog cottoned on to purchasing them. The waves are big, hollow, and long. Timmy and his friends may not be the very best surfers in the world but they definitely hold their own in challenging waves and circumstances. If you've ever daydreamed about being stranded on a remote tropical island Second Thoughts may give you second thoughts, but also provide you with some food for thought along the way.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt1143910/"
}