{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carmelo Gómez",
            "url": "/name/nm0351029/"
        },
        {
            "@type": "Person",
            "name": "Charo López",
            "url": "/name/nm0530048/"
        },
        {
            "@type": "Person",
            "name": "Silvia Munt",
            "url": "/name/nm0613284/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1966,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Secrets of the Heart",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041539/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058930/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Person",
            "name": "Montxo Armendáriz",
            "url": "/name/nm0035404/"
        }
    ],
    "datePublished": "1997-03-19",
    "description": "Javi and his friend Carlos snoop around an old house on the way home from school. According to his brother Juan this is a haunted house and one can hear the voices of the dead. Later he is intrigued with a room which is always clo...",
    "director": [
        {
            "@type": "Person",
            "name": "Montxo Armendáriz",
            "url": "/name/nm0035404/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDEwZGNhYTctOWZlYy00Y2IwLWIwYmUtYzEzM2NjZjYwMjU4XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "suicidal death,reference to hunting,sex scene,spider eats fly,reference to the twist the dance",
    "name": "Secretos del corazón",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "khatcher-2"
        },
        "dateCreated": "2001-09-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120090/"
        },
        "name": "A little boy's thoughts, fears, secrets ........ are not just simple childishness",
        "reviewBody": "Montxo Armendáriz, who has also filmed shorts such as Carboneros de Navarra (1981), Ikuska 12 (1981), Ikusmena (1980, and Barregarriaren Dantza (1979) not listed in IMDb, is essentially Navarran rather than Spanish in most of his filmography. This is clearly seen in Tasio (1984)(qv), the film which made him well known. and in \"Secretos del Corazón\".\n\n`Secretos del Corazón', much the same as `Tasio', is an intimistic portrait of rural life in Navarra, though the focus of attention is totally different. Through the eyes of a ten year-old-boy, Javi (Andoni Erburu), we enter the mysterious world of growing up, in this case in the 1950s. The action moves from Pamplona, capital of Navarra, made famous by Hemingway unfortunately, to villages high up on the skirts of the Pyrenees. These villages, little more than an hour's car ride from where I am, offer delights to any traveller worth his salt. Ochagavía, situated high up the valley of the River Salazar, is formed mostly by noble late 17th/early 18th Century houses, with beautiful little streets and squares which are just delightful for having your tea and croissants any early-summer Sunday morning; Roncal, further to the east is famed for its cheese and sits astride the relaxing River Esca; further up the valley of Roncal you reach the delightful town of Isaba, picturesque, though tends to become a bit of a hustle and bustle at weekends. However, the spooky house is near Marcilla, at Barandalla, next to the sugar factory, way down to the south in the area known as the Ribera. How Armendáriz managed to get a train to pass just at the moments when the lads run pell-mell out of the gate, I do not know, as I have never seen a train pass through the derelict-looking railway station there.\n\nThe genius of Armendáriz is apparent here, even more than in `Tasio'. The story here is somewhat more tangible, and the many children in the film in general, and Andoni Erburu in particular, are extraordinary. Charo López is good; nice to see Silvia Munt again, so many years after `La Plaza del Diamante' (1981), but I was very attracted to Joan Valies playing the grandfather, sitting in his chair, who even had to have his hair combed for him, but whose mind still worked:\n\n<< `Do you know why I don't want to die?' `No.' `Nor do I' >>\n\n<< If you hit a child when he is speaking the truth, he will learn not to do so.' >>\n\nThere are some beautiful scenes of a spider's web, with the big spider in it, taken with the sun shining in through it. That web had to be moved from another house and placed there for the film! Such is the effort and detail Armendáriz is prepared to go to in order to reach his personal taste for perfection.\n\nYes, it is all there: the cows coming home in the evening to sleep at home in the stalls which form the ground floor of these houses in the sierra; the religious or just simply traditional customs of the villagers, revived in some cases for the making of the film; the mares coming home to foal; the beautiful golden browns of autumnal Pyrenees, beautifully filmed by Javier Aguirresarobe, and beautifully accompanied by Bingen Mendizábal's music. Talking about the music: there is a beautiful scene in which Javi is asking his old aunt, spinster, why she had never married and if it was because she did not want to `chingar'; she replied that she did not want to be bossed around by a man, and as she goes away to weep, Beethoven's Triple Concerto swells up on the old radio..... According to my `Diccionario María Moliner' the verb `chingar' has some uses in Costa Rica, usually meaning to play jokes, so can only deduce that its use here is a localism up in those Navarran villages. The film discloses some of that mysteriousness which when we grow up we conveniently forget about, a lot of silly childishness; however in this film the focus is very much a local one, very Spanish, such that maybe certain things might not be interpreted in the same way through other eyes - not that this would detract from the beauty of the film and understanding the empiric aspects.\n\nDo not lose the scene where the two little kids pay three pesetas to see a girl's knickers: she sits on a bench in the park in front of them, shows a little above the knees and walks off. The two lads look at each other, confused and frustrated:\n\n<< `Is that all? Shucks! We've been done....!' >>",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0120090/"
}