{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sandrine Bonnaire",
            "url": "/name/nm0094789/"
        },
        {
            "@type": "Person",
            "name": "Jerzy Radziwilowicz",
            "url": "/name/nm0705956/"
        },
        {
            "@type": "Person",
            "name": "Grégoire Colin",
            "url": "/name/nm0171499/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 908,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Secret Defense",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036989/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074586/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075707/"
        },
        {
            "@type": "Person",
            "name": "Pascal Bonitzer",
            "url": "/name/nm0094726/"
        },
        {
            "@type": "Person",
            "name": "Emmanuelle Cuau",
            "url": "/name/nm0190866/"
        },
        {
            "@type": "Person",
            "name": "Jacques Rivette",
            "url": "/name/nm0729626/"
        }
    ],
    "datePublished": "1999-10-01",
    "description": "Sylvie, a 30-year-old scientist, has to dig deeper and deeper into her own background.",
    "director": [
        {
            "@type": "Person",
            "name": "Jacques Rivette",
            "url": "/name/nm0729626/"
        }
    ],
    "duration": "PT2H50M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzg0ZmUzYjctZTE4NS00MmNiLTgwNmUtM2QyNjcxMjMwZWE4XkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "family relationships",
    "name": "Secret défense",
    "original_info": {
        "id": "Secret Defense_1998",
        "name": "Secret Defense",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oOgiandujaOo_and_Eddy_Merckx"
        },
        "dateCreated": "2010-06-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120665/"
        },
        "name": "Even for Rivette, a strange film!",
        "reviewBody": "A warning first off that if you have problems with slow tempo in movies you really aren't going to make it to the end of this one, because the tempo here is slooooow.\n\nThe plot concerns a cellular biologist by profession called Sylvie (Sandrine Bonnaire) and her attempt resolve a mystery concerning the death of her father a decade previously, prime suspect is his business associate Walser (Jerzy Radziwilowicz). The story is a tragedy by structure.\n\nSecret défense has been labelled a thriller by some, but verging on three hours and with only enough action to fill a single conventional thriller hour at the most, and that quite tame, your adrenal gland is going to be taking a kip during this movie. Furthermore the elements of the thriller genre are mostly joshed. For example, there's a date-stamped intertitle at the start of the movie that announces that it's Friday May 9th at 10 o'clock, it's the only title of it's kind in the movie and apropos of nothing, cocking a snook at the pointlessness of this genre convention. Action scenes are drained of dramatic impact and woodenly acted, as if they are reenactments or rehearsals. The scenes are pathetic, in that they are designed to make you feel the wretched stupidity and irreversibility of violence. Effects are no more complicated than the old blood capsule in the mouth. The plot seems carelessly anachronistic, hinging around a train murder that makes no sense: unfortunately throwing someone off a TGV and making it seem like an accident, due to modern safety precautions, is slightly less plausible than it would have been in Hitchcock's day. One minor annoyance is that telephone conversations are carried out by obvious voice-over from the voice at the end of the line, which carries no telephonic distortion. Still this is probably conspicuous lack of care.\n\nThere are two great things going on with the movie though. The first is the simple joy in listening to people speak deeply that characterises the best New Wave films. Just simple things like the admission of the housekeeper Marthe that she never really had a childhood because she was always big inside her head. The second thing is the subtle photography of great New Wave cinematographer William Lubtchansky, who unfortunately passed away earlier this year. The exact allure of his work is hard to point a finger at, there is nothing mannered about his style. He manages threat very well here, just through little things, like having a coach driving up the road behind Sylvie whilst she is walking at night and pulling up in front of her, perfectly normal yet alarming on an animal level, or having trains crash past at the station. Warnings occur as well, a yellow hazard sign in the corner of the screen at the lab, a red warning light on the metro line, used rather than placed, all very natural. The value is often more to do with absence than anything else, I never saw anything in the movie that was visually inappropriate, that didn't feel right, Lubtchansky seems to have a feeling for what fits, for what works, an organic economy and a lack of extravagance that filled me with slow-burn joy. My favourite shot perhaps was in the mansion, where Sylvie walks through a gloomy room towards the garden and becomes silhouetted from behind, a sign perhaps of the darkness enveloping her. I also liked the psychological significance of the landscape backgrounds during train scenes, Sylvie full of clarity and deadly intent travels to the visual accompaniment of flat verdant blur; later with her mother the speed is slower, the landscape cluttered with a sprawling carpet of white buildings, disorganised, encumbering, again images used not forced.\n\nIt's a movie perhaps about folly perhaps. Sylvie ignores the patient wooing of an urbane work colleague to concentrate on raking up the past. Both Sylvie and Walser are slaves of their work. A note to all plate-spinners: the plates will carry on spinning without you! The one constant of any large organisation is the superfluity of absolutely any individual. Incidentally Sylvie's work world was rendered quite well, back at university I used to do lab work in a cellular biology lab, Sylvie was there using a Gilson's pipette correctly and expelling the tips, which was quite nostalgic for me. According to the credits the scenes were actually shot in the labs of the Institut Pierre et Marie Curie in Paris.\n\nThe soundtrack consists of only two songs which play over the start and end of the credits, one piece is by Spanish Renaissance composer Pedro Guerrero and is a \"moresca\" called \"Di, perra mora\", \"Variation: Moorish whore\" the other an anonymous piece also from the same era \"Diferencias sobre las Vacas\", or \"Cow variations\". Morescas were grotesque foolish dances where the dancers often posed as blacked-up Moors. I think the implication is that we're seeing some sort of timeless farce, with the characters condemned to repeat foolish steps, despite the presence of reason.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0120665/"
}