{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Arquette",
            "url": "/name/nm0000274/"
        },
        {
            "@type": "Person",
            "name": "Michael Clarke Duncan",
            "url": "/name/nm0003817/"
        },
        {
            "@type": "Person",
            "name": "Leslie Bibb",
            "url": "/name/nm0004753/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9478,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108864/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024939/"
        },
        {
            "@type": "Person",
            "name": "George Gallo",
            "url": "/name/nm0303032/"
        },
        {
            "@type": "Person",
            "name": "Gregory Poirier",
            "url": "/name/nm0201304/"
        },
        {
            "@type": "Person",
            "name": "Dan Baron",
            "url": "/name/nm7971037/"
        }
    ],
    "datePublished": "2001-03-02",
    "description": "A mailman takes care of a dog that, unbeknownst to him, is an FBI drug-sniffing superdog that has escaped from the witness protection program after becoming the target of an assassination.",
    "director": [
        {
            "@type": "Person",
            "name": "John Whitesell",
            "url": "/name/nm0925870/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwNjg4MTk1NF5BMl5BanBnXkFtZTYwMjE4Nzc5._V1_.jpg",
    "keywords": "postal worker,police officer,little boy,dog,dog movie",
    "name": "See Spot Run",
    "original_info": {
        "id": "See Spot Run_2001",
        "name": "See Spot Run",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "inkblot11"
        },
        "dateCreated": "2010-12-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250720/"
        },
        "name": "Although the humor is low-brow slapstick, this movie is still funny and features an adorable boxer dog; parents, you might want to preview first",
        "reviewBody": "Gordon (a blonde David Arquette) is a mailman who often runs into trouble with the canines on his route, one especially so. As a joke, fellow carriers place a spotted stuff dog in his locker, making him jump. Very funny, says Gordon. But, the stuffed puppy comes in handy, for Gordon gives it to the son, James (Angus T. Jones) of a lady, Stephanie (Leslie Bibb) he has been courting. They all live in the same apartment building. Meanwhile, a talented police dog, Spot, has taken a bite out of a local mobster (Paul Sorvino), in the process of his capture. This goon vows to \"get\" the boxer cop so the feds decide to send the canine to a safe place in Alaska. However, the mob has one of their own planted as the escort and she arranges a different route to the mob headquarters. Spot, very bright, sees a way to escape and does so. He ends up jumping into the back of Gordon's mail car, where James is also riding, due to an emergency babysitting need of Stephanie's. Although initially petrified of Spot, Gordon grows to love him and James, too. But, naturally, the mob is still searching for the dog and the trail is not hard to follow. Will Gordon, James, and Spot be in captured by the bumbling mob henchmen? This an entertaining flick in many ways, despite humor that is more of the low-brow, slapstick variety. The cast is fine, the action rarely slows and, of course, the canine is adorable and expressive. Angus T. Jones, who went on to fame as the child in Two and a Half Men is very young and cute here while Arquette generates big laughs. Ditto the gentleman who plays Spot's partner in policework. The California setting, the costumes, the camera work, and the lively script/direction add up to fun. However, there are a few possibly objectionable moments. The mobster is bitten in the private parts area, which some will find sleazy. Also, a dog's shock collar ends up on Gordon and the remote in James' hands, with the resulting electrocution played for laughs but of which parents may find rather unfunny. There are one or two other such moments that could have been eliminated or changed. But, all in all, this movie will result in some big smiles for its viewers. Therefore, do See Spot and share it with others.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2206597401",
        "name": "See Spot Run",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmViYzVhNWEtMTIwMi00N2EyLWJiYmEtMDY4NDI1ODE2NjIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmViYzVhNWEtMTIwMi00N2EyLWJiYmEtMDY4NDI1ODE2NjIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:00:57Z",
        "url": "https://www.imdb.com/video/vi2206597401/"
    },
    "url": "/title/tt0250720/"
}