{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sidney Poitier",
            "url": "/name/nm0001627/"
        },
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Richard Kiley",
            "url": "/name/nm0453006/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 726,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0117169/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137352/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0226026/"
        }
    ],
    "datePublished": "1991-04-07",
    "description": "A dramatization of the American court case that destroyed the legal validity of racial segregation.",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2NjUxNjI1NV5BMl5BanBnXkFtZTcwOTc0NzYxMQ@@._V1_.jpg",
    "keywords": "tv mini series,social commentary,crotchety old man,court,segregation",
    "name": "Separate But Equal",
    "original_info": {
        "id": "Separate But Equal_1991",
        "name": "Separate But Equal",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "asad_raza"
        },
        "dateCreated": "2004-07-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102879/"
        },
        "name": "They play in the streets together, they separate to go to school",
        "reviewBody": "`John, if this case goes before the Supreme Court. . . I'm gonna need you'\n\nIt's the early 1950's, in America. The governor of South Carolina (James Francis Byrnes), in his 70's at the time, pays a visit to his friend, the famous John W. Davis. Davis had argued 138 cases in front of the Supreme Court. Byrnes was turning to him for help.\n\nByrnes was determined to show that discrimination and segregation of public schools were not the same thing. He wanted black school children to have equal schools. He was ashamed of the terrible condition the black schools were in, in his state of South Carolina. He even levied a three percent sales tax to fund the improvement of black schools. He was prepared to spend 75 million dollars to improve the public schools for black children in his state.\n\nBut he knew, that the small case that a few courageous people (Harry Briggs, Reverand J.A. Delaine) had started in Clarendon county, SC, was too big of an issue for his efforts alone. The case was on it's way to the Supreme Court of the United States of America. \n\nThe National Association for the Advancement of Colored People (the NAACP), had become involved. Their head lawyer, Thurgood Marshall had combined this case and 4 other similar cases (from Delaware, Kansas, DC and Virginia) into one called 'Brown v. Board of Education', and made it his mission to strike down segregation in public schools in America.\n\nThe great thing about this movie is how it makes each side look respectable. The movie does not make this a 'bad evil white men against poor suffering black people' type of story. But rather, the film, portrays the white men as being highly respected, educated and willing to do the right thing. But at the same time, very concerned and perhaps even afraid of the consequences of their decisions.\n\nI also loved the humor in this film. For example when Byrnes is conversing with Davis and says 'I admit to past sins, our colored schools are a disgrace'. Or when one of the lawyers at the NAACP legal defense fund says about the South Carolina case \"If we win this one, we'll only have 11,172 school districts left\"\n\nThe heart of this film is the uncommon courage of the people. Courage among so many involved. Of course, first from the blacks from those small towns, who risked their jobs and safety, and faced the hate of the Ku Klux Klan, by taking these complaints to their local lawyers. Then, to the NAACP, for climbing this long and expensive uphill battle. But also, to the judges on the Supreme Court, and in particular the Chief Judge Earl Warren.\n\nWarren was quoted as saying 'Everything that I did in life that was worthwhile, I caught hell for'. What a difficult decision, but what a remarkable effort on his part to unite the nine members of the Supreme Court to conclude the case with a unanimous decision to end segregation in public schools in America.\n\nIt took a lot of brave people on both sides, to end separation of black and white school children in public schools. Perhaps Thurgood Marshall summed it up best, when he mocked the thinking of people in the south by saying 'you can have them attending the same State Universities and Graduate schools, but if they attend the same elementary and high schools together, the world would fall apart.'\n\nA wonderful treasured movie. Must see for all."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Separate But Equal",
        "duration": "PT3M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1619246105",
        "name": "Separate But Equal",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWFmMGM4M2MtMzkyYS00ODRhLTg1ZGYtNTgxMzIxMTQ2ZjNjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWFmMGM4M2MtMzkyYS00ODRhLTg1ZGYtNTgxMzIxMTQ2ZjNjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-22T21:54:37.082Z",
        "url": "https://www.imdb.com/video/vi1619246105/"
    },
    "url": "/title/tt0102879/"
}