{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maryam Karimi",
            "url": "/name/nm1235696/"
        },
        {
            "@type": "Person",
            "name": "Mohamad Dolati",
            "url": "/name/nm5599991/"
        },
        {
            "@type": "Person",
            "name": "Agelem Habibi",
            "url": "/name/nm5600016/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5788,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "September 11",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0090805/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0139641/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007212/"
        },
        {
            "@type": "Person",
            "name": "Alain Brigand",
            "url": "/name/nm1240977/"
        },
        {
            "@type": "Person",
            "name": "Youssef Chahine",
            "url": "/name/nm0149631/"
        },
        {
            "@type": "Person",
            "name": "Sabrina Dhawan",
            "url": "/name/nm0223526/"
        }
    ],
    "datePublished": "2002-09-11",
    "description": "The effects of the 9/11 terrorist attacks are told from different points of view around the world.",
    "director": [
        {
            "@type": "Person",
            "name": "Youssef Chahine",
            "url": "/name/nm0149631/"
        },
        {
            "@type": "Person",
            "name": "Amos Gitai",
            "url": "/name/nm0321159/"
        },
        {
            "@type": "Person",
            "name": "Shôhei Imamura",
            "url": "/name/nm0408076/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzkxMjI4MjYtNjYzMC00ZTE1LWJlNjAtNWIyYzU3Njc3ODRiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "chilean exile,chilean coup d'etat 1973,day of infamy,9 11 01,month in title",
    "name": "11'09''01 - September 11",
    "original_info": {
        "id": "September 11_2002",
        "name": "September 11",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2005-10-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328802/"
        },
        "name": "Great Idea  Different Views of the Intolerance in the World",
        "reviewBody": "This collection of eleven short stories in one movie is a great idea, and presents some great segments, but also some disappointing surprises. Based on the tragic event of the September 11th 2001 in the United States of America, eleven directors were invited to give their approach to the American tragedy. The result of most of them is not only an individual sympathy to the American people, but mainly to the intolerance in the world with different cultures and people.\n\nKen Loach (UK) presents the best segment, about the September 11th 1973 in Chile, when the democratic government of Salvador Alliende was destroyed by the dictator Augusto Pinochet with the support of the USA.\n\nThe other excellent segments are the one of Youssef Chahine (Egypt), showing the intolerance in the world, and the number of victims made by USA governments in different countries along the contemporary history; and the one of Mira Nair (India), showing a true story of injustice and prejudice against a Pakistanis family, whose son was wrongly accused of terrorism in USA, when he was indeed a hero.\n\nSome segments are beautiful: Samira Makhmalbaf (Iran) shows the innocent Afghans refugee children preparing an inoffensive shelter against bombs, while their teacher tries to explain to them what happened on the other side of the world; the romantic Claude Lelouch (France) shows the life of a couple in New York nearby the WTC; Danis Tanovic (Bosnia-Herzegovina) shows the effects of their war in a small location and the lonely protest of widows; Sean Penn is very poetic, showing that life goes on; and Shohei Imamura's story is probably the most impressive, showing that there is no Holy War but sadness and disgrace.\n\nThe segment of Idrissa Quedraogo (Birkina Faso) is very naive, but pictures the terrible poor conditions of this African nation.\n\nThe segment of Amos Gital (Israel) is very boring and manipulative, showing more violence and terrorism.\n\nThe segment of Alejandro González Iñárritu is very disappointing, horrible, without any inspiration and certainly the worst one.\n\nMy vote is seven.\n\nTitle (Brazil): \"11 de Setembro\" (\"September 11\")",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0328802/"
}