{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Cusack",
            "url": "/name/nm0000131/"
        },
        {
            "@type": "Person",
            "name": "Kate Beckinsale",
            "url": "/name/nm0000295/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Piven",
            "url": "/name/nm0005315/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 116223,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018522/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044742/"
        },
        {
            "@type": "Person",
            "name": "Marc Klein",
            "url": "/name/nm0458884/"
        }
    ],
    "datePublished": "2001-10-05",
    "description": "A couple search for each other years after the night they first met, fell in love, and separated, convinced that one day they'd end up together.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Chelsom",
            "url": "/name/nm0155093/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzc3Yjg1MmUtODllMy00MmZkLTgyNDAtZDg0N2I4OWEzZTkxXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_.jpg",
    "keywords": "fate,destiny,serendipity,christmas,coincidence",
    "name": "Serendipity",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FlickJunkie-2"
        },
        "dateCreated": "2002-05-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0240890/"
        },
        "name": "Enchanting romantic comedy",
        "reviewBody": "This charming romantic comedy has all the right ingredients and serves up a bouillabaisse of schmaltzy romance and slapstick fun. Jonathan (John Cusack) and Sara (Kate Beckinsale) meet in Bloomingdales when they both want to purchase the same pair of gloves. The attraction is instant and they spend a romantic evening cavorting around New York City together. At the end of the evening John wants to see her again, but Sara decides that if it is fate that they should be together, they will find each other again. She drives away in a cab and he never sees her again. Well, almost never.\n\nYears go by and both of them are about to be married, but each still has this nagging feeling that the other was his/her one true love. Of course fate conspires to bring them back together (after about a dozen near misses) as they each simultaneously undertake one last attempt to find one another just before they get married to someone else.\n\nThe fate angle is plowed mercilessly, almost to the point of nausea, but the skits are funny and the chemistry between Cusack and Beckinsale is enchanting. Cusack is an expert at playing the tortured and neurotic lover, but here he is more haunted and forlorn than dysfunctional, and it plays much better than his previous two characters in `High Fidelity' and `America's Sweethearts'. \n\nKate Beckinsale rocketed from obscurity to prominence with her performance in `Pearl Harbor' and proves to be a wonderful romantic lead in this film. She is breezy and adorable and spins a delightful web around Jonathan and the viewer. The film also benefits from outstanding comedic support from Jeremy Piven as Jonathan's best friend and devoted Sara sleuth. Piven's zany comedy proves to be the perfect complement to Cusack's wry despondency. Eugene Levy is a scream as the eccentric Bloomingdales salesman, who blackmails Jonathan into buying half the store to give him information from Sara's charge account.\n\nAll in all, this is an entertaining comedy that is insubstantial but delectable. I tend to give romantic comedies a little more slack, because I'm a sucker for this slush, and this is one of the better ones I've seen in a while so I rated it a 9/10. This lighthearted romp makes a great date flick, but if serious drama is your preference stay away.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #3",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi735092249",
        "name": "Serendipity",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzc5NjEwNDYtZTM4ZS00OWRiLTlmZWMtYjljODgwOWQxNjkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzc5NjEwNDYtZTM4ZS00OWRiLTlmZWMtYjljODgwOWQxNjkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:45:02Z",
        "url": "https://www.imdb.com/video/vi735092249/"
    },
    "url": "/title/tt0240890/"
}