{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brooke Smith",
            "url": "/name/nm0807548/"
        },
        {
            "@type": "Person",
            "name": "Marylouise Burke",
            "url": "/name/nm0121793/"
        },
        {
            "@type": "Person",
            "name": "Mark Woodbury",
            "url": "/name/nm0940202/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6587,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017323/"
        },
        {
            "@type": "Person",
            "name": "Daniel Minahan",
            "url": "/name/nm0590889/"
        }
    ],
    "datePublished": "2001-05-25",
    "description": "A TV program selects people at random to kill one another for fame and their freedom.",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel Minahan",
            "url": "/name/nm0590889/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzFiOWEyNWItMTZhZC00ZTc2LWI5OTEtMjQ2ZGNkM2M1NjA3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "game of survival,last man standing,fictional game show,fictional reality show,manhunt",
    "name": "Series 7: The Contenders",
    "original_info": {
        "id": "Series 7: The Contenders_2001",
        "name": "Series 7: The Contenders",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2002-09-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0251031/"
        },
        "name": "\"Reality\" to the Nth Degree",
        "reviewBody": "Fans of `reality' TV are going to love this one, and even those whose tastes run contrary to such offerings are going to find this indie film a riveting experience. Like `Survivor,' the name of the game here is, well...survival; but with one significant difference from any of the shows you've seen on television: The winner in `Series 7, The Contenders,' written and directed by Daniel Minahan, will be the only one from among the contestants still standing at the end of the show, meaning `alive.' Yes, that's right, the object of the game here is to eliminate the opposition, as in `kill' them-- by whatever method available. Guns, knives, bombs, blunt instruments, anything goes; whatever it takes to do in the other guy (or gal). And it ain't over till it's over, which means when five are dead, and only one remains. \n\nOf the six in contention this week, the returning champion, with ten kills to her credit, is 30ish Dawn Lagarto (Brooke Smith), who also happens to be eight months pregnant. She'll be pitted against Connie Trabucco (Marylouise Burke), a nurse; Tony Reilly (Michael Kaycheck) a husband and father of three; Franklin James (Richard Venture), the oldest of the bunch; teen Lindsay Berns (Merritt Wever); and finally, Jeffrey Norman (Glenn Fitzgerald), an ex-boyfriend of Dawn's, who has his own reasons for being in the game. And so it begins; and the question now is, of the six, which will become the hunters, and which the hunted? Does Dawn stand a chance of putting five more notches on her scorecard? Or this week, will one of the other five prevail, and walk away with the cash? Or, more notably, be the `one' who is able to do so.\n\nIt was inevitable that this film-- or one like it-- would be made, given the way television has been saturated with `reality,' the past few years. And since it had to happen, at least it was born of, evolved and guided by the artistic capabilities of Minahan, who has crafted and delivered a gripping, thought provoking satire that reaches it's apex of effectiveness hours, or even days, after the film has ended; because for anyone with any scruples at all, this film will linger in the memory like a phosphene caused by rubbing the eye, and it'll take that long to even begin to sort out the myriad implications of it all. The obvious question/message of the film is, of course, just how far should/could/can society go in this direction before realizing the consequences of the moral turpitude `reality' shows must necessarily embrace to be successful. Minahan does not moralize overtly, however; rather, he very subtly plants the suggestion of what the next step in real life may be within the matter-of-fact presentation and context of his story. And he does it with such precision that it is not until much later that the full impact of it hits you, and it's then that you understand how extremely appalling and depraved the concept is when extrapolated to the nth degree, as Minahan so aptly illustrates here. \n\nMinahan's approach may be more clever than imaginative, as his film plays out as if it were lifted from the negative of `Survivor' or one of it's clones. But it's cleverness at it's best. A film cannot seem this true-to-life and entirely natural without a lot of hard work that includes technical knowledge, an eye for detail and an impressive grasp of human nature; Minahan didn't just walk onto the set one day and crank out such an accurate duplication of a `reality' show. It begins with the astute insights Minahan weaves so incisively throughout his screenplay, and culminates in the way he translated it all to the screen. Watching this film is something akin to watching Jim Carrey early in his career doing Henry Fonda, or Kevin Spacey doing Christopher Walken or Pacino; it's the kind of professional impersonation/interpretation that just doesn't get any better.\n\nWhat makes it so enthralling is that Minahan so succinctly captures that documentary look and feel of what has become a `genre' of television, and like the best of them, he lets you get to know the contestants-- through interviews and `mini-bios'-- before the bloodbath begins, so that you can pick your favorites and put your money on the one you think has what it takes to win. He creates a genuine `sporting event' atmosphere, which works at the time-- it puts you in the moment and draws you into the action-- but in retrospect, it makes all that has transpired and everything you've witnessed seem even more disconcerting (which is, of course, the idea). And you realize, finally, that you've been duped into accepting the unacceptable, and moreover, made to believe by some perverse rationalization of thought that it was all right; which in itself is a keen observation of the power of the medium through which it is proffered.\n\nTo make the `reality' convincing, the performances, of course, had to be convincing; and they are. Minahan extracts precisely what was needed from his actors to really sell the show, beginning with Brooke Smith's portrayal of Dawn. This is the central character of the film, so it was imperative that she be especially believable, and Smith pulls it off beautifully. As you watch her, you never get the feeling that you're watching an actor; in keeping with the documentary feel of the film, this is Dawn, a young, pregnant woman involved in a game of killing for cash. it's a solid performance, the kind of which is often overlooked or taken for granted precisely because it is so natural. \n\nThe supporting cast includes Donna Hanover (Sheila), Angelina Phillips (Doria), Nada Despotovich (Michelle) and Alex Yershov (Nathan). To call this film pure entertainment would be wrong; to call `Series 7, The Contenders' an entertaining indictment against moral sense and sensibility, however, would be accurate. It's one that's definitely going to make you stop and think; and consider. 7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0251031/"
}