{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jim Henson",
            "url": "/name/nm0001345/"
        },
        {
            "@type": "Person",
            "name": "Frank Oz",
            "url": "/name/nm0000568/"
        },
        {
            "@type": "Person",
            "name": "Caroll Spinney",
            "url": "/name/nm0818973/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14446,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-Y",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060192/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062101/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058596/"
        },
        {
            "@type": "Person",
            "name": "Joan Ganz Cooney",
            "url": "/name/nm0177760/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Morrisett Jr.",
            "url": "/name/nm11494854/"
        }
    ],
    "datePublished": "1969-07-21",
    "description": "On a special inner city street, the inhabitants, human and muppet, teach preschool subjects with comedy, cartoons, games, and songs.",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODM4NDI3OTcxN15BMl5BanBnXkFtZTgwNjc3MjIwMTI@._V1_.jpg",
    "keywords": "puppet,the muppets,educational,rap music,disability",
    "name": "Sesame Street",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Megan_Koumori"
        },
        "dateCreated": "2003-12-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063951/"
        },
        "name": "Beautiful and bitter memories...",
        "reviewBody": "I wrote in another review on this site about how I was born to a military family stationed in Germany, Land of No Cable (And the world's best chocolate, but that's another story.).\n\nAnyway, one of the few kid's shows on TV that my grandparents didn't have to record and send over was Sesame Street, and the only one that was on the entire eight years we were there (Eureka's Castle was on for bit, but then one day it vanished. Same thing with Lampchops.). On my dad's side of the family, everyone had a Sesame Street character that they had a bond with (Dad's was Cookie Monster), and naturally, I followed the tradition by latching on to Ernie. Many a night I could be heard singing \"Rubber Ducky\" in the tub (I had two Rubber Duckies, but one got chucked because it got moldy, I think). To this day, I still hold Ernie dear to my heart (I even have a \"Tickle Me Ernie\", much, much cuter than \"Tickle Me Elmo\"!)\n\nNot only did Sesame Street give me Ernie to love and make me laugh, but like everyone else who watched this show, it taught me to read and count. Then one day, this obnoxious bear showed up on Sesame Street, whining about Goldilocks stealing his porridge. I hoped he wouldn't be a permanent addition to the cast. Everyday, I'd turn on the set, and there he was, screeching in that high pitched voice of his. Soon, I stopped watching Sesame Street because I was so sick of Baby Bear. I was seven years old, and I had been watching Sesame Street for seven years.\n\nOver the years, I did what all kids do, grew up. But about three years ago, I turned on Sesame Street again, and BABY BEAR IS STILL THERE!!! Not only that, some doofus gave Elmo a twenty minute segment, in which he spends most of those twenty minutes hopping around singing, \"Dee dee da dee, Elmo's World!\" over and over! And BABY BEAR IS STILL THERE!!! Horrible still, I hardly ever get to see my beloved Ernie and his Ol' Buddy Bert anymore. Worse of all, BABY BEAR IS STILL THERE!!!\n\nSo yes, Elmo may have ruined Sesame Street permanently (Unless God decides to raise Jim Henson from the dead), but for me, the death of Sesame Street came with the introduction of Baby Bear. So thanks a lot, you big throw rug! I hope the rest of the cast gets wise and turns you into a fur coat!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Sesame Street Holiday Special from HBO.",
        "duration": "PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4107777561",
        "name": "Tonight at 7 p.m.",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjEzNDI2Mzg1OV5BMl5BanBnXkFtZTgwMTQ3NDc2MDI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjEzNDI2Mzg1OV5BMl5BanBnXkFtZTgwMTQ3NDc2MDI@._V1_.jpg",
        "uploadDate": "2016-11-23T04:50:21Z",
        "url": "https://www.imdb.com/video/vi4107777561/"
    },
    "url": "/title/tt0063951/"
}