{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Buster Keaton",
            "url": "/name/nm0000036/"
        },
        {
            "@type": "Person",
            "name": "Ruth Dwyer",
            "url": "/name/nm0245536/"
        },
        {
            "@type": "Person",
            "name": "T. Roy Barnes",
            "url": "/name/nm0055797/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10854,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0081891/"
        },
        {
            "@type": "Person",
            "name": "Roi Cooper Megrue",
            "url": "/name/nm0576362/"
        },
        {
            "@type": "Person",
            "name": "Clyde Bruckman",
            "url": "/name/nm0115669/"
        },
        {
            "@type": "Person",
            "name": "Jean C. Havez",
            "url": "/name/nm0369841/"
        }
    ],
    "datePublished": "1925-03-15",
    "description": "A man learns that he will inherit a fortune if he marries by 7PM that evening.",
    "director": [
        {
            "@type": "Person",
            "name": "Buster Keaton",
            "url": "/name/nm0000036/"
        }
    ],
    "duration": "PT56M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjQ3MjM4NTItMTQ0Mi00OWFiLTk3NDMtYTM2MzBlNDdjOWYxXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "slapstick comedy,desperate to marry,deadline for marriage,marriage for money,country club",
    "name": "Seven Chances",
    "original_info": {
        "id": "Seven Chances (Silent)_1925",
        "name": "Seven Chances (Silent)",
        "year": "1925"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ecjones1951"
        },
        "dateCreated": "2006-01-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0016332/"
        },
        "name": "Terrific introduction for those new to Keaton",
        "reviewBody": "Contrary to what you may have read, \"Seven Chances\" (1925) was made before Buster Keaton signed with MGM and relinquished artistic control over his own films. His gifts of extraordinary agility, timing, and visualizing the comic potential in the most mundane situations are everywhere in evidence.\n\nThe plot of \"Seven Chances\" is ancient. A young bachelor stands to inherit millions if he can find a bride by a certain day and marry at a certain hour. The date is invariably the same as the day the will is read, and in the hands of Keaton, his writers and cast, the comic possibilities are brilliantly exploited. The same premise was the basis for at least three other films before Keaton's, and was remade (abysmally -- from what I've read) as \"The Bachelor\" with Chris O'Donnell in 1999. The chain of events that flows from news of the inheritance just builds and builds over the course of the film, the gags growing increasingly clever as time grows shorter. \"Seven Chances\" clocks in at less than an hour, but the final 15 minutes (which Buster Keaton reportedly reworked several times) are among the most hilarious in all of silent film, perhaps in the history of screen comedy.\n\nInitially, only Buster, his business partner (T. Ray Brown) and the lawyer (Snitz Edwards, who was so terribly homely he was cute) are aware of the dilemma. After Buster botches a proposal to his longtime girlfriend, (Ruth Dwyer), he pops the question to several more female acquaintances, with predictably embarrassing results. It is then that Brown and Edwards (unbeknownst to Buster) decide to place a newspaper announcement advertising his plight.\n\nOnce the newspapers hit the streets, the chase is on. Keaton is pursued through 1920s Los Angeles by dozens, then scores, then seemingly hundreds of would-be brides. They come in all ages, shapes and sizes, makeshift veils trailing after them. No obstacle is too great in their pursuit to beat out each other for the prize of marriage to a man they don't even know, and Buster throws out plenty of roadblocks in his wake.\n\nIn 1979, Walter Kerr wrote the definitive book on silent comedies, \"The Silent Clowns.\" One of the jacket blurbs reads, \"I found myself laughing out loud at routines from movies I have never seen.\" I don't have Kerr's gift, but I can tell you that \"Seven Chances\" is the most consistently funny movie Buster Keaton ever made. All of his movies include inventive sight gags, but \"Seven Chances,\" more than most of Buster's movies, relies on character comedy as well as situational comedy for its humor. And it scores a bull's eye on both. A sheer delight.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3577069337",
        "name": "Trailer [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTUxNzY1MzYtN2MzMS00Yzc0LWIyNmMtYTE1ZmJhYTlkMDI4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTUxNzY1MzYtN2MzMS00Yzc0LWIyNmMtYTE1ZmJhYTlkMDI4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-11-29T13:49:03.063Z",
        "url": "https://www.imdb.com/video/vi3577069337/"
    },
    "url": "/title/tt0016332/"
}