{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nick Brimble",
            "url": "/name/nm0003818/"
        },
        {
            "@type": "Person",
            "name": "Zdenek Maryska",
            "url": "/name/nm0555753/"
        },
        {
            "@type": "Person",
            "name": "Rich Gold",
            "url": "/name/nm0325063/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2116,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002789/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057092/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012982/"
        },
        {
            "@type": "Person",
            "name": "Dirk Ahner",
            "url": "/name/nm0004308/"
        }
    ],
    "datePublished": "2000-11-30",
    "description": "A grieving woman suffers terrifying visions of her own demise after she and her husband move into a country mansion.",
    "director": [
        {
            "@type": "Person",
            "name": "Sebastian Niemann",
            "url": "/name/nm0631093/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg1ODM0NjUwOF5BMl5BanBnXkFtZTcwOTMyMTcyMQ@@._V1_.jpg",
    "keywords": "tape over mouth,woman wears only a man's shirt,bound and gagged,grieving woman,tied to a bed",
    "name": "Seven Days to Live",
    "original_info": {
        "id": "Seven Days to Live_2000",
        "name": "Seven Days to Live",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "casey_choas66"
        },
        "dateCreated": "2003-05-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0221928/"
        },
        "name": "****1/2 out of 5",
        "reviewBody": "7 Days to Live is a horror film so short, sweet and to the point that it nearly speaks for itself. To place thing into jaunt terms, if you are looking for an relentless trip into insanity that is sure to make the hair on the back of your neck stand up for weeks on end, 7 Days wins on every level. The dynamical experience of this film would be equal to hiding in a huge steel pipe, away from a raging psychopath on the run, who bangs the pipe to indicate each step he takes closer to your demise. It presents a strange grouping of innate puzzles that stretch down an endless tunnel into eternity. This tunnel of oblivious mind games becomes enthralling because it is string up on lies, deceit, and aggravation, where the answers are closer to the truth than the truth itself. The story in itself is an incredibly simple picture book of surprises. A writer named Martin and his wife Ellen move out of town to the secluded country side, only to inhabit a estate where strange things have occurred in the past, shown during the prologue. We also learn of the death of Ellen's young son from an accidental choking years earlier. She has still not come to terms with this horrid fracture. Martin has strayed from the town in hopes of producing another number one best seller after his last few publications flopped. After moving into the home Ellen begins to see visions, prophesying the end of her life's term. She sees a seven etched into her steam covered bathroom mirror after a hot shower. She also sees a road sign that states she has six days to live and so on. Fearing the worst, Ellen seeks mental help, due to lack of motivation from her working husband. She visits the family doctor only to be told that she still blames herself for the death of her son and her body feels the need to punish her mind for it. This film plays as simply astonishing. The environment casts a wretched shadow like a vivid house of mirrors from an abandoned carnival. It slowly eats away at your nerves until you just can't take it anymore; you know something is going on but refuse to believe it for fear of yourself. But never does it become an in-your-face experience. 7 days to Live is everything the Feardotcom wasn't and everything The Ring had hoped to be. It uses a technique of progress that I haven't seen done justice to since The Exorcist. Instead of playing its characters, director Sebastian Miemann plays with them. He places his characters into a defiance of existence that could serve internally for an endless amount of probable outcomes. He lets the characters experience instead of contemplate. There is no moderation in a film such as this, it is blunt and to the point. For this it is not an easy or enjoyable watch. But it does serve for an experience in delusion that blurs the lines between modernized fiction and realized fiction. There are no bad guys, nor good ones. There are no turning points or breakdowns. This is a slow, uphill climb that uses its time to build in order for fair distribution of thoughtful suspense. It was for this very reason that the Ring failed. It toyed with us and made us believe that it was going somewhere, and than when it didn't, felt that it owed us an explanation for such actions. This is a very unapologetic film. It feels no sympathy or regret for its forthcomings. It sees where it wants to go and feels no need to ask permission to execute. It takes a true directorial talent to take a thought of simplicity and transform it into a full on battle of the senses that is scary as hell and still makes use of a very dark bit of humour. It is such direction that gains this high praise, for were this to be a study of character it would have been nowhere near as enticing. Niemann has a vision for this film that was so intriguing it goes by only on a subconscious level. Early on in the film there is a direct reference to David Lynch, followed by a shot of an old, white radio that would surely applaud. There is than a shot in which the camera views the house while walking around the parameter of an outside fence. This is a frame that Hitchcock would tip his glass to. Brief scenes later the camera is allowed to become the first person as it drifts along the floor of the house, moving from room to room in a showcase of mysterious presence that pays homage to Sam Raimi. Finally, if that wasn't enough to wet the appetite of any cult film buff, we end with a nod to Stanely Kubrick in a climatic battle that perpetuates similar to The Shining. With such a high degree of directorial influence you would think this film would want to stroll down into rip-off territory. But instead of stealing ideas, Miemann uses them to persuade his material to be itself. This film uses a tired formula, brought back to life with a paroxysmal jolt of thulium-like entrails. The film stars Amanda Plummer as Ellen. Plummer plays her role as convincing where other would have played it as annoying. She plays her character as someone out to discover something but never resorts to searching for it. She portrays a stranded individual in the middle of a crossroad with no sense of direction or choice. Sean Pertwee plays Martin in a near genius casting call. Pertwee moulds his character like a cauldron of emotional baggage that could explode at any moment with unforeseeable consequences. The only problem with this film is its story. Some things go unexplained and some things are never brought forward in a proper fashion of development. All that said I see no need for such minor setbacks to invade the enjoyment of 7 Days to Live, for on a ratio of good scenes to bad ones, the good ones hold majority. I can't say that everyone will love this film, it does serve as a rather abnormal experience, but it is rare in this age when a film will come along that manufactures chills, and this one did so much more than that for me. Today's horror genre has become nothing more than parades of bizarre and obscene images, used only as a means to shock. Although 7 Days to Live is not an easy of fun experience, it proves that in a technologically dominated realm, less is more."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Studio Home Entertainment",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi749994265",
        "name": "7 Days to Live",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWE2Nzc4YzYtMDQzOS00NzUzLWE5MTQtYmNhMjNkNzkxMWQ1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWE2Nzc4YzYtMDQzOS00NzUzLWE5MTQtYmNhMjNkNzkxMWQ1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T04:36:11Z",
        "url": "https://www.imdb.com/video/vi749994265/"
    },
    "url": "/title/tt0221928/"
}