{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Kirk Douglas",
            "url": "/name/nm0000018/"
        },
        {
            "@type": "Person",
            "name": "Fredric March",
            "url": "/name/nm0545298/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16370,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0100335/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130493/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045848/"
        },
        {
            "@type": "Person",
            "name": "Fletcher Knebel",
            "url": "/name/nm0460608/"
        },
        {
            "@type": "Person",
            "name": "Charles W. Bailey II",
            "url": "/name/nm0047120/"
        },
        {
            "@type": "Person",
            "name": "Rod Serling",
            "url": "/name/nm0785245/"
        }
    ],
    "datePublished": "1964-02-13",
    "description": "United States military leaders plot to overthrow the President because he supports a nuclear disarmament treaty and they fear a Soviet sneak attack.",
    "director": [
        {
            "@type": "Person",
            "name": "John Frankenheimer",
            "url": "/name/nm0001239/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGEwZGJiYTEtNDk4OC00NzM1LWJjNDMtZGE3OGQ1YWNlZjgxXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "conspiracy,political thriller,politics,coup d'etat,cold war",
    "name": "Seven Days in May",
    "original_info": {
        "id": "Seven Days in May_1964",
        "name": "Seven Days in May",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Lechuguilla"
        },
        "dateCreated": "2009-10-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058576/"
        },
        "name": "\"We look for a champion in red, white, and blue\"",
        "reviewBody": "Intense and gravely serious, \"Seven Days In May\" tells the fictional story of a super-patriotic American General, a man named James Mattoon Scott (Burt Lancaster), who may, or may not, be plotting with others to overthrow the U.S. Government. Much of the plot, especially early-on, is veiled in secrecy and mistrust.\n\nAn alert Col. Jiggs Casey (Kirk Douglas) first gets suspicious when references to horse racing are labeled top secret. Then he discovers that a mysterious organization called \"ECOMCON\" doesn't officially exist. Casey's suspicions turn to Scott, because Scott disdains President Jordan Lyman (Fredric March) as a liberal pacifist. In the early going, it's up to viewers to figure out whether this military coup d'etat is real or imagined.\n\nThe film's dialogue is heavy laden with import. Characters speechify with feeling about nuclear war, Pearl Harbor, disarmament, and other weighty issues. There's almost no humor. The forceful rat-a-tat-tat of the drums during the title sequence foreshadows a distressing tone: foreboding, angry, discordant.\n\nIt's a riveting story, with lots of tension. I would describe its import as comparable to \"All The President's Men\". Acting is top-notch. I especially liked the performances of March, as the idealistic President. In support roles, Edmond O'Brien and Martin Balsam are terrific.\n\nThe B&W visuals are quite good. There are lots of wide-angle and low-angle shots, which convey a heightened sense of visual perspective. There's some mood lighting at night in the rain, and some clever back-projection techniques.\n\nOn the other hand, with such a large cast I found it hard to connect names with faces at times. And the romantic subplot with Ellie (Ava Gardner) is a tad distracting.\n\nBut overall, this is a fine, high quality Cold War era film dealing with topics that were cogent in the 1960s, especially following the assassination of JFK.\n\nPresident Lyman summarizes the film's theme. \"The enemy is an age, a nuclear age. It happens to have killed man's faith in his ability to influence what happens to him. And out of this comes a sickness, a sickness of frustration, a feeling of impotence, helplessness, weakness. And from this desperation, we look for a champion in red, white, and blue\"."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount",
        "duration": "PT3M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi813826329",
        "name": "Seven Days in May",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzZlYTQ2ZmItOTExZi00YWJjLWE3YzYtZDUwMGU0NmRhMGFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzZlYTQ2ZmItOTExZi00YWJjLWE3YzYtZDUwMGU0NmRhMGFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:46:18Z",
        "url": "https://www.imdb.com/video/vi813826329/"
    },
    "url": "/title/tt0058576/"
}