{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Dieterle",
            "url": "/name/nm0226189/"
        },
        {
            "@type": "Person",
            "name": "Gunnar Tolnæs",
            "url": "/name/nm0866184/"
        },
        {
            "@type": "Person",
            "name": "Mary Johnson",
            "url": "/name/nm0425770/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 293,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Sex in Chains",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0089236/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055431/"
        },
        {
            "@type": "Person",
            "name": "Franz Höllering",
            "url": "/name/nm0405934/"
        },
        {
            "@type": "Person",
            "name": "Herbert Juttke",
            "url": "/name/nm0433288/"
        },
        {
            "@type": "Person",
            "name": "Georg C. Klaren",
            "url": "/name/nm0458283/"
        }
    ],
    "description": "A young man is convicted of manslaughter and sentenced to a term in prison. There he forms a close relationship with his cellmate and upon his release his wife is concerned as to how prison has changed the man she married.",
    "director": [
        {
            "@type": "Person",
            "name": "William Dieterle",
            "url": "/name/nm0226189/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzk3NjY4NTQ5MV5BMl5BanBnXkFtZTcwNjIwNDcyMQ@@._V1_.jpg",
    "keywords": "gay,blackmail,gay protagonist,prison,manslaughter",
    "name": "Geschlecht in Fesseln",
    "original_info": {
        "id": "Sex in Chains_1928",
        "name": "Sex in Chains",
        "year": "1928"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "scorseseisgod-1"
        },
        "dateCreated": "2005-11-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0018935/"
        },
        "name": "Ixnay on the Exsay",
        "reviewBody": "Of all the director's to work at Warner Bros. in the 30's, only Raoul Walsh came close to William Dieterle's visual involvedness. Although Michael Curtiz gets the lion's share of the glory, it is Dieterle, with his incredible sense of illustrative storytelling that remains the least lauded of the studio's directorial roster. In his essential \"Hollywood Directors,\" Jean-Pierre Coursodon argues that Dieterle was forced to tell his early stories through pictures in order to compensate for his inability to speak English. Thanks to Kino Video, we now have a chance to see one of the director's early German films in near pristine form.. Under the subheading, \"Gay-Themed Films of the Silent Era,\" Kino has released a set of four films that were, to say the least, dicey in their day. The package includes G.W. Pabst's \"Diary of a Lost Girl,\" Carl Theodor Dreyer's \"Michael,\" Richard Oswald \"Different from the Others\" and Dieterle's \"Sex in Chains.\" Under the skilled guidance of film preservationist/silent film maharishi David Shepard these films probably haven't looked this good since their initial release.\n\nNot only does Dieterle act as \"Sex and Chains\" director, he also stars as Franz Sommer, an unemployed engineer desperate for work. When we first see Helene polishing Franz's nameplate we are not sure whether she's a servant girl or his wife. On the surface everything seems proper until her father comes to visit and she is forced to cover for her out of work spouse. A friend tips Franz to a commission-based door-to-door vacuum salesman gig, but eventually Helene must accept work as a cigarette girl to supplant them. It is here that Franz clobbers a creepy rival for his wife's affection and is sent to prison. While awaiting trial, initial hopes that the victim will survive are quickly dashed and Franz is given a three-year sentence for involuntary manslaughter. With her father ignoring her and no one else to turn to, Steinau, a wrongly convicted former cell mate of Franz vows to help Helene, and prison moderation in general.\n\nAs expected, there are many visually enthralling, satirically sharp-eyed touches scattered throughout. A white cat hisses danger at Franz's first house call. His dour boss insisting that Franz smile. A hungry and penniless Franz placing a serving knife gifted by his father-in-law in his mouth to prove one needs money, not cutlery to avoid famine. On the downside, there are one too many hand-held, back-and-forth dialog scenes that add wobble, not immediacy.\n\nThose expecting to get their kink on from the lurid title will be sadly disappointed. Of course there is a parade of pre-code don'ts to satisfy. In a fit of romantic longing for his wife, Franz dreams of himself at home in their marital bed. It doesn't help when a fellow inmate informs Franz that he's \"lived to see someone unman himself, just so he could finally sleep.\" Convicts form table scraps in the shape of a nude woman. When a sex-crazed inmate complains to the prison doctor, the advice he gets is, \"Simulator!? Franz isn't the only one suffering the effects of desire, and if there is one point this film gets across quite well is the sexual longing among convicts and their other half's. The graceful dissolves that punctuate Franz and Helene's dreams are breathtakingly executed. Sadly, they are as illusory as the couple's thoughts of romantically hooking up while he is in prison, for even as Franz discovers the pros of loving a con, Helene is finding comfort in the arms of old pal Steinau. Even though Franz and Helene are eventually allowed a booty call while the warden and his family take their tea in the other room, it is all for naught. Guilt has plunged Helene to her emotional lowest and made it equally impossible for Franz to perform.\n\nWhen all is said and done this is nothing more than a well-intentioned message picture with isolated bursts of visual brilliance. Anyone looking for themes of gay liberation may be disappointed to discover just how homophobic the film's message is. Conjugal visits over inter-prisoner contact are what the film champions. About two-thirds of the way through we begin being bombarded by significant speeches and that's when it begins to crumble. \"Is it not to weep when millions are spent to help horses, cats and dogs, and so little for the betterment of men!\" Please. These guys are not in prison for stealing flies from spiders.\n\nWill Steinau convince Franz to release Helene from his heart? Will Franz and Helene ever have a \"normal\" relationship or was being taught the language of love by a group of burly convicts too much for Franz's libido to endure? It'll cost you $29.95 to find out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0018935/"
}