{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 457,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039805/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017651/"
        }
    ],
    "datePublished": "2002-02-22",
    "description": "A documentary film about couples that swing.",
    "director": [
        {
            "@type": "Person",
            "name": "Harry Gantz",
            "url": "/name/nm0304636/"
        },
        {
            "@type": "Person",
            "name": "Joe Gantz",
            "url": "/name/nm0304637/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Documentary",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYxOTM2NTUxMF5BMl5BanBnXkFtZTcwMDI5MzQyMQ@@._V1_.jpg",
    "keywords": "swingers club,swinger couple,jealous wife,husband and wife have sex with the same woman,sexy lingerie",
    "name": "Sex with Strangers",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "argv"
        },
        "dateCreated": "2002-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0304692/"
        },
        "name": "Concerns about authenticity overshadow any remaining qualities",
        "reviewBody": "Joe and Harry Gantz are known for the reality-based television series Taxicab Confessions, where hidden cameras are placed in taxis, and passengers are recorded telling intimate details about themselves to the driver. The series has won many awards for documentary, and served to usher in a new and unique way of peeking into people's private lives.\n\n In the film, Sex with Strangers, the Gantz brothers are up to something new again, but this time, it's not entirely clear what it is. I'll explain that in a moment.\n\nOn the surface, the film appears to be a documentary, following three sets of couples who \"swing\" - that is, have sex with other couples. James and Theresa are classic swingers who aggressively seduce couples wherever they go; their protégé Calvin attempts to share his sexual freedom with two jealous lovers, Sara and Julie; and psychodrama almost displaces sex for Shannon and Gerard, who aren't sure whether swinging is the way to go to preserve their marriage. By embracing a free sexual lifestyle, all of these swingers have to constantly deal with issues of trust, power, intimacy and love.\n\n It's so real, and the plots move along so well, and the dialog is so well chosen that wait, is this really a documentary? Or, is it really a scripted movie with actors that make it look like one? About 30 minutes into the movie, my attention drew to certain technical details like, \"how did they get a camera into that really small space? Oh, and there's another camera angle! Oh, and a third! Wait, that space couldn't possibly fit all those people and all those cameras and still be an authentic scene. Do people really act natural in such settings?\" Then I started noticing things in the dialog: too perfect. Words chosen well. There are times when people sort of stutter over their words or stop to think a moment, but not nearly often enough. I've seen a lot of documentaries, and few are as polished as this.\n\nAnd then there's the climax - the ends of all the stories just come together too well. The scenes appear to be too set up, and the scenarios too concocted. I started feeling \"lied to\". I went to the production notes and the movie's web site, and my suspicions were raised even higher. Words are also carefully chosen, such as: \"Most documentaries search for defining moments[...] This extraordinary film is filled with such revelations...\" Note: It doesn't call itself a \"documentary\", it calls itself a \"film.\" Reading it carefully, the entire text appears to be chosen in a way that could suggest that they were prepared to be disclosed. If you read the official sites of other, known documentaries, they are overwhelmingly explicit in the background of the film, how they went about it, and many other things. But for this film, it's all very ambiguous.\n\nIf I'm right, the film's main problem is that it's relying on a gimmick of lying to the audience much the same way Jerry Springer and all those \"talk\" shows were. The appeal of those shows was the notion that the \"guests\" were real people. When it was disclosed that it was all staged, those shows lost their appeal.\n\n I don't care that I'm lied to, but if you're going to do it, there's a lot more intelligent ways to go about it. Championship Wrestling is one example. Everyone knows its fake, but that's part of the fun of it. (I don't particularly enjoy wrestling, but I recognize and acknowledge its appeal to others.)\n\nIf I'm wrong, and the film is actually real, I fault the filmmakers for making it too simplistic and not fleshing out more of the culture and environment of the lifestyle and the people behind it.\n\nI don't dispute whether serious research went into this, as the notes indicate. (A year was spent with couples to learn their lifestyle, but it doesn't specifically say that these were the people in the film.) Either way you look at it, the film came across as a soap opera, where the main intent is to taunt the audience with risqué scenes, villains and victims, and the drama of people making clearly stupid choices in their mates. Sex with Strangers positioned itself as a documentary to give serious insight into swingers and their lifestyles, but it didn't - it just showed a few selected couples and tunneled the entire movie into only their lives. While it showed very realistic portrayals, they were all two-dimensional."
    },
    "url": "/title/tt0304692/"
}