{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Mia Farrow",
            "url": "/name/nm0001201/"
        },
        {
            "@type": "Person",
            "name": "Michael Kirby",
            "url": "/name/nm0456194/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17562,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008432/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001995/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "datePublished": "1992-03-20",
    "description": "With a serial strangler on the loose, a bookkeeper wanders around town searching for the vigilante group intent on catching the killer.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDU0NzA5OTMtN2ZhZC00YWUwLTk4MTQtMjE2ZjRlNDg3NjM1XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "serial killer,directed by star,circus,lynch mob,shadow on wall",
    "name": "Shadows and Fog",
    "original_info": {
        "id": "Shadows and Fog_1992",
        "name": "Shadows and Fog",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2014-07-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105378/"
        },
        "name": "A very love-it-or-hate-it film and middling Allen, but actually a good film and one of his most under-appreciated",
        "reviewBody": "On first viewing I wasn't crazy about Shadows and Fog, while the film looked fantastic and was well-directed the characters left me cold, the film didn't seem to know what tone it wanted and the story seemed meandering and dull. On re-watch however Shadows and Fog fared much better(as was with almost all the Allen films that didn't impress at first apart from Anything Else), it is nowhere near among Woody Allen's best and is around the lower middle of his filmography but I found it a good film and not among Allen's worst that it's often said to be. Visually, Shadows and Fog looks fantastic with brilliant black and white cinematography and Expressionistic images that are as striking as they are haunting. Allen's films are always well-made, but Shadows and Fog visually like Zelig is quite unique from a visual standpoint. The music is very eerie and fits the atmosphere perfectly, in fact if anything it adds to it. While it was confusing of what tone the film was trying to go with on first viewing, on re-watch it was much clearer and that criticism seems unfair now. The dialogue is both subtle and hilarious(love the brothel scenes) with sharp homages and insight in characteristic Woody Allen vein, but even more impressive was the murder-mystery element while a really chilling atmosphere is created, helped by the visuals and music. Allen's directing is as always adept and his performance, the most memorable, is a lot of fun. John Cusack does nervous and angsty very nicely and Jodie Foster and Kathy Bates are remarkably good in against-type roles. Shadows and Fog has imperfections, Mia Farrow for me overdoes it and comes across as shrill, John Malkovich deserved much more to do and is a little wasted and Madonna is rather out of place. The story does have its drawn out and aimless patches with an ending that felt convoluted and hurried, and the characters are not very interesting, a lot of them barely in the film. To conclude however, a good film but considering how well the best assets come off it could have been more than good. 7/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "With a serial strangler on the loose, a bookkeeper wanders around town searching for the vigilante group intent on catching the killer.",
        "duration": "PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi136626969",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjM0YzI4MjgtZmM5YS00ZTI5LTg2ZWMtYzE1MzJlNWEzMGVjXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjM0YzI4MjgtZmM5YS00ZTI5LTg2ZWMtYzE1MzJlNWEzMGVjXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-12T17:16:02.270Z",
        "url": "https://www.imdb.com/video/vi136626969/"
    },
    "url": "/title/tt0105378/"
}