{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Meenakshi Sheshadri",
            "url": "/name/nm0792866/"
        },
        {
            "@type": "Person",
            "name": "Aruna Irani",
            "url": "/name/nm0045119/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2281,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042126/"
        },
        {
            "@type": "Person",
            "name": "Inder Raj Anand",
            "url": "/name/nm0025613/"
        },
        {
            "@type": "Person",
            "name": "Jaya Bachchan",
            "url": "/name/nm0080149/"
        },
        {
            "@type": "Person",
            "name": "Santosh Saroj",
            "url": "/name/nm0765454/"
        }
    ],
    "datePublished": "1988-02-12",
    "description": "Vijay who is a corrupt officer by day, turns a vigilante by night in order to make the city crime free.",
    "director": [
        {
            "@type": "Person",
            "name": "Tinnu Anand",
            "url": "/name/nm0025627/"
        }
    ],
    "duration": "PT2H55M",
    "genre": [
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWRhNzA3MmUtMDE4My00OTZkLWIwNWUtZGFhZDU0ZWZkM2ZjXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "keywords": "vigilante,self justice,reporter,police officer,organized crime",
    "name": "Shahenshah",
    "original_info": {
        "id": "Shahenshah_1988",
        "name": "Shahenshah",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheSkeptik"
        },
        "dateCreated": "2012-01-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0093949/"
        },
        "name": "An awesome action thriller of 80's with brilliant execution. Great Masala Entertainer.",
        "reviewBody": "Few days back i saw recently released super hero movie RA.One. And today i got opportunity to look at 80's Masala action movie Shahenshah, whose lead protagonist has shades of super hero. Movie engaged the viewer to glue on screen from start to finish. At the end of show, i simply mesmerized by movie.Today even with great level of technology, how movies are failing big time in execution and story telling. Even though 80's is not known for great movies, but Shahenshah was one of exceptional movies of 80's. \n\nMasala entertainment and Manmohan desai cinema are two sides of one coin, but this movie forced me to think that Masala is not necessarily the cinema which defies logic, even with logical consequences, a great action masala thriller can be made. This movie worked vastly in three departments : 1.Performance by Amitabh 2. Awesome dialogues 3. Commendable direction.\n\nStory is not new, but told in highly entertaining manner with some twists and turns. Story is about revenge drama, with a difference that protagonist is super hero. Vijay is police officer who double crossed the anti social elements by taking bribe from them while on duty, and demolish their nefarious designs in form of Shahenshah. No one knows real identity of Shahenshah. Vijay(Shahenshah) has one agenda in life, to clear the accusations against his father of taking bribe and take revenge from the man(J.K.) who forced him to commit suicide. Amitabh plays both roles as inspector Vijay (with funny bones) and Heart thumping Giant Shahenshah with utmost perfection.Leave alone stars of 80's, even if i think of all bollywood actors till today, i don't see if any one match the magic, perfection and persona of both characters played by Amitabh. \n\nMovie spell binds the audience from start to finish, story though same old revenge drama, still captivate due to brilliant script and awesome dialogues.Whenever Shahenshah comes on screen, magic is seen to believe. All those moments should be written in bold letters in cinema history. Never ever in my life i spell bind with presence and performance, in simple words, no one can turn the eyes from screen whenever Shahenshah comes to rescue. Amrish puri as villain is giant as well and complemented Amitabh equally. Minakshi Sheshadri looks hot and did fine job. Movie reached to pinnacle in climax. I never saw any climax as enthralling as this one. If i have to write top 10 climaxes in cinema history, Shahenshah would probably be in top. What a finale sir, great job. The entire scene from the point when inspector Vijay arrest Amrish puri and put him behind bar to the final court room drama, J.K set free by court and finally J.K. taken back to court by Shahenshah and brilliant turn of events there .. no one can keep eyes off screen in those last 20 minutes. Such a gripping moments and such a energetic performance by Amitabh.\n\nFinally, if any one want to see edge of seat masala genre blended brilliantly with Superhero concept, not going overboard for even a second, Please check this one. I promise you, you will feel sorry for contemporary filmmakers, they can't even come close with this school of film making. Superb entertainer .. 10/10 By me.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0093949/"
}