{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Timothy V. Murphy",
            "url": "/name/nm1182011/"
        },
        {
            "@type": "Person",
            "name": "Stan Kirsch",
            "url": "/name/nm0456909/"
        },
        {
            "@type": "Person",
            "name": "Lindsey Stoddart",
            "url": "/name/nm0831028/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4707,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098464/"
        },
        {
            "@type": "Person",
            "name": "Sheldon Wilson",
            "url": "/name/nm0934135/"
        }
    ],
    "datePublished": "2005-04-28",
    "description": "A naked teenage boy covered in blood appears at a remote sheriff's station one year after the brutal unsolved murder of a local girl. Now Sheriff Jack Shepherd, guilt ridden over the girl's murder, must confront his own demons as ...",
    "director": [
        {
            "@type": "Person",
            "name": "Sheldon Wilson",
            "url": "/name/nm0934135/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ3MTc3NDk4M15BMl5BanBnXkFtZTcwNjUyMDgyMQ@@._V1_.jpg",
    "keywords": "public nudity,thong panties,blue panties,panties,bound and gagged",
    "name": "Shallow Ground",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slayrrr666"
        },
        "dateCreated": "2007-01-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0369918/"
        },
        "name": "Has potential, but ultimately failed",
        "reviewBody": "\"Shallow Ground\" is a hugely underwhelming film when it could've been a pleasant surprise.\n\n**SPOILERS**\n\nTurning in for the night, Deputies Stuart Dempsey, (Stan Kirsch) and Laura Russell, (Lindsey Stoddart) are leaving their remote sheriff's station for good when a , (Rocky Marquette) walks in, naked and covered in blood. His appearance sparks Sheriff Jack Shepard, (Timothy V. Murphy) to resolve a year-old missing person's case that has plagued the community. As the clues begin to come together and a mystery about the boy is found regarding his connection to a slew of missing person cases in the area. As the mystery deepens and more bodies turn up, they race to solve the mystery and find the killer before another strike is had.\n\nThe Good News: This wasn't that bad, and there are certain parts that aren't that bad. One of the best features is that as the film progresses, the mystery deepens. It's not that clever or complicated, but it's something we simply cannot predict or unravel on our own and it leaves us feeling off-balance from the beginning. Just when we begin to think we know what's going on, it throws us off the scent. Not that bad. It also works as a really great gore-fest. We get mangled corpses with hooks pieced into their flesh, a carved-in face, a slashed chest, gun shot wounds, a hand slipping under one's skin, a ripped out heart and more. Even more is thrown in with the fact that blood plays an initial component in the creepiness in the beginning, as a pool of blood creeping under the door and turning direction in one creepy instance. The effects were mostly of a practical nature and are well done. It also packs in a constant stream of strange images, such as the naked boy bleeding from his eyes and mouth or covered in blood, or at one point in spiders, the boy's fingerprints turning out to each be one of the missing people in the area, and a deputy managing to tear up photos of the missing people and finding that they form into a composite image of the boy. Pretty creepy and well-done, but otherwise, there wasn't much else.\n\nThe Bad News: There are a couple of problems with the film, and it mostly stems from the fact that it really doesn't make you want to care what happens. Everything passes by in a so-what manner, and after a while it just reverts to a series of incidents that make you question why it's still going on. My biggest problem with it was that it started giving some answers way too late into the game. So for the longest time, it was frustrating as the chain of events had nothing to hold to. It eventually almost forces you to give up on the narrative about halfway through and found myself struggling to care about what was happening. The other complaint is that none of it makes any sense at all. It's said that he has comes back to seek retribution on the killer, but then the bulk of the film take place in the police station with the boy sitting there manifesting blood and the like, and it's revealed the police station has nothing to do with the murders so it's just a large chunk of screen-time eaten up without accomplishing anything. There is the confused sense that all of this seems to be happening for purposes of vengeance, but none of this is really made clear at all. It is also not entirely clear why the killer is going around tying people up in the woods and killing them. There is no explanation of why the dead seem to be coming back everywhere. This is compounded by a never-ending stream of plot-holes that are so easy to find it's almost an insult. If the boy is a composite of the murdered dead, then why is he targeting people who are not connected to the killings? A trained forensic expert can tell at first glance if blood is human or animal, but can't discern if the blood cells are dead or not. Don't get me started on the killer's \"slim fast\" motive. I didn't buy it, it was way too thin to come close to justifying the beyond-insane and sexually deviant actions. This was a gigantic missed opportunity.\n\nThe Final Verdict: As a gruesome gore-fest, it's not that bad, but as an engaging horror film, it fails remarkably. It's a shame, as it had a lot of potential and promise, but it's ruined by a largely uncaring feel and too many plot holes to really ignore. If it sounds like something that appeals to you instead of the standard grain, go for it, but if not, seek caution with it.\n\nRated R: Graphic Violence, Nudity, and some Language",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0369918/"
}