{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Biao Yuen",
            "url": "/name/nm0950707/"
        },
        {
            "@type": "Person",
            "name": "Anita Mui",
            "url": "/name/nm0611315/"
        },
        {
            "@type": "Person",
            "name": "Sammo Kam-Bo Hung",
            "url": "/name/nm0005033/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 163,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "alternateName": "Shanghai Shanghai",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163276/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043372/"
        },
        {
            "@type": "Person",
            "name": "Raymond To",
            "url": "/name/nm0864782/"
        }
    ],
    "datePublished": "1990-01-20",
    "description": "Little Tiger (Yuen Biao) leaves his hometown and goes to Shanghai staying with his elder brother, Big Tiger (George Lam), who is a police officer. However, he accidentally gets involved in robbing the National Salvation Funds.",
    "director": [
        {
            "@type": "Person",
            "name": "Teddy Robin Kwan",
            "url": "/name/nm0477108/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmVkYjZlMjItMjViNy00MzI0LWExNjktMzE5NzQ0NjdjYzUwXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "name": "Luan shi er nv",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JackDevoe"
        },
        "dateCreated": "2003-03-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100071/"
        },
        "name": "A serious update on this gem",
        "reviewBody": "It's amazing to find these films which sadly end up getting lost in the sea of other HK films. This movie certainly does not deserve to be overlooked. SHANGHAI, SHANGHAI has great production values. The location shooting in Shanghai was really nice. Seeing Yuen Biao as the star again is always welcomed. Seeing how he can hold a movie together like he did in RIGHTING WRONGS and ICEMAN COMMETH, how much more proof do we need that he should be one of today's leading men in film? (Sammo Hung says that Yuen isn't willing to learn English, which is why we haven't seen him in an American film.) The cast is great. Yuen Biao becomes friends with an acrobatic troupe, and they all have great chemestry together. He also performs well with George Lam who plays his brother. Sammo Hung also stars as the movie's villain. He acts his part real well. At first he only seems to be ruthless as he's only cruel to the other bad men in the movie, but then it becomes apparant that he doesn't care for the people of Shanghai, and is only interested in building his already huge empire. A real selling point for this movie was Anita Mui. She was excelent. She has such charm and elegance, and her scenes with George Lam who's also her love interest are nice to watch. She even has two classic scenes in which she has a tango dance with Yuen Biao which is really a fight scene. Then in the finale, we see he take on a group of henchmen in wonderful fashion. She looked better here than she did in MY FATHER IS A HERO and THE HEROIC TRIO. Anita was doing the majority of her own fighting, and moved gracefully. To add on to the finale was the one on one with Yuen Biao and Sammo Hung. I'm sure these two have had many fight scenes with each other before, but this one is top notch. Excelent choreography. The action may not come in bucketloads, but when the scenes do occur, it's worth the price of the movie, and the good acting and story telling back it up nicely.\n\n8 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0100071/"
}