{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Guolin Shi",
            "url": "/name/nm1778906/"
        },
        {
            "@type": "Person",
            "name": "Peng Zhang Li",
            "url": "/name/nm1782679/"
        },
        {
            "@type": "Person",
            "name": "Xing Hao Shi",
            "url": "/name/nm1778907/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 39,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002222/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043134/"
        },
        {
            "@type": "Person",
            "name": "Martha Burr",
            "url": "/name/nm1788061/"
        },
        {
            "@type": "Person",
            "name": "Michael Cho",
            "url": "/name/nm2606683/"
        }
    ],
    "description": "Hailing from China's legendary Shaolin Temple, these men are not only accomplished Zen masters but also famous kungfu stars. Now they've left it all behind to forge a new future in America and bring their special brand of Martial ...",
    "director": [
        {
            "@type": "Person",
            "name": "Martha Burr",
            "url": "/name/nm1788061/"
        },
        {
            "@type": "Person",
            "name": "Mei-Juin Chen",
            "url": "/name/nm0155320/"
        }
    ],
    "duration": "PT56M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5ODM1OTg3Nl5BMl5BanBnXkFtZTgwMTA0MDA2MDE@._V1_.jpg",
    "keywords": "f rated",
    "name": "Shaolin Ulysses: Kungfu Monks in America",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secretrivals"
        },
        "dateCreated": "2005-03-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0435385/"
        },
        "name": "Interesting Documentary for Kung Fu fans!!!!",
        "reviewBody": "Shaolin Ulysses: Kung Fu Monks in America is a wonderful low budget documentary about several Shaolin Monks who have immigrated to America to spread Buddhism and martial arts in the west.\n\nFull of great martial arts demonstrations as well as interviews with the monks and their students. While the monks were interesting, the only downside to the film was the choice of Americans they interviewed. One of the monks' younger students seemed more interested in being on television than learning kung fu. The other, a rich Las Vegas doctor (could he be a plastic surgeon???) seems to care more about chicks and cars than the Buddhist mentality he seems to admire. \n\nOther than that we gain a terrific insight into the lives of the monks as they establish temples across the states.\n\nMost of it looks like it was shot on digital, but it's filmed well enough that it's pleasing to watch. Also the extras on the DVD provide plenty of viewing after the movie is done with several demonstrations of different martial arts styles, some quigong and some interesting footage from the Shaolin Festival.\n\nI checked this out because i'm a huge fan of KF films and have enjoyed other documentaries about the subject such as \"This Is Kung Fu\" etc...\n\nMy only other complaint is that it was too short! It's only 50 odd minutes long, probably because it was originally filmed for TV or something. Check it out!!"
    },
    "url": "/title/tt0435385/"
}