{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hayden Christensen",
            "url": "/name/nm0159789/"
        },
        {
            "@type": "Person",
            "name": "Chloë Sevigny",
            "url": "/name/nm0001721/"
        },
        {
            "@type": "Person",
            "name": "Steve Zahn",
            "url": "/name/nm0001872/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 36289,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012382/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094885/"
        },
        {
            "@type": "Person",
            "name": "Buzz Bissinger",
            "url": "/name/nm0084334/"
        },
        {
            "@type": "Person",
            "name": "Billy Ray",
            "url": "/name/nm0712753/"
        }
    ],
    "datePublished": "2003-11-26",
    "description": "The story of a young journalist who fell from grace when it was discovered he fabricated over half of his articles from the publication The New Republic magazine.",
    "director": [
        {
            "@type": "Person",
            "name": "Billy Ray",
            "url": "/name/nm0712753/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjExNDI2OTc2MF5BMl5BanBnXkFtZTYwOTA5MjM3._V1_.jpg",
    "keywords": "fabricated facts,journalistic fraud,writer,magazine,journalist",
    "name": "Shattered Glass",
    "original_info": {
        "id": "Shattered Glass_2003",
        "name": "Shattered Glass",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2004-10-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0323944/"
        },
        "name": "a mesmerizing morality play",
        "reviewBody": "One of the unsung and unheralded movie treasures of 2003, 'Shattered Glass' tells the fascinating story of Stephen Glass, one of the top reporters for The New Republic in the 1990's, who rocked the media world when he had to finally confess that he had fabricated many of his stories. 'Shattered Glass' plays like a modern Greek tragedy, centered on a man of great talent and potential brought down by his own internal weaknesses. Glass was only 24 when he fell from grace; prior to that, he was a hot shot reporter who, in the highly competitive world of high stakes journalism, kept looking for that little added edge to make his stories saleable. For a number of years, Glass managed to slip those stories past his editors and fact-checkers without being discovered. However, in the spring of 1998, his world came crashing down around him after an internet magazine became suspicious of a story he had written about a computer hacker who, it turns out, never actually existed.\n\n'Shattered Glass,' which is based on an article by Buzz Bissinger, succeeds as both a complex character study and a top notch thriller. The film never gives us any easy answers as to just why Glass put his journalistic integrity and career on the line by perpetrating these frauds. As portrayed in the film, Glass is a paradoxical mixture of both arrogance and insecurity, a smooth manipulator who can charm and sweet talk his way into getting people to like and trust him while at the same time employing those same skills to get himself out of tough situations. Eventually, however, the act runs out of steam and he is exposed for who and what he really is. Yet, who, indeed, is he? Is Glass simply a pathological liar? Is he a stressed-out, overworked 'kid' trying desperately to keep his head above water in the cutthroat world of professional journalism? Is he merely a smooth-talking, unethical charmer who knows what he wants and will stop at nothing to get it? Could it be that he is some or all of these things at the same time? The fact that the film never fully answers these questions is what pulls us so deeply into the drama. Moreover, Hayden Christensen gives a superb performance as Glass, making the character both smarmy and vulnerable, repellant and sympathetic all at the same time. In addition to Christensen, the film is filled with brilliant, subtle performances by Peter Sarsgaard, Chloe Sevigny, Hank Azaria and many others. \n\nSuperbly written and directed by Billy Ray, 'Shattered Glass' is one of the most suspenseful films of recent times, far more gripping than most so-called thrillers because the film is dealing with real-world issues of integrity and ethics. We watch with morbid fascination the slow unraveling of a man's 'crime' and character, as Glass becomes more and more ensnared in a web of his own making. The step-by-step process by which a promising young man's true nature is uncovered, then his reputation destroyed, becomes the stuff of classic tragedy.\n\nAlthough The New Republic eventually recovered from this debacle, the filmmakers do not let the magazine off the hook quite so easily. The thing we are most struck by is how incredibly young the reporters at the magazine were at the time (we are told their average age was 26!). How such unseasoned writers came to play so prominent a part in so major and venerable a publication is indeed one of the great mysteries of the story - and one of the sharpest indictments leveled against the magazine by the makers of the film.\n\n'Shattered Glass' is an ineffably sad film, one that makes us mourn the loss of a promising, talented individual who sowed the seeds of his own destruction (he is currently a lawyer). Yet it also inspires and uplifts us by reminding us that men of integrity will almost always triumph over men of little or no integrity in the long run. That's a truism worth remembering in this time of great moral confusion in which we find ourselves living. 'Shattered Glass' is not to be missed."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Lionsgate",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1955004697",
        "name": "Shattered Glass",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTkyNjJjMzEtNmZjMC00NjBjLWJmZjMtOGRjODM1MzYxZmY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTkyNjJjMzEtNmZjMC00NjBjLWJmZjMtOGRjODM1MzYxZmY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:03:39Z",
        "url": "https://www.imdb.com/video/vi1955004697/"
    },
    "url": "/title/tt0323944/"
}