{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Simon Pegg",
            "url": "/name/nm0670408/"
        },
        {
            "@type": "Person",
            "name": "Nick Frost",
            "url": "/name/nm0296545/"
        },
        {
            "@type": "Person",
            "name": "Kate Ashfield",
            "url": "/name/nm0038918/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 567295,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047476/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057311/"
        },
        {
            "@type": "Person",
            "name": "Simon Pegg",
            "url": "/name/nm0670408/"
        },
        {
            "@type": "Person",
            "name": "Edgar Wright",
            "url": "/name/nm0942367/"
        }
    ],
    "datePublished": "2004-09-24",
    "description": "The uneventful, aimless lives of a London electronics salesman and his layabout roommate are disrupted by the zombie apocalypse.",
    "director": [
        {
            "@type": "Person",
            "name": "Edgar Wright",
            "url": "/name/nm0942367/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5Mjk2NDMtZTk0Ny00YTQ0LWIzYWEtMWI5MGQ0Mjg1OTNkXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "zombie apocalypse,pub,british horror,zombie,flesh eating zombies",
    "name": "Shaun of the Dead",
    "original_info": {
        "id": "Shaun of the Dead_2004",
        "name": "Shaun of the Dead",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "meako1973"
        },
        "dateCreated": "2004-04-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0365748/"
        },
        "name": "Like Spaced...with zombies",
        "reviewBody": "In a London suburbia, Shawn is almost 30 and hasn't really achieved much in his life. He comes home from his mundane job each day, and goes to the same pub (The Winchester) that he always has gone to. He shares his flat with an ex-student friend, and his lifelong slob of a friend. On top of that, his girlfriend has had enough of him. Oh.and the dead have started walking the earth!\n\nHot on the heels of recent remake Dawn of the Dead comes Simon 'Spaced' Pegg's black comedy zombie spoof, in which Shawn must save his friends, mum, and ex-girlfriend from the masses of lumbering dead by, erm, going to the Winchester! Unlike recent zombie-fests, these dead-ites are pretty lame, lumbering monstrosities, much like the ones from the older zombie films. This is used to simple comic effect throughout as the 'heroes' seem to have plenty of time to think about things before being attacked.\n\nThe film balances the humour excellently with a decent zombie-story, and the array of characters within are not there just for laughs, there are plenty of poignant moments scattered throughout. Issues of family, love, and friendship, along with growing older and accepting responsibility are contained within the script. Much in the way that TV series Spaced managed to play the absurd with the serious, so does this film. It is easy to compare it to a 'big screen Spaced' episode, but that doesn't sell the film enough. It is much more than that, and is the perfect homage to zombie flicks, and social satire too. Watch towards the early stages of the film to see that most of the population could be confused for zombies anyway, and as for the end scenes of the film.well.suffice to say it will keep you laughing right to the end.\n\nWith a cast pulled from many cult British shows (Dylan Moran from Black Books, Matt Lucas from Little Britain, and nearly everyone from Spaced), and an excellent appearance by Bill `Love Actually' Nighy, there isn't really anything negative I can think of in the film. Even the action is well handled, with enough gore to satisfy any fans of zombie flicks.\n\nThis is a must see film which showcases Simon Pegg's talents excellently. The only drawback is that if it catapults him to international stardom he may never get around to making that final season of Spaced!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "From 'A Fistful of Fingers' and 'Shaun of the Dead,' to 'Scott Pilgrim vs. the World' and 'Last Night in Soho,' we track the filmmaking techniques of writer, producer, and director Edgar Wright.",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2478686233",
        "name": "A Guide to the Films of Edgar Wright",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDE1NmQwYTAtM2E2MS00YTI4LTllYjctNzhiYjFiM2NjM2MwXkEyXkFqcGdeQW1hZGV0aXNj._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDE1NmQwYTAtM2E2MS00YTI4LTllYjctNzhiYjFiM2NjM2MwXkEyXkFqcGdeQW1hZGV0aXNj._V1_.jpg",
        "uploadDate": "2021-03-02T19:56:47.115Z",
        "url": "https://www.imdb.com/video/vi2478686233/"
    },
    "url": "/title/tt0365748/"
}