{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Joanne Dru",
            "url": "/name/nm0238445/"
        },
        {
            "@type": "Person",
            "name": "John Agar",
            "url": "/name/nm0000730/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18417,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0147189/"
        },
        {
            "@type": "Person",
            "name": "James Warner Bellah",
            "url": "/name/nm0068650/"
        },
        {
            "@type": "Person",
            "name": "Frank S. Nugent",
            "url": "/name/nm0637793/"
        },
        {
            "@type": "Person",
            "name": "Laurence Stallings",
            "url": "/name/nm0821716/"
        }
    ],
    "datePublished": "1949-10-22",
    "description": "Captain Nathan Brittles, on the eve of retirement, takes out a last patrol to stop an impending massive Indian attack. Encumbered by women who must be evacuated, Brittles finds his mission imperiled.",
    "director": [
        {
            "@type": "Person",
            "name": "John Ford",
            "url": "/name/nm0000406/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTkyMTM3ZTMtMDc1Mi00ZjRmLTk3NWYtMzFlOGY3Mjg4Mzk2XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "title appears in song,title based on song,retired soldier,retirement gift,forced retirement",
    "name": "She Wore a Yellow Ribbon",
    "original_info": {
        "id": "She Wore a Yellow Ribbon_1949",
        "name": "She Wore a Yellow Ribbon",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2005-08-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041866/"
        },
        "name": "\"...wherever they rode, whatever they fought for, that place became the United States.\"",
        "reviewBody": "The second of John Ford's cavalry trilogy that deals with the life of the professional soldier is the only one that was photographed in color. Lucky are we, the cinema fans two generations away.\n\nShe Wore A Yellow Ribbon has John Wayne the embodiment of the thirty year army man. The year of the action of the film which is 1876 has Wayne mentioning in passing that he was at the Battle of Chapultepec in the Mexican War which started in 1846. Wayne's Nathan Brittles was by his account a dirty shirt tailed runaway from his father's Ohio farm when he joined the army. And now he's reached mandatory retirement. He's married and has had a family who he's lost for reasons John Ford doesn't explain in the film. But Wayne dutifully, \"makes his report\" at their gravesides every night he's at the post.\n\nWayne's seen a lot of military history and a lot of tragedy. With no family left, the United States Cavalry is his home and family. He doesn't like the idea of retiring at all. In a later Ford film, The Long Gray Line, Martin Maher says that all he knows and holds dear is at West Point. Wayne could have said that line himself here.\n\nEven though George O'Brien is the commanding officer at Fort Stark, Wayne is the father figure for the whole post. And not like some of the others don't behave like children. The whole romantic rivalry between John Agar and Harry Carey, Jr. over Joanne Dru seems pretty childish. Cute while in the safety of the post, but when out on a mission downright dangerous and Wayne like the good father scolds his kiddies.\n\nWith some makeup to grey his hair and wrinkle him a might, Wayne turns in one of his finest performances on the screen. Harry Carey, Jr. wrote what is probably the most evenly balanced portrayal of the Duke in his memoirs In the Company of Heroes. They didn't always get along, but Carey says Wayne was an inspiration to him and the other younger cast members. In fact during the scene with the gunrunners Paul Fix and Grant Withers being killed in the Indian camp while Wayne, Carey, and Agar watch on the ridge, the whole idea for the chaw of tobacco bit came from Carey himself, but that Wayne encouraged the improvisation as he was wont to do. \n\nOther than the Duke, my favorite portrayal in the film is that of Ben Johnson as Sergeant Tyree. Wayne recognizes in him a younger version of himself. In fact Tyree is a former Confederate Army captain, a fact brought out in the death scene of \"Trooper Smith\" another former Confederate who in fact was a general in that army. Ben Johnson was a real cowboy, a horse wrangler who John Ford gave a chance to act. He graced many a film with his presence and won himself an Oscar to cap his career in The Last Picture Show.\n\nLike in Fort Apache and Rio Grande, She Wore a Yellow Ribbon is the story of the professional soldier and the sacrifices he makes when he gives up his civilian status to serve his country. It's a universal theme, not just confined to the USA. No one embodied that theme better than did John Wayne as Nathan Brittles in She Wore a Yellow Ribbon.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from RKO",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4115660825",
        "name": "She Wore A Yellow Ribbon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmRjMjJiZWMtNWY3Ni00NmU3LWI0ZjgtZDk1MjE5ZDM2YzNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmRjMjJiZWMtNWY3Ni00NmU3LWI0ZjgtZDk1MjE5ZDM2YzNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-30T03:42:32Z",
        "url": "https://www.imdb.com/video/vi4115660825/"
    },
    "url": "/title/tt0041866/"
}