{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anthony Mackie",
            "url": "/name/nm1107001/"
        },
        {
            "@type": "Person",
            "name": "Kerry Washington",
            "url": "/name/nm0913488/"
        },
        {
            "@type": "Person",
            "name": "Ellen Barkin",
            "url": "/name/nm0000289/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8034,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029134/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099866/"
        },
        {
            "@type": "Person",
            "name": "Michael Genet",
            "url": "/name/nm0312796/"
        },
        {
            "@type": "Person",
            "name": "Spike Lee",
            "url": "/name/nm0000490/"
        }
    ],
    "datePublished": "2004-07-30",
    "description": "Fired from his job for exposing corrupt business practices, a former biotech executive turns to impregnating wealthy lesbians for profit.",
    "director": [
        {
            "@type": "Person",
            "name": "Spike Lee",
            "url": "/name/nm0000490/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTczOTkwMDMwMV5BMl5BanBnXkFtZTcwNjU3MDYyMQ@@._V1_.jpg",
    "keywords": "male prostitution,lesbianism,frame up,business corruption,businessman",
    "name": "She Hate Me",
    "original_info": {
        "id": "She Hate Me_2004",
        "name": "She Hate Me",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nom5"
        },
        "dateCreated": "2004-08-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0384533/"
        },
        "name": "How to read this movie...",
        "reviewBody": "The reviews of the new Spike Lee joint went from bad to worse (Entertainment Weekly gave it an F, for whatever that's worth), so I purchased my ticket to \"She Hate Me\" with more than a little bit of trepidation. Admittedly, what allowed my curiosity to get the better of me and coerce me in to shelling out the AMC 25 Times Square's ridiculous $10.50 ticket price was an inner desire to witness the gruesome end to the train wreck that has ravaged Spike Lee for the past five year or so (before you stop me, I didn't see 25th Hour, which I heard from credible sources was pretty decent; leave me alone).\n\nAnd for the first half hour of \"She Hate Me,\" that's exactly what I got. The overwhelming hubris; the transparent messaging; the muddled, almost blunted inside joke that leaves you on the outside. The underdeveloped crack baby conceived in a one night stand between (1) half-baked racial politics and (2) a convoluted cultural agenda that manages to reinforce the same norms that it calls into question.\n\nBut somehow, Lee saves this one, making it provocative rather than tired. In this mess of a film, campy vignettes sprout up as tangential arguments surrounding a main thesis. Structuring the movie as such derails the thesis, transforming it from a coordinate plane to a topographic map with very queer landmarks. And while at first glance it might seem that Lee is playing the same role he does courtside at a Knicks game -- shouting his arse off at action of which he has marginal influence at best -- Lee's multiple divergent jeremiads are far less prescriptive than they are descriptive. The description, furthermore, is characterized by omission. We learn a lot more by what Lee chooses not to include than from what he includes. \n\nCase in point: In a film that is so mired in present-day political discourse and broaches the subject homosexuality for a great deal of its duration, not once is the issues of gay marriage touched upon. The choice not to mention this subject, which has (unnecessarily?) asserted hegemony over a queer rights agenda, leaves way for Lee to touch on topics that receive far less mainstream attention, such as alternative understandings of the family, or how the (literal) commodification of the black male body resonates across a number of frameworks. Anthony Mackie is somewhat of an acquired taste in the lead role. His acting is tight enough to be convincing, but imperfect enough to purvey the affected sense that runs rampant throughout the film. His character, Jack Armstrong, works at a pharmaceutical development company whose aim is to develop an AIDS vaccine. Once this is established, a sequence of scenes reveal to us that the vaccine has been rejected by the FDA, that one of the main scientists has committed suicide, and that higher-ups in his company are guilty of blatant insider trading.\n\nWhen Jack blows the whistle to the SEC, the shit deflects off of the fan and hits him in the face. He is fired and his bank account is frozen. In order to maintain the upper-class Manhattanite lifestyle he's been living, he grudgingly agrees to impregnate his ex girlfriend Fatima (Kerry Washington) and her new girlfriend Alex (Dania Ramirez). Receiving $10,000 for impregnating the two of them, Fatima convinces Jack to pony up his one trick to eighteen of her thirtysomething lesbian friends at 10G's a nut. Aronofsky-esque drug ingestion shots abound as Jack pops Viagra and Redbull to maintain stamina at these pregnancy parties, where five women each get a turn with Jack.\n\nA few critics have taken issue with the film's portrait of lesbianism, claiming that it suggests that lesbianism is essentially heterosexuality-without-the-dudes. Reinforcing this viewpoint are \"She Hate Me's\" leading ladies, two bougie \"lipstick\" lesbians of color -- a light-skinned black woman and a Dominican mami -- with totally hellacious bodies, dude. But the lesbian representation isn't homogenous; rather, it runs the gamut and transcends racial borders. It's concurrently totally Hollywood and anti-Hollywood.\n\n\"She Hate Me\" wraps itself up in so many questions that it's completely unable to resolve, and that's part of what makes it succeed. It diagnoses a politics that is weighted down by its anfractuous periphery and conflicted center. But in its articulation of these questions, it forces us to laugh at what makes us uncomfortable. It belies an almost tangible confusion in any attempt at reconciling its own identity, and unexpectedly brings us to a denouement that's ordo ab chao phrased through a deus ex machina. And like the XFL player from whom the film takes its name, what reads like a grammatical disaster conceals witty commentary on problematics that compromise identity."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1804009753",
        "name": "She Hate Me",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTJjNjcwZDctZTFjMS00ZDNhLWI1MmEtNmY2OWYyZTlhNjAzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTJjNjcwZDctZTFjMS00ZDNhLWI1MmEtNmY2OWYyZTlhNjAzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:03:45Z",
        "url": "https://www.imdb.com/video/vi1804009753/"
    },
    "url": "/title/tt0384533/"
}