{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ally Sheedy",
            "url": "/name/nm0000639/"
        },
        {
            "@type": "Person",
            "name": "Patsy Kensit",
            "url": "/name/nm0000475/"
        },
        {
            "@type": "Person",
            "name": "Stephen Baldwin",
            "url": "/name/nm0000286/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 827,
        "ratingValue": 3.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010083/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054820/"
        },
        {
            "@type": "Person",
            "name": "Paul Corvino",
            "url": "/name/nm0181629/"
        }
    ],
    "datePublished": "2003-10-15",
    "description": "Lou, a former professional golfer, turned motivational speaker, seems to have it all: fame, money, and a beautiful live-in girlfriend, Alex. Her seemingly perfect life is turned upside down when she is attacked near her home in Ma...",
    "director": [
        {
            "@type": "Person",
            "name": "Geoffrey Schaaf",
            "url": "/name/nm0769419/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjgxNTZiODEtMzU2MC00MDdmLTkyNzUtNDc3ZGE1N2NhN2RmXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "sex scene,body double in sex scene,zebra skin,yellow rose,waiting",
    "name": "Shelter Island",
    "original_info": {
        "id": "Shelter Island_2003",
        "name": "Shelter Island",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol-kay"
        },
        "dateCreated": "2005-04-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0337717/"
        },
        "name": "I love watching you hit \"balls\"",
        "reviewBody": "**SPOILERS** Jogging through the streets of NYC well-known motivational speaker and former womens PGA golf champion Louise \"Lou\" Dalamere,Ally Sheedy, gets attacked by this masked weirdo with a stick-ball bat who almost kills her. After recovering from her injuries Lou and her live-in girlfriend Alex, Patsy Kensit, take a ride out to her country house in far out Shealter Island. \n\nIt just happens to be that at the time that Lou & Alex got to the house a major storm hit the island and knocked out all the electricity and telephone lines leaving the two women alone and cut off from the outside world. Just then Lenny, Stephen Baldwin, the local clam digger gets swept up out of the ocean and dropped right into Lou's home. \n\nAgreeing to let Lenny stay over until the storm blows over Lou & Alex soon realize that he's anything but grateful to them for practically saving his life. Lenny imposes himself on the two women with his off-color remarks about their lesbian relationship and makes a total jerk of himself by also trying to hit on to Alex right in front of her startled lover Lou! Thus doing his best to out stay his very brief and unwanted welcome at the Dalamere house. \n\nIt's obvious from the start that Lenny was anything but a stranded clam digger or even an Shealter Island resident but was part of some off-the-wall scheme to do in Lou and take off with her money making it look like her death was a drowning accident. It's also obvious that Lenny was the guy who attacked Lou earlier in the film in New York City that left her almost dead and that this time, in secluded Shealter Island, he was going to finish the job that he started back there. What we don't know about Lenny is that he's anything but alone in his attempt to murder Lou and has a lot more help in doing it then we, the audience, and Lou may think. \n\nStephen Baldwin together with Ally Sheedy and Patsy Kensit are about as odd a trio as you would ever see in a motion picture. In most of their scenes together they came across so absurd that you at first thought that the scenes were badly done out-takes that for some reason or mistake, or maybe even practical joke, ended up getting edited back back into the movie. \n\nThere was also the local Shealter Island Sheriff Deluca, Chris Penn, who also got into the act later in the movie that's after you forgot all about him and thought that his brainless actions earlier were just comic relief. Sheriff Deluca is also one of the major players in the plot to do in poor Lou.The ending of the movie was about as anti-climatic as you could make it with the only major actor in the film who, up to then, had nothing to do with the plot to murder and legally steal Lou's money ending up being the \"mastermind\" of this whole crazy and unbelievable scenario.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0337717/"
}