{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ross McElwee",
            "url": "/name/nm0568478/"
        },
        {
            "@type": "Person",
            "name": "Dede McElwee",
            "url": "/name/nm3344839/"
        },
        {
            "@type": "Person",
            "name": "Ross McElwee Jr.",
            "url": "/name/nm3980965/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2621,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Ross McElwee",
            "url": "/name/nm0568478/"
        }
    ],
    "datePublished": "1986-05-06",
    "description": "Documentary filmmaker Ross McElwee sets out to make a movie about Union General Sherman's March to the Sea towards the end of the American Civil War, but keeps getting sidetracked by his own love life.",
    "director": [
        {
            "@type": "Person",
            "name": "Ross McElwee",
            "url": "/name/nm0568478/"
        }
    ],
    "duration": "PT2H37M",
    "genre": [
        "Documentary",
        "Biography",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI5OTEzNDcwOV5BMl5BanBnXkFtZTcwMjYzMjUyMQ@@._V1_.jpg",
    "keywords": "road trip,american civil war,personal quest,ex girlfriend,autobiographical",
    "name": "Sherman's March",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "drosse67"
        },
        "dateCreated": "2001-09-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091943/"
        },
        "name": "One man's confessional",
        "reviewBody": "First off, I'm not sure what this movie has in common with \"The Road Warrior,\" which is one of the movies recommended on the IMD \"if you enjoyed this movie.\" This movie cannot be compared with most other films because it is a documentary about the search for one man's inner happiness. Ross McElwee is a filmmaker commissioned to make a movie about the Civil War. Right before he begins his odyssey, his girlfriend leaves him. He's stuck with a camera and no inspiration to follow Sherman's trail through the south. His new odyssey is quite different than any historical documentary, and thank God for it. It is so wonderfully entertaining and funny because McElwee is a well-spoken, charming and insightful filmmaker. And a natural comedian to boot! His struggle to find true love in the modern south plays like a country fried steak version of Woody Allen. And the women he encounters are nearly as unforgettable and entertaining. This film and his follow-up, Time Indefinite, seem to serve as his personal catharsis. Normally I would cringe at the thought of watching someone make a movie just to better him or herself. But I have yet to see a more personal and entertaining documentary than Sherman's March."
    },
    "url": "/title/tt0091943/"
}