{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Basil Rathbone",
            "url": "/name/nm0001651/"
        },
        {
            "@type": "Person",
            "name": "Nigel Bruce",
            "url": "/name/nm0115558/"
        },
        {
            "@type": "Person",
            "name": "Evelyn Ankers",
            "url": "/name/nm0030166/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4827,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Lynn Riggs",
            "url": "/name/nm0726704/"
        },
        {
            "@type": "Person",
            "name": "John Bright",
            "url": "/name/nm0109148/"
        },
        {
            "@type": "Person",
            "name": "Arthur Conan Doyle",
            "url": "/name/nm0236279/"
        }
    ],
    "datePublished": "1942-09-18",
    "description": "When a Nazi saboteur jeeringly predicts to the nation new depredations, via their radio 'Voice of Terror', the Intellegence Inner Council summons Sherlock Holmes (Basil Rathbone) to help in the crisis.",
    "director": [
        {
            "@type": "Person",
            "name": "John Rawlins",
            "url": "/name/nm0712639/"
        }
    ],
    "duration": "PT1H5M",
    "genre": [
        "Crime",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDU0OWI4YjQtZjkwZS00YzlhLWE5MmQtNTdhYjI5NmU1OWEyXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "sherlock holmes character,dr. john watson character,seven word title,psychotronic film,world war two",
    "name": "Sherlock Holmes and the Voice of Terror",
    "original_info": {
        "id": "Sherlock Holmes: Terror by Night_1946",
        "name": "Sherlock Holmes: Terror by Night",
        "year": "1946"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "utgard14"
        },
        "dateCreated": "2014-06-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0035318/"
        },
        "name": "\"There's an east wind coming, Watson.\"",
        "reviewBody": "When the sinister Voice of Terror taunts England over the radio with news of acts of sabotage against the Allies, the Inner Council of British Intelligence has no choice but to turn to England's greatest detective, Sherlock Holmes (Basil Rathbone). Holmes, with help from his criminal underworld connections, investigates and uncovers the true identity of the Voice of Terror.\n\nAfter two fine films at Fox and a three-year gap, the Sherlock Holmes series movies to Universal. The change of studios also brings with it the updating of Holmes to the 1940s, where he understandably spends the early entries in the series battling Nazis. This change upsets many purists, who already have problems with the Rathbone series for its portrayal of Watson as comic relief and its deviations from the books. If you're one of those, I doubt anything I can say will alter your opinion. I don't happen to be bothered by the changes. I actually enjoy the movies more because of them.\n\nAs in his two films at Fox, Rathbone here is the perfect Holmes. One of my favorite scenes from any of his Holmes films occurs in this one when Holmes and Watson go to a seedy pub frequented by criminals. One of the criminals, a particularly frightening thug Sherlock put away years before, approaches the duo and we're led to believe any second now he will try to exact some violent revenge on Holmes. I won't spoil how the scene ends but pay attention to the way Rathbone plays this entire scene. It's wonderful stuff. I would be remiss in doing any kind of review for Voice of Terror without mentioning Rathbone's hairstyle. For some reason they decided to give him a rather silly-looking haircut where the hair on the sides is combed forward. It's hard not to chuckle when you first see it. Thankfully he wears a hat for a lot of the picture.\n\nFor his part, Nigel Bruce is a great sidekick. He has less to do here than some of the other movies but, as always, he's pleasant and fun to watch. The supporting cast is great, with the likes of Henry Daniell, Reginald Denny, and Thomas Gomez giving solid turns. Special mention goes to Evelyn Ankers, who gives one of her most different performances here. She plays the wife of a criminal killed for helping Holmes who then agrees to help the detective herself. Not for the sake of law & order but for the love of country. Her best scene is when she gives a rousing speech to her fellow criminals and lowlifes, enlisting them to help Holmes and England.\n\nThis is a solid start to the Universal Holmes series. Not the best but very entertaining nonetheless. Reading some of the older reviews here is a bit stomach-churning. Jeez, you'd think these people WANTED the Nazis to win! They seem so bitter and angry over the film being pro-England during World War II. What's this world coming to when people hate patriotism and nationalism so much they gripe about it more than the Nazis? The fact that most of these reviewers identify themselves as being from England or America makes the whole thing doubly sad.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When a Nazi saboteur jeeringly predicts to the nation new depredations, via their radio 'Voice of Terror', the Intelligence Inner Council summons Sherlock Holmes (Basil Rathbone) to help in the crisis.",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2903753497",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzJjMDM1ZjEtMDdmYS00ZmI1LWI1MmMtYjJmNzA2ZGMyOWE0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzJjMDM1ZjEtMDdmYS00ZmI1LWI1MmMtYjJmNzA2ZGMyOWE0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-21T16:44:36.872Z",
        "url": "https://www.imdb.com/video/vi2903753497/"
    },
    "url": "/title/tt0035318/"
}