{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Cushing",
            "url": "/name/nm0001088/"
        },
        {
            "@type": "Person",
            "name": "John Mills",
            "url": "/name/nm0590055/"
        },
        {
            "@type": "Person",
            "name": "Anne Baxter",
            "url": "/name/nm0000879/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 496,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "alternateName": "Sherlock Holmes and the Masks of Death",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103462/"
        },
        {
            "@type": "Person",
            "name": "Anthony Hinds",
            "url": "/name/nm0385573/"
        },
        {
            "@type": "Person",
            "name": "Arthur Conan Doyle",
            "url": "/name/nm0236279/"
        },
        {
            "@type": "Person",
            "name": "N.J. Crisp",
            "url": "/name/nm0187994/"
        }
    ],
    "datePublished": "1984-12-23",
    "description": "Sherlock Holmes investigates the case of a string of mysterious deaths with no apparent causes and the case of a missing German Prince that could cause war between England and Germany.",
    "director": [
        {
            "@type": "Person",
            "name": "Roy Ward Baker",
            "url": "/name/nm0001928/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Crime",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxMzI2MzE5OV5BMl5BanBnXkFtZTcwMjc4NjIyMQ@@._V1_.jpg",
    "keywords": "sherlock holmes character,dr. john watson character,four word title,death,murder",
    "name": "The Masks of Death",
    "original_info": {
        "id": "Sherlock Holmes: The Pearl of Death_1944",
        "name": "Sherlock Holmes: The Pearl of Death",
        "year": "1944"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DPMay"
        },
        "dateCreated": "2003-06-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0088108/"
        },
        "name": "Nice acting, shame about the plot.",
        "reviewBody": "Above all else, this TV movie was most welcome for giving Peter Cushing a chance to end his acting career on a high note and in one of his most celebrated roles (he appeared in one more film after this one but this was to be the last lead role of his long career). He'd first played Sherlock Holmes twenty-five years previously in a Hammer movie, and then in a 1968 BBC television series. Here, he revisits the character in a later stage of life and, accordingly, this time his rendition of the great detective is less agile and prone to moments of impatience and tetchiness. Cushing is just one of a number of senior actors in the cast, many of them sadly fast-approaching the end of their careers... Anne Baxter, Gordon Jackson, Anton Diffring... Ray Milland also sadly was not in great health at the time and it shows. Nevertheless, all give very good performances as one would expect from such distinguished names. The piece is nicely filmed with good location work and the music is okay too but unfortunately everything is let down by the plot. Much of the narrative involves Holmes and Watson investigating a supposed kidnapping which ultimately proves to be nothing more than a red-herring, conceived to keep Holmes distracted from another more important matter. One can't help wondering if it would have been easier for the villains to have simply assassinated Holmes if they were so worried about him bringing them to justice. And once this duplicity is discovered, the characters involved just vanish from the action and the story suddenly shifts to a climax that is, in itself rather unsatisfying. Why do Holmes and Watson, two ageing men, risk their lives in flushing the villains out of their lair when the police apparently have the whole place surrounded anyway?\n\nIt was a nice idea to see a more elderly Holmes in action for once and even better to have Peter Cushing playing him once again, and it's a shame that plans for a proposed follow-up never came to fruition, because a better story might have worked wonders. A good attempt that just doesnt quite come off."
    },
    "url": "/title/tt0088108/"
}