{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Basil Rathbone",
            "url": "/name/nm0001651/"
        },
        {
            "@type": "Person",
            "name": "Nigel Bruce",
            "url": "/name/nm0115558/"
        },
        {
            "@type": "Person",
            "name": "Evelyn Ankers",
            "url": "/name/nm0030166/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4827,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Lynn Riggs",
            "url": "/name/nm0726704/"
        },
        {
            "@type": "Person",
            "name": "John Bright",
            "url": "/name/nm0109148/"
        },
        {
            "@type": "Person",
            "name": "Arthur Conan Doyle",
            "url": "/name/nm0236279/"
        }
    ],
    "datePublished": "1942-09-18",
    "description": "When a Nazi saboteur jeeringly predicts to the nation new depredations, via their radio 'Voice of Terror', the Intellegence Inner Council summons Sherlock Holmes (Basil Rathbone) to help in the crisis.",
    "director": [
        {
            "@type": "Person",
            "name": "John Rawlins",
            "url": "/name/nm0712639/"
        }
    ],
    "duration": "PT1H5M",
    "genre": [
        "Crime",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDU0OWI4YjQtZjkwZS00YzlhLWE5MmQtNTdhYjI5NmU1OWEyXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "sherlock holmes character,dr. john watson character,seven word title,psychotronic film,world war two",
    "name": "Sherlock Holmes and the Voice of Terror",
    "original_info": {
        "id": "Sherlock Holmes and the Voice of Terror_1942",
        "name": "Sherlock Holmes and the Voice of Terror",
        "year": "1942"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Snow Leopard"
        },
        "dateCreated": "2005-11-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0035318/"
        },
        "name": "An Entertaining Start To The New Series",
        "reviewBody": "This Sherlock Holmes feature, the first of Universal's series that took the two stars (though little else) from the two earlier 20th Century Fox Holmes movies, got the new series off to a good start with an involved, entertaining story and a very good supporting cast. It has its flaws, but they by no means keep it from being an enjoyable movie with good characters and plenty of action. Though the credits cite the Arthur Conan Doyle story \"His Last Bow\" as the source, it is actually an entirely new story with only a handful of minor elements remaining from the original.\n\nThe choice to move the stories from the original Victorian setting to the (then) present meant that the new series would never have quite the same feel as the Doyle originals, but as some compensation it allowed for Holmes to be portrayed battling enemies that were then foremost in viewers' minds. This story of \"The Voice of Terror\" makes full use of anxieties and unpleasant possibilities that must have been only too frequently in the minds of its original viewers. It still succeeds in building tension and interest with its tale of Nazi-created disasters and mocking threats.\n\nThe story is very interesting, although it has a few overly convenient turns and plot holes. It gave Basil Rathbone and Nigel Bruce a chance to perform the kinds of material that they had already gotten used to doing together. They are helped considerably here by the supporting cast, which includes Reginald Denny and Henry Daniell as the most prominent members of the government council that is employing Holmes's services. But it is Thomas Gomez and Evelyn Ankers who really make a difference. Gomez has one of his best character roles as a crafty enemy agent, and Ankers does a fine job as a woman of low standing who gets a chance to serve her country.\n\nThe series would get even better as it went along, as Rathbone and Bruce continued to develop their camaraderie and as the production team eased into a familiar formula that could be varied as needed. But this one already got the series off to a solid start with a good movie that is still worth seeing."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When a Nazi saboteur jeeringly predicts to the nation new depredations, via their radio 'Voice of Terror', the Intelligence Inner Council summons Sherlock Holmes (Basil Rathbone) to help in the crisis.",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2903753497",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzJjMDM1ZjEtMDdmYS00ZmI1LWI1MmMtYjJmNzA2ZGMyOWE0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzJjMDM1ZjEtMDdmYS00ZmI1LWI1MmMtYjJmNzA2ZGMyOWE0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-21T16:44:36.872Z",
        "url": "https://www.imdb.com/video/vi2903753497/"
    },
    "url": "/title/tt0035318/"
}