{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Zachary Browne",
            "url": "/name/nm0115098/"
        },
        {
            "@type": "Person",
            "name": "Scott Wilson",
            "url": "/name/nm0934113/"
        },
        {
            "@type": "Person",
            "name": "Michael Moriarty",
            "url": "/name/nm0605363/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 990,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062423/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047872/"
        },
        {
            "@type": "Person",
            "name": "Phyllis Reynolds Naylor",
            "url": "/name/nm0623297/"
        },
        {
            "@type": "Person",
            "name": "Dale Rosenbloom",
            "url": "/name/nm0742428/"
        }
    ],
    "datePublished": "1999-04-01",
    "description": "When Shiloh's abusive previous owner, Judd Travers, tries to retake Shiloh again, Ray tries to find a way to end the rivalry and open up the hidden kindness within the town drunk.",
    "director": [
        {
            "@type": "Person",
            "name": "Sandy Tung",
            "url": "/name/nm0876619/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Family",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmQwYjAwOWMtZTlmMC00YmMxLTg3NzEtMTFlMTA0OGUxNDc3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTEwMTkwOTI@._V1_.jpg",
    "keywords": "human dog relationship,animal character name in title,repetition in title,dog,f rated",
    "name": "Shiloh 2: Shiloh Season",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "1999-11-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0175159/"
        },
        "name": "A dead zone of family entertainment, with a great performances by Scott Wilson. ** out of ****",
        "reviewBody": "Director: Sandy Tung Running time: 96 minutes Rated PG (for mild substance abuse and violence)\n\nThe novel by Phyllis Reynolds Taylor, \"Shiloh,\" has never been a successful screen adaptation. It wasn't originally, and it isn't now, thanks to the current sequel released by Warner Bros. \"Shiloh,\" that was discharged several years ago, suffered from a tedious first two acts, then took off immensely during act three. That last act was touching, inspiring, and heartwarming, just like the book and message of the film. \"Shiloh 2: Shiloh Season,\" suffers from that exact same syndrome; it really turns into something the last thirty minutes, but until then, the film tries to develop something that doesn't take two acts to develop, the conflict. Plus, even more to the film's discredit, we receive the same plot clichés as we did in the first film, giving the audience a sense of the \"been there, seen that\" feeling, resulting in a production worse than the original. For the most part, \"Shiloh 2: Shiloh Season\" is a dead-zone of family entertainment.\n\nThe setting once again takes place in a small country village. The story centers on a family by the name of Preston, consisting of Ray, the father, Louise, the mother, and their children, Dara Lynn, Becky, and Marty whom all attend a school named Friendly Elementary School (can't get over that one). In the first film, young Marty made a deal with his alcoholic and inhumanly cruel neighbor named Judd Travers; if he'll work for Judd for so many hours, Judd will give Marty his dog that he so deeply desires, Shiloh. Pretty simple concept. Quite complicated composition of a moral idea, though, because in \"Shiloh 2: Shiloh Season,\" the only difference between the two films external problem is that in this movie Judd wants Shiloh back from Marty, in the other film Marty wanted Shiloh from Judd. Doesn't offer much variety, does it?\n\nIn this story, Judd is presented as the absolute scum of the universe, and the filmmakers certainly carry his snarling personality a little too far. At least in the original \"Shiloh\" he had a hint of humanity in him. Here, Judd is the talk of the town. He is the topic of discussion in homes, the workplace, and even in elementary school. The characters mention a change in his attitude toward life so much, it's obvious that they are foreshadowing a pleasant ending, and before the closing credits roll around, Judd may or may not become a classic example of a dynamic character.\n\nI saw \"Shiloh 2\" at a special family film festival, and while seated in the audience, I noticed an awful lot of fidgeting, chattering, and even sleeping, much done by the children themselves--something unimaginable in productions like \"Toy Story\" or \"A Bugs Life.\" And the deserving performance by Scott Wilson, again, is such a tickle to the soul that it is a shame his character is so dreadfully underwritten that it is hard to do anything but hate Judd Travers.\n\nI disliked the film for the various reasons I have mentioned, but mostly because of lack of tension in the plot, lack of surprise in the conclusion, and lack of irony in the characters. The overall movie was missing a necessity required in every family film: interest. So even if you're a realist person and listen not to the critics, listen to the kids: I'd say that kids under the age of eleven have about a 25% chance of enjoying this picture. That is far more than the restless group I screened the movie with.\n\nBrought to you by Warner Bros."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2860646681",
        "name": "Shiloh 2: Shiloh Season",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2QwZjE1ZDAtZWVjYS00OWU4LTk3NzMtN2Y2Y2Y0NzkwZmUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2QwZjE1ZDAtZWVjYS00OWU4LTk3NzMtN2Y2Y2Y0NzkwZmUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:49:03Z",
        "url": "https://www.imdb.com/video/vi2860646681/"
    },
    "url": "/title/tt0175159/"
}