{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Scott Parietti",
            "url": "/name/nm1344176/"
        },
        {
            "@type": "Person",
            "name": "Derris Nile",
            "url": "/name/nm1381112/"
        },
        {
            "@type": "Person",
            "name": "Nicholas T. King",
            "url": "/name/nm1307486/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 392,
        "ratingValue": 3.7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0099819/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099820/"
        },
        {
            "@type": "Person",
            "name": "Christian Calson",
            "url": "/name/nm1379491/"
        }
    ],
    "datePublished": "2004-06-05",
    "description": "Raising the subtext of \"Fight Club'' into text, \"Shiner'' depicts a pair of amateur boxers gratified by punching each others' lights out. Theirs is among a trio of twisted love stories in the narrative feature by 29-year-old Los A...",
    "director": [
        {
            "@type": "Person",
            "name": "Christian Calson",
            "url": "/name/nm1379491/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcxNTU5MjgyN15BMl5BanBnXkFtZTcwOTYxMDcyMQ@@._V1_.jpg",
    "keywords": "jock strap,male rear nudity,nudity,frontal nudity,strip",
    "name": "Shiner",
    "original_info": {
        "id": "Shiner_2004",
        "name": "Shiner",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kasserine"
        },
        "dateCreated": "2005-04-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368268/"
        },
        "name": "Sincere Attempt",
        "reviewBody": "Shiner, directed by Christian Calson, centers around three \"couples\" and their relationships with obsession and violence. Pretty good start as far as I'm concerned. Interesting. The couples break down into a heterosexual couple, two heterosexual male friends and a straight guy being \"harmlessly\" stalked by a gay man.\n\nThe \"het\" couple really don't have much of a role in the film. There are some scenes that show how they like to be aggressive when having sex or playing around with each other, but seem to have no real purpose since the are so marginalized. My assumption is that they represent a more day to day illustration of how sex/violence are integrated in a couples life. The couple aren't very aggressive and it's not even shot in any kind of erotic way. As characters, they don't add much to the theme or plot.\n\nThe two male friends make up the bulk of the plot. They engage in some gay bashing of sorts by convincing a homosexual man to have sex with them in an alley. This escalates into violence. And the violence changes them. It becomes a means of sexual gratification. And their need for violence t release grows as the film progresses. The main problem I had is the violence is not convincing. Never once does it seem that any of the characters is in any real danger. It just doesn't work. Given that the whole theme of the film is about the characters' relationships with violence, this is a major problem. Unfortunately, the make-up doesn't help either. Sometimes, it's okay, other times it is very bad. In one scene, I really wondered why one of the characters had rouge smeared on his face. Confusing.\n\nThe more interesting pair of the characters is the \"stalker couple.\" Here Calson seemed to have more to say and was able to develop a more coherent storyline. Perhaps it is because the characters seem to develop more and have resolution at the end. Shiner may well have been much better if it had stuck with these two.\n\nI appreciate that Calson wanted to achieve a lot with this film. It is admirable. Most low budget flicks don't aspire to much. I don't think Calson achieved want he was aiming for. Myself, I found nothing particularly controversial or unsettling. Shiner was unconvincing. This doesn't mean, however, that the director can't achieve something with his next film.\n\nHe seems to have something to say.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0368268/"
}