{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vivien Leigh",
            "url": "/name/nm0000046/"
        },
        {
            "@type": "Person",
            "name": "Simone Signoret",
            "url": "/name/nm0797531/"
        },
        {
            "@type": "Person",
            "name": "José Ferrer",
            "url": "/name/nm0001207/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6447,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136675/"
        },
        {
            "@type": "Person",
            "name": "Katherine Anne Porter",
            "url": "/name/nm0692188/"
        },
        {
            "@type": "Person",
            "name": "Abby Mann",
            "url": "/name/nm0542631/"
        }
    ],
    "datePublished": "1965-10-01",
    "description": "A varied group of passengers boarding a ship bound for pre-WWII Germany represents a microcosm of early 1930s society.",
    "director": [
        {
            "@type": "Person",
            "name": "Stanley Kramer",
            "url": "/name/nm0006452/"
        }
    ],
    "duration": "PT2H29M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzM0Y2M3MzktYjQ4Yy00ZDYyLWIxMzktMzRjMzZiYTFhOGJhXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "german nationalism,1930s,based on novel,farm laborer,walking cane",
    "name": "Ship of Fools",
    "original_info": {
        "id": "Ship of Fools_1965",
        "name": "Ship of Fools",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "theowinthrop"
        },
        "dateCreated": "2005-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059712/"
        },
        "name": "A World Going to Hell in a Hack...err Steamer",
        "reviewBody": "About 1490 or so a German writer named Sebastian Brandt wrote an allegorical novel about the condition of mankind and types of men in their follies called DER NARR SHIFF (I believe that is the German title) which translates to \"The Ship of Fools\". At that time in Europe many humanists wrote such allegories, the most famous one being Erasmus' IN PRAISE OF FOLLY. Today Erasmus is still remembered, while Brandt is studied only by students of the German language and it's literature.\n\nThe title SHIP OF FOOLS was picked up by Katherine Anne Porter, who (for most of her literary career) was an excellent short story writer. At the tail end of that career she decided to tackle the larger target of a complete, complex novel. As one can see from the comments on this thread some people think she did superbly with her story and characterizations, while others think she flubbed it. I've never read the novel, but judging from the film version (and suspecting it is a watered down treatment, like most novels into films) it must be an above average work.\n\nTo me this is a film that actually stands out for individual moments by the cast. Michael Dunn ferociously lecturing Heinz Ruhlmann about the extreme anti-Semitism of the other passengers (not only the irritating neo-Nazi Jose Ferrer, but most of the other passengers) that has caused them (Dunn and Ruhlmann) to be banished to an isolated table for their meals. Ruhlmann, a kindly, nice man (who manages to make Ferrer's bigotry seem funny and stupid at one point) responds, \"There are one million Jews in Germany. Are they going to kill us all?\" The dialog is fairly sharp in these vignettes. Werner Klemperer, as a ship's officer, responding from signals from Vivien Leigh for some type of shipboard sexual encounter, discovering that Leigh is simply using him for a matter of trivial amusement. He tells her off in a fine little speech, which may have been the best delivered dialog of his career on film (and is years away from his Col. Wilhelm Klinck on HOGAN'S HEROES). Ferrer is half gregarious and half a bigoted swine, and totally untrustworthy. In the coming war unlike Herr Schindler, if Ferrer made a list it would be to turn Jews over to the authorities so he could get their possessions. His comment about how he is not anti-Semitic, he adores Arab people is almost as good as his spirited moment of pure entertainment when he sings a comic German song for the passengers. Even the minor actors on the screen have good moments. Witness the now forgotten Henry Calvin (a few years earlier he had been one of the \"Laurel & Hardy\" imitations in Walt Disney's BABES IN TOYLAND). Here he is one of the Cuban peasants transported by the ship to pre-Civil War Spain. His moment is when he tells off the racist Captain and his officers who have looked down on these steerage passengers, referring to the Captain as a pig. One can keep going on, especially with the sympathetic Oscar Werner and Simone Signoret, and with Dunn again, the only one of the passengers and crew who is intelligent.\n\nFor the point of the story is that this world of the 1930s is headed (as the reader knows) for disaster that will engulf everyone. The café society will not survive it. The Cuban immigrants will soon be killed by Republican or Fascists in Spain. The Captain and his crew will be drafted into Hitler's navy, and probably die in the Bismarck or some other ship. Marvin will be drafted, and even if he should survive the war he will find the segregation of his United States slowly eroded in the decades following the war. Ferrer will probably be starving in the ruins of Dresden or Berlin (if he is not killed in a bombing), wondering what happened to that prosperity the Nazis promised in a world without Jews. Every character in the story is facing the conclusion of the standards that gave them some degree of stability - some like Vivien Leigh and Simone Signoret are already going to pieces. In some ways, at the end, Werner and Dunn may be the only lucky ones. Werner is lucky because he will die before the war comes. Dunn...well since he is the clearest in terms of reality of all the characters, he will probably leave Europe before 1939, settle in the U.S. sitting out the war there, and only return afterwards to gaze at the ruins the others wrought.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT3M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3699507481",
        "name": "Ship of Fools",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjNiNzMzYjItNjEzNS00NjMzLWE0YTUtNzJmNzlhMDI3YzJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjNiNzMzYjItNjEzNS00NjMzLWE0YTUtNzJmNzlhMDI3YzJmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:49:15Z",
        "url": "https://www.imdb.com/video/vi3699507481/"
    },
    "url": "/title/tt0059712/"
}