{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charles Aznavour",
            "url": "/name/nm0002198/"
        },
        {
            "@type": "Person",
            "name": "Marie Dubois",
            "url": "/name/nm0239447/"
        },
        {
            "@type": "Person",
            "name": "Nicole Berger",
            "url": "/name/nm0074303/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19863,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Shoot the Piano Player",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0119013/"
        },
        {
            "@type": "Person",
            "name": "David Goodis",
            "url": "/name/nm0328959/"
        },
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        },
        {
            "@type": "Person",
            "name": "Marcel Moussy",
            "url": "/name/nm0610115/"
        }
    ],
    "datePublished": "1962-07-23",
    "description": "A pianist helps his brother escape from two gangsters, who retaliate by abducting their kid brother.",
    "director": [
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzgwMzA4OWYtNjIyNC00ZDkwLWIxMWItNzllNjA0NTU2ZTNlXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "pianist,female nudity,french new wave,nouvelle vague,paris france",
    "name": "Tirez sur le pianiste",
    "original_info": {
        "id": "Shoot the Piano Player_1960",
        "name": "Shoot the Piano Player",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "the red duchess"
        },
        "dateCreated": "2001-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054389/"
        },
        "name": "My favourite film.",
        "reviewBody": "'Shoot the Pianist' opens with the insides of a playing piano, the inner machinations of a musical instrument. This image points to the film's ambiguity. it says that this film will similarly uncover the insides (heart, soul) of a man who gives nothing away on the surface. it will suggest that his insides are like the piano's insides, the the only way he can express what's buried inside of him is through piano-playing - this is what gives the film its emotional pull. but it also suggests that Charlie Koller's fatal emotional timidity has warped or deadened that soul, made it a mere mechanism, alive only in a technical sense. More objectively, it amounts to a manifesto for Truffaut's intentions with the film, the way he will turn the gangster genre inside out, a genre he confessed to not really liking.\n\nAlthough Truffaut would go on to make self-conscious and superficial tributes to his hero (e.g. 'La Peau Douce', 'The Bride Wore Black'), 'Shoot the Pianist' is his most Hitchcockian film. Most obviously, it is a reworking of 'Vertigo', the story of a homme fatal (Koller - black widower?) who kills two women because he couldn't say the right thing, because he behaved like a man should, rather than the way he really feels. Lena is in effect a reincarnation of his dead wife, a woman who wants to reinstate his 'original' identity. Like Scottie Ferguson, Charlie is a man paralysed by memory, shellshocked by his experiences with an elusive love that could so easily have been his. \n\nBut, again like 'Vertigo', 'Pianist' is the study of masculine identity and its dissolution. When we first see Charlie he is literally in a scrapheap, getting dressed in front of a mirror. This mirror motif recurs throughout, and with it the question: who is Charlie Koller? The farmboy sibling of gangsters; the renowned pianist; the back-room tinkler; the father to his young brother; the man who desires but cannot ask, who keeps destructively pulling back? Throughout the real 'man' is deluged by different names, images (posters, paintings), stories etc. about himself: his own personality is divided by the talks he conducts with himself. Even the heartbreaking flashback sequence about his past is related to him by someone else. In the fear of losing his identity, of giving himself in union, Charlie loses everything.\n\nBut 'Pianist' is also reminiscent of early, British Hitchcock films like 'The 39 Steps' and 'Young and Innocent', in its playful irreverence with genre. David Thomson has said it was a film Laurence Sterne might have made, and, like 'Tristam Shandy', like those Hitchcock movies, the main genre narrative is frequently broken off by digressions and bits of business. The film plunges us in media res in the gangster genre, a man being chased in the obscurity. He bangs into a lamppost, and is helped by a passer-by. They start talking about marriage. This is emblematic of the film as a whole - a gangster film that keeps stopping to talk about love, women, family, music, the past etc. When the genre kicks in again - Chico (gangster name, yes, but Marx Brother too) rushes into his brother's bar, the tension is somewhat undermined by the comedy bar-room singer bouncing to the cymbals. When Charlie and Lena are kidnapped by the two hoods, a fraught situation turns into an hilarious banter about women and dirty old men. the most frightening sequence - the abduction of young Fido - provokes the funniest scene, where captor and captive debate the authenticity of the former's Japanese metal scarf.\n\nBut the film works the other way too, when the comic unexpectedly flashes into the tragic. In an early scene, Charlie agonises to himself about the proper etiquette to be used in handling Lena - this is a touching, sad scene, but full of the comedy of embarrassment. Suddenly, having dithered so long, Charlie realises she's gone. The scrunched pain on his face is devastating.\n\n'Pianist' is my favourite film. For Charles Aznavour's performance, the embodiment of shy timidity leading to emotional paralysis, and my altar ego. For the Godardian style, mixing abrupt, immediate, hand-held location shooting, and natural sound excitement, with a grasp of mise-en-scene worthy of the great 1950s melodramatists (the framing, cutting characters off from one another, trapping them in their decor; or the elaborate, Ophulsian camerawork, such as the 'Le Plaisir' gliding outside the bar; the circular narrative that sees continuity tragically affirmed in the shape of the new waitress). 'Pianist' couldn't have been made without Melville's 'Bob le Flambeur', and its flippancy and humanising of genre, but the influence of this on Cassavetes, Penn, Scorcese etc. was immense, for its generosity to all its characters, showing, despite Eustache, that a good woman can be a maman and putain. For the comic chutzpah, the dazzling abduction scene, the triptych revealing the boss's betrayal, the clumsy murder, the wonderfully bumbling hoods, Fido's Hawksian little dance. For Truffaut's concern with time and decay and art. For the haunting scene with the cello girl. For the music, fulfilling Noel Coward's dictum about the potency of cheap music, giving this short, strange movie its generous soul, a film that so humanely departs from genre it makes the generic climax grotesque, a DW Griffith nightmare in blinding white.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2276704537",
        "name": "Bande-annonce [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGI5MDFlZTQtNjA4MS00ZGM2LWJlYzEtZWI0NmEyOGIyMTJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGI5MDFlZTQtNjA4MS00ZGM2LWJlYzEtZWI0NmEyOGIyMTJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-09-02T18:36:37.443Z",
        "url": "https://www.imdb.com/video/vi2276704537/"
    },
    "url": "/title/tt0054389/"
}