{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sadie Frost",
            "url": "/name/nm0001244/"
        },
        {
            "@type": "Person",
            "name": "Jude Law",
            "url": "/name/nm0000179/"
        },
        {
            "@type": "Person",
            "name": "Sean Pertwee",
            "url": "/name/nm0675730/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2921,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014411/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008576/"
        },
        {
            "@type": "Person",
            "name": "Paul W.S. Anderson",
            "url": "/name/nm0027271/"
        }
    ],
    "datePublished": "1996-02-09",
    "description": "You've run out of options, no school, no job. Steal a car, smash a shop with a heavy car and reap the proceeds! This movie is about underground England. The causes, the benefits, and the result of a life of 'crash and carry.'",
    "director": [
        {
            "@type": "Person",
            "name": "Paul W.S. Anderson",
            "url": "/name/nm0027271/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjVlN2MzYTYtNzEyMy00YTI0LWFiMGYtZmJmOTBhZDgzYTM5XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "car,shopping,shop,shopping mall,rivalry",
    "name": "Shopping",
    "original_info": {
        "id": "Shopping_1994",
        "name": "Shopping",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "donkeyfur"
        },
        "dateCreated": "2004-09-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111173/"
        },
        "name": "Soundtrack, visuals redeeming features",
        "reviewBody": "Having read all the other reviews on this site, I notice that most people either completely hate the film or completely love it. I take the middle ground. I greatly enjoyed the visual elements, both with regard to the good-looking leads and the stylish camera work. I enjoy a film where I can pick out performers from other films and this one offered a few. I recognized Jason Isaacs (Captain Hook in the recent \"Peter Pan\" film), for one. That being said I was disappointed that Sean Bean's part was so small. However, I was glad Marianne Faithful's role was only a small cameo. It is painful to me to see her looking so haggard. \n\nI also enjoyed the pulsating soundtrack and believe that, with an inferior effort, the film would be even less appealing.\n\nAs others have pointed out, there's not much of a plot, but, beyond that, it was difficult to sympathize with the characters -- other than the police! The law officers in this film were not portrayed as sadistic or even unlikable. Frustrated, yes. The \"protagonists\" had no redeeming characteristics other than youth, good looks and energy. The film seems to present the viewpoint that the police deserved the treatment they received from the thugs. To me, the film produces a nihilistic, 'who gives a damn' about anything attitude. It made me think about anarchy: after \"the system\" is demolished, with what will it be replaced?\n\nI'm probably waxing too philosophical about a movie that never even aspired to such musings. The producers probably just wanted to give a youthful audience the smash 'em up, 'wham bam thank you ma'am' form of entertainment many seem to want. (Witness \"The Fast and the Furious\" and Vin Diesel's \"XXX\" among others.) I like a bit of action, too, but I prefer to care about someone or something along the line.\n\nNevertheless, I maintain that I have seen worse films. I confess to an admiration of British films and actors that causes me to overlook aspects of a movie that I don't like in order to focus on what I consider to be redeeming features. For example, I found Sean Pertwee's character in this film interesting, even if the character is what we Americans like to call a \"scumbag\". The bottom line, to me, is that the positives -- including the soundtrack, visual elements, and interesting cast -- outweigh the negatives. I bought the film at what you British call a jumble sale for $2.00 (American money), so I'm not out a lot of loot in any case. I will keep the film alongside \"Love, Honour and Obey\", another second-hand bargain I found along the way. It too, has redeeming features."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "You've run out of options, no school, no job. Steal a car, smash a shop with a heavy car and reap the proceeds! This movie is about underground England. The causes, the benefits, and the result of a life of 'crash and carry.'",
        "duration": "PT1M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4062167833",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWEzZGI4N2MtMTc5Yy00MzczLTlkMTctNjE5YjYyMWJhNGRlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWEzZGI4N2MtMTc5Yy00MzczLTlkMTctNjE5YjYyMWJhNGRlXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-30T00:15:02.768Z",
        "url": "https://www.imdb.com/video/vi4062167833/"
    },
    "url": "/title/tt0111173/"
}