{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert De Niro",
            "url": "/name/nm0000134/"
        },
        {
            "@type": "Person",
            "name": "Eddie Murphy",
            "url": "/name/nm0000552/"
        },
        {
            "@type": "Person",
            "name": "Rene Russo",
            "url": "/name/nm0000623/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 63937,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108864/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024939/"
        },
        {
            "@type": "Person",
            "name": "Jorge Saralegui",
            "url": "/name/nm0764822/"
        },
        {
            "@type": "Person",
            "name": "Keith Sharon",
            "url": "/name/nm0972440/"
        },
        {
            "@type": "Person",
            "name": "Alfred Gough",
            "url": "/name/nm0332184/"
        }
    ],
    "datePublished": "2002-03-15",
    "description": "A spoof of buddy cop movies where two very different cops are forced to team up on a new reality based television cop show, while tracking down the manufacturer and distributor of an illegally made semi-automatic firearm.",
    "director": [
        {
            "@type": "Person",
            "name": "Tom Dey",
            "url": "/name/nm0223359/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTQzNGUyYzEtYzhlOC00YTQzLWJmOGYtOTNlMzE1Yjk4MDkzXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_.jpg",
    "keywords": "police,buddy cop,police shootout,foot chase,brawl",
    "name": "Showtime",
    "original_info": {
        "id": "Showtime_2002",
        "name": "Showtime",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2002-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0284490/"
        },
        "name": "A new kind of Cop-Buddy film",
        "reviewBody": "SHOWTIME(2002) (3/5stars)\n\nStarring ROBERT DE NIRO EDDIE MURPHY RENE RUSSO And WILLIAM SHATNER\n\nIn the new cop-buddy film Showtime, Robert De Niro plays Mitch Preston, a tough NYC cop, who in the opening credits distinctly points out that being a cop is nothing like the movies portray with their clichés . Eddie Murphy plays Trey Sellers, a cop who dreams of acting in films. After Mitch shoots out a TV camera at a crime scene, a network executive (Rene Russo) decides that they will sue the police department, unless Mitch agrees to be part of their new reality based cop show. When Mitch is forced to become part of the show, he ends up getting Trey Sellers as a partner. Trey is nothing like Mitch. Trey is goofy, doesn't follow standard police procedures, and doesn't take his police work seriously. Mitch is the exact opposite. So here comes the average cop-buddy film, right? Two opposites, forced to work together, who in the end patch everything up and become best friends? Not exactly.\n\nWhat makes Showtime different from the rest of the cop-buddy films in the genre, is that the whole situation is different, and is not exactly what you'd expect. Never before has a cop-buddy movie had the officers followed around with a camera. So with this in mind, this movie might be great, right? Again, not exactly.\n\nThe problem with Showtime is, it could have been so much better. The camera really could've gotten some funny stuff. But in this film, instead of focusing more on the fact that they're constantly being filmed, most of the film we don't see the camera man following them. We see them at home, or talking about things, doing things. We never see the camera man with them. The film focuses more on what it's like to be followed by a camera, instead of WITH a camera. What I mean by this, is that we are shown footage of how Mitch and Trey react AFTER filming. It's like a celebrity bio. We see them behind the camera, their ordinary lives, and how they cope with paparazzi and spotlight. However, in Showtime, that's not what we want to see. We want to see the camera chasing them the whole way through the movie. We want to see Mitch and Trey react on the spot, dealing with the camera THERE and THEN, not later. It would be so much more of a fun movie, if we could just see Mitch and Trey, the whole time being followed on the street, getting into funny situations instead of what Showtime gives us-a look at how Mitch and Trey deal with it after their work day is over, and the cameras stop rolling. I'll admit, this happened a few times in the film, but it should've been more. The director really missed out on a funny movie here, by not portraying it the right way, and not taking it in the right direction.\n\nWe find the plot in this film, to not really be taken seriously at all. No one really cares. At one point, Mitch and Trey get a big lead, and the camera doesn't show them react at all to it. They just go off, and we see them joking around driving in the car again.\n\nThe acting in Showtime was good, but the chemistry between the characters wasn't all that special. Nothing jumped out at me with DeNiro and Murphy. I've seen much better chemistry between actors. It wasn't horrible chemistry, but it wasn't great, either.\n\nAll in all, what Showtime could've been, it isn't. It more or less forgets the cameras are following these cops, and just leads us away from caring about anything going on. Showtime is like a mix between Lethal Weapon, Beverly Hills cop, COPS, and Turner and Hootch. It may sound like a weird combo, but it's true. Some of those films/shows are great, but if you combined them the wrong way, with wrong directing style and progression, what would you get? Showtime.\n\nSo, do I recommend this film to you? Believe it or not, yes, I do. Because though it wasn't great, and wasn't half of what it could've been, it's still got some funny moments, and Robert DeNiro gives us the ol tough guy cop image like some of his other films, and Eddie Murphy redoes his `Break all the rules/procedures, goof off and triumph!' attitude. So though Showtime isn't great, a one time viewing isn't going to hurt. DeNiro's expressions throughout the movie help a lot. That's why I recommend renting and viewing the film once. 3/5 stars, enjoy!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi109248793",
        "name": "Showtime",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWI4MmY1ZGEtNmIwMC00NTE0LTljMzQtYWRhYjJmZmRiYWExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWI4MmY1ZGEtNmIwMC00NTE0LTljMzQtYWRhYjJmZmRiYWExXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:50:27Z",
        "url": "https://www.imdb.com/video/vi109248793/"
    },
    "url": "/title/tt0284490/"
}