{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elizabeth Berkley",
            "url": "/name/nm0000924/"
        },
        {
            "@type": "Person",
            "name": "Kyle MacLachlan",
            "url": "/name/nm0001492/"
        },
        {
            "@type": "Person",
            "name": "Gina Gershon",
            "url": "/name/nm0000153/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 70120,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "NC-17",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0094459/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071377/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026841/"
        },
        {
            "@type": "Person",
            "name": "Joe Eszterhas",
            "url": "/name/nm0000390/"
        }
    ],
    "datePublished": "1995-09-22",
    "description": "Nomi, a young carefree drifter, arrives in Las Vegas, Nevada to become a dancer and soon sets about clawing her way to the top of the Vegas showgirls.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Verhoeven",
            "url": "/name/nm0000682/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Adult",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzcyMjExNjg3OF5BMl5BanBnXkFtZTgwOTY4Mjc1MDE@._V1_.jpg",
    "keywords": "lap dancing,striptease,stripper,sex in a swimming pool,rape",
    "name": "Showgirls",
    "original_info": {
        "id": "Showgirls_1995",
        "name": "Showgirls",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "winkwi"
        },
        "dateCreated": "2006-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114436/"
        },
        "name": "The Best Movie Ever Made of It's Genre!",
        "reviewBody": "The seedy under belly of Las Vegas? Nude lap dancing? A tough old broad with a heart of gold and the mouth of a sewer? A ruthless climb to the top? Kicking a fuax Michael Bolten's azz in thigh highs? This movie has it all and then some! Showgirls is one of the funniest comedies ever made. OK, so it was supposed to be an erotic drama but forget that and sit back and laugh your way through the very best of the worst movies ever made.\n\nThere wasn't a thing that did not go wrong with this film. The script reads like it was created via the Hollywood processor. Feed in one part 'Flashdance', another 'Basic Instinct' and with more than a with a tiny dose of the great 'All About Eve', and then stir with a few characters lifted from a 'Mannix' rerun: the Cheetah club operator (who reads like he came from pimp school 101) the chubby foul-mouthed MC with a heart of gold, and best friend who will have to suffer and ladies and gentleman, we are ready to shoot! And what about the cast? Madonna, in one of the few wise film choices she made, turned down the role of the leading lady of Las Vegas and Gina Gershon stepped in. Drew Barrymore said no thanks to the role of Nomi, the ambitious dancer who was ready to claw her way to the top, and after they hit up every B, C and D list of actresses they ended up casting Elizabeth Berkley. Who, up to then, was best known for her sweetie pie role on the tween comedy \"Saved By the Bell.' \n\nDirector Paul Verhoven and screenwriter Joe Esterhaus re-team coming of the world wide smash hit 'Basic Instinct' and most likely had virtual carte blanche, no one to say no. They made gazillions for the investors of Basic and were at the pinnacle of their power.\n\nA lousy script, incredibly poor casting choices and direction and big glitzy production numbers and the recipe for a disaster of legendary proportions was the result.\n\nSit back, have a glass of champagne, get ready to toss your fries and sit back and enjoy. You will be able to tell all your friends you saw it long before the Broadway musical all drag version was all the rage!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Showgirls",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi272931097",
        "name": "Showgirls: 15th Anniversary Sinsational Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWI4ODk4ZmQtMjA4ZC00ZGRlLWE0MGEtYjhmMWZiN2QzOWNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWI4ODk4ZmQtMjA4ZC00ZGRlLWE0MGEtYjhmMWZiN2QzOWNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-11-20T06:24:08Z",
        "url": "https://www.imdb.com/video/vi272931097/"
    },
    "url": "/title/tt0114436/"
}