{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christian Taylor",
            "url": "/name/nm0995597/"
        },
        {
            "@type": "Person",
            "name": "Lindy Heymann",
            "url": "/name/nm1202909/"
        },
        {
            "@type": "Person",
            "name": "Joe Daley",
            "url": "/name/nm0197854/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 336,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0143488/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030945/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007378/"
        },
        {
            "@type": "Person",
            "name": "Christian Taylor",
            "url": "/name/nm0995597/"
        },
        {
            "@type": "Person",
            "name": "Lindy Heymann",
            "url": "/name/nm1202909/"
        },
        {
            "@type": "Person",
            "name": "Jason Buchtel",
            "url": "/name/nm1202120/"
        }
    ],
    "datePublished": "2002-06-22",
    "description": "Fired from a TV show, a writer looks into becoming a chorus boy while a documentary crew follows his efforts.",
    "director": [
        {
            "@type": "Person",
            "name": "Lindy Heymann",
            "url": "/name/nm1202909/"
        },
        {
            "@type": "Person",
            "name": "Christian Taylor",
            "url": "/name/nm0995597/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIzMDk1MTAxNV5BMl5BanBnXkFtZTcwNDI0NzgyMQ@@._V1_.jpg",
    "keywords": "man dances with a man,dancer,tv show,firing,f rated",
    "name": "Showboy",
    "original_info": {
        "id": "Showboy_2002",
        "name": "Showboy",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "clocksnmirrors"
        },
        "dateCreated": "2004-08-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0326148/"
        },
        "name": "Surprising, Compelling and Very Touching",
        "reviewBody": "If you've ever found yourself down and out, you may want to take a lesson from Christian Taylor. He's our hero in the mockumentary Showboy, a story of the triumph of persistence in the face of marginal talent. \n\nThis feature doesn't strive to achieve the rhythm or style of a Christopher Guest comedy. There is something far more genuine in the gently comedic portrayal of Christian as a man whose life takes an abrupt left (or right) turn and who is forced to come to grips with one dream lost as another emerges. \n\nChristian is being featured in a documentary about young brits working in Hollywood. Unfortunately for him, as the movie starts, Christian is being fired from his writing job on the show Six Feet Under. On the pretext of researching a character for a nonexistent screenplay he claims to be writing, he leads the documentary crew on an excursion through Las Vegas as he auditions to become a \"showboy\". There's only one thing holding him back - Christian is not in any way a dancer.\n\nAs we follow him from dance hall to strip club and beyond, we meet a sprinkling of celebrities, including Whoopi Goldberg and Sigfried and Roy, all of whom make you believe that this is really \"for real\". In fact, one of the biggest surprises about this film is that I found myself, on several occasions, wondering whether this wasn't an actual documentary. The performances from top to bottom were all so natural that I really began to believe.\n\nThe other big surprise for me is that I fell utterly in love with Christian.\n\nHe's a gay character who is inoffensive without being bland, and sexy without being salacious. He gets knocked down but he never quits. And I love that there's nothing saccharin in the portrayal. And darn if he doesn't pick up a dance move or two. \n\nThis movie warmed my heart. And trust me, that's no easy feat. If you're willing to sit down and participate in a slice of a life that's humorous and touching, this one is definitely worth your while.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0326148/"
}