{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kathryn Grayson",
            "url": "/name/nm0337113/"
        },
        {
            "@type": "Person",
            "name": "Ava Gardner",
            "url": "/name/nm0001257/"
        },
        {
            "@type": "Person",
            "name": "Howard Keel",
            "url": "/name/nm0444476/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5155,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "John Lee Mahin",
            "url": "/name/nm0536941/"
        },
        {
            "@type": "Person",
            "name": "Jerome Kern",
            "url": "/name/nm0006153/"
        },
        {
            "@type": "Person",
            "name": "Oscar Hammerstein II",
            "url": "/name/nm0358564/"
        }
    ],
    "datePublished": "1951-09-24",
    "description": "The daughter of a riverboat captain falls in love with a charming gambler, but their fairy tale romance is threatened after his luck turns sour.",
    "director": [
        {
            "@type": "Person",
            "name": "George Sidney",
            "url": "/name/nm0796645/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Drama",
        "Family",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmI4MGE2OGItNWU0ZS00NjczLTkwM2MtMzAyNDYxYTJkNjA2L2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "boat,man slaps a woman,man wears a top hat,man wears a tuxedo,woman drops a handkerchief",
    "name": "Show Boat",
    "original_info": {
        "id": "Show Boat_1951",
        "name": "Show Boat",
        "year": "1951"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Doylenf"
        },
        "dateCreated": "2001-05-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0044030/"
        },
        "name": "Why all the putdowns of this great musical??? In many ways an improvement over 1936 original...",
        "reviewBody": "I strongly disagree with some of the other viewers. 'Showboat' -- the 1951 version -- is not inferior to the earlier, darker Universal version with Irene Dunne and Allan Jones. The talent used for the lavish technicolor remake is in itself superior to the cast of the original--Howard Keel, Kathryn Grayson, Ava Gardner, Joe E. Brown, Agnes Moorehead, Robert Sterling -- and most importantly, Marge and Gower Champion who can do no wrong with dance numbers. By comparison, the dances in the original version appear uninspired--and even the legendary Helen Morgan (not a conventional beauty by any standards) fails to evoke the same magic Ava Gardner does as Julie. True, Morgan did her own singing but Gardner's voice on the soundtrack could just as well have been used instead of Annette Warren's. \n\nOther than that, the MGM film is just fine--everything is staged with much more zest and enthusiasm than is present in the awkward, lumbering James Whale version. And Marge and Gower Champion's version of \"Life Upon the Wicked Stage\" is a priceless example of this team's artful way with a show tune. Their contribution is a major asset of the newer version.\n\nLikewise, Grayson and Keel blend their rich voices in song the way they were meant to be heard by Kern & Hammerstein. Irene Dunne had a modest soprano voice but she was not as accomplished a singer as Grayson nor did she deliver numbers with Kathryn's uncommon ease. Performance-wise, Grayson is a bit too subdued against Gardner's more colorful character and did not kick up her heels the way she would in 'Kiss Me Kate', one of her best roles. \n\nAs for Allan Jones in the earlier version, he was a personable enough singer/actor but he was nowhere close to Keel's adroit handling of both songs and dialogue. Keel went on to become a staple of some of MGM's finest musicals and a fine reputation as a strong singer.\n\nThe pacing of the older film was slow, leisurely and downright boring at times. The remake is much easier on the eyes and ears. There's a hint of snobbism in the putdowns this film gets from some of the more discriminating viewers who cannot forgive whatever changes were made to make the plot line and time frame smoother. A deliberate change in story structure does not make a film inferior to the original. \n\nA high point of the film is, of course, William Warfield's full-bodied version of \"Old Man River\" -- just another of the film's memorable musical moments. An MGM musical in the grand tradition--not to be missed."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT4M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2570305305",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTFlNmVlMWMtMzlmNC00ODZmLWE0MGMtYmEyYjJlZTUyMzE1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTFlNmVlMWMtMzlmNC00ODZmLWE0MGMtYmEyYjJlZTUyMzE1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-11-27T17:32:02.682Z",
        "url": "https://www.imdb.com/video/vi2570305305/"
    },
    "url": "/title/tt0044030/"
}