{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Flanagan",
            "url": "/name/nm0281008/"
        },
        {
            "@type": "Person",
            "name": "Sheree Rose",
            "url": "/name/nm0741671/"
        },
        {
            "@type": "Person",
            "name": "Kathe Burkhart",
            "url": "/name/nm0122009/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1680,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Sick",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0140880/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0140475/"
        }
    ],
    "datePublished": "1997-11-07",
    "description": "Diagnosed with cystic fibrosis from a young age, performance artist Bob Flanagan shared his life and pain in his art, usually through sadomasochistic practices.",
    "director": [
        {
            "@type": "Person",
            "name": "Kirby Dick",
            "url": "/name/nm0225269/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkwNDQ2MDU4NF5BMl5BanBnXkFtZTcwODc0MTgyMQ@@._V1_.jpg",
    "keywords": "cystic fibrosis,sexual sadism,mutilation,genital mutilation,body modification",
    "name": "Sick: The Life & Death of Bob Flanagan, Supermasochist",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ElijahCSkuggs"
        },
        "dateCreated": "2008-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120126/"
        },
        "name": "Extremely Graphic and Touching Documentary",
        "reviewBody": "Going into this flick I really didn't know much about Mr. Flanagan. I knew he was obviously a super-masochist (thanks to the DVD cover), and I knew that he was involved in a Nine Inch Nails video. But that's it. When the credits began to roll, you end up with a fantastic idea on who he was and how he lived his life. It's one of the most intimate and best documentaries I've seen.\n\nSick: The Life & Death of Bob Flanagan is a perfect title for this documentary. You discover that Mr. Flanagan does indeed have a hobby that most would consider \"sick\", but also that Mr. Flanagan suffers from Cystic Fybrosis. A lung disease where the death rate is high and the people who do suffer from it, usually die at a very young age. Truthfully for me, the masochism and the torture play a second fiddle to his life long struggle with cystic fibrosis. Sure seeing his unbelievable sexual performances are truly stunning, but what is more stunning is how he lives his life. Going into this movie I really wasn't expecting such an intimate and touching piece of film. There are some incredibly graphic scenes mixed with fantastic humor, and then there are scenes that display some of the most powerful moments of emotion I've seen on film or in real life.\n\nIn a perfect world Sick: The Life and Death of Bob Flanagan would be a movie widely seen. It's definitely one of the best documentaries I've ever seen and a movie I'll be recommending for years and years to come.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0120126/"
}