{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Oldman",
            "url": "/name/nm0000198/"
        },
        {
            "@type": "Person",
            "name": "Chloe Webb",
            "url": "/name/nm0916050/"
        },
        {
            "@type": "Person",
            "name": "David Hayman",
            "url": "/name/nm0371342/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33346,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046018/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103620/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041491/"
        },
        {
            "@type": "Person",
            "name": "Alex Cox",
            "url": "/name/nm0007182/"
        },
        {
            "@type": "Person",
            "name": "Abbe Wool",
            "url": "/name/nm0941067/"
        }
    ],
    "datePublished": "1986-11-07",
    "description": "The relationship between Sid Vicious, bassist for British punk group Sex Pistols, and his girlfriend Nancy Spungen is portrayed.",
    "director": [
        {
            "@type": "Person",
            "name": "Alex Cox",
            "url": "/name/nm0007182/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzRiODJiYjMtN2RiNy00NGVhLWJlN2MtODc4ZThiMGJmYzk0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "vomiting,brandy,peppermint schnapps,self harm,character names as title",
    "name": "Sid and Nancy",
    "original_info": {
        "id": "Sid & Nancy_1986",
        "name": "Sid & Nancy",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "saska-3"
        },
        "dateCreated": "2003-06-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091954/"
        },
        "name": "Masterful performances by Oldman and Webb",
        "reviewBody": "When I was 15, I loved this movie because I loved the Sex Pistols and everything punk. Now that I am twice that age, I love this film for its unflinching portrayal of two people's lives, despite how uncomfortable it makes us, how little we sympathize with them as people, or how hard it is for us to comprehend the choices they made. I personally believe at least part of the discomfort comes from the fact that at some level, we DO understand Sid and Nancy, their love for each other, and the choices they make beneath the haze of addiction.\n\nI realize, seeing it with adult eyes, why my parents were so shocked I was watching this film in 1987. But ironically, it was the best anti-drug message I could have seen in my teenage years. In performances so masterful they make me wince, fight off nausea, and weep for their misfortune, Gary Oldman and Chloe Webb constructed characters no one would ever want to be. The supporting cast deserves accolades as well - in particular, Andrew Schofield turns in a seamless portrayal of Johnny Rotten, who, unlike Sid, knows full well Malcolm MacLaren created him.\n\nHaving read \"And I Don't Want To Live This Life\" by Debora Spungen, and having seen more than a handful of documentaries with live footage of the band throughout the years, what impressed me most was the consistency of tone that Oldman and Webb bring to their performances. They are spot-on, not just in stupor and excess, but in tenderness and rare moments of clarity. The movie's ending was unique among biopics where the truth is in dispute, in that it did not profess to know the answer to that burning question (did Sid kill Nancy?) any more than Sid knew himself.\n\nWhy watch a film about a couple of junkies who came from unremarkable backgrounds and disappeared into the bleakness of drug addiction? We seem to want our films to be about something loftier than ourselves. I view \"Sid and Nancy\" more as a play than a movie - we allow our plays to be about uncomfortable subjects and unhappy people, but seem to think that celluloid must be as bright as the projector light behind it. This film is a study in love and dysfunction; its characters are painfully imperfect but perfectly portrayed and we cannot help but respond, even if our response is the deep, squirming discomfort that leads us to say we disliked the whole experience.\n\nI rated this film a very rare 9.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Sid and Nancy: 30th Anniversary",
        "duration": "PT1M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2591405849",
        "name": "Sid and Nancy: 30th Anniversary",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmYyOWFkZmYtNzA2NC00ZmUyLTk2OGMtNjk2NWJiOTEzMGYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmYyOWFkZmYtNzA2NC00ZmUyLTk2OGMtNjk2NWJiOTEzMGYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-07-28T14:46:41Z",
        "url": "https://www.imdb.com/video/vi2591405849/"
    },
    "url": "/title/tt0091954/"
}