{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Giamatti",
            "url": "/name/nm0316079/"
        },
        {
            "@type": "Person",
            "name": "Thomas Haden Church",
            "url": "/name/nm0002006/"
        },
        {
            "@type": "Person",
            "name": "Virginia Madsen",
            "url": "/name/nm0000515/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 195219,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028932/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088247/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0133320/"
        },
        {
            "@type": "Person",
            "name": "Rex Pickett",
            "url": "/name/nm0681914/"
        },
        {
            "@type": "Person",
            "name": "Alexander Payne",
            "url": "/name/nm0668247/"
        },
        {
            "@type": "Person",
            "name": "Jim Taylor",
            "url": "/name/nm0852591/"
        }
    ],
    "datePublished": "2004-10-22",
    "description": "Two men reaching middle age with not much to show but disappointment embark on a week-long road trip through California's wine country, just as one is about to take a trip down the aisle.",
    "director": [
        {
            "@type": "Person",
            "name": "Alexander Payne",
            "url": "/name/nm0668247/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU0Mjg3MzkxOV5BMl5BanBnXkFtZTYwNDU1OTY3._V1_.jpg",
    "keywords": "wine,road trip,vineyard,middle age,wine tasting",
    "name": "Sideways",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Red_Identity"
        },
        "dateCreated": "2012-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0375063/"
        },
        "name": "Excellent, one can say, perfect",
        "reviewBody": "I had known of Sideways for a long time now. Being the huge film fan that I am, I remember always seeing it get mentioned in many message boards, or websites, or critics' best-of-the-decade lists. It wasn't until now that I saw it, and the reason is because I recently saw Payne's new film The Descendants and I fell in love with it. It wasn't just his simple writing, but his direction, the feel that he gave it. Sideways was another gem, and an even better one.\n\nThis could be called a dramedy in many ways, a comedy/drama. There are many films these days getting released that could be labeled in those two genres, and yet Sideways makes it look easier than The Descendants even. What we have here is a brilliant script all around, fully fleshing out these characters. And the investment I had with Giamatti... enormous. I was on this ride with him, I felt his pain, his anger, his awkwardness when confronted with aggravating or tense situations. I found myself telling him things on the screen, and even staying at the edge of my seat in a funny situation he is put in by his friend near the end. Whereas The Descendants lived on it's script through a lot of quiet moments, Sideways blends in simple, subtle moments with really incredible dialogue. The dialogue between the two was the main difference, and yet Sideways is very much of the feeling one is put in. \n\nI want to say the ensemble cast is fantastic. Church really made me question just how much of a friend he was, and yet still made him completely sympathetic and be able to be understood. As for Virginia Madsen... I felt like I was also falling for her like the lead. Some of her scenes, especially the conversations between her and Giammatti, she plays incredibly. She makes you feel the likability of her character, and yet also feel the sensuality and the vulnerability that she is pushing through with her shared desire. She was fantastic. Giamatti is fantastic as the disappointing lead, and although he always seems to play these sort of characters, he knows what to do to make them completely work.\n\nOverall, extremely satisfied with this, and still here is the unique touch of real feeling for the characters that I witnessed in the Descendants. How could I not love this? Payne's film pushes through the screen what can only be described as an incredibly real connection, a connection that I honestly don't witness very often with comedies."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi864551193",
        "name": "Sideways",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWI2OGZmZWMtMjY5Yi00Zjk5LWEwMGYtM2NiOTY0MDdiYmRiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWI2OGZmZWMtMjY5Yi00Zjk5LWEwMGYtM2NiOTY0MDdiYmRiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2008-04-11T16:06:10Z",
        "url": "https://www.imdb.com/video/vi864551193/"
    },
    "url": "/title/tt0375063/"
}