{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Johnny Whitaker",
            "url": "/name/nm0924278/"
        },
        {
            "@type": "Person",
            "name": "Scott C. Kolden",
            "url": "/name/nm0463980/"
        },
        {
            "@type": "Person",
            "name": "Billy Barty",
            "url": "/name/nm0000863/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 899,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072315/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070812/"
        },
        {
            "@type": "Person",
            "name": "Marty Krofft",
            "url": "/name/nm0471897/"
        },
        {
            "@type": "Person",
            "name": "Sid Krofft",
            "url": "/name/nm0471898/"
        },
        {
            "@type": "Person",
            "name": "Si Rose",
            "url": "/name/nm0741676/"
        }
    ],
    "datePublished": "1973-09-08",
    "description": "Two boys try to maintain normal lives while secretly having adventures with families of sea monsters and genies.",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5NDk2ODc0MF5BMl5BanBnXkFtZTgwOTQ3MTkwMzE@._V1_.jpg",
    "keywords": "psychotronic series,sea monster,housekeeper,brother brother relationship,friendship",
    "name": "Sigmund and the Sea Monsters",
    "original_info": {
        "id": "Sigmund and the Sea Monsters_1973",
        "name": "Sigmund and the Sea Monsters",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "richard.fuller1"
        },
        "dateCreated": "2005-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069632/"
        },
        "name": "Would You Watch it for A Scooby Snack?",
        "reviewBody": "Like Scooby Doo's Scooby Snacks, the Krofft shows will always be drug-related when they are seen and re-discovered.\n\nNo one watches Sesame Street or the Muppets and recalls drug usage.\n\nI for one think you could have watched Sixty Minutes back then and been stoned and thought 'far out.' I have just converted my Krofft shows that I recorded off Tvland to DVD and watched them again.\n\nSigmund was quite a standout, I thought, mainly for the Ooze family and Mary Wickes as Aunt Zelda, but the whole Johnny Whitaker thing had me shaking my head.\n\nLike Ron Howard, Whitaker was likable, but the show often placed Whitaker as a cool kid, which he certainly wasn't. When he does behavior for his age, he works, and he speaks very well to adults, such as Wickes, but his singing? Who thought he could sing? The songs are amazing copy-right infringes on the Beach Boys \"California Girls\" and the Beatles \"Got to Get You Into My Life\".\n\nThe song Whitaker sings at the end of the Trick or Treat episode borrows from \"Alley Oop\".\n\nStill, its a fascinatingly constructed show. Aunt Zelda definitely delivers an authoritative threat as to why Sigmund cannot be found.\n\nI wonder what she would have done? Told her sheriff boyfriend and they would have taken him to a science lab for studying? The transition of Krofft shows from Pufnstuf to Kaptain Kool (I never watched Pryor's Place or DC Follies) are intriguing to study, and Sigmund definitely stands out well on its own.\n\nAs for the later Rip Taylor-Sparky Marcus episodes, never watched those and don't want to."
    },
    "url": "/title/tt0069632/"
}