{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gorô Naya",
            "url": "/name/nm0623214/"
        },
        {
            "@type": "Person",
            "name": "Lisa Ann Beley",
            "url": "/name/nm0067754/"
        },
        {
            "@type": "Person",
            "name": "Don Brown",
            "url": "/name/nm0113427/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 116,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Silent Möbius 2",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060607/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054537/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108317/"
        },
        {
            "@type": "Person",
            "name": "Michitaka Kikuchi",
            "url": "/name/nm0038339/"
        }
    ],
    "datePublished": "1992-07-18",
    "description": "The second Silent Mobius film that follows directly after the first film.",
    "director": [
        {
            "@type": "Person",
            "name": "Yasunori Ide",
            "url": "/name/nm0406842/"
        }
    ],
    "duration": "PT58M",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDgxN2JkMmMtMWQ4Ni00OTE1LWI0ZDUtNjcxMzRkYzk3N2NiXkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "female police officer,all girl team,police,predominantly female,anime animation",
    "name": "Sairento mebiusu 2",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2015-08-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0160869/"
        },
        "name": "Too much backstory in SILENT MOBIUS sequel",
        "reviewBody": "SILENT MOBIUS THE MOTION PICTURE 2 (1992) is a short (58-min.) follow-up to SILENT MOBIUS, the even shorter (53 min.) anime occult thriller based on Kia Asamiya's manga and released the previous year (and which I've also reviewed here). The focus of both films is Katsumi Liqueur, daughter of a powerful psychic who'd died in some kind of encounter with the demonic \"Lucifer Folk\" who are invading a post-catastrophic Tokyo (2028 A.D.) with only the paranormal warriors of the all-female AMP (Attacked Mystification Police) offering significant resistance. Katsumi is under the protective spell of her late father and is sitting on an untapped source of inner power that will definitely turn the tide of AMP's ongoing defense of Tokyo. The first film set up the facts of Katsumi's background and her parents' relationship to this whole mystical battlefront, with Katsumi's scenes with her mortally ill mother in the hospital offering a poignant layer to the proceedings. However, in this sequel, Katsumi resists the call of her destiny and wanders off on her own, defied at every turn in her attempts to leave Tokyo and get back to her home in Hawaii. She cries, she whines, she protests and even falls exhausted to the ground in the rain at one point. She even tosses away the talisman that guarantees her protection, making her vulnerable at one point to stepped-up attacks by the Lucifer Folk, seen in human form as an old man and young blond girl playing a form of psychic chess, but who emerge in full demonic form as monstrous, misshapen, asymmetrical creatures who speak in soft male voices. Through it all, the women of AMP struggle to guard and protect Katsumi and continue trying to persuade her to join them. Yuki, a young woman who befriends Katsumi and gives her a place to stay, also takes an increasingly proactive role in these efforts.\n\nNormally in anime of this type, all this would have been a build-up to an action finale where the heroine accepts her destiny, unleashes her power, and wreaks havoc on her demonic opponents, but the resolution here is abrupt and unsatisfying and clearly designed to set up a sequel or TV/video series that never materialized. It even says \"To be continued,\" in English, at the very end. There was a \"Silent Mobius\" TV series in 1998, six years later, but it was a complete reboot and not an actual sequel. So SILENT MOBIUS 2 seems strangely incomplete. Another half-hour wouldn't have hurt it. Nor would it have hurt to simply tell the whole story in a normal full-length animated feature, instead of two short films that don't quite succeed in making full dramatic use of the imaginative concepts introduced. (The first movie does, at least, offer much more occult battle action.) \n\nStill, I'm impressed with the design and animation style and general tone of the piece, all enhanced by the full-bodied orchestral score (by Kaoru Wada). There are scenes in this sequel that are quite evocative, as when Katsumi recalls dreams of the Rainbow Bridge over Tokyo Bay and then seeks to find the spot in reality that matches the angle she saw in her dream. (The bridge is now in ruins, evidently damaged during the unexplained catastrophe.) There's also a very moving scene where she finds the house she lived in with her mother as a girl and walks through dark, dusty halls with flashbacks to her childhood. However, the effectiveness of these scenes is undermined by Katsumi's continually tiresome behavior as she rejects all entreaties to step up to the plate and help in the fight. In the later TV series, Katsumi resists joining AMP for the first two episodes, but only because she wants more information about Lucifer Hawk (as the demonic entity is called in the TV series) and her father's connection to them before she signs on. By the end of episode 2, she's fully on board and ready for action in half the time it took in these two movies."
    },
    "url": "/title/tt0160869/"
}