{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred Astaire",
            "url": "/name/nm0000001/"
        },
        {
            "@type": "Person",
            "name": "Cyd Charisse",
            "url": "/name/nm0001998/"
        },
        {
            "@type": "Person",
            "name": "Janis Paige",
            "url": "/name/nm0656712/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4095,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Leonard Gershe",
            "url": "/name/nm0314826/"
        },
        {
            "@type": "Person",
            "name": "Leonard Spigelgass",
            "url": "/name/nm0818700/"
        },
        {
            "@type": "Person",
            "name": "Melchior Lengyel",
            "url": "/name/nm0501872/"
        }
    ],
    "datePublished": "1957-07-18",
    "description": "A Russian government official is sent to Paris to bring back her comrades; she soon gets a taste of Paris life and falls in love with an American movie producer.",
    "director": [
        {
            "@type": "Person",
            "name": "Rouben Mamoulian",
            "url": "/name/nm0541149/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Comedy",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWM2OGQ1YjQtMzRhNy00ZTM1LTk1OWItNTgxNTJjNTg5Y2M4XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
    "keywords": "remake,foreigner playing russian character,defector,film producer,paris france",
    "name": "Silk Stockings",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2015-06-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050972/"
        },
        "name": "An above decent musical remake of Ninotchka",
        "reviewBody": "Silk Stockings is not one of MGM's best films, with it just lacking their earlier films' sparkle, and it is not as good as Ninotchka(a Greta Garbo and Ernst Lubitsch gem), that it's a remake of. However, while it has its flaws, it is eminently watchable and is good entertainment.\n\nThe film is a handsome-looking film, especially in the sumptuous sets, though the colourful and expansive photography, not-too-bright-not-too-drab lighting and elegant costumes also delight. The music is energetic and whimsical and the songs, while not among Cole Porter's best(Ritz Rock and Roll is a little dull and tired) are very good, with memorable melodies and Porter's usual wit evident. All of You and Paris Loves Lovers are dreams come true for Fred Astaire and Cyd Charisse lovers, but the highlight is the enormously fun Stereophonic Sound, Siberia has some funny moments but not for all tastes. Choreographically Silk Stockings is splendid, but does not waste Astaire or Charisse's talents at all, the songs I mentioned as highlights are also the highlights for the choreography, and while Ritz Rock and Roll is tired song-wise Astaire's dancing certainly is not.\n\nAlso present are a very clever script, where most of the humour sparkles and the romantic parts have the right balance of sweetness and magic while not feeling too much, it also has a good deal of warmth chemistry-wise which stops it from feeling cold and underdeveloped. The film is warm-hearted, good-humoured and light-footed on the most part, and is competently directed, while the cast are as splendid as the choreography. Astaire is as charming and graceful as ever, and Charisse is glamour and elegance personified. Janis Paige is hilarious, and comes close to stealing the show in Stereophonic Sound, and Peter Lorre and Jules Munshin are amusing, though both have given better performances elsewhere.\n\nIt's not a flawless film though. It does get heavy-handed in places and occasionally over-plotted, the anti-Russian jokes may leave a sour taste in the mouth and as aforementioned the Ritz Rock and Roll lacks the energy and is not as memorable or up-to-tempo as the rest of the film.\n\nDespite the problems, Silk Songs is very watchable and fun and an above decent but inferior musical remake of Ninotchka. 7/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4636953",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGJjZjRlMWItYjM5Mi00Mjk2LTllZmQtNjA0NjVjNjAzMmE3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGJjZjRlMWItYjM5Mi00Mjk2LTllZmQtNjA0NjVjNjAzMmE3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-16T19:29:08.488Z",
        "url": "https://www.imdb.com/video/vi4636953/"
    },
    "url": "/title/tt0050972/"
}