{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Rekha",
            "url": "/name/nm0004334/"
        },
        {
            "@type": "Person",
            "name": "Jaya Bachchan",
            "url": "/name/nm0080149/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2958,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0077190/"
        },
        {
            "@type": "Person",
            "name": "Mrs. Preeti Bedi",
            "url": "/name/nm1768254/"
        },
        {
            "@type": "Person",
            "name": "Yash Chopra",
            "url": "/name/nm0007181/"
        },
        {
            "@type": "Person",
            "name": "Sagar Sarhadi",
            "url": "/name/nm0765166/"
        }
    ],
    "datePublished": "1981-08-14",
    "description": "SILSILA is a love story, thwarted by society's demands, which reappears as adultery but can it survive in the face of society?",
    "director": [
        {
            "@type": "Person",
            "name": "Yash Chopra",
            "url": "/name/nm0007181/"
        }
    ],
    "duration": "PT3H2M",
    "genre": [
        "Drama",
        "Family",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmYxY2Y2NDgtNzhiYy00MmM3LTk0ZmQtZDE1YzVkMDEzZDY1XkEyXkFqcGdeQXVyNTkzNDQ4ODc@._V1_.jpg",
    "keywords": "writer,adultery,heartbreak,rescue,airplane crash",
    "name": "Silsila",
    "original_info": {
        "id": "Silsila_1981",
        "name": "Silsila",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Peter_Young"
        },
        "dateCreated": "2010-04-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083081/"
        },
        "name": "The long chain of marriage, relationships and affairs",
        "reviewBody": "After the death of his elder brother, Amit finds out that his late brother's fiancée, Shobha, is pregnant. Taking pity on the devastated young woman, he decides to marry her, leaving behind the love of his life, Chandni. Chandni later marries a famous doctor. An accident during which Shobha loses her child and is taken care of by Chandni's husband, causes Amit and Chandni to meet again. There begins a new extramarital relationship between the two, through which the story deepens and grows.\n\nThis is Silsila, Yash Chopra's take on relationships and adultery in a modern 80s India. A romantic drama, it is quiet, serious and focused, and is shot beautifully like every other movie made by Chopra. What I particularly appreciated about this film was the matter-of-factness with which it was made and executed. There was not any overdone melodrama, no unnecessary subplots, and the writing did not go overboard. The story is simple to follow, the script and the characters are very well written, and the film is generally subtly made.\n\nChopra's portrayal of relationships is very well done. The dialogues are excellent. At times some proceedings were difficult to relate to or identify with, but who knows, maybe one should really be in a particular situation to understand its meaning and its effect on people at times of pressure. This is the reason I believed the story. Leaving the seriousness aside, as a film, Silsila is simply entertaining. It flows well, it is interesting, and is aided by several melodious and memorable songs composed by Shiv-Hari.\n\nRumour had it that Silsila was based on the true triangular story of Amitabh-Jaya-Rekha. Jaya Bhaduri is Bachchan's real-life wife and Rekha was rumoured to have been involved with him back then in an extramarital affair. This adds to the film's authenticity, but more than anything, the acting is natural to make it work the way it did. Bachchan is as great as always. Jaya Bhaduri is brilliant as his intelligent, sensible and smart wife Shobha, and displays her character's fear, strength and determination with great depth and conviction and as naturally as ever. Rekha gets less scope, yet she is wonderful in her restrained portrayal of Chandni. She is extremely beautiful and acts with grace.\n\nSilsila has some other limited appearances by Shashi Kapoor and Sanjeev Kumar, the former being fine and the latter being exceptional. The main complaint with the film was its ending, but I quite liked it. The viewers must have been torn between two probable versions. The reason behind Amit's decision was a bit unjustifiable, but anyway, this is one of the better and more interesting works of Yash Chopra. It is well written, directed and acted. I recommend.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3746346777",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTAxMjk4MjUyNjdeQTJeQWpwZ15BbWU4MDIwNDQ4Nzkx._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTAxMjk4MjUyNjdeQTJeQWpwZ15BbWU4MDIwNDQ4Nzkx._V1_.jpg",
        "uploadDate": "2016-08-20T07:32:26Z",
        "url": "https://www.imdb.com/video/vi3746346777/"
    },
    "url": "/title/tt0083081/"
}