{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liane Bonin",
            "url": "/name/nm0094670/"
        },
        {
            "@type": "Person",
            "name": "Tom Joslin",
            "url": "/name/nm0430867/"
        },
        {
            "@type": "Person",
            "name": "Mark Massi",
            "url": "/name/nm0557371/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 506,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "description": "A documentary about two gay men as they live through their last months of life with AIDS.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Friedman",
            "url": "/name/nm0295335/"
        },
        {
            "@type": "Person",
            "name": "Tom Joslin",
            "url": "/name/nm0430867/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIyMDkyMDgyNl5BMl5BanBnXkFtZTcwODY0MzgxMQ@@._V1_.jpg",
    "keywords": "loss of lover,hiv,human immunodeficiency virus positive,gay interest,independent film",
    "name": "Silverlake Life: The View from Here",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "klc-16"
        },
        "dateCreated": "2009-12-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0108138/"
        },
        "name": "The saddest thing about this film",
        "reviewBody": "The saddest thing about this film is that only 8 people cared to leave a review of it and NO-ONE felt it worthwhile leaving a comment on the message boards.\n\nMade the same year as Philadelphia...the Tom Hanks Oscar-winner... this is the film that people REALLY should have seen and given awards to. There is more humanity, life, love, tenderness and beauty in these two people than in just about any other gay film I have seen... and it is all true.\n\nIn order for this to be printed I need to leave a few more lines of text: suffice it to say that anyone who REALLY wants to know what it was like to be gay in the 60's and 70's, and to understand just what AIDS was like before the modern drug \"cocktails\" allowed people to breathe a little easier... this is the film to see. \n\nOh, and I will add a personal comment about AIDS. Despite everything, there actually has been a silver lining to all the horror. When AIDS first arrived, it was called the \"gay cancer\", and governments preferred to \"let them die\" rather than spend a red cent on research to help save a bunch of fags. Then it became clear that AIDS would also be a heterosexual disease. But the government wasn't ready for that; So when straight people began getting ill too, the only organizations and associations that were available to them were those which had been set up by gays themselves (examples: The Names Project: the quilt memorializing all those who died of AIDS; Act Up etc) The result is that people who probably would never have come in contact with gays in their ordinary lives suddenly found themselves counting on them and needing them, because no other organizations existed. This close contact, in my estimation, is what finally broke down the barriers of prejudice and allowed the straight world to finally accept gays as equals. When AIDS first came on the scene, many of us thought that the straight world would use it as a way to come down even harder on us... and that probably would have been true if straights didn't suddenly become ill too; nevertheless, the strides that have been made in gay liberation - to the point that, as I write this, there are at least 5 countries in the world that accept gay marriage - these gains would probably have taken a lot longer without AIDS to bring us together. It is sad to think that all those people - both straight and gay - had to die before our common humanity became more obvious - but if what I am writing here is true, and I think it is - then there is a bit of comfort to be taken in realizing that all those people did not die in vain.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0108138/"
}