{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nick Nolte",
            "url": "/name/nm0000560/"
        },
        {
            "@type": "Person",
            "name": "Jeff Bridges",
            "url": "/name/nm0000313/"
        },
        {
            "@type": "Person",
            "name": "Sharon Stone",
            "url": "/name/nm0000232/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3661,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093471/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010090/"
        },
        {
            "@type": "Person",
            "name": "Sam Shepard",
            "url": "/name/nm0001731/"
        },
        {
            "@type": "Person",
            "name": "Matthew Warchus",
            "url": "/name/nm0911334/"
        },
        {
            "@type": "Person",
            "name": "David Nicholls",
            "url": "/name/nm0390141/"
        }
    ],
    "datePublished": "2000-02-04",
    "description": "After scams at horse races and making lots of money, 3 young people split. 20 years later, one of them, a drunk, creates chaos with photos from back then.",
    "director": [
        {
            "@type": "Person",
            "name": "Matthew Warchus",
            "url": "/name/nm0911334/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzE5YjQ0MjItOTNhMS00NTliLWJjYmEtMTE1NTExNjRlZjRjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "kentucky,blackmail,scam,woman smoker,volkswagen beetle",
    "name": "Simpatico",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Silverzero"
        },
        "dateCreated": "2003-06-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0174204/"
        },
        "name": "Glassy, enigmatic but occasionally puzzling drama.",
        "reviewBody": "When 5 past Oscar nominees headline a movie, naturally, one would have rather high expectations. Such is the case with `Simpatico' a high-profile drama which went by relatively un-noticed when it was released 3 or 4 years ago. But I am surprised that it only received a 4.4 rating on the IMDb. I'm not saying that the film was a classic or deserved enormous critical plaudits, but I definitely think that it deserved more than that. It is an adaptation of the stage play written by Sam Shepard. While it starts out promising, it is also surprisingly bland when it reaches the conclusion.\n\n But the main problem is the lack of simple definition. It's hard to tell if this is a simple story, or a more complex one. It's unclear whether this is a film about friends reconciling or friends being torn apart by guilt. The film tries going both ways, but the result is a puzzling one to say the least. One thing that it avoids doing is falling into plot-holes, becoming predictable or using average movie clichés. This is done by creating thoroughly flawed but also very compelling characters that certainly aren't your average stereotypes. And they are lifted off paper by exceptional performances from the three Oscar nominated lead players.\n\n Nick Nolte (Affliction, The Prince of Tides) gives yet another top-notch performance as the untrustworthy hobo. Jeff Bridges (The Last Picture Show, The Contender) is also very good as his polar opposite- the eccentric millionaire. About two-thirds the way through the movie, the two main character switch places for no apparent reason. It doesn't make logical sense why a millionaire would choose to live like a bum, just because someone stole his wallet. Both actors are better and more believable in their opening personas.\n\nSharon Stone (Casino) makes her first appearance in the movie at about the halfway mark. It's a shame she didn't appear earlier, because it's surprising how convincing she is as the rich and wrecked housewife. She's so far away from the icy sex-goddess of `Basic Instinct' it's hard to believe that this is the same actress. Albert Finney (Tom Jones, Erin Brockovich) makes great support, but Catherine Keener (Being John Malkovich) gives the blandest and most over-rated performance. Not only is her part boring and un-necessary, but she even over-acts in certain scenes.\n\n Unfortunately, there are some evident flaws scattered around here and there. The `big twist' is uninteresting and it's ironic that Sharon Stone and Jeff Bridges are never on the screen at the same time- After all, their characters are supposed to be husband and wife! But the brilliant acting alone makes `Simpatico' qualify as a good if un-remarkable movie. The script is below average and sometimes the movie ventures into blandness, but most other aspects are good as expected. My IMDb rating: 6.1/10."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Fine Line",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2659385625",
        "name": "Simpatico",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2JiYTA1MjItM2ZkNS00NTFhLWJiNjYtN2FhNjhmOWY3NDcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2JiYTA1MjItM2ZkNS00NTFhLWJiNjYtN2FhNjhmOWY3NDcxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:51:38Z",
        "url": "https://www.imdb.com/video/vi2659385625/"
    },
    "url": "/title/tt0174204/"
}