{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mickey Rourke",
            "url": "/name/nm0000620/"
        },
        {
            "@type": "Person",
            "name": "Clive Owen",
            "url": "/name/nm0654110/"
        },
        {
            "@type": "Person",
            "name": "Bruce Willis",
            "url": "/name/nm0000246/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 776327,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035848/"
        },
        {
            "@type": "Person",
            "name": "Frank Miller",
            "url": "/name/nm0588340/"
        },
        {
            "@type": "Person",
            "name": "Robert Rodriguez",
            "url": "/name/nm0001675/"
        }
    ],
    "datePublished": "2005-04-01",
    "description": "An exploration of the dark and miserable Basin City and three of its residents, all of whom are caught up in violent corruption.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Miller",
            "url": "/name/nm0588340/"
        },
        {
            "@type": "Person",
            "name": "Quentin Tarantino",
            "url": "/name/nm0000233/"
        },
        {
            "@type": "Person",
            "name": "Robert Rodriguez",
            "url": "/name/nm0001675/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODZmYjMwNzEtNzVhNC00ZTRmLTk2M2UtNzE1MTQ2ZDAxNjc2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "neo noir,based on graphic novel,corruption,dark horse comics,night",
    "name": "Sin City",
    "original_info": {
        "id": "Sin City_2005",
        "name": "Sin City",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KissEnglishPasto"
        },
        "dateCreated": "2016-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0401792/"
        },
        "name": "SIN CITY-Would Be a SIN NOT to Experience this New SINematic Language",
        "reviewBody": "From PASTO, COLOMBIA-Via: L. A. CA; CALI, COLOMBIA+ORLANDO, FL -------------------The ONLY Tony KIss Castillo on FaceBook!---------------\n\nPerhaps the biggest dream of many moviegoers would be to go a movie with an expectation so astronomically high that it would be nothing short of a miracle to reach it....and then, low and behold, surpass it! Thank God for SIN CITY. A round-trip ticket to cinematic hell!\n\nWithout a doubt, Robert Rodriguez (El Mariachi, Once Upon a Time in Mexico, Spy Kids I, 2 & 3) along with authors Frank Miller and Quentin Tarantino have created the highest impact visual experience in Cinema since The (Original) MATRIX! Part Video Game, Part Comic Strip, Part Cinematic Nightmare, (and unlike MATRIX, which really only had a handful of scenes introducing its Revolutionary 360 Degree characteristic \"Bullet-Time\" panoramic shots in slow motion) SIN CITY, from its opening credits to its last on screen seconds, speaks a new, intensely original cinematic language, which will keep you profoundly hypnotized for every second of its two hour duration!\n\nBruce Willis, Benecio Del Toro (The Usual Suspects, Traffic, 21 Grams), Elijah Wood (The Lord of the Rings trilogy, Eternal Sunshine of the Spotless Mind), Rosario Dawson (Men In Black II, Alexander), Jessica Alba (Never Been Kissed, Dark Angel), Michael Clarke Duncan (The Green Mile, The Scorpion King), Brittany Murphy (8 Mile, Little Black Book), Mickey Rourke (Man on Fire, Once Upon a Time In Mexico), Nick Stahl (In The Bedroom, Terminator 3) Clive Owen (King Arthur, Closer, The Bourne Identity) and Josh Hartnett (Pearl Harbor, Blackhawk Down, Wicker Park), among many others, seem to present us with \"the Mother of All CASTS!\"\n\nWith such an awesomely impressive cast, I imagine that many of the actors involved agreed beforehand to receive, instead of a lump sum payment before filminga small percentage of the box office after release and distribution. If this is true, they will make out like bandits, because SIN CITY shows up as one of the 15 or 20 highest grossing films of 2005! And if you saw a lot of Latin/Hispanic names in the above list, you are quite right.... Latinos abound in SIN CITY!\n\nNow, back to focusing on another chilling aspect of this amazing film..The TOTAL Metamorphosis of a good part of its cast. It is as if they had been transformed by a some sort of digital spell and assimilated whole onto the screen, and thusly, surpassing and supplanting the real for the surreal! So much so that I stayed a few extra minutes, at the end of the film, to analyze carefully the credits, because, and there is absolutely NO exaggeration in this comment, several actors were simply TOTALLY UNRECOGNIZABLE!\n\nBut as nothing is perfect in this life, SIN CITY does have its very dark side. Generally, I hate violent movies. Unfortunately, SIN CITY sins, and SINS BIG in this area! Even, it is a relentless orgy of gruesomely violent scenes. I feel quite upset with myself for having enjoyed SIN so much!!! The only excuse I can think of say is that perhaps precisely for its video game- like feel and quality, its resemblance to a digital cartoon, that it provided me the reaction it did! (Seemingly, it had the same effect on 90% of the audience)\n\nAnyway, the above is still a little unsettling. It left a bit of a bizarre after-taste!! Also, I must confess that perhaps, at least in the case of SIN CITY, my fervor and passion for Everything Original certainly exceeded my aversion to violence in cinema ....One final note: SIN CITY, of course, is absolutely no place for kids!!!\n\n10********** ENJOY!/DISFRUTELA!\n\nAny Comments, Observations or Questions are MOST WELCOME!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi667983385",
        "name": "Sin City",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjQ1YmQ4ZjItZWMyZS00YjUwLTgxYmUtODNhYmIwZWNjYzY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjQ1YmQ4ZjItZWMyZS00YjUwLTgxYmUtODNhYmIwZWNjYzY1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:46:07Z",
        "url": "https://www.imdb.com/video/vi667983385/"
    },
    "url": "/title/tt0401792/"
}