{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Monica Rial",
            "url": "/name/nm0722676/"
        },
        {
            "@type": "Person",
            "name": "Greg Ayres",
            "url": "/name/nm1364905/"
        },
        {
            "@type": "Person",
            "name": "Hilary Haag",
            "url": "/name/nm0351758/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 57,
        "ratingValue": 5,
        "worstRating": 1
    },
    "alternateName": "Sister Princess",
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0171363/"
        }
    ],
    "datePublished": "2001-04-04",
    "description": "An ordinary young man is made to live with twelve lovable little sisters, each with their own distinct quirks and personalities.",
    "genre": [
        "Animation",
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTEwOTBlMmQtZTM5OS00Njc3LWEzMWYtMDEyOGQ5NmY5YWMwXkEyXkFqcGdeQXVyOTA0MzY4MjY@._V1_.jpg",
    "keywords": "anime animation",
    "name": "Shisutâ purinsesu",
    "original_info": {
        "id": "Sister Princess_2004",
        "name": "Sister Princess",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dave13-1"
        },
        "dateCreated": "2012-04-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1179815/"
        },
        "name": "Cute show - almost a bit too cute, and not very original",
        "reviewBody": "Wataru finds himself starting high school on a strange island off the coast of Japan. Plus, he is sharing a big house with a dozen cute girls, making this sort of the ultimate 'harem' scenario - take note Tenchi fans. In a twist, however, it turns out that all of the girls - ranging from middle teens down to kindergarten age - are sisters he never knew he had because they all lived abroad and separately. This raises a disturbing picture of parental neglect, not to mention runaway fecundity, but this is a comedy. We are supposed to accept the premise no matter how outrageous. Now, he finds himself having to play reluctant 'big brother' every moment to a large cast of near-strangers. \n\nThe girls are all broadly drawn stereotypes - a skateboarding tomboy, a goth girl who reads tarot etc. but this is to be expected any time 12 new characters are introduced all at once. Having set up the premise in the first two episodes, we now get to take a closer look at the sisters individually as each one features in her own episode and faces a crisis of some sort - for instance the sickly anemic sister gets a fever, which gives the household a scare. Everything requires help from 'big brother' and they grow closer and understand each other better as a result. Aww. The light tone and the appealing look of the setting / background art and the character art make the show watchable, but be warned that nothing much happens. The comedy is also pretty familiar stuff - one girl experiments with food that is always too spicy, another has a huge dog that gets mistaken for a wolf - and, indeed, the whole exercise has a hand me down quality, made up from recognizable elements from earlier shows. The cuteness of the female characters is supposed to charm but it can get cloying after a while. The overall quality is above average, but only just, and while it should appeal to anime-manga completists, fans looking for something fresh and new may be disappointed.\n\nTo be fair, the middle episodes get a bit more interesting, such as when summer comes and Wataru promises his sisters that he will finally learn to swim and take them on a vacation. His tomboy skateboarding sister takes over his swimming instruction and his mechanical wizard sister sets about building a boat! The show continues to be rather slow moving and with the emphasis clearly on girlish cuteness, it can still get a bit cloying. But with more going on plot-wise by this point and with a few of the characters having had feature stories by now, there is a bit more story and character interest.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt1179815/"
}