{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul La Greca",
            "url": "/name/nm0478629/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 272,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0092622/"
        }
    ],
    "description": "In this emotionally compelling documentary, Sister Helen opens a private home for recovering addicts and alcoholics in the South Bronx after the death of her husband and two sons.",
    "director": [
        {
            "@type": "Person",
            "name": "Rebecca Cammisa",
            "url": "/name/nm1095640/"
        },
        {
            "@type": "Person",
            "name": "Rob Fruchtman",
            "url": "/name/nm0296638/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyNjQ4NzQ0OF5BMl5BanBnXkFtZTcwMjY1MzcyMQ@@._V1_.jpg",
    "keywords": "rehab,alcoholism,drug addiction,two word title,plain clothes nun",
    "name": "Sister Helen",
    "original_info": {
        "id": "Sister Helen_2002",
        "name": "Sister Helen",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tanga4"
        },
        "dateCreated": "2007-09-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0303394/"
        },
        "name": "Sister Helen Changed Clothes, But She is Still the Old Helen",
        "reviewBody": "\"Sister Helen\" is a superb documentary about a rigid, intolerant, foul mouthed, bitter, oblate (civilian) nun who runs a shelter for drunks and dopers in a very rundown neighborhood in the south Bronx. All but one of the 21 residents are gutter drunks/addicts. Robert, the only middle class representative  he had a real job, house, and even a BMW  regrets she died before he could tell her off. Why? \n\nRobert, like six of the residents, was on parole. He complained that Helen wielded a huge stick over him and constantly threatened to turn him in if he didn't cow-tow to her. In an \"extras\" interview he said Helen ran the center to compensate for the deaths of the three men in her life  her husband and her two boys. \n\nThe husband was an alcoholic who died of a heart attack at 55. One boy died of a heroin overdose and the other was stabbed to death at 15. Helen was left with one daughter, who she abandoned to run the center. The daughter was not pleased. She wanted her mom\n\nWhat's fascinating is how little Helen changed. Outwardly it seems she made a huge sea change. But after seeing this riveting and disturbing video a few times -- once with the directors narrating -- it became clear that Helen substituted 21 male addicts to boss around to replace her three dead males. \n\nHelen admits she ignored her kids and spent every day in bars. But her bossiness, intolerance, and sharp tongue didn't emerge at age 56. Living with her must have been extremely difficult. Even Robert says he stayed clean in spite of Helen. \n\nThe film opens with Helen abusively demeaning a man who wants to live at the shelter. Supposedly she is showing off her street savvy. Another time she publicly demeans Mel, her \"assistant\" for not bathing for a year. Then she waves his filthy pillowcase in the air. The film is viscous with Helen threatening and demeaning people. Her signature song is \"My Way.\" Her favorite phrase is, \"I'm going to be totally honest with you.\" Often, people who use such phrases, turn out o be the opposite. \n\nThe residents are really down and out. Only Robert has any marketable skills beyond pushing a broom. They all desperately need a roof over their heads, and Helen, since she runs the place on her own, has the power to admit or evict whoever she pleases. She has no governing board to answer to and gets no public funding. It is her show. \n\nHelen believes in the cookie approach to sobriety. She stopped drinking cold turkey and that means everyone else can too. She blames substance abuse on the drug or booze, and not the underlying issues that drove the men to drink and drug. She's no therapist, just a landlady who dyes her hair, wears a habit, and wields complete power over her tenants, and stopped drinking. \n\nHelen also lords it over her inmates by demanding urine (ureen she calls it) tests on requests. Twice Major, a very solid and respected long term older resident -- who she trusted -- failed his tests. Helen was furious and evicted him. Major stood his ground and said the results were wrong because he never did heroin. Helen didn't yield and failed to consider a mistake could have been made. This was especially troubling since she knew Major for a long time. Yet she discounted her relationship with him, assumed he was a liar, and relied completely on the results. Major eventually discovered the codeine in his cough syrup showed up as an opiate. Helen never apologized publicly, but supposedly made up with major privately.\n\nHelen also had a very tainted reputation in her old neighborhood. She tacitly admitted to Robert she once stayed up very late one night to slash someone's tires. The person wronged her and certainly deserved to have his/her tires slashed. She was not a nice woman. So eventually, she decided the only way to keep the Travis name (her last name) alive  since the three male Travises died  was to start the Travis Center.\n\nFor some of the residents it was a great deal. They complied with Helen and in exchange received a cheap, safe, sober, and structured place to live. One however, said he preferred jail. Addicts and drunks don't all need to be treated like children. Helen employed \"old school\" techniques which have been discredited. However, no one was forced to remain at the center and for some, it was definitely a positive experience. The Travis Center is not a treatment center. It is a residence for alcoholics and dopers who what to straighten out their lives. \n\nTo receive the full Sister Helen experience, see all the extra interviews plus the audio version in which the two directors share their experiences living with Sister Helen and her guests.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0303394/"
}