{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julie Walters",
            "url": "/name/nm0910278/"
        },
        {
            "@type": "Person",
            "name": "Joely Richardson",
            "url": "/name/nm0000613/"
        },
        {
            "@type": "Person",
            "name": "Jodhi May",
            "url": "/name/nm0562003/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3495,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019383/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000063/"
        },
        {
            "@type": "Person",
            "name": "Wendy Kesselman",
            "url": "/name/nm0450277/"
        }
    ],
    "datePublished": "1995-07-14",
    "description": "Two sisters separated in childhood reunite years later as servants at a household in France. Their happiness to be reunited spirals into an incestuous relationship.",
    "director": [
        {
            "@type": "Person",
            "name": "Nancy Meckler",
            "url": "/name/nm0575361/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIzNTYzMzY5MV5BMl5BanBnXkFtZTcwMDA1MzUyMQ@@._V1_.jpg",
    "keywords": "maid,lesbian incest,sister sister incest,incest,based on true story",
    "name": "Sister My Sister",
    "original_info": {
        "id": "Sister My Sister_1994",
        "name": "Sister My Sister",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gradyharp"
        },
        "dateCreated": "2005-09-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111205/"
        },
        "name": "A Claustrophobic French Household Contains Dark Deeds",
        "reviewBody": "There is a major player in this extremely fine film who goes all but unmentioned: the work of cinematographer Ashley Rowe is some of the finest on film, creating an atmosphere solely within the confines of a home made dark by lack of light and by brooding madness and murder. The effect achieved is nothing short of miraculous and further adds to the importance of this under-rated movie.\n\nBased on the infamous Papin sisters' murder of their employer and daughter in 1932 in France, SISTER MY SISTER is based on a play by Wendy Kesselman (who also wrote the mesmerizing screenplay) and is directed by the imaginatively fine Nancy Meckler. Two sisters - Christine the eldest (Joely Richardson) and Lea (Jodhi May) are shown during the titles in black and white as poor orphans separated to different ends. As the film begins Christine has introduced her estranged beloved Lea to her employer, the rigid and strange Madame Danzard (Julie Walters) and her wallflower daughter Isabelle (Sophie Thursfield). Lea is hired by the penny pinching Madame Danzard and the two sisters co-serve as maids to the household. Christine and Lea view each other as not only sisters but as lovers and it is this latter role that leads Madame Danzard (spying contemptibly on the girls) that is the final straw in Madame's mistreatment of the girls that leads to the rather shocking murder of both Madame Danzard and Isabelle. We know from the start - both from the infamous case and from the opening sequences where the blood of the deed is seen along the stairwell - what the ending will be: it is the progress to that end that concerns the film.\n\nEach of the actresses is brilliant in their roles, roles that are far cries from the usual types that each actress has played. Julie Walters manages to ooze vitriol while moments later being oddly comedic in her la-la land of dancing to her Victrola. Joely Richardson is terrifyingly strange and Jodhi May says more with her facial expressions than legions of actors do with complex scripts. But again the physical ominous presence of the house of bad things is so magnificently created by Rowe's creative photography that is becomes of equal importance as a character. The musical score by Stephen Warbeck works solidly to convey the descent into madness of the two sisters. A brilliant tour de force for all concerned and highly recommended for those who love fine acting and dark thrillers. Grady Harp",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Two sisters are reunited when they are hired as maids for a stern widow and her daughter. Tension turns to violence when the widow discovers the taboo sexual attraction between them.",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi332710681",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTQyNTNkN2EtN2M5YS00NWFmLTk2NmMtOTQwZWQwOTViYjdkXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTQyNTNkN2EtN2M5YS00NWFmLTk2NmMtOTQwZWQwOTViYjdkXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-25T15:44:30.542Z",
        "url": "https://www.imdb.com/video/vi332710681/"
    },
    "url": "/title/tt0111205/"
}