{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Wendy Beckett",
            "url": "/name/nm0065728/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 30,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074366/"
        }
    ],
    "description": "The British nun and art historian visits works at several of the United States' finest museums.",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ0NjMyODUxMl5BMl5BanBnXkFtZTcwMzE2NjcyMQ@@._V1_.jpg",
    "keywords": "art",
    "name": "Sister Wendy's American Collection",
    "original_info": {
        "id": "Sister Wendy's American Collection_2001",
        "name": "Sister Wendy's American Collection",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "griffinfinity"
        },
        "dateCreated": "2009-07-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0306072/"
        },
        "name": "The real masterpiece is Sister Wendy...",
        "reviewBody": "Before getting this installment of the series, I watched another one on paintings. I was puzzled as to why Sister Wendy touched on so few works. A review I saw stated \" There were just too few paintings. How is it that Sister Wendy could leave so many well-known and important works out of her documentaries?\" The answer came to me while watching this segment of the series \"The Art Institute of Chicago, and The Cleveland Museum of Art.\" Sister Wendy Becket's knowledge of art is astounding. She appears to float through the galleries, as if the floors were clouds. She feels at home with paintings, but can talk your ear off about ceramics. She knows the old masters, as well as the new ones from the last century. I could not help but feel that she loves art and perhaps, may live vicariously through it. The vast palette of colors artists spread as opposed to the monotony of black and white clothing every day. The restraints of her world yet the freedom, expression and possibility of the world of art she explores.\n\nSister Wendy enjoys the study of art. I believe there is only one thing she likes better outside of her commitments to God, and that is showing people how to appreciate art! This is the key to unlocking the meaning! As I was watching her at the Art Institute of Chicago, it became clear that it was not all about the artist and the piece on display. That means quite a bit or the piece would not be there. Rather, it is so interesting to unlock the secrets of a particular piece through observation and perhaps, researching the era in which the piece was done. These are some of the lesson learned from this incredible individual.\n\nLet us examine a prime example of this. At the Cleveland Museum of Art, Sister Wendy discusses a painting by Frederic Church named ' Twilight in the Wilderness' that was done in 1860. It shows a valley with a lake. It is American landscape. Sister Wendy, through her knowledge of history, and art, examines the symbolism within. This lays the astonishing groundwork for her interpretation.\n\nShe begins by mentioning that there is an eagle perched on a branch to the left. She swiftly states that some people like to acknowledge this and it's meaning as an American eagle. In addition, the crossed twigs by the water and perhaps, the spiritual relevance to the viewer. She then mentions a few other observations. However, the she delves deeper. Moreover, I am paying attention, learning and aware of it! Sister Wendy notes \"that menace in the skies and the boiling, blood red tide tides of water.\" Then, in a tone of resignation states that the Civil War was coming and the scene would soon be experienced across the country. Brilliant. Imagine the awareness level while browsing the galleries. It gets better. She turns to the painting next to it. As it turns out, this is a work by one of Church's contemporaries. It too, is an American landscape. The setting is similar to the prior piece, but the sun is streaming down from the heavens and lights the trees as if a new day has begun. Yes, Sister Wendy reveals that it was done in 1866, and the war had ended.\n\nHad I passed through that gallery, I assuredly would have missed the significance. I may have glanced, tilted my head, and then moved on. That will not happen on subsequent visits. I work at an art museum, and feel as though I have learned about art. Through watching Sister Wendy, I admit that there is so much more to learn. So much more to see, and thanks to her, I have a clear idea of where to look. Thank you Sister Wendy, for helping a blind man to see again.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0306072/"
}