{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Évelyne Dandry",
            "url": "/name/nm0199281/"
        },
        {
            "@type": "Person",
            "name": "François Marthouret",
            "url": "/name/nm0551761/"
        },
        {
            "@type": "Person",
            "name": "Marina de Van",
            "url": "/name/nm0888418/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5402,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037192/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047476/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Person",
            "name": "François Ozon",
            "url": "/name/nm0654830/"
        }
    ],
    "datePublished": "1998-05-27",
    "description": "The adventures of an upper-class suburban family abruptly confronted with the younger brother's discovery of his homosexuality, the elder sister's suicide attempt and how much do you want-masochist tendencies, and the intrusion of...",
    "director": [
        {
            "@type": "Person",
            "name": "François Ozon",
            "url": "/name/nm0654830/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTZlNGRjOTUtNzBmNC00ZTUzLThmMjktODU3MmVlOGZkYTNiXkEyXkFqcGdeQXVyMTMwMDA2NjUx._V1_.jpg",
    "keywords": "coming out,homosexual,rat,suicide attempt,gay",
    "name": "Sitcom",
    "original_info": {
        "id": "Sitcom_1998",
        "name": "Sitcom",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Void"
        },
        "dateCreated": "2005-03-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0157044/"
        },
        "name": "In a word: brilliant",
        "reviewBody": "François Ozon's pitch black mickey take is a biting satire on family life and a brash distraction from the shows of it's title. While many sitcom's are monotonous affairs, Ozon's take on the medium is anything but. Despite taking in many of the clichés of the sitcom - stuffy mother, raunchy maid, bored father etc - Sitcom manages to be continually inventive and the way that it exposes the clichés of the genre is both ludicrously ridiculous and harshly disturbing. The French director proves with this movie that he's not afraid to overstep several boundaries and make a film that dares to be different, and for that reason this film will never be universally liked. However, if you can connect with Ozon's vision, you're in for a treat and that was the situation I found myself in! The story follows a father who, after bringing his family a lab-rat for a present, finds his family collapsing around him - his son discovers he's gay, his daughter jumps out of the window and his wife...well, I'll leave you to find that out on your own.\n\nSitcom is a singularly unpleasant experience. Watching family life deteriorate is a much more gruelling affair than you might imagine, and even though the family and the situation that Ozon has presented are utterly ridiculous; he still manages to inject life into it, which ensures that it hammers home the point that the auteur intended. Whenever I see a film that dares to be different and deliver something that I haven't seen before, I tend to find myself heaping the praise on it and that is certainly the case with this film. You will not find a comedy with a more rotten core than this one and similarly you will not find one that dares to present the utterly ridiculous happenings that this movie thrives on. I don't know how Ozon thought he could get away with some of the things in this film - not just the taboo's he's portrayed, but other things too, some of which are just too stupid to comprehend  but Ozon makes them work! Sitcom is a movie that needs to be experienced, and it's a film that will divide opinions as much as any other movie ever made. And if only for that reason - see this film as soon as possible.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0157044/"
}