{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Krause",
            "url": "/name/nm0470244/"
        },
        {
            "@type": "Person",
            "name": "Michael C. Hall",
            "url": "/name/nm0355910/"
        },
        {
            "@type": "Person",
            "name": "Frances Conroy",
            "url": "/name/nm0175814/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 137913,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010714/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030266/"
        },
        {
            "@type": "Person",
            "name": "Alan Ball",
            "url": "/name/nm0050332/"
        }
    ],
    "datePublished": "2001-06-03",
    "description": "A chronicle of the lives of a dysfunctional family who run an independent funeral home in Los Angeles.",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2FmMjg0Y2YtYmMyYi00MTBjLTllYzMtN2VjYzRhOTVmNWRlXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_.jpg",
    "keywords": "funeral home,daydream,talking to the dead,husband wife relationship,boyfriend girlfriend relationship",
    "name": "Six Feet Under",
    "original_info": {
        "id": "Six Feet Under: Season 2_2001",
        "name": "Six Feet Under: Season 2",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "morphion2"
        },
        "dateCreated": "2005-11-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0248654/"
        },
        "name": "The Complete First Season Review - Superb",
        "reviewBody": "Screenwriter Alan Ball is most well-known for his 1999 film debut American Beauty (directed by another first-timer, England's Sam Mendes). His first work was a stunning success, captivating audiences all over the world and winning five Academy Awards. In 2001, the pilot for Ball's first television series Six Feet Under aired. While being considerably darker than audiences might have expected, the series soon found its fan base and secured a place in the list of all time greats.\n\nThe show revolves around the Fishers, a rather isolated and dysfunctional family who run their own independent funeral home, and whose eldest son Nate (Peter Krause) is reunited with them in the wake of his father's untimely death. Once he is home, Nate learns that he has inherited the family business with his gay brother David (Michael C. Hall) and he has to learn how to again become a part of this bizarre family. Meanwhile, David, we learn, is struggling to reconcile his homosexuality with his home-taught Christian values, while his younger sister Claire (Lauren Ambrose) is forced to battle the hell of adolescence and the children's mother Ruth (Frances Conroy), a deeply devoted mother and wife, has to learn to face life without her husband. The complete first season sees the growth of the Fisher family as they slowly begin to disband their isolation and seek comfort, support and love from one another in the face of hardships and tragedy.\n\nSix Feet Under is what every show should strive to be  it is intelligent, witty, sincere, realistic and completely unashamed to show the dark, painful side of life, without being depressing or nihilistic. It deals with an unfathomable amount of very significant issues, but on such a personal and relatable level that it doesn't even begin to feel preachy or self-important. It explores society's position on gays, women, young people, the elderly, the mentally ill and looks very openly at religion and death. A series of this standard is a surprise even from the production company that brought us Angels in America and The Sopranos.\n\nOne of the most fundamental principles for engaging an audience is to present engaging characters. Six Feet Under is a prime example: each character we're introduced to does take some getting used to, but all are wonderfully rich and complex and three-dimensional, balanced nicely by each other. Not only the Fishers but all their friends, acquaintances and lovers are well-developed, highly-involved and important to the show in its many layers. Nate's girlfriend Brenda (Rachael Griffiths) and her manic-depressive brother Billy (Jeremy Sisto), David's boyfriend Keith (Mathew St. Patrick) and the Fishers' Puerto Rican employee Rico (Freddy Rodriguez) are all fantastic characters that do far more than just complement the show's funeral home family.\n\nAlan Ball is a truly gifted writer and an even more amazing artist; his ability to create such a delightfully unique environment and then to build on that environment to such incredible heights is nothing short of genius. His signature style of dark humor is one of the best things about Six Feet Under; even in a show about such somber and sometimes even morbid material, laughter is not uncommon, as he is able to recognize that there is more to life than pain. Ball has, within 2 short years, proved that he is one of Hollywood's most talented minds, and we can all look forward to further work from him.\n\nMore than any other television series in history, Six Feet Under is able to connect with its audience on a raw and emotional level that makes the sentimental soap operas of prime time television look like badly acted school plays. Joining the ranks of the most intelligent and heartfelt shows of today, it can rest assured that it will be remembered in the world of tomorrow as one of the most innovative and poignant shows of all time."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2609381657",
        "name": "Six Feet Under: The Complete Second Season",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGM0ZmM3MDAtODc0MC00NjljLTk3OTEtNGM5MzYxOTA1ZDYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGM0ZmM3MDAtODc0MC00NjljLTk3OTEtNGM5MzYxOTA1ZDYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:07:23Z",
        "url": "https://www.imdb.com/video/vi2609381657/"
    },
    "url": "/title/tt0248654/"
}