{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Krause",
            "url": "/name/nm0470244/"
        },
        {
            "@type": "Person",
            "name": "Michael C. Hall",
            "url": "/name/nm0355910/"
        },
        {
            "@type": "Person",
            "name": "Frances Conroy",
            "url": "/name/nm0175814/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 137913,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010714/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030266/"
        },
        {
            "@type": "Person",
            "name": "Alan Ball",
            "url": "/name/nm0050332/"
        }
    ],
    "datePublished": "2001-06-03",
    "description": "A chronicle of the lives of a dysfunctional family who run an independent funeral home in Los Angeles.",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2FmMjg0Y2YtYmMyYi00MTBjLTllYzMtN2VjYzRhOTVmNWRlXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_.jpg",
    "keywords": "funeral home,daydream,talking to the dead,husband wife relationship,boyfriend girlfriend relationship",
    "name": "Six Feet Under",
    "original_info": {
        "id": "Six Feet Under: Season 1_2001",
        "name": "Six Feet Under: Season 1",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "automation21"
        },
        "dateCreated": "2002-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0248654/"
        },
        "name": "Entrancing, confronting, charming, absolutely mindbending. Feels like an insult to call it television",
        "reviewBody": "And I rarely even watch television. I'm a book person.\n\nNot since the \"X-Files\" has a TV show been so intriguing. Every time I watch an episode, I am struck back be depth of storyline, the intricate characters and the left-of-the-middle storytelling. I literally cannot control myself from discussing each new episode with (bored) family members.\n\nSFU is a very introverted show - it resembles more a book or play than television. While the latter is extroverted and relies on events happening to characters (eg: the overboard emergencies of ER or the romances in soaps) to carry the story, Six Feet Under wants to communicate the deepest feelings and ideals of the people on screen. As a result, it not only stimulates the mind but also helps us analyse ourselves.\n\nIn the hands of any other creators, this would make for a very dull hour of suburban spirituality, but Allan Ball's menagerie of ghosts, (past characters influencing the present) trippy daydream sequences, surreal atmosphere and some wicked black humour make for a very entertaining show and sell what would otherwise be a marketing disaster to the masses. On top of that, every component from acting to directing to screenplay is flawless. (the dead boy's ghost in \"a private life\" still chills me to the bone).\n\nMost, of all I admire the characters: some of the most complex and enchanting creatures ever to grace the idiot box. After a few episodes, they feel like a second family.\n\nWhile I do have my complaints about the amount of obscenity, (I can swear that sometimes the writers want to offend us just for fun) I have to give my show the highest commendations. There are, of course, moments when I feel like throwing my chair at the television, but that is simply the consequence of watching a show that challenges me, rather than offer cheap amusement.\n\nSFU may take a while to get into, but the rewards are bountiful."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2609381657",
        "name": "Six Feet Under: The Complete Second Season",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGM0ZmM3MDAtODc0MC00NjljLTk3OTEtNGM5MzYxOTA1ZDYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGM0ZmM3MDAtODc0MC00NjljLTk3OTEtNGM5MzYxOTA1ZDYwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:07:23Z",
        "url": "https://www.imdb.com/video/vi2609381657/"
    },
    "url": "/title/tt0248654/"
}