{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harrison Lowe",
            "url": "/name/nm0522951/"
        },
        {
            "@type": "Person",
            "name": "James Dalgai",
            "url": "/name/nm1501109/"
        },
        {
            "@type": "Person",
            "name": "Adam Beach",
            "url": "/name/nm0063440/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1010,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0104316/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058425/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Person",
            "name": "James Redford",
            "url": "/name/nm0714853/"
        }
    ],
    "datePublished": "2002-11-24",
    "description": "The story revolves around the legend of the skin walkers or \"S Dubs\", a folk legend from Utah about the spirits of murdered Indians returning to seek revenge upon those who disrespect the land.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Eyre",
            "url": "/name/nm0264220/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE0MjA1ODQ5NF5BMl5BanBnXkFtZTcwMzkxNjkxMQ@@._V1_.jpg",
    "keywords": "navajo indian,navajo reservation,tuba city arizona,ganado arizona,arizona",
    "name": "Skinwalkers",
    "original_info": {
        "id": "Skinwalkers_2002",
        "name": "Skinwalkers",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "goddardr"
        },
        "dateCreated": "2004-08-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0312278/"
        },
        "name": "Ignore the nitpickers - just enjoy the movie",
        "reviewBody": "My comments may be a little late to the party, but this was the first one I've seen adapting one of Tony Hillerman's Navajo mystery novels to the screen. After seeing the movie and reading some of the comments, it is evident there are too many reviewers getting caught up in the location and tribal origin of the actors chosen, thus, obscuring the fact that this is a decent, enjoyable, and satisfying movie. If it compels a few people who haven't had the opportunity to pick up any of Hillerman's work and start enjoying the unique mixture of Navajo Indian culture and old-fashioned who-dun-it, then it did its job.\n\nThough I haven't read all of the series, including the book this movie was based upon, the movie was a respectable representation of a typical Hillerman novel. I think one reviewer was right on the nose when they mentioned that both Leaphorn's and Chee's character, the two principle individuals in a good number of the novel series, were not entirely faithful to the book. That may have been necessary because in the books, both of them don't say anymore than necessary and there are a lot of character thoughts expressed to the reader, something that can't be done as easily through a movie unless the director uses a voice-over approach to express the thoughts. It wouldn't have worked, so I'm glad it wasn't done. Still, as an avid reader, Joe was overly stoic and Chee had a little too much gee-whiz kind of look. Believe me, these are small quibbles for what is otherwise an admirable job to play these two decidedly different men.\n\nWhat is over-emphasized is the repeated complaint of those who say the characters didn't look Navajo-like or that the locations didn't represent the Navajo nation in general. As far as them not looking Navajo enough, I'd be willing to bet most of them didn't get that while watching the movie, they probably learned that little tidbit of information through the movie sites with extensive biographical info on the actors. So, exactly how many people who watch the movie who aren't from the immediate area are going to give a cactus prick about the actors not matching the tribal features of most Navajos? Precisely zip. Were these people also ones to object to Graham Greene playing the part of a Sioux native American in Dances With Wolves, considering he is a Oneidan native from Canada??? I doubt it. I'll watch Graham Greene playing anything, whether the part calls for native North American or not. Busting the chops of those who put together this movie because the wrong ancestry of the actors who were put in just should nitpick more important things like bills from Congress. The location complaint is just as bogus, it may have been too flat but it doesn't detract from the essence of film.\n\nIt isn't a perfect film, but it was well worth the time spent and I'll be looking out for more of these adaptations. It is a tribute to Hillerman's work that his would be the first mystery series based on an American novel to be produced through Mystery, who has provided such a terrific portfolio of British based mysteries for a long time."
    },
    "url": "/title/tt0312278/"
}