{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sarah Joslyn Crowder",
            "url": "/name/nm1028797/"
        },
        {
            "@type": "Person",
            "name": "Tony Curtis Blondell",
            "url": "/name/nm0089058/"
        },
        {
            "@type": "Person",
            "name": "Kieran Keller",
            "url": "/name/nm1030458/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1738,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103714/"
        },
        {
            "@type": "Person",
            "name": "Maurice Devereaux",
            "url": "/name/nm0222365/"
        }
    ],
    "description": "A modern 80's slasher in which six \"lucky\" contestants appear on a game show where they'll face the Slashers (in house homicidal maniacs) to win millions of dollars. All contestants have to do is survive the night.",
    "director": [
        {
            "@type": "Person",
            "name": "Maurice Devereaux",
            "url": "/name/nm0222365/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI1OTgzNzQyM15BMl5BanBnXkFtZTcwNzYxNTAzMQ@@._V1_.jpg",
    "keywords": "group of slasher killers,redneck horror,brief nudity,gang of serial killers,masked killer",
    "name": "Slashers",
    "original_info": {
        "id": "Slashers_2001",
        "name": "Slashers",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tim_yellow"
        },
        "dateCreated": "2002-08-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0286975/"
        },
        "name": "from the rough came a diamond",
        "reviewBody": "i have to admit, amongst all the overabundance of reality shows and reality rip-offs i.e. Blair Witch Project; Series 7; The ST. Francisville Experiment..i more than expected, i automatically assumed, that $LA$HER$ would be completely a waste of time after reading it's review in Fango. I mean, with lame character names like PREACHER MAN and CHAINSAW CHARLIE, i was sure this was going to be as horrible, if not worse than, THE DEAD HATE THE LIVING. However, i came across a screener and sat down to watch it less than 3 hours ago and was surprisingly impressed. As a whole, the movie isn't the best thing i've ever seen but it had some unexpected charisma (one being the commercial break situations).With the exception of Chainsaw Charlie, who could possibly be a descendant of Jar Jar Binks, the villians or slashers, if you will, were at times over the top but not too annoying. The story played out quite frantically and the actual contestants weren't bad actors at all. Don't get me wrong, i don't see OSCAR knocking on any of their doors for this one, but they were pretty good for a B-movie cast. What i found to be the best part of $LA$HER$ was the fact that it focused on the characters more than the actual hunting. Most B-movies attempt to do this to keep their films from being gorey fluff, but fail because the dialogue is as bad as the frights. This one captured something special though, perhaps it was because there weren't many stereotypical characters. All the blue prints were there to elaborate on, but instead we see these characters for who they are through their stories told in between being hunted. They could have had the \"token\" personalities but they didn't. The writing could use some touch ups, but for a B-movie it's better than most. Who knows, you may watch this movie and totally hate it. Maybe, ultimately, i'll be the only one that considers $LA$HER$ a few notches above the usual camp. That's fine by me."
    },
    "url": "/title/tt0286975/"
}