{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christin Ackerman",
            "url": "/name/nm1787777/"
        },
        {
            "@type": "Person",
            "name": "Emily Banks",
            "url": "/name/nm1766251/"
        },
        {
            "@type": "Person",
            "name": "Michael Bennett",
            "url": "/name/nm1684896/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 553,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046530/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075716/"
        }
    ],
    "datePublished": "2004-06-19",
    "description": "A documentary on a stereotypically shady used car salesman, one who convinces customers to buy vehicles that others have deemed unfit for sale.",
    "director": [
        {
            "@type": "Person",
            "name": "John Landis",
            "url": "/name/nm0000484/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5NDAzMzMzM15BMl5BanBnXkFtZTcwOTAwMDYyMQ@@._V1_.jpg",
    "keywords": "car,used car,salesman",
    "name": "Slasher",
    "original_info": {
        "id": "Slasher_2004",
        "name": "Slasher",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "anhedonia"
        },
        "dateCreated": "2004-06-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0375073/"
        },
        "name": "Not as interesting as it could be",
        "reviewBody": "Michael Bennett, the titular character in John Landis' documentary, is a free-lance car salesman who travels the country helping car dealerships boost their sales on particular weekends by, you guessed it, slashing prices.\n\nApparently Bennett's very good at this and he puts on a carnival barker-like show that is in turns funny, hectic, tiring and obnoxious. Watching Bennett do his shtick exhausts the viewer because this chap runs like a fast-paced motor without an off-switch. \n\nThe problem is Landis films just one weekend in Bennett's life - when the \"Slasher\" travels to a dealership in Memphis, Tenn., \"the bankruptcy capital of the world.\" In an interview on IFC, Landis said he initially planned to make a documentary about the effects of President Bush's economic policies, but wound up going in a different direction when he met Bennett.\n\nLandis lets us peek at some of the inner workings of Bennett and his two friends - a DJ and a \"mercenary\" salesman. We get to see them work the crowd, as well as hear their asides when interviewing young women for the weekend gig (some of their comments are a bit cruel) and reacting to customers' comments (we see how they manipulate customers).\n\nBut as engaging as Bennett is - a wound-up beer-guzzling machine who also is a loving husband and father - a little bit of him goes a long way, a very long way. If Landis wanted to capture one weekend in Bennett's life, a documentary short would have sufficed.\n\nFor a feature, we need to see more, not more of the same thing, which is what we get here. Landis should have spent more time with Bennett's wife, who sees her husband two days a week. We see only a few snippets of Bennett with his family and it would have made for great cinema. Also, seeing whether Bennett changed from city to city, whether his routine varied depending on the economic and geographic conditions of the area, would have made for a better story.\n\nAnd two crucial questions Landis does not even raise, much less answer, are how did Bennett get into this business and why does he do it? Yes, the money's great, but is there something else that draws Bennett to do this, to be away from his family for five days per week, especially when he says he'd like to be home with them? We never find out what attracts Bennett to this job.\n\nAlthough it runs under 90 minutes, \"Slasher\" seems like it's about 30 minutes too long. Many scenes seem redundant and at the end of the film we don't know much more about Bennett than we did in the first few minutes. It's still worth a look, though.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0375073/"
}