{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Max von Sydow",
            "url": "/name/nm0001884/"
        },
        {
            "@type": "Person",
            "name": "Stefano Dionisi",
            "url": "/name/nm0227958/"
        },
        {
            "@type": "Person",
            "name": "Chiara Caselli",
            "url": "/name/nm0143309/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7180,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "alternateName": "Sleepless",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035890/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0606789/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041787/"
        },
        {
            "@type": "Person",
            "name": "Dario Argento",
            "url": "/name/nm0000783/"
        },
        {
            "@type": "Person",
            "name": "Franco Ferrini",
            "url": "/name/nm0274853/"
        },
        {
            "@type": "Person",
            "name": "Carlo Lucarelli",
            "url": "/name/nm0524044/"
        }
    ],
    "datePublished": "2001-01-05",
    "description": "A retired police detective and a young amateur sleuth team up to find a serial killer who's resumed a killing spree in Turin, Italy after a 17-year period.",
    "director": [
        {
            "@type": "Person",
            "name": "Dario Argento",
            "url": "/name/nm0000783/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWQxNDY3NDItZGZlOC00OWUwLWJiODktM2Q3YTg3MjIzN2IxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1_.jpg",
    "keywords": "giallo,slasher horror,slasher,fingers cut off,meowing like a cat",
    "name": "Non ho sonno",
    "original_info": {
        "id": "Sleepless_2001",
        "name": "Sleepless",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "helencmm"
        },
        "dateCreated": "2020-03-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0220827/"
        },
        "name": "A decent return of Dario Argento",
        "reviewBody": "\"Sleepless\" (\"Non ho sonno\") is an Italian giallo film directed by Dario Argento, whose '90s films weren't that representative. This one, was released in 2001 and many believed that the beloved director returned with a more fair film. I also identify this opinion. The reasons will be mentioned.\n\nLet's start by the plot. The film is about a retired detective and a young man who had a close relationship with one of the victims of a murderer who hit Italy, after 17 years of absence. The two of them are trying to solve the case and to unravel the mystery veil in general.\n\nAs for the plot, it sounds very simple, classic and safe for this particular subgenre (giallo). I partly agree, but I think if you go into the process of watching this film, it'll be quite interesting. It's not flawless in any way, but it's dignified and the beloved subgenre was shortly revived.\n\nPROS:\n\n* Charming protagonist. Nice choice.\n\n* Decent direction by the master Dario Argento.\n\n* While the photography doesn't resemble heavily a giallo film, just because we are used to it quite stylistically, aesthetically, with vivid and vibrant colors. This film, is more \"realistic\" in these parts, making it more accessible. Personally, I prefer the classic stylistic version of giallo films, without saying that I didn't enjoyed the film the way it was. So it's not a flaw, I just expressed my personal preference.\n\n* I think that the selection of the cast was quiet good (I'll explain the in the \"CONS\" sectiom why I use the word \"think\").\n\n* Catchy, simple and straightforward classic giallo plot.\n\n* I would say that the violence in this film is quite high. The presence of blood is frequent and clear. The kills are brutal, not as creative as we are used to in other Argento films, but decent. But they definitely correspond to giallo films. All the stalking scenes shortly before the murder were creepy and scary. There were no annoying jumpscares.\n\nCONS:\n\n* One of the things I write about, in all my reviews on giallo films is the dubbing. I can't figure out why you get some foreign actors and turn the whole movie into English and then dub it with (lots of) miserable voices that disorient you. Hire some Italian actors and turn your movie into Italian. Don't make it harder. I would definitely prefer it. The Italian language is wonderful and I am sure this country has many great actors. As far as I know, most of Argento's films, all of which are now considered classic and superb, at the time of their release, they were quite controversial, because of the violence they represented and were not screened for long. So, if he had hired foreign actors to make his films more successful and saw that it has never worked, why did he keep doing this? It would be more honorable, if he would made his films in his mother tongue.\n\n* I personally suspected who the killer was pretty soon, without being 100% sure, so I think they could have hidden it better.\n\n* The character of 'Gloria' was so unnecessary. They probably added her just to be exisiting a romantic interest for the protagonist. Something extra. There's no other reason. At least let her do something. She was not even a suspect.\n\nNeutrals:\n\n* The film is not so authentic, as I personally found some parts, that resemble the film \"Profondo Rosso\" (1975), if you watch it, you will find it yourself.\n\n* An inspector has the surname \"Manny\". Not coincidentally, as in an earlier Argento film, \"Tenebre\" (1982), the first victim is named 'Elsa Manny'.\n\nGenerally, the film is very enjoyable to watch. I don't think fans of this subgenre will be disappointed, especially Dario Argento's fans, since it was a very dynamic return.\n\nI recommend it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0220827/"
}