{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kemp Aaberg",
            "url": "/name/nm2627936/"
        },
        {
            "@type": "Person",
            "name": "Bruce Brown",
            "url": "/name/nm0113164/"
        },
        {
            "@type": "Person",
            "name": "Del Cannon",
            "url": "/name/nm2639995/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 46,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067627/"
        },
        {
            "@type": "Person",
            "name": "Bruce Brown",
            "url": "/name/nm0113164/"
        }
    ],
    "description": "Surfers Henry Ford, Freddy Pfhaler, Kemp Aaberg, Del Cannon, and Dick Thomas decide to leave California so they can embark on a dream trip to Hawaii. While in Hawaii the carefree quintet ride all kinds of waves at various top Hawa...",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Brown",
            "url": "/name/nm0113164/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY0NTc3OTQwMF5BMl5BanBnXkFtZTcwOTcxMzMyMQ@@._V1_.jpg",
    "keywords": "surfing",
    "name": "Slippery When Wet",
    "original_info": {
        "id": "Slippery When Wet_1958",
        "name": "Slippery When Wet",
        "year": "1958"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "john4films"
        },
        "dateCreated": "2002-08-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0298155/"
        },
        "name": "Bruce Brown's First Film",
        "reviewBody": "Bruce Brown's first film, about surfing, of course. This film was 8 years before Endless Summer was a huge hit. This documentary follows five surfers who trek to Oahu, Hawaii, and live on the cheap. It has a jazz score, rather than surf guitar, like Endless Summer has. It has not bad cinematography for an amateur, at that time, Bruce Brown and a 16mm camera. Although there is not a lot of attention to the lighting of faces, as in dramas (for example, no fill light), that doesn't detract at all from the film, because it is about surfing, not faces or acting or drama, and it is a documentary. It is a fun exploration of the surfing culture of those times, which was a lot more friendly than the surf nazis and vehicle vandalism and localism and territorialism of recent times.\n\nI was actually living on Oahu, Hawaii the entire summer of 1967, at the age of 18 and 19 when Endless Summer finally got national release. I saw it for the first time in Honolulu with a beautiful, blonde from Connecticut, or was it Massachusetts, who was fascinated by surfing and surfers. Lucky me. And I mean gorgeous! She had a previous boyfriend who had died surfing the Pipeline. I worked at the Dole Pineapple cannery on the graveyard shift from 11pm to 7am. I was home, showered and in bed by 7:30am. I got up about noon, had a quick lunch, and immediately went surfing, usually at Waikiki, because the North Shore is dead in the summer. I would surf until sunset. Then I'd eat dinner, and if I was really tired take a nap, otherwise we'd party until we went to work driving forklifts in the empty can storage department at the Dole cannery. I did this Monday through Friday. There were 4 of us from Arizona. Yeah! Arizona surfers! Then Saturdays, we'd go body surfing and skin diving at Sandy beach. On Sundays, we'd tourist the island and go scuba diving. We had our tanks with us over there, as well as longboards.\n\n So this film and Endless Summer and other Bruce Brown films are beautiful memories to me. And they really do mirror the laid-back, fun, polite, kind and helpful (and partying) personality of the surf culture and surfers of that time. Today, some of this atmosphere still exists, but there are some really jerk, punk, rude *@#^&%*? surfers out there now, unfortunately.\n\nSo, here's to the early, pure, fun, friendly surf culture, before everyone thought they were a surfer, and surfing became primarily about marketing \"surf\" clothes, and the waves became so crowded with rude jerks, that it is worse than LA rush hour on the freeways.\n\nOh, God, that was a beautiful summer!!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0298155/"
}