{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sid Wilson",
            "url": "/name/nm0934142/"
        },
        {
            "@type": "Person",
            "name": "Joey Jordison",
            "url": "/name/nm0430259/"
        },
        {
            "@type": "Person",
            "name": "Paul Gray",
            "url": "/name/nm0336870/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 738,
        "ratingValue": 8.9,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0171148/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080311/"
        }
    ],
    "datePublished": "2002-11-26",
    "description": "Recorded live in London, England, this nine-(masked)-man band performs a live concert full of chaos, pyros, light effects, and 15 songs of heavy metal from their first two albums. Shot with over 30 cameras, including ones on strap...",
    "director": [
        {
            "@type": "Person",
            "name": "Matthew Amos",
            "url": "/name/nm0025316/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjFhYmQzNWMtY2EwZS00NzU5LWE1YWUtNDE0NmEyZGUwN2ZhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "name": "Slipknot: Disasterpieces",
    "original_info": {
        "id": "Slipknot: Disasterpieces_2002",
        "name": "Slipknot: Disasterpieces",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aarseth1721"
        },
        "dateCreated": "2005-11-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0350815/"
        },
        "name": "Welcome to insanity in its purest shape",
        "reviewBody": "Never have I seen such a intense and tight live DVD as this one! Slipknot is known to be one of the loudest and fastest band around, and they certainly prove this on Disasterpieces. Shot in London with thousands of dedicated fans, it couldn't possibly go wrong, and it definitely didn't! The set list is based around their earliest recordings, the self titled debut Slipknot from 1999 and IOWA from 2001. Usually, it can be a bit boring to have so little songs to choose from, but in Slipknot's case, it's no problem at all, because both albums are very good. From the very first tune they play, the crowd in London, and also you, get psyched to a ecstatic level. Never have extreme music been this good on a DVD recording! They never rest, and keeps on pumping out agony and hate for nearly 2 hours. Many times when you listen to this type of music, it has a tendency to get boring and similar after a while. Slipknot is not one of these cases. When the last song is through, you wish that it continue, but it's sadly enough over.\n\nAs bonus on this DVD you get some promo videos that are fairly cool, but not so much more is to find on the two discs. But hey, this release is ESSENTIAL and should be found in every metal lovers DVD collection.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0350815/"
}