{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adam Beach",
            "url": "/name/nm0063440/"
        },
        {
            "@type": "Person",
            "name": "Evan Adams",
            "url": "/name/nm0010963/"
        },
        {
            "@type": "Person",
            "name": "Irene Bedard",
            "url": "/name/nm0065942/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12082,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091402/"
        },
        {
            "@type": "Person",
            "name": "Sherman Alexie",
            "url": "/name/nm0018963/"
        }
    ],
    "datePublished": "1998-11-27",
    "description": "Arnold rescued Thomas from a fire when he was a child. Thomas thinks of Arnold as a hero, while Arnold's son Victor resents his father's alcoholism, violence and abandonment of his family.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Eyre",
            "url": "/name/nm0264220/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA4MjU1NTg0NF5BMl5BanBnXkFtZTgwODYwMDQ1MjE@._V1_.jpg",
    "keywords": "national film registry,native american protagonist,loss of father,native american reservation,father son relationship",
    "name": "Smoke Signals",
    "original_info": {
        "id": "Smoke Signals_1998",
        "name": "Smoke Signals",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "budmassey"
        },
        "dateCreated": "2005-05-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120321/"
        },
        "name": "Nothing short of miraculous.",
        "reviewBody": "Smoke Signals is a somewhat misunderstood film. The setting on an Indian reservation leads viewers to believe that Smoke Signals is about Indian issues or Indian philosophy. To be sure, the presence of Indian values and culture make this movie decidedly more enjoyable, but the movie is more transcendent, more universal than a purely Indian film. And, while this was heralded as the first movie to be written, directed and co-produced by Native Americans, there is something here for everyone, regardless of ethnicity.\n\nMore than anything else, this movie appealed to me as a writer. Taken from Sherman Alexie's brilliant collection \"The Lone Ranger and Tonto Fist Fight in Heaven\". it is beautifully written and expertly crafted from beginning to end. The first scene, narrated lyrically by Evan Adams as Thomas Builds-the-fire, sets the tone for a story handed down, as with Native American culture, in true oral tradition.\n\nThe French title, Le secret des cendres (The secret of the ashes) more accurately describes the book and the movie, both of which must be experienced to fully appreciate Alexie's genius. With multiple allusions to fire and ash, each having different meanings, as well as a well integrated use of Native American lore, Smoke Signals requires more than a little thought for the average American viewer.\n\nThe story revolves around two young Coeur d' Alene Indian men dealing with loss and the end of childhood innocence. The two men cope with loss in very different ways; Thomas though mysticism and legend, Victor through stoicism and denial. When Victor Joseph, brilliantly played by Adam Beach, learns that his estranged father has died, he and Thomas embark on a journey to claim the ashes, another allusion of the french title, and on the way get in touch with their identities as adults apart from their parents.\n\nEvan Adams is stupendous as Thomas Builds-the-fire. His storytelling scenes are pure magic. By imbuing simple memories with mystical reverence, he elevates them, and thus both himself and his listeners, to a new spiritual level. His exaltation of the ordinary is the core of this delightful work of genius. It culminates with a reading, slightly modified, of Dick Lourie's poem \"Forgiving Our Fathers\". Lourie, who is a self-described unreconstructed beatnik poet, brings a fragile and elegant beauty to the film's emotional climax. The final scenes, driven by Adams' narration and haunting Native American chant and music, are nothing short of miraculous.\n\nAdam Beach, strapping and stalwart as Victor Joseph, managed to parlay his appearance in Smoke Signals into a respectable film career. Evan Adams, diminutive and shy as Thomas Builds-the-fire, was not so lucky despite his masterful performance. Perhaps Admas' aspirations ran along different lines, as these days, even after starring in what is basically a sequel (The Business of Fancydancing, also by Alexie) Adams can now be called Dr. Adams, as he has become a respected and accomplished physician in British Columbia. \n\nThe supporting cast was equally magnificent, and each lends credibility and energy to the movie. An interesting sidenote is that Irene Bedard, who appears as Suzy Song, was the physical model for Pocahontas in the Disney animated feature. \n\nI have seen this movie many times, and will undoubtedly watch it many more. Each time I am left in silent awe as I reflect on my own life, family, and philosophies.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1238408729",
        "name": "Smoke Signals",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjQxOThkN2EtZDljOC00YjcyLThjNDItNjZlNTFlMjQ3OTI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjQxOThkN2EtZDljOC00YjcyLThjNDItNjZlNTFlMjQ3OTI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:46:50Z",
        "url": "https://www.imdb.com/video/vi1238408729/"
    },
    "url": "/title/tt0120321/"
}