{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mare Winningham",
            "url": "/name/nm0001858/"
        },
        {
            "@type": "Person",
            "name": "Felicity Huffman",
            "url": "/name/nm0005031/"
        },
        {
            "@type": "Person",
            "name": "Chelcie Ross",
            "url": "/name/nm0743304/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 410,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071237/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046031/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006395/"
        },
        {
            "@type": "Person",
            "name": "Randy Sue Coburn",
            "url": "/name/nm0168020/"
        },
        {
            "@type": "Person",
            "name": "Ara Watson",
            "url": "/name/nm0914503/"
        },
        {
            "@type": "Person",
            "name": "Sam Blackwell",
            "url": "/name/nm0085953/"
        }
    ],
    "datePublished": "2001-06-04",
    "description": "Inspired by a true story, Mare Winningham stars as a young widowed mother who finds herself on trial for child pornography and abuse after she allows her daughters and friends to be photographed by her friend (Felicity Huffman).",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Metzger",
            "url": "/name/nm0582721/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzFhMDc4NWItNmQyOS00ZGE4LTg4ZTUtOWM3ODA2YmIwMjliXkEyXkFqcGdeQXVyMTM0ODAyOTc@._V1_.jpg",
    "keywords": "pedophile witchhunt,underwear,detective,mother,child pornography",
    "name": "Snap Decision",
    "original_info": {
        "id": "Snap Decision_2001",
        "name": "Snap Decision",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "petershelleyau"
        },
        "dateCreated": "2002-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0286132/"
        },
        "name": "aka Snap Judgment",
        "reviewBody": "What is it with Mare Winningham and photo labs? After her 1991 Fatal Exposure TVM, Winningham is in photographic trouble again! Here Winningham is Jennifer Bradley, a Cincinatti internet web site designer and mother of 3 - 7 year old Lauren (Amy Zell), 4 year old Sophie (Alex Gaistman) and toddler Luke (Alexander Cameron Drogemuller) - whose Chicago friend Carrie Dixon (Felicity Huffman) takes photographs of as they innocently play semi-naked. However the photo lab that develops Carrie's pictures sends the contact sheet and negatives to the police, fearing child abuse and child pornography.\n\nWinningham carries extra weight as the mother of 3 children and wears blonde hair. Her anger at the situation is expressed in hushed tones when she is initially questioned, and controlled emotional anger when she says `Shame on you' to the prosecutors for the way they have cropped the photos to distort their intent. Winningham's face changes from crushed sadness to a smile in close-up when she sees Lauren looking at her, lowers her head in shameful disappointment when her lawyer Steve Godwin (Ron Sarosiak) tells her of the negative reaction of a focus group to the photos, and captures our empathy when she cries `My babies' at the idea of life without her children.\n\nThe teleplay by Ara Watson and Sam Blackwell, based on a story inspired by real events by Randy Sue Coburn, presents a tale of injustice since we are witness to the behavior that created the photographs, including how some of them were actually taken by Lauren. Jennifer is also such an earth mother that the idea of her being duplicitous is inexplicable -she even stops Godwin from cross-examining a prosecution witness Sara Hawkins (Megan Fahlenbock) who is also in the photos because Sara is pregnant. However Carrie's character retains some doubt, partly because of the poor performance of Huffman. Having Carrie a cancer survivor is presumably meant to make her a fighter but as it is, the cancer only attaches a level of illness to her. Jennifer also recognises that the question of innocence is irrelevant once the tag pornography has been projected onto images - and the drive to prosecute Jennifer and Carrie is motored by the far creepier Cincinatti Detective John Collins (Chelcie Ross).\n\nDirector Alan Metzger uses a hand-held camera for the photography scene to allow for the freestyle interraction of the children, and also explain the multiple and un-posed nature of the session."
    },
    "url": "/title/tt0286132/"
}