{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ethan Hawke",
            "url": "/name/nm0000160/"
        },
        {
            "@type": "Person",
            "name": "Max von Sydow",
            "url": "/name/nm0001884/"
        },
        {
            "@type": "Person",
            "name": "Yûki Kudô",
            "url": "/name/nm0473802/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14317,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013175/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032262/"
        },
        {
            "@type": "Person",
            "name": "David Guterson",
            "url": "/name/nm0349189/"
        },
        {
            "@type": "Person",
            "name": "Ron Bass",
            "url": "/name/nm0060103/"
        },
        {
            "@type": "Person",
            "name": "Scott Hicks",
            "url": "/name/nm0382956/"
        }
    ],
    "datePublished": "2000-01-07",
    "description": "A Japanese-American fisherman is accused of killing his neighbor at sea. In the 1950s, race figures into the trial. So does reporter Ishmael.",
    "director": [
        {
            "@type": "Person",
            "name": "Scott Hicks",
            "url": "/name/nm0382956/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Drama",
        "Mystery",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWYzN2I5NWItYTdmNS00ZWNmLWI0MWItMTJhN2FjMjY3MDQ1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "injustice,fictional island,fbi federal bureau of investigation,japanese internment,timeframe 1930s",
    "name": "Snow Falling on Cedars",
    "original_info": {
        "id": "Snow Falling on Cedars_1999",
        "name": "Snow Falling on Cedars",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jhclues"
        },
        "dateCreated": "2002-07-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120834/"
        },
        "name": "On of the Best Films of '99",
        "reviewBody": "Honor and justice, the effects of prejudice, and most importantly the need for truth; all elements that bind us together as a community of Man, or threaten to tear us apart, depending upon the circumstances at hand, and how we, as a society approach them. What it all comes down to is having and living by a moral code, and applying that code objectively, especially in troubled times. And the real question is, when the time comes, are we as a people capable of achieving that objectivity that is imperative in assuring true justice for all? It's an important, legitimate question posed by director Scott Hicks in `Snow Falling On Cedars,' a very real and personal drama, that in the final analysis has a bearing of monumental proportions that ultimately defines who we are and what we are made of, while ascertaining whether or not we do, indeed, have the moral courage necessary to survive as a civilized species.\n\nIt's a small town in the State of Washington; the ninth anniversary of the attack on Pearl Harbor is coming up, and a young man named Kazuo Miyamoto (Rick Yune), a much decorated American soldier during the war, is on trial for the murder of local fisherman Carl Heine (Eric Thal). Covering the trial is reporter Ishmael Chambers (Ethan Hawke), whose father, Arthur (Sam Shepard), had been a respected newspaperman locally for many years, known as a man who was not afraid to speak from his conscience when writing an editorial, and who took a stand for the Japanese locals during the emotionally exasperating years encompassing World War II.\n\nAttempting to objectively cover Kazuo's trial, Ishmael finds himself troubled by a conflict of interests; he has a history with Kazuo's wife, Hatsue (Youki Kudoh), a former relationship reaching back to their childhood, but which ended with the onset of the war. And Ishmael still is grappling with the bitterness he has felt since that time, born of his experiences in the military, as well as Hatsue's rejection of him. And now he is forced to objectively observe this pivotal point in her life, watching from the sidelines and seeing first hand the effects of the prejudice that is very much alive among the local citizenry, and which threatens the assurance of an impartial judgment in Kazuo's case; a judgment that will determine the future of not only Kazuo, but of Hatsue, the woman Ishmael once loved-- and still does.\n\nWorking from an intelligent screenplay (by Hicks and Ronald Bass, adapted from the novel by David Guterson), with this film Hicks demonstrates the difference between a visionary filmmaker and someone who just makes movies. In another's hands, because of the story itself, this would have no doubt been an excellent film; with Hicks directing, however, it becomes something much more, as he has taken it beyond excellent, crafting and delivering a film that is thoroughly mesmerizing, majestic and memorable. It's an accomplishment achieved through a visionary presentation, born of the director's sensitive approach to the material and his acute insights into the human condition. Fully utilizing all of the magic at his disposal, Hicks has taken a good film and turned it into an emotionally involving, inspirational and visually poetic experience. \n\nWith a haunting score by James Newton Howard underscoring the magnificent cinematography of Robert Richardson, Hicks brings the era and the rural splendor of Washington State vividly to life, creating an aesthetic ambiance that makes the emotional essence of the drama almost tangible; and by exacting some incredible performances from his actors, he sustains that emotional level and combines all of these elements to make this film riveting and unforgettable.\n\nAs Ishmael, Ethan Hawke gives a reserved, understated performance, through which he genuinely captures the essence of his character. Watching him, you can sense the turmoil of a soul at cross purposes with itself, and he enables you to sample that taste of bitterness toward life he so desperately needs to overcome if he is to move on within himself to greener pastures. With this role, Hawke was given the opportunity to do something fine, and he succeeds with one of his most memorable performances yet.\n\nYouki Kudoh turns in an extremely affecting performance, as well, as Hatsue. With this moving portrayal of a young woman enduring unbearable inner turmoil, she fulfills the artistic promises made in previous films, such as `Mystery Train' in '89, and `Picture Bride,' in 1965. She's a terrific actor, whose eyes are truly a window to her soul.\n\nAlso adding to the success of this film are the supporting efforts of Richard Jenkins, as Sheriff Moran, and James Rebhorn as prosecutor Alvin Hooks. But the most notable performance of all comes from Max von Sydow, who as Kazuo's defense attorney, Nels Gudmundsson, is given an opportunity to return to the kind of role that shaped his career early on under the auspices of Ingmar Bergman. As Nels, von Sydow gives a performance made all the more powerful by the restraint and subtlety of his delivery. He takes what to most actors would be a good part, and makes it a cohesive element of the film. It's a performance that by all rights should have earned von Sydow an Oscar nomination, but sadly did not.\n\nThe supporting cast includes Reeve Carney (Young Ishmael), Ann Suzuki (Young Hatsue), James Cromwell (Judge Fielding), Ariia Bareikis (Susan Marie), Celia Weston (Etta) and Daniel von Bargen (Carl). In a year (1999) that saw lesser efforts acknowledged, `Snow Falling On Cedars' was inexplicably ignored at Oscar time (except for Richardson's most deserving nomination for cinematography); an injustice, to say the least, as this was clearly one of the best films of the year. Reminiscent of Ang Lee's artistry, yet with a style uniquely his own, Hicks has given us a poetic film of rare beauty and conscience, for which he is hereby granted an Award in it's purest form:\n\nThe gratitude of an appreciate audience. 10/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Japanese-American fisherman is accused of killing his neighbor at sea. In the 1950s, race figures into the trial. So does reporter Ishmael.",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1725547289",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWFlNDI4Y2EtMjUwYy00OTllLTk5MDYtNmQxZjIyYzBiN2I3XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWFlNDI4Y2EtMjUwYy00OTllLTk5MDYtNmQxZjIyYzBiN2I3XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-12-01T15:40:12.804Z",
        "url": "https://www.imdb.com/video/vi1725547289/"
    },
    "url": "/title/tt0120834/"
}