{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adriana Caselotti",
            "url": "/name/nm0143314/"
        },
        {
            "@type": "Person",
            "name": "Harry Stockwell",
            "url": "/name/nm0830968/"
        },
        {
            "@type": "Person",
            "name": "Lucille La Verne",
            "url": "/name/nm0479164/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 204316,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074039/"
        },
        {
            "@type": "Person",
            "name": "Jacob Grimm",
            "url": "/name/nm0342278/"
        },
        {
            "@type": "Person",
            "name": "Wilhelm Grimm",
            "url": "/name/nm0342303/"
        },
        {
            "@type": "Person",
            "name": "Ted Sears",
            "url": "/name/nm0780799/"
        }
    ],
    "datePublished": "1938-02-04",
    "description": "Exiled into the dangerous forest by her wicked stepmother, a princess is rescued by seven dwarf miners who make her part of their household.",
    "director": [
        {
            "@type": "Person",
            "name": "William Cottrell",
            "url": "/name/nm0183183/"
        },
        {
            "@type": "Person",
            "name": "David Hand",
            "url": "/name/nm0359457/"
        },
        {
            "@type": "Person",
            "name": "Wilfred Jackson",
            "url": "/name/nm0414144/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Animation",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQwMzE2Mzc4M15BMl5BanBnXkFtZTcwMTE4NTc1Nw@@._V1_.jpg",
    "keywords": "snow white and the seven dwarfs,brothers grimm,fairy tale,evil stepmother,female protagonist",
    "name": "Snow White and the Seven Dwarfs",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rannynm"
        },
        "dateCreated": "2016-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0029583/"
        },
        "name": "This Classic Truly Withstands the test of Time. It's As Beautiful Today as Ever!",
        "reviewBody": "Before Cinderella lost her slipper and before Aladdin met the Genie, Walt Disney did his most crazy and insane project ever - a feature animated movie, the first of its kind. The title of the film is Snow White and the Seven Dwarfs. Parents and kids loved this film decades ago and, a generation later, families can now enjoy this beautiful classic in Blu-Ray.\n\nSnow White and the Seven Dwarfs is a musical with catchy, and beautiful singing done by Adriana Caselotti, (Snow White), Lucille La Verne (Queen) and others. There is also a sense of adventure, and a magical romance, between Snow White and the Prince.\n\nThe story begins when the Queen discovers that she is not the fairest of them all, and that Snow White is. Out of jealousy, she orders the death of Snow White. However, Snow White gets away. She comes upon 7 dwarfs which she befriends. The Queen angrily learns about her failed death, and decides to poison the young princess!\n\nSince this is the Diamond Edition of Snow White and the Seven Dwarfs, it is packed with extra features including a tour of the animation studios in the 1930s, actual interviews with Walt Disney, cool facts, (Did you know Snow White was originally designed to have gold hair? Who knew!) and so much more. My favorite part concentrates on how Walt Disney hired over 300 artists, how he spent so much money on making it perfect, and just how much speculation and hate he got for attempting to make (and being very successful as a result) a 90 minute animated film.\n\nEven though this film was made almost a century ago, the quality of the animation is as good as films made today. Hand-drawn animation has a quality of from the human touch that CGI can never achieve. In terms of the soundtrack, Walt Disney had a knack for making his animated films not only have background music, but he created it in such as way that the music becomes an integral part of the story. For example, when Snow White and the Prince first meet, they sing a song together and it represents almost, \"Instant love,\" better than words ever could. This story is based on a classic European fairy tale, and Walt Disney hired a few people who specifically made European-styled drawings, to make the film feel like the original fairy tale, which was perfect for the film. The voice-over sound quality is also top notch, amazingly so since again, it was made almost 100 years ago. I would easily compare it to the voice over acting and quality of the late 90s. This film was ambitious in terms of being the first animated feature film, but also was first feature film to have a female lead.\n\nMy favorite scene is the meeting of The Prince and Snow White. In the scene, Snow White is cleaning outside and she explains to her bird friends what a wishing well is. A prince overhears her fantastic singing and is love-struck when he meets her. This scene is one of my favorites because the music is beautiful, the animation is spectacular and this scene specifically illustrates my point about European artists designing the backgrounds. It really looks like a European castle of some sort.\n\nThis film was designed for all ages and I still agree. I recommend it for ages 6 to 13 specifically. Younger kids will enjoy the bright colors, dancing and singing. Older kids can appreciate how difficult it was to make this film and the storyline itself. Adults who have happy memories of seeing this film years ago will also enjoy it. Overall, it's a great film for the family. I rate it 5 out of 5 stars because of the spectacular animation, exciting story (typical of films made by Walt Disney) and clear voice acting."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Snow White Los Lobos Music Video",
        "duration": "PT2M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi367789081",
        "name": "Snow White and the Seven Dwarfs: Diamond Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzkwMWViNzItYzVkYi00ZTg0LWJmNWMtOTczMTljYmIxZGQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzkwMWViNzItYzVkYi00ZTg0LWJmNWMtOTczMTljYmIxZGQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T16:20:18Z",
        "url": "https://www.imdb.com/video/vi367789081/"
    },
    "url": "/title/tt0029583/"
}