{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tong Wang",
            "url": "/name/nm0911054/"
        },
        {
            "@type": "Person",
            "name": "Yu Shi",
            "url": "/name/nm10528898/"
        },
        {
            "@type": "Person",
            "name": "Tao Guo",
            "url": "/name/nm0849919/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 312,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "So Close to Paradise",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020819/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039460/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065106/"
        },
        {
            "@type": "Person",
            "name": "Ming Pang",
            "url": "/name/nm0659401/"
        },
        {
            "@type": "Person",
            "name": "Xiaoshuai Wang",
            "url": "/name/nm0911075/"
        }
    ],
    "datePublished": "1998-12-10",
    "description": "Two young farm workers, who like millions of others, leave their village to seek their fortunes in the city. Each chose a vastly different path to make it and become embroiled in misunderstandings, gangster brawls and police raids.",
    "director": [
        {
            "@type": "Person",
            "name": "Xiaoshuai Wang",
            "url": "/name/nm0911075/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE1ODAyOTE5OV5BMl5BanBnXkFtZTcwOTU3NjkyMQ@@._V1_.jpg",
    "keywords": "police raid,police,gangster,note,hitting",
    "name": "Biandan, guniang",
    "original_info": {
        "id": "So Close to Paradise_1998",
        "name": "So Close to Paradise",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TimeForLime"
        },
        "dateCreated": "2004-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0200486/"
        },
        "name": "Any Non-Official Film in China is an Underground Movie",
        "reviewBody": "I believe that what reviewers of this film may have missed is addressed on the DVD in the Bonus Section. As recently as 1998, the government of China, officially the PEOPLE'S REPUBLIC OF CHINA, had strong policies about approving the production and release of commercial films. This should be read as CENSORSHIP. As a consequence, a film like SO CLOSE TO PARADISE could not be scripted nor shot if it was done through channels.\n\nTo get this film done AT ALL, the director had to rely on cameras and film that were begged or borrowed. And actors, for the most part, were paid ,,,,, NOTHING. If there is some clumsiness, especially in the film's first half, chalk it up to factors such as this, which make movie-making less than ideal for someone with a story to tell. A story, mind you, that is critical, via the art of story-telling, of the government, of social policy, and of progress towards China's vaunted goals of building a perfect society.\n\nA recent report in major USA newspapers (recent as of July '04) addresses the frightful gap in wealth between China's rural poor and urban rich. In this film, the gap is the motivation for two men to move to the city to look for work. (A figure to keep in mind is that, despite all the manufactured products we Americans buy that bear the label MADE IN CHINA, the number of (rural) peasants in China is still 750 million!)\n\nOther Users have described the film. I would only add that the greater emphasis is on the fate of those two men; one confines himself to \"honest\" hard work -- and gets nowhere. The other slides easily into a life of crime. A social observer might say that these choices and their consequences are mirrored in the life of young men and women in the very poorest parts of America's cities. China has no monopoly on this terrible no-win situation. I'll leave that for each viewer to explore through this movie.\n\nThose looking for a film PRIMARILY about the plight of women in China will, I think, not find it here. However, these choices are presented as gender-neutral. If you start poor in the city, where do you turn?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0200486/"
}