{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Marshall",
            "url": "/name/nm0338614/"
        },
        {
            "@type": "Person",
            "name": "Olivia d'Abo",
            "url": "/name/nm0001882/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Foley",
            "url": "/name/nm0284158/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1740,
        "ratingValue": 3.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016210/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055050/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002707/"
        },
        {
            "@type": "Person",
            "name": "Daniel Forman",
            "url": "/name/nm0286333/"
        }
    ],
    "datePublished": "1999-07-23",
    "description": "A heart-warming comedy about the friendship between the new kid in town and a soccer-playing dog on the lam from the dog-catcher. It's up to these two underdogs to win the PeeWee Soccer League championship game.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Giglio",
            "url": "/name/nm0317638/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Comedy",
        "Family",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEwNzQwOTY5N15BMl5BanBnXkFtZTcwNTgxOTQxMQ@@._V1_.jpg",
    "keywords": "slimehouse,soccer sport,underdog,underdog sport,soccer",
    "name": "Soccer Dog: The Movie",
    "original_info": {
        "id": "Soccer Dog_1999",
        "name": "Soccer Dog",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TrueTenorOne"
        },
        "dateCreated": "2007-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0134969/"
        },
        "name": "Not as bad as it would seem...",
        "reviewBody": "OK... yes, it's a movie about a dog playing soccer. Yes, its attempts at portraying a very evil dog catcher fall flatter than every opposing soccer player seems to when the dog comes their way. And yes, most of its attempts at humor fail.\n\nHowever, if you go out and rent a movie like this or watch it on TV expecting a masterpiece, what universe are you living in? Has any movie about animals playing sports ever really been that great? Apologies to all of the Air Bud fans out there, but even that movie wasn't all that great, and it's the Godfather of animal athlete movies. So, if you're holding Soccer Dog up to the standards set by other movies like it, you will find that it is actually fairly decent.\n\nA man named Alden, once an orphan, is now happily married and living in a soccer-crazed town called Crocker. However, since he was once an orphan, he feels that it is his duty to adopt from the same orphanage. In comes Clay, the shy, chronically depressed young boy they adopt. This movie spends a little too much time being melodramatic with the attempt at chronicling the difficulties of parenting, but oh well. Clay joins the soccer team at his father's request, becoming the laughing stock of his team and the opposing team for his ignorance of the game they hold sacred. Just when all hope seems lost for Clay to fit in, he finds a dog. What happens? Lincoln happens to score a goal during a game and quickly becomes the town's biggest sensation since the sport of soccer was invented.\n\nMy favorite character in this whole movie would have to be the coach. I think he may save some of the movie with his \"stand-out\" humor, meaning he is the only one who is truly funny. Fans of old Nickelodeon TV shows may also recognize the referee as the head counselor from \"Salute Your Shorts\", making it even more enjoyable. And no movie is complete without a David Hasselhoff joke, and even Soccer Dog pulls that off.\n\nAll in all, not a bad attempt at a genre that never should have happened in the first place. 7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Coming Soon\"",
        "duration": "PT1M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1737031961",
        "name": "Soccer Dog",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzhiNzFmMGMtZjUwMy00MWNiLWEwMjItMjQ2YmI2OTFlMTAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzhiNzFmMGMtZjUwMy00MWNiLWEwMjItMjQ2YmI2OTFlMTAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:11:08Z",
        "url": "https://www.imdb.com/video/vi1737031961/"
    },
    "url": "/title/tt0134969/"
}