{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tim Matheson",
            "url": "/name/nm0001513/"
        },
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        },
        {
            "@type": "Person",
            "name": "Peter Boyle",
            "url": "/name/nm0001967/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1981,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005646/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0096033/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048932/"
        },
        {
            "@type": "Person",
            "name": "Takeshi Kawata",
            "url": "/name/nm0442938/"
        },
        {
            "@type": "Person",
            "name": "Joe Gannon",
            "url": "/name/nm0304461/"
        },
        {
            "@type": "Person",
            "name": "Tedi Sarafian",
            "url": "/name/nm0093328/"
        }
    ],
    "datePublished": "1990-07-14",
    "description": "A huge Solar flare is predicted to fry Earth. Astronauts must fly to the sun to drop a talking bomb (Freddy) at the right time so the flare will point somewhere else. Giant IXL Corp C.E.O. Teague thinks the flare won't happen and ...",
    "director": [
        {
            "@type": "Person",
            "name": "Richard C. Sarafian",
            "url": "/name/nm0764781/"
        },
        {
            "@type": "Person",
            "name": "Arthur Marks",
            "url": "/name/nm0548769/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzcwNDg2NjMtZTJhYi00NmY4LWJkNzQtZmFmOTdkNzY4Nzk0XkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_.jpg",
    "keywords": "time bomb,female frontal nudity,humanity in jeopardy,2050s,astronaut",
    "name": "Solar Crisis",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SmgBag1"
        },
        "dateCreated": "2006-12-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100649/"
        },
        "name": "Science buffs beware!!!",
        "reviewBody": "This movie is self-contradicting. It takes an absurd plot and tries to pass it off as good science fiction. Yet not all parts of the film were so totally \"out there\" as to make it unwatchable as a whole. A great chase scene in the desert is an example of this. Add to this an element of sabotage, and the film is saved from itself.\n\nThe year is 2050, and the sun is threatening a \"megalo flare\" that will destroy the earth if it reaches us. Now, flares happen all the time on the sun. You only have to look at close-up photos of the sun to know this. Most last several hours and shoot 100,000 miles off the solar surface in an arc that's really quite impressive to see. But a flare that shoots out and spans the 93 million miles between Earth and sun? Not only that, but to find the earth in its orbit around the sun and strike right there? That's a little too convenient, at least for the plot's sake. Let's face it. If there were no emergency, there'd be no need for the mission to avert it.\n\nThe plot to save Earth is to send a talking anti-matter bomb into the sun and make the flare point somewhere else. And here's where the plot thickens, so to speak. Forget for a moment that it's over a million degrees in the corona, the part of the sun you can see in a total eclipse. It's going to get hot as you approach the sun. Yet the mission proceeds as if they have some super cooling process that will save them. And don't get me started on the bomb itself. Anti-matter is unstable by nature. So you're going to put enough of it to theoretically disrupt the sun's energy flow, all the while knowing that the sun itself is enough vaporize anything solid that approaches it? That's a suicide mission in itself.\n\nAs if all this weren't enough, now you have a saboteur on board that threatens the mission at various stages. A corporation on Earth doesn't believe the flare will happen, and is buying up resources while cheap and the scare lasts. So you have that element of competition. Will the mission succeed or won't it? Will the Helios (the vessel) escape the sun's gravitational pull and be able to return home?\n\nSolar Crisis is fun to watch, if you can get past the absurdity. Just don't take it seriously, or you'll get burned.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0100649/"
}