{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Nicholson",
            "url": "/name/nm0000197/"
        },
        {
            "@type": "Person",
            "name": "Diane Keaton",
            "url": "/name/nm0000473/"
        },
        {
            "@type": "Person",
            "name": "Keanu Reeves",
            "url": "/name/nm0000206/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 124379,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0114441/"
        },
        {
            "@type": "Person",
            "name": "Nancy Meyers",
            "url": "/name/nm0583600/"
        }
    ],
    "datePublished": "2003-12-12",
    "description": "A swinger on the cusp of being a senior citizen with a taste for young women falls in love with an accomplished woman closer to his age.",
    "director": [
        {
            "@type": "Person",
            "name": "Nancy Meyers",
            "url": "/name/nm0583600/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODYyNmRlNDMtYzg1Zi00NzlhLWI4ZDMtZWUwOTQzMDZiYTQyXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
    "keywords": "matronizing,caribbean island,columbia tristar,sony,cigarette",
    "name": "Something's Gotta Give",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AurumStarFinder"
        },
        "dateCreated": "2004-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0337741/"
        },
        "name": "Someone's gotta give me some earplugs",
        "reviewBody": "I must admit that this film isn't as good as I thought it would be. My friend went to see it in the cinema with her parents and she said it was a really great film. But usually Jack Nicholson just gets on my nerves, so at the time I didn't even dream of going.\n\nI'm glad I didn't.\n\nBasically, Jack Nicholson is Harry Sanborn, a 63 year-old guy who dates only under-30 year old women. And when we meet him, he's dating the daughter of Erica Barry, a very successful playwright (Diane Keaton). Erica is a single 50-something old woman who's been stuck in the same routine: write, sleep for only 4 hours every night and celibate since her divorce. And despite her first impressions of Harry  namely that he's a disgusting womaniser with no manners  she has to look after him after he has a heart attack. I don't think I need to tell you where the story goes from here. Other than Keanu Reeves' perhaps not really necessary part of Dr Mercer, a cute 36-year-old guy who's a fan of Erica's work and asks her out for a date.\n\nIn other words, the story's fairly predictable. I will admit that even Keanu managed to do an OK job, though I think he's better off staying clear of romcoms after The Matrix sequels.\n\nThere's something very annoyingly cliched about every scene involving Nicholson and Keaton. It might be the acting, but I think it's just the script. I'll probably have forgotten the film by next week, and I've got a good memory for the movies that I've seen. \n\nSo far Nancy Meyers' hasn't impressed me much. But I've only seen this and What Women Want. Actually that one was better, but only because of Mel Gibson waxing his legs in the bathroom scene.\n\nThe really annoying thing about this movie though is Diane Keaton's sobbing. I do feel sorry for her, I really do, but does she have to wail like that? My God, I've never heard a more annoying sound in my life. Hrrrrgh. It's funny the first time, but after that it'll just drive you nuts.\n\nStill, you might have a better opinion that mine. Best served with ice cream and company. You don't have to share the ice cream though."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1234370841",
        "name": "Something's Gotta Give",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDM0MjIwYzMtODFhNS00ZWQ0LWEyNTItNTZhNWVhMzdiNWNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDM0MjIwYzMtODFhNS00ZWQ0LWEyNTItNTZhNWVhMzdiNWNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:50:52Z",
        "url": "https://www.imdb.com/video/vi1234370841/"
    },
    "url": "/title/tt0337741/"
}