{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Gemignani",
            "url": "/name/nm0312563/"
        },
        {
            "@type": "Person",
            "name": "American Theater Orchestra",
            "url": "/name/nm3982575/"
        },
        {
            "@type": "Person",
            "name": "Jerry Hadley",
            "url": "/name/nm0352895/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 116,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106966/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066897/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        },
        {
            "@type": "Person",
            "name": "Susan Stroman",
            "url": "/name/nm0834893/"
        },
        {
            "@type": "Person",
            "name": "David M. Thompson",
            "url": "/name/nm0860034/"
        }
    ],
    "datePublished": "1993-03-03",
    "director": [
        {
            "@type": "Person",
            "name": "Kirk Browning",
            "url": "/name/nm0115185/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ0NzM5NzAwNV5BMl5BanBnXkFtZTcwNDI3NTIyMQ@@._V1_.jpg",
    "keywords": "broadway musical as subject,manhattan new york city,wedding day,suitcase,inside joke",
    "name": "Sondheim: A Celebration at Carnegie Hall",
    "original_info": {
        "id": "Sondheim: A Celebration at Carnegie Hall_1993",
        "name": "Sondheim: A Celebration at Carnegie Hall",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chouchoulane"
        },
        "dateCreated": "2003-09-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0262012/"
        },
        "name": "Great, especially for those of us in the sticks.",
        "reviewBody": "Watching this well-nigh perfect Sondheim compendium, I was struck by one incontestable fact: for most of us, these compilation shows (I include \"Putting It Together and \"Side by Side\") ARE Sondheim. Living far from the big centres, we are unlikely to have productions of \"Assassins\" and \"Sunday in the Park with George\" pop up at our local theatres. So we owe a debt of gratitude to this \"Celebration\" for making the cream of Sondheim songs available ; principally, however, for presenting them, as here, in such sublime performances.\n\nThere's Liza, at the top of her game (this is 1992). Even the lady herself would admit that her days of climbing atop grand pianos in Carnegie Hall are, perhaps, (you never know with this gal!) long gone. But watch her with Billy Stritch and those stupendous dancers as she sings (what could be her own 2003 anthem!) \"Back in Business\".\n\nGlenn Close shows how to handle the best known of all Sondheim songs, \"Send in the Clowns\". And, in what can only be described as a touch of choreographic genius, \"Sooner or Later\" has the wonderful Karen Ziemba do a tongue-in-cheek production number on Bill Irwin (Why didn't someone write a sitcom for these two following that performance? It's not too late!) If you like being \"had\", Dorothy Loudon's your girl: watch how she changes tempo, mood, even persona between \"Losing My Mind\" and \"You Could Drive a Person Crazy\".\n\n\"Sweeney Todd\" provides a most effective chilling opening to the show (with the future Mrs. Lovett, the exquisite Patti LuPone, giving herself to \"Being Alive\") Later, the beautifully lyrical voice of Harolyn Blackwell reminds us (with \"Green Finch and Linnet Bird\") that \"Sweeney\" is not all dark and sombre tones.\n\nNaturally, some of my own favourite Sondheim songs are not included. Some turned up in \"Putting It Together\" Others? Well, how about a full-scale revival and DVD-ing of \"Side By Side By Sondheim\"? Are you listening, Mr. Producer? We Sondheim fans out here in the sticks deserve it!"
    },
    "timeRequired": "PT1H25M",
    "url": "/title/tt0262012/"
}