{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julie Strain",
            "url": "/name/nm0001781/"
        },
        {
            "@type": "Person",
            "name": "Greg Wrangler",
            "url": "/name/nm0942010/"
        },
        {
            "@type": "Person",
            "name": "Sandahl Bergman",
            "url": "/name/nm0000922/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 307,
        "ratingValue": 3.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0083952/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022083/"
        },
        {
            "@type": "Person",
            "name": "Richard Styles",
            "url": "/name/nm0836575/"
        }
    ],
    "datePublished": "1999-06-29",
    "description": "In a strange world, a brood of women practicing black magic are lead by Tara, a sorceress. When a man appears there on accident, Tara tries to lure him into her sexual escapades in order to steal his soul.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Styles",
            "url": "/name/nm0836575/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Fantasy",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzMTI2NTQ2OF5BMl5BanBnXkFtZTcwMDE5ODQyMQ@@._V1_.jpg",
    "keywords": "female pubic hair,female frontal nudity,evil woman,lesbian threesome,witch",
    "name": "Sorceress II: The Temptress",
    "original_info": {
        "id": "Sorceress II: The Temptress_1996",
        "name": "Sorceress II: The Temptress",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "templarart"
        },
        "dateCreated": "2004-12-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0190024/"
        },
        "name": "Perfect example of how NOT to make a movie!",
        "reviewBody": "This is probably one of the worst movies ever made. Eliminate the scenes with the girls and it is far and away the WORST movie ever to crawl out of a camera.\n\nNow this is a MUST see for film students on how NOT to make a movie.\n\n1) Watch the dialogue. This movie has enough dialogue for four movies and it is thoroughly unnecessary. Movies are about MOVEment, action, pretty pics and scenes - dialogue is only necessary to set up the action. Take this movie's script and cut out 75% of the dialogue.\n\n2) You paid for hot chicks... USE THEM! Find a way to advance the plot while the girls are putting suntan lotion on each other or helping get each other ready. Having characters just stand around jaw-jacking is inexcusably stupid.\n\n3) PAY for an actor! I don't know where they got this guy but he was NO actor! Even a dumb, campy movie can be sunk with poor acting and seeing as the majority of the action seems to come from this dweeb - why would you hire a non-actor? \n\n4) Realism is important. In one scene, Julie Smith does an incredible strip tease in front of El Dorko ending up on his bed with her legs up. He rolls his eyes and says \"Maybe some other time.\" My wife and I couldn't stop laughing - it was probably one of the dumbest things we'd ever heard! \n\n5) Now this is important: Make the box FIRST then look at it and think. Hmmmm... people want to watch a movie like we have on the box - let's do THAT one!\n\nSeriously - I have no clue how the producer managed to pay for Julie Smith, Julie Strain and yet had no money for a script or male actor.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0190024/"
}