{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gail Thackray",
            "url": "/name/nm0364703/"
        },
        {
            "@type": "Person",
            "name": "Melissa Moore",
            "url": "/name/nm0601611/"
        },
        {
            "@type": "Person",
            "name": "Stacia Zhivago",
            "url": "/name/nm0955706/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2280,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Person",
            "name": "J.B. Rogers",
            "url": "/name/nm0736930/"
        },
        {
            "@type": "Person",
            "name": "Bob Sheridan",
            "url": "/name/nm0792137/"
        },
        {
            "@type": "Person",
            "name": "Mark Thomas McGee",
            "url": "/name/nm0569100/"
        }
    ],
    "datePublished": "1990-10-05",
    "description": "Five college women buy the old Hokstedter place for their new sorority house. They decide to stay in it for the night to meet the movers in the morning, but begin to get the creeps when the weird neighbor starts poking around.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Wynorski",
            "url": "/name/nm0691061/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Comedy",
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQxNTIyMTQxMl5BMl5BanBnXkFtZTgwMjMxNjkwMzE@._V1_.jpg",
    "keywords": "female nudity,female frontal nudity,woman in a bathtub,sorority house,told in flashback",
    "name": "Sorority House Massacre II",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BillyBC"
        },
        "dateCreated": "2003-01-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100663/"
        },
        "name": "More thongs and teddies than you can shake a butcher knife at",
        "reviewBody": "(*1/2 out of *****) I gotta admit -- it was tough giving this one a low score simply for the base reason that viewers are treated to an absolute cavalcade of bodacious babes in the skimpiest of lingerie, and every single one of them has her own topless scene to boot. But, I gotta be true to myself and rate this according to how it represents the horror/slasher genre, and, unfortunately, it's represented pretty poorly with this derivative junk. This was released the same year as Wynorski's Hard To Die, and both movies have some of the same actors and use flashbacks from the original Slumber Party Massacre rather than the first SHM (don't ask me why.) The plots are also nearly identical, right down to the ho-hum demon posession that's thrown in for laughs. Orville Ketchum also repeats the same role he played in Hard To Die. I don't know if his character is supposed to provide comic relief or what, but, under Wynorski's terrible direction (as in Hard To Die), he gets real tiresome real fast. Overall, this is a poorly-written, highly exploitative, and frustratingly tedious mess, but -- damn me for being a sexist male -- them girls is hot!\n\nHIGHLIGHT: Not to beat this thing into the ground, but I honestly don't think this flick goes five minutes without a gratuitous T&A shot (or two). I need to get out more. ..."
    },
    "url": "/title/tt0100663/"
}