{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rory Cochrane",
            "url": "/name/nm0168262/"
        },
        {
            "@type": "Person",
            "name": "Rossie Harris",
            "url": "/name/nm0365283/"
        },
        {
            "@type": "Person",
            "name": "Beth Orton",
            "url": "/name/nm0651347/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 249,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "alternateName": "Southlander",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058765/"
        },
        {
            "@type": "Person",
            "name": "Steve Hanft",
            "url": "/name/nm0359840/"
        },
        {
            "@type": "Person",
            "name": "Rossie Harris",
            "url": "/name/nm0365283/"
        },
        {
            "@type": "Person",
            "name": "Bob Stephenson",
            "url": "/name/nm0827307/"
        }
    ],
    "datePublished": "2001-03-21",
    "description": "Chance, a hapless Los Angeles musician is searching for the coveted Moletron synthesizer through the classified ad paper the \"Southlander\", and meeting interesting characters along the way",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Hanft",
            "url": "/name/nm0359840/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Drama",
        "Music",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAwMzUzMTQzNF5BMl5BanBnXkFtZTcwOTIzNzAzMQ@@._V1_.jpg",
    "keywords": "musician",
    "name": "Southlander: Diary of a Desperate Musician",
    "original_info": {
        "id": "Southlander: Diary of a Desperate Musician_2001",
        "name": "Southlander: Diary of a Desperate Musician",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "woody-85"
        },
        "dateCreated": "2004-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0278044/"
        },
        "name": "charmingly awful",
        "reviewBody": "Well first, it's probably best not to recommend this movie if you're not excited to see famous cameos from the Los Angeles indie music scene, or if you have inside information about why this movie was made other than thinking \"oh, I live in LA, i have a lot of cool musician friends, i should do a film with them\" - i couldnt figure it out myself.\n\nWhat if you are an indie music geek then?\n\nWell, the story is a bit like \"philip marlowe wants to play keyboards in a band\". But i don't necessarily mean that in a good way. The good thing is that it might give you the motivation to re-watch \"the long goodbye\" by Robert Altman. The bad thing is that you *will* keep wondering whether there is an inside joke to this film, or if this is a film school project thing.\n\nIt has to be said, this is *VERY LOW* fi. i can't believe they still manufacture cameras that can give you such a bad image, though. I'm just saying this is not just about the lack of money and staff. Seriously, when characters move 3 feet away from the camera, it gets blurry. The acting is awful all the way through, with the noticeable exception of Beck, who comes out okay. Even Gregg Henry, whose appearance is quite a nice at surprise at first, is very disappointing. A special mention for the framing, i found it schockingly lazy and inexperienced all the way through. And not only you do not expect that kind of inexperience even for a first time moviemaker, you do not expect that kind of inexperience from somebody who loves films and has seen lots of them. I do not know how much time, money and staff was put into this project, but it seems hard to forgive it all.\n\nNow why on earth did i find it all quite charming? I am not able to phrase it. Well of course, the cameos. But also i guess some kind of sparkle to it. The script is crap, and well the directing is awful. But i guess maybe the idea for the script? The general tone?\n\nHow did i manage to watch it all the way through (and i did!) other than the fact that elliott smith only appears in the last 3 minutes? I'm not joking, i found it all quite entertaining.\n\ni'm not sure why!\n\nCertainly not a film i would generally recommend, but *some* people might enjoy *some* of it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0278044/"
}