{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kei Tomiyama",
            "url": "/name/nm0866753/"
        },
        {
            "@type": "Person",
            "name": "Gorô Naya",
            "url": "/name/nm0623214/"
        },
        {
            "@type": "Person",
            "name": "Shûsei Nakamura",
            "url": "/name/nm0620138/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 635,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "alternateName": "Space Battleship Yamato",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0095311/"
        },
        {
            "@type": "Person",
            "name": "Leiji Matsumoto",
            "url": "/name/nm0559535/"
        },
        {
            "@type": "Person",
            "name": "Yoshinobu Nishizaki",
            "url": "/name/nm0632827/"
        },
        {
            "@type": "Person",
            "name": "Eiichi Yamamoto",
            "url": "/name/nm0945412/"
        }
    ],
    "datePublished": "1974-10-05",
    "description": "In the year 2199, the space battleship Yamato embarks on a voyage to the planet Iscandar, to retrieve a device that will rejuvenate a war-ravaged Earth.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGI0YWQ1ZGMtYTFkMC00NWEyLTk1MmItOTI1MDQwNGJiOGQwXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "anime animation,battleship,galaxy,spaceship,adapted into a manga",
    "name": "Uchû senkan Yamato",
    "original_info": {
        "id": "Space Battleship Yamato: The Movie_1974",
        "name": "Space Battleship Yamato: The Movie",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kdavies-69347"
        },
        "dateCreated": "2016-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0140644/"
        },
        "name": "The Grand Daddy of Space Adventure Anime",
        "reviewBody": "Space Battleship Yamato, or Starblazers as it was known in the U.S and most of Europe, is in many ways the precursor for a number of Japanese Animation Series that followed space adventure themes. Gundam, Macross, Evangelion all owe this late 70's series homage in terms of theme and design.\n\nIn the year 2199, the Earth has been under a devastating attack from an ancient and distant race of humanoids known as the Gamilas. They have bombarded earth with radioactive meteorites that has devastated the surface of our planet, and the only remaining people left live in underground cities. Soon, Russia, England, and North America cities collapse and the Earth has less than a year to survive. The Earth Defense Fleet have one last shot. Contacted by a distant race, on a planet known as Iscandar, the human race's last chance at survival lies in alien hands. Soon the inhabitants of Earth focus all their energy on re-purposing the former WWII battleship Yamato with the blueprints given to us in that distant and alien message. We develop the Wave Motion Gun, capable of destroying entire fleets, and the Wave Motion Engine which allows the Yamato to travel faster than the speed of light using tachyon energy. 114 men depart, and they must travel further than any known ship in history, to save the Earth before it is too late.\n\nAs far as Anime Goes, it's a wild story without any doubt, but it holds a certain level of nostalgia for the Japanese. While I was living there, most of my friends (and even their parents) could recite word for word the opening title sequence. It's an excellent example of Japanese pride and nationalism throughout this fun series. Families that I spoke to about the series, often told me stories of watching Yamato with their parents and then showing the series to their own children as adults, bridging generations with the same story line. Of course, the level of animation can leave something to be desired in comparison to the more fluid animations of the 90's and CGI that seems to have taken over this generation in the last decade, but it is without a doubt one of the seminal series you need to watch if you consider yourself a fan of the genre.\n\nPersonally, I thought the last two episodes of the first season were rushed, and there is so much more story after the first 26 episodes are over. The mission these men and women (well... one anyway), is a bold one. Suicidal almost. It is lighthearted, but also has it's very dark moments as well. The mission is a very serious one, but every episode has its own plot line leading up to a major Anime event, making the Yamato a ship to be feared by its enemies, when they have had the upper hand for so long. The theme remains the same throughout the series, and it has a lot of heart. Work hard, listen to those with more experience than you, trust your instincts, there are a number of messages to learn throughout the series.\n\nIt's an excellent place to begin if you're a new fan, even in this generation. If you've never seen it, give it a watch, it is a long series if you delve into it, but well worth it by the end.\n\n7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0140644/"
}