{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Adam Sandler",
            "url": "/name/nm0001191/"
        },
        {
            "@type": "Person",
            "name": "Téa Leoni",
            "url": "/name/nm0000495/"
        },
        {
            "@type": "Person",
            "name": "Paz Vega",
            "url": "/name/nm0891895/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 85945,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035761/"
        },
        {
            "@type": "Person",
            "name": "James L. Brooks",
            "url": "/name/nm0000985/"
        }
    ],
    "datePublished": "2004-12-17",
    "description": "A woman and her daughter emigrate from Mexico for a better life in America, where they start working for a family where the patriarch is a newly celebrated chef with an insecure wife.",
    "director": [
        {
            "@type": "Person",
            "name": "James L. Brooks",
            "url": "/name/nm0000985/"
        }
    ],
    "duration": "PT2H11M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgyMzc0MjgyOV5BMl5BanBnXkFtZTYwNTgxOTk2._V1_.jpg",
    "keywords": "car,cadillac,cadillac escalade,jeep,jeep grand cherokee",
    "name": "Spanglish",
    "original_info": {
        "id": "Spanglish_2004",
        "name": "Spanglish",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KissEnglishPasto"
        },
        "dateCreated": "2022-01-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0371246/"
        },
        "name": "Spanglish... A Film That Speaks an International/Universal Language!",
        "reviewBody": "There is most certainly something in Spanglish for every member of your family! The cast is fabulous. Spaniard Paz Vega appears quite natural and convincing as Mexican Flor Moreno. Adam Sandler shows definite versatility as both a dramatic and comedic actor. Tea Leoni, here almost outshines everyone in her role of a rather endearing but neurotic American housewife. And the young, Shelbie Bruce, playing the role of Flors daughter, Cristina, waxes totally bilingual/bicultural.\n\nHowever, do not let your pre-viewing expectations get too high! Regardless of being a must see film for all Hispanics who live, have lived or who have had an extended stay in the U. S., Spanglish does have its faults! Producer/director/writer, James L. Brooks, despite having directed such classics as Broadcast News, As Good As It Gets and Terms of Endearment, seems that here there are moments he became too enamored of his own work, causing some excesses. The film drags a bit at over 2 hours. It would have been a more enjoyable film if Brooks had left at least 10 or 15 minutes on the cutting room floor.\n\nIn most of the standard areas one eveluates regarding the production values used in making Spanglish... It seems that just about all of them are quite acceptable. Probably even a tad better than most!\n\nHowever, Spanglish does suffer from moments of rather lackluster script-writing and direction of its principle characters, with too many mugging facial close-ups. These exaggerated expressions often did not seem the least bit natural. Spanglish also would like to convince us that someone can go from a beginner in English to someone with tremendous proficiency in a breezy 2 or 3 months! That seems like quite a lot of Suspension of Disbelief! If it were that easy, we would all speak five languages, right? Despite the few weaknesses highlighted here, Spanglish is guaranteed to impact you a lot! 7*******\n\nThis review was redacted after going over the IMDb guidelines for submitting Reviews with the utmost intensive and extreme care. I am certain that it meets all the standards and points mentioned therein. So most certainly...I hope this Review will meet with Your approval and considered to be Helpful.....Enjoy!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT3M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi462029081",
        "name": "Spanglish",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDE5MGJmNDktZDFmMS00NDY3LWE3YmEtYzdiMjU4MzM2MjMxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDE5MGJmNDktZDFmMS00NDY3LWE3YmEtYzdiMjU4MzM2MjMxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:12:58Z",
        "url": "https://www.imdb.com/video/vi462029081/"
    },
    "url": "/title/tt0371246/"
}