{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mary Pickford",
            "url": "/name/nm0681933/"
        },
        {
            "@type": "Person",
            "name": "Roy Stewart",
            "url": "/name/nm0829795/"
        },
        {
            "@type": "Person",
            "name": "Mary Louise Miller",
            "url": "/name/nm0588928/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1399,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064360/"
        },
        {
            "@type": "Person",
            "name": "Winifred Dunn",
            "url": "/name/nm0242802/"
        },
        {
            "@type": "Person",
            "name": "George Marion Jr.",
            "url": "/name/nm0547938/"
        },
        {
            "@type": "Person",
            "name": "C. Gardner Sullivan",
            "url": "/name/nm0837989/"
        }
    ],
    "datePublished": "1926-09-06",
    "description": "Molly, the eldest child at a baby farm hidden deep in a swamp, must rescue the others when their cruel master decides that one of them will be disposed of.",
    "director": [
        {
            "@type": "Person",
            "name": "William Beaudine",
            "url": "/name/nm0064415/"
        },
        {
            "@type": "Person",
            "name": "Tom McNamara",
            "url": "/name/nm0573743/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY3MTkyMTc0MF5BMl5BanBnXkFtZTgwOTI5MDgwMjE@._V1_.jpg",
    "keywords": "baby,alligator,blanket,doll,letter",
    "name": "Sparrows",
    "original_info": {
        "id": "Sparrows_1926",
        "name": "Sparrows",
        "year": "1926"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Stormy_Autumn"
        },
        "dateCreated": "2006-09-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0017423/"
        },
        "name": "Sob...tissue, please...quick!",
        "reviewBody": "I've blown my nose through many a verifiable 'tear-jerker' but this was my first 'silent' sniffling:\n\n\"Sparrows\" (1926) was directed by William Beaudine. Winifred Dunn wrote the story.\n\nIt was a drama about the very evil Mr. Grimes. He stole and kept poor orphans as \"slave labor\" on his farm. It's location was deep in a swamp in a southern U.S. state (one with alligators). They were used as his work force to keep the farm work done. Young Molly was the oldest and lovingly cared for the children. \n\nOne day Grimes and his crooked cronies kidnapped the small daughter of a wealthy man. (The word 'wealthy' tells you why.) Molly added little Doris to her heart and care. Then she learned that the police were closing in on finding the baby. Grimes had ordered her thrown into the swamp. The children grouped around Molly to save the little one. There was a daring rescue and escape. Molly took all the children with her through the swamp. (Take about edge of the seat and a box of tissues.) Did they make it out? Was there a happily-ever-after ending? I hope you'll get to find out. (I've seen this on Turner Classic Movies twice. It's wee worth your time.)\n\nCast:\n\nMary Pickford played Molly; Roy Stewart played Dennis Wayne ;Mary Louise Miller was Doris Wayne (the baby); Gustave von Seyffertitz was Mr. Grimes. \n\nThis was Mary Pickford's last film in which she played a young girl. Her fans had trouble letting her grow into adult parts. Since she was already involved in United Artists (founded with Douglas Fairbanks, D.W. Griffith, and Charles Chaplin) she turned to producing. Although she did try directing once: \"Dorothy Vernon of Haddon Hall\" (1924)\n\n\"Make them laugh, make them cry, and back to laughter. What do people want to go to the theatre for? An emotional exercise... I am a servant of the people. I have never forgotten that.\" A Quote from Mary Pickford.\n\n\"I don't make jokes. I just watch the government and report the facts.\" Will Rogers"
    },
    "url": "/title/tt0017423/"
}