{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tobey Maguire",
            "url": "/name/nm0001497/"
        },
        {
            "@type": "Person",
            "name": "Kirsten Dunst",
            "url": "/name/nm0000379/"
        },
        {
            "@type": "Person",
            "name": "Willem Dafoe",
            "url": "/name/nm0000353/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 831282,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0095134/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0095403/"
        },
        {
            "@type": "Person",
            "name": "Stan Lee",
            "url": "/name/nm0498278/"
        },
        {
            "@type": "Person",
            "name": "Steve Ditko",
            "url": "/name/nm0228492/"
        },
        {
            "@type": "Person",
            "name": "David Koepp",
            "url": "/name/nm0462895/"
        }
    ],
    "datePublished": "2002-05-03",
    "description": "After being bitten by a genetically-modified spider, a shy teenager gains spider-like abilities that he uses to fight injustice as a masked superhero and face a vengeful enemy.",
    "director": [
        {
            "@type": "Person",
            "name": "Sam Raimi",
            "url": "/name/nm0000600/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDEyN2NhMjgtMjdhNi00MmNlLWE5YTgtZGE4MzNjMTRlMGEwXkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1_.jpg",
    "keywords": "superhero,peter parker character,ben parker character,spider man character,superhero action",
    "name": "Spider-Man",
    "original_info": {
        "id": "Spider-Man_2002",
        "name": "Spider-Man",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2002-11-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0145487/"
        },
        "name": "DVD review - yep, definitely a fun movie, and a great DVD to own.",
        "reviewBody": "Breaking with usual tradition, the \"Spider-Man\" DVD was released today, a Friday. At around $15 almost everywhere, for the 2 disk set, it was too good a bargain to pass up. I hadn't seen the film in theaters so this was my first viewing. Definitely entertaining, with a good mix of action and budding romance, the film of the beginnings of Spider-Man. Although I was a bigger fan of Superman as a kid, I also have good memories of the Spider-Man comics, and this film is very faithful.\n\nno SPOILERS here - The 2 disk DVD set is one of the better ones. The picture itself is extremely sharp, and very colorful, with a very clear and dynamic Dolby 5.1 sound track. Surround sound complements the picture masterfully, so that the viewer seems right in the middle of the action. **POINT** - As I have explained in other reviews, anyone still watching movies at home on VHS needs to get rid of it now! It is a different movie on DVD, the quality of the picture, the quality of the sound, not to mention all the extras. With a widescreen TV it is almost like being in a theater.\n\nThe EXTRAS - In addition to the movie, disk one has a feature that pops up a spider icon at certain spots that, when \"clicked\", jumps you to a brief \"making of\" segment for that scene, then jumps you back to the movie. Plus there are two different, selectable commentaries for anyone who likes the re-watch a movie and hear what went into its making.\n\nDisk two is completely devoted to \"extras\", like screen tests, an HBO special, and other aspects of making \"Spider-Man.\" Also included is an archive of Spider-Man comics covers from the 1960s to now, grouped by decade, and written script to summarize the basic story of each issue. A \"must have\" for all Spider Man comics fans.\n\nThere have been a few user reviews on IMDb, usually very short, which trash this movie, and may even say something like \"avoid this movie\". Be certain those are \"bogus\" reviews, written for some deceptive purpose, I know not why. For anyone who enjoys any kind of fantasy action movie with a good message, \"Spider-Man\" is a definite \"must-see.\""
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When bitten by a genetically modified spider, a nerdy, shy, and awkward high school student gains spider-like abilities that he eventually must use to fight evil as a superhero after tragedy befalls his family.",
        "duration": "PT2M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1376109081",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGI0YmNjOTYtN2FiOC00ZjYxLWJkOWEtYTdiNjczOTZlNGQ0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGI0YmNjOTYtN2FiOC00ZjYxLWJkOWEtYTdiNjczOTZlNGQ0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-08-05T20:07:14.998Z",
        "url": "https://www.imdb.com/video/vi1376109081/"
    },
    "url": "/title/tt0145487/"
}