{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Erin Brown",
            "url": "/name/nm0612691/"
        },
        {
            "@type": "Person",
            "name": "Julian Wells",
            "url": "/name/nm1198632/"
        },
        {
            "@type": "Person",
            "name": "Darian Caine",
            "url": "/name/nm0128986/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 917,
        "ratingValue": 4.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0090813/"
        },
        {
            "@type": "Person",
            "name": "John Paul Fedele",
            "url": "/name/nm0070216/"
        },
        {
            "@type": "Person",
            "name": "Terry M. West",
            "url": "/name/nm1066849/"
        }
    ],
    "datePublished": "2005-05-27",
    "description": "A socially awkward young woman gets bitten by a radioactive spider and becomes a crime-fighting superhero and tries to defeat a nefarious super villain while going after any man (or woman) she wants to bed down with.",
    "director": [
        {
            "@type": "Person",
            "name": "Johnny Crash",
            "url": "/name/nm1223664/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Adventure",
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2E1MTQ2YjEtNmY4YS00ZjcwLWJiZWItNjhjZDg3MThmZTlhXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "softcore,psychotronic film,superhero,female rear nudity,female full frontal nudity",
    "name": "SpiderBabe",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "juliankennedy23"
        },
        "dateCreated": "2005-05-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0350146/"
        },
        "name": "Does Whatever a Spider Can?",
        "reviewBody": "Spiderbabe: 7/10: It is important to note I am comparing Spiderbabe to other films in the naked lesbian chicks that guys like to watch genre. I am not comparing it to other big budget superhero movies (though it is better than Daredevil or Catwoman) or movie parodies (nice to see one without Leslie Nielson though), nope strictly the soft-core lesbian porn for guys genre. In that category Spiderbabe is certainly well above average. \n\nWhile not as good as say Lord of the G-strings or Embrace of the Vampire it marks a vast improvement over two recent Misty Mundae films, the equally atrocious Lust for Dracula and New York Wildcats. Unlike those two films you won't be fast-forwarding through the plot. Come to think of it unlike those two films you won't be fast-forwarding throughout the sex scenes either. \n\nSpiderbabe doesn't suffer from the \"good lord put your clothes back on honey\" third tier actresses that often appear in these films. All the girls here are quite attractive. Yet strangely, since the lesbian sex scenes are not the most inventive ever created and there is no real erotic tension between the characters, it is the filler that stands out the most.\n\nSpiderbabe is a surprisingly expansive point-to-point deconstruction of the first Spiderman movie. Everything from the tryout as a wrestler to the battle with the Green Goblin is given an erotic twist. And you'll never guess from where Spiderbabe shoots her web (hint it isn't her wrists). \n\nWhile not as funny as G-Strings or erotic as Embrace, Spiderbabe deftly mixes lesbian sex scenes and spot on parody into an entertaining romp. If you like your lesbian porn with humor or for that matter your humor with attractive naked chicks Spiderbabe is for you. And lets all hope no one does an erotic remake of the Hulk shall we.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0350146/"
}