{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rudolf Klein-Rogge",
            "url": "/name/nm0459030/"
        },
        {
            "@type": "Person",
            "name": "Gerda Maurus",
            "url": "/name/nm0561276/"
        },
        {
            "@type": "Person",
            "name": "Willy Fritsch",
            "url": "/name/nm0295992/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3741,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Spies",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136934/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021661/"
        },
        {
            "@type": "Person",
            "name": "Thea von Harbou",
            "url": "/name/nm0902376/"
        },
        {
            "@type": "Person",
            "name": "Fritz Lang",
            "url": "/name/nm0000485/"
        }
    ],
    "datePublished": "1929-03-10",
    "description": "The mastermind behind a ubiquitous spy operation learns of a dangerous romance between a Russian lady in his employ and a dashing agent from the government's secret service.",
    "director": [
        {
            "@type": "Person",
            "name": "Fritz Lang",
            "url": "/name/nm0000485/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjQxMjk2NzIwMl5BMl5BanBnXkFtZTgwMDM1MTA5MTE@._V1_.jpg",
    "keywords": "cigarette smoking,pipe smoking,cigar smoking,orient express,letter",
    "name": "Spione",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2011-01-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0019415/"
        },
        "name": "An Epic of Espionage, Romance, Seduction and Betrayal",
        "reviewBody": "The powerful criminal and leader of a spy ring Haghi (Rudolf Klein- Rogge) uses his spies that are infiltrated everywhere including in the secret service in attempts to steal documents from the French Embassy in Shanghai and from the Minister of Trade that is murdered. The press questions and mocks the officials in charge of security of state and the efficient Agent No. 326 a.k.a. the vagrant Hans Pockzerwinski (Willy Fritsch) is summoned by the Secret Service Chief (Craighall Sherry) to investigate the wave of crimes. Agent 326 immediately identifies that his chief's assistant Vincent is a spy that is providing inside information to the evil mastermind that no one knows how looks like. Meanwhile, Haghi saves the scoundrel Hans Morrier (Louis Ralph) from the gallows to serve him. Then Haghi, who is also the general director of the Haghi Bank, blackmails Mrs. Leslane (Hertha von Walther), who is the wife of the powerful Roger Lesland and habitué of an opium den, to get information of the Japanese Secret Treaty. When Haghi assigns his master spy Sonya Baranilkowa (Gerda Maurus) to get closer to the elegant Agent No. 326, they unexpectedly fall in love for each other affecting Haghi's evil scheme. Meanwhile his spy Kitty (Lien Deyers) lures and seduces the reserved and efficient Japanese agent Akira Matsumoto (Lupu Pick) to steal his documents about the recently signed Treaty that may bring war to the world.\n\n\"Spies\" is a fantastic epic of espionage, romance, seduction and betrayal by Fritz Lang and I dare to say that James Bond stories might have been inspired in this film. I saw \"Spies\" yesterday in a restored authorized edition of the DVD released by Kino Video, and in the Extras there is the amazing story of the restoration of this film. The 35 mm archives in nitrate throughout the world were very damaged and incomplete, but this complex version was assembled from several copies using the guidance of the copy from Prague that was the most complete and also deteriorated. The result is a film of 143 minutes running time meaning 50 minutes longer than any version previously released. My vote is eight.\n\nTitle (Brazil): \"Os Espiões\" (\"The Spies\")",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "SPIES: strange events (US)",
        "duration": "PT1M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi967296025",
        "name": "SPIES: strange events (US)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmJmNmRhMTEtZmI3My00NjEyLTgxOTktM2Y1NzNlZTY4ZjZhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmJmNmRhMTEtZmI3My00NjEyLTgxOTktM2Y1NzNlZTY4ZjZhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-02-17T21:36:18.992Z",
        "url": "https://www.imdb.com/video/vi967296025/"
    },
    "url": "/title/tt0019415/"
}