{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Goldblum",
            "url": "/name/nm0000156/"
        },
        {
            "@type": "Person",
            "name": "Anthony LaPaglia",
            "url": "/name/nm0001439/"
        },
        {
            "@type": "Person",
            "name": "Liev Schreiber",
            "url": "/name/nm0000630/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1239,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023848/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052980/"
        },
        {
            "@type": "Person",
            "name": "Yuri Zeltser",
            "url": "/name/nm0954693/"
        },
        {
            "@type": "Person",
            "name": "Grace Cary Bickley",
            "url": "/name/nm0081060/"
        }
    ],
    "datePublished": "2003-10-23",
    "description": "Russian political elite hires American consultants to help with President Yeltsin's re-election campaign when his approval rating is down to single digits.",
    "director": [
        {
            "@type": "Person",
            "name": "Roger Spottiswoode",
            "url": "/name/nm0006854/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4ODEwNjI2NV5BMl5BanBnXkFtZTcwNDk0MTcyMQ@@._V1_.jpg",
    "keywords": "1990s,election,president,year 1996,businessman",
    "name": "Spinning Boris",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MDM-4"
        },
        "dateCreated": "2004-03-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0324619/"
        },
        "name": "Vodka and Voting, Through American Eyes",
        "reviewBody": "Released in the US at the time of another Russian Presidential election, \"Spinning Boris\", is a humorous, fact-based dramatization of the 1996 Russian Presidential election, directed by Roger Spottiswoode (who also directed the Bond film, \"Tomorrow Never Dies,\" and the bio-pic \"Noriega: God's Favorite\").\n\nThe first post-Soviet election in Russia pitted Boris Yeltsin, a man once considered a hero but now, after five years of attempted coups, hyperinflation, and war in Chechnya, has lower approval ratings than Stalin, against political opponents ranging from kooky (the xenophobic Vladimir Zhirinovsky, who wants to retake Alaska), to Communist (Gennady Zyuganov, who vows to restore the Soviet Union). In Yeltsin's view (and that of some powerful forces on both sides of the Atlantic) the future of Russia is at stake: do people want to live with the challenges and opportunities of free choice, or fall back to the failed Communist system (along with newly wealthy oligarchs losing their power).\n\nHow can a candidate be \"guaranteed\" victory in a democracy? Hire the best political advisors money can buy, in this case George Gorton (Jeff Goldblum), Dick Dresner (Anthony LaPaglia), and Joe Shumate (Liev Schreiber, playing a more open operative than in his last Russian adventure, \"The Sum of All Fears,\" and proving himself a master in the political movies genre).\n\n The three American political consultants (one of whom, Gorton, recently led Arnold Schwarzenegger's successful gubernatorial campaign) are masters at showing how politics can be manipulated, or fine tuned. \"Spinning Boris\" shows the idealism and naivete of Russia's fledging democracy in 1996, primarily through the eyes of his daughter, Tatiana Dyachenko (played by the sensuously dignified Svetlana Efremova, known to political drama junkies through an appearance as a Russian journalist in \"The West Wing\").\n\n The main difference between history and the plot of this film is that the script overplays the political naivete of Russians far too much. After all, it was Yeltsin's main opponent, the Communist Zyuganov, who said in 1995, \"You should understand that a clever propaganda worker and a skilled politician will never talk in the same language with different audiences.\" If the Soviet era proved anything, it is that Russians are masters at telling an audience what it wants to hear. The movie does prove that Americans are good at reviving a stale product, in this case a Presidential candidate, Yeltsin, who offers a clear (and clearly superior) alternative to his opponents, men who reach back into the \"ash heap of history\" for their political platform.\n\n\"Spinning Boris\" perpetuates some negative stereotypes about Russia. For instance: the President Hotel is not 5-Star quality; people did not walk around with machine guns in 1996; the SOVIET national anthem was not in use during the Yeltsin era; and why did the Americans sing the \"Internationale,\" the song of world Communism, as they leave Moscow? There are, however, some wonderful street scenes throughout the entire movie, and the cinematography manages to capture some of the exoticness and beauty of Moscow, the world's most unique city (although most of the interior shots were filmed in Toronto).\n\nIt is great to have a dramatization of what is for Americans an obscure political event, but one that had far-reaching repercussions. Movies are often the only way that a historic event is remembered; by their nature a political drama will be abridged and truncated (this is true of documentaries as well). Hopefully people watching this movie won't believe that today's Russia is as close to the brink of collapse as it is depicted here. Like \"Primary Colors,\" the movie (and novel) which gave great understanding into the 1992 Clinton campaign, \"Spinning Boris\" gives humorous insight into the Russian political scene during its early democratic years."
    },
    "url": "/title/tt0324619/"
}