{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Arnott",
            "url": "/name/nm1525692/"
        },
        {
            "@type": "Person",
            "name": "Pia Regina Brechmann",
            "url": "/name/nm1503400/"
        },
        {
            "@type": "Person",
            "name": "Ramin Eshraghi-Yazdi",
            "url": "/name/nm1503467/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Danis Goulet",
            "url": "/name/nm1118229/"
        }
    ],
    "description": "A love story between a DJ and his most sought-after record.",
    "director": [
        {
            "@type": "Person",
            "name": "Danis Goulet",
            "url": "/name/nm1118229/"
        }
    ],
    "duration": "PT7M",
    "genre": [
        "Comedy",
        "Short"
    ],
    "name": "Spin",
    "original_info": {
        "id": "Spin_2004",
        "name": "Spin",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "one_more_day"
        },
        "dateCreated": "2005-05-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0390505/"
        },
        "name": "guy goes to budapest, gets stranded and then has to make enough cash to buy a ticket home",
        "reviewBody": "I saw this movie at the 2004 seattle international film festival, and i thought it was pretty cool. you'll probably like this movie if you've gone to parties or have been down with the electronic music scene. i think this dj dude goes to budapest and somehow fall into djing weird hungarian music for some traditional party. anyways, that's only a smidgen of all the off the wall mischief this guy gets into. stuff with pornstars, getting chased by cops, and all sorts of wackiness -even a little flash of bestiality- just kidding. other than all the crazy action, the music in this film is freaking awesome. lots of dope beats in this, mostly breaks i believe. i forget how this movie ends, but i thought it was an alright movie compared to all the other artsy crap that was at the festival. some people try so hard to make a poignant statement, but the makers of this film pretty much captured an exciting story about some American dude going to hungary and having quite an adventure. go see it;)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0390505/"
}