{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jane Fonda",
            "url": "/name/nm0000404/"
        },
        {
            "@type": "Person",
            "name": "Brigitte Bardot",
            "url": "/name/nm0000003/"
        },
        {
            "@type": "Person",
            "name": "Alain Delon",
            "url": "/name/nm0001128/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6633,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Spirits of the Dead",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020435/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037407/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013844/"
        },
        {
            "@type": "Person",
            "name": "Edgar Allan Poe",
            "url": "/name/nm0000590/"
        },
        {
            "@type": "Person",
            "name": "Roger Vadim",
            "url": "/name/nm0671862/"
        },
        {
            "@type": "Person",
            "name": "Pascal Cousin",
            "url": "/name/nm0184046/"
        }
    ],
    "datePublished": "1969-07-23",
    "description": "A trio of Edgar Allan Poe adaptations about a cruel countess haunted by her cousin's stallion, a sadistic soldier haunted by his doppelgänger, and an alcoholic actor haunted by the Devil.",
    "director": [
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        },
        {
            "@type": "Person",
            "name": "Louis Malle",
            "url": "/name/nm0001501/"
        },
        {
            "@type": "Person",
            "name": "Roger Vadim",
            "url": "/name/nm0671862/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzg0Njk5Y2EtMDk4ZC00ODcwLTk2NDUtNjA0YTA0ODA1YWViXkEyXkFqcGdeQXVyNTcwNjUwNzk@._V1_.jpg",
    "keywords": "horror anthology,gothic horror,based on short story,horse,woman smokes a cigar",
    "name": "Histoires extraordinaires",
    "original_info": {
        "id": "Spirits of the Dead_1968",
        "name": "Spirits of the Dead",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "winkies"
        },
        "dateCreated": "2005-03-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063715/"
        },
        "name": "Young Fondas In Love, A Gorgeous Villain, and Toby Dammit",
        "reviewBody": "I'm a big fan of horror anthologies, especially the Poe/Hawthorne ones from Roger Corman and the Amicus films. Spirits of the Dead, based on Edgar Allen Poe stories and directed by Europe's most acclaimed filmmakers of the time, didn't disappoint...well, except for the first story.\n\n#1, \"Metzengerstein,\" directed by Roger Vadim. A cruel nymphomaniac countess (Jane Fonda) destroys the one man she can't have (Peter Fonda). That's right, this segment's biggest distinction is that it features a romance between real-life siblings Jane & Peter. Maybe I'm just a boor with no appreciation of high art, but watching those two gaze longingly at each other gave me the serious skeeves. Somewhere amongst the implied incest, the near- implied bestiality, and Jane's leftover costumes from Barbarella is the very thinnest of plots and narrative structure. Vadim doesn't seem to have any comprehension of suspense or what it takes to present a story that, if not scary, is at least spooky. You'll be constantly looking at your watch, but don't let \"Metzengerstein\" discourage you from seeing the other two stories.\n\n#2, \"William Wilson,\" directed by Louis Malle. An angel-faced but throughly rotten and sadistic man (Alain Delon) is hounded by a mysterious man that shares his name. This was a tight, satisfying little story. In contrast to Vadim, Malle is so talented at the art of suspense that he can make a simple card game exciting. Some reviewers have been put off by the scenes of misogyny--and to be honest, they did seem to spill over into exploitation. But I think it was necessary to present just how horrible the main character was, and to contrast it with how attractive he is physically (which to me was the most fascinating aspect of the segment). I found the ending slightly confusing, but still effective & tragic.\n\n#3, \"Toby Dammit,\" directed by Federico Fellini. This segment is so virtuoso and packed with Higher Meaning and Symbolism and Commentary On The Nature Of Man, God and the Devil that it really feels like its own movie. A jaded, alcoholic actor is invited to Rome to film a spaghetti western based on the life of Jesus Christ and attend a bizarre Italian version of the Oscars. The world as seen through Toby's eyes is populated with freaks, liars, and soulless puppets-- no wonder he prefers the Devil (uniquely and quite chillingly presented as a little girl). The scene where he is driving the Ferrari is a little overlong, but the ending is quite jarring and the last shot one of the unforgettable images of cinematic horror. The only real negative is that Terrance Stamp, who gives an incredible performance, has his voice completely dubbed by a French actor. If only we could have heard his own voice! It would be nice if Criterion could put this segment out on its own and give it the attention & study it deserves.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0063715/"
}