{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kathleen Robertson",
            "url": "/name/nm0005370/"
        },
        {
            "@type": "Person",
            "name": "Johnathon Schaech",
            "url": "/name/nm0000628/"
        },
        {
            "@type": "Person",
            "name": "Matt Keeslar",
            "url": "/name/nm0444832/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3467,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0133312/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130502/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0082027/"
        },
        {
            "@type": "Person",
            "name": "Gregg Araki",
            "url": "/name/nm0000777/"
        },
        {
            "@type": "Person",
            "name": "Jill Cargerman",
            "url": "/name/nm0137075/"
        }
    ],
    "datePublished": "2000-05-12",
    "description": "Veronica, 22, meets a writer and a drummer hunk at a club on Halloween. Why choose when she can have both? 3some? But then a third man comes along.",
    "director": [
        {
            "@type": "Person",
            "name": "Gregg Araki",
            "url": "/name/nm0000777/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjBjMzJmMGYtNTUzNC00OTI5LTlkN2EtNDgyYTVlZmJiOWU2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "one female two males threesome,halloween,halloween costume,sex comedy,lgbtq film",
    "name": "Splendor",
    "original_info": {
        "id": "Splendor_1999",
        "name": "Splendor",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aimless-46"
        },
        "dateCreated": "2005-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0127296/"
        },
        "name": "What's that you say Ms. Robertson",
        "reviewBody": "I was not conscious of \"Splendor\" being a Gregg Araki film when I started watching it but after the first two sequences I was thinking: \"this is great directing-who did this\"? While the technique screams \"Araki\", as does the casting of Kathleen Robertson, the narrative is so conventional that you find the combination hard to reconcile. I loved an earlier comment that \"Splendor\" is like a John Hughes remake of \"The Doom Generation\"; i.e. very conventional and without the sex and violence, with a three-way relationship (two males-one female), Johnathon Schaech, and Director Araki's absolutely amazing production and post-production skills-along with his less than dazzling scripting.\n\nAlthough Araki is paying homage to the great screwball comedies of the 1930's: \"Topper\", \"It Happened One Night\", \"The Awful Truth\", and \"Bringing Up Baby\"; the style and substance of \"Splendor\" is closer to Mike Nichols' \"The Graduate\" (not to mention an amusing parody of the \"Graduate's\" climatic wedding scene).\n\nKathleen Robertson has the Rose McGowen part in this version of \"The Doom Generation\" and is generally well suited to the role. I have not decided yet if Robertson is in McGowen's class as an actress, or in the class of her fellow Canadians Mia Kirshner and Sarah Polley. Robertson was excellent in \"Maniac Mansion\" and \"Beverly Hills 90210\", but these were similar roles that appear to mirror her own cool and detached personality. One thing that is clear is that she was a great choice for Ariki's trademark close-ups. Anyone perceptive enough to close the camera to face distance when shooting McGowen, Robertson, and most recently Michelle Trachtenberg has a eye for breathtakingly beautiful visuals.\n\nThe premise does not really have enough substance to sustain a feature although it might work as a half-hour television sit-com (see \"Three's Company\"). When the premise becomes tired the story brings in a new character, Eric Mabious; and the film self-destructs, killing time until a decent ending sequence. A tip-off that a screen writer has limited life experience to draw from is having cast and crew occupations for the characters. Robertson's character is an aspiring actress and Mabious is directing her in a made-for-television drama. His character is so hopelessly one-dimensional and painfully pathetic that I was convinced that he had a sinister side (what was with those blue contact lenses) that would eventually manifest itself. But this does not happen, maybe Araki had something interesting in mind and abandoned it in re-write. Mabious becomes a non-factor (see totally irrelevancy) and his scenes were simply inserted as padding to get this thing up to feature length.\n\nThe bottom line is that Araki fans will be a little disappointed with \"Splendor\". It is very conventional, it isn't much of a story, and the good banter is limited (although Kelly MacDonald has fantastic dialogue in all her scenes) . But if your Araki appreciation is more for his directorial talents (casting, mise en scene details, camera movement and placement) and his post-production originality, you will find \"Splendor\" measures up very well to his prior work. The morning after scene early in the film simply blows away anything similar from any director.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0127296/"
}