{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Idle",
            "url": "/name/nm0001385/"
        },
        {
            "@type": "Person",
            "name": "Rick Moranis",
            "url": "/name/nm0001548/"
        },
        {
            "@type": "Person",
            "name": "Barbara Hershey",
            "url": "/name/nm0001347/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4416,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0204698/"
        },
        {
            "@type": "Person",
            "name": "Eric Idle",
            "url": "/name/nm0001385/"
        }
    ],
    "datePublished": "1993-04-30",
    "description": "A duke dies and leaves the title and wealth to his adult son. But who's the real son: the found baby raised in USA or the abandoned baby raised by a Hindi family in London? Comedy follows.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Young",
            "url": "/name/nm0950000/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGFmMDY1YjYtMTEzMC00ZDlkLThlMjYtNDczMTZkNjBiYjcyXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "1960s,1990s,long lost son,heir,missing heir",
    "name": "Splitting Heirs",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blinkprincess17"
        },
        "dateCreated": "2003-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0108207/"
        },
        "name": "Not Terribly Hilarious, But Worth a Look",
        "reviewBody": "This movie starring former Pythons Idle and Cleese, as well as Rick Moranis and Catherine Zeta-Jones is an interesting little comedy about a baby English duke (Idle) who disappeared at birth and lost his inheritance to an American (Moranis). He doesn't learn about the mistake until he's 35, living with his adoptive Pakistani family, and working as a stockbroker for a large firm. Zeta-Jones is Moranis' pretty, golddigging fiance and Barbara Hershey plays the hysterical, widowed nymphomaniac \"Duchess Mummy\". John Cleese is a mad lawyer and it's clearly not his best work, but fans will like to see his face. Idle is not at his greatest either, but the plot is kinda neat and moves fairly quickly. This was before Zeta-Jones became the \"Chicago\" superstar she is today, but everyone will note her talent and latina-like beauty. I remember Rick Moranis best as the fabulous \"Dark Helmet\" in \"Space Balls\", but I enjoyed him as the nerdy, rollerblading, 10-year-old in a man's body in this one. You may be disappointed at seeing the comedy gods Idle and Cleese fall kind of flat, but give it at least a peek, for there are some quality scenes."
    },
    "url": "/title/tt0108207/"
}