{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jingfan Hu",
            "url": "/name/nm1248386/"
        },
        {
            "@type": "Person",
            "name": "Jun Wu",
            "url": "/name/nm0943119/"
        },
        {
            "@type": "Person",
            "name": "Bai Qing Xin",
            "url": "/name/nm1249409/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1342,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Springtime in a Small Town",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020819/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005368/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049799/"
        },
        {
            "@type": "Person",
            "name": "Tianji Li",
            "url": "/name/nm0508525/"
        },
        {
            "@type": "Person",
            "name": "Cheng Ah",
            "url": "/name/nm0155531/"
        },
        {
            "@type": "Person",
            "name": "Mu Fei",
            "url": "/name/nm0270502/"
        }
    ],
    "datePublished": "2003-12-11",
    "description": "The eight-year marriage of Liyan and Yuwen has left them both unfulfilled and distant. A visitor arrives from Shanghai, a doctor who's an old school friend of Liyan's and, unbeknownst to her husband, Yuwen's childhood sweetheart.",
    "director": [
        {
            "@type": "Person",
            "name": "Zhuangzhuang Tian",
            "url": "/name/nm0862514/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjE2ODcxNDktZDZmOC00M2MyLTkwNGItMzI1ZTExODM2NzdmXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "game,shanghai china,spring the season,friend,post war",
    "name": "Xiao cheng zhi chun",
    "original_info": {
        "id": "Springtime in a Small Town_2004",
        "name": "Springtime in a Small Town",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2005-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0332831/"
        },
        "name": "mesmerizing human drama",
        "reviewBody": "Set in the days immediately following World War II, the Chinese film \"Springtime in a Small Town\" is a poetic, slow-moving meditation on the part that love, passion, compromise, self-sacrifice and renewal play in our lives and our relationships.\n\nLiyan and Yuwen are a young married couple living in the crumbling ancestral home of the man's deceased parents. Struggling under the burden of an arranged marriage, Liyan and Yuwen have been drifting farther and farther apart over time - he obsessing over his chronic health problems (possibly psychosomatic in nature) and she secretly yearning for a more fulfilling life away from this man who seems not to care for her. Then one day, Zhang, an old boyhood pal of Liyan's, comes to pay a visit. Now a doctor, Zhang is shocked to discover that Liyan's wife is Yuwen, the very woman whom he loved but left ten years earlier. Tensions very quickly develop in the household as Zhang and Yuwen begin to take steps towards rekindling their romance - forcing each of the three individuals to come to terms with long unresolved desires and emotions.\n\nIn its quiet, subtle way, \"Springtime in a Small Town\" explores what happens when human emotions and passions are repressed under the weight of societal restrictions and cultural traditions. Writer Cheng Ah and director Zhuangzhuang Tian unfold their story slowly, never feeling the need to rev up the action or overemphasize a detail to make a point. The film establishes a hypnotic rhythm and a tone of quiet contemplation from the outset, allowing us to soak in all that is happening on the screen at our own leisure. For despite the fact that there may not SEEM to be a lot happening in the film, there is actually a wealth of human drama taking place right beneath the placid surface of the tale. These are characters whose every word, every gesture reveals some aspect of the universal human condition. To heighten the intimacy of the piece, Ah and Tian have circumscribed their canvas so that only five people even make an appearance in the film (Liyan's teenaged sister and an aged family servant are the movie's other two characters). \"Canvas\" is indeed the operative word here, for Tian has treated this film much like he would a painting, capturing his characters in stark tableau often set against strikingly beautiful natural landscapes. The camera glides along at an unhurried pace, helping to draw us into this strangely beautiful world where seething human passions play themselves out in settings. The filmmakers also deserve credit for providing a remarkably ambiguous ending. We really aren't quite sure how we are supposed to react at the end of the movie and that is as it should be when it comes to art.\n\nThe lovely Jingfan Hu is both heartbreaking and not a little frightening as the normally composed young woman who may not be quite as sweet and submissive as she appears to be on the surface. The shots of her strolling through the countryside in all her placid, regal beauty are haunting and memorable in their exquisiteness. Jun Wu as Liyan and Bai Qing Xin as Zhang also give excellent performances, never allowing their strong feelings to rise much above the level of a whisper. Liyan is a particularly fascinating character in that we get the sense that he may be using his \"illness\" as a means of avoiding the responsibilities and pressures of being a true husband to his wife. The power struggle that develops among the three of them is devastating in its understatement and subtlety.\n\nThere's no denying that \"Springtime in a Small Town\" demands a certain amount of patience from the viewer. But anyone who opens himself up to the beauty of its images and the truth of its observations will find it to be a profoundly rewarding experience well worth the time and patience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Palm Pictures",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2491744537",
        "name": "Springtime in a Small Town",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjE4M2U2NTItMjBjMy00MTE0LWIwMjQtYTU4YzU4MDAwNGMxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjE4M2U2NTItMjBjMy00MTE0LWIwMjQtYTU4YzU4MDAwNGMxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:57:49Z",
        "url": "https://www.imdb.com/video/vi2491744537/"
    },
    "url": "/title/tt0332831/"
}