{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edward James Olmos",
            "url": "/name/nm0001579/"
        },
        {
            "@type": "Person",
            "name": "Estelle Harris",
            "url": "/name/nm0364680/"
        },
        {
            "@type": "Person",
            "name": "Mark Phelan",
            "url": "/name/nm0679750/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21007,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057924/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000821/"
        },
        {
            "@type": "Person",
            "name": "Ramón Menéndez",
            "url": "/name/nm0579466/"
        },
        {
            "@type": "Person",
            "name": "Tom Musca",
            "url": "/name/nm0615556/"
        }
    ],
    "datePublished": "1988-03-11",
    "description": "The story of Jaime Escalante, a high school teacher who successfully inspired his dropout-prone students to learn calculus.",
    "director": [
        {
            "@type": "Person",
            "name": "Ramón Menéndez",
            "url": "/name/nm0579466/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ2MjA4MTcwOF5BMl5BanBnXkFtZTgwNTI4OTI1MDE@._V1_.jpg",
    "keywords": "calculus,inner city youth,institutional discrimination,national film registry,teacher as protagonist",
    "name": "Stand and Deliver",
    "original_info": {
        "id": "Stand and Deliver_1987",
        "name": "Stand and Deliver",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BDeWittP"
        },
        "dateCreated": "2011-06-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094027/"
        },
        "name": "Inspirational",
        "reviewBody": "Do you remember one teacher who made things fun and interesting? Made you love to learn. Jaime Escalante, the main character and hero of \"Stand and Deliver\" is exactly that type of teacher. He has some eccentricities: he has a strange walk, sometimes talks to himself, and has strange ways of getting his points across. The important thing is: his teaching methods are interesting and efficacious.\n\nEdward James Olmos, in the greatest performance of his career, is magnificent as Jaime Escalante. He has come to the barrio Garfield High School to teach computer science, after giving up a better paying job in the private sector. He has one problem: the computers haven't come yet. He wants to teach math. He is surprised at the problems he sees at the school, most notably the crimes, violence, and indifference to learning. The scene where he notices the radio missing from his car after his first day is especially humorous, without being too silly.\n\nMr Escalante, who is himself Latino, finds himself teaching a lot of latino and hispanic students from similar backgrounds. He wants them to be the best they can be, and be proud of their heritage. When he suggests teaching them Calculus, he is told by the head of the department that it will destroy the students morale, because of their lack of education and it's too much to expect. He responds with the perfect answer \"students will rise to the level of expectations.\" This is what a great teacher does: he refuses to write the students off as losers. If you tell them they're going to be failures, that's all they'll ever be.\n\nThe students do rise to the occasion, after working all through the summer to learn the mathematical rigors of algebra, geometry, and trigonometry, they're ready for the AP Calculus test. Every student who takes the test passes. Unfortunately, through \"anomalies\" that were detected (but no real, solid proof) the Educational Testing Services suspects they cheated. We do know, however, that they did not cheat.\n\nThis is where the movie raises interesting questions, and also makes meaningful statements. When a very discouraged Escalante talks the matter over with his wife, she is very supportive and understanding, telling him that no matter what, the kids are getting an education, and they learned. He responds, \"Yeah, they learned that if you worked real hard, nothing changes.\" I loved it when Mr Escalanted confronts the two members of the Educational Testing Service, who, no matter how rational their reasoning may be, cannot give a single, valid reason to support their suspicions that the students cheated. Escalante gets angry, and rightfully so, saying \"You can't prove anything, my kids didn't do anything.\" \"If these kids didn't have Spanish surnames or come from a barrio school, these scores would have never been questioned!\" We can identify with his anger, and know he is justified.\n\nBy the end of the movie, which I won't give away, and everything comes full circle, it's very satisfying. What makes this movie work is not only that students learn, but we actually like watching them enjoy the process. Unlike \"Dead Poets Society\" where the students only wind up liking the teacher, and not the subject, in \"Stand and Deliver\" the students actually appreciate math and the teacher. Perhaps the most important quality the movie teaches us is that of belief. If you believe in people, even the academically disadvantaged, and are willing to give them a boost, and push them as far as their abilities will go, you really can succeed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4119903769",
        "name": "Stand and Deliver",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDIxMjYwOTktZGU1ZS00MGEwLTgzM2YtM2FjOWY4ZGVhNzkyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDIxMjYwOTktZGU1ZS00MGEwLTgzM2YtM2FjOWY4ZGVhNzkyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-17T17:03:15.787Z",
        "url": "https://www.imdb.com/video/vi4119903769/"
    },
    "url": "/title/tt0094027/"
}