{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Hamill",
            "url": "/name/nm0000434/"
        },
        {
            "@type": "Person",
            "name": "Harrison Ford",
            "url": "/name/nm0000148/"
        },
        {
            "@type": "Person",
            "name": "Carrie Fisher",
            "url": "/name/nm0000402/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1310148,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "alternateName": "Star Wars: Episode V - The Empire Strikes Back",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071326/"
        },
        {
            "@type": "Person",
            "name": "Leigh Brackett",
            "url": "/name/nm0102824/"
        },
        {
            "@type": "Person",
            "name": "Lawrence Kasdan",
            "url": "/name/nm0001410/"
        },
        {
            "@type": "Person",
            "name": "George Lucas",
            "url": "/name/nm0000184/"
        }
    ],
    "datePublished": "1980-06-20",
    "description": "After the Rebels are overpowered by the Empire, Luke Skywalker begins his Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett.",
    "director": [
        {
            "@type": "Person",
            "name": "Irvin Kershner",
            "url": "/name/nm0449984/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Action",
        "Adventure",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmU1NDRjNDgtMzhiMi00NjZmLTg5NGItZDNiZjU5NTU4OTE0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "famous twist,part of trilogy,the force,duel,rescue",
    "name": "The Empire Strikes Back",
    "original_info": {
        "id": "Star Wars: Episode V: The Empire Strikes Back_1980",
        "name": "Star Wars: Episode V: The Empire Strikes Back",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Spleen"
        },
        "dateCreated": "1999-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080684/"
        },
        "name": "It's NOT the darkest of the trilogy - it's the most mature",
        "reviewBody": "`It avoids having the standard shoot-'em-up ending,' says a friend of mine, `by not having an ending.' I suppose this is what most people think, but all the same the film manages to form a satisfying whole; or at least, a whole that satisfies me. I'm therefore inclined to think it DOES have an ending. Obviously, I can't discuss this without giving things away to those few who don't know what happens. If you're one of those few, then believe me: your ignorance is precious enough to be worth guarding until you see the film. Stop reading now.\n\nAfter the surprise attack on the rebel base, Luke Skywalker splits with Han, Leia, et al. Han's party gets away first (is it just me, or is the shot of Luke watching the Falcon flying off while he stands stranded on the ground, a poignant one?), but thereafter they face one narrow escape after another, while Luke slinks off quietly and safely to train with Yoda.\n\nThe training scenes are many and Yoda talks a great deal of rubbish. But somehow it doesn't matter. The film is ambivalent in its attitude towards Yoda, anyway. Our sympathy clearly lies with the entirely non-spiritual concerns of Han, Leia and the adolescent Luke. The main story concerns the understanding that builds between Han and Leia. In the end they are honest with one another; and if Han's being frozen and shipped back to Tatooine is the price to pay for this, well, it's the price to pay. It was very important NOT to end with the dashing rescue that opens `Return of the Jedi', which would be dramatically beside the point. Instead we end with the promise that the rescue will some day occur. That's enough.\n\nAs for Luke: he abandons Yoda to rescue Han and Leia, and achieves NOTHING WHATEVER. This was my favourite touch. All five Jedis - Luke, Obi-Wan, Yoda, Vader, and the Emperor - find that their conflicting instincts are all entirely wrong. The film is really about the temporary triumph of human impulses over the mystical Force. Luke's human idealism is vindicated, but his supernatural powers, just this once, are not.\n\nWhen George Lucas gave his Star Wars trilogy a fresh coat of varnish in 1997 he felt he had to justify the expense by making needless changes. You'll notice he made precious few changes to episode V. There just wasn't room. He added a few extra shots of the ice monster, which of course weakened that one scene; but even with those changes in place the Special Edition is virtually identical to the original edition. Since Lucas was so keen on making changes wherever he could this is obviously a tribute to the tightness of the story and the direction. It's also a tribute to the perfection of the original special effects, more innovative than the effects in the first Star Wars movie and better than the effects in any subsequent one.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.",
        "duration": "PT2M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi221753881",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGQzN2E0YmYtYzgxNS00NWM4LWFkY2ItZjBiNzgyZTM3ZmFmXkEyXkFqcGdeQWpvaG5oYXJ0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGQzN2E0YmYtYzgxNS00NWM4LWFkY2ItZjBiNzgyZTM3ZmFmXkEyXkFqcGdeQWpvaG5oYXJ0._V1_.jpg",
        "uploadDate": "2015-12-11T15:12:16Z",
        "url": "https://www.imdb.com/video/vi221753881/"
    },
    "url": "/title/tt0080684/"
}