{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Shatner",
            "url": "/name/nm0000638/"
        },
        {
            "@type": "Person",
            "name": "Leonard Nimoy",
            "url": "/name/nm0000559/"
        },
        {
            "@type": "Person",
            "name": "DeForest Kelley",
            "url": "/name/nm0001420/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 124353,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Gene Roddenberry",
            "url": "/name/nm0734472/"
        },
        {
            "@type": "Person",
            "name": "Jack B. Sowards",
            "url": "/name/nm0816348/"
        },
        {
            "@type": "Person",
            "name": "Harve Bennett",
            "url": "/name/nm0071790/"
        }
    ],
    "datePublished": "1982-06-04",
    "description": "With the assistance of the Enterprise crew, Admiral Kirk must stop an old nemesis, Khan Noonien Singh, from using the life-generating Genesis Device as the ultimate weapon.",
    "director": [
        {
            "@type": "Person",
            "name": "Nicholas Meyer",
            "url": "/name/nm0583292/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmZiZmM2OTUtZDlmOC00YzYyLThkMGEtZWFkMjJmM2EwZDVkXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "desert,revenge,funeral,cheating,birthday",
    "name": "Star Trek II: The Wrath of Khan",
    "original_info": {
        "id": "Star Trek II: The Wrath of Khan_1982",
        "name": "Star Trek II: The Wrath of Khan",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sddavis63"
        },
        "dateCreated": "2003-01-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0084726/"
        },
        "name": "The Movie That Saved \"Star Trek\"",
        "reviewBody": "I don't think that I'm exaggerating with that title. \"Star Trek: The Motion Picture\" made a lot of money from people who were happy to see the gang re-united, but that turned out to be a pathetically weak movie. Another sub-par effort would surely have killed the franchise, but this instalment was anything but sub-par, and led to two directly related sequels.\n\nThe idea was great. Take a popular episode of the TV series (\"Space Seed\") and update it. Use the main guest star from the TV series (Ricardo Montalban) and have him reprise his role as Khan Noonian Singh, the late 20th century warlord who was cryogenically frozen and then \"rescued\" by Captain Kirk and ultimately stranded on Ceti Alpha V after trying to seize control of the Enterprise. Here we see Khan taking his revenge on Kirk for the events of 15 years before.\n\nThe cast in general is excellent in this one, although - and I find this typical of the movies - both DeForest Kelley (Dr. McCoy) and James Doohan (Scotty) seem to have some trouble reprising their roles. There are some interesting new characters (Saavik, played by a very young Kirstie Alley) and the Drs. Marcus (Bibi Besch as Carol and Merritt Butrick as David - adding some new context to Kirk's life as his ex-lover and son, respectively.) It's a tense movie filled with all the fun stuff that we expect from Star Trek, and a very good climax with the appropriate open-endedness setting us up for the inevitable sequel.\n\nIt isn't without its problems, mind you. How do Khan and Chekhov know each other? Chekhov wasn't part of the crew in Season 1 when \"Space Seed\" aired (or at least Walter Koenig wasn't part of the cast.) William Shatner (as expected) goes a bit over the top at times (his anguished cry of \"KHAAAAANNNNNNNN!\" while shaking with fury comes to mind.) It seems strange to me that no one would have checked on Khan after his stranding on Ceti Alpha V, that no one seemed to know that Ceti Alpha IV had exploded (when the Reliant came within scanning distance of the system shouldn't someone have said \"uh, Captain Terrell, there's one less planet here than there should be) and that it didn't even seem to have occurred to Chekhov (who apparently and inexplicably knew Khan so well) that this was the system where Khan had been stranded.\n\nStill, it's a fun movie that made Star Trek worth watching again.\n\n7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Wrath Of Khan Director's Cut",
        "duration": "PT1M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1234417433",
        "name": "Star Trek II: The Wrath of Khan: Celebrating 50 Years",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWEwMDY5YjAtZTk2Yy00MDQ0LTgxNjAtNTA4MjFjZjFkOTg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWEwMDY5YjAtZTk2Yy00MDQ0LTgxNjAtNTA4MjFjZjFkOTg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-06-28T14:49:11Z",
        "url": "https://www.imdb.com/video/vi1234417433/"
    },
    "url": "/title/tt0084726/"
}