{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Shatner",
            "url": "/name/nm0000638/"
        },
        {
            "@type": "Person",
            "name": "Leonard Nimoy",
            "url": "/name/nm0000559/"
        },
        {
            "@type": "Person",
            "name": "DeForest Kelley",
            "url": "/name/nm0001420/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 87719,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072491/"
        },
        {
            "@type": "Person",
            "name": "Gene Roddenberry",
            "url": "/name/nm0734472/"
        },
        {
            "@type": "Person",
            "name": "Leonard Nimoy",
            "url": "/name/nm0000559/"
        },
        {
            "@type": "Person",
            "name": "Harve Bennett",
            "url": "/name/nm0071790/"
        }
    ],
    "datePublished": "1986-11-26",
    "description": "To save Earth from an alien probe, Admiral James T. Kirk and his fugitive crew go back in time to San Francisco in 1986 to retrieve the only beings who can communicate with it: humpback whales.",
    "director": [
        {
            "@type": "Person",
            "name": "Leonard Nimoy",
            "url": "/name/nm0000559/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmU3ZGE3NzEtYTdmYi00YTYxLWIxYTItZGY5YjFlOTA2NWI3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "probe,whale,alien probe,humpback whale,time travel",
    "name": "Star Trek IV: The Voyage Home",
    "original_info": {
        "id": "Star Trek IV: The Voyage Home_1986",
        "name": "Star Trek IV: The Voyage Home",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "silverscreen888"
        },
        "dateCreated": "2005-06-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092007/"
        },
        "name": "A Vivid, Upbeat, Frequently Intelligent and Delightful Sci-Fi Adventure",
        "reviewBody": "The fourth entry in the \"Star Trek\" movie series is the most popular and unarguably the best-liked of these entertaining movies. It has a fine variety of scenes, intelligent comedy to leaven the more serious adventures. it is fast paced, beautifully directed by Leonard Nimoy who also plays \"Spock\". What prevented it from being even better perhaps appreciated is a deliberate attempt by the writers to write short, choppy-sentence dialogue that in some scenes does not work as well as more formally-structured words might have worked. The film is bright, the art direction is very good, the music by Leonard Rosenmann is outstanding. And the story line is one of the best that sci-fi filmmakers have yet devised, in my judgment, because it has everything. As Captain James T. Kirk of the 23rd century starship Enterprise, William Shatner acts with unusual intelligence and even strength to get by. As his half-alien First Officer Spock, just recovering from a traumatic experience that caused him to have to be reeducated from ground zero, Leonard Nimoy is even better. Everyone of Jim Kirk's crewmen, including James Doohan as Engineer Montgomer Scott, De Forest Kelley as CMO Leonard McCoy, Nichelle Nichols as Lt. Uhura of Communications, talented George Takei as Helmsman Sulu, and Walter Koenig as Navigator Pavel Chekhov, have good scenes to perform and do them seamlessly and with professional style. Others in the cast including Brock Peters, Jane Wyatt, Mark Lenard, Grace Lee Whitney, Alen Henteloff, Robert Ellenstein and a relative unknown as the earthwoman who becomes enmeshed in the Enterprise officers' mission,are given telling moments. There are many memorable visual moments, including the departure of a stolen Klingon warbird from the planet Vulcan, the near-wreckage of Starfleet Headquarters, the landing of an invisible vessel in Golden Gate Park, a slingshot run around the sun, a descent from the invisible craft to the ground, scenes around the Alameda Navy Yards, a chase in a hospital and scenes at the cetacean Institute all make themselves hard-to-forget. It is the sheer fun and adventure of the storyline--sending a starship back in time to rescue two hump-backed whales and save the earth from alien destruction--that sets this film apart. Ignored by critics who have nearly always ignored sci-fi achievements, this cinematic attainment set a standard for future sci-fi to which hardly any film's maker has yet approached. The revelation of character could have been deeper, but the relevance of every moment to the plot line could hardly have been bettered. Harve Bennett deserves some of the credit for this script's excellences; so do the special-effects creators, since for once in Hollywood, every such effects serve to further the progress the central character and his helpers are making. This is probably a film to be watched over and over; I wish there were more such adult sci-fi efforts that eschew pretension and present so much intelligent dialogue, acting and intriguing \"differences\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "On this IMDbrief, we break down what writer/director Noah Hawley could bring to the Federation, and why we'd love to see another 'Star Trek IV: The Voyage Home' (1986).",
        "duration": "PT4M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3872046873",
        "name": "Where 'Star Trek 4' Should Boldly Go",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzA4MzU3OGUtZDE5ZC00YzZhLTllMzctZjUyOTg5NDExODA0XkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzA4MzU3OGUtZDE5ZC00YzZhLTllMzctZjUyOTg5NDExODA0XkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg",
        "uploadDate": "2019-11-21T01:41:43.825Z",
        "url": "https://www.imdb.com/video/vi3872046873/"
    },
    "url": "/title/tt0092007/"
}