{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Shatner",
            "url": "/name/nm0000638/"
        },
        {
            "@type": "Person",
            "name": "Leonard Nimoy",
            "url": "/name/nm0000559/"
        },
        {
            "@type": "Person",
            "name": "DeForest Kelley",
            "url": "/name/nm0001420/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 61681,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Gene Roddenberry",
            "url": "/name/nm0734472/"
        },
        {
            "@type": "Person",
            "name": "William Shatner",
            "url": "/name/nm0000638/"
        },
        {
            "@type": "Person",
            "name": "Harve Bennett",
            "url": "/name/nm0071790/"
        }
    ],
    "datePublished": "1989-06-09",
    "description": "Captain Kirk and his crew must deal with Mr. Spock's long-lost half-brother who hijacks the Enterprise for an obsessive search for God at the center of the galaxy.",
    "director": [
        {
            "@type": "Person",
            "name": "William Shatner",
            "url": "/name/nm0000638/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Adventure",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmUzNjYzZDEtMWQ1Ny00OGIxLTk4MTktMzU5NTZmZjk5MTQyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "human vulcan baby,male alien,pavel chekov character,spock character,sarek character",
    "name": "Star Trek V: The Final Frontier",
    "original_info": {
        "id": "Star Trek V: The Final Frontier: Bonus Material_1989",
        "name": "Star Trek V: The Final Frontier: Bonus Material",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thatllbetheday"
        },
        "dateCreated": "2000-11-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098382/"
        },
        "name": "20 reasons why I hate Star Trek 5",
        "reviewBody": "20 REASONS I HATE STAR TREK 5\n\n1. THE TITLE Trivialized by what's already a pop-culture catch phrase. A cop out.\n\n2. YOU CAN'T PLEASE EVERYBODY This movie was beat from the start. A victim of TREK's revived popularity. In 1989 you had the 'classic' fans, the \"KHAN\" generation, civilians won over by \"THE VOYAGE HOME\", and \"NEXT GENERATION\" fans. Expectations crossed the board. Making matters worse, the writers had a \"clean slate\", resulting in a muddled \"original\" story. The answer should have been incorporating some TREK history and acknowledging the NEXT GENERATION. Instead, we got tangents. Like Spock's brother.\n\n3. SPECIAL EFFECTS How could one of the strongest movie franchises in town let this happen? Fans should petition to get Nick Myer to do a STAR WARS style \"Special Edition\".\n\n4. THE FALL From Kirk's foot slip to \"I expect that's Klingon for 'hello'\" this movie holds some of the most embarrassing moments in Star Trek. I remember the butterflies in my stomach as Spock dives into this dumb scene with FX from Saturday morning. The Nimbus bar (office for the delegates?) is a lame copy of the STAR WARS cantina.\n\n5. DEFECTIVE ENTERPRISE This crew works at a disadvantage in every film but \"UNDISCOVERED...\"...even \"GENERATIONS\". The broken ship is a tired device, and here it doesn't make sense. There's no relevance to the plot, except maybe the broken transporter. Other functions are played only for 'laughs'.\n\n6. SUPPORTING CAST WASTED Sulu and Chekov lost! --hilarious! Uhura stripping!! --A riot!! Scotty bangs his head! ...okay, that was actually pretty funny. The director was not responsible for most trouble, but he has no idea how to treat these characters. Not realizing their value, he plays them either goofy or hypnotized. A missed opportunity for drama in exposing their pain or portraying the forced betrayal of Kirk. Remember Chekov's struggle in 'KHAN'.\n\n7. KLINGONS Used only as a conflict device, they have no motivation given except to 'get Kirk'. There could have been an effort to rescue Korrd or even direct orders from the Klingons to use the conflict as an excuse to entrap Kirk. (like \"UNDISCOVERED...\") I did like the use of Klingonese but if you follow closely, there's a Klingon word for Kalicams... which IS a Klingon word...\n\n8. THE HANGER DECK The design department has no concept of perspective. The look was great but the proportions are way off. This contributes to a feeling that something is not right. A well acted scene has the effect of a school play. I was drawing technical plans for this stuff when I was 10!! How could they be so far off.\n\n9. \"I WANT JIM KIRK!\" The Admiral's reason for sending the undermanned Enterprise. Why?? With Klingons involved, it means trouble. Are we to believe the average Starship captain is THAT unprepared for this situation. It would have made more sense if Enterprise were the ONLY option.\n\n10. SYBOK'S TAKEOVER Controlling the bridge, Sybok takes over. Where is everybody? And why do crewmembers stand passively, listening to his message. He relieved everyone's pain? From here on, the story moves around the characters. Scotty tries to animate things... until he's knocked out.\n\n11. SPOCK'S BROTHER I'll accept that he has a half-brother we don't know about. Sybok isn't the type of guy Spock would discuss. But it's such an obvious device from which to squeeze drama. Ooooh, conflict...HOW will Spock resolve this one. The film suffers from too many plot contrivances for us to accept this on too. No matter how good these two actors are. (And they are good. When they first meet? Golden!!)\n\n12. THE TURBOSHAFT CLIMB Dumb idea, bad FX, lame jokes. ...and the floor numbers are wrong.\n\n13. TOO MANY RED HERRINGS The significance of Nimbus, the ship's malfunctions, Spock's brother, hostages, etc. These things don't affect the storyline in the end. Take the SOS message from the Officers Lounge. This is intercepted by the Klingons (who already know where they are..) and serves only as a vehicle for Sybok to confront them.\n\n14. THE GREAT BARRIER Another arbitrary plot device. They zip through with no explanation as to how. Even if Sybok knew how, the Klingons follow with no problem.\n\n15. \"DON'T JUST STAND THERE... GOD IS A BUSY MAN\" Don't just stand there???? Captain! The director has given us nothing to do!!\n\n16. GOD-THING The film's lame effects especially disappoint here. The GOD face is laughable. Audiences can't believe they're viewing GOD, and guess what? It's not. Confusion is inevitable. If he's fake, make him a real fake!! (Remember Balok?) The concept of an alien being trapped on this planet and Sybok's willingness to believe should have been flushed out more. McCoy asking, \"Is this the voice of God?\" was wrong. That should have been Sybok. The real story of the GOD-THING is left unclear. It needed a \"Perry Mason\" type ending. \"There's just one thing I don't understand, Jim...\"\n\n17. GHOST ATTACK There's no ghosts in Star Trek. Having 'something' shake the shuttle, chase Kirk, and make a lot of racket is a poor compromise of the Directors original idea's.\n\n18. CONVENIENT KLINGON TORPEDO...which kills the transporter. Now what?? Oh brother! I was wise to that bit before I was in high school.\n\n19. THE CLIMAX The story falls apart from here. Klingons aren't needed here; they clutter up the action, Kirk runs from... what? GOD lightning! It sure has bad aim. The enemy saves the day. The Klingon apology, and finally... Spock in the gunner chair. All of this feels like the results of a 'we need an ending' meeting. Although I like the exchange between Kirk and Spock, this could have taken place on the Enterprise.\n\n20. THE SOLEMN ENDING Sybok is dead. GOD doesn't live here. The entire STORY has been a red herring. Still... we have each other... Star Trek movies aren't known for happy endings, but this one's especially dark. Cool Vulcan harp, though."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3842752025",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2E2Yjg3N2EtNjk2My00NDlmLTkzZWItMzlkNTNmZGMyNzE2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2E2Yjg3N2EtNjk2My00NDlmLTkzZWItMzlkNTNmZGMyNzE2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-14T14:10:17.199Z",
        "url": "https://www.imdb.com/video/vi3842752025/"
    },
    "url": "/title/tt0098382/"
}