{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Anthony Daniels",
            "url": "/name/nm0000355/"
        },
        {
            "@type": "Person",
            "name": "Graeme Campbell",
            "url": "/name/nm0132491/"
        },
        {
            "@type": "Person",
            "name": "Dan Hennessey",
            "url": "/name/nm0377243/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1956,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "TV-Y7-FV",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015560/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071326/"
        }
    ],
    "datePublished": "1985-09-07",
    "description": "The adventures of R2-D2 and C-3PO years before serving the Rebel Alliance. The series features several story arcs and one hour-long special.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTVkMDQ3ZTAtYzI0NC00MTk0LWFiMzUtMmZhY2E1NjE1Mjk0XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "1980s,alien spacecraft,r2 d2 character,c 3po character,droid",
    "name": "Star Wars: Droids",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "xamtaro"
        },
        "dateCreated": "2015-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0088510/"
        },
        "name": "In trouble again",
        "reviewBody": "STAR WARS: DROIDS was the closest anyone had to a \"prequel\" back in 1985. It detailed the often light hearted adventures of C3PO and R2D2 back before they landed in the possession of Princess Leia at the start of \"A NEW HOPE\". In a move considered rare among cartoons of that day, DROIDS employed arcs consisting of 4 episodes each. The first saw the titular droids land in the possession of a duo of Speeder Racing enthusiasts. They have built their very own speeder called the Mach 5 The White Witch but through a series of unfortunate events land in the crosshairs of a powerful triad boss. The second arc has the droids end up helping a lost prince reclaim his throne and fend off the pirates that were plaguing his homeland. Then they join merchant Mungo Baobab on a treasure hunt to the Roon system while evading imperial patrols.\n\nExciting stuff for sure. Pirates and princes, space ships and speeders, even a run in with the Empire. Take the original Star Wars trilogy and watch only C3PO and R2D2 scenes. There you have what this show is all about. Lighter on action, heavier on humour with a good dose of cartoon slapstick. Anthony Daniel's humorous British accented delivery as C3PO and R2D2 as \"himself\" steals the show as the strongest reminder of its Star Wars roots. Basically, C3PO and R2D2 are in this cartoon as they were in the movies. If you loved them then, you would love them here. It is amazing how one actor can establish this chemistry with a sound synthesiser (which is essentially what they used to \"voice\" R2D2).\n\nYet for all their efforts, STAR WARS DROIDS feels so far removed from the \"feel\" of Star Wars and more like your typical Saturday morning cartoon. Space ships like the A-Wing and a badly drawn Star Destroyer do make an appearance, as do Stormtroopers and of course the titular droids. But nothing would change if they were replaced by generic space ships, generic bad guys and a bumbling protagonist duo. The story lines are so clichéd and the new designs of never-see-before aliens, vehicles and technology so.....weird. This cartoon also throws out Skywalker Sound's fabulous audio from the movies and replace John Williams' timeless score with.....generic stuff. All the other characters act in that exaggerated cartoony manner befitting your generic.......did I just repeat \"generic\"? I guess I did. Because that is how you describe this show in a single word.\n\nIt is generic. Star Wars in name only. Even the visuals are groan inducing. Artwork goes off model once too often, colours are flat and lifeless, and once again the designs are just.....weird. In terms of animation, STAR WARS DROIDS was farmed out to a taiwanese studio and their work, while passable, cannot hold a candle to the superior work of Japanese or Korean studios. Movements alternate between stiff and exaggerated with character gesturing unnecessarily in conversations like they were in some stage play. Most confusing is the decision to animate robots like humans; C3PO is a heck lot more flexible than his movie counterpart, plus he is able to make facial expressions, run, jump and flex his elbows. R2D2 is now made of rubber seeing as how he can squash and stretch himself like a balloon. \n\nPerhaps I am out of my element here. Perhaps this was made for the simpler kids of the 80s and no one else. I may have judged this more kindly if it were not Star Wars, but there it is, right there in the title. Star Wars dove in deep and revolutionised cinema. It pushed the boundaries of special effects and brought science fiction out of its B movie gutter and into billion dollar blockbuster territory. STAR WARS DROIDS chose to wade in safe and shallow, revolutionising nothing, and not even capturing the feel of its source material.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0088510/"
}