{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Philip Seymour Hoffman",
            "url": "/name/nm0000450/"
        },
        {
            "@type": "Person",
            "name": "William H. Macy",
            "url": "/name/nm0000513/"
        },
        {
            "@type": "Person",
            "name": "Rebecca Pidgeon",
            "url": "/name/nm0682071/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21643,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063162/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054283/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047370/"
        },
        {
            "@type": "Person",
            "name": "David Mamet",
            "url": "/name/nm0000519/"
        }
    ],
    "datePublished": "2001-01-12",
    "description": "A movie crew invades a small town whose residents are all too ready to give up their values for showbiz glitz.",
    "director": [
        {
            "@type": "Person",
            "name": "David Mamet",
            "url": "/name/nm0000519/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWVhMDM4OTgtMDVhOC00ODhlLWFjM2ItZjRjNGVjZDMyMzZkXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "small town,filmmaking,new england,neo screwball comedy,film within a film",
    "name": "State and Main",
    "original_info": {
        "id": "State and Main_2000",
        "name": "State and Main",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mattymatt4ever"
        },
        "dateCreated": "2001-06-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120202/"
        },
        "name": "Brilliantly acted and refreshingly original!",
        "reviewBody": "I haven't been thoroughly following David Mamet's career, but just watching this film, \"American Buffalo\" and \"Glengarry Glen Ross\" I already get a feel of his unique style of writing. It's very witty, very original and he has certain trademarks, like quick exchanges of dialogue between actors and repeating of the same sentence of dialogue in a group of lines. Well, his uniqueness is quite evident in watching this movie and it works quite well.\n\nFirst I'll mention the vast array of talented actors. I don't think the casting could've been any better. Character actor William H. Macy is brilliant as the almost unscrupulous director, who will do ANYTHING--and I'm not exaggerating the least bit--to get his picture done. Fellow character actor/fellow PT Anderson regular Philip Seymour-Hoffman turns in another brilliant, yet subtle performance as the shy but appealing and wildly creative screenwriter who is the fuel of this cinematic project. As I said, he's made a significant--and extremely impressive--transition from playing the airhead jerk in \"Scent of a Woman\" and \"Twister\" to playing deep character roles like this. He ranks among the top in my list of Best Underrated Actors (along with Macy) and I hope one of these days he'll become a household name. David Peymer, I think, delivers the best performance of his career as the fast-talking, sniveling producer. I've always known he was a good actor, but he truly flaunts his knack for acting and taking risks in this role. It figures that playwright Mamet would assemble a group of fine character actors, instead of simply casting people who \"look good on camera.\" That's one of the advantages of having a playwright as a director.\n\nThe script is wildly original and kept me laughing. There are many interesting, memorable quotes. And this is just a fine adult comedy (Thank God!!). With the explosion of teen gross-out comedies, I'm sure audiences will cherish a comedy like this. It works in all aspects. Not only is it well-performed, but it's well-written (lots of comedies only contain one of those factors). And it's all done in good taste. So those of you expecting cheap sex jokes and low-brow gags involving bodily functions--sorry to disappoint you! There are no cliches. This movie is an explosion of Mamet's gift for creativity. Take for example, the relationship between Hoffman and the beautiful Rebecca Pidgeon. They don't have a sex scene. Most of their screen time is spent talking and getting to know each other, sharing their thoughts on writing, researching the town's history, finding out how much they have in common. Do we still see that in the movies? Character development in romance? In the scene where Hoffman is in the hotel room with Sarah Jessica Parker lying on the bed naked, and Pidgeon knocks on his door to greet him with a bouquet of flowers, there's no predictability. You would assume she would take one look at Parker's naked body and punch him in face. I'm not going to give away what happens, but that moment stuck in my mind, because it is the first film I've seen to go a different route with the whole \"girlfriend catches you in bed with another girl\" premise. \n\n\"State and Main\" is pleasant, light-hearted, funny, original comedy and it's one I'd definitely recommend. If you want to see great performances and laugh at good, tasteful humor--you can't go wrong!\n\nMy score: 7 (out of 10)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Fine Line",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1564541465",
        "name": "State and Main",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGU2OTBiZjUtYjBjOC00MTlhLWFlNjYtMzU5Nzc0ZTI2NTU0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGU2OTBiZjUtYjBjOC00MTlhLWFlNjYtMzU5Nzc0ZTI2NTU0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-09T13:51:12Z",
        "url": "https://www.imdb.com/video/vi1564541465/"
    },
    "url": "/title/tt0120202/"
}