{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Bridges",
            "url": "/name/nm0000313/"
        },
        {
            "@type": "Person",
            "name": "Sally Field",
            "url": "/name/nm0000398/"
        },
        {
            "@type": "Person",
            "name": "Arnold Schwarzenegger",
            "url": "/name/nm0000216/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4700,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023070/"
        },
        {
            "@type": "Person",
            "name": "Charles Gaines",
            "url": "/name/nm0301310/"
        },
        {
            "@type": "Person",
            "name": "Bob Rafelson",
            "url": "/name/nm0706182/"
        }
    ],
    "datePublished": "1976-05-10",
    "description": "So-called 'special agent' infiltrates into the gym, which is targeted by a dirty business fraud.",
    "director": [
        {
            "@type": "Person",
            "name": "Bob Rafelson",
            "url": "/name/nm0706182/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDgyNTcwNzktNzAwZS00YmI1LWJiNzYtZDllNWU4NmM5ZGZkXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "birmingham alabama,based on novel,female rear nudity,bluegrass music,bodybuilder",
    "name": "Stay Hungry",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Hey_Sweden"
        },
        "dateCreated": "2021-04-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075268/"
        },
        "name": "One of the unsung films of the 1970s.",
        "reviewBody": "An interesting tale of \"bodybuilding in the New South\", \"Stay Hungry\" was scripted by Charles Gaines and director Bob Rafelson, based on Gaines' novel. Jeff Bridges stars as Craig Blake, product of a rich, upper class Southern family who's gotten mixed up with shady businessmen (among them, guys played by Joe Spinell and Richard Gilliland) in a real estate racket. As part of their latest plan, Craig goes to an old gym to try to convince the owner (R. G. Armstrong) to sell. Instead, Craig finds himself enjoying the company of the regulars. He falls in love with sweet gymnast Mary Tate Farnsworth (Sally Field), and makes friends with fiddle-playing Mr. Universe hopeful Joe Santo (a winning Arnold Schwarzenegger, who gets an official \"introducing\" credit).\n\nAlthough the films' second half is less compelling than the first half, this is still an endearing, eclectic mix of comedy and drama. It works largely due to its time-honoured premise of introducing a character to a world he never knew existed. The camaraderie and atmosphere of this world is well realized by director Rafelson, who helped to really bring the sport of bodybuilding to the mainstream (followed by the documentary \"Pumping Iron\" the following year). There are some decent laughs to be had, and some fairly affecting moments as well.\n\nThe music by Bruce Langhorne & Byron Berline is first rate, and the on-location shooting in Birmingham helps a lot. But the principal value of \"Stay Hungry\" is its talented ensemble. Bridges is ingratiating as usual, Field is simply adorable (and even does a brief nude scene), and Schwarzenegger shows off an easygoing charm; it's no surprise that Arnold would be as good as he is here, since he more or less just has to play himself. I'm sure people who caught this on its first run in 1976 could sense a solid career in the making. This was also a pivotal film for Field, since up to this point she was basically known for her TV roles. Lots of familiar faces in the supporting cast, too: Robert Englund, Roger E. Mosley, Woodrow Parfrey, Scatman Crothers, Fannie Flagg, Joanna Cassidy, Ed Begley Jr., Dennis Fimple, and Dennis Burkley.\n\n\"Stay Hungry\" is largely cheerful, breezy entertainment, with a refreshingly quirky, character-driven plot and some pretty good dialogue. Good fun, with a priceless climax involving bodybuilders taking to the street and then agreeing to pose for a bevy of amused onlookers.\n\nSeven out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "So-called 'special agent' infiltrates into the gym, which is targeted by a dirty business fraud.",
        "duration": "PT2M59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1710867225",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2QxZTQ4ZDktMGU3MS00YzYwLTg0MmItOTAwMTcxY2U1NzAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2QxZTQ4ZDktMGU3MS00YzYwLTg0MmItOTAwMTcxY2U1NzAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-05T17:28:39.421Z",
        "url": "https://www.imdb.com/video/vi1710867225/"
    },
    "url": "/title/tt0075268/"
}