{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Arquette",
            "url": "/name/nm0000274/"
        },
        {
            "@type": "Person",
            "name": "William H. Macy",
            "url": "/name/nm0000513/"
        },
        {
            "@type": "Person",
            "name": "James Russo",
            "url": "/name/nm0751638/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 753,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052980/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0184086/"
        },
        {
            "@type": "Person",
            "name": "Howard Korder",
            "url": "/name/nm0466122/"
        }
    ],
    "datePublished": "2003-01-24",
    "description": "In need of a grubstake, a young man convinces a couple of friends to help him kidnap Frank Sinatra Jr. It's a true story.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Underwood",
            "url": "/name/nm0881038/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjUzM2EzN2UtNmJiOC00MmFmLThmZWYtYTA5YjA2NzBmMjE4XkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "watching tv,reference to the john f. kennedy assassination,locked in a car trunk,timex watch,fbi federal bureau of investigation",
    "name": "Stealing Sinatra",
    "original_info": {
        "id": "Stealing Sinatra_2003",
        "name": "Stealing Sinatra",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2010-10-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0311863/"
        },
        "name": "Recruited From The Gang That Couldn't Shoot Straight",
        "reviewBody": "How well I remember the kidnapping of Frank Sinatra, Jr. which followed closely on the wake of JFK's assassination. At the time I kept thinking why of all celebrities would someone choose Frank Sinatra's family to victimize with all of that man's legal and extralegal resources? \n\nYet three rejects from the gang that couldn't shoot straight actually did that incredible deed which fortunately for them, no harm, no foul and they all got incredibly early paroles. But the story of their trials and jail sentences is not told in this film.\n\nOne factual error that was made was that the strategy of claiming that the whole thing was a publicity hoax that young Sinatra was in on was one used by their defense attorney later on at trial. The three perpetrators didn't claim that right away.\n\nOther than that, William H. Macy, David Arquette, and Ryan Browning are the three kidnappers in a story that sticks pretty factually close to the events as they happen. James Russo does a fine job playing the senior Sinatra, it's like seeing Old Blue Eyes himself. Fortunately the role did not call for singing like Sinatra.\n\nShowtime produced this film for their network and the plot centered around David Arquette playing Barry Keenan the organizer of the plot. His rather amoral character is gone into somewhat, the other two roles of John Irwin (William H. Macy) and Joe Amsler (Ryan Browning) are left kind of up in the air by the script.\n\nStealing Sinatra is a factual retelling of one of the strangest events of the Sixties. A bit above average for a made for TV film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0311863/"
}