{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Phil Cornwell",
            "url": "/name/nm0180504/"
        },
        {
            "@type": "Person",
            "name": "John Sessions",
            "url": "/name/nm0785938/"
        },
        {
            "@type": "Person",
            "name": "Ronni Ancona",
            "url": "/name/nm0025852/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 488,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0135628/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0164761/"
        },
        {
            "@type": "Person",
            "name": "Phil Cornwell",
            "url": "/name/nm0180504/"
        },
        {
            "@type": "Person",
            "name": "Peter Richardson",
            "url": "/name/nm0724724/"
        },
        {
            "@type": "Person",
            "name": "John Sessions",
            "url": "/name/nm0785938/"
        }
    ],
    "datePublished": "2004-10-22",
    "description": "As the Beatles did in the 1960s, Michael Caine convinces Jack Nicholson, Joe Pesci, Al Pacino, Mick Jagger and Keith Richards to move to Stella Street, an unassuming residential area of Surrey. But along with the new neighbors com...",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Richardson",
            "url": "/name/nm0724724/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDVlMDdkMDEtZDQzYi00YTZjLTgxNTgtZWNlYWUwZTFmNjlkXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "timeframe 1960s,underage girl,narcissism,alternative comedy,street in title",
    "name": "Stella Street",
    "original_info": {
        "id": "Stella Street_2004",
        "name": "Stella Street",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-03-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0360025/"
        },
        "name": "Not quite as good as the sketch-like series, but still quite funny for fans",
        "reviewBody": "In the 1960's, the Beatles took up residence in a small suburban street starting a minor trend for celebrities moving into the unassuming Stella Street. Decades later, in the 1990's, Michael Caine convinces Jack Nicholson to move into the street, bringing a load of other Hollywood stars to the area including Joe Pesci, Al Pacino and two of the Rolling Stones. However the influx of stars brings burglars, tourists and a criminal plot to rob the stars of all their money.\n\nIf you have never seen the 10 minute programmes that make up the series Stella Street, this film version is certainly not the place to start! The rough impressions and rather loose plots and storylines will almost certainly not be to everyone's tastes - a fact that was reflected in the film going straight to video and being screened on the BBC within a week of it being released. Can't understand the logic to that myself - why not just wait a few months at least and keep it quiet, that way at least fans will buy it not knowing it was due to TV.\n\nAnyway, not being a massive fan, I forced myself to wait the week to see it on TV and save myself £15 (nice job BBC - that'll recoup your million investment!). The film manages to do a better job at creating a plot than series three did, but is still a bit episodic until the final 25 minutes where the stars lose their cash. The first 10 minutes will also be quite meaningless for fans as it just sets up the street and why all the stars are there. In some ways the film actually steps backwards as we have Dustin Hoffman moving into Hill's house here where he already had in the series. It still works pretty well though; the characters are funny for the same reasons they were in the series - being juxtapositioned with the English suburb and having their characters and mannerisms exaggerated. If you enjoy the series for what it is then it is likely you will enjoy this film. The plot may not be great but that shouldn't be a problem if you are used to the episodic nature of the series.\n\nThe cast (all three of them) are really good. The impressions are never spot on but many of them sound pretty good and the fact that they aren't the actual people is part of the joke! Sessions and Cornwall work together really well and the `shooting from back of head' trick when they are playing two characters in the same scene is not overused or very obvious. The addition of Ancona is important to move the plot forward, but she also gets a few funny parts as Madonna and Posh Spice.\n\nOverall I enjoyed this film but then I have always enjoyed the series. If you are a fan then this will be good enough for you but it is an acquired taste that will likely alienate as many first time viewers as it pleases."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT1M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1384841497",
        "name": "Stella Street",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2YxMDc4YWQtNmUzMC00Mzg1LThmYTItOTg2ZTJhNGUwZDliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2YxMDc4YWQtNmUzMC00Mzg1LThmYTItOTg2ZTJhNGUwZDliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:17:07Z",
        "url": "https://www.imdb.com/video/vi1384841497/"
    },
    "url": "/title/tt0360025/"
}