{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbara Stanwyck",
            "url": "/name/nm0001766/"
        },
        {
            "@type": "Person",
            "name": "John Boles",
            "url": "/name/nm0092900/"
        },
        {
            "@type": "Person",
            "name": "Anne Shirley",
            "url": "/name/nm0794297/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5862,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016710/"
        },
        {
            "@type": "Person",
            "name": "Sarah Y. Mason",
            "url": "/name/nm0556945/"
        },
        {
            "@type": "Person",
            "name": "Victor Heerman",
            "url": "/name/nm0373511/"
        },
        {
            "@type": "Person",
            "name": "Olive Higgins Prouty",
            "url": "/name/nm0698989/"
        }
    ],
    "datePublished": "1937-08-06",
    "description": "A working-class woman is willing to do whatever it takes to give her daughter a socially promising future.",
    "director": [
        {
            "@type": "Person",
            "name": "King Vidor",
            "url": "/name/nm0896542/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmE3YTMzZWItMWFhYi00MzIzLTk4OTEtZWE5OTljZjYwMzUzXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "class differences,self sacrifice,mother daughter relationship,sacrificing for one's child,character name as title",
    "name": "Stella Dallas",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Doylenf"
        },
        "dateCreated": "2004-05-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0029608/"
        },
        "name": "The mother of all soap operas...",
        "reviewBody": "BARBARA STANWYCK knew a good, earthy role when she saw it--and knew she could do justice to STELLA DALLAS. And she does. But still, there are times when the sentiment is poured on just a bit too thick for current taste--and there are scenes where she is almost a caricature of the vulgarized creature she has become. Stanwyck's fans will probably count this among her best--but I have to admit I prefer her way with comedy in THE LADY EVE or her way with wickedness as the femme fatale of DOUBLE INDEMNITY. Here she's a good actress--but the performance is a bit mechanical at times. As for the story itself, well it is pure unadulterated soap opera and no amount of acting skill can make us forget we're watching a teary drama of sacrificial mother love. \n\nA more subtle drama of this kind of sacrifice came later in films such as TO EACH HIS OWN--done with even more honesty and skill than the script permits here. John Boles is as bland as ever in his role as Stella's rich (and rather stuffy) husband; and Alan Hale reminds us that he was one of the most watchable character actors, no matter how obnoxious his roles were. Anne Shirley does nicely as the daughter Stanwyck is willing to sacrifice for--but the truth is, it all seems a bit old-fashioned and must have seemed so even back in 1937.\n\nStill, there is no denying the interest in seeing how Stanwyck plays Stella. There are times when she makes the emotions seem as natural, real and raw as they could possibly be. All in all, a satisfying soap opera under King Vidor's direction.\n\nExcellent support from handsome young Tim Holt as Anne's boyfriend and Barbara O'Neil as an understanding wife who sympathizes with Stanwyck's plight."
    },
    "url": "/title/tt0029608/"
}