{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sting",
            "url": "/name/nm0001776/"
        },
        {
            "@type": "Person",
            "name": "Dominic Miller",
            "url": "/name/nm0588244/"
        },
        {
            "@type": "Person",
            "name": "Manu Katché",
            "url": "/name/nm0441207/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 132,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0144201/"
        }
    ],
    "director": [
        {
            "@type": "Person",
            "name": "Lawrence Jordan",
            "url": "/name/nm0975333/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGFkYjhlYzktNmM0ZS00YTYyLTlkYTUtN2E2Yjk2OGYzZWY5XkEyXkFqcGdeQXVyNjg0ODg0OTA@._V1_.jpg",
    "keywords": "concert film,pop music",
    "name": "Sting: The Brand New Day Tour - Live from the Universal Amphitheatre",
    "original_info": {
        "id": "Sting: The Brand New Day Tour_2000",
        "name": "Sting: The Brand New Day Tour",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Anscules"
        },
        "dateCreated": "2001-10-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0271804/"
        },
        "name": "Blah... take it from a fan - this is dull.",
        "reviewBody": "I have been a fan of Sting since The Police - which still reigns as my favorite non-Beatles/Rolling Stones rock band - and have seen him live 4 times. This concert \"film\" is dreadfully similar to the live shows (and their videos) of the past. Though some of the band has changed and there are some 'new' songs, most of this is old hat for people who have anything to do with Sting. I don't think the stage concept has changed since The Soul Cages tour and Sting sings these songs EXACTLY the same way over and over - some for going on 20 years or more. How can he do it???\n\n The key word is bland. The crew making the video does absolutely nothing new for this kind of thing (admittedly, it's hard!), and resorts to concert film cliches many times. Sting is so bored with the goings-on, he hasn't even memorized his own lyrics! You can catch him squinting at a music stand more than several times.\n\nThankfully, Sting's music has changed with every album (certainly, he does have his ever-recurring elements). I got bored with the live version of his shows after seeing the Mercury Falling show, which was just like the 10 Summoners show, which was just like the Soul Cages show... Seeing this concert on video makes me very happy I saved my $50 when this gig rolled through Dallas last year.\n\nGo buy the \"Brand New Day\" album instead.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0271804/"
}