{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Melanie Griffith",
            "url": "/name/nm0000429/"
        },
        {
            "@type": "Person",
            "name": "Tommy Lee Jones",
            "url": "/name/nm0000169/"
        },
        {
            "@type": "Person",
            "name": "Sting",
            "url": "/name/nm0001776/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4230,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038231/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019383/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000063/"
        },
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "description": "A crooked American businessman tries to push the shady influential owner of a nightclub in Newcastle, England to sell him the club. The club's new employee and the American's ex lover fall in love and inadvertently stir the pot.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Crime",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTNkMGVmY2UtYTY3YS00ODcwLWE0OWQtZTAzY2Y1Njc5ZTdkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "criminal,female rear nudity,club,nightclub,newcastle",
    "name": "Stormy Monday",
    "original_info": {
        "id": "Stormy Monday_1988",
        "name": "Stormy Monday",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AZINDN"
        },
        "dateCreated": "2005-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096180/"
        },
        "name": "Sting, Sean, and Tommy Lee In Newcastle for Profit",
        "reviewBody": "Cosmo (Tommy Lee Jones) is an American businessman with lots of connections, most under the table, who arrives in Newcastle on Tyne to seal deals. The celebration of \"America Week\" in England announces the malling of Great Britain as American monies of dubious sources invaded while the Thatcher government turned its head. Into this cesspool, Kate (Melanie Griffith) a local waitress and formerly an \"escort\" for Cosmo is recruited to play nice to business associates he sends her way. Rolling over the small business owners like Finney (Sting) a jazz club owner, Cosmo has no qualms about getting what he wants whether by legit or illegitimate means.\n\nA sub-storyline to the economic takeover by Cosmo is the love story between Kate and Brendan (Sean Bean), an Irish laborer who cleans toilets in Finney's club, but over hears the plans of two London seedy types who discuss how to make sure Finney sells the Kit Kat Klub to Cosmo. After informing Finney of their intentions, Brendan's loyalty is rewarded by his elevation to a go-for babysitting a progressive jazz band, the Krakow Jazz Ensemble who need to be picked up at the airport for a weekend gig. While Brendan carts the band around town, he falls in love with Kate. During their time together, Kate and Brendan are jumped and beaten by the roughs who surround Cosmo. The drama is predictable until a surprise twist and unexpected negotiation change the dynamic, and saves the film.\n\nThe story line entwine to provide worthwhile entertainment for an hour and forty minutes, and the actors all provide solid performances. The soundtrack is a nice mix of 80s Brit sounds and cerebral jazz tunes with Sting doing a solo bass bit mid-film although he does not sing. Tommy Lee Jones is wonderful with an evil yet subtle humor to his business dealings and the sight of a young, buff and naked Sean Bean is delightful.\n\nA good afternoon film for a rainy day, if only for the performances by actors not usually cast together, and for director, Mike Figgis, an underrated early film worth checking out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT1M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1234436377",
        "name": "Stormy Monday",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWExMmJiOWMtM2NjMC00MDEwLWFlNTItYTNjMmUzOGZmYjViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWExMmJiOWMtM2NjMC00MDEwLWFlNTItYTNjMmUzOGZmYjViXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:54:31Z",
        "url": "https://www.imdb.com/video/vi1234436377/"
    },
    "url": "/title/tt0096180/"
}