{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Surindra Bhandari",
            "url": "/name/nm0080211/"
        },
        {
            "@type": "Person",
            "name": "Howard Bluestein",
            "url": "/name/nm0089575/"
        },
        {
            "@type": "Person",
            "name": "Hal Holbrook",
            "url": "/name/nm0001358/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 141,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053632/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036477/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056188/"
        },
        {
            "@type": "Person",
            "name": "Mark Olshaker",
            "url": "/name/nm0647833/"
        }
    ],
    "datePublished": "1995-10-18",
    "description": "Follow the people who follow the storms. Prepare to take a ride inside some of the most extreme weather conditions experienced on earth.",
    "director": [
        {
            "@type": "Person",
            "name": "Greg MacGillivray",
            "url": "/name/nm0532263/"
        }
    ],
    "duration": "PT38M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4NzA5MjIyNV5BMl5BanBnXkFtZTcwMDY0MDYyMQ@@._V1_.jpg",
    "keywords": "weather,hurricane,tornado,storm chasing,storm chaser",
    "name": "Stormchasers",
    "original_info": {
        "id": "Stormchasers: IMAX_1995",
        "name": "Stormchasers: IMAX",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "StevePulaski"
        },
        "dateCreated": "2015-06-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114553/"
        },
        "name": "A film of cleverly designed trickery and you're the fool",
        "reviewBody": "I suppose if you're willing to ignore about the subsequent twenty-nine minutes of Stormchasers's thirty-eight minute contents, then I suppose you'll be in for a fairly positive experience. The latter twenty-nine minutes of the film is a \"making of\" documentary that has director Greg MacGillivray and company showing you how him and the crew worked to capture the shots of tornadoes and monsoons that they did. While during this segment, you're likely expecting to see up close, tantalizing images of how the cast and crew risked their lives to capture the footage we just watched, disappointment will set in quickly when you realize that most of the crew pridefully tout the ample amounts of inauthentic sequences and reused footage, which was used throughout the film. Shots such as a plane experiencing turbulence, a monsoon occurring in India, and cramped scenes of a crowded passenger crew on an aircraft all involved some sort of rehearsed trickery to fool the audience due to fortunate circumstances or added intensity.\n\nThis disappoints immensely, and had this documentary been show subsequently or interwoven with the thirty-eight minute long Stormchasers, I'm convinced that it would've prompted a different reaction. The short film comes up a time when the IMAX theater was a brand new concept, boldly showcasing a larger, bolder sound, and enhanced resolution for the quintessential movie-going experience that made you a more engaged and attentive viewer. Stormchasers is one of the many documentaries that was released to showcase the medium and try and provide audience with science about things they would perhaps question in their daily life (this is also before The Weather Channel became a network for reality TV). Today, IMAX theaters continue to release these kind of exclusive documentaries, but on a much more sporadic, infrequent schedule.\n\nStormchasers allegedly opens by showing us a monsoon occurring in the middle of India, with villagers getting poured on and young children basking in the glory of persistent, ostensibly neverending rainfall. In the \"Making of\" documentary, however, we are told that India was experiencing one of their worst droughts in recent memory during the time of filming, leaving the crew no choice but to hire some local firefighters with monstrous hoses to drench the villagers and make it look like a monsoon was actually occurring. During a scene on a P-3 weather plane, where turbulence is rocking the aircraft back and forth, we see in the \"making of\" documentary that the crew was instructed when to act as if the plane was jostling them around and are told that the real turbulence of the airplane made you question how a plane could stay in tact during such violent conditions. My question - what happened was that footage? Did it get lost in the mail? \n\nOnce this information is revealed, it's as if MacGillivray and company are less informing audiences about the perilous conditions of hurricanes, monsoons, and tornadoes and simply playing their audience for fools by using all sorts of on-camera trickery, disguising it as a tremendous, high-octane experience in high revolution when it's nothing more than phoniness. The selling point of the short is its inclusion of a real life tornado, which is enormous and allegedly (I will use this term quite a bit when discussing the short in the future) put the crew's life in danger. By the time we come to see this tornado, while the videography is clear and Kevin Williams' score gets us in the mood for some action, Stormchasers has already bored us on its own with its dry narration and mostly vanilla presentation, even if one doesn't know most of what their seeing is fake. This isn't a very exciting film, despite dealing with hair-raising subject matter, and the fact that it proudly notes its artificiality makes its existence all but unjustifiable.\n\nDirected by: Greg MacGillivray.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Stormchasers",
        "duration": "PT1M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3146449177",
        "name": "Stormchasers",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmEyYjg1YWYtMzllOS00OGY0LThjMWYtYjNhMmRmZDU4Njk0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmEyYjg1YWYtMzllOS00OGY0LThjMWYtYjNhMmRmZDU4Njk0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:18:12Z",
        "url": "https://www.imdb.com/video/vi3146449177/"
    },
    "url": "/title/tt0114553/"
}