{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean C. Casey",
            "url": "/name/nm1791062/"
        },
        {
            "@type": "Person",
            "name": "Reed Timmer",
            "url": "/name/nm1665478/"
        },
        {
            "@type": "Person",
            "name": "Joel Taylor",
            "url": "/name/nm3019836/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 914,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0132156/"
        }
    ],
    "datePublished": "2007-10-17",
    "description": "Storm chasers are chasing storm for powerful tornado in history.",
    "genre": [
        "Documentary",
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM4MDg0OTQzOV5BMl5BanBnXkFtZTcwNzA1MDIyNQ@@._V1_.jpg",
    "keywords": "driving,storm chaser,severe weather,thunderstorm,tornado",
    "name": "Storm Chasers",
    "original_info": {
        "id": "Storm Chasers_1988",
        "name": "Storm Chasers",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Brian_"
        },
        "dateCreated": "2009-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0907833/"
        },
        "name": "Best. Tornado chasing. Videos. Ever.",
        "reviewBody": "Most of us have seen storm chasing documentaries in our lifetime, wondering in awe at those magnificent, terrifying acts of nature called tornadoes. The problem, though, is that after awhile, we're used to the script: A team comes in with either the latest technology or just a rogue group of storm chasers, goes into a dangerous storm, and captures some cool footage and/or data. That's all well and good, but in the end, it's not much more than eye candy.\n\nStorm Chasers, by contrast, takes this to a whole new level. By expanding single shows into full-season episodes, and by focusing just as much on the individual storm chasers as the storms themselves, we get to know them as real humans and not just random people. We become interested in how the individuals react differently to the exact same storms, and after awhile we learn what their hot buttons are and what makes them tick. We see the contrasts in Josh's methodical style, Sean's aggressiveness and lack of patience, and Reed's frat-boy-like attitude. It's almost as much fun to watch the personalities bounce off one another as it is to watch them pursue their targets. Part of those differences stem from the fact that the lead characters all have different goals. Josh wants to gather radar- and probe-based data from tornadoes; Reed wants to get up-close film of tornadoes to sell to media outlets; and most notably, Sean wants to take his 16,000-pound behemoth Tornado Intercept Vehicle right into a tornado, film it from the inside, and sell the footage to IMAX.\n\nThat said, it really wouldn't be accurate to describe Storm Chasers as a reality show. This IS about storm-chasing, and that remains the focus of this show. There is some excellent footage throughout the series. It gets downright terrifying on more than one occasion, because remember, having gotten attached to the individual characters, you don't want anything bad to happen to them. Considering that this is a non-staged, nonfiction story makes this all that much more intense.\n\nWhether you're a tornado guru or don't even know the difference between a cold front and a warm front, odds are very good that you'll like Storm Chasers. It has a style comparable to Deadliest Catch; chances are if you like Deadliest Catch, you'll like Storm Chasers as well. Personally, I absolutely love it. I'm currently halfway through the DVDs of the second season, and I'm completely glued to it. It is that good.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0907833/"
}