{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Will Ferrell",
            "url": "/name/nm0002071/"
        },
        {
            "@type": "Person",
            "name": "Emma Thompson",
            "url": "/name/nm0000668/"
        },
        {
            "@type": "Person",
            "name": "Dustin Hoffman",
            "url": "/name/nm0000163/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 231676,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0142446/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0183490/"
        },
        {
            "@type": "Person",
            "name": "Zach Helm",
            "url": "/name/nm1590998/"
        }
    ],
    "datePublished": "2006-11-10",
    "description": "I.R.S. auditor Harold Crick suddenly finds his mundane Chicago life to be the subject of narration only he can hear: narration that begins to affect his entire existence, from his work to his love life to his death.",
    "director": [
        {
            "@type": "Person",
            "name": "Marc Forster",
            "url": "/name/nm0286975/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmE2ZjYwNGYtYWMyMS00M2I0LWI4NDEtMzc1MTllMjk0ZmFmXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
    "keywords": "author,fate,professor,novelist,writer",
    "name": "Stranger Than Fiction",
    "original_info": {
        "id": "Stranger Than Fiction_1999",
        "name": "Stranger Than Fiction",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "imagineer99"
        },
        "dateCreated": "2006-11-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0420223/"
        },
        "name": "Strangely Addicting",
        "reviewBody": "With his unassuming eyes and sheepish, \"awe shucks!\" demeanor, Will Ferrell is quite simply the guy you root forthe eternal boy trapped in a gangly 6'3\" frame. Just a single look can make you giggle and smile so effortlessly that you're often unaware that you're actually doing it. It is with this notion that Stranger than FictionFerrell's first major foray into a theatrical world outside the realm of in-your-face frat boy sillinessjust makes sense. By surrounding Ferrell's charisma with a subdued, darkly comic script and a talented supporting cast, we get a film that is both fresh and heartfelt. \n\nDirected by Marc Forster and penned by Zach Helm, Stranger than Fiction is an odd mix-mash, combining a standard comedy with existentialist ideas. Number crunching IRS agent and genuine loser, Harold Crick (Ferrell) one day wakes up to find his life being narrated word for word by burnt out writer Karen Eiffel (Emma Thompson). Odd thing is, Eiffel is writing an actual book where Crick just happens to be the main character. To make matters worse, she plans on killing him off as soon as she can make it through a particularly arduous stretch of writer's block.\n\nOriginality is one thing that is absent from a majority of contemporary Hollywood pictures, so Fiction immediately gets points for simply trying something different. I suppose it's icing on the cake that the film is genuinely good. Crick, knowing that is death is imminent, begins to break out of his cloistered shell and to experience the fruits of his life. And, in the process he forms a bond with a tax breaking baker (Gyllenhal) and seeks advice from a literature professor, played by a particularly charming Dustin Hoffman \n\nHowever, even though it is well intentioned, the execution isn't flawless. The romance that develops between Gyllenhal's outcast baker and Ferrell's strait-laced Crick doesn't feel entirely organic. We admire the relationship and smile at its sugar coated sweetness, but we don't necessarily believe their connection. It may taste good, but it doesn't exactly wash down smoothly. Neither, does the film's over reliance on reinforcing generic, \"Carpe Diem\" philosophies. Towards the second act, things do get sappy. Luckily, by the conclusion, the plot has bounced back to a wonderful limbo of both oddly comic and genuinely heartwarming moments.\n\nFor all its flaws, Stranger than Fiction, works. Like a good novel, Forster has fashioned something that is strange, stylistic, and unexpectedly inspiring. And, despite the chinks in its existentialist armor, that's surely something worth writing home about.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2710241561",
        "name": "Stranger Than Fiction",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmRlZDQ1MjQtMjIwOS00YTE5LTg3MjQtNDU4ZTg1ZmI4MjA5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmRlZDQ1MjQtMjIwOS00YTE5LTg3MjQtNDU4ZTg1ZmI4MjA5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:18:31Z",
        "url": "https://www.imdb.com/video/vi2710241561/"
    },
    "url": "/title/tt0420223/"
}