{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rock Hudson",
            "url": "/name/nm0001369/"
        },
        {
            "@type": "Person",
            "name": "Gina Lollobrigida",
            "url": "/name/nm0518178/"
        },
        {
            "@type": "Person",
            "name": "Gig Young",
            "url": "/name/nm0949574/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1021,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0867811/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019262/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043287/"
        },
        {
            "@type": "Person",
            "name": "Norman Panama",
            "url": "/name/nm0659085/"
        },
        {
            "@type": "Person",
            "name": "Melvin Frank",
            "url": "/name/nm0291035/"
        },
        {
            "@type": "Person",
            "name": "Michael Pertwee",
            "url": "/name/nm0675728/"
        }
    ],
    "datePublished": "1965-02-10",
    "description": "Carter meets Toni and impulsively marries her to find that they disagree on everything. They separate and seven years later on the eve before their divorce they meet again and spend the night together.",
    "director": [
        {
            "@type": "Person",
            "name": "Melvin Frank",
            "url": "/name/nm0291035/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDc2YmYzZGMtMGJiZi00Zjg5LTlhODMtZjZmNjhlNjM1NTVhXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "prologue,marriage,man wears boxer shorts,voice over narration,begins with once upon a time",
    "name": "Strange Bedfellows",
    "original_info": {
        "id": "Strange Bedfellows_1965",
        "name": "Strange Bedfellows",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jayraskin1"
        },
        "dateCreated": "2010-07-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058621/"
        },
        "name": "Enjoy the First Ten Minutes, The Comedy Stops After It",
        "reviewBody": "This film will make you appreciate how well written and well directed the Rock Hudson/Doris Day romantic comedies were.\n\nHudson has a tendency to be stiff, but here it is worse than I've ever seen it. Gina Lollobrigida was 38 and possibly because her character is supposed to be a political activist, she doesn't wear much make-up. She looks rather plain and not glamorous, so it is a mystery why Hudson falls for her. If you're expecting the Italian sex symbol, Gina Lollobrigida, this is not the film. Gig Young plays the Tony Randal sidekick part to Hudson. Young is a good actor, but really is too handsome for the sidekick role.\n\nThere is no reason I can think of to watch this film, except for perhaps a short scene where Rock Hudson wakes up in bed with another man. Hudson is quite calm about it. Lollobrigida explains that he had no other place to sleep, so she put him in bed with Hudson. She asks Hudson if he minds. He answers that he doesn't mind. It is only because of what we know now about Hudson's sexuality that the scene is funny and sticks out. I an pretty sure that this is the only film where Hudson is in bed with another man.\n\nThe movie's 1950's puritanical tone destroys the sex comedy aspect. Since this was made in 1965, when censorship was ending, it is unfortunate that the producers didn't seek to take advantage of the new freedom. For example. Gina is a member of a group that supposedly supports artist's freedom of expression. The group has Gina ride nude on a horse like Lady Godiva to protest an artist's censorship. However Gina doesn't really go nude, but wears a flesh colored body stocking. This destroys the whole point of the protest and destroys any hope of the viewer seeing Gina looking sexy.\n\nSo, in summation, if you want to see Rock Hudson's dullest performance, Gina Lollobrigida's least sexy performance, and Gig Young as a bumbling sidekick, this is the movie for you.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0058621/"
}