{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matt Letscher",
            "url": "/name/nm0504762/"
        },
        {
            "@type": "Person",
            "name": "Carrie Preston",
            "url": "/name/nm0696387/"
        },
        {
            "@type": "Person",
            "name": "Adam Greer",
            "url": "/name/nm1377079/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 849,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0090815/"
        },
        {
            "@type": "Person",
            "name": "Richard Day",
            "url": "/name/nm0206556/"
        }
    ],
    "datePublished": "2004-03-04",
    "description": "In 1950's Hollywood, movie star Guy Stone must marry a studio secretary in order to conceal his homosexuality. Sally has no idea her marriage is a sham, though, and turns Guy's life upside-down. Then he falls in love.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Day",
            "url": "/name/nm0206556/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc2ODg5MTI3Nl5BMl5BanBnXkFtZTcwMTU3NjcyMQ@@._V1_.jpg",
    "keywords": "masculinity,homosexuality,gay relationship,muscular,timeframe 1950s",
    "name": "Straight-Jacket",
    "original_info": {
        "id": "Straight-Jacket_2004",
        "name": "Straight-Jacket",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "saltsan"
        },
        "dateCreated": "2005-02-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0367097/"
        },
        "name": "Great gay comedy!",
        "reviewBody": "I wasn't expecting too much out of this little gay indie, but I was happily surprised at how much I ended up liking the characters, laughing at the jokes, and being delighted by the cinematography and art design. With the exception of some of the exterior shots (some done with CGI and some with grainy stock footage), the film looks exactly like a vintage production from the late-Fifties or early-Sixties, which is the era in which the film is set. In fact it's a perfect pastiche of the old Rock Hudson Universal comedies of that time like \"Lover Come Back\" and \"Man's Favorite Sport?\" \n\nThe characters, for their part, at first come across as being a bit annoying. A surprisingly buffed-up Matt Letscher (who played the anchorman character in the TV sitcom \"Good Morning, Miami\") is a closeted gay movie star in the Fifties (based on Rock Hudson) whose promiscuousness is matched only by his vanity; Carrie Preston plays a dippy studio secretary who's conned into marrying the actor as a \"front\" to the public; and Veronica Cartwright (looking a bit like Joan Crawford in the 1964 horror film called \"Straight-Jacket\") is his ball- busting, dyky agent.\n\nEventually, these characters do come to actually seem somewhat lovable, if not exactly like three-dimensional human beings. Letcher, when he finally falls in love with a man (the slightly dorky but utterly adorable newcomer Adam Greer) ends up seeming almost gallant in a Cary Grant sort of way. Preston, while she never loses her cartoony quality, ends up especially after a fun musical numberseeming as delightful as she does ditzy. Her performance winds up being much like that of Ellen Greene's in \"Little Shop of Horrors\", a film with which this one has much in common.\n\nBest of all is Veronica Cartwright, who plays Guy's agent Jerry. She's an absolute delight. She's always been one of those actresses who commands the screen whenever she's on it. Her short little part in \"Kinsey\" (virtually a cameo) as Alfred Kinsey's mother was perhaps the best performance in that film. As the other woman, besides Sigorney Weaver, in the first \"Alien\", she delivered a masterpiece of on-screen hysteria that should have gotten her an Oscar nomination. Here, doing broad comedy, she practically steals the show. Simple little throwaway lines like: \"Can I just say that's beautiful and retarded?\" become dialogue classics in her hands. \n\nFinally, the look of the film is beautiful. In creating a pastiche of 50s/60s Hollywood, it comes close to the bigger budget but not nearly as good Renee Zellweger film \"Down With Love\" from 2003. I strongly disagree with the review here that says this is a good film but more of a DVD rental than a \"go out and see it\" movie. Half the film's charm is in its Technicolor CinemaScope big-screen splendor. \n\nIn short, \"Straight-Jacket\" is a great little gay date movie. It's much better than, though similar to, a number of other gay indies I've seen recently like \"Eating Out\", \"Slutty Summer\", and \"The Broken Hearts Club\". It's not going to win any Academy Awards at the end of the year (not that comedies do anyway!) but if you want a fun big-screen film with a gay focus, you can't do much better than this screwball gem.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In 1950's Hollywood, movie star Guy Stone must marry a studio secretary in order to conceal his homosexuality. Sally has no idea her marriage is a sham, though, and turns Guy's life upside-down. Then he falls in love.",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1872019993",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmU0NTkwNTAtNTYzMS00OTdlLWE4NjAtNDIxY2JhYzgwZThkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmU0NTkwNTAtNTYzMS00OTdlLWE4NjAtNDIxY2JhYzgwZThkXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-04-27T00:14:15.927Z",
        "url": "https://www.imdb.com/video/vi1872019993/"
    },
    "url": "/title/tt0367097/"
}