{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James McAvoy",
            "url": "/name/nm0564215/"
        },
        {
            "@type": "Person",
            "name": "Catherine McCormack",
            "url": "/name/nm0001517/"
        },
        {
            "@type": "Person",
            "name": "Julian Glover",
            "url": "/name/nm0002103/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4309,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037907/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107392/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024285/"
        },
        {
            "@type": "Person",
            "name": "Naja Marie Aidt",
            "url": "/name/nm1409701/"
        },
        {
            "@type": "Person",
            "name": "Anders Rønnow Klarlund",
            "url": "/name/nm0754050/"
        }
    ],
    "datePublished": "2005-05-27",
    "description": "A Prince leaves his city and sets off to avenge his father, not aware his father wasn't murdered, and in reality, committed suicide, and soon learns the truth about his people from a warrior woman.",
    "director": [
        {
            "@type": "Person",
            "name": "Anders Rønnow Klarlund",
            "url": "/name/nm0754050/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM1OTM5MjUyM15BMl5BanBnXkFtZTcwNDA1MzAzMQ@@._V1_.jpg",
    "keywords": "string,revenge,puppet,marionette,king",
    "name": "Strings",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Malte006"
        },
        "dateCreated": "2005-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0374248/"
        },
        "name": "Technically original stunning; a shame the story isn't",
        "reviewBody": "Strings Directed by Anders Rønnow-Klarlund (2004) The young prince Hal seeks to avenge his father, the king, for the murder made against him. This means travelling in disguise to infiltrate the enemy camp. But his journey brings him another truth than the one he original was seeking after.\n\nThis is one of the most original Danish movies made in a long time. Never has there been a Danish movie featuring only puppets as the actors of the movie. The technical element of the movie is great. Brilliantly cinematography means that this movie is captured as another \"live action movie\" in its genre. The art-direction is beautiful and fits the puppets very well. The sound effects-/monologue editing is superb and helps create a great atmosphere, along together with the above-mentioned aspects.\n\nThis means that it is a pity the story isn't nearly as original as the technical aspects. It is a very typical fantasy/adventure bringing no big surprises. It is shaped very dramatically, leaving no form for humour or funny sidekicks in the movie. This serious take at the story can be pretty linear at times, but if you have the patience to watch through this it can be interpreted as a good sign. Another shame is that there are no facial expression on the puppets, unlike other puppet movies like Team America: World Police. The puppets have the same expression on their faces through the whole movie; which doesn't help the emotional part of the movie.\n\nThe movie has some weak points, but even though it is still a good movie, and a very original and refreshingly technical take on the puppet movie genre.\n\n7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0374248/"
}