{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matt Damon",
            "url": "/name/nm0000354/"
        },
        {
            "@type": "Person",
            "name": "Greg Kinnear",
            "url": "/name/nm0001427/"
        },
        {
            "@type": "Person",
            "name": "Eva Mendes",
            "url": "/name/nm0578949/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 54012,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030016/"
        },
        {
            "@type": "Person",
            "name": "Charles B. Wessler",
            "url": "/name/nm0921853/"
        },
        {
            "@type": "Person",
            "name": "Bennett Yellin",
            "url": "/name/nm0947395/"
        },
        {
            "@type": "Person",
            "name": "Peter Farrelly",
            "url": "/name/nm0268380/"
        }
    ],
    "datePublished": "2003-12-12",
    "description": "Conjoined twins from Martha's Vineyard move to Los Angeles so that one of them can pursue an acting career.",
    "director": [
        {
            "@type": "Person",
            "name": "Bobby Farrelly",
            "url": "/name/nm0125803/"
        },
        {
            "@type": "Person",
            "name": "Peter Farrelly",
            "url": "/name/nm0268380/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYwODE1MTc3NF5BMl5BanBnXkFtZTcwMjQxMzQyMQ@@._V1_.jpg",
    "keywords": "internet,conjoined twins,motel,porn star,2000s",
    "name": "Stuck on You",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jharvey-4"
        },
        "dateCreated": "2004-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338466/"
        },
        "name": "Farrelly Brothers Deeply Conflicted...",
        "reviewBody": "I'm actually a big Farrelly Brothers fan (and not just because they're from Rhode Island). So, it's with great reluctance that I write a less than stellar review of \"Stuck On You\".\n\nIt's not a horrible film, but like many recent Farrelly releases it's muddled and illustrates a tug of war between the movies the Farrellys want to make the and movies the Farrelly's fans want them to make.\n\n\"Stuck On You\" tells the tale of Bob and Walt Tenor, conjoined twins who live a good, peaceful life on Nantucket Island. That is until Walt (played by Greg Kinnear) catches the acting bug and wants to move to LA. The story and gags from there mostly revolve around a fish-out-of-water story (but two fish joined at the side) and the brothers' ongoing ignorance of their own condition.\n\nAt one point, Bob (played by Matt Damon) tells Walt that he'll never make it in acting. Why? Because he needs a better tan. Though these aren't the idiot gags that we all enjoyed in \"Dumb & Dumber\". In fact, both of the brothers are very bright. Their ignorance is more a function of their being so close (physically and emotionally) for such a long period of time and because back home everyone accepted them completely. They've become blind to their own handicap.\n\nIt's a nice message and it is delivered poignantly at times. More often, though, we're hammered with it over and over again while the Farrellys do their best to make the movie look more like one of their more celebrated, more tasteless, and funnier movies like \"Dumb & Dumber\", \"Something About Mary\", or \"Me, Myself and Irene\".\n\nIn all of the latter movies, there was no illusion that we were there primarily there for the gutter chuckles, but each movie also had characters we really liked. Let's face it. We were all rooting for Lloyd and Harry in \"Dumb and Dumber\" even if they were morons.\n\nIn \"Stuck On You\", the main characters are all a lot flatter than what we've seen before. Plus, one of the most disappointing aspects in \"Stuck On You\" is the poor use of the minor characters. In previous movies we got some of our biggest laughs from the sideline characters, while in \"Stuck On You\" they're used mostly as window dressing. Eva Mendes is primarily a cleavage delivery device in \"Stuck On You\", which is a shame because she's not a bad actress and she could have some comedic chops.\n\nHow are Greg Kinnear and Matt Damon in this film? They both do as good as can be expected. We're not used to seeing Damon in comedic films (his last was \"Dogma\"), and I think he does comedy very well. I'm reluctant to comment directly on their performances because it's not fair. The characters are flat and that's not their fault.\n\nSadly, this isn't a fluke for the Farrellys. It's part of an ongoing trend. Their animated movie, \"Osmosis Joe\", more closely resembled a feature-length public health announcement starring Chris Rock and Bill Murray. \"Shallow Hal\" dealt with superficiality in much heavier, dramatic tones than we were led to believe in the movie's trailers.*\n\nIn \"Stuck On You\", the Farrellys try to swerve back to their poop-and-fart-joke roots, but deep down you can tell they want to make more serious, thematic movies.\n\nI would have no problem if the Farrellys decided to do a more serious, dramatic film. I would also have no problem if the Farrellys decided to do more locker-room humor comedies. But I do have a problem with them trying to do both at the same time. It's just not working.\n\n* NOTE - While I'm not shopping for the DVD, I did enjoy \"Shallow Hal\" once I realized (and accepted) that the movie was a lot heavier than the trailers depicted. That said, there were a lot of people in the cinema who were expecting something like \"Dumb & Dumber\" and they were plenty unhappy about it. I don't blame them.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Stuck on You",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2374481433",
        "name": "Stuck on You",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTU5NzY2MzE4M15BMl5BanBnXkFtZTgwOTI0MjYyMDI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTU5NzY2MzE4M15BMl5BanBnXkFtZTgwOTI0MjYyMDI@._V1_.jpg",
        "uploadDate": "2016-10-08T02:56:13Z",
        "url": "https://www.imdb.com/video/vi2374481433/"
    },
    "url": "/title/tt0338466/"
}