{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Demon",
            "url": "/name/nm6194217/"
        },
        {
            "@type": "Person",
            "name": "Kase 2",
            "url": "/name/nm0440468/"
        },
        {
            "@type": "Person",
            "name": "Eric Haze",
            "url": "/name/nm3466178/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3059,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016040/"
        }
    ],
    "datePublished": "2021-03-26",
    "description": "A documentary that exposes the rich growing subculture of hip-hop that was developing in New York City in the late '70s and early '80s, specifically focusing on graffiti art and breakdancing.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Silver",
            "url": "/name/nm0798809/"
        }
    ],
    "duration": "PT1H9M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NjA3NzY3MV5BMl5BanBnXkFtZTYwNTEwNjk5._V1_.jpg",
    "keywords": "breakdance,subway,new york city,hip hop,graffiti",
    "name": "Style Wars",
    "original_info": {
        "id": "Style Wars_1983",
        "name": "Style Wars",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2007-09-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0177262/"
        },
        "name": "Interesting and cool documentary on New York subway graffiti",
        "reviewBody": "I was curious to see how this film played for me because to some degree I am target audience while also not being target audience. I love hip hop (and no, 50 Cent does not fit that category for me so much as Black Star, for example, would) and I like the culture around it of break-dancing and graffiti writing. However on the flip side I do see graffiti on public property (or others' property) as being a nuisance and part of dragging areas down by giving the impression of lawlessness and a lack of safety. Whether it is true that it does encourage crime, it is of little doubt that the clean and well-lit subway stations of modern New York feel a lot less threatening than the ones that you see in this film.\n\nThe film does a good job of showing both sides of argument and, although the focus is the cultural side, it doesn't play down the fact that the graffiti is both creative and a nuisance and that it is possible to see it both ways at the same time. Here we see some great pieces on trains and walls but we also see idiots like Cap who literally spray their names on top of other peoples' work, the former producing some imaginative work that does make the \"art\" claim fly, the latter very much demonstrating the criminal damage side of it. The contributions from the bombers or taggers are mostly good, with plenty of typically Noo Yark characters of all ages and races talking with an energy and passion on the subject as it was happening.\n\nThe link to break-dancing and hip hop is not as strongly made as I would have liked and it doesn't manage to explore the birth of this street culture as well as I would have hoped. That said though it is still interesting to see a documentary about the graffiti trend and have captured it as it was in its heyday before it was stamped out. The film doesn't pander to either side but clearly sides with those being creative and allows the quality of the work to shine through, mostly ignoring those who would just seek to quickly spray their names on a train with nothing else to offer.\n\nNot as culturally important as I would have liked it to have been but nonetheless interesting and cool at the same time and well worth seeing for the real heads."
    },
    "url": "/title/tt0177262/"
}