{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dave Amato",
            "url": "/name/nm0024148/"
        },
        {
            "@type": "Person",
            "name": "Glen Burtnick",
            "url": "/name/nm0123491/"
        },
        {
            "@type": "Person",
            "name": "Kevin Cronin",
            "url": "/name/nm0188776/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 47,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "datePublished": "2000-11-21",
    "description": "Live concert featuring the rock bands Styx and REO Speedwagon, filmed on the 9th/June/2000 at the Riverport Amphitheatre in St. Louis, Missouri, USA. Both bands play their own sets and several songs together as a super-group.",
    "director": [
        {
            "@type": "Person",
            "name": "Kenneth Botelho",
            "url": "/name/nm0098440/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA5NTUzNDA3Nl5BMl5BanBnXkFtZTYwMTI4MjQ5._V1_.jpg",
    "keywords": "rock music,concert film",
    "name": "Styx and Reo Speedwagon: Arch Allies - Live at Riverport",
    "original_info": {
        "id": "Styx | REO Speedwagon: Arch Allies: Live at Riverport_2000",
        "name": "Styx / REO Speedwagon: Arch Allies: Live at Riverport",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LiamABC"
        },
        "dateCreated": "2005-06-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0281238/"
        },
        "name": "Good - but strictly for completest",
        "reviewBody": "OK, first of all, let me say for the record - I DO LIKE this concert. Really, I do. It's a fair spread of hits from two of America's hardest rockin' bands. The performances are very good - especially the jam at the end with both bands on stage doing one of each of their hits all together.\n\nThis was actually the first time I saw anything of Styx live (although I had a couple of live CDs), and also my very first exposure to REO Speedwagon. So it's special in that regard.\n\nHOWEVER - there's a few things that are worth pointing out. They don't as such detract from the show, but it's worth mentioning a few details:\n\n1. Neither band is in its \"classic\" lineup.\n\nThis affected Styx more than it does REO Speedwagon (at least it did for me), as Styx are a band with multiple lead singer-songwriters. And, talented though Lawrence Gowan is, his voice just sounds wrong on \"Lady\".\n\n2. The concert is incomplete.\n\nSince seeing this on video for the first time I have managed to obtain on audio a complete record of the concert. But I had to get three separate CDs to do so: the CD of this, Arch Allies; Styx - At The River's Edge and REO Speedwagon Live Plus.\n\nThere's three songs by Styx and four of REO that are not included on this video/DVD. Actually, in the case of Speedwagon, I've already said this was the first I saw or heard of them, and it later transpired that two of the \"missing\" songs became two of my favourites of theirs (Keep Pushin' and That Ain't Love). So this show very nearly failed to convert me into an REO fan!\n\n3. Alternate releases.\n\nOK, this one needs a little more explaining. With reference to the two points I've already made, if you want a *really* amazing Styx show, you'd be much better off getting \"Return To Paradise\". Apart from Todd Sucherman on the drums replacing John Panozzo who had recently died, this is the classic lineup. As for REO, there are no other shows of theirs available on DVD, but it is possible to find the complete REO set of this show on their Live Plus DVD. Although it should be stressed here that the entire Styx portion of this show is NOT similarly available on video/DVD, and the two-band jam is not available anywhere else.\n\nHowever, for all that, it's still an enjoyable show. Two bands for the price of one, performing a very good selection of songs. My favourites from this show would be (Styx): Brave New World and Blue Collar Man, and (REO): Ridin' The Storm Out and Back On The Road Again.\n\nSo, to sum up - this is strictly for completest. It's not a bad show by any means. It's just that there's better purchases out there.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0281238/"
}