{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cantinflas",
            "url": "/name/nm0134594/"
        },
        {
            "@type": "Person",
            "name": "Sonia Infante",
            "url": "/name/nm0408631/"
        },
        {
            "@type": "Person",
            "name": "Guillermo Zetina",
            "url": "/name/nm0955168/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 607,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051572/"
        },
        {
            "@type": "Person",
            "name": "Marco A. Almazán",
            "url": "/name/nm0021787/"
        },
        {
            "@type": "Person",
            "name": "Cantinflas",
            "url": "/name/nm0134594/"
        },
        {
            "@type": "Person",
            "name": "Carlos León",
            "url": "/name/nm1365877/"
        }
    ],
    "datePublished": "1967-05-03",
    "description": "Lopez, treated derisively by all as Lopitos, is a humble but loyal citizen of Los Cocos Republic who works as an assistant at the chancellery, helping to process visas. Through a sudden series of events, namely the Los Cocos Ambas...",
    "director": [
        {
            "@type": "Person",
            "name": "Miguel M. Delgado",
            "url": "/name/nm0217035/"
        }
    ],
    "duration": "PT2H13M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTAzYmU5N2ItMGFlNC00NzQxLTgzMTgtMjEyYWM2MjYwNDNhXkEyXkFqcGdeQXVyMjI3NzYwODc@._V1_.jpg",
    "keywords": "buxom,chancellor,communism,capitalism,socialism",
    "name": "Su excelencia",
    "original_info": {
        "id": "Su Excelencia_1966",
        "name": "Su Excelencia",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2013-07-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061038/"
        },
        "name": "Sort of like Cantinflas making a Cold War version of \"The Great Dictator\".",
        "reviewBody": "In 1940, Charlie Chaplin released his classic \"The Great Dictator\". It used comedy to draw attention to the evils of Fascism and it ended with a beautiful and impassioned speech about brotherhood. Two and a half decades later, the Mexican comic, Cantinflas, released a film which bore many, many similarities to Chaplin's film. Though the times had changed, here in \"Su Excelencia\", Cantinflas makes fun of the Cold War and the film ends with a very similar sort of speech about brotherhood. Now I am NOT saying this later film is a remake--but I really do think one inspired the other.\n\nThe film is set in a world with countries much like the Soviet and Western Bloc nations but all the names of the nations have been changed. Canfinflas plays Lopito--a lowly employee for his nation's embassy. However, in a funny scene, a dinner party is disrupted when they hear of a coup--and the ambassador is replaced. And, by the time the dinner is complete, three MORE coups occur--leaving Lopito as the new ambassador! Now that he's suddenly an important man, forces from the Red nations (i.e, communists) and Green nations (capitalists) begin pushing him for an upcoming vote--and his is the deciding vote. How Lopito handles all this is quite clever and graceful and the movie ends on a note VERY much like \"The Great Dictator\".\n\nIf you are looking for a hilarious comedy, you should look elsewhere. Compared to many of Cantinflas' other films, it's much more serious and less goofy. This is NOT a criticism--I liked the social and political commentary in this film. While I was born, raised and live in a 'Green' nation, Cantinflas' speech had a lot of brilliance in it as he criticized both the Red and Green nations. Overall, a serious yet funny little comedy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0061038/"
}