{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marla Sokoloff",
            "url": "/name/nm0005448/"
        },
        {
            "@type": "Person",
            "name": "Marley Shelton",
            "url": "/name/nm0005420/"
        },
        {
            "@type": "Person",
            "name": "Melissa George",
            "url": "/name/nm0313534/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14703,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Person",
            "name": "Mandy Nelson",
            "url": "/name/nm0625570/"
        }
    ],
    "datePublished": "2001-01-26",
    "description": "A popular high-school cheerleader becomes pregnant by the star quarterback and turns to crime to support her desired lifestyle.",
    "director": [
        {
            "@type": "Person",
            "name": "Francine McDougall",
            "url": "/name/nm0568230/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGNlM2NlYjUtYmQ4OC00OWRkLWI5ZmItNzA3MmQ4MzE4OTkzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "generation y,title directed by female,teensploitation,three word title,ampersand in title",
    "name": "Sugar & Spice",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dfranzen70"
        },
        "dateCreated": "2001-10-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0186589/"
        },
        "name": "All the nice that's fit to print",
        "reviewBody": "A high school cheerleading squad robs a bank in order to support the burgeoning family of one of their own. They get the idea watching the Keanu Reeves movie Point Break and then watch movies like Reservoir Dogs and Dog Day Afternoon to figure out how exactly to pull the caper off.\n\nNow, I know what you're thinking. Sounds like a cutesy family movie, right? The kind that warms the cockles, wherever they are. Well, almost. It's a dead-on, surprisingly hilarious comedy, with perfect off-center performances and a crisp, honest script.\n\nThe last cheerleading movie I saw (and quick, can you name more than a couple anyway? Didn't think so) was the Kirsten Dunst comedy Bring It On. This one blows that out of the water, out of the atmosphere, and out of the solar system. There's no moralizing. There's no good-girls-are-right, bad-girls-are-wrong lesson. Heck, we're talking about teenage girls pulling off a robbery! And one thing that could have sunk this movie early on was a character change. You've seen movies in which a character, faced with a new set of circumstances, does a 180-degree turnaround on how they've behaved up to that point. In this movie, you'd expect the girls to suddenly become flawless professional robbers. Not so. And while their plan has its faults, it's still a plan, buoyed by the vacant aphorisms of their leader, the pregnant and chipper Diane (Marley Shelton). Sing-songy and ebullient, the kids squabble among themselves but, in the true spirit of cheerleading and gosh-darn Girl Scout-like togetherness, they pull together as a team. Hip! Hip! Hooray!\n\nDecent cheerleading movies are hard to come by. Come to think of it, so are any cheerleading movies. Oh, not that I'm looking, but I can name only two off the top of my head: Bring It On and the legendary, overlooked (okay, just kidding) 1977 opus Satan's Cheerleaders. But the latter's pep squad was in college, so it's different. But I digress.\n\nTruth be told, there's not a dull moment in the movie. Diane's knocked up before the prom by her dimwit football-hero boyfriend. This guy's so stupid he gets himself fired from such seemingly unfireable jobs as fast-food employee and other glamorous retail employment opportunities. See, in the real world, he'd be upset that the luster had worn off his diamond of an image, having to work with geeks at the video store. But he's a dope, blissfully ignorant. He knows but one thing - that he loves Diane - and being such a dullard is supremely helpful to the film (and isn't easy to do; kudos goes to James Marsden in the role).\n\nIn short, a real hoot. We've seen many bank robbery movies with their own twists and idiosyncrasies; this one's one of the better ones to come down the pike. Go team go!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1157938969",
        "name": "Sugar & Spice",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjVjYWQ0NjgtNzgzYi00NTdiLTgzMTUtY2U3ZGM5YTQ0YTQwXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjVjYWQ0NjgtNzgzYi00NTdiLTgzMTUtY2U3ZGM5YTQ0YTQwXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-12-24T17:03:26.465Z",
        "url": "https://www.imdb.com/video/vi1157938969/"
    },
    "url": "/title/tt0186589/"
}