{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sun Ra",
            "url": "/name/nm0704612/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 289,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "datePublished": "2006-02-27",
    "description": "Robert Mugge filmed jazz great Sun Ra on location in Philadelphia, Baltimore, and Washington, D.C. between 1978 and 1980. The resulting 60-minute film includes multiple public and private performances, poetry readings, a band rehe...",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Mugge",
            "url": "/name/nm0611188/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ5NzQyNDAxNF5BMl5BanBnXkFtZTgwMTUyNjcwNzE@._V1_.jpg",
    "name": "Sun Ra: A Joyful Noise",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mahatmarandy"
        },
        "dateCreated": "2005-10-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0270677/"
        },
        "name": "An odd little slice of time",
        "reviewBody": "Having only heard of Sun Ra from third-hand sources, I was interested to know more about him. This film from 1980 provides an entertaining but very superficial glimpse into his music (Which, even in the context of sloppy 70s Jazz meltdown stuff, is kind of annoying) and his odd little commune/cult of likeminded musicians and admitted disciples. I would have preferred more insights, frankly, and less music. It's not that the music was always awful - some of it is quite good - but it's less interesting than trying to figure out what makes Mr. Ra and his minions tick, what makes them devote themselves to him for years or decades at a time, when they could clearly find better-paying gigs in other bands. There's a charisma that's hinted at, but never really seen. Istead we get some brief talking-head interviews a few bandmembers, and a lot of shots of Sun rambling odd statements in front of the (Carter) White House, or in an Egyptian Museum Exhibit. Some of the stuff he says is interesting, such as \"You can't have a department of Justice punishing people for doing wrong without having another department praising people for trying to do better,\" but if there's some kind of religious ethos or real beliefs underlying all this, we never see it. I feel a bit cheated by that. The closest we get is a couple scenes of Sun lapsing into an almost-smile-laugh thing which might mean that this is all a joke, or it might mean he's got a bit of gas. It's irritating not being able to tell which. Basically, if you can stumble across this documentary in Bealls Otlet for $2.99 like I did, it's worth a watch, otherwise, don't waste time trying to find it."
    },
    "url": "/title/tt0270677/"
}