{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Mandy Patinkin",
            "url": "/name/nm0001597/"
        },
        {
            "@type": "Person",
            "name": "Bernadette Peters",
            "url": "/name/nm0001613/"
        },
        {
            "@type": "Person",
            "name": "Barbara Bryne",
            "url": "/name/nm0117408/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 947,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0082006/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0020999/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057924/"
        },
        {
            "@type": "Person",
            "name": "James Lapine",
            "url": "/name/nm0487567/"
        }
    ],
    "datePublished": "1986-06-16",
    "description": "Video production of the Pulitzer-prize winning musical stage production. In the first act, \"George\", a fictionalized Georges Seurat paints his lover, Dot, and \"A Sunday Afternoon on the Island of Le Grande Jatte.\" Characters who b...",
    "director": [
        {
            "@type": "Person",
            "name": "Terry Hughes",
            "url": "/name/nm0400958/"
        }
    ],
    "duration": "PT2H26M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGIyMzNhNzYtZDQ0NC00NmQ2LWIyNDYtYmIyMzUzZDgyYzA2XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "musical episode,pulitzer prize,art,post impressionism,based on stage musical",
    "name": "Sunday in the Park with George",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ijonesiii"
        },
        "dateCreated": "2005-11-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092028/"
        },
        "name": "Sondheim, Patinkin, and Peters at their best",
        "reviewBody": "Sunday IN THE PARK WITH GEORGE was the first, if memory serves, Broadway musical based on a painting. This sensitive and moving look at the artist Georges Suerat, through his most famous work, \"A Sunday Afternoon on the Island of Le Grand Jatte\", was unlike anything Broadway had seen up to this point. Suerat serves as sort of a narrator and Greek chorus, as well as the main character, as James Lapine's smart book takes what little was known of the artist's life and fleshes out characters from the people in the painting. Broadway's most gifted composer, Stephen Sondheim, crafted a lilting and beautiful score filled with clever lyrics and lush melodies. Sondheim is the best lyricist in the theater because he writes as people talk, not as they sing. The first act follows the relationship between Suerat, electrically portrayed by Mandy Patinkin and his model/mistress Dot, the luminous Bernadette Peters, as their on again off again relationship is constantly challenged by his obsession with his work. The second act features Patinkin as Suerat's grandson and Peters as his grandmother as we see the modern sculptor struggling with a heredity he continues to deny until a fateful trip to the island where the original painting had been done. Director Terry Hughes has lovingly captured this intimate story on video and given us close-ups and sweeping camera shots that were not possible to experience seeing the show onstage, making the show even more personal and involving. Mandy Patinkin commands the stage as George with a stylish stage presence and magnificent singing voice that fills the theater as well as the television screen and is matched note for note by Peters, who makes Dot a tragic and fragile heroine and brings a lovely touch of humanity to the ditzy grandmother, Marie. It should be noted that at the time this was filmed, Ms. Peters was vocally and physically exhausted. She had already left this show and was in rehearsals for the show that would finally win her a Tony Award, SONG & DANCE. Some vocal strain can be noted with Peters, particularly in one unmerciful close-up where her voice just gives out on her, but Peters is a pro and delivers a performance of opening night quality. Though not for all tastes, Sunday IN THE PARK WITH GEORGE is a lush and lovely musical theater experience that all those with a passion for the genre should experience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "timeRequired": "PT2H26M",
    "trailer": {
        "@type": "VideoObject",
        "description": "Sunday In The Park With George",
        "duration": "PT1M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3945250329",
        "name": "Sunday In The Park With George",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWU4MTY4ZDMtM2Y2OS00NTdiLThhMmItYzZjMDRkZmQwZmI1XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWU4MTY4ZDMtM2Y2OS00NTdiLThhMmItYzZjMDRkZmQwZmI1XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-17T13:02:29.145Z",
        "url": "https://www.imdb.com/video/vi3945250329/"
    },
    "url": "/title/tt0092028/"
}