{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Holden",
            "url": "/name/nm0000034/"
        },
        {
            "@type": "Person",
            "name": "Gloria Swanson",
            "url": "/name/nm0841797/"
        },
        {
            "@type": "Person",
            "name": "Erich von Stroheim",
            "url": "/name/nm0002233/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 225306,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Charles Brackett",
            "url": "/name/nm0102818/"
        },
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        },
        {
            "@type": "Person",
            "name": "D.M. Marshman Jr.",
            "url": "/name/nm0551261/"
        }
    ],
    "datePublished": "1950-08-04",
    "description": "A screenwriter develops a dangerous relationship with a faded film star determined to make a triumphant return.",
    "director": [
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU0NTkyNzYwMF5BMl5BanBnXkFtZTgwMDU0NDk5MTI@._V1_.jpg",
    "keywords": "silent film star,butler,hollywood california,narrated from the grave,jealousy",
    "name": "Sunset Blvd.",
    "original_info": {
        "id": "Sunset Boulevard_1950",
        "name": "Sunset Boulevard",
        "year": "1950"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "preppy-3"
        },
        "dateCreated": "2008-03-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0043014/"
        },
        "name": "A true Hollywood horror story",
        "reviewBody": "Hack screenwriter Joe Gillis (William Holden) accidentally falls in with faded screen legend Norma Desmond (Gloria Swanson). She lives in a crumbling old mansion with her butler Max (Erich von Stroheim). She refuses to believe that she's no longer remembered and will never make another movie. She gets Gillis to stay with her and rewrite \"Salome\" which she thinks will be her comeback. Gillis has no other choice and things slowly get out of hand.\n\nA VERY cynical view of Hollywood--especially for 1950. It shows what Hollywood does to people like Norma--it makes them stars, tells them that they're great and dump them coldly when they're no longer needed. It also takes swipes at directors, agents, screenwriters, even entire studios! It has a tight quick script, is appropriately filmed in gloomy black and white and is masterfully directed by Billy Wilder. Everybody thought this was a bad idea when it was being made. It was believed to be too cold and vicious for the public. Also Holden was warned it would ruin his career by playing a younger man kept by an older woman. But it turned out great and is now rightfully considered a classic.\n\nThe acting is almost all good. I never thought Nancy Olson was that good. Her character is too pure and sweet to be believable. Everybody else is right on target though. Holden is just great in his role. You see the pity, anger and helplessness on his face when he realizes Norma is falling in love with him--and he's trapped. von Stroheim was equally good as Max who encourages Norma's delusions. Swanson however is just magnificent! She has a very showy role and could have overplayed it--but she doesn't. She's mad for sure--but you only see it peeking through every once in a while. When she loses it completely at the end it's frightening. If she had played it like that all through the movie it never would have worked. How she lost the Oscar that year to Judy Holliday for \"Born Yesterday\" is beyond me. This is a must see and a true Hollywood classic but VERY cold and cynical. A 10 all the way.\n\n\"I am big--it's the pictures that got small\". \"All right Mr. deMille--I'm ready for my closeup\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for the classic film Sunset Blvd., starring William Holden, Gloria Swanson, and Erich von Stroheim",
        "duration": "PT3M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2388460569",
        "name": "Sunset Blvd.",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjIwMTI5Nzc2M15BMl5BanBnXkFtZTgwODcyMDczMzE@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjIwMTI5Nzc2M15BMl5BanBnXkFtZTgwODcyMDczMzE@._V1_.jpg",
        "uploadDate": "2010-03-25T13:44:13Z",
        "url": "https://www.imdb.com/video/vi2388460569/"
    },
    "url": "/title/tt0043014/"
}