{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lucille Alpert",
            "url": "/name/nm1434333/"
        },
        {
            "@type": "Person",
            "name": "Irja Lloyd",
            "url": "/name/nm1439085/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 144,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0099824/"
        }
    ],
    "datePublished": "2003-05-08",
    "description": "Lucille and Irja are retired residents of Sunset Hall, a Los Angeles home for the elderly. Residents of Sunset Hall are retired radicals; they have retired from work but not from protesting against injustice. Bitter Lucille consid...",
    "director": [
        {
            "@type": "Person",
            "name": "Laura Gabbert",
            "url": "/name/nm0299990/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjAzM2I2NWYtMTVkNS00ZDM0LWJjZTgtYzAwMGQ4NjMwMThiXkEyXkFqcGdeQXVyMTc3Mzc5NA@@._V1_.jpg",
    "keywords": "radical,old age,retirement home,los angeles california,friendship",
    "name": "Sunset Story",
    "original_info": {
        "id": "Sunset Story_2003",
        "name": "Sunset Story",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jonboy3000"
        },
        "dateCreated": "2003-10-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368310/"
        },
        "name": "I laughed, I cried",
        "reviewBody": "I stood and applauded along with the packed crowd in the theater. This is by far one of the most touching, heart-felt, nuanced looks at aging, death, life, and the friends we leave behind I've ever seen. What starts off seeming like it's going to be a sort of tongue-in-cheek comedic view of an old folk's home for aging activists, becomes instead a personal story between two elderly friends as they deal with the pains - both emotional and physical - of growing old.\n\nAnd if that turns you off; if you have a picture in your mind that this is going to be a purely weepy, painfully arduous film about old people on the verge of death, you're wrong. There are moments of enlightened humor and brilliance that will make you guffaw out loud. There are inspirational moments that will make you leave the theater wanting to live a fuller life. There are deep moments that have you contemplating your own aging process, as well as your thoughts about what it might be like when you're 75, 85, 95. And yes, there are powerfully, potently sad moments that will have you bawling into your popcorn.\n\nIt is, in a nutshell (an overly simplified nutshell), sort of a documentary version of \"On Golden Pond\", full of the same sweet sadness and auld lang syne (sp?), but with a documentary's ability to sweep aside typical heartstring-pulling cinematic manipulation. Yes, Sunset Story uses a score - a deeply emotional piano score - but it serves the story, enhancing the natural drama playing out on the screen without dictating what emotions you should be feeling at what time.\n\nThis documentary should be seen, far and wide.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0368310/"
}