{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Angela Bassett",
            "url": "/name/nm0000291/"
        },
        {
            "@type": "Person",
            "name": "Edie Falco",
            "url": "/name/nm0004908/"
        },
        {
            "@type": "Person",
            "name": "Alex Lewis",
            "url": "/name/nm0506902/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4150,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032034/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054283/"
        },
        {
            "@type": "Person",
            "name": "John Sayles",
            "url": "/name/nm0000626/"
        }
    ],
    "datePublished": "2002-07-12",
    "description": "A woman and her new husband returns to her hometown roots in coastal northern Florida, and must deal with family, business, and encroaching real estate development.",
    "director": [
        {
            "@type": "Person",
            "name": "John Sayles",
            "url": "/name/nm0000626/"
        }
    ],
    "duration": "PT2H21M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzEwYTQ3OTMtODgzMS00N2EyLWE0ZGMtMThlNWMxOTYyNThhXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "reference to mother courage and her children,watching tv,reference to elektra,landscape architect,historic cemetery",
    "name": "Sunshine State",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rosscinema"
        },
        "dateCreated": "2003-04-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0286179/"
        },
        "name": "Sayles again in top form!",
        "reviewBody": "John Sayles is without a doubt one of the best writer/directors making films today and even though he doesn't get the backing and respect of Hollywood studio executives the actors in the business all know he's one of the best. Sayles doesn't give in to what the unsophisticated audiences of today expect. He keeps things honest and all of his work is based on personal choices. Like in most of his other films here we see multiple characters all surrounding one event. Here its the story of a resort town that is going to be taken over by a giant company and where most business's and residences will have to leave. One angle has Eunice Stokes (Mary Alice) living in a house that she has lived in for a number of years and she's proud because the house represents being elevated to middle class. Her daughter Desiree Perry (Angela Bassett) is an actress in the Boston area and she is coming to visit with her husband. While Desiree is there, she meets up with an old boyfriend Flash (Tom Wright) who had gotten her pregnant when she was 15. Another part of the film has Marly Temple (Edie Falco) who works with her father Furman (Ralph Waite) at the motel/restaurant that he owns. Marly meets Jack Meadows (Timothy Hutton) who is an architect and scouting the land. A romance blossoms between the two and its a clash of individual ideals. Marly hates working for her father and has become disillusioned and angry as life is passing her buy. Sayles complex script lets the viewer go from character to character and we become understanding of their complexities. The film shows how the characters who left the island went on to a better life and the ones who stayed have to deal with how life is changing all around them until it has finally found them. Its so refreshing to see Bassett in a good role. She's not cast as the girlfriend or some throw away supporting role, its a well written part that shows she is a terrific actress. Falco also shows that she can handle other characters and when \"The Sopranos\" is over she can step into any other role with ease. Well made and extremely well written, this is another interesting film to add onto Sayles growing resume of fine films.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Sony Pictures Classics",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1200357657",
        "name": "Sunshine State",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2UyZGRkYjEtMzIwNi00MjY5LWFjZDAtYjBhMmI4MTdiYTNlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2UyZGRkYjEtMzIwNi00MjY5LWFjZDAtYjBhMmI4MTdiYTNlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:20:41Z",
        "url": "https://www.imdb.com/video/vi1200357657/"
    },
    "url": "/title/tt0286179/"
}