{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gene Hackman",
            "url": "/name/nm0000432/"
        },
        {
            "@type": "Person",
            "name": "Christopher Reeve",
            "url": "/name/nm0001659/"
        },
        {
            "@type": "Person",
            "name": "Margot Kidder",
            "url": "/name/nm0452288/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 109994,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012642/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014643/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0113578/"
        },
        {
            "@type": "Person",
            "name": "Jerry Siegel",
            "url": "/name/nm0796950/"
        },
        {
            "@type": "Person",
            "name": "Joe Shuster",
            "url": "/name/nm0795975/"
        },
        {
            "@type": "Person",
            "name": "Mario Puzo",
            "url": "/name/nm0701374/"
        }
    ],
    "datePublished": "1981-06-19",
    "description": "Superman agrees to sacrifice his powers to start a relationship with Lois Lane, unaware that three Kryptonian criminals he inadvertently released are conquering Earth.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Lester",
            "url": "/name/nm0504513/"
        },
        {
            "@type": "Person",
            "name": "Richard Donner",
            "url": "/name/nm0001149/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODk2NjgzNTEtYzZhZC00ZTBkLTllMGQtMmMxMzU1NDRkM2RlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "superhero,second part,sequel,based on comic,dc comics",
    "name": "Superman II",
    "original_info": {
        "id": "Superman II_1980",
        "name": "Superman II",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DarthBill"
        },
        "dateCreated": "2004-02-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081573/"
        },
        "name": "Superman Returns",
        "reviewBody": "It's really a shame that those jerks the Salkinds fired Richard Donner after he made the first Superman movie into a smash hit. For one thing, the 2nd one could have and would have been better with Donner still at the helm and, quite possibly, \"Superman III\" and \"Supergirl\" may not have sucked. The only thing in the movie that Richard Lester really deserves any credit for is directing the 12 minute fight in Metropolis between Superman, General Zod, Non and Ursa. That scene is still fun to watch, even with today's overblown CGI.\n\nWell, #2 is the love story entry in the series as Lois Lane discovers that Superman and Clark Kent are the same guy and she lets him know about her infatuation with him. They go steady in his Fortress of Solitude, he gives up his powers so he can live a normal life with her (which the comic book Superman WOULD NEVER DO) then he has to get them restored after he finds out that the villains General Zod, Ursa and Non are raising hell and taking over the planet. Lex Luther is also back for the 2nd go around.\n\n People keep complaining that the film doesn't explain how Superman got his powers restored. Well, I have an old copy of an ABC Sunday night showing of \"Superman II\" and, mind you I still haven't bought the DVD, the TV showing implied that Superman used the green crystal - the same one that started off his awakening in the first movie and built the Fortress of Solitude - to restore his powers. And according to an interview I read with Richard Donner, the whole idea was that Superman restored his powers by draining all the crystals in his Fortress of Solitude and lost the ability to contact the ghosts of his parents in the process. Another plot hole I can't get over is how Superman ever fell for the Margot Kidder version of Lois Lane - she's an illiterate, chain smoking scatter brain! Gene Hackman still gives the worst performance of his career as Lex Luther, but hey, it's Gene!\n\nLegend has it that Hackman refused to do \"Superman III\" because he was outraged over the way the Salkinds had treated Richard Donner.\n\nChristopher Reeve is still a good Superman though, and here he actually has a real threat in the form of cold blooded Terence Stamp as General Zod, who is helped by Jack O'Halloran's mute hulk Non and Sarah Douglas's misanthropic Ursa (she later played the evil queen in \"Conan the Destroyer\"). And as mentioned above, the fight between Superman and Zod's trio is a knock out. Don't miss Christopher Reeve/Superman throwing Terence Stamp/Zod into the giant neon Coke sign!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Superman II",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3346572313",
        "name": "Superman II",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTYzNzU5MGUtZThlZS00YjYyLThmOGUtNmE5NjBjZmQ3NjFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTYzNzU5MGUtZThlZS00YjYyLThmOGUtNmE5NjBjZmQ3NjFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-10-27T03:32:56Z",
        "url": "https://www.imdb.com/video/vi3346572313/"
    },
    "url": "/title/tt0081573/"
}