{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Tyler Hoechlin",
            "url": "/name/nm0388382/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Tulloch",
            "url": "/name/nm1128780/"
        },
        {
            "@type": "Person",
            "name": "Alex Garfin",
            "url": "/name/nm3476372/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 34337,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0330789/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0283444/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005035/"
        },
        {
            "@type": "Person",
            "name": "Greg Berlanti",
            "url": "/name/nm0075528/"
        },
        {
            "@type": "Person",
            "name": "Todd Helbing",
            "url": "/name/nm1054609/"
        }
    ],
    "datePublished": "2021-02-23",
    "description": "The world's most famous superhero and comic books' most famous journalist face the pressures and complexities that come with balancing work, justice, and parenthood in today's society.",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzdmYjAyODUtMTFkOS00MDg1LTljMDAtNzhiYTg5NjY1NjM5XkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_.jpg",
    "keywords": "dc comics,superhero costume,kryptonian,the cw,superhero action",
    "name": "Superman & Lois",
    "original_info": {
        "id": "Superman & Friends_2003",
        "name": "Superman & Friends",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OceanGirl941"
        },
        "dateCreated": "2022-08-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt11192306/"
        },
        "name": "I'm on the fence",
        "reviewBody": "I'm hoping this series improves. This second season wasn't anywhere near the same level as the first. It has a lot of potential, but it feels hamstrung by CW. That shouldn't be a surprise to anyone by now.\n\nThe production is pretty stellar, so far. The locations and effects are great.\n\nThe writing has been bland for me, and very likely has contributed to some of my opinions below. While most of the main plot ideas are decent, many of the subplots and side stories are meaningless clutter. I can't think of how many of the newspaper scenes come off like filler content, and contribute nothing more than needlessly refreshing the viewers' knowledge of Lois's profession. Overall, most of the small town issues are excruciatingly boring. I'd rather see the show steer back to things that threaten life on planet Earth on a more consistent basis.\n\nElizabeth Tulloch was amazing in Grimm. I've tried and failed to like her for the role of Lois. For some reason, the writers want Lois to be annoyingly neurotic at every turn, and Tulloch does effectively come across that way, unfortunately. Lois scenes are mostly not pleasant experiences.\n\nThere's zero chemistry between Tulloch and Hoechner. And, it seems, I'm not the only one that noticed.\n\nClark Kent is henpecked far too frequently by Lois, like on a 20th century sitcom stereotype level.\n\nI'm not getting anything from Alex Garfin. His Jordan Kent is bland. I don't feel like this is a writing problem. There's no personality with Jordan, very restrained, little voice inflection, unconvincing body language, and nothing tangible to invest in. I'd rather him get interested in his ancestry and powers than the dull teen romance.\n\nI'm hoping the character Tal-Rho stays in the series. I love the \"sometimes good/sometimes bad\" tension between the brothers.\n\nMost of the rest of the cast are great performers. Love Irons, Valdez, Walsh, Chriqui, and Rayner, to name a few.\n\nThough one of the better superhero products of the CW, it needs some major fine tuning. In a different world in the multiverse, it would be on HBO Max permanently, and with writers that have vision beyond the boundaries of Smalltown. There's no shortage of source material, for sure. Though I've seen no news (only speculations) about a permanent move to HBO Max, I daydream about it faring much, much better there, with a more adult atmosphere, like Titans. And, if I'm being honest, I'm low key ready for another \"Crisis\" miniseries down the road.\n\nThough I lost interest a bit during the first part of this second season, the pace really picked up during episodes 12-15. The unexpected visit from someone from A. R. G. U. S. Ensured that I'm definitely down for Season 3.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The world's most famous superhero and comic books' most famous journalist face the pressures and complexities that come with balancing work, justice, and parenthood in today's society.",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2352333849",
        "name": "Season 3 Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmM2NmUwOTgtOTgxNS00OWFjLTkxMWEtNTE0M2E3ZDNiNjI1XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmM2NmUwOTgtOTgxNS00OWFjLTkxMWEtNTE0M2E3ZDNiNjI1XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2023-03-10T21:07:50.586Z",
        "url": "https://www.imdb.com/video/vi2352333849/"
    },
    "url": "/title/tt11192306/"
}