{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Spader",
            "url": "/name/nm0000652/"
        },
        {
            "@type": "Person",
            "name": "Peter Facinelli",
            "url": "/name/nm0004906/"
        },
        {
            "@type": "Person",
            "name": "Robin Tunney",
            "url": "/name/nm0000677/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18547,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028079/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023163/"
        },
        {
            "@type": "Person",
            "name": "William Malone",
            "url": "/name/nm0540532/"
        },
        {
            "@type": "Person",
            "name": "Daniel Chuba",
            "url": "/name/nm0160935/"
        },
        {
            "@type": "Person",
            "name": "David C. Wilson",
            "url": "/name/nm0933276/"
        }
    ],
    "datePublished": "2000-01-14",
    "description": "A deep space rescue and recovery spaceship with a crew of 6 receives a distress call from a mining operation 3432 light years away. A rescue operation via dimension jump is made. Bad idea.",
    "director": [
        {
            "@type": "Person",
            "name": "Walter Hill",
            "url": "/name/nm0001353/"
        },
        {
            "@type": "Person",
            "name": "Francis Ford Coppola",
            "url": "/name/nm0000338/"
        },
        {
            "@type": "Person",
            "name": "Jack Sholder",
            "url": "/name/nm0794791/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Horror",
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgwMjI4OTU4MF5BMl5BanBnXkFtZTcwOTk3MTE3NA@@._V1_.jpg",
    "keywords": "space travel,scan,social nudity,22nd century,rescue",
    "name": "Supernova",
    "original_info": {
        "id": "Supernova_2000",
        "name": "Supernova",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0134983/"
        },
        "name": "Much better than its reputation has it, but no gem",
        "reviewBody": "A deep space \"ambulance\" ship receives a distress call from a mining outpost on a rogue moon (it's been removed from its orbit) 3 thousand light years away. Normally, that wouldn't be so unusual, but the distress signal was specifically hailing this particular ship (like calling someone inside an ambulance directly instead of dialing 911) and when the source is revealed, female crew member Kaela Evers (Angela Bassett) realizes that she knows the person who sent it. Worse, it's someone whom she's had an extensive personal history with and whom she considers a walking nightmare. Before she can warn Captain A.J. Marley (Robert Forster), they're in hyper drive on their way to the moon and unwittingly headed into trouble.\n\nThis film was plagued with problems--the originally attached director, Geoffrey Wright, quit. The replacement director, Walter Hill, had creative differences with the studio, which demanded re-shoots and new cuts from none other than Francis Ford Coppola and Jack Sholder. Hill ended up requesting that his name be removed, and used the new version of the infamous \"Alan Smithee\" designation--\"Thomas Lee\".\n\nAnd that wasn't the end of it. Upon its release, Supernova received a critical drubbing. Rotten Tomatoes, for example, a website that collates professional and semi-professional reviews on films, showed a 90% negative reading on Supernova. The reaction from everyday viewers mirrored this reception, with mostly negative comments right here on IMDb.\n\nBut Supernova isn't that bad of a film. It's no gem, but it does a lot of things right: The premise is certainly stimulating. The transition from a stock, Alien (1979)-like sci-fi film to a thriller in space is well done. The characters are interesting. The suspense level gradually increases until the very end of the film.\n\nThere are thoughtful subtexts about giving oneself over to a \"feel-good\" substance, \"survival of the fittest\" evolution, and cyclical regeneration. The \"fountain of youth\" device is intriguing, and even though the \"Ninth Dimension\" stuff is gobbledy-gook, it's good gobbledy-gook--it makes some sense as fantasy material, and it provides a lot of suspense. There is a subtle social commentary/criticism on attitudes about violence in the media, population problems and eugenics.\n\nA lot of the cast is also good--I like Robert Forster a lot, although unfortunately he disappears from the picture too soon. I'm also a fan of Lou Diamond Phillips, even if his presence more often than not signifies a \"C\", \"D\" or lower film. James Spader's characterization of Nick Vanzant is nice and complex. And the rest of the cast is at least decent, even if Peter Facinelli overacts a bit towards the end--but the role calls for that.\n\nHowever, as a 7, Supernova has its share of problems, too. I don't usually subtract points for a film being clichéd, but it's difficult not to do so in this case. The beginning of the film is right out of Alien--with the ship waking up a crew member unexpectedly, after running some \"tests\". This is saved a bit by funny dialogue at the end of the scene. The computer, \"Sweetie\", is reminiscent at times of \"Hal\" from 2001: A Space Odyssey (1968). The holographic chess game is right out of Star Wars (1977). The distress signal scenario is again out of Alien, and the exploration of the abandoned mine on the rogue moon is similar to Aliens (1986).\n\nThe dialogue in the opening of the film is also a bit too jargonistic and quickly delivered for its own good. It can be difficult to get the gist of it without subtitles. There are a number of editing problems, most prominently during the \"near miss\" of the out of control ship with the moon--shaky cam cinematography doesn't help, either. And for so many directors being involved, the direction, while not incompetent, comes across as primarily \"flat\".\n\nIs Supernova worth seeing? If you're a huge sci-fi fan (meaning that you watch and like most sci-fi films) and you do not mind familiar material that's slightly clunky at times, yes. There are enough positives to make it worthwhile. Like usual with 7s, the film is best approached with lowered expectations. Given the reputation of this film, that should be no problem.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1066319641",
        "name": "Supernova",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjRjMjdjYzctYjc4OC00MGQzLTg3ZjAtYTBhNTY4OWM1YTk5XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjRjMjdjYzctYjc4OC00MGQzLTg3ZjAtYTBhNTY4OWM1YTk5XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-10-09T17:03:55.841Z",
        "url": "https://www.imdb.com/video/vi1066319641/"
    },
    "url": "/title/tt0134983/"
}