{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Beau Bridges",
            "url": "/name/nm0000977/"
        },
        {
            "@type": "Person",
            "name": "John 'Doc' Ball",
            "url": "/name/nm0050399/"
        },
        {
            "@type": "Person",
            "name": "Shay Bintliff",
            "url": "/name/nm0083117/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 99,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "David L. Brown",
            "url": "/name/nm0113381/"
        }
    ],
    "datePublished": "1999-11-07",
    "description": "SURFING FOR LIFE, a vibrant and award-winning one-hour documentary about inspiring well-spent lives, offers a totally fresh look at successful aging. Narrated by Beau Bridges, it profiles ten legendary surfers who model healthy ag...",
    "director": [
        {
            "@type": "Person",
            "name": "David L. Brown",
            "url": "/name/nm0113381/"
        }
    ],
    "duration": "PT1H12M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzc2Nzk2NTkwOF5BMl5BanBnXkFtZTcwMTgzOTQ1MQ@@._V1_.jpg",
    "keywords": "aging,surfing,old age,independent film",
    "name": "Surfing for Life",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "momohund"
        },
        "dateCreated": "2006-07-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0230835/"
        },
        "name": "Tasteful and intelligent",
        "reviewBody": "I was shocked to see this film get such an average rating as it did. The producers of this film, whomever they are, have done a wonderful job on several levels. First, we get to see how rich and historic surfing is. The visual imagery, fantastic use of old footage, and excellent soundtrack make for a wonderful set-up. This is a really nice change from the terrible and negative impression surfers get from commercialism and mainstream Hollywood. We get to see the humanism of surfers in people like Rabbit Kekai, Fred van Dyke, Anona Napoleon and Shay Bintliff. The film goes in depth into the lives and accomplishments of these extraordinary people, from surfing's resurgence in the early part of the twentieth century into the present; how these people helped modify and shape this sport of royalty, and proving surfing is not some dimwitted lifestyle for stoned losers (not once did I hear 'dude' or 'gnarly'), but a lifestyle that is paramount to many others.\n\nSecondly, we get to see how these people have been able to use the healing powers of the ocean and the thrill and playfulness of surfing to facilitate their aging process. This can best be seen through the vibrant character Woody Brown, who pioneered everything from surfboards to catamarans.\n\nAll in all, this is a very personal and heartfelt tribute to the great sport and lifestyle of surfing. To the producers, wherever you are, MAHALO for such an artistic portrayal of surfing and MAHALO for helping to eliminate the foolish and unfounded notion that surfers are pot smoking losers (I have bee surfing for years, met hundreds of surfers, and 99% of the time they have steady, often high-paying careers, and just love this great sport of ours), but are instead exciting, creative, intelligent, vibrant people with a strong connection to the ocean and to nature.\n\n'Come ride the waves, the surf is high, and hear the song the surfers cry. Slide out on the shoulder and finish the ride, Your heart's on fire, your soul's filled with pride. Taste the salt, the stinging spray. Know the price a surfer must pay.' -- Woody Brown",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0230835/"
}