{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Attenborough",
            "url": "/name/nm0041003/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 226,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046294/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001105/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057495/"
        },
        {
            "@type": "Person",
            "name": "David Attenborough",
            "url": "/name/nm0041003/"
        }
    ],
    "datePublished": "1996-06-11",
    "description": "South Georgia is an island south-east of South America. For a short period each year the temperatures rise into bearable regions, and the island fills with birds and seals who use the short time for feeding and breeding.",
    "director": [
        {
            "@type": "Person",
            "name": "David Douglas",
            "url": "/name/nm0235010/"
        }
    ],
    "duration": "PT40M",
    "genre": [
        "Short",
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQzODI3MzY2MV5BMl5BanBnXkFtZTcwOTMyODkxMQ@@._V1_.jpg",
    "keywords": "aerial camera shot,island,breeding,seal the animal,scientist",
    "name": "Survival Island",
    "original_info": {
        "id": "Survival Island: IMAX_1996",
        "name": "Survival Island: IMAX",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2022-03-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120248/"
        },
        "name": "Isle of survival",
        "reviewBody": "1996's 'Survival Island' is one of several documentary short films presented in IMAX 3D. These short films are mostly quite interesting, but their overall quality is most worthwhile if flawed. The effects have also varied. The subject matter for 'Survival Island' immediately fascinated, as did the catchy and not corny title. It also has the plus of having a location not often seen in nature documentaries and from being narrated and presented by documentary king David Attenborough.\n\n'Survival Island' is absolutely wonderful and lived up to high expectations. Of the IMAX 3D documentaries, it is to me definitely one of the best and one of the few that was nearly perfect. It is not one of Attenborough's finest or most ground-breaking either, but his filmography is so consistently good to amazing that that doesn't matter. It clearly knows what its target audience is and does its utmost best at and succeeds in meeting what is needed to keep them interested.\n\nMy only issue really with 'Survival Island', and this is actually common with the IMAX 3D documentaries, is the length as it does feel too short. With a lot of content, this could very comfortably have been 20 minutes longer perhaps which would have given the viewer more time to take in the information and also learn more.\n\nHowever, everything else works brilliantly. It looks fabulous, with beautiful yet unforgiving scenery and especially the photography that leaves one in awe at its best. There is though more to 'Survival Island' than cute animals in beautiful environments, one is reminded without being preached at that there are daily challenges.\n\nThe music, with an accessible style, is relaxing in some parts while having some edge in other parts. The animals are a great mix of adorable, formidable and exotic and their behaviours and ways to survive are relatable, surprising and inspiring.\n\nWhen it comes to the information, it is very educational and the narration entertains and informs without preachiness or being gimmicky. Any familiar content is approached freshly, and in a way that will captivate and never disturb kids while not being cookie cutter. While not at his absolute best, Attenborough is an incredibly engaging presenter/narrator and his voice is one that one can listen to for hours on end without getting bored.\n\nConcluding, wonderful. 9/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0120248/"
}