{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Probst",
            "url": "/name/nm0698251/"
        },
        {
            "@type": "Person",
            "name": "Rodger Bingham",
            "url": "/name/nm0082951/"
        },
        {
            "@type": "Person",
            "name": "Nick Brown",
            "url": "/name/nm0114349/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 99,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0084106/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0084107/"
        }
    ],
    "datePublished": "2001-09-25",
    "description": "\"Best Of\" highlights of the second season of the phenomenon known as Survivor.",
    "genre": [
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjM5OTc2NDc3NV5BMl5BanBnXkFtZTcwMzA1OTUxMQ@@._V1_.jpg",
    "keywords": "non fiction",
    "name": "Survivor - Season Two: The Greatest and Most Outrageous Moments",
    "original_info": {
        "id": "Survivor: Season 2: The Australian Outback_2001",
        "name": "Survivor: Season 2: The Australian Outback",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kevin86"
        },
        "dateCreated": "2002-05-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0316717/"
        },
        "name": "Viewers just cant get enough of the phenomenon that is SURVIVOR!!!",
        "reviewBody": "I've watched Survivor religiously from the beginning of the beginning. The very idea of taking 16 complete strangers from different walks of life, with different beliefs and morals, then throwing them on a deserted island to create and maintain a society. While at the same time playing against each other in a game of wits and integrity for a grand prize of one million dollars is ABSOLUTELY BRILLIANT.\n\nI just cannot get enough of the phenomenon that is Survivor. Season 4 was statistically the overall best season of Survivor thus far. It maintained a large audience which overshadowed many of season ones unwatched episodes (discluding the finale in which Richard Hatch became the first official winner). While the dirt of feuds, fights, and arguements werent as heated as in the first Survivor. The characters in season 2 were much more memorable. Whether it be the wonderful bond between sweet Elizabeth Filarski and gentle Rodger Bingham, or the love sherade between the wicked Jerri Manthey and texan cowboy Colby Donaldson, the bonds and interractions between the castaways were much more involved and interesting.\n\nThis tape helps highlight all the key events from Michael Skupins game turning accident to the dangerous river crossing of Keith Famie and Tina Wesson in an attempt to save a can of rice swept off by the flood. Included are in debth looks into the castaways lives and personalities as well as interviews with each of them on the Morning Show. Plus, this time around, it was interesting to see FULL immunity challenges shown in the highlights.\n\nFor the hardcore Survivor fanatic or casual viewer, this is a must have tape. Even for those who are simply curious about the show, buy the tape and try it out. For all you know it could spark some interest and you too may become a fanatic!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0316717/"
}