{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Probst",
            "url": "/name/nm0698251/"
        },
        {
            "@type": "Person",
            "name": "B.B. Andersen",
            "url": "/name/nm0026090/"
        },
        {
            "@type": "Person",
            "name": "Dirk Been",
            "url": "/name/nm0066452/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 153,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "datePublished": "2001-01-09",
    "description": "This video feature shows highlights from the first season on the Survivor television show. Each castaway is featured in the order they were voted off, starting with clips from their auditions to the time they give their final rema...",
    "duration": "PT2H15M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYyNjU2MjM3N15BMl5BanBnXkFtZTcwMTcyODUyMQ@@._V1_.jpg",
    "name": "Survivor - Season One: The Greatest and Most Outrageous Moments",
    "original_info": {
        "id": "Survivor: Season 1: Borneo_2000",
        "name": "Survivor: Season 1: Borneo",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chandler-5"
        },
        "dateCreated": "2001-09-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0280132/"
        },
        "name": "A must-have for die-hards, but...",
        "reviewBody": "This 135 minute video is a must-have for die-hard fans of the Reality TV genre phenomenon, but only for the sake of seeing a bit more of your favorite castaways. Each castaway is presented in the order they were voted off the island, and although we get to see their audition videos, some choice moments from their stay on the island, and more of their parting words, too much has been left out for the video for it to be thoroughly enjoyable. All the challenges are just presented in a very brief montage... you don't even get to see who wins these challenges, and how this may have affected the length of their stay on the island.\n\nAs far as new footage is concerned, the new stuff probably accounts for less than a third of the video, and except for an additional unaired mini-challenge, these additional segments are nothing to write home about."
    },
    "url": "/title/tt0280132/"
}