{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aaron Eckhart",
            "url": "/name/nm0001173/"
        },
        {
            "@type": "Person",
            "name": "Ben Kingsley",
            "url": "/name/nm0001426/"
        },
        {
            "@type": "Person",
            "name": "Carrie-Anne Moss",
            "url": "/name/nm0005251/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20140,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010183/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005323/"
        },
        {
            "@type": "Person",
            "name": "Zak Penn",
            "url": "/name/nm0672015/"
        },
        {
            "@type": "Person",
            "name": "Billy Ray",
            "url": "/name/nm0712753/"
        }
    ],
    "datePublished": "2004-08-27",
    "description": "A mysterious serial killer is hunting other serial killers, and one F.B.I. Agent suspects there may be more to the vigilante than they imagine.",
    "director": [
        {
            "@type": "Person",
            "name": "E. Elias Merhige",
            "url": "/name/nm0580729/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Crime",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTA1Zjc4MGQtYWZhOS00MTg4LWE1ZWItZTE5OWUxZDMwMGY1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "serial killer,eyesight,sense of hearing,sense of smell,following someone",
    "name": "Suspect Zero",
    "original_info": {
        "id": "Suspect Zero_2004",
        "name": "Suspect Zero",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MichaelMargetis"
        },
        "dateCreated": "2005-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0324127/"
        },
        "name": "Se7en + A Hard to Follow Plot + Ben Kingsley = Suspect Zero",
        "reviewBody": "Suspect Zero was almost never made. The screenplay by Zak Penn was originally finished nine years ago in 1997. A lot of producers thought the script wasn't good enough to be a motion picture, but they liked the idea, or premise, of the film. So, later they tried to find other screenwriters to make another version of the film, but that failed. So nine years (or actually eight years  it was filmed in 2003) later, they decided since they didn't have any other alternatives, to stick to Penn's script, but make a couple of revisions. That alone, should tell you Suspect Zero wasn't destined to be an Oscar contender.\n\nAlthough, Suspect Zero isn't necessarily a good movie, it isn't a bad movie either. When I walked into the theater on Friday afternoon, I was expecting a messy, incoherent piece of amateur fluff. The only reason I went to see the movie, was because of the brilliant Sir Ben Kingsley (no matter how bad a movie he is in, he gives a good performance). Well, the movie wasn't as jumbled and hard to understand as I would have thought pre-screening, but it was still hard to understand. Even though the story was involving and for the most part entertaining, the screenplay had a lot of holes in it, and there were a lot of scenes that were never made 100% clear. I was expecting Ben Kingsley to carry the movie on his shoulders, but he didn't. That's not to say Ben Kingsley didn't turn in another marvelous character study, but it means Kingsley's character just didn't have a very big part. The film is pretty much Aaron Eckhart's movie, and he does a kind of average job with it. It isn't that Eckart is a bad actor, it's just that he isn't really a great actor.\n\nThe supporting cast of the film is pretty much unnoticeable. Carrie Ann-Moss (The Matrix series) plays the role she always plays ; the strong, independent female with a crush on the leading male. Harry Lennix is funny as the smart ass F.B.I. chief, for the few scenes he is in. The rest of the supporting cast kind of runs together though.\n\nThe film tries to be too much like 1995's smash hit Se7en, but fails terribly in matching up with the brilliance of David Fincher's masterpiece. However, at the end the film (the last five minutes), the movie achieves great power during the confrontation between Eckhart's ambitious F.B.I. agent, and Kingsley's haunted serial killer. In conclusion, Suspect Zero is about average and somehow manages to spend most of the movie above the level of below average (thanks in part to Ben Kingsley), but I think people should wait for video for this one, and judging by the film critic's reviews of this movie, that won't be a long time at all. (review written 8/28/04) Grade: C (screened at AMC Deer Valley 30, Phoenix, Arizona)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4102816025",
        "name": "Suspect Zero",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGIwODc4YTMtM2FjMy00OWJmLWI5MzctNWE1NWY0YmYwY2I0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGIwODc4YTMtM2FjMy00OWJmLWI5MzctNWE1NWY0YmYwY2I0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:23:09Z",
        "url": "https://www.imdb.com/video/vi4102816025/"
    },
    "url": "/title/tt0324127/"
}