{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Balanchine",
            "url": "/name/nm0049422/"
        },
        {
            "@type": "Person",
            "name": "Jacques d'Amboise",
            "url": "/name/nm0195073/"
        },
        {
            "@type": "Person",
            "name": "Jorge Donn",
            "url": "/name/nm0232611/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 72,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "datePublished": "1996-10-05",
    "description": "A documentary about the ballerina Suzanne Farrell",
    "director": [
        {
            "@type": "Person",
            "name": "Anne Belle",
            "url": "/name/nm0068791/"
        },
        {
            "@type": "Person",
            "name": "Deborah Dickson",
            "url": "/name/nm0225630/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTAxODY0MzIxMDJeQTJeQWpwZ15BbWU3MDI3OTgxMjE@._V1_.jpg",
    "keywords": "ballet,archive footage,independent film",
    "name": "Suzanne Farrell: Elusive Muse",
    "original_info": {
        "id": "Suzanne Farrell: Elusive Muse_1996",
        "name": "Suzanne Farrell: Elusive Muse",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mmitsos-1"
        },
        "dateCreated": "2004-11-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117793/"
        },
        "name": "Review of Suzanne Farrell: Elusive Muse",
        "reviewBody": "Overall, the documentary \"Suzanne Farrell - Elusive Muse\" is a masterpiece. It takes us from her childhood in Cincinnati through her move with her mother to New York City to her audition for Mr. B, and on to both her first and second tenures with the NYC Ballet and her stay in Brussels with Maurice Bejart in between from the late 60's through about '74. The interviews with Paul Mejia, her former husband; Maurice Bejart, Jacques d'Amboise, Edward Villella, Arthur Mitchell, her own mother, and of course Suzanne Farrell herself were so honest, insightful, and very poignant. D'Ambroise was quite correct in characterizing her performance in Don Quixote as \"demonic\"...but then clarifying his description by saying that during her performance, she appeared to have been possessed not really by a demon but by a goddess. She truly became the music, combining impeccable technique with transcendent, poetic and musical interpretation. \n\nThe mounting agony Ms. Farrell recounts in describing the night she ultimately decided to leave Mr. B's company the first time, coupled with both her and her own mother's admission that her \"stage\" mother really would have preferred that she remain alone, and not marry Paul Mejia for fear of antagonizing Mr. B, is very touching, and one can't help but be completely empathetic with her predicament at that point in her life. Watching her walk along the Seine recounting her first trip to Paris as a performer at the age of 19, during which time she enjoyed many quiet walks throughout the city with Balanchine, brought back too many memories of my own junior year abroad in Paris. But unlike her, I occasionally have some \"if only's\" in my life today, including one in which I sometimes wish that I had remained in Paris beyond one year to further pursue studies and a career in opera. Marketing won out...but that's an aside. \n\nThe only shortcoming of this documentary is that more of her performances should have been showcased! Though a very good cross-section of stills, her rehearsals, her performances, and her role as teacher are portrayed, I craved more! Therefore, a note to the directors, archivists, and anyone else who may have access to more of her on film: please create a compilation of all her performances available on DVD. The ending is wonderful (and I won't give it away, though others have already quoted her), but I would make a sequel, if you will, to portray her life today, as teacher, choreographer, and founder of her own company. (This sequel should accompany the requested separate DVD of all of her rehearsals and performances). I would also like to find out why she and Paul Mejia split up (in 1997), if they would care to share. Listening to the glorious music alone transports me to another level, as does the story that so artfully unfolds. But of course, to see her dancing draws me into a completely beautiful, idyllic world that I never want to leave. And for that reason, I watch the film fairly regularly. In the end, this documentary is a completely moving, honest portrait of a beautiful, intelligent, articulate, compassionate and very gifted artist who led a wonderful, passionate, and very charmed life."
    },
    "url": "/title/tt0117793/"
}