{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Xun Zhou",
            "url": "/name/nm0955782/"
        },
        {
            "@type": "Person",
            "name": "Hongsheng Jia",
            "url": "/name/nm0422600/"
        },
        {
            "@type": "Person",
            "name": "Zhongkai Hua",
            "url": "/name/nm0398948/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5360,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Suzhou River",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021735/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150923/"
        },
        {
            "@type": "Person",
            "name": "Ye Lou",
            "url": "/name/nm0521601/"
        }
    ],
    "datePublished": "2001-09-27",
    "description": "After getting out of prison, small-time crook Mardar stumbles upon a woman who looks exactly like his long-lost lover.",
    "director": [
        {
            "@type": "Person",
            "name": "Ye Lou",
            "url": "/name/nm0521601/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODg4NjQ1MzQtNDNhOS00NTNmLTg1ZGItN2EwMDA3NDljOWI5XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg",
    "keywords": "budweiser,delivery boy,motorcycle courier,suzhou china,two narrators",
    "name": "Su Zhou he",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Richie-33"
        },
        "dateCreated": "2001-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0234837/"
        },
        "name": "Stylishly unconventional",
        "reviewBody": "Most of this film is shot directly from the point of view of the narrator, an unseen videographer who travels the titular river recording the myriad stories played out on its banks and vessels. Even the scenes in which he is not involved could well be his thoughts of events as he recounts what he has been told by others and it is this that is initially the most striking element of Suzhou River. It makes the viewer feel much more involved in the unfolding tale, although at times the rapid cuts and shaky camera are unnecessarily disorientating.\n\nThe narrator begins to tell us about his life - his job, his girlfriend Meimei who he obsessively videos and his fascination with the people of Suzhou River. But then this takes a back seat to his recounting of one of the many tales infamous within the community, of Mardar the motorcycle courier who is relentlessly searching the city for his lost love, Mudan. Her body was never found after she threw herself into the river from a bridge when Mardar was forced into kidnapping her by his gangland boss. But then this tragic story collides with our own narrator's as Mardar is convinced that he has finally found his long lost love and that she is Meimei. Obvious comparisons have been drawn to Vertigo's plot of a man undone by his lover's suicide and determined that he has found her again.\n\nThis debut feature from Chinese director Lou Ye benefits greatly from his unconventional style which seems to make the events more tangible. He portrays the river itself as a metaphor for life, its swirling eddies and undercurrents the many stories it keeps within its deep mysterious heart, with no effect on the mass flow of life, but turning the individual lives of those involved upside down. The parts of the film dealing with the burgeoning affections of Mardar and Mudan are excellent (particularly for Zhou Xin, who plays both of the two vastly different lead female roles equally well) , however I felt the events gathered pace a little too quickly towards the end, rushing the story of the narrator and Meimei in comparison to that of Mardar and Mudan. The result of this was an ending which seemed a tad abrupt and so the empathy for the narrator was not as heightened as it might have been, even with the great device of us seeing everything through his eyes. Despite this Suzhou River is a stylishly original tale who's depth and undercurrents make it stand out from the majority of the flotsam and jetsam our video stores carry."
    },
    "url": "/title/tt0234837/"
}