{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shabana Azmi",
            "url": "/name/nm0000818/"
        },
        {
            "@type": "Person",
            "name": "Girish Karnad",
            "url": "/name/nm0439784/"
        },
        {
            "@type": "Person",
            "name": "Utpal Dutt",
            "url": "/name/nm0244884/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 232,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108955/"
        },
        {
            "@type": "Person",
            "name": "Mannu Bhandari",
            "url": "/name/nm0080209/"
        },
        {
            "@type": "Person",
            "name": "Sharat Chandra Chaterjee",
            "url": "/name/nm0154158/"
        },
        {
            "@type": "Person",
            "name": "Basu Chatterjee",
            "url": "/name/nm0154113/"
        }
    ],
    "description": "After she enters into an arranged marriage, a spirited and intellectual young woman tries to adjust to life with a man who was not her choice.",
    "director": [
        {
            "@type": "Person",
            "name": "Basu Chatterjee",
            "url": "/name/nm0154113/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2M4ZTJkZGQtNDE4MC00NzYwLWFhOWMtY2U1NjZmYThhZWY4XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "dysfunctional marriage,marriage,family relationships,husband wife relationship,mother daughter relationship",
    "name": "Swami",
    "original_info": {
        "id": "Swami_1977",
        "name": "Swami",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Peter_Young"
        },
        "dateCreated": "2010-12-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0152720/"
        },
        "name": "\"A crime is no longer a crime when you ask for forgiveness with a clean heart\"",
        "reviewBody": "Basu Chatterjee, who in my books is one of the finest Indian directors of his time, directed Swami with a lot of heart. An adaptation of Sharat Chandra Chatterji's famous novel by the same name, Swami is an interesting dramatic feature which follows the trials and tribulations of a young and intelligent village girl named Saudamini. Saudamini is in love with the landowner's son Naren, and she hopes to marry him one day, but circumstances make her marry another man: a kindhearted and restrained wheat trader named Ghanshyam, who lives in a neighbouring village. The movie then presents Saudamini's new life as a newly married woman at a house where she knows nobody while she is still aching over her separation from her childhood love. At the same time, it shows Saudamini's acclimation in the house and how she gradually grows to respect and love her husband, whose forgiving and patient nature changes her views and attitude.\n\nThe story of Swami has been told many a time since then, so much that it has become a Hindi movie formula. Films like Hum Dil De Chuke Sanam, Dhadkan, among others, are examples of famous movies dealing with the same subject. But director Chatterjee's portrayal of the story remains unique and special. As expected, Swami looks authentic and simple. The dialogues may be a bit weak at points, but overall the movie's serene narrative style is very engaging. Chatterjee's excellent direction and the effective development of the story are aided by a haunting background score, some fantastic melodious songs composed by Rajesh Roshan, and of course a great cast led by an impossibly beautiful Shabana Azmi, who once again lives up to her fame as a naturally gifted actor. Azmi plays Saudamini with depth, convincingly displaying her sorrow and disappointment, and successfully registering the growth in her character.\n\n\"A crime is no longer a crime when you ask for forgiveness with a clean heart\" - this is one of many great lines in the movie and is certainly my favourite. Girish Karnad is the one who says it, and well, he is brilliant in an understated performance which is very credible and moving. Swami is overall a very fine movie featuring a wonderful performance by a ceaselessly talented lady named Shabana Azmi.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0152720/"
}