{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shirley MacLaine",
            "url": "/name/nm0000511/"
        },
        {
            "@type": "Person",
            "name": "John McMartin",
            "url": "/name/nm0533979/"
        },
        {
            "@type": "Person",
            "name": "Ricardo Montalban",
            "url": "/name/nm0001544/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6167,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Neil Simon",
            "url": "/name/nm0800319/"
        },
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        },
        {
            "@type": "Person",
            "name": "Tullio Pinelli",
            "url": "/name/nm0684083/"
        }
    ],
    "datePublished": "1969-05-17",
    "description": "Taxi dancer Charity continues to have Faith despite endless disappointments at its hands, and Hope that she will finally meet the man to romance her away from her sleazy life. Maybe, just maybe, handsome Oscar will be the one to d...",
    "director": [
        {
            "@type": "Person",
            "name": "Bob Fosse",
            "url": "/name/nm0002080/"
        }
    ],
    "duration": "PT2H29M",
    "genre": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGFjZTc0NzEtOTkzNi00NzUxLThmYjUtYWJlMWJiOTAwZWE3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "character name as title,nickname as title,two word title,flower child,dancehall hostess",
    "name": "Sweet Charity",
    "original_info": {
        "id": "Sweet Charity_1969",
        "name": "Sweet Charity",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2009-05-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065054/"
        },
        "name": "\"I Don't Pop My Cork For Every Guy I See\"",
        "reviewBody": "I notice that uncredited, but still making a vital contribution to this film was the original Broadway lead Gwen Verdon who assisted her then husband Bob Fosse with the choreography. This has to be one of the truly unselfish acts in a business that's built on ego. \n\nSweet Charity ran 608 performances on Broadway with a flock of Tony Award nominations including Gwen Verdon for the lead of Charity Hope Valentine and two Tony Awards for Bob Fosse for direction and choreography. Fosse came over to Hollywood to repeat his dual roles. But instead of Gwen doing the lead, Shirley MacLaine steps into the part and Gwen assists in the choreography. Quite frankly had she told Universal and her then husband to take their film and follow explicit directions what to do with it, who could have blamed her.\n\nYet there was Gwen Verdon, helping another performer do good in a part she created. Shirley MacLaine did do good in the role and it was a return to MacLaine's own musical roots. Shirley MacLaine has done so many dramatic roles and been Oscar nominated and once a winner for them, people do forget her beginnings were musical. Had she come along ten years earlier she would have been a great musical star. As it is she does have films like Can Can, Artists and Models, and What A Way To Go where we see Shirley singing and dancing. Her first big break was on Broadway replacing Carol Haney in Pajama Game.\n\nCharity Hope Valentine, someone who is charging more than 10 Cents a Dance Depression prices in a dance hall keeps having the worst luck in men which is established early on when at the beginning a guy she was just getting interested in threw her off a bridge into Central Park lake and robbed her purse. The latest in a long line of romantic failures. But quite by accident she gets involved with two men, Italian film star Ricardo Montalban and insurance actuary John McMartin who is repeating his role from the original Broadway production.\n\nThe Cy Coleman-Dorothy Fields score is a bit cut down, but you couldn't do Sweet Charity without Hey Big Spender and If They Could See Me Now. In the latter Shirley's musical talents, singing and dancing, get their full range. It must have been something however to see Gwen Verdon cavorting around the Italian film star's apartment doing that soliloquy of finally hitting the big time and wishing her dance hall girls could see here.\n\nAs for the dance hall girls, Shirley's peers are led by best friends Chita Rivera and Paula Kelly who along with Shirley do the big production number of Hey Big Spender. Who wouldn't want a little quality time with any one of them.\n\nAnd we get a special treat with Sammy Davis, Jr. doing the Rhythm Of Life church, a satire on those who claim religious tax exempt status for some interesting beliefs. It maybe his best musical moment in film.\n\nThe ending for a musical is rather unusual, I can't reveal, but nothing similar comes to mind at the moment. Though Shirley MacLaine is great, poor Gwen Verdon died having only had one of her Broadway hits filmed, Damn Yankees.\n\nBut Gwen was quite the girl helping someone else score a hit with her role.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2938944537",
        "name": "Sweet Charity",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjgyNThlYjAtZTU4Ny00YjdkLTkxYjktOWFjMDkyOTVlODZjXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjgyNThlYjAtZTU4Ny00YjdkLTkxYjktOWFjMDkyOTVlODZjXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2019-06-27T17:16:01.741Z",
        "url": "https://www.imdb.com/video/vi2938944537/"
    },
    "url": "/title/tt0065054/"
}