{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Melvin Van Peebles",
            "url": "/name/nm0887708/"
        },
        {
            "@type": "Person",
            "name": "Hubert Scales",
            "url": "/name/nm0768788/"
        },
        {
            "@type": "Person",
            "name": "John Dullaghan",
            "url": "/name/nm0227647/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5552,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048150/"
        },
        {
            "@type": "Person",
            "name": "Melvin Van Peebles",
            "url": "/name/nm0887708/"
        }
    ],
    "datePublished": "1973-03-22",
    "description": "After saving a Black Panther from some racist cops, a black male prostitute goes on the run from \"the man\" with the help of the ghetto community and some disillusioned Hells Angels.",
    "director": [
        {
            "@type": "Person",
            "name": "Melvin Van Peebles",
            "url": "/name/nm0887708/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDY3NzU3ZWItYmFhOS00YTMwLTlhMDEtNDkwYTI0OGE0NWM3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "blaxploitation,private sex show,male in a shower,playing acoustic guitar,sex with prostitute",
    "name": "Sweet Sweetback's Baadasssss Song",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Teenie"
        },
        "dateCreated": "2000-06-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067810/"
        },
        "name": "A well-made, brilliant film",
        "reviewBody": "I saw this film on opening night in Philadelphia, Pa. The audience consisted of almost entirely young, Black men (mostly) and women who were obviously active in the civil rights movement,judging by the reactions of the men in the audience when Sweetback gave \"the man\" his definition of justice - beating the living crap out of them. His methods were quite original - especially with the pool cue. His sexual prowness was the main hit of the film for the ladies in the audience (I admit). The scene that really had me rooting for Sweetback was when he \"popped\" the white biker chick (in a most original manner) and she practically killed her biker boyfriend trying to join up with Sweetback in his quest. He merely cast her off like a used oilrag, which she was. Hilarious. There was a lot of anger among Black moviegoers at that time, which is why a lot of the blaxploitation films were successful. Our voices were heard loud and clear, especially in films, where our heroes were the victors against racist society and even more racist law enforcement, no matter how grisly, gruesome or violent the methods for dealing with them were. I had the pleasure of meeting Melvin Van Peebles at a screening and lecture of his work shortly after this film was made. His brilliance and genius were even more obvious as this man reflected on his determination to film, release and distribute this motion picture even though \"white\" America did everything they could to ban it, including slapping it with an \"X\" rating. I never understood the need for the \"X\" rating, as many of American-International's horror films were much more violent and graphic than this film (the \"X\" rating was not because of the sex)yet they were never banned or given that dreaded rating. I highly recommend this film to any student of filmmaking to view it not so much for the subject matter but to see the absolute genius in Mr. Van Peebles' work. Little money had he, but a lot of guts, brains and a wonderful and creative imagination made this film the success that it was."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "4K Restoration Trailer",
        "duration": "PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2872490521",
        "name": "Sweet Sweetbacks Baadasssss Song",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2MzZTY3MjAtMjJmYy00YWEwLTk2OGUtMGRmODNkYThiNmY2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2MzZTY3MjAtMjJmYy00YWEwLTk2OGUtMGRmODNkYThiNmY2XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-12-21T17:14:50.217Z",
        "url": "https://www.imdb.com/video/vi2872490521/"
    },
    "url": "/title/tt0067810/"
}