{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred Astaire",
            "url": "/name/nm0000001/"
        },
        {
            "@type": "Person",
            "name": "Ginger Rogers",
            "url": "/name/nm0001677/"
        },
        {
            "@type": "Person",
            "name": "Victor Moore",
            "url": "/name/nm0602005/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14081,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041421/"
        },
        {
            "@type": "Person",
            "name": "Howard Lindsay",
            "url": "/name/nm0512231/"
        },
        {
            "@type": "Person",
            "name": "Allan Scott",
            "url": "/name/nm0778818/"
        },
        {
            "@type": "Person",
            "name": "Erwin Gelsey",
            "url": "/name/nm0312510/"
        }
    ],
    "datePublished": "1936-10-12",
    "description": "Roguish gambler/dancer \"Lucky\" Garnett is challenged by his fiance's father to come up with $25,000 to prove he's worthy of her hand. But after he falls in love with a dance instructor, Lucky'll do anything to keep from earning th...",
    "director": [
        {
            "@type": "Person",
            "name": "George Stevens",
            "url": "/name/nm0828419/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWEwNjhlMzYtOGU3Ni00OTg3LWFjOWUtOTg0MDk3M2U0ODk1XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "dancing,national film registry,card trick,ace of spades,back stage",
    "name": "Swing Time",
    "original_info": {
        "id": "Swing Time_1936",
        "name": "Swing Time",
        "year": "1936"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2005-05-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0028333/"
        },
        "name": "Pick yourself up with this fine romance",
        "reviewBody": "Any of the films in which Fred Astaire and Ginger Rogers appeared is worth a look. Each one has something that will endear it to the viewer that seeks in their films entertainment, as well as fun. \"Swing Time\", their 1936 film was directed by George Stevens, a distinguished American director that had a long career in Hollywood. It helps though that Jerome Kern and Dorothy Fields worked in writing some of the most beautiful melodies heard in the movie.\n\n\"Swing Time\" is a pretext to present the stars doing what they did best: dancing! Lucky Garnett is made to be late for his own wedding to the socialite Margaret, who contrary to what one expects is forgiving and accepts her boyfriend's excuses. Garnett has to prove his luck, where else?, but in New York. Accompanied by Pop Cardette, they embark in an adventure to try to raise cash and fulfill his promise to Margaret's father.\n\nFate intervenes in the person of the beautiful Penny. She's a dancing instructor who we first see being cheated out of a quarter by Pop and Lucky. Later they follow her to the studio where Lucky goes to receive a dancing lesson! We know what comes after that. Penny and Lucky were made for one another and it will take the rest of the movie for they to realize this fact and for us to watch some amazing production numbers.\n\nThe funniest sequence has to be when Lucky, Penny, Pop and Mabel decide to take a ride to the New Amsterdam resort during a snow storm in a convertible! Not only that, but when they arrive at the inn, finding it closed, they decide to get out and walk in the thick snow without any galoshes! Oh well! The songs one hears in the film are classic standards.\n\n\"A Fine Romance\", \"Pick Yourself Up\", \"The Way You Look Tonight\", \"Never Gonna Dance\", and others are given excellent treatment. The two excellent musical numbers, \"Bojangles' Harlem\" and \"Swing Time Waltz\", show the talent of Mr. Astaire, in the first one, and of Ms. Rogers and Mr. Astaire in the second.\n\nFred Astaire is always good doing no matter what he does in this film. Ginger Rogers is also appealing as the object of Mr. Astaire's attentions. Victor Moore as Pop, is not as funny as perhaps the film makers wanted him to be, but Helen Broderick, as Mabel was excellent. Eric Blore, Betty Furness and Georges Metaxa and the rest of the cast do their best to support the principals.\n\nThis film is a joy to watch thanks to Mr. Astaire and Ms. Rogers under Mr. Stevens' direction.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1114619673",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjNkNGFkZGYtMWFlYi00NDMyLWI5NzUtZmVlZjYxODUzNDQ3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjNkNGFkZGYtMWFlYi00NDMyLWI5NzUtZmVlZjYxODUzNDQ3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-01-28T18:00:28.903Z",
        "url": "https://www.imdb.com/video/vi1114619673/"
    },
    "url": "/title/tt0028333/"
}