{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jang Dong-Gun",
            "url": "/name/nm0417520/"
        },
        {
            "@type": "Person",
            "name": "Won Bin",
            "url": "/name/nm1047193/"
        },
        {
            "@type": "Person",
            "name": "Eun-ju Lee",
            "url": "/name/nm0497249/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 40244,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Tae Guk Gi: The Brotherhood of War",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053327/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090379/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057761/"
        },
        {
            "@type": "Person",
            "name": "Je-kyu Kang",
            "url": "/name/nm0437625/"
        },
        {
            "@type": "Person",
            "name": "Sang-don Kim",
            "url": "/name/nm3719468/"
        },
        {
            "@type": "Person",
            "name": "Han Ji-hoon",
            "url": "/name/nm3719540/"
        }
    ],
    "datePublished": "2004-09-24",
    "description": "When two brothers are forced to fight in the Korean War, the elder decides to take the riskiest missions if it will help shield the younger from battle.",
    "director": [
        {
            "@type": "Person",
            "name": "Je-kyu Kang",
            "url": "/name/nm0437625/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Action",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjAxZTEzNzQtYjdlNy00ZTJmLTkwZDUtOTAwNTM3YjI2MWUyL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "korean war,1950s,landmine,timeframe 1950s,korea",
    "name": "Taegukgi hwinalrimyeo",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ncc1205"
        },
        "dateCreated": "2004-11-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0386064/"
        },
        "name": "A 'Brotherhood' For The Ages",
        "reviewBody": "Nations do not fight wars. Citizens fight them, and these citizens are honorable men and women who serve their country willingly or, as history shows, by decree of a desperate government.\n\nAs a result, patriotism has become the unlikeliest casualty. Once welcomed in the trenches of battle, patriotism has lost its limbs, fought back from life support, and suffered shell shock. Once easily recognized, patriotism has become a bit of a chimera, an ideal more easily attached to definable characteristics than it is any single soldier. However, in the bitter end, patriotism is defined by the actions of these individuals who serve; it is rewarded by the nations who sponsor this service; and, more often than not, it is measured in hardships endured.\n\nSuch is the complex, ever-changing battleground of writer/director Kang Je-Gyu's 'Taegukgi: The Brotherhood of War.'\n\nIn 1950's Seoul, Jin-Seok (Won Bin) and his older brother Jin-Tae (Jang Dong-gun) are enjoying a strong family life of perfect happiness. Suddenly, they find their lives turned upside down as soldiers of the South Korean government seize them  all men aged 18 to 30 are taken  and they are forced to take up arms  despite their lack of training  against the approaching North Koreans. On one brutal battlefield after another, the bonds of family are put to increasingly demanding tests as Jin-Tae  originally driven by his responsibility to protect his younger brother  continues to further exhaust his physical and emotional prowess despite the protests of Jin-Seok. He learns that he is a good soldier, one with a talent for inspiring others as well as an unanticipated thirst for killing the enemy. Eventually, these two brothers  once bound by a love for family  find themselves at odds within this new brotherhood of war, and the pressures to prove one another continue to exact heavier and heavier tolls as the war escalates. As circumstances evolve, the brothers inevitably find themselves on opposite sides of a losing conflict  but can either find a path to redemption or reconciliation that can save both of them?\n\nThere are many elements of 'Taegukgi' that elevate the film from the status of standard war film to a message of hope set against the backdrop of war. The film's scope is grand, dealing with the far more intimate themes of family, brotherhood, and personal responsibility when Director Kang Je-Gyu could have easily opted for banging the drum of nationalism. At its core, 'Taegukgi' is the story of two brothers, a strikingly poignant analogy for the entire North Korea / South Korea dilemma. While the battlefield choreography is as frenetic as it is harrowing, it never takes the film's center: this picture is founded on relationships  the human perspective to the world outside  and it never falters. Instead of focusing on history, Kang Je-Gyu crafts every scene to highlight the thoughts, actions, and emotions of the participants of history, and, for that, 'Taegukgi' deserves countless accolades.\n\nMuch like exploring the heart of darkness as depicted in American classics as Francis Ford Coppola's 'Apocalypse Now' and Oliver Stone's 'Platoon,' Kang Je-Gyu forces Jin-tae to explore his own budding evil, and this journey is not without its own relative scars. Once a man has crossed over and embraced wartime madness, can he ever truly find a way out? Arguably, if 'Taegukgi' suffers from any setback, it is that perhaps Jin-tae goes too far for an audience to accept his madness: believing his brother to have been killed by North Koreans, Jin-tae turns traitor once he is captured and seeks to wipe out every soldier serving South Korea. While the story offers the motivation for so drastic a change, it's hard to believe that the man who once fought so valiantly against the spread of Communism would suddenly choose to embrace it.\n\nStill, it's a small diversion  but it's necessary to bring the aspect of brotherhood full circle, to have these two unique men face their darkest hour, and to make one final statement on the role that family inevitably plays in every man's life.\n\nRecently, thanks to the worldwide success of 'Taegukgi' and 1999's blockbuster 'Shiri,' Director Kang Je-Gyu has signed an agreement with Hollywood's own powerhouse, CAA, to produce his next film in America. Only time will tell whether or not this agreement will afford some of the 'Korean sensibility' to American films, but certainly having one of South Korea's premier directors breaking into the Hollywood film system is a tremendous advantage for fans of international film.\n\nOnly the passage of time will earn 'Taegukgi' its rightful spot alongside the other great films dealing with the consequences of war.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0386064/"
}