{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Ella Raines",
            "url": "/name/nm0707048/"
        },
        {
            "@type": "Person",
            "name": "Ward Bond",
            "url": "/name/nm0000955/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3284,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041421/"
        },
        {
            "@type": "Person",
            "name": "Michael Hogan",
            "url": "/name/nm0389580/"
        },
        {
            "@type": "Person",
            "name": "Paul Fix",
            "url": "/name/nm0280707/"
        },
        {
            "@type": "Person",
            "name": "Gordon Ray Young",
            "url": "/name/nm0949583/"
        }
    ],
    "datePublished": "1944-09-29",
    "description": "Ranch hand Rocklin arrives in town to start his new job but his employer has been murdered and the locals don't seem too friendly.",
    "director": [
        {
            "@type": "Person",
            "name": "Edwin L. Marin",
            "url": "/name/nm0547446/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDM2MWQyOTMtY2UzZS00NTliLTk2ZDctMjI3ZWZjMjgxNzczXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "female ranch owner,based on magazine story,liar,inheritance custodian,death of uncle",
    "name": "Tall in the Saddle",
    "original_info": {
        "id": "Tall in the Saddle_1944",
        "name": "Tall in the Saddle",
        "year": "1944"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mhflight"
        },
        "dateCreated": "2008-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0037343/"
        },
        "name": "Superb John Wayne vehicle",
        "reviewBody": "For lovers of black and white westerns, 'Tall in the Saddle' is first rate entertainment. It is good old fashioned fun from beginning to end, and it manages to incorporate elements of film noir, comedy and romance. There is plenty of action along the way too and a number of twists and turns in its' plot. All of which prevents it from being the standard affair it could have ended up as without its' host of top notch performances.\n\nThe star of the film is John Wayne and it is I feel a good role for him. Although it lacks the depth of his greatest performances in the likes of 'Red River' and 'The Searchers', it does have the light hearted element of 'Rio Bravo', undeniably one of his career highlights. He stars as Rocklin, a tough cowboy recruited by a rancher named Red Cardell to help stop an outbreak of cattle rustling. He is apparently immune to the charms of women- \"I never feel sorry for anything that happens to a woman.\" When he steps off the train however his new employer has been murdered and Rocklin has to find out who is responsible for such a brutal act.\n\nIt is after he beats Clint Harolday (Russell Wade) at cards that he comes face to face with the losers' angry sister Arly, played by the beautiful Ella Raines who despite falling for Rocklin almost instantly and although clearly considerably shorter in height than him, is determined to stand up for herself- \"I always get what I want\". Very soon they are engaged in a humorous battle of the sexes which Arly is determined not to lose, despite her obvious attraction towards the Dukes' character. The exchanges between the pair are sexy as neither is prepared to swallow their pride to give in to the other; \"You might as well know right now that no woman is going to get me hooked, tied and branded\"/ \"Don't be so sure. Don't think I'm doing badly.\" Witness the pleasure Arly gets in sacking Rocklin from her employment, and her boasts of making love to him. This is the only Ella Raines film I have seen to date but I really loved watching her and would jump at the opportunity to see another of her performances.\n\nContrast Arly with the other glamorous lady in the film- Clara Cardell (Audrey Long)- and you have two entirely different women. Although also interested in Rocklin Clara I would say is sheepish and easily dominated by her spiteful, stuck up aunt Elizabeth Martin (Elisabeth Risdon) who hides from her niece a secret that links Clara and Rocklin and this explains her disdain for the latter- she tells Clara to stop \"throwing yourself at that wretch\". Risdons' character has little time for many townsfolk- \"The rudeness of people in these parts is appalling\". Frankly most people feel the same way about her.\n\nMany of the best scenes in the film (and certainly the funniest) involve Dave the alcoholic stagecoach driver (played by the wonderful George 'Gabby' Hayes). Just watch his introduction as Blossom the horse knocks over his priceless bottle of whiskey- \"I oughta poison you!\" His charismatic, accident-prone character has many great lines, for example his analogy of whiskey and women- \"They both fool you but you never figure how to do without them.\" He is even referred to as a \"hairy beast\"- no prizes for guessing who by. Add to the mix the great support of the ever dependable Ward Bond as Judge Garvey, one of the villains. He rivals Rocklin for toughness and they engage in a great fist fight.\n\nThe setting is typical of the genre, with many of the western hallmarks such as a dusty town in the middle of a desert containing cactuses (the latter are missed out in many westerns but not this one), a card game, a stagecoach, alcohol and gun fights. But less typical is the noir element- the hero being framed for a murder crime he did not commit for example, which results in a classic whodunit. Another western which to me is reminiscent of film noir is Pursued (1947).\n\nOverall then a hugely enjoyable movie which does exactly what it sets out to do- it entertains throughout and I'm sure audiences who saw this film at the cinema went home happy!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this story that captured the imagination of millions..",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi212337945",
        "name": "Tall in the Saddle",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzkwYjliMTktNDIyNy00NjhlLTlmYWMtNDg5OTgzYTBjZTJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzkwYjliMTktNDIyNy00NjhlLTlmYWMtNDg5OTgzYTBjZTJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-11-01T05:51:36Z",
        "url": "https://www.imdb.com/video/vi212337945/"
    },
    "url": "/title/tt0037343/"
}