{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Miguel Ángel Solá",
            "url": "/name/nm0813691/"
        },
        {
            "@type": "Person",
            "name": "Cecilia Narova",
            "url": "/name/nm0621507/"
        },
        {
            "@type": "Person",
            "name": "Mía Maestro",
            "url": "/name/nm0535502/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2984,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037531/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052330/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036756/"
        },
        {
            "@type": "Person",
            "name": "Carlos Saura",
            "url": "/name/nm0767022/"
        }
    ],
    "datePublished": "1999-02-12",
    "description": "Mario Suarez is a forty-something tango artist, whose wife Laura has left him. He leaves his apartment and starts preparing a film about tango.",
    "director": [
        {
            "@type": "Person",
            "name": "Carlos Saura",
            "url": "/name/nm0767022/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjUyYTNmMDQtZjgwYy00NWFmLWIwZDItODg5NjQ1OTM5ODc2XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "female nudity,female topless nudity,female rear nudity,barefoot woman,sex scene",
    "name": "Tango",
    "original_info": {
        "id": "Tango_1998",
        "name": "Tango",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tedg"
        },
        "dateCreated": "2000-08-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120274/"
        },
        "name": "Making Film Dance",
        "reviewBody": "I love this stuff. This film has weaknesses, but the ambition is so grand one can forgive, at least in deciding to watch.\n\nThe general problem is mixing film and dance. Rarely, oh so rarely is it done well. The stock choices are two: either film a dance more or less as an audience would see it, or to incorporate dance into the theatric presentation as a device. Either way, the audience is necessarily at a distance. And that's the problem: dance is human, to watch it (I'm talking about a performance here) you intimately participate in the space built and folded by the dancers. So by definition, most film/dance mixtures turn flat.\n\nThe solution here is to create an openly recursive storyline, mixing the dance as sometimes a filmed performance or rehearsal, sometimes \"real\" life, sometimes dreams or visions or imaginings. This combined with a never-rooted camera -- which sometimes plays the role of a character itself -- makes the audience part of the dance, and adds depth. The sets are designed to confuse: sloped floors, mirrors (used liberally) distortion, translucent screens and so on, further breaking the \"performance\" mold. On these terms alone, this is an intelligently conceived film.\n\nI cannot say the same for the dancing proper. I think the film suffers from sticking too close to an Argentine palette, so the music and dance lacked breadth, and ultimately became repetitive. Whether the dancers were authentic, I cannot say. There certainly were exciting moments for me, but the dancing wasn't sufficiently vibrant to carry all of the scenes.\n\nThe Latin flavor was intriguing in the large: that the director would attempt such a self-referential conflation: national horror; angst of aging; layering of creation. Such a project would be considered outrageous in the US long before it is explored. And the Latin character was also interesting in the small: bigbottomed dancers and dumb, dependent women talking about how intelligent and independent they are.\n\nCheck this out. Not for the dance, but for a solution to filming dance."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Classics",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1033175321",
        "name": "Tango",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWI4YTVkMDItMjcwNy00MWEwLTgwNGEtMzdmY2NlNjQwYTI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWI4YTVkMDItMjcwNy00MWEwLTgwNGEtMzdmY2NlNjQwYTI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:57:01Z",
        "url": "https://www.imdb.com/video/vi1033175321/"
    },
    "url": "/title/tt0120274/"
}