{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Denning",
            "url": "/name/nm0219396/"
        },
        {
            "@type": "Person",
            "name": "Kathleen Crowley",
            "url": "/name/nm0189754/"
        },
        {
            "@type": "Person",
            "name": "Virginia Grey",
            "url": "/name/nm0340706/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1344,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046578/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058539/"
        },
        {
            "@type": "Person",
            "name": "William Raynor",
            "url": "/name/nm0713523/"
        },
        {
            "@type": "Person",
            "name": "James H. Nicholson",
            "url": "/name/nm0629839/"
        },
        {
            "@type": "Person",
            "name": "Wyott Ordung",
            "url": "/name/nm0649560/"
        }
    ],
    "datePublished": "1954-11-07",
    "description": "Giant robots from Venus invade Chicago. Stranded in the deserted city are strangers Frank and Nora.",
    "director": [
        {
            "@type": "Person",
            "name": "Sherman A. Rose",
            "url": "/name/nm0741673/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmU1MGJkZGMtZmQ4MS00ODQ4LTlmZWEtODM2ZmY5ZTJhYTZjXkEyXkFqcGdeQXVyNjM1NzYzMDk@._V1_.jpg",
    "keywords": "robot sci fi,alien,chicago illinois,corpse,drunkenness",
    "name": "Target Earth",
    "original_info": {
        "id": "Target Earth_1954",
        "name": "Target Earth",
        "year": "1954"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmFlaneur"
        },
        "dateCreated": "2005-12-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0047559/"
        },
        "name": "Target missed - but good fun in the shooting",
        "reviewBody": "I've long treasured post-catastrophe films. From such low budget entries such as Obler's bleak Five (1951), Harry Belafonte's The World, The Flesh And The Devil (1959), on to Panic In Year Zero!, The Last Man On Earth (both 1964, now usefully coupled in a MGM 'midnite movies' collection; the latter's remake as The Omega Man (1971) the recent 28 Days Later, and so on, as a group they frequently offer a peculiar, ludicrous charm of their own. Target Earth is ultimately one of the minor entries of the genre, but one that starts off so well that one wants to report that it continues at the same high level of intrigue. Unfortunately it's a rule of thumb of this sort of film that, the more survivors are discovered to populate a stricken world, the greater the drop off in suspense that results. Rose's film is no exception, as the audience's response to the arrival of a succession of new humans ranges from mild interest at the arrival of Frank as the potential love interest for Nora, through to bewilderment at the silly tipsy couple then contempt for the panicky Otis, (who we know deserves to die for being so stupid), until just plain annoyance remains at the extended homicidal ambitions of Davis the killer (Robert Roark). To put it bluntly, his character is a final distraction from what any sensible viewer wants to see - that'll be the huge invader robots rampaging through the streets, wielding unimaginable alien powers. Rather like those annoying romantic-singing subplots, the diversions from the real gold in most Marx brothers' films, Davis gets in the way of the real reason why are paying our money and, notwithstanding the artificial drama his threats engender, the audience soon wishes him gone. \n\nSadly, the budget restrictions of Target Earth mean that Davis has almost as much screen time as the mammoth automatons, which in turn are eventually restricted to the appearance of just a clunky one (for the real thing one has to turn to such films as Sky Captain And The World Of Tomorrow). Davis is annoying too in that most films set in a deserted, ravaged earth represent a chance to start again, hopefully with a new morality and order of things. Continually, however there are flies like him in the ointment: obstinate, obvious elements that stand in the way of social progress. In some films, like The Last Man On Earth and its remake, it's a population of nocturnal mutants. In The World, The Flesh, And The Devil, the old sin of jealousy. In Five and the present film, it's just an individual who rocks the boat, although in Target Earth the appearance of such an element is intrusive and less of a piece.\n\nAnother distraction is the group of scientists who, working around the clock, try and find a means to destroy the invaders by technical means. The robots' main weapon is based around their cathode ray beams - made before the mechanics of television were wider known, this - and this is the thing the specialists set out to overcome. Practically a story separate in itself, and almost completely detached from the human-interest taking place elsewhere in the fractured city, sadly it's just one more strand keeping the viewer's eyes off the expected giant robots for a few extra scenes. As in most 1950s' invasion movies, these white-coat, top brass discussions are the most static and un-involving. (In fact it took films like Colossus - The Forbin Project or The Andromeda Strain of a generation later, to inject some real drama into on-screen scientific analysis.) And when the enemy does strike, crashing in and pursuing members of the small group up to the roof, the boxy, not-at-all gigantic robot is a disappointment to the modern viewer, if it ever did prove convincing. However it's a scene the audience has been praying for by this point, and the hulk's attack remains strangely memorable. There are other pleasures along the way of course, notably some of the dialogue, such as when Frank explains his theory why the invaders have come from Venus (because it allegedly has similar atmospheric conditions to Earth).\n\nNora is impressed: \"Say, where did you learn all this?\" Frank: \"In college. My best friend lent me his science fiction books.\" It's a casually gormless exchange, the like of which has been parodied recently in the affectionate homage Lost Skeleton Of Cadavra.\n\nThe various elements on offer here are part of the fun, and none of this is to say that Target Earth is anything less than entertaining even if it lacks a good deal of the action it suggests. Incidentally the DVD release is considerably enhanced by the extras, notably a commentary by, and a tribute to, the producer Herbert Cohen, taken off a laser disc release a few years back, whose first film as an independent this was. Arguably he has claim to be the auteur in this instance, rather than director Rose - who only ever made a couple of other budget war movies, being also responsible for such additional Z-grade classics as I Was A Teenage Werewolf and I Was A Teenage Frankenstein (both 1957, and featuring Target Earth's co-star Whit Bissell), as well as the cult British title Horrors Of The Black Museum (1959). The heartfelt, and somewhat moving, tribute to Cohen is by Didier Chatelain, a long time Cohen friend and associate, uses copious stills and lasts 20 minutes. In all, it is a generous package marking the work of the man who once helped bring the world Bela Lugosi Meets A Brooklyn Gorilla (1952). Of course, War Of The Worlds this isn't, but for some ripe bargain basement nostalgia, or for a glimpse of what science fiction terrors gripped late 1950s' screen viewers, I still recommend it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Giant robots from Venus invade Chicago. Stranded in the deserted city are strangers Frank and Nora.",
        "duration": "PT2M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4245930777",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjMwNTkxMTYtNTg2Yi00NTFjLWE4OGMtNGQ5MGMxNDQ0ZWQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjMwNTkxMTYtNTg2Yi00NTFjLWE4OGMtNGQ5MGMxNDQ0ZWQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-21T18:24:14.042Z",
        "url": "https://www.imdb.com/video/vi4245930777/"
    },
    "url": "/title/tt0047559/"
}