{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael T. Weiss",
            "url": "/name/nm0919117/"
        },
        {
            "@type": "Person",
            "name": "Olivia d'Abo",
            "url": "/name/nm0001882/"
        },
        {
            "@type": "Person",
            "name": "Jeff Bennett",
            "url": "/name/nm0071818/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6815,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030830/"
        },
        {
            "@type": "Person",
            "name": "Edgar Rice Burroughs",
            "url": "/name/nm0123194/"
        },
        {
            "@type": "Person",
            "name": "Bill Motz",
            "url": "/name/nm0609600/"
        },
        {
            "@type": "Person",
            "name": "Bob Roth",
            "url": "/name/nm0744793/"
        }
    ],
    "datePublished": "2002-07-23",
    "description": "After being married an entire year, Jane thinks back on some of her and Tarzan's adventures as she searches for something special to mark the occasion with.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Loter",
            "url": "/name/nm0521425/"
        },
        {
            "@type": "Person",
            "name": "Victor Cook",
            "url": "/name/nm0177328/"
        },
        {
            "@type": "Person",
            "name": "Don MacKinnon",
            "url": "/name/nm0533557/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Animation",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAwMTM5NzM4OF5BMl5BanBnXkFtZTcwOTE2NDkyMQ@@._V1_.jpg",
    "keywords": "character names as title,tarzan character,male protagonist,lava,volcano",
    "name": "Tarzan & Jane",
    "original_info": {
        "id": "Tarzan and Jane_2002",
        "name": "Tarzan and Jane",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2009-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0313680/"
        },
        "name": "Not bad, but could have been a lot better.",
        "reviewBody": "I personally don't think it is the worst Disney sequel, but it does pale in comparison to the original movie. I don't Tarzan is the best Disney movie, but I still loved it. Now Tarzan and Jane's first problem is that it is merely three episodes of the TV show. The animation isn't that brilliant to be perfectly honest with you, but I can understand why it looked Saturday morning cartoon standard, because that's what the TV show is. A good example is the animation of Jane, it was very ugly at times. The songs aren't the best I've ever heard, but I've heard a lot worse. Cinderella 2's songs were awful. And I actually liked Mandy Moore's singing. I agree with the other comments it could have had a lot more humour, there were valiant attempts throughout the movie, especially Terk's \"Mr. Fancypants\" line, but there could have been a lot more. The characters aren't as likable than they were in the first film, and all the voice actors are different. The new voice actors, like Olivia D'Arbo, April Winchell and Jim Cummings do their best, but their characters don't have enough personality, and Tarzan's voice actor, while spirited and well done, just lacked the extra ingredient, charisma. The plot merely consists of three stories, and while they are well-voiced and well-intended, they are let down by a lack of imagination. The diamonds in the volcano reminded me a little bit of Congo. Though I liked some of the new characters, I mean Jane's friends were a nice touch. Another pro of the movie was that at an hour and a quarter, it's a good length and goes along at a reasonable pace. In conclusion, I don't think it was awful, but it could have been better. 6/10 Bethany Cox.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0313680/"
}