{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Homayoun Ershadi",
            "url": "/name/nm0259831/"
        },
        {
            "@type": "Person",
            "name": "Abdolrahman Bagheri",
            "url": "/name/nm0046667/"
        },
        {
            "@type": "Person",
            "name": "Afshin Khorshid Bakhtiari",
            "url": "/name/nm0049086/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32769,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "Taste of Cherry",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036338/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008195/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053189/"
        },
        {
            "@type": "Person",
            "name": "Abbas Kiarostami",
            "url": "/name/nm0452102/"
        }
    ],
    "datePublished": "1997-11-26",
    "description": "An Iranian man drives his car in search of someone who will quietly bury him under a cherry tree after he commits suicide.",
    "director": [
        {
            "@type": "Person",
            "name": "Abbas Kiarostami",
            "url": "/name/nm0452102/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDg3Y2Q5YzMtMzNlYy00Y2MxLTkwYjctN2RhNDQ2NzczYWU4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "suicide,abrupt ending,driving a car,conversation in a car,iran",
    "name": "Ta'm e guilass",
    "original_info": {
        "id": "Taste of Cherry_1997",
        "name": "Taste of Cherry",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RJBurke1942"
        },
        "dateCreated": "2019-06-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120265/"
        },
        "name": "Where we contemplate suicide from a totally different perspective",
        "reviewBody": "Although I've seen many movies from other Iranian and Middle Eastern directors, this is the first I've watched from the late director, Abbas Kiarostami. And like some of those others - Nuri Ceylan from Turkey comes to mind - Kiarostami, in this story, exclusively concentrates on questions about the human condition. Specifically, it's about the self-destructive urge by one man. And it is here that Kiarostami inverts the whole idea of helping those who contemplate suicide.\n\nSuicide, in itself, is a ready and obvious turn-off for many viewers, probably. And coupled with the apparent treacle-like pace of the narrative and the repetitive scenes of a lone man, Badii (Homayoun Ershadi), driving in and around hills outside Tehran, this story gives a whole new dimension to the idea of going over the same ground, again and again, to prove a point. And all the while we, as viewer, are inside the auto for most of this movie, up close and very personal....\n\nBut to avoid seeing this movie would be a big mistake, in my opinion.\n\nI say that simply because the idea of suicide has probably occurred to most people, including myself, at some time in their lives. Whether that idea was part of Kiarostami's motivation for making this movie, we will never know, of course. I dare say it occurred to him, though.\n\nAt the first frame, we're in Baddii's well-worn Range Rover as he drives, his face set, his gaze wandering here and there, searching for a likely assistant for his plan to kill himself. In sequence, he stops a variety of men - a seminarian, a young soldier, a security guard; each man and Badii converse about his need to have somebody help him to suicide, Badii describing what a helper must do. Each time, Baddi has no success until, with a blindingly quick jump-cut, an old man, Bagheri (Abdolrahman Bagheri) is in the car, a helper who finally agrees to abide by Badii's wishes.\n\nSo, after taking Bagheri to close where he lives, Badii drives off, content that he has secured a deal; rapidly, however, he drives back in a fluster, as doubts creep into his mind. Frantically, he walks around the area until he finds the old man Bagheri to seek further assurance he will indeed help Badii next morning. Somewhat annoyed, the old man again gives his solemn promise. And stalks off.\n\nSlowly then, Badii returns to his home/apartment, makes his final preparations, makes a point of turning off all the lights as he leaves, locks the door, leaves his car, and then takes a taxi back to the cherry tree, he had previously selected, at which he will terminate his life during the night, and as thunderstorms - a much-overused trope perhaps - begin.\n\nIt is there, then, that I will leave you to find out why Bagheri decided to help, and about Badii's fate that night. And about an absolutely unexpected ending.\n\nIt's a bleak story, but one that is played out in too many ways by thousands every day, more or less in every country on the planet, probably. Perhaps then, Kiarostami is urging us to think upon that more often as we all traverse our own daily ups and downs - and especially in relation to those who are nearest. Once seen, this is not a movie to forget.\n\nRecommended for all, except toddlers obviously. Give it eight out of ten.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Zeitgeist Films",
        "duration": "PT1M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi882180377",
        "name": "Taste of Cherry",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjRhYmU0MjktMzkwMS00OGRmLWE5ZmItMDJkNzE2Nzc5MDBjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjRhYmU0MjktMzkwMS00OGRmLWE5ZmItMDJkNzE2Nzc5MDBjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:57:08Z",
        "url": "https://www.imdb.com/video/vi882180377/"
    },
    "url": "/title/tt0120265/"
}