{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nathan Lane",
            "url": "/name/nm0001447/"
        },
        {
            "@type": "Person",
            "name": "Shaun Fleming",
            "url": "/name/nm0281788/"
        },
        {
            "@type": "Person",
            "name": "David Ogden Stiers",
            "url": "/name/nm0001773/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1857,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030830/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048687/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008970/"
        },
        {
            "@type": "Person",
            "name": "Gary Baseman",
            "url": "/name/nm0059718/"
        },
        {
            "@type": "Person",
            "name": "Bill Steinkellner",
            "url": "/name/nm0826137/"
        },
        {
            "@type": "Person",
            "name": "Cheri Steinkellner",
            "url": "/name/nm0251482/"
        }
    ],
    "datePublished": "2004-01-16",
    "description": "Spot (Lane) is a dog who can talk and read. Posing as a human, he sneaks into school with his master Leonard (Flemming). Educational adventures ensue.",
    "director": [
        {
            "@type": "Person",
            "name": "Timothy Björklund",
            "url": "/name/nm0074723/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDVlOTVmMzYtMzhlMC00YWY1LTg0NjMtZjg1MTIxZGMyMmFjXkEyXkFqcGdeQXVyNDAxNjkxNjQ@._V1_.jpg",
    "keywords": "no title at beginning,singing,2d animation,hand drawn animation,traditional animation",
    "name": "Teacher's Pet",
    "original_info": {
        "id": "Teacher's Pet_2004",
        "name": "Teacher's Pet",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pasafist"
        },
        "dateCreated": "2004-01-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0350194/"
        },
        "name": "Disney's Latest Excuse For Family Entertainment",
        "reviewBody": "The term \"family film\" really gets me angry. Why? Because for every film that is out there that is good enough to be for the entire family, there are at least 50 others that are not only wasting their parent's time, but they are not respecting their intended audience. Disney's new animated film TEACHER'S PET is both patronizing and extremely sloppy.\n\nSpot Helperman(Voiced by Nathan Lane, The Lion King) is a dog who longs to be a real boy. He dresses up like a little boy and goes to school with his master Leonard (Shaun Fleming, Jeepers Creepers 2), and for some odd reason Leonard's mother (Debra Joy Rupp, TV's That 70's Show) is their teacher. When Leonard's mother wins a trip to Florida, Leonard longs to have fun on the beach with his dog. Spot wants to go to Florida to meet a wacko doctor (Kelsey Grammer) who can turn animals into humans.\n\nAs I sat through this supposed \"musical comedy\" I asked myself, Why? Who in their right mind said this film was worthy enough to make? Who said \"hey the script is ready, let's make this movie?\" The simple answer is money. But let's be honest, this turkey is not going to make any money. This is not the film that is going to be locked in the Disney Vault for ten years, to be released with much fanfare.\n\nThis is a shoddy movie that aspires to be HEY ARNOLD, THE MOVIE. Its script is not technically a story, it is bad jokes designed to stretch running time. TEACHER'S PET is a 15 minute animated short with over an hour of bad jokes designed to stretch the running time.\n\nMost would probably say, \"why are you being so hard on this movie? It's designed for little kids not a 24 year old male.\" I say if you are going to spend large amounts of money on a film and you expect parents to bring their little tykes, and you create a film that makes even a toddler bored, I cannot go easy on it.\n\nThis film has no charm. The jokes are too abrasive, and there are far too many things going on. It also features this really odd subplot involving Spot and Leonard's mother that made me feel really, really uncomfortable. Its inclusion was both unnecessary and hard to explain without making it sound sicker than it really is.\n\nFinally I muse about the PG rating for this film. Why? It will play well only to four or five year olds. When I think of a PG movie I think of kids between 8-10. Why create a film geared at toddlers and market it to seven-year olds? You got me. I don't know why this film is PG. It contains no bad language, no sex, and no real violence. It's not even scary. If anyone can figure this out, I will give you a hearty handshake.\n\nIf you are looking to waste a child's time, stay at home and rent ET. They'll love it. TEACHER'S PET on the other hand is a vapid mess. If you want my advice, instead of dropping forty bucks to take the brood to see this film, spend that money on a really big cardboard box. Your kids will have far more fun with that."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Music Video \"I Wanne be a Teacher's Pet\"",
        "duration": "PT1M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi281084185",
        "name": "Teacher's Pet",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmE0NzRlNDctNWU5Mi00YjkzLWE4ODctYjNmZDAyYzU2ZDE4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmE0NzRlNDctNWU5Mi00YjkzLWE4ODctYjNmZDAyYzU2ZDE4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-08-04T03:49:10Z",
        "url": "https://www.imdb.com/video/vi281084185/"
    },
    "url": "/title/tt0350194/"
}