{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tempest Storm",
            "url": "/name/nm0832626/"
        },
        {
            "@type": "Person",
            "name": "Bettie Page",
            "url": "/name/nm0656114/"
        },
        {
            "@type": "Person",
            "name": "Trudy Wayne",
            "url": "/name/nm0915651/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 313,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0034349/"
        }
    ],
    "description": "A collection of numerous burlesque acts from the 1950s, including strippers, and cult character Betty Page introducing the acts.",
    "director": [
        {
            "@type": "Person",
            "name": "Irving Klaw",
            "url": "/name/nm0458480/"
        }
    ],
    "duration": "PT1H7M",
    "genre": [
        "Comedy",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjI1NDRhNGUtYjZjNC00YWZhLTgxN2UtOWNiOGZlM2ZkM2MwXkEyXkFqcGdeQXVyMTA4NTQwNjY4._V1_.jpg",
    "keywords": "cult,burlesque,stripper,variety show,wig",
    "name": "Teaserama",
    "original_info": {
        "id": "Teaserama_1955",
        "name": "Teaserama",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "redryan64"
        },
        "dateCreated": "2014-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048700/"
        },
        "name": "Could Probably Be Shown On Network TV Today",
        "reviewBody": "IF ONE IS expecting to see some really steamy scenes or a really credible recreation of the Burlesque Shows of bygone days, he'd have to look elsewhere. Oh sure, you say, \"How do you know, Ryan? Well, you'd be right, at least to a degree. We never did see any such live performances; but in this fact is the key to our assertion.\n\nTHE PRODUCTION, AS it is, looks wooden. stagy and the product of a cheap sound-stage; rather than would a filmed record of a show at the FOLLIES, MINSKY'S or What Have You.\n\nAS FOR THE cast, we recognize two of them from their work outside of the Burlesque circuits. First of all, Bettie Page is much in evidence. The impish little brunette with the Prince Valiant/Page Boy hairdo does her number and assists later.\n\nSECONDLY IN THIS category of \"the recognized & Familiar\" is veteran Burlesque Comic, Joe E. Ross. Having once been described as \"a Jewish Wallace Beery\", this was before he and his work became known to the general public through his characterizations on TGV sitcoms. He was Mess Sergeant Rupert Ritzyk on THE PHIL SILVERS SHOW/YOU'LL NEVER GET RICH and followed that up with a co-starring gig (with Fred Gwynne) as Patrolman Gunther Toody, NYPD, on CAR 54, WHERE ARE YOU? \n\nAS FOR THE \"adult content\" of TEASARAMA, one must remember that it was 1955, not the \"enlightened\" days that we have witnessed. What was considered to be 'naughty' or 'sexy' or even 'hot stuff' in that day bygone day.\n\nTHIS SORT OF film was usually exhibited in various \"Art Theatres\" or in the local Drive-In Theatres (aka \"Passion Pits\"), which also would screen some 'soft core', semi-nudies which usually displayed bare breasted, movie-star wannabees in some silly, senseless \"comic\" stories; which were clearly designed to be titillating and aimed at the prurient interests of young males.\n\nIT DOES REPRESENT a vanishing or even now extinct branch of the lively arts. The Burlesque Show's being a conveyance of being 'naughty' for young males has gone the way of the steam locomotive, ash trays and public telephone booths. It is for these reasons that one may enjoy screening this, if only once.\n\nONE OTHER ASPECT of this movie, TEASARAMA is that some of the strippers featured sure appear to have become rather \"Long in the Tooth\".\n\nWE CAN ONLY surmise that making a film like this was a sort of last resort for the aging strippers, possibly a Swan Song.\n\nNOTE: At the time of this writing, neither Schultz nor I have any reason to footnote anything in this write-up. Amazing, no?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Teaserama",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2122842393",
        "name": "Teaserama",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGU4YmQxODMtNTdmZC00YWJlLWIwODUtOTU4YzNkN2Y0ODc0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGU4YmQxODMtNTdmZC00YWJlLWIwODUtOTU4YzNkN2Y0ODc0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:06:59Z",
        "url": "https://www.imdb.com/video/vi2122842393/"
    },
    "url": "/title/tt0048700/"
}