{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tilda Swinton",
            "url": "/name/nm0842770/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Davies",
            "url": "/name/nm0001111/"
        },
        {
            "@type": "Person",
            "name": "James Urbaniak",
            "url": "/name/nm0881672/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1691,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013385/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0119787/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028742/"
        },
        {
            "@type": "Person",
            "name": "Lynn Hershman-Leeson",
            "url": "/name/nm0380961/"
        }
    ],
    "datePublished": "2010-10-26",
    "description": "Tilda Swinton plays four roles in this award-winning film about Rosetta Stone and her three Self-Replicating Automatons, which she cloned from her own D.N.A.",
    "director": [
        {
            "@type": "Person",
            "name": "Lynn Hershman-Leeson",
            "url": "/name/nm0380961/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzI0MTA3OTQtYmJlYi00MWU2LTgyZGQtYzNjYjY4ZWE0NmEyXkEyXkFqcGdeQXVyODgwNjY1NjY@._V1_.jpg",
    "keywords": "mechanical man,hot,sex scene,sexy,british sex comedy",
    "name": "Teknolust",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "insightstraight"
        },
        "dateCreated": "2005-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0270688/"
        },
        "name": "Like a Sufi tale, it has layers",
        "reviewBody": "I purely love movies which sharply polarize the viewers! These are the films which consistently make worthwhile viewing -- regardless of how we feel about the film, there are enough people with opposing viewpoints that we can consider for a fresh insight on things...\n\n\"Teknolust\" is this process, in small. To some, it seems dull, to others, thoughtful. Some find it obvious and crudely drawn, others see it as a symbolic metaphor. Some belabor the obvious scientific inconsistencies, while others focus on the human side of things.\n\nThis movie is something of a landmark, being the first(?) feature-length production to be shot entirely in digital 24P. The sharp visuals are the result of this. (No technical stuff, but 24P is a step toward making digital video more \"film-like\". It is interesting to note that the director still chose to keep, and exaggerate, the \"digital feel\" for the production.) Tilda Swinton is definitely a draw -- one of my favorite actresses, utterly fearless, and it is delightful to see her with so much to work with. LOVED her interpretive dance -- sheer fun! Upon considering the reviews which felt the acting to be hopelessly wooden, I can see where they are coming from. But it may well be that this was a deliberate approach by the director -- doesn't Rosetta tell Ruby to be \"more robotic\" on her web portal, as she is starting to appear \"too real\"? The more I think about it, the more it seems to me that the slightly detached acting was yet another mechanism to make us question what is real and what is only presented to us.\n\nThe movie features many wry little jokes -- I love that Rosetta's geneticist associate is named \"Crick\" (Crick & Watson & Wilkins were awarded the Nobel Prize in 1962 for discovering DNA) -- and I suspect that further viewings will reveal more. Lots of little questions, too -- like why does Agent Hopper have little adhesive bandages on his face, in different places during the movie? Does he have a disease? There are also some interesting questions raised about our reality in a digital world. How many copies are we removed from the original? At what point does copy degradation set in? (The copy center employee who is fascinated by skewed, imperfect copies is a brilliant concept for a character.) For many people, daily and digital lives are overlapping. What would it be like if they blended, with just as much casual copying and exchanging of information? (A virus is essentially an information packet.) Is \"real\" reality ultimately more desirable than digital \"reality\"? \n\nI look forward to watching Teknolust again. With an open mind. And a touch of dream. And some friends, to discuss it with afterward.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this sci fi thriller",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1416759065",
        "name": "Teknolust",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjQ1NWQxNDctNDZkOC00MDQ4LWE3NmUtMTc3NTczMmVmOWE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjQ1NWQxNDctNDZkOC00MDQ4LWE3NmUtMTc3NTczMmVmOWE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:56:04Z",
        "url": "https://www.imdb.com/video/vi1416759065/"
    },
    "url": "/title/tt0270688/"
}