{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Doug Savant",
            "url": "/name/nm0767443/"
        },
        {
            "@type": "Person",
            "name": "Nia Peeples",
            "url": "/name/nm0001604/"
        },
        {
            "@type": "Person",
            "name": "Michael Ironside",
            "url": "/name/nm0000461/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 289,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0069955/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094479/"
        },
        {
            "@type": "Person",
            "name": "Nancy Isaak",
            "url": "/name/nm0410599/"
        },
        {
            "@type": "Person",
            "name": "Robin Cook",
            "url": "/name/nm0177257/"
        }
    ],
    "datePublished": "1996-02-12",
    "description": "A hospital in need of funds announces a cure for a form of brain cancer, having saved several wealthy men's lives. When a young girl with the cancer dies, one doctor notices that she and all the cured men had been treated with exa...",
    "director": [
        {
            "@type": "Person",
            "name": "Larry Elikann",
            "url": "/name/nm0253605/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA4Njc2OTcwMF5BMl5BanBnXkFtZTcwMTU2NjAyMQ@@._V1_.jpg",
    "keywords": "wet hair,rain,stethoscope,syringe,flowers",
    "name": "Terminal",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "philip_vanderveken"
        },
        "dateCreated": "2004-11-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117879/"
        },
        "name": "A movie for people that love soap opera's",
        "reviewBody": "Calling this movie mediocre would still be too flattering for this ordinary B-movie. This is an uninspired hospital drama / would-be thriller that didn't convince me once. It felt more like a bad soap opera with unknown or at least not very famous actors who didn't do much effort to raise the quality of this movie with their talents. \n\nIt's about a hospital where a cure against a certain kind of brain cancer has been developed. The hospital's only problem is that the government no longer wants to subsidize the project and that they will soon need a lot of money. But no problem, they have found a solution: they will cure CEO's and owners from big companies from a brain tumor. After being cured they will feel obliged to donate a lot of money to the hospital, ensuring the further existence of the project. There are only two problems: some people know too much and need to be put out of the way. The other problem is that the patients don't have a brain tumor at all, so some nurses and doctors inject a virus which will start the growth of the brain tumors, which than can be cured with their product...\n\nThe story on itself isn't already the best in the history of cinema, but OK, I can still live with that. The main problem I had with this movie is the way hospitals, researchers, doctors, the medical staffs,... are portrayed. It's true that they would do a lot for some extra money, but they would never try to kill people. Another thing that bothers me so much is the message at the end of the movie. It was something like: the medical world does everything to find a cure for cancer but all they have found until now is a way to kill people with it... Let's be honest: everybody knows it isn't easy to find a cure for cancer. In the near future they might find something, but it will still take a lot of time. \n\nThe main problem with this kind of movies is that it will not be seen by doctors and researchers in the first place, but by ordinary people. Not everybody has the knowledge of a doctor and a lot of people are easy to influence. Some of them, and perhaps cancer patients in particular, might think they are better off without medical care because doctors only want to kill them. This may sound like I take this personal and in a way I do. I don't like to see an attack like this one on these people. I'm not a doctor and I don't know much about science, but what I do know is that they did everything they could to cure my father from cancer. They failed, but at least they did their best. \n\nI'm not sure of course, but if I have to categorize the group of people who would like this movie, than I would say the same public that loves to watch soap opera's. I guess that must be housewives in their 40's and 50's. No problem with soap opera's but too many people believe that what happens in it is real and I'm afraid the same will happen with this movie. I don't recommend the movie to anybody, but if I have to put a score on it, than I would say 3/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0117879/"
}