{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Justine Waddell",
            "url": "/name/nm0905311/"
        },
        {
            "@type": "Person",
            "name": "Jason Flemyng",
            "url": "/name/nm0002076/"
        },
        {
            "@type": "Person",
            "name": "Oliver Milburn",
            "url": "/name/nm0586958/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2027,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017529/"
        },
        {
            "@type": "Person",
            "name": "Thomas Hardy",
            "url": "/name/nm0362762/"
        },
        {
            "@type": "Person",
            "name": "Ted Whitehead",
            "url": "/name/nm0925682/"
        }
    ],
    "datePublished": "1998-09-13",
    "description": "A free-spirited yet naive country girl is caught between her wealthy, manipulative \"cousin\" Alec and the handsome, educated farmer Angel Clare in this Victorian tragedy from novelist Thomas Hardy.",
    "director": [
        {
            "@type": "Person",
            "name": "Ian Sharp",
            "url": "/name/nm0789054/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5NTcxOTYzMl5BMl5BanBnXkFtZTcwMjg4OTMyMQ@@._V1_.jpg",
    "keywords": "character name as title,forename in title,prologue,scene during opening credits,dancer",
    "name": "Tess of the D'Urbervilles",
    "original_info": {
        "id": "Tess of the D'Urbervilles_1998",
        "name": "Tess of the D'Urbervilles",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2013-11-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0126100/"
        },
        "name": "The best version of Tess of the D'Urbevilles",
        "reviewBody": "Though all three adaptations I've seen have been very good in their own way, the other two being the Polanski film and the Gemma Arterton mini-series, all three do a noble job adapting a literary classic. Of the three personal favourite and best has to go to this version, and while that it is the most faithful of the three to the book what is done on its own is even more remarkable. The locations are evocative and manage in being really beautiful and atmospheric. The photography matches those qualities with its richness, this is a really beautifully shot adaptation and of the three versions it is the most striking visually. The music adds a lot to the atmosphere too, a great mix of haunting and emotive, very well suited for the nature of the story and the impact of Tess' plight. The dialogue is intelligent and has the spirit of Hardy's writing with the vivid descriptions and his way of words, phrases and poetry. The story really packs a powerful impact and adapted in a way that doesn't make the telling of it feel too complicated. the ending is absolutely heart-breaking. The acting from the three leads is spot on. Justine Waddell is a Tess that we feel immediately feel sympathy for and Waddell also brings dignity to the character. Oliver Milburn's Angel Clare has a sense of optimism though he doesn't make him too one-dimensional, we still get a sense that Angel Clare is not as innocent as he seems. In contrast we have Jason Flemying who portrays Alec as a genuine sleaze and cad and in a malevolent way but there is still the sense that he did love Tess. All in all, brilliant and the best of the three adaptations personally seen of Tess of the D'Urbevilles, if there is a better version I've yet to see it and it has to be really amazing to beat this. 10/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0126100/"
}