{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jane Alexander",
            "url": "/name/nm0000737/"
        },
        {
            "@type": "Person",
            "name": "William Devane",
            "url": "/name/nm0001137/"
        },
        {
            "@type": "Person",
            "name": "Rossie Harris",
            "url": "/name/nm0365283/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6712,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046666/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057924/"
        },
        {
            "@type": "Person",
            "name": "Carol Amen",
            "url": "/name/nm0024562/"
        },
        {
            "@type": "Person",
            "name": "John Sacret Young",
            "url": "/name/nm0949722/"
        }
    ],
    "datePublished": "1984-01-05",
    "description": "The life of a suburban American family is scarred after a nuclear attack.",
    "director": [
        {
            "@type": "Person",
            "name": "Lynne Littman",
            "url": "/name/nm0003313/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTE4ZTU0MDEtOTE1Ny00NGEwLWJkOWUtYzdmODRkYmEzNDFmXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "cold war,nuclear attack,nuclear war,survival,world war three",
    "name": "Testament",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "michaelsev"
        },
        "dateCreated": "2004-08-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086429/"
        },
        "name": "A small, brilliant gem of a film that still holds up after 20 years",
        "reviewBody": "I first saw \"Testament\" when it came out in 1983. At the time, I was 30 years old and the mother of a two year-old son. As a child of the Cold War years, I have always been interested in films about that most unthinkable event: the detonation of a nuclear bomb or bombs somewhere on our fragile planet. If you are, too, you must watch \"Testament\" (and another small gem of a slightly earlier era called \"Fail-Safe.\")\n\nThis is a wonderful film that slowly, unbearably reveals what happens in the small, idyllic town of Hamlin after a full-scale nuclear exchange between the superpowers wipes out a large part of America. The town and its citizens, including the Weatherly family, escape initial destruction. But slowly the bonds that hold western societies together (electricity, communication, fresh food, medical help) begin to fray and ravel. There is no television. Batteries to power transistor radios suddenly become more valuable than $20 bills in a town where, suddenly, there's nothing left to buy.\n\nThe story and scenes are permeated with a sense of enormous loss. A family loses its husband and father who simply walked out the door, waving a breezy goodbye one morning, and disappeared into the holocaust. All his wife, Carol, and two children have left of him are their memories and some flickering images on home movies, glimpses not just of a lost loved one, but of a lost -- and loved -- world. \n\nA school play about the Pied Piper was in rehearsal before catastrophe hit, and, desperate to recapture some normalcy and to divert the children's attention from a reality to horrible to contemplate, the town decides to go on with the show.In the earlier rehearsal scenes, life was normal, the future shone brightly in the children's faces. Now, as the parents watch the performance, they see no future for these beautiful innocents. To me, this is the key scene of the film: the contrast between what these people once had and what has been lost is staggering. It makes you want to go outside, smell the air, marvel at the full supermarket shelves and the working telephone lines. (This is a gift that the movie gives its audience which goes far beyond entertainment and approaches enlightenment.)\n\nBeyond the wonderful writing, direction and performances, I love the tiny touches in the story. For example, there's the foreshadowing, the implicit warning contained in the presence of a minor character, a little Japanese boy with Down Syndrome who is cared for by the town after his father dies. The child's name is Hiroshi. Pay attention, the script commands us in a whisper: Hiroshima happened once, but it can happen again, and it can happen to you as well as \"them.\" \n\nIn the end, the movie is a testament to this undeniable fact, a testament to the stupidity of men who continue building ever-larger, more lethal means of mass destruction, and finally, a testament to the strength of mothers like the character of Carol Weatherly who have no choice but to love and protect their children no matter what comes."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The life of a suburban American family is scarred after a nuclear attack.",
        "duration": "PT1M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2727330585",
        "name": "Teaser Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGEyNzk0YjktNzhjNS00ZTk5LTlhNWUtNGI2YjVjZGZhNjM3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGEyNzk0YjktNzhjNS00ZTk5LTlhNWUtNGI2YjVjZGZhNjM3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-28T20:42:17.695Z",
        "url": "https://www.imdb.com/video/vi2727330585/"
    },
    "url": "/title/tt0086429/"
}