{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ajay Devgn",
            "url": "/name/nm0222426/"
        },
        {
            "@type": "Person",
            "name": "Tabu",
            "url": "/name/nm0007102/"
        },
        {
            "@type": "Person",
            "name": "Amrish Puri",
            "url": "/name/nm0700869/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 673,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023946/"
        },
        {
            "@type": "Person",
            "name": "Govind Nihalani",
            "url": "/name/nm0631539/"
        },
        {
            "@type": "Person",
            "name": "Kamlesh Pandey",
            "url": "/name/nm0659238/"
        }
    ],
    "datePublished": "1999-12-03",
    "description": "A man's (Ajay Devgan) loyalty to his underworld friend (Rahul Bose) interferes with his relationship with a dancer (Tabu) who hates violence.",
    "director": [
        {
            "@type": "Person",
            "name": "Govind Nihalani",
            "url": "/name/nm0631539/"
        }
    ],
    "duration": "PT2H43M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWVmOGY4ODktZmFmNi00ZjM4LWEzM2YtNDhiNjQyZWJjNTA2XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_.jpg",
    "keywords": "builder,violence,psychopath,rivalry,gang war",
    "name": "Thakshak",
    "original_info": {
        "id": "Thakshak_1999",
        "name": "Thakshak",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mathew-magimaidoss"
        },
        "dateCreated": "2006-06-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0215245/"
        },
        "name": "a poor commercial attempt of Govind Nihalani!",
        "reviewBody": "Thakshak tells how Ishaan (Ajay Devgan) an underworld guy comes out of the underworld to join common people through the inspiration of his love Suman (Tabu). The story subject is no new. It has been beaten to death by several directors in Indian cinema.\n\nWhat makes Thakshak watchable is Govind Nihalani's treatment of the subject and, good acting by Ajay Devgan, Rahul Bose and Tabu. Instead of having too many gun shots and killings, Govind Nihalani through one family killing brings five view points together; the view of common people (Tabu); the view of the guy who understands the underworld he is in and who is trying to understand the common people through his love (Ishaan); the arrogance of power (Sunny, Rahul Bose); the view of the government elected-by common people; and, the view of law protecting the common people. Note that the later two are also part of the power play. Govind Nihalani churns a nice tale around these view points and gives an entertaining movie.\n\nHowever, Thakshak falls short of the standard set by Govind Nihalani himself. From the very first scene of the movie, he shows that Ishaan sees the world through the eyes of his love Suman and she is his salvation. Also, from the first killing itself Nihalani shows the arrogance of power (listen to the dialogues of Sunny and the retired teacher) . If only Nihalani had kept Thakshak tightly around these premise with strong dialogues and screen play (thark/vithark) instead of putting onus on acting skills (of Ajay Devgan, Rahul Bose and Tabu) and songs, Thakshak would have been another master piece. Especially, the presence of songs make the movie slow and lengthy and at times loses the attention of the audience (the songs only give Tabu more screen presence). The acting of the three main characters is first rate but if there was strong interaction between these characters in-terms of strong screen play and dialogue (in most of the scenes between Tabu and Ajay Devgan, Ajay Devgan keeps quite with a sad face; this is true with other scenes of Ajay Devgan too), Ishaan and Suman would have also left lasting impression like Sunny. I think Nihalani realized it and avoided these mistakes while making is next commercial movie Dev, which is a real master piece.\n\nNevertheless, Thakshak is much better and entertaining than the standard bollywood movies.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0215245/"
}