{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Topher Grace",
            "url": "/name/nm0333410/"
        },
        {
            "@type": "Person",
            "name": "Laura Prepon",
            "url": "/name/nm0696059/"
        },
        {
            "@type": "Person",
            "name": "Mila Kunis",
            "url": "/name/nm0005109/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 181645,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005063/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056447/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030713/"
        },
        {
            "@type": "Person",
            "name": "Mark Brazill",
            "url": "/name/nm0106373/"
        },
        {
            "@type": "Person",
            "name": "Bonnie Turner",
            "url": "/name/nm0877425/"
        },
        {
            "@type": "Person",
            "name": "Terry Turner",
            "url": "/name/nm0877901/"
        }
    ],
    "datePublished": "1998-08-23",
    "description": "A comedy revolving around a group of teenage friends, their mishaps, and their coming of age, set in 1970s Wisconsin.",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2RkZGE0MjAtZGVkOS00MzVhLTg0OWItZTc4OGRjOTQ1ZTM4XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "wisconsin,1970s,crude humor comedy,basement,group of friends",
    "name": "That '70s Show",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Sandcooler"
        },
        "dateCreated": "2008-01-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0165598/"
        },
        "name": "What eighth season?",
        "reviewBody": "Over the years, we've seen a lot of preposterous things done by writers when the show just had to go on no matter what, keeping \"8 Simple Rules\" going after John Ritter died comes to mind, but this is probably the first time I cared. The idea of having \"That 70's Show\" without Eric or to a lesser extent Kelso is ridiculous. They tried to cover it up with a comeback of Leo and increasingly outrageous story lines, but it always felt like why bother when you don't have a main character anymore. It just didn't really connect, it was a bunch of unrelated stuff happening that most of the time wasn't even funny. The last season felt like the season too much for every single character, simply because Eric used to take a lot of screen time and now we'd be smashed in the face by how stale and repetitive the rest of the characters were. Focusing on the gimmick that is Fez was thoroughly uninteresting and the character would simply stop working, because the whole deal was that he'd say something weird from out of nowhere, and you can't say stuff from out of nowhere when every second line is yours. They also brought in the standard cousin Oliver, only this time it just wasn't a kid. Whenever you heard somebody knock on the door, you started praying it wasn't Randy, please let it not be Randy. The deal with Randy was that he'd do really awful jokes, usually as Red would say, smiling like an ass and totally screwing up delivery and Donna would be in stitches. I think more than half of the last season was Donna pretending to be amused. The problems had started earlier though: what once was a truly great show with an equally great concept that for once wasn't about a dysfunctional family slowly got into the territory of soap opera. Everybody started being in love with everybody, emotional scenes were dragged out at nausea, with just one usually lame joke placed somewhere to divert attention that we were watching \"As The World Turns\". I'm guessing this was character development, but come on that was written almost as clumsily as the moral lessons from \"Family Matters\". To be fair, the last episode, also because it had a cameo by Topher Grace (a cameo in his own show), was really good, even if not that funny either.\n\nBy the way, yet more criticism on Season 8: what the hell was with the opening theme? Not only did they use the same joke twice (a character not singing), Fez scared the hell out of me. Dude, don't open your eyes that far. But the first five seasons or so,among the best comedy ever broadcast.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for That '70s Show: Season Six",
        "duration": "PT1M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi285255449",
        "name": "That '70s Show: Season Six",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjg0YzVlZDAtYjE4NS00NTYzLTk2MzQtN2IzYzRlMzFmMzJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjg0YzVlZDAtYjE4NS00NTYzLTk2MzQtN2IzYzRlMzFmMzJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-02-01T06:29:34Z",
        "url": "https://www.imdb.com/video/vi285255449/"
    },
    "url": "/title/tt0165598/"
}