{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Bohringer",
            "url": "/name/nm0092184/"
        },
        {
            "@type": "Person",
            "name": "Michael Gambon",
            "url": "/name/nm0002091/"
        },
        {
            "@type": "Person",
            "name": "Helen Mirren",
            "url": "/name/nm0000545/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 39459,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "X",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057619/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005514/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010528/"
        },
        {
            "@type": "Person",
            "name": "Peter Greenaway",
            "url": "/name/nm0000425/"
        }
    ],
    "datePublished": "1990-04-06",
    "description": "At Le Hollandais gourmet restaurant, every night is filled with opulence, decadence and gluttony. But when the cook, a thief, his wife and her lover all come together, they unleash a shocking torrent of sex, food, murder and revenge.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Greenaway",
            "url": "/name/nm0000425/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTlmM2U5YmQtMTcxYy00MzgyLTkyMDItZjY5Yjc3OTJkMTAzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "adulterous wife,allegory,food,cook,restaurant",
    "name": "The Cook, the Thief, His Wife & Her Lover",
    "original_info": {
        "id": "The Cook_1989",
        "name": "The Cook",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "miloc"
        },
        "dateCreated": "2005-11-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0097108/"
        },
        "name": "Terrifically complex, terrifically beautiful, and just plain terrific.",
        "reviewBody": "Here's the weird secret of this movie: you might actually enjoy it.\n\nPeter Greenaway once commented, \"film is too important to be left in the hands of story- tellers.\" Like almost everything Godard ever said, it's a preposterous statement that ought to be heeded.\n\nAs a filmmaker Greenaway has always delighted in puzzle-pictures; from the twin-based symmetry of \"A Zed and Two Naughts\" to the subliminal counting-game of \"Drowning by Numbers\" to the mad frames-within-frames of \"Prospero's Books\" his films resemble nothing so much as one of Graeme Base's wonderful children's' books (\"The Eleventh Hour\" and \"Animalia\" for instance) brought to life. Plus, of course, a great deal of nudity and assorted nastiness-- enough to get the works of one of the most original filmmakers living a rather sordid reputation.\n\nSo, once you've recovered from the visceral shock of watching \"The Cook, the Thief, His Wife and Her Lover\" the first time, take a step back and watch it again. Yeah, I mean that, do it. Look at it this time as you might a painting by Heironymus Bosch: what appears to be a madman's chaotic hellscape turns out to have a precise allegorical order, and contains such a wealth of symbolism that one viewing cannot possibly be enough to absorb it all. A scene that may seem gratuitously horrific (a naked couple enclosed in a truck full of rotting meat-- probably the moment that jolted me the most) in fact reveals a medievalist's precision (Adam and Eve, cast from Paradise for the First Big Sin, are suddenly subject to the corruption of the flesh). An abstract concept is thus made perfectly and accessibly literal.\n\nDifferent viewers may prefer to see this movie as religious allegory, political screed, or wry class commentary. The fact is it is all of these, and probably more. The irony of Greenaway's quote above is that he is in fact story-telling on several levels at once. (It's the same irony in the comment that \"Seinfeld\" was a \"show about nothing\" when in fact there was more going on per episode than in any other ten sitcoms. It just wasn't \"simple.\")\n\nIn response to criticism over the bloodshed in his movies, Godard once said \"It isn't blood, it's red.\" Meaning: it's all part of a composition, the way color is used on a painter's canvas. It's there for a point, just like Greenaway's explicit yet elegant shocks. With that mind, watch this movie, and enjoy it. It's sharp, gruesomely witty, and as remarkable to look at as almost anything in the Met. If you can handle really thinking, you can handle this, and we all can, can't we?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2706161177",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjY0YzQ1ZDQtYWY0NS00MmUzLWExOWEtZDc3NmU1NjQ1NDNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjY0YzQ1ZDQtYWY0NS00MmUzLWExOWEtZDc3NmU1NjQ1NDNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-28T17:26:24.567Z",
        "url": "https://www.imdb.com/video/vi2706161177/"
    },
    "url": "/title/tt0097108/"
}