{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "William Katt",
            "url": "/name/nm0001411/"
        },
        {
            "@type": "Person",
            "name": "Connie Sellecca",
            "url": "/name/nm0783314/"
        },
        {
            "@type": "Person",
            "name": "Robert Culp",
            "url": "/name/nm0191685/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6113,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026580/"
        },
        {
            "@type": "Person",
            "name": "Stephen J. Cannell",
            "url": "/name/nm0004798/"
        }
    ],
    "datePublished": "1981-03-18",
    "description": "A teacher is asked to be a superhero using a special alien suit with powers he can barely understand or control.",
    "genre": [
        "Adventure",
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwOTc3OTk5Nl5BMl5BanBnXkFtZTcwOTYwODcyMQ@@._V1_.jpg",
    "keywords": "cult favorite,schoolteacher,superhero sci fi,timeframe 1980s,timeframe 20th century",
    "name": "The Greatest American Hero",
    "original_info": {
        "id": "The Greatest American Hero: Season 2_1981",
        "name": "The Greatest American Hero: Season 2",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "14jade"
        },
        "dateCreated": "2002-02-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081871/"
        },
        "name": "So much potential wastedwith one of the greatest American theme songs EVER",
        "reviewBody": "`The Greatest American Hero' is a textbook case of a television show being a victim of `the powers that be.' I was in grade school during the time of its run, but I remember most of the behind the scenes drama. Though its initial debut was well received, it wasn't long before the show met an ill-fated course. First, it was an unfortunate victim of the 1981 Reagan assassination attempt, resulting in the horrific `Hinkley/Hanley' overdub. This event, followed by constant time changes, late season debuts, pre-empts, and the never-ending lawsuit with Warner Brothers and DC comics over its supposed `Superman-like' premise, kept it from reaching its full potential with viewers. Then, like those aliens in the desert, the show disappeared without a trace.\n\nThere are several theories as to why this show never reached its full potential. I personally think Warner Brothers and DC Comics made ABC executives nervous, hence the delays and time changes. While I can certainly understand their motives (the Superman movies were popular at the time) I considered each character to be a separate entity. I never thought William Katt was an exact clone of Christopher (or George, for that matter) Reeve's famous role. Superman (I thought) was a strong, supernatural hero from another planet who masqueraded as a human being. The Greatest American Hero was just an ordinary guy who stumbled upon good fortune and tried to utilize it in the best way he could to help mankind. It could have been anyone that night instead of Ralph Hinkley, for all we know (the lyrics of the theme song attempted to explain this). Katt simply provided a handsome, lovable example of the `imperfect hero.'\n\nMy mother and sister absolutely loved this show. I was the youngest, so I watched it mostly because they did! `The Greatest American Hero' did grow on me, thoughso I, too, have fond memories. I was in love with the theme song, however, from the debut! Even if you didn't like the show, you have to admit that the theme song, `Believe It Or Not,' sung by Joey Scarbury, is one of the greatest of all time. The earlier comments were correct. `Believe It Or Not' is awesome.\n\nAbsolutely awesome!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Extra (Clip) from Anchor Bay Entertainment",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi938672409",
        "name": "The Greatest American Hero: Season Three",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzNlODI3MjgtODE5MC00NmEwLWI2ZGUtYTJmYjNmYjI3NzdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzNlODI3MjgtODE5MC00NmEwLWI2ZGUtYTJmYjNmYjI3NzdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:45:05Z",
        "url": "https://www.imdb.com/video/vi938672409/"
    },
    "url": "/title/tt0081871/"
}