{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "In-hwan Park",
            "url": "/name/nm0661845/"
        },
        {
            "@type": "Person",
            "name": "Moon-hee Na",
            "url": "/name/nm0618520/"
        },
        {
            "@type": "Person",
            "name": "Song Kang-ho",
            "url": "/name/nm0814280/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5533,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "The Quiet Family",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0333421/"
        },
        {
            "@type": "Person",
            "name": "Jee-woon Kim",
            "url": "/name/nm0453518/"
        }
    ],
    "datePublished": "1998-04-25",
    "description": "A family opens a mountain inn where their first guest commits suicide. Suddenly all their guests befall horrible fates.",
    "director": [
        {
            "@type": "Person",
            "name": "Jee-woon Kim",
            "url": "/name/nm0453518/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWVhZDUyOWQtYmYzYi00MmI4LTk4YjctMGY2MDA3MDlmZGI2XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "south korea,guest,suicide,lodge,family relationships",
    "name": "Choyonghan kajok",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-05-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0188503/"
        },
        "name": "The Quiet Movie",
        "reviewBody": "Maybe this should become my mantra: \"The property of 'originality' is based not so much on actual properties of the art object in question as it is based on the knowledge of the person ascribing the property to the art object in question\". In other words, when we deem an artwork \"original\", it doesn't so much mean that the work _is_ original as it means that we're just not familiar with the works that have had a significant influence on it, or we do not remember the precursors (for those of us with less than perfect memories . . . what was I saying?)\n\nThe Quiet Family has already had a significant influence on films such as Jaume Balagueró's The Darkness (2002), and it has already been remade, by wacky Japanese director Takashi Miike, as The Happiness of the Katakuris (Katakuri-ke no kôfuku, 2001). I didn't realize that Happiness of the Katakuris was a remake of this film until I watched Happiness and looked it up on IMDb. I had never heard of this film before. South Korean films do not exactly get a great amount of publicity in the U.S., unfortunately.\n\nUnlike Miike's remake, which is a very good film in its own right, The Quiet Family doesn't have bizarre claymation, it's not a musical, there aren't singing and \"dancing\" zombie-corpses, and there isn't some karmic disturbance of an equivalent to Mt. Fuji. This is a much quieter and understated film, but it's still a \"black\" (morbid or macabre) comedy-drama about a horrific, bad situation that just keeps getting worse.\n\nThe story concerns Tae-gu Kang, who has bought a small hotel (unlike Happiness of the Katakuris' much simpler bed & breakfast) in a relatively remote hiking area. He moves his family--his wife, son, two daughters and his brother--to the hotel, where they wait for guests to arrive. No one shows up. When they eventually do get a guest, it's a strange, solitary, older man who ends up committing suicide with his hotel key chain. The man's wallet, which seemed to contain a substantial sum of cash, is missing. Worried that the authorities will never believe them that it was a suicide, especially given their son's troubled past, and worried that the situation will create bad publicity for their hotel, they decide to bury the body on their property. Other guests begin trickling in, but for some reason or another, they all meet less than favorable fates. Just how much bad luck will the Kangs have, and just how far will they go to surmount it? \n\nEven though this is a morbid comedy, director Ji-woon Kim employs very deliberate \"art-house drama\" pacing and tonalities. The cinematography is interesting throughout, and recurrent motifs include sustained, almost motionless shots of daughter Mi-na Kang (Ho-kyung Go), who is implied as an emotional \"center\" for the family (and indeed, she's the only one who remains relatively even-keeled throughout the bizarre occurrences). There are also many slow tracking or zoom shots of the beautifully decorated and colored hallways of the hotel (this is one of the conspicuous influences on the film Darkness, which has similar color and decoration schemes).\n\nAnother \"center\" for the Kangs is mealtime. We see them eating many times throughout the film--it's a way for them to gather their bearings, if possible, and figure out their \"plan of attack\". One nicely symbolic scene shows everyone refraining from eating at the table except for Mi-na and her sister Mi-su (Yun-seong Lee), as the family initially keeps the girls in the dark about the macabre goings-on.\n\nKim, who also wrote The Quiet Family in addition to directing, even spoofs the typical art-house drama romance, with a man who courts Mi-su a little too fervently and of course meets a twisted fate. This sets off a chain of events that lead to a very funny climax.\n\nThe crux of the film is the ever-escalating occurrences and humorous attempts to cover them up. This provides amusing subtexts about how good intentions can lead to severely immoral actions (and the guests even get in on this subtext a bit), but at the same time, we empathize with the protagonists, as the Kangs, at least, may be making bad judgments, but if they don't, they could face worse consequences. This is a quiet family that wants to remain quiet. While I prefer the bizarreness of Happiness of the Katakuris, at least slightly, The Quiet Family is still a very good film, and you just might prefer it if your tastes lean more towards art-house dramas than the surreal and over-the-top.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0188503/"
}