{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Marguerite Churchill",
            "url": "/name/nm0161451/"
        },
        {
            "@type": "Person",
            "name": "El Brendel",
            "url": "/name/nm0107151/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4045,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028775/"
        },
        {
            "@type": "Person",
            "name": "Hal G. Evarts",
            "url": "/name/nm0263346/"
        },
        {
            "@type": "Person",
            "name": "Marie Boyle",
            "url": "/name/nm0102293/"
        },
        {
            "@type": "Person",
            "name": "Jack Peabody",
            "url": "/name/nm0668685/"
        }
    ],
    "datePublished": "1930-11-01",
    "description": "Breck Coleman leads hundreds of settlers in covered wagons from the Mississippi River to their destiny out West.",
    "director": [
        {
            "@type": "Person",
            "name": "Raoul Walsh",
            "url": "/name/nm0909825/"
        },
        {
            "@type": "Person",
            "name": "Louis R. Loeffler",
            "url": "/name/nm0517264/"
        }
    ],
    "duration": "PT2H5M",
    "genre": [
        "Adventure",
        "Romance",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcxNTY3MTUyNl5BMl5BanBnXkFtZTgwMDM2ODAyMjE@._V1_.jpg",
    "keywords": "zion national park,sequoia national park,yellowstone national park,western frontier,wagon train scout",
    "name": "The Big Trail",
    "original_info": {
        "id": "The Big Trail_1930",
        "name": "The Big Trail",
        "year": "1930"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2006-06-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0020691/"
        },
        "name": "Trailblazing,.....sort of",
        "reviewBody": "John Wayne is one of the few players in film history to have failed at his first big break and then succeed on the second time around. Of course everyone knows the second time was the classic Stagecoach with John Ford directing.\n\nBut we're here to talk about The Big Trail. John Ford's fellow director Raoul Walsh spotted this tall kid on the set of one of Ford's films and thought he had potential. He wanted to make him the lead in a big budget western that Fox was planning to do. The film as planned would be an homage to the famous classic silent western The Covered Wagon.\n\nIn watching The Big Trail I was struck by how similar Wayne's character of Breck Coleman here is to the Ringo Kid in Stagecoach. Both characters were likable young cowpokes, but both were also on a mission of vengeance. And of course both films were done on location and show the expense in making them. No studio product here with a backlot western set. \n\nI also don't think that it was an accident that Wayne got this break at the beginning of the sound era. Raoul Walsh, I'm guessing looked around Hollywood and probably didn't think a whole lot of movie cowboys would have staying power in sound. That's something else Walsh spotted in Wayne.\n\nAccording to what I've read The Big Trail flopped because after spending all that money to make the film in an early wide screen process, some genius at Fox realized that their theaters weren't equipped with the wide screen to show it. And when the Great Depression hit there would be no money to widen those screens at Fox movie houses. So The Big Trail got a limited release, even in what we would call a formatted version, and lost money big for Fox films.\n\nMarguerite Churchill is fine as the crinoline heroine who Duke wins, loses and wins again from Ian Keith. Keith, Charles Stevens and F. Tyrone Power are the trio of villains Wayne has to deal with.\n\nF. Tyrone Power is the father of the famous movie legend Tyrone Power. He was a big burly man with a grand background in classic roles on screen and on stage. I wouldn't be surprised if his son who would have been 15 at the time might not have been hanging around the set.\n\nAlso look for Ward Bond though you might have trouble spotting him under a big bushy beard.\n\nWatching The Big Trail now it is interesting to speculate where John Wayne's career might have gone if The Big Trail had been a big hit.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0020691/"
}