{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Diane Lane",
            "url": "/name/nm0000178/"
        },
        {
            "@type": "Person",
            "name": "Leelee Sobieski",
            "url": "/name/nm0005447/"
        },
        {
            "@type": "Person",
            "name": "Stellan Skarsgård",
            "url": "/name/nm0001745/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 38483,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011134/"
        },
        {
            "@type": "Person",
            "name": "Wesley Strick",
            "url": "/name/nm0834338/"
        }
    ],
    "datePublished": "2001-09-14",
    "description": "An orphaned teenager is taken in by a Malibu couple but discovers they aren't the caring friends they seemed to be.",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel Sackheim",
            "url": "/name/nm0755261/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY3MzA4NzYyOF5BMl5BanBnXkFtZTYwNjk3Nzc5._V1_.jpg",
    "keywords": "reference to nintendo 64,female protagonist,glass house,reference to harold bloom,america online",
    "name": "The Glass House",
    "original_info": {
        "id": "The Glass House_2001",
        "name": "The Glass House",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dragoneyed363"
        },
        "dateCreated": "2008-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0221218/"
        },
        "name": "Leelee Sobieski kicks some Glass",
        "reviewBody": "I apologize for the pun, I could not resist myself. This film was recommended to me by a friend, and I had never heard of it, so I could not really say what I was expecting. What I received though was a smart, intense, fun, excellently executed thriller with wonderful performances that entertains from beginning to end.\n\nLeelee Sobieski brings to her character, Ruby Baker, depth and likablity without even having to apply much effort to it. Stellan Skarsgård and Diane Lane are great as the Terrence and Erin Glass, and even Trevor Morgan gives a nice performances as Ruby's younger brother, Rhett Baker. The performances are part of what is effective with this movie. Everyone delivered their lines and completed scenes with finesse, even if they weren't Oscar worthy presentations and they created the atmosphere that the director was trying to set perfectly.\n\nThe film is not boring at all and it's not mediocre as a lot of reviews suggest. It has a nice, suspenseful build up and the material, while the gist is a bit overused, is fresh in it's own way. Who says an unoriginal plot has to bad? Is that a written rule? The plot is simply marvelous in this film, if you ask me. I enjoyed so much seeing how the twist in the film starts to slowly unravel piece by piece, because I liked the characters and was interested in the story from the get go. The movie almost trips on it's own feet a couple of times, but nothing seriously major that is worth noting keeps you from enjoying the fun and satisfaction the film brings. I even was extremely fond of the setting, and for those of you who say it's an overrated pun with the Glasses living in a house mostly made of glass, there are horror classics throughout history that work off puns much cornier, and The Glass House does it very well, stop complaining.\n\nIn any matter, as I have said, The Glass House is non-stop fun and excitement from beginning to end with delightful and even memorable performances (i.e.: Leelee Sobieski, who indeed gives the finest performance of all, and probably the finest of her career in general), an intense and realistic atmosphere, relentless build up and a twist that I honestly could not see coming. I loved it and had an amazing time watching it! It was a riveting, effective, astonishing accomplishment in my book.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi663552281",
        "name": "The Glass House",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDE3MmVkZmYtZGVmNS00ZDNkLTk0NWUtNDI0YjQ1NGM4MzAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDE3MmVkZmYtZGVmNS00ZDNkLTk0NWUtNDI0YjQ1NGM4MzAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:24:19Z",
        "url": "https://www.imdb.com/video/vi663552281/"
    },
    "url": "/title/tt0221218/"
}