{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emil Jannings",
            "url": "/name/nm0417837/"
        },
        {
            "@type": "Person",
            "name": "Maly Delschaft",
            "url": "/name/nm0217848/"
        },
        {
            "@type": "Person",
            "name": "Max Hiller",
            "url": "/name/nm0384897/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14489,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "The Last Laugh",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021661/"
        },
        {
            "@type": "Person",
            "name": "Carl Mayer",
            "url": "/name/nm0562346/"
        }
    ],
    "datePublished": "1925-01-05",
    "description": "An aging doorman is forced to face the scorn of his friends, neighbors and society after being fired from his prestigious job at a luxurious hotel.",
    "director": [
        {
            "@type": "Person",
            "name": "F.W. Murnau",
            "url": "/name/nm0003638/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTBjM2M1Y2ItYTVmMi00NmY0LWIyYjEtNzVhM2UzMzNhMzVkXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "porter,hotel,uniform,forced perspective,revolving door",
    "name": "Der letzte Mann",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ben_Cheshire"
        },
        "dateCreated": "2003-12-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0015064/"
        },
        "name": "Silent Movies Have Belated Last Laugh",
        "reviewBody": "F. W Murnau works are rare things - he made very few compared to other directors of his day, and many of those he did make have been lost. The reason he made so few can perhaps be understood by watching The Last Laugh. Like Chaplin, Kubrick and Leone, the effort that went into a single picture was the same effort another director might spread across ten. Nosferatu, his famous Dracula story, is great, and i hear his Faust and Sunrise are also things to behold - but many regard \"The Last Laugh\" as his masterwork, and also one of the greatest movies of all time. Lillian Gish once said that she never approved of the talkies - she felt that silents were starting to create a whole new art form. She was right, but the proof of this can not be seen in the work of Griffith, who was her frequent collaborator, and who she probably was thinking about when she made this statement - but in the work of German director F. W Murnau.\n\nD. W Griffith is usually shunned for his stance on racial issues and praised for his abilities as an influential film artist. I believe he doesn't deserve this praise - and this movie is why. Not only was Griffith about as subtle as a migraine, but watching a Griffith silent, you get more words than images. There's a title card telling you what is about to happen in every image before it does. The images themselves are almost unnecessary - his style is more literary than cinematic. The difference between watching Griffith's Intolerance and watching F. W Murnau's The Last Laugh is like the difference between watching a silent comedy by Hal Roach and one by Charlie Chaplin. The latter of each pair (Murnau and Chaplin) were visualists and artists, using few words, constructing beauty and high emotion through seemingly simple situations (a tramp who discovers a lost child, or a hotel doorman who loses his job, which is the basis of The Last Laugh).\n\nSilent directors strove to and were praised for their ability to tell stories through images alone, as much as possible, and this is one of the reasons silent cinema reached its pinnacle in F. W Murnau's The Last Laugh - which tells the story of a proud hotel doorman (Emil Jennings), who, after many years of service, is demoted from his position to a mens' bathroom attendant. Murnau tells an incredibly sensitive and human tale, showing how much the job meant to him by having him go to work instead of going to his daughter's wedding. He shows how the position made him respected in his neighbourhood, and how he could not face the neighbourhood without his doorman's uniform. And he tells the story almost entirely through images.\n\nThere are no title cards telling us what the images are - they are allowed to speak for themselves. The few words used are worked in through letters and signs. Many silent directors cheated and used title cards to explain the images, but only in this movie did the art form of silent movies, which Lillian Gish refers to, take shape.\n\nI was amazed at the level of depth and emotional complexity that Murnau was capable of conveying without resorting to title cards (or their equivalent in talkies, the voice-over). This movie is also notable for its brilliant use of expressionism, and the first brilliant use of a tracking shot. In Murnau's The Last Laugh, silent movies metaphorically were given movement, and learned to run.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0015064/"
}