{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Clarke",
            "url": "/name/nm0164967/"
        },
        {
            "@type": "Person",
            "name": "Patricia Manning",
            "url": "/name/nm0543350/"
        },
        {
            "@type": "Person",
            "name": "Nan Peterson",
            "url": "/name/nm0677320/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1461,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0139582/"
        },
        {
            "@type": "Person",
            "name": "E.S. Seeley Jr.",
            "url": "/name/nm0781552/"
        },
        {
            "@type": "Person",
            "name": "Doane R. Hoag",
            "url": "/name/nm0387428/"
        },
        {
            "@type": "Person",
            "name": "Robert Clarke",
            "url": "/name/nm0164967/"
        }
    ],
    "datePublished": "1962-04-12",
    "description": "After exposure to radiation, an atomic research scientist finds himself changing into a murderous, lizard-like creature every time he is exposed to sunlight.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Clarke",
            "url": "/name/nm0164967/"
        },
        {
            "@type": "Person",
            "name": "Tom Boutross",
            "url": "/name/nm0100372/"
        }
    ],
    "duration": "PT1H14M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODMzMjdlZmEtMGM1My00MzBmLThjMDYtMTFhNmRlZDJmOTY4XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "psychotronic film,bar,girl singer,piano,shooting",
    "name": "The Hideous Sun Demon",
    "original_info": {
        "id": "The Hideous Sun Demon_1959",
        "name": "The Hideous Sun Demon",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2009-03-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0052888/"
        },
        "name": "It's not terrible--fun for fans of cheesy horror and all others should beware",
        "reviewBody": "My score of 3 doesn't really mean that I hated this film. In fact, I enjoy watching cheesy 1950s and 60s horror films. However, no matter how much I enjoy them, I have to be realistic and admit that their technical merits are usually horrendous. With THE HIDEOUS SUN DEMON (a rather inappropriate title, by the way), the budget was next to nothing and it really shows. The script also is not particularly inspired or original, though the film is watchable.\n\nActor Robert Clarke stars in this film he also wrote and co-directed. While his name is probably not one you've heard of before, he did a ton of TV appearances over the years--particularly in the 1960s in such shows as \"Dragnet\". He's a competent actor though given the budget, you really can't blame him for coming up with a silly film.\n\nThis is another nuclear radiation film where a scientist is exposed to the stuff. But, instead of turning really big (THE AMAZING COLOSSAL MAN) or tiny (THE AMAZING SHRINKING MAN), here the guy cannot go into sunlight or he becomes a hideous looking monster--at least until he's left the sunlight and allows himself to become normal once again. To me I kept wondering why Clarke's character was so stupid that he'd \"forget\" and suddenly realize it's becoming daytime throughout the film. People with Porphyria learn to avoid sunlight, yet this dummy keeps making the mistake of being out too long. Unfortunately, when he is out in the sun, he seems to become a bit emotionally unstable, though he's nothing like a \"sun demon\". He's more like a guy who's a bit cranky and stupid, that's all! Overall, very watchable for fans of the genre but don't expect it to be among the best. Just a typical film you'd find on a typical exceptionally tiny budget.\n\nBy the way, look at the box art that is shown on IMDb. I think the yellow artwork might just rank as the ugliest in film history.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0052888/"
}