{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Spencer Tracy",
            "url": "/name/nm0000075/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Hunter",
            "url": "/name/nm0001374/"
        },
        {
            "@type": "Person",
            "name": "Dianne Foster",
            "url": "/name/nm0287769/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3909,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Frank S. Nugent",
            "url": "/name/nm0637793/"
        },
        {
            "@type": "Person",
            "name": "Edwin O'Connor",
            "url": "/name/nm0640312/"
        }
    ],
    "description": "Frank Skeffington is an old Irish-American political boss, running for re-election as mayor of a U.S. town for the last time.",
    "director": [
        {
            "@type": "Person",
            "name": "John Ford",
            "url": "/name/nm0000406/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmFkN2RhNjAtZGZiOS00NjVjLWI1ZTctOWViMTE5NDRiYjg5XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "mayor,irish american,political machine,based on real person,based on novel",
    "name": "The Last Hurrah",
    "original_info": {
        "id": "The Last Hurrah_1958",
        "name": "The Last Hurrah",
        "year": "1958"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zetes"
        },
        "dateCreated": "2001-07-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051845/"
        },
        "name": "Paradoxical",
        "reviewBody": "Never have I seen a film which is so terrible on the one hand, yet so watchable on the other. I was bothered to no end, but I was actually touched at the film's end. This fierce split in my opinion is easy to explain, however. The script of The Last Hurrah is one of the worst ever written. That's shocking considering the man who wrote it and the man who directed it, Frank S. Nugent and John Ford respectively, created many great movies together, including The Searchers and Mister Roberts. I say that the script is awful because of two main reasons, and they are huge reasons:\n\n1) It is very unfocused. What is its point? Is it an in-depth political expose, a character study, or a melodrama? These categories are not mutually exclusive, but you wouldn't know that by watching The Last Hurrah. It goes from one of them to the next without ever mixing two. Shouldn't the role and relationship of Adam, the mayor's nephew, be more clearly defined? 2) all supporting characters, every single one of them, is a sit-com level caricature from Ditto to Junior (and especially Ditto and Junior). There are clear good guys, and clear bad guys. They might as well all be wearing black or white ten gallon hats so that we can discern who is who more quickly.\n\nReally, there is only one pro, but, to be sure, this pro makes the movie totally worth watching: Spencer Tracy. Man, is he great in this film. His character, Frank Skeffington, is really not much less of a caricature than the rest of them, but Tracy imbues him with so much life and personality that he becomes very endearing. To judge only by the script, I should not have cared what was going on at all, yet Tracy made me care, deeply, at times. Up until tonight, I always bragged in a jokey manner that, despite my having seen over 1,200 films, films from every decade, every genre, every period of America films, not to mention a plethora of foreign ones, I had never, ever seen a movie with Spencer Tracy. Maybe it wasn't so much a brag as it was an oddity. Now I can safely brag that I have seen him act, and that he was one of the greatest. I cannot afford to put him off any longer, one who so amazingly saved such a train wreck of a movie, The Last Hurrah. 7/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this epic drama based on the novel",
        "duration": "PT3M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3136226329",
        "name": "The Last Hurrah",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmVkNjIwOGYtYzI2OS00MzY1LWFiODMtMzQ4NGNiMDBkMjJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmVkNjIwOGYtYzI2OS00MzY1LWFiODMtMzQ4NGNiMDBkMjJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T16:49:35Z",
        "url": "https://www.imdb.com/video/vi3136226329/"
    },
    "url": "/title/tt0051845/"
}