{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Ingle",
            "url": "/name/nm0408834/"
        },
        {
            "@type": "Person",
            "name": "Scott McAfee",
            "url": "/name/nm0563902/"
        },
        {
            "@type": "Person",
            "name": "Candace Hutson",
            "url": "/name/nm0404532/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9395,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0202966/"
        },
        {
            "@type": "Person",
            "name": "Dev Ross",
            "url": "/name/nm0743361/"
        },
        {
            "@type": "Person",
            "name": "John Loy",
            "url": "/name/nm0523431/"
        },
        {
            "@type": "Person",
            "name": "John Ludin",
            "url": "/name/nm0524887/"
        }
    ],
    "datePublished": "1994-12-23",
    "description": "This time, while building a hideaway in their new home of the Great Valley, Littlefoot and the gang rescue a mysterious egg from two scheming egg-nappers and make a starling surprise - and new friend - when the egg hatches.",
    "director": [
        {
            "@type": "Person",
            "name": "Roy Allen Smith",
            "url": "/name/nm0809823/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIxOTE2NTUxM15BMl5BanBnXkFtZTgwOTExNTAwNzE@._V1_.jpg",
    "keywords": "water,fire,betrayal,talking animal,female villain",
    "name": "The Land Before Time II: The Great Valley Adventure",
    "original_info": {
        "id": "The Land Before Time II: The Great Valley Adventure_1994",
        "name": "The Land Before Time II: The Great Valley Adventure",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Smells_Like_Cheese"
        },
        "dateCreated": "2009-03-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110300/"
        },
        "name": "The Great Valley Adventure",
        "reviewBody": "I finally was able to watch all the Land Before Time sequels, as silly as they may be, I loved the original Land Before Time and I read a lot of these scary comments, I was still curious about them. So I was expecting nothing but trash when it came to the first sequel, granted I know that the singing doesn't really do much for the story and it's a bit stupid, but actually I thought this was a decent family movie that is very enjoyable. It's a great story for the kids, it's harmless and has great morals. The reason I think there's a lot of hate on the sequels is because of the love we all have for the first Land Before Time, but I think this is just a new way for the generation of today to enjoy the same stories we had.\n\nLittlefoot and his friends are living happily in their new home, under their families' watchful eyes. When the gang tries to get to the sheltering grass to play, but land in the quicksand surrounding it, the grownups come and rescue them, then lecture them that night. Cera then tells the others that they need to prove they are independent by running away for a while into the Mysterious Beyond, a location just outside the valley. Before they leave, they notice two egg nappers stealing an egg from Ducky's nest. They chase them into the Beyond, during which a landslide occurs. The egg rolls safely back to the nest, but the five are under the impression that it was destroyed in the landslide. Then, Ducky notices what looks like the egg, only slightly larger. The gang \"return\" this egg to the Valley, only to find out that the stolen egg and this one are not the same. They decide to hatch it, nonetheless, until the egg hatches, revealing a baby sharptooth. While the others run away, Littlefoot decides he's safe, and tries to raise the hatchling on leaves. When he hears the others calling for help, as the egg nappers Ozzy and Strut are attacking them, he runs to their aid, while \"Chomper\" follows him. Chomper's shadow frightens the villains away, after which Littlefoot exchanges introductions between Chomper and the others and they accept him. But how is the Valley going to accept a sharp tooth? You'll have to watch to find out.\n\nYeah, the plot is predictable, the singing isn't necessary, and the story may be a little Barney-like, but don't go into these sequels expecting Citizen Kane. Just have fun with them. I know I'm a sap, but I just loved Chomper and Littlefoot's relationship, it was so adorable the way Chomper just wanted to hang onto Littlefoot and was like his shadow. I felt that this story had a great moral to the kids and personally as an adult I still find it very watchable. These movies are made more so for the kids, so give these films a break, The Land Before Time 2 is a good movie.\n\n6/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1770979609",
        "name": "The Land Before Time II: The Great Valley Adventure",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjcxYTJhZjctZDQ3ZC00MWQzLWIwNjAtMjAxZDE2MjZiNTRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjcxYTJhZjctZDQ3ZC00MWQzLWIwNjAtMjAxZDE2MjZiNTRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:32:33Z",
        "url": "https://www.imdb.com/video/vi1770979609/"
    },
    "url": "/title/tt0110300/"
}