{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marguerite Chapman",
            "url": "/name/nm0152460/"
        },
        {
            "@type": "Person",
            "name": "Douglas Kennedy",
            "url": "/name/nm0448004/"
        },
        {
            "@type": "Person",
            "name": "James Griffith",
            "url": "/name/nm0341526/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2574,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0137930/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0469023/"
        },
        {
            "@type": "Person",
            "name": "Jack Lewis",
            "url": "/name/nm0507289/"
        }
    ],
    "description": "A crazed scientist invents an invisibility formula. He plans to use the formula to create an army of invisible zombies.",
    "director": [
        {
            "@type": "Person",
            "name": "Edgar G. Ulmer",
            "url": "/name/nm0880618/"
        }
    ],
    "duration": "PT58M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTAwZDFmMjctNzE3NC00YzY5LWI1ZTgtMTFmZDAyOGNlMzAyXkEyXkFqcGdeQXVyNzQzNDEyOQ@@._V1_.jpg",
    "keywords": "psychotronic film,mushroom cloud,radio broadcast,low budget sci fi movie,american film directed by czech director",
    "name": "The Amazing Transparent Man",
    "original_info": {
        "id": "The Amazing Transparent Man | Indestructible Man_1956",
        "name": "The Amazing Transparent Man / Indestructible Man",
        "year": "1956"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Cowman"
        },
        "dateCreated": "2003-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053593/"
        },
        "name": "Makes for great late-night viewing with your buddies.",
        "reviewBody": "Before viewing this 1960 drive-in hit, keep in mind that it is not really a serious attempt at science fiction. Many critics and viewers have panned this movie because they expected some sort of INVISIBLE MAN-style plot with good acting and plenty of special effects. But if it was high-quality cinema they were looking for, then why in the hell did they choose to watch a movie with a title like \"THE AMAZING TRANSPARENT MAN\"?\n\nViewers with no expectations, a good sense of humor, and an open mind will probably enjoy this bizarre little sci-fi romp. The whole mad scientist/escaped prisoner/invisible Nazi story is beyond befuddling, but it is so unbelievably far-fetched that you'll be entertained anyway.\n\nTHE AMAZING TRANSPARENT MAN does a nice job at not dawdling on boring fake science jargon (a shortcoming that most sci-fi yarns of this era suffer from) and somehow manages to dole out one outrageous scene after another during its unusually short running time. Within the course of 58 minutes, you will witness invisible fist fights, invisible robberies, atomic blasts, jailbreaks, in-your-face anti-nuclear-weaponry overtones, and a whole barrage of people stealing from and/or deceiving one another. Every single character either betrays or holds one another hostage at some point during the picture.\n\nIf you're in the mood for something that is so goofy and so off-the-wall that it defies description, then I suggest you run out the VHS cut-out bin nearest you and pick up this movie. Trust me, you'll be glad you did."
    },
    "url": "/title/tt0053593/"
}