{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Samuel West",
            "url": "/name/nm0922335/"
        },
        {
            "@type": "Person",
            "name": "Adolf Buchner",
            "url": "/name/nm2652130/"
        },
        {
            "@type": "Person",
            "name": "Jutta Rüdiger",
            "url": "/name/nm2648505/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1665,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "1998-02-08",
    "description": "An examination of how a cultured people could have allowed Adolf Hitler's rise to power.",
    "genre": [
        "Documentary",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQwMjY5MDgyNF5BMl5BanBnXkFtZTcwNTI1MDkyMQ@@._V1_.jpg",
    "keywords": "nazi ideology,fascism,fascist,reference to adolf hitler,pre world war two",
    "name": "The Nazis: A Warning from History",
    "original_info": {
        "id": "The Nazis: A Warning from History_1997",
        "name": "The Nazis: A Warning from History",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Swangirl"
        },
        "dateCreated": "2001-10-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0207907/"
        },
        "name": "A thorough, heart-ripping piece of work",
        "reviewBody": "I've seen my fair share of documentaries about World War II and Nazism. Some were good and some downright awful. But this one gets at some issues that are often addressed poorly by other investigations.\n\nOne question this six-part series attempts to answer is how did Germany fall under Hitler's spell? How was it possible? Perhaps one of the best moments is in laying the ground work for answering this complex question by detailing the circumstances and climate of the time. It certainly solved some mysteries for me concerning the hatred of Germans toward communism and Bolshevism.\n\nThe interviews themselves are hard hitting. I am amazed that some of these former Nazis agreed to be interviewed and unblinkingly told why they acted as they did. Some give excuses but many simply state it...as if daring anyone to deny them their right to feel that way. It is simply amazing and stunning to watch. And to realize that even in the light of how horrific their actions were, they still would have acted in such a manner. It defies description.\n\nThe series' creators seem to understand that in no way can they tackle all the issues of Nazism so they pick their issues with care. I especially appreciated hearing how the ethnic Germans returned to their newly expanded homeland, causing the SS to have to throw out the Poles living there. It was an aspect of the annexation I knew nothing about until now.\n\nMy only complaint was that there was so much I am sure they had to leave out. But what is included is first-rate, well done and definitely skillfully pieced together. The graphics are also top notch. I must also applaud the creators for choosing original music or period music and not the usual synthesizer overdubs one hears in most documentaries.\n\nKudos, too, to narrator Sam West, who does a top-notch job."
    },
    "url": "/title/tt0207907/"
}