{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Florence Vidor",
            "url": "/name/nm0896538/"
        },
        {
            "@type": "Person",
            "name": "Monte Blue",
            "url": "/name/nm0089524/"
        },
        {
            "@type": "Person",
            "name": "Marie Prevost",
            "url": "/name/nm0696679/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1390,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Paul Bern",
            "url": "/name/nm0075960/"
        },
        {
            "@type": "Person",
            "name": "Lothar Schmidt",
            "url": "/name/nm0773083/"
        }
    ],
    "datePublished": "1924-02-10",
    "description": "Professor Stock and his wife Mizzi are always bickering. Mizzi tries to seduce Dr. Franz Braun, the new husband of her good friend Charlotte.",
    "director": [
        {
            "@type": "Person",
            "name": "Ernst Lubitsch",
            "url": "/name/nm0523932/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmE2YzBlZDQtYjNmZC00MzYwLTg0ZjUtMmFiNTMxOTU0YWEwXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_.jpg",
    "keywords": "suspected adultery,divorce case,modern prologue,vienna austria,husband wife estrangement",
    "name": "The Marriage Circle",
    "original_info": {
        "id": "The Marriage Circle_1921",
        "name": "The Marriage Circle",
        "year": "1921"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Cineanalyst"
        },
        "dateCreated": "2018-09-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0015119/"
        },
        "name": "A Touch of Sophistication",
        "reviewBody": "I wanted to retrace some of the steps in the development of the sophisticated romantic comedy film after reviewing some Oscar Wilde adaptations, of all things, the first great one being Ernst Lubitsch's 1925 \"Lady Windermere's Fan.\" Based on another's play, \"The Marriage Circle\" seems to be where the director first formulated this new direction; from it, one may trace the evolution to modern and later comedies of sex and remarriage--not only drawing a line from here to Lubitsch's subsequent productions, but also to, say, a piece of classic Hollywood cinema such as \"The Philadelphia Story\" (1940). Even ignoring all of that, \"The Marriage Circle\" is delightfully light in tone, avoiding blunt moralizing, which somewhat obscures in seemingly superficial fluff what is some clever and subtle filmmaking--the \"Lubitsch touch\"--although his subsequent \"Lady Windermere's Fan\" is even better.\n\nThe circle of adulterous flirtation begins with a professor hiring a detective to gather evidence for a divorce from his wife, Mizzi, who, indeed, tries to woo the doctor husband of her friend, who, in turn, is admired by her husband's partner Gustav. Initially, the doctor's wife also mistakingly believes that her husband is having an affair with yet another woman. And around they go. The film is full of knowing looks and dramatic irony from characters misreading what they see. Like \"Lady Windermere's Fan,\" there are some nice-looking shots involving windows and doors. A sly smile creeps up on the professor's face after he peers out a window to see his wife getting into a cab with the doctor, and there are a few compositions of characters seen through doorways. Once derided, but now celebrated by some like me, as \"the director of doors,\" Lubitsch also includes a humorous episode where the doctor storms out of an apartment through four doors to get outside.\n\nThe cast is OK, although I mostly prefer the leads in Lubitsch's 1932 remake \"One Hour with You.\" Monte Blue plays frazzled well enough as the doctor, but I prefer him in Lubitsch's later picture, \"So This is Paris\" (1926), and compared to Maurice Chevalier in the 1932 film, he's not preferred. And while I like that Marie Prevost's curls remind me of Clara Bow, her character comes off as too vampish and pathetic next to Genevieve Tobin's joyous Mitzi in the remake. The one big exception to my preference for the 1932 cast is Adolphe Menjou, who is perfect as the impervious professor. One benefit of Mizzi's characterization in this version is that it leads to a virtuoso, some-20 seconds long take of Menjou's startled expression when she hugs him--even though that scene, dropped from the remake, is a rather dramatic red herring. And the opening scene between the two is remarkable for conveying their marriage in disarray visually without needless intertitles.\n\nCircling back, besides the emphasis on looks and the connected use of doors and windows, as well as the comedy of manners and misconceptions of infidelity, \"The Marriage Circle\" and \"Lady Windermere's Fan\" have a few more things in common. Both feature potentially adulterous couplings in a garden scene during a party, with the wife mistaking her husband for being caught in the act. Characters in both misread and reveal information from letters and other written documents, including dinner-party seating arrangements. The doctor's hat here also serves a similar function to that of the fan in the other film, and there are similar final scenes involving re-coupling and cars, which both resolve and prevent the narratives from becoming moral lessons. Where I'd fault \"The Marriage Circle,\" by comparison, though, is that it doesn't seem quite as polished. The characters aren't quite as well rounded; the doctor's wife's jealousy on four separate occasions and pushing him away twice, seems repetitive, for instance--rather too circular. That three times shots of letters are repeated bothered me, too--I mean, we already read them, so shots of characters looking at them instead of just the letters themselves would suffice.\n\nTo come full circle, \"The Marriage Circle,\" while establishing a precedent, of course, also has its antecedents, besides the earlier, more broad and grotesque comedies by Lubitsch while in Germany. Charlie Chaplin's \"A Woman of Paris\" (1923) is a frequently cited one, with the casting of Menjou in both films, in particular, being considered a nod by Lubitsch to Chaplin's display of a more deliberate form of pacing, a witty focus on particular details and a more restrained kind of cinematic acting within a more modern story--even though Chaplin's film suffers, unlike \"The Marriage Circle,\" from its overbearing melodramatics. There are also the prior sex dramedies by Cecil B. DeMille, but they lack a similar level of narrative or visual sophistication, and even their titles indicate their greater gender imbalance, while perhaps simultaneously over-selling the sensationalism of the subject matter (\"Old Wives for New,\" \"Male and Female,\" \"Don't Change Your Husband,\" \"Why Change Your Wife?\") compared to \"A Woman of Paris\" and the \"The Marriage Circle,\" which respectively suggest femininity and gender equality, as well as sex. When the doctor's wife here states their infidelities to be \"fifty-fifty,\" she's not far off. (Now, how the guy (DeMille) who went on to make Biblical epics started out with stories of marital infidelity and sexual promiscuity is a development in film history I may want to revisit later, too.) Discovering the formula that worked, Lubitsch remained rather faithful to the production of sophisticated romantic comedies, through his musicals, such as the remake \"One Hour with You,\" to his other classic films of the 1930s and 1940s.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0015119/"
}