{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        },
        {
            "@type": "Person",
            "name": "Tyne Daly",
            "url": "/name/nm0002033/"
        },
        {
            "@type": "Person",
            "name": "Harry Guardino",
            "url": "/name/nm0345340/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 46924,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102264/"
        },
        {
            "@type": "Person",
            "name": "Harry Julian Fink",
            "url": "/name/nm0277807/"
        },
        {
            "@type": "Person",
            "name": "Rita M. Fink",
            "url": "/name/nm0277849/"
        },
        {
            "@type": "Person",
            "name": "Stirling Silliphant",
            "url": "/name/nm0798103/"
        }
    ],
    "datePublished": "1976-12-22",
    "description": "Inspector \"Dirty\" Harry Callahan reluctantly teams up with rookie Inspector Kate Moore to foil a terrorist organization made up of disgruntled Vietnam veterans.",
    "director": [
        {
            "@type": "Person",
            "name": "James Fargo",
            "url": "/name/nm0267309/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjI4M2Q2ZmYtNWY4Zi00NTM3LWFiYTYtNjU2NjI5MzMzYzA3XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "policeman,dirty harry,male nudity,female nudity,20th century",
    "name": "The Enforcer",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2008-09-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074483/"
        },
        "name": "What can Dirty Harry not take on?",
        "reviewBody": "For me the sequels to \"Dirty Harry\" never came close topping the original, but I thoroughly enjoyed and think highly of them anyway... well maybe with the exception of \"The Dead Pool\". Each one seemed to add its own distinguishable touch to the typical formula. The third film (and probably the cheapest, as it looks like it) of the series 'The Enforcer' seemed to have that swinging and carefree vibe of the times, with the biting reality and stark realisations (heavily implemented in the first two) taking a backseat for forceful (if crass) humour. However the violence is still gritty, mean, explosive and openly displayed. Director James Fargo ('Forced Vengeance', 'Every Which Way But Loose', 'Caravans' and 'A Game for Vultures') has appeared in some of Eastwood's early films as assistant director, and here he paces it well-enough and let's the foundation play out more like an expansive low-key action fling filled with the constant buddy routines (as Harry is paired up with a young green-horn female detective fidgety played by Tyne Daly. Who does bring an authentic and potent side to her role) that are credibly developed, long-winded build-ups finishing off with brute force and the quick-witted response. Harry also has got a catch-phrase just 'marvellous'.\n\nEastwood laconically pulls it off with dominant ease and certain authority of truly delving into this character (as now there's more to that monomaniacal search for one's own justice), as his hands out punishment (against a bunch of terrorists who call themselves 'The People's Revolutionary') and has time to let fly what he really thinks. Copping the cynical barbs are amusing support performances by Harry Guardino, John Crawford and Bradford Dillman. The bad guys here aren't overly memorable, but the DeVeren Bookwalter bestows a steely glance and has a quietly dangerous psychotic air to him. Showing up again, but in another different character is the wonderful Albert Popwell.\n\nI never tire of the San Francisco locations (where most of the films are shot), and the camera superbly details the on-screen action and striking background features. What I like about the ending of these earlier 'Dirty Harry' films, was how they weren't afraid to end on such an powerful note involving something represented visually to express the mindset, as the camera slowly zooms out and the harrowing score cues in. On the point about the music. I would say I was a little put off by the racy and bouncy jazz score arrangement of composer Jerry Fielding (who by-the-way has done some magnificent scores for films of Sam Peckinpah, Michael Winner and Clint Eastwood) just didn't have the stinging, sombre and self-reflecting quality of Lalo Schifrin's efforts. That's not to say it was bad or felt out of place, because it didn't with the feel that this one opted for. But a darker or more subtle take could've done it wonders since Fielding has chalked up some jarringly bold pieces in other films.\n\nThe script has some political context (home-grown terrorism, political correctness and equal-gender opportunity), but always stays true to the story than trying to undermine or overdo it. While it should be predictable, it does keep one step ahead and offers a surprise or two.\n\nAn up-to-par sequel.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi241745433",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjM4ODI2NzYtMzBkOS00NTUyLTlhZmUtZmJkZjczMDY5ODg3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjM4ODI2NzYtMzBkOS00NTUyLTlhZmUtZmJkZjczMDY5ODg3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-03T11:31:11.867Z",
        "url": "https://www.imdb.com/video/vi241745433/"
    },
    "url": "/title/tt0074483/"
}