{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Janet Landgard",
            "url": "/name/nm0484716/"
        },
        {
            "@type": "Person",
            "name": "Janice Rule",
            "url": "/name/nm0750023/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12453,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "M/PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0218910/"
        },
        {
            "@type": "Person",
            "name": "Eleanor Perry",
            "url": "/name/nm0675052/"
        },
        {
            "@type": "Person",
            "name": "John Cheever",
            "url": "/name/nm0154940/"
        }
    ],
    "datePublished": "1968-08-09",
    "description": "A man spends a summer day swimming as many pools as he can all over a quiet suburban town.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Perry",
            "url": "/name/nm0675068/"
        },
        {
            "@type": "Person",
            "name": "Sydney Pollack",
            "url": "/name/nm0001628/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjJiMmM1N2MtNTczMS00ZDY5LTg0Y2YtYzQ5YmE3MjMyYjM4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "swimming,swimming pool,neighborhood,neighbor,backyard swimming pool",
    "name": "The Swimmer",
    "original_info": {
        "id": "The Swimmer_1968",
        "name": "The Swimmer",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "unreasonableboy"
        },
        "dateCreated": "2007-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063663/"
        },
        "name": "The American nightmare!",
        "reviewBody": "What can you say about the swimmer that hasn't already been said. On reflection you have to feel sorry for Ned Merrill, certainly you can't have any sympathy for any of the characters he meets on his way! If he has suffered some sort of mental breakdown the question is why? This movie was set in the civilized environment of New England, Connecticut to be precise and it highlights the cozy drinks around the swimming pool and lavish dinner party Scean that is part and parcel of American culture.\n\nIt's perplexing to me that people would put so much expenditure and effort in putting in a pool something that you can only use in New England for about 5-6 months of the year. (Although in the Bizwangers case they added a sliding roof whereby at least they could use the pool all year round!) However the real reason for a pool in New England is to have your friends around, show off your pool and drink and eat to excess. However you can't be satisfied with that, in addition you have to have a pig roast with professional caterers and bar tenders to boot with a band playing in the back ground, thats real living. Material possessions are not just something to show off but are part of what is required to achieve status, without status in the US you have achieved nothing. \n\nSo how did Ned Merrill find himself in this predicament? In a conversation with Julie Ann Hooper he recalls that while on a transatlantic ship down in steerage he saw his wife to be, up in first class, he climbed over the barriers wooed her with his charm and that was the beginning of a whirlwind romance. So Ned Merrill found the inside track to achieve high social status. Next comes the huge wedding no expense spared, the grand house and soon the family. Status is not just 6 figure salary, but the house, the cars, the family, the job, throwing wild parties and being a member of an influential committee that's doing charity work. That's not it, being seen at $10000 plate political fund raisers, being a church deacon and basically rubbing shoulders with the movers and shakers in your suburban community is a requirement. At one scene at the Graham's Betty says to her husband \"I wish we couldm travel more!\" A bemused looking Howard says\" why we have everything we want right here? That just sums up the attitude that the whole world evolves around their neighborhood. It epitomizes the culture of contentment and it's world of self importance.\n\nYet Ned Merills found to his cost that when his wife left him, or threw him out he found that everything else became very imbalanced and just like a house of cards once one falls the rest all comes down. Well you can figure out all of the sordid scenarios in sequence, many reviewers have tried but the bottom line is that your life and status can nose-dive into a downward spiral with marriage and work upheaval i.e. friends suddenly don't return calls, invitations to regular events don't turn up but worse you find that you are tapped of favors from colleagues and employment prospects start to very look bleak. \n\nFor people who live in such circles this must be their worst nightmare because you lose one you can lose it all. How do you adjust to such a dramatic change! In Ned Merrills case he became so obsessed in pursuing his American dream and totally absorbed in what he regarded as important that he fell into a state of self-propelling delusion.\n\nShallow, selfish people who put so much emphasis on status and material possessions as a sign of success find it hard to cope with such misfortunes . Why didn't Neddy just pack his bags and move to the west coast and start again? He can't, partly because of his pride and the fact that he was handed a lot probably makes it all the more harder. But the answer to the question is that he was conditioned to believe in a certain way and that without all of the above he was nothing, and he can't accept it?\n\nAll in all Ned Merill made things worse for himself, nothing to fall back on, nothing for a rainy day,no safe deposit box full of gold Krugerrands or cash. He threw everything into his lifestyle took himself too seriously and found very little sympathy from former friends, colleagues and acquaintances when the tide turned! Burt Lancaster was proud of this movie and so he should. His performance is very believable, he exuded confidence, happiness and the American spirit. Interestingly at the beginning of the movie he in no way portrayed a middle aged man on skid row which makes the ending even more disturbing when you see the state of him at the end. It could happen to the best of us, Was this what Cheever was trying to portray?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi973454873",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWJhYmU0YzUtOWY0OC00NzFkLThlZmMtMjE2NTg4NTU3YmM5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWJhYmU0YzUtOWY0OC00NzFkLThlZmMtMjE2NTg4NTU3YmM5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-08T14:16:29.530Z",
        "url": "https://www.imdb.com/video/vi973454873/"
    },
    "url": "/title/tt0063663/"
}