{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean Gabin",
            "url": "/name/nm0300064/"
        },
        {
            "@type": "Person",
            "name": "Suzy Prim",
            "url": "/name/nm0697512/"
        },
        {
            "@type": "Person",
            "name": "Louis Jouvet",
            "url": "/name/nm0431212/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3439,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "The Lower Depths",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036242/"
        },
        {
            "@type": "Person",
            "name": "Maxim Gorky",
            "url": "/name/nm0331003/"
        },
        {
            "@type": "Person",
            "name": "Yevgeni Zamyatin",
            "url": "/name/nm0759866/"
        },
        {
            "@type": "Person",
            "name": "Jacques Companéez",
            "url": "/name/nm0173952/"
        }
    ],
    "datePublished": "1937-09-10",
    "description": "A charismatic thief makes friends with a bankrupt baron who comes to live in the thief's slum. Meanwhile the thief seeks the love of a young woman, who is held emotionally captive by her slumlord family.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean Renoir",
            "url": "/name/nm0719756/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcyOTU1OTU1Nl5BMl5BanBnXkFtZTgwMjQ5NTQ5MTE@._V1_.jpg",
    "keywords": "slum,slumlord,self destructiveness,france,poverty",
    "name": "Les bas-fonds",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ilpohirvonen"
        },
        "dateCreated": "2014-12-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0027336/"
        },
        "name": "Renoir's Human Realism",
        "reviewBody": "Strictly speaking there are two alternate ways of making an adaption. One is to adapt the original text to the screen as it was written, the other is to modernize the text completely, thus giving it a new interpretation. These extremes locate to the opposite ends of the axle loyal-disloyal. Jean Renoir's \"The Lower Depths\" (1936) is far from the former, though it isn't particularly radical nor a modernization. One who is interested in the loyal fashion might wish to take a look at Kurosawa's 1957 version of the same material. The original material in question is Maxim Gorky's famous play of the same name which premiered in the early 1900's. \n\nGorky's play is often regarded as a hallmark of socialist realism, but it lacks the unambiguous moral message which we usually associate with the style. It's a play without a formal plot, paying more attention to characters and their relationships. Renoir has changed a lot and added new milieus, scenes, and minor characters. For example, Renoir gives more space for the friendship between the bankrupt baron and the thief, probably in order to highlight his view of humanity above social borders. Overall, Renoir has taken the most interesting characters of Gorky's play and chosen to focus on their drama rather than creating a film about a cave-like milieu and its relation to its various inhabitants. It is the spectator's choice whether this is for the better or worse, but Renoir's motives seem clear: he most likely wanted to give coherence to the story and thus enhance its ethical nature. \n\nDue to these choices Renoir's \"The Lower Depths\" grows into a story about a thief (Jean Gabin) who falls in love with a girl. They live in the same slum -- a typical courtyard-ish milieu for Renoir's 30's films -- with the girl's sister, the thief's former partner, who is married to the owner of the slum apartments but wants to escape her marriage. Meanwhile the thief befriends a baron who has lost his social status and is now creating a new life in the lower depths.\n\nGorky's story is really ideal to the French Poetic Realism, but the film has replaced Gorky's pessimism with warm romance and an optimistic spirit. To me, whether this makes \"The Lower Depths\" better or worse is not an interesting question. What is interesting, on the other hand, is that it makes it different. Renoir once again manages to approach themes of friendship and solidarity with an authentic yet non-sentimental perspective. The final shot, which has righteously been compared to the famous finale of Chaplin's \"Modern Times\" (1936), expresses faith and hope, but not in excess, precisely because Renoir's image is indeterminate enough. Or, as Luka puts it, \"If you believe in it, it is real.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0027336/"
}