{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Simon Jones",
            "url": "/name/nm0429254/"
        },
        {
            "@type": "Person",
            "name": "David Dixon",
            "url": "/name/nm0228797/"
        },
        {
            "@type": "Person",
            "name": "Peter Jones",
            "url": "/name/nm0429012/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11285,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "1982-10-30",
    "description": "Arthur Dent and his friend, Ford Prefect, escape the destruction of Earth, only to face incredible trials, tribulations and adventures in space and time.",
    "genre": [
        "Adventure",
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2OTMwNDU1NF5BMl5BanBnXkFtZTcwOTIyNzAzMQ@@._V1_.jpg",
    "keywords": "friend,cult favorite,unidentified flying object,humanoid alien,earthman",
    "name": "The Hitchhiker's Guide to the Galaxy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Canvoodoo"
        },
        "dateCreated": "2006-07-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081874/"
        },
        "name": "Well executed, bears up well to repeat viewing",
        "reviewBody": "Unlike the recent Movie, this mini-series is mostly good, and does an excellent job of capturing the quirky spirit of the radio original.\n\nProbably the biggest reason why this adaptation works well is that the marvelous dialogue of the radio version has not been messed up. There are changes (as there have been in every medium the guide has been adapted into), but unlike the film version, the best and most memorable parts haven't been tampered with  See the memorable quotes section for examples of this. The biggest difference between this version and the film may be that Douglas Adams was directly involved with the production of the Television version, but sadly was not around to oversee the film version, for which the loss is evident.\n\nThe special effects aren't great (think Doctor Who, circa 1980), but the performances are enough fun that it doesn't matter all that much. Many of the cast members are the originals from the radio series, and even those that aren't originals mostly do a good job with their characters. The one exception is Sandra Dickinson, who just isn't convincing as Trillian  She's supposed to a very bright astrophysicist, but comes across as a bimbo/airhead. Still, the rest of the casting is excellent, so this one lapse can be forgiven.\n\nThe best part of the whole series is the visuals for the actual Guide. These are extraordinarily detailed animations, buttressing Peter Jones' voice-over from the radio original with lots of extra visual jokes and humor. One of the best parts about being able to watch this on DVD is the ability to freeze-frame some of the more interesting bits to be able to better appreciate all of the funny stuff contained within. These visuals were actually accomplished using a painstaking manual animation technique to simulate the computer displays, as 1980-era computers just weren't up to the job of doing things like this. Ironically, the simulated computer animations are a lot funnier than the actual computer animations (with 25 years worth of improved technology) in the film version.\n\nIn sum, given the choice between this and the film version, I would take this any time. The DVD version also includes lots of extra material  production notes, making-of documentaries, and a tribute to the late Douglas Adams.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Arthur Dent and his friend Ford Prefect escape the destruction of Earth only to face incredible trials, tribulations and adventures in space and time.",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2666316313",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzA3OTNkYmMtNjY4MC00MGVhLTgwODYtYjY0MzE5NGNhNWNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzA3OTNkYmMtNjY4MC00MGVhLTgwODYtYjY0MzE5NGNhNWNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-06-08T21:27:57.219Z",
        "url": "https://www.imdb.com/video/vi2666316313/"
    },
    "url": "/title/tt0081874/"
}