{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Owen Wilson",
            "url": "/name/nm0005562/"
        },
        {
            "@type": "Person",
            "name": "Morgan Freeman",
            "url": "/name/nm0000151/"
        },
        {
            "@type": "Person",
            "name": "Gary Sinise",
            "url": "/name/nm0000641/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18492,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036807/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049929/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079257/"
        },
        {
            "@type": "Person",
            "name": "Elmore Leonard",
            "url": "/name/nm0001465/"
        },
        {
            "@type": "Person",
            "name": "Sebastian Gutierrez",
            "url": "/name/nm0349406/"
        }
    ],
    "datePublished": "2004-01-30",
    "description": "A small-time con artist and a Hawaiian real estate developer's mischevious, enterprising mistress team up for a potential $200,000 score.",
    "director": [
        {
            "@type": "Person",
            "name": "George Armitage",
            "url": "/name/nm0000786/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5NDM5ODEyM15BMl5BanBnXkFtZTYwMTcyMTY3._V1_.jpg",
    "keywords": "white panties,blonde,female nudity,consensual sex,yellow bikini",
    "name": "The Big Bounce",
    "original_info": {
        "id": "The Big Bounce_2004",
        "name": "The Big Bounce",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bbishop37"
        },
        "dateCreated": "2004-07-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0315824/"
        },
        "name": "A Shaggy Dog?",
        "reviewBody": "This is one of those movies that will slip through the cracks, but it's really not \"bad\". It's actually pretty GOOD, right up until... it doesn't have an ending. The ending seems to imply yet another twist - but it makes NO sense, and leaves more questions than it answers. The ending seems like they ran over-budget or over-time, and just stopped. The ending, it must be warned, SUCKS.\n\nMaybe they couldn't afford a real ending; but the movie is pretty good up until then. It's a fun ride to a dead-end. Morgan Freeman settles into his part like he'd been waiting for it. Gary Sinise has a stifled role, but delivers his lines beautifully. Charlie Sheen is very nearly perfect as a slightly-dim, slightly confused henchman, and playing subtly against-type. Bebe Neuwerth appears as a boozy wife and gives far more to the part than is on the page, also against type, and perfectly-acted. Vinnie Jones stands-out too... \n\nThis movie could NOT fail - but it does. When it ends, you want to kick someone - the director or producers or studio financiers - for stopping what COULD have been so great! This movie has a painfully tiny scene with Willie Nelson and Harry Dean Stanton playing dominoes... I'm only a fan and don't know him personally, but I just KNOW that Elmore Leonard himself would stop any plot just to listen-in and watch to listen to those two guys play dominoes! \n\nOwen Wilson is actually quite brilliant with the intricacies of the Elmore-dialogue that survive in the script! Don't say I'm wrong until you watch his scenes with Morgan Freeman in this movie. NOBODY was carrying anyone, and that's the truth. See the scenes with Charlie Sheen too - and there's a bouncing something there they keep between them. Someone on IMDb wrote \"Charlie Sheen looks fat and stupid and like an ass\" or something equally blind. What he DOES is play a different kind of self-effacing part, a *character* a bit of a boob - but also good and a bit \"whipped\" - do yourself a favor, and watch how NOT \"Charlie-Sheen\" he plays it - you might recognize a thing they call \"acting\".\n\nAhem, Sara Foster was the femme fatal, and the camera followed her far too much. She's gorgeous and who can blame the camera, and she gave a perfectly creditable performance; really, she was fine. Given something over a dozen better actors constantly on-hand (and the seeming final plot!) her time could have been cut a bit... but with this cast, and the first 80 minutes, this really could have been GREAT. Ignore it as the Sara Foster swimsuit video. There are some great performances hidden here. See this movie, and pretend the sequel is coming - or something. \n\nOr don't see it - because you'll just wish it ended better.\n\nAs a shaggy-dog-story, this should end with a punchline. I'll end it the way movie ends instead, with build-up and seeming logic and then just stopping.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1536098585",
        "name": "The Big Bounce",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2E2MzBkNTMtOGM1Zi00YmM1LTlkNWQtN2YyMjkyMThjMGRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2E2MzBkNTMtOGM1Zi00YmM1LTlkNWQtN2YyMjkyMThjMGRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:32:01Z",
        "url": "https://www.imdb.com/video/vi1536098585/"
    },
    "url": "/title/tt0315824/"
}