{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elijah Wood",
            "url": "/name/nm0000704/"
        },
        {
            "@type": "Person",
            "name": "Kevin Costner",
            "url": "/name/nm0000126/"
        },
        {
            "@type": "Person",
            "name": "Mare Winningham",
            "url": "/name/nm0001858/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13111,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049958/"
        },
        {
            "@type": "Person",
            "name": "Kathy McWorter",
            "url": "/name/nm0574830/"
        }
    ],
    "datePublished": "1994-11-04",
    "description": "A Vietnam veteran helps his kids battle over a tree house while recovering from his traumatic war experience.",
    "director": [
        {
            "@type": "Person",
            "name": "Jon Avnet",
            "url": "/name/nm0000816/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzdiNTFjMWYtOWUyYi00NTI3LTk5MzYtNTUzMGY3MDM3NTMxXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "cardiopulmonary resuscitation,coming of age,bullying,anti war,tragic event",
    "name": "The War",
    "original_info": {
        "id": "The War_1994",
        "name": "The War",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aussie movie fan"
        },
        "dateCreated": "2002-06-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111667/"
        },
        "name": "One of my favourites, albeit with some small flaws",
        "reviewBody": "This is my first ever movie review, so please bear with me :)\n\nI first had the pleasure of viewing this gem of a movie in 1997 and I enjoyed it immensely. I now own it on DVD and consider it in my \"top 5\" movie list. The War is set in the summer of 1970 in Mississippi. Steven Simmons (Kevin Costner) has recently returned from Vietnam and is trying to fit back into life as he once knew it. However his time in Vietnam has left its scars (both physically and emotionally), and has placed strain on his relationship with wife Lois (Mare Winningham), and his children Lydia (Lexi Randall) and Stu (Elijah Wood), who are 12 year old twins. While Steven is trying to re-build his own life, Stu and Lydia are spending the summer building a tree house with the help of their friends, while trying to avoid the Lipnicki children, who take on the \"local bullies\" role.\n\nI won't go into anymore detail concerning plot, as it may spoil parts of the movie for some. The length of The War, at just on 2 hours, is sufficient for the plot and all its happenings to unfold, but any longer may have proved to be a little drawn out.\n\nThe performances put in by all the main actors and actresses (as well as many of the minor parts) are quite good. Elijah Wood's portrayal of the angry but likeable Stu is very well done. With his angry outbursts, expressive face, and \"naturalness\" in front of the camera, Wood creates a very believable Stu. This is one of his best performances, except maybe for his portrayal of Mikey in The Ice Storm\n\nKevin Costner, in what must be one of his best (yet lesser known) roles, is very understated but brilliantly cast as Steve. The uncertainty that he expresses within own life, but also the wisdom that he imparts to his children in various parts throughout the movie, are very touching indeed. Many people are critical in their assessment of Costner's acting, but I beg to differ. This is because, a few months back, I rented (and subsequently bought) 3000 Miles to Graceland, in which Costner plays a mad, mean and sinister robber. His performance in this particular movie could not have been further from his role as Steven in The War, but again he plays the part with ease. After watching these two movies, his acting talent and the range of characters that he can effectively bring to life is obvious.\n\nMare Winningham is perfectly cast as Lois, the hard-working, determined and supportive wife and mother. She breezes through this role, one which is similar in nature to her part in Everything That Rises.\n\nLexi Randall, as Lydia, also does well, although is almost overshadowed by the performance of by her best friend Elvadine, played by the brilliant Latoya Chisholm. Elvadine's scene in the classroom (you will know what scene i mean when you see it) is one of the best parts of the movie.\n\nThis movie does has some violent scenes where children are seen punching and kicking each other, so it would probably be best seen by those 12 years and up. Director Jon Avnet creates a fantastic visual experience, very similar in feel to that of his Fried Green Tomatoes. I really love the tree in which the children built their treehouse - so old yet so stable and strong..... This is a movie that really lets you escape from reality, if only for two hours.\n\nI have viewed this movie many times, and because of this have picked up a few little flaws. Continuity is a little bit of a problem in some scenes. For example, in one scene, Stu and his friends are soaking wet from driving what looks like a home-mate billy cart into a pond. Straight after this occurs the Lipnickis appear, and as they push Stu and co. away from the billy cart, we see that Stu and co. are practically dry. But this is being picky, I must admit. The accents are a bit off in some parts too - maybe the actors were trying a little too hard.\n\nThe sound of this movie i must comment on. If you run a surround sound system with Dolby Digital, the movie will give it a work-out in parts. Two scenes in particular:\n\n1. where Stu goes to wake up his Dad. As Stu shoves his dad to rouse him, the thump of helicopter blades are heard in the background and become progressively louder and louder. The sounds stops abruptly when Steve, who is startled by Stu and presumably woken from a nightmare, grabs Stu and flings him onto the ground (as he might have done in Vietnam when defending himself against an enemy soldier). This is a surprisingly intense scene.\n\n2. At the marble quarry - I can't give anymore information than this without spoiling things.\n\nSo, if you have a surround sound setup, your subwoofer will definitely get a workout in some parts of the movie. The dialogue is presented quite clearly, and the constant buzz of cicadas and crickets really give a sense of a typically hot and humid summer in the South.\n\nAll in all I would highly recommend this movie. I have read reviews where people have said that this movie is not very interesting and is maybe a bit too \"preachy\". But I watched this movie once with a classroom full of my 17 year old mates and they were glued to the screen for the duration of the movie. The War definitely has a strong message to give about war - those wars we battle inside ourselves and also the wars that are fought by millions. This is also a sad movie, but has a very uplifting conclusion. The War may take some finding in your local video store, but it is highly recommended. 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT2M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1466892313",
        "name": "The War",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWU1YTg2YWUtNDBiMy00YzJkLTlkNTQtNTdlZDU3NzI4NGY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWU1YTg2YWUtNDBiMy00YzJkLTlkNTQtNTdlZDU3NzI4NGY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-29T03:58:14Z",
        "url": "https://www.imdb.com/video/vi1466892313/"
    },
    "url": "/title/tt0111667/"
}