{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Will Arnett",
            "url": "/name/nm0004715/"
        },
        {
            "@type": "Person",
            "name": "Michael Cera",
            "url": "/name/nm0148418/"
        },
        {
            "@type": "Person",
            "name": "Rosario Dawson",
            "url": "/name/nm0206257/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 157071,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005154/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0283444/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0602537/"
        },
        {
            "@type": "Person",
            "name": "Seth Grahame-Smith",
            "url": "/name/nm0334381/"
        },
        {
            "@type": "Person",
            "name": "Chris McKenna",
            "url": "/name/nm0571344/"
        },
        {
            "@type": "Person",
            "name": "Erik Sommers",
            "url": "/name/nm1273099/"
        }
    ],
    "datePublished": "2017-02-10",
    "description": "A cooler-than-ever Bruce Wayne must deal with the usual suspects as they plan to rule Gotham City, while discovering that he has accidentally adopted a teenage orphan who wishes to become his sidekick.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris McKay",
            "url": "/name/nm0003021/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcyNTEyOTY0M15BMl5BanBnXkFtZTgwOTAyNzU3MDI@._V1_.jpg",
    "keywords": "lego,batmobile,dc comics,based on comic book,batman character",
    "name": "The Lego Batman Movie",
    "original_info": {
        "id": "The Batman Superman Movie_1998",
        "name": "The Batman Superman Movie",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Thekeybaldemasterrises"
        },
        "dateCreated": "2017-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt4116284/"
        },
        "name": "It's not just a great kids movie, it's a great Batman movie!!!",
        "reviewBody": "This is the best theatrical film based on DC property that WB has put out in years. Sorry fans but this blew all 3 of the cinematic universe movies out of the freaking water. Just like the movie before it, the LEGO Batman movie surprises yet again with a fun piece of imaginative work. It has the humor, the action, the animation, and surprisingly again the heart. We thought to ourselves a Lego movie would never work, it sounds like the ultimate marketing sham Hollywood could ever put out to sell toys, but it became one my favorite animated films of all time why? The first movie blew me away because it not only worked as a story, but it encompassed everything a fan of Lego remembers. In a similar fashion, this movie encompassed everything you know about Batman, and I mean everything. I swear there was almost a reference to everything you remember about him, from Detective Comics all the way to Batfleck. It sounds like I'm talking about fan service because yes, it is most of the time. They use it to their advantage here, they praise and mock everything great, and everything terrible Batman has gone through over the years. You almost miss too much because they cram so many funny nod ons and jokes you wish they had spread em out a little bit. But In other words, the script is a hilarious tribute to arguably one of the greatest superheroes of all time, and surprisingly the most emotional. The focus of the film actually deals with to me a critical factor of Batman. His isolation and loneliness, his fear of becoming part of a family again. The special relationship Batman has with the Joker. It hits all the emotional beats just right with all of its themes. It utilizes it's imagination of Legos to it's potential. And it produces a fantastic message for kids, as well as a touching tribute to fans of Batman. Seriously this movie had a smile on my face except for the parts when it really hit home for me. It also makes me mad, because the film proves that WB is just sitting on a character's pile of good material to work with, and they don't know what to do with them in their real films. This movie has such a stronger emotional impact than anything the DC cinematic universe has done with its last three films. It doesn't mean DC has to sell to Disney, it doesn't mean critics are biased against DC. It just means when you get people who know the material well, they're gonna make it a great film if they know what to do with it. That's what's happening here, if WB can take notes and study why this movie really works, maybe the Justice League and Ben Affleck's Batman film will actually make a better impact? Regardless, this is the standard animated movies need to have outside of Disney, and WB really needs to bring the heart this movie has into their live action films. If you love Legos and Batman what are you waiting for?? Go now!! You don't even have to take a kid, it's a total blast for all ages, and I will definitely be seeing it again real soon.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "There are big changes brewing in Gotham, and if Batman wants to save the city from the Joker's hostile takeover, he may have to drop the lone vigilante thing, try to work with others, and maybe learn to lighten up.",
        "duration": "PT1M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi466269721",
        "name": "Extended TV Spot",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTY0NTAyMDA5NV5BMl5BanBnXkFtZTgwODM2NzM4MDI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTY0NTAyMDA5NV5BMl5BanBnXkFtZTgwODM2NzM4MDI@._V1_.jpg",
        "uploadDate": "2016-12-12T09:26:51Z",
        "url": "https://www.imdb.com/video/vi466269721/"
    },
    "url": "/title/tt4116284/"
}