{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Rowan Atkinson",
            "url": "/name/nm0000100/"
        },
        {
            "@type": "Person",
            "name": "Mina Anwar",
            "url": "/name/nm0031689/"
        },
        {
            "@type": "Person",
            "name": "James Dreyfus",
            "url": "/name/nm0237834/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7391,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103644/"
        },
        {
            "@type": "Person",
            "name": "Ben Elton",
            "url": "/name/nm0255780/"
        }
    ],
    "datePublished": "1995-11-13",
    "description": "Various mishaps at a police station in an English town. The main character is the anachronistic, yet charming and funny Inspector Fowler. CID foil to Fowler, Inspector Grim is a bumbling, seething idiot.",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDk1OTcwMzEtMzNjZi00MGEwLTkxYzctNWE5ODI3MzhmN2U0XkEyXkFqcGdeQXVyNTgyNTA4MjM@._V1_.jpg",
    "keywords": "british humour,camp,detective,relationship problems,ensemble cast",
    "name": "The Thin Blue Line",
    "original_info": {
        "id": "The Thin Blue Line: The Complete Lineup_1995",
        "name": "The Thin Blue Line: The Complete Lineup",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dave13-1"
        },
        "dateCreated": "2012-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112194/"
        },
        "name": "Fine series in a much lower key than Elton's earlier work.",
        "reviewBody": "Ben Elton, one of the creators of Blackadder, got back together with Rowan Atkinson for two seasons and twelve episodes of this unexpectedly low key situation comedy about life at a police station in a sleepy section of the U.K. Beyond arresting the occasional shoplifter or student prankster, they have next to nothing to do. This does not sit well with the action-starved CID man Grimm (whose insane tirades on the state of Great Britain are an every episode treat) but does not seem to worry anybody else. The emphasis here is, for once, not on the outrageous or the farcical, but at finding the humor in small everyday happenings.\n\nAtkinson's comedy skills are as impeccable as ever, although after playing the Machiavellian Blackadder for years, followed by apocalyptic silent cinema throwback Bean, Atkinson had to grope around a little for the first couple of episodes to get the right subtle note with his middle aged public servant Insp. Fowler. The racially and gender mixed ensemble worked right away, and this is one of the show's strengths, along with Elton's scripts. It was as if Elton and Atkinson decided to show the world that although they had spent years redefining the boundaries of TV comedy, they could do traditional forms too, so there. This is a small gem of a series and worth discovering, especially since it is so little known beside Atkinson's other series.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0112194/"
}