{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Evan Adams",
            "url": "/name/nm0010963/"
        },
        {
            "@type": "Person",
            "name": "Michelle St. John",
            "url": "/name/nm0820667/"
        },
        {
            "@type": "Person",
            "name": "Gene Tagaban",
            "url": "/name/nm1100485/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 535,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036467/"
        },
        {
            "@type": "Person",
            "name": "Sherman Alexie",
            "url": "/name/nm0018963/"
        }
    ],
    "datePublished": "2002-01-14",
    "description": "Seymour Polatkin is a successful, gay Native American poet from Spokane who confronts his past when he returns to his childhood home on the reservation to attend the funeral of a dear friend.",
    "director": [
        {
            "@type": "Person",
            "name": "Sherman Alexie",
            "url": "/name/nm0018963/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYzMjgxOTI2M15BMl5BanBnXkFtZTcwNDAzMzIyMQ@@._V1_.jpg",
    "keywords": "fruit thief,indian dance,gay interest,gay protagonist,reservation",
    "name": "The Business of Fancydancing",
    "original_info": {
        "id": "The Business of Fancydancing_2002",
        "name": "The Business of Fancydancing",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jm10701"
        },
        "dateCreated": "2013-02-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0303313/"
        },
        "name": "Overblown melodrama",
        "reviewBody": "I'm probably not in the right demographic for this movie. Although I am gay, I am not an American Indian, and this movie depends heavily on an appreciation of their culture, their history and (if this movie is at all authentic) their overwhelming love of melodrama.\n\nNot a single word in the very stilted and contrived screenplay sounded to me like an actual human being talking, but like a person reading a proclamation about something very profound. The many poetry readings, funeral speeches, etc - even ordinary conversations between lovers and friends - sound so forced and pretentious that they're nearly unbearable. That's probably because the movie was written by a poet about himself. When the same poet also directs the movie, the combination practically guarantees a mediocre result.\n\nVery, very few successful movies are written and directed by people whose subject is their own lives and whose primary interest is in poetry rather than in movie-making. In fact, I can't think of a single one.\n\nIf Sherman Alexie had allowed someone else to write and direct his story, it might have worked very well, because it's not an uninteresting story - but this movie doesn't work at all, not for me. It's too unnatural, and Native Americans ought to be MORE natural than the rest of us, not less.\n\nIf you have a soft spot for overblown melodrama, stilted dialog, declamatory acting and/or Native Americans, then The Business of Fancydancing may be just right for you. But if you're looking for a good movie, keep looking."
    },
    "url": "/title/tt0303313/"
}