{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dusty Rhodes",
            "url": "/name/nm0722416/"
        },
        {
            "@type": "Person",
            "name": "Dan Gable",
            "url": "/name/nm0300086/"
        },
        {
            "@type": "Person",
            "name": "Dallas Page",
            "url": "/name/nm0266261/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 186,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "director": [
        {
            "@type": "Person",
            "name": "Chris Mortensen",
            "url": "/name/nm0607762/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Documentary",
        "Action",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE0NTE0OTMyNV5BMl5BanBnXkFtZTcwMTc3OTAyMQ@@._V1_.jpg",
    "keywords": "wrestling",
    "name": "The Unreal Story of Professional Wrestling",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "redryan64"
        },
        "dateCreated": "2008-03-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0275759/"
        },
        "name": "AS SEEN ON TV! Is It a Sport? A Show? A Community Spectacle? A Morality Play? The Answer to all is YES!!",
        "reviewBody": "Having done some Pro Wrestling for the period of 1969-1976 in a sort of Minor League and part-time manner, it was my pleasure to have heard some of the insiders' comments about the trends and goings on in the game even down to this day. There are a lot of guys in my position. They never quite made in the Full Time Mat Circuits, but would be around for making the Video-Taped matches for the various Promotions and were often put to good use in some of the small independent shows.\n\nSome of the best matches you will see are those on the small promotions, who are mainly \"Old School\"; requiring more Wrestling and less B.S. I can honestly that all my best matches were in places like Michigan City- Indiana, Beloit-Wisconsin, Hardyville-Kentucky and Bass Lake-Indiana for Promoters like Shelby Adcock, Homer Miller and \"Tex\" Nunally. \n\nAS for our film, THE UNREAL STORY OF PROFESSIONAL WRESTLING (1999), which we originally saw on the A&E Network in 1999. We taped it and eventually got us a Store-bought tape. We deemed it to be good enough to have a copy with the fancy printed and colorful box to display it. Writer/Director/Producer, Chris Montensen, is obviously a Wrestling Buff; who has a deep affection and a fine understanding of the athletic and show biz components that make up a wrestling show.\n\nThe layout of the Historical background and the clever narration done by the \"Comedian's Comedian\", the late Mr. Steve Allen, are most appropriate to the story. (Steve did commentary on early Wrestling Telecasts dating to the very late '40's and early '50's. early. We heard him speak fondly about it on several occasions.\n\nIt's no secret that Pro Wrestling is an American phenomenon which has spread virtually all over the World. It's also widely known that there is a large Show Business component. In most states it is advertised as an exhibition and even a \"Shooting\" match would fall under this umbrella.\n\nThe appeal of the Wrestling Matches had long been one that crossed Ethnic, Racial and Socio-Economic lines as an entertainment event that has had wide appeal. At a typical Wrestling Show presented at say our now demolished International Amphitheater right here in Chicago of 30 to 60 years or so ago; you would find a great cross section of patrons and true fans alike who were professional people and blue collar alike.\n\nAnd the various categories of fans had as many reasons for loving their \"Rasslin\" as there were aficionados. Some took it all to heart; the feuds, the contrived biographies of the Wrestlers and all of the soap opera-like happenings between the matches. Others were interested in the great athleticism, hand to hand combat skills and tremendous physiques of the participants. Still others viewed the Nights of Pro Wrestling Cards as a Bovine Ballet, a sort of Morality Play, Opera for the masses and a genuine Slice of Americana.\n\nBut getting back to Mr. Chris Montensen's film and true labor of love we have some very minor criticism; and believe it is minor indeed.\n\nThere is one thing that everybody seems to overlook and perhaps they just don't figure that it doesn't rate a mention. That would be that in spite of all the showmanship and the spectacular promotions, Professional Wrestling in America has definitely produced its own style and one that makes for an outstanding method of self-defense; almost being a sort of \"Martial Art\" of its own. It is called American Catch Wrestling or \"Hooking\" and it is truly a \"No Holds Barred\" event. It combines \"Freestyle\" or \"Catch-as-Catch-Can\" with a large number of Pressure and Submission Holds which could easily destroy an opponents knee, wrist, elbow or whatever joint and bone that received the full pressure.\n\nAnd that brings up another good point that we should think about. A Pro Wrestler will continue to get better and smarter about his chosen sport for much longer than most any athletes. Much like a Gourmet Cook, who is always saving and learning new recipes, Wrestlers are always picking up new holds, counters and grappling techniques as they go.* And unlike a Boxer, whose Sweet Science requires the throwing an absorption of countless blows to the body and especially the head; the Grappling and application of the Holds are physically beneficial and are considered to be a segment of Physical Culture, much like Weight Training/Lifting and Gymnastics.\n\nTHE UNREAL STORY OF PROFESSIONAL WRESTLING is a great piece of work and a VHS or DVD that should be in any buffs library. As a recommendation of a companion piece, we suggest that you get THE WRESTLER (1974). It's long time Amateur and Professional Champion, Verne Gagne's semi-autobiographical film; which gives us some fine insight of Pro Wrestling from the view of looking out of the Ring, rather than that of looking in.\n\nNOTE: * Perhaps the best example of being a \"holds collector\" is the great Bruno Sammartino, the Italian Superman. When Bruno came to the Professional ranks around 1959 or '60, he had very little Amateur Wrestling background, if indeed any at all. The success that he had was due to his extremely powerful physique. Mr. Sammartino was one of the strongest men in the whole World then, and undoubtedly the greatest Bench Presser; having hoisted 565 lbs., far ahead of any competition. But he was smart and studied every match, both his and others. Within a few years he had become much more than another big strong guy. Within the decade he had mastered so much wrestling skill to complement his strength that he was Champion for years, longer than just about anyone-except for the previously mentioned Verne Gagne. But that's another story! \n\nPOODLE SCHNITZ!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0275759/"
}