{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert August",
            "url": "/name/nm0041875/"
        },
        {
            "@type": "Person",
            "name": "Michael Hynson",
            "url": "/name/nm0405286/"
        },
        {
            "@type": "Person",
            "name": "Lord James Blears",
            "url": "/name/nm0088060/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5918,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0075837/"
        },
        {
            "@type": "Person",
            "name": "Bruce Brown",
            "url": "/name/nm0113164/"
        }
    ],
    "datePublished": "1965-02-18",
    "description": "The crown jewel to ten years of Bruce Brown surfing documentaries. Brown follows two young surfers around the world in search of the perfect wave, and ends up finding quite a few in addition to some colorful local characters.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruce Brown",
            "url": "/name/nm0113164/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Documentary",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzODQ1Njg4M15BMl5BanBnXkFtZTgwODIyOTcwMjE@._V1_.jpg",
    "keywords": "national film registry,beach party,surfing,wave,surfer",
    "name": "The Endless Summer",
    "original_info": {
        "id": "The Endless Summer_1966",
        "name": "The Endless Summer",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TroyAir"
        },
        "dateCreated": "1999-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060371/"
        },
        "name": "A good, clean film about a good, clean sport.",
        "reviewBody": "Back before Sean Penn gave us his hilarious interpretation of a surfer as a drugged-out loser with a limited vocabulary in \"Fast Times At Ridgemont High\", the common image of a surfer was that of a clean-cut guy who surfed just like other people sailed or fished. They were normal people. This film was made during that time, when surfing was a sport and surfers were athletes. And its that charm that makes this film special.\n\nBruce Brown had made 4 feature-length films prior to making this one, but this film's incredible success made him a cult hero, a Cinderella story who came out of nowhere to give us a film that could quite possibly be the best surfing documentary ever made. His premise was simple: take 2 surfers and try to achieve what everyone dreams of: an endless Summer of sun, surf, and girls (but mostly surf).\n\nBrown's narration, with its soft California tone, really gives the film that comfortable, easy feeling, like watching an old Walt Disney film from the early 60's, which contributes to the film's charm. We know, we just know, that these two guys are going to go out on an adventure and nobody will die, nobody will get arrested, and nobody will do anything immoral (or at least _too_ immoral).\n\nFrom the west coast of Africa, to South Africa, to Australia, to islands in the Pacific, to Hawaii, we go along as two young men from California introduce the sport of surfing to people who have never seen a surfboard before. It is quite hilarious to see villagers in Ghana and Senegal try to surf a longboard in heavy surf for the first time, and Bruce's narration really tells a funny story, and all along we're relaxing to the gentle guitar sounds of The Sandals.\n\nWe also get to see some of the best surfers riding some great waves in the age before the beaches got crowded with jet skis, racing boats, and more surfers. \"Endless Summer\" is one of those films that acts like a time capsule, and is just as entertaining now as it was when it first came out.\n\nI highly recommend it for everyone. Adults, kids, surfers, non-surfers. There's something for everyone in this film. You don't need to know how to surf to enjoy this movie."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "They call it The Endless Summer, the ultimate surfing adventure, crossing the globe in search of the perfect wave. From the uncharted waters of West Africa, to the shark-filled seas of Australia, to the tropical paradise of Tahiti and beyond, two Californ",
        "duration": "PT1M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4090365465",
        "name": "The Endless Summer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI2NjE0NDcxMV5BMl5BanBnXkFtZTcwNTM5NDk3Mw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI2NjE0NDcxMV5BMl5BanBnXkFtZTcwNTM5NDk3Mw@@._V1_.jpg",
        "uploadDate": "2010-08-31T11:55:41Z",
        "url": "https://www.imdb.com/video/vi4090365465/"
    },
    "url": "/title/tt0060371/"
}