{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Billy Corgan",
            "url": "/name/nm0004842/"
        },
        {
            "@type": "Person",
            "name": "James Iha",
            "url": "/name/nm0407286/"
        },
        {
            "@type": "Person",
            "name": "D'arcy Wretzky",
            "url": "/name/nm0942155/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 549,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0152550/"
        }
    ],
    "datePublished": "2001-11-20",
    "description": "Released alongside The Smashing Pumpkins greatest hits CD \"Rotten Apples\", this video collection comes with all of the Pumpkins music videos (excluding \"The End is the Beginning is the End\"). It also comes with a live performance ...",
    "director": [
        {
            "@type": "Person",
            "name": "Samuel Bayer",
            "url": "/name/nm1207904/"
        },
        {
            "@type": "Person",
            "name": "Angela Conway",
            "url": "/name/nm1200884/"
        },
        {
            "@type": "Person",
            "name": "Billy Corgan",
            "url": "/name/nm0004842/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5NzQ2MTE0N15BMl5BanBnXkFtZTcwNzU2MjUxMQ@@._V1_.jpg",
    "keywords": "year in title,20th century,1990s,2000s,music video collection",
    "name": "The Smashing Pumpkins: 1991-2000 Greatest Hits Video Collection",
    "original_info": {
        "id": "The Maigret Collection_1991",
        "name": "The Maigret Collection",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nhlgumby"
        },
        "dateCreated": "2002-07-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0307475/"
        },
        "name": "Simply the best.",
        "reviewBody": "The Smashing Pumpkins are the best band in the whole wide world. There is nothing to compare to their song writing, mellow distortion and acoustic sounds. After I bought Rotten Apples, I thought they weren't going to make anything else Smashing Pumpkins related. Boy was I ever happy to be wrong. My friend bought this tape, and it is the best thing in the world. This has ALL of the Smashing Pumpkins videos that they released except for \"The End is the Beginning is the End\" which is off of the Batman sound track.\n\nWatching every one of the Smashing Pumpkins videos, you can see the changes in styles, in moods and in ways of thinking for everyone in the band. You can see who was replaced due to conflicts within the band, and how their music was affected by it. This is the ultimate piece of Smashing Pumpkins history, because not only can you hear how the Smashing Pumpkins sound matured, you can see how the band grew up.\n\nVideos like \"Try Try Try\" and \"1979\" will always leave me with an empty feeling in my stomach, because they make me think of things I will not... I hope I won't do. Then there are videos like \"Today\" which make you want to jump up and say \"I want to live!\" And then there are videos you watch, back when they were in their \"artsy\" stage, like \"Tonight Tonight\" and \"Thirty Three\" that make you think to yourself \"Ahhh... I love this. I'm going to go lay on the sidewalk and stare at the clouds.\" Also really cool about the movie is the commentary at the end that talk about all the videos they did. They talk about most of the videos, like the party scene from 1979, where the band just began playing their well known songs, and all the kids basically got a free Smashing Pumpkins concert.\n\nAlthough it may have cost me $25.00 bucks to buy, I'm not complaining one bit. The movie is more than worth it's weight in gold, and I was willing to pay up to $50.00 to get this terrific piece of Smashing Pumpkins paraphernalia. Go out and buy this video today. You will be happy for the rest of your life.\n\n-Scott-\n\nToday is the greatest day I've ever known.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0307475/"
}