{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Patrick McGoohan",
            "url": "/name/nm0001526/"
        },
        {
            "@type": "Person",
            "name": "Susan Hampshire",
            "url": "/name/nm0358925/"
        },
        {
            "@type": "Person",
            "name": "Laurence Naismith",
            "url": "/name/nm0619802/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2448,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098836/"
        },
        {
            "@type": "Person",
            "name": "Robert Westerby",
            "url": "/name/nm0922589/"
        },
        {
            "@type": "Person",
            "name": "Paul Gallico",
            "url": "/name/nm0302904/"
        }
    ],
    "datePublished": "1964-06-04",
    "description": "Thomasina the cat brings a family together, through her mysterious death and reappearance.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Chaffey",
            "url": "/name/nm0149548/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2E2Y2Q2OGYtZmExYi00MGM5LTg4MzItYjk5NjI0MjgwY2JlXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "cat movie,animal character name as title,thomasina the cat character,five word title,ginger tabby cat",
    "name": "The Three Lives of Thomasina",
    "original_info": {
        "id": "The Three Lives of Thomasina_1964",
        "name": "The Three Lives of Thomasina",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wes-connors"
        },
        "dateCreated": "2010-04-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057579/"
        },
        "name": "The Cat who Played God",
        "reviewBody": "In sparkling 1912 Scotland, an orange tabby named \"Thomasina\" explains how she came to live with little Karen Dotrice (as Mary), her stern veterinarian father Patrick McGoohan (as Andrew McDhui), and housekeeper Jean Anderson (as Mrs. MacKenzie). The cat amusingly states the family originally named her \"Thomas\" until they \"got to know me better.\" At this moment, you know you're going to like this animal. We also learn the cat, speaking marvelously through Elspeth March, has been murdered. This extraordinary opening perfectly introduces the cat's personality, and prepares you for its death.\n\nThe opening theme song, written by folk singer Terry Gilkyson, is purrfectly infectious.\n\nThe story intensifies when \"Thomasina\" is crushed under an avalanche of crates, while prowling a fish market. With her young friends' help, Ms. Dotrice finds the cat, and brings \"Thomasina\" to her father. You'd think Mr. McGoohan, a veterinarian, would do everything possible to save his daughter's pet, which he promises to do - but, McGoohan is saving the life of a blind man's seeing eye dog, and orders \"Thomasina\" put to sleep. Before this, we've seen him make this decision about other animals, and wonder if his decisions are being made in haste. Later, we learn he suffers from guilt regarding his wife's death.\n\nMcGoohan thinks he can simply replace \"Thomasina\" with another cat, and cannot understand why Dotrice is taking the death so hard. Dotrice's friends, Vincent Winter (as Hughie), Denis Gilmore (as Jamie), and \"Mary Poppins\" co-star Matthew Garber (as Geordie), give \"Thomasina\" a child-like funeral, which is interrupted by a woman they both admire and fear - spooky Susan Hampshire (as Lori MacGregor), the superstitious town's resident \"witch\". Ms. Hampshire takes the animal, which, we learn, is NOT dead. But, before this, it has what could be described as a \"near-death experience.\" Or, is it \"Cat Heaven?\" \n\nIt's all cleverly plotted, from Paul Gallico's original novel, with enough room to support differing interpretations.\n\nDotrice's depression worsens. She will have nothing more do with McGoohan, telling others, \"My father's dead,\" and, \"My daddy's dead. I killed him.\" Her young friends successfully plot to end McGoohan's veterinary practice. \"Thomasina\" recovers, but with amnesia; she stays with the witch, aware something is wrong with her life. When his daughter falls deathly ill, \"man of science\" McGoohan tries to reconnect with his Christian faith, lamenting, \"I've forgotten how to pray.\" He also begins to connect with Hampshire, which leads to the most unimaginative part of the story. Still, this is an excellent, underrated film.\n\n******** The Three Lives of Thomasina (12/11/63) Don Chaffey ~ Patrick McGoohan, Karen Dotrice, Susan Hampshire, Elspeth March",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The cat brings a family together, through her mysterious death and reappearance.",
        "duration": "PT2M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi568050457",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjg3YmNiYmMtMmI1YS00ZmZlLTgyYjItZDFhZGFhMjJmODMxXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjg3YmNiYmMtMmI1YS00ZmZlLTgyYjItZDFhZGFhMjJmODMxXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-12-02T21:05:36.028Z",
        "url": "https://www.imdb.com/video/vi568050457/"
    },
    "url": "/title/tt0057579/"
}