{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 568,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "alternateName": "The Terrible Eruption of Mount Pelee and Destruction of St. Pierre, Martinique",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015284/"
        }
    ],
    "description": "This picture depicts the eruption of the volcano by which over 30,000 souls were hurled into eternity. The numerous explosions which took place during the eruption are plain to be seen. Thousands upon thousands of tons of molten l...",
    "director": [
        {
            "@type": "Person",
            "name": "Georges Méliès",
            "url": "/name/nm0617588/"
        }
    ],
    "duration": "PT1M",
    "genre": [
        "Short",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjgzNTkwNzAtZjk2NC00NTlhLWFjMGMtMTY0ZjcxYWI4NzljXkEyXkFqcGdeQXVyOTUzMjk0NDE@._V1_.jpg",
    "name": "Éruption volcanique à la Martinique",
    "original_info": {
        "id": "The Widow of St. Pierre_2001",
        "name": "The Widow of St. Pierre",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2011-08-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0224450/"
        },
        "name": "A Great Start is Letdown by Weak Ending",
        "reviewBody": "Éruption volcanique à la Martinique (1902) \n\n*** (out of 4) \n\naka Eruption of Mount Pele \n\nThe title pretty much tells you everything you need to know as we see a large village by a body of water that is about to come under fire as a volcano above it is about to erupt. Okay, I loved the first fifty-or-so seconds of this film but the final couple were a real letdown. We can start off with the positive and one such thing is the incredibly beautiful set that really caught me off guard. Melies was always one to make sure his lets looked incredible and this here might be one of his very best. At the bottom of the frame we had the water, then the village, then the mountain and finally at the top is where the volcano was. The village was so incredibly beautiful and well drawn-out that you couldn't help but feel some suspense wondering how the director was going to destroy it. We get all of this terrific build-up but sadly the film ends on a very weak spot. I won't ruin what actually happens but you can't help but feel somewhat letdown. Even with that said, it's funny to see the director doing a \"disaster movie\" a full decade before the Italians made their legendary pictures."
    },
    "url": "/title/tt0224450/"
}