{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Christine Kavanagh",
            "url": "/name/nm0442542/"
        },
        {
            "@type": "Person",
            "name": "Ian McNeice",
            "url": "/name/nm0573862/"
        },
        {
            "@type": "Person",
            "name": "Zoë Wanamaker",
            "url": "/name/nm0910738/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 160,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103590/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        },
        {
            "@type": "Person",
            "name": "Kenny McBain",
            "url": "/name/nm0564226/"
        }
    ],
    "datePublished": "1993-02-14",
    "description": "The investigation of Paul Vandervent into the mysterious death of his father brings further discord among two feuding families tied together in business and marriage, living under the same roof.",
    "genre": [
        "Crime",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2U5Yzg2NjEtNjI3MS00YTk5LTg0Y2QtMDNmN2ExYzY0M2VjXkEyXkFqcGdeQXVyMTk0MjQ3Nzk@._V1_.jpg",
    "keywords": "victorian era,domestic drama,gothic,19th century,tv mini series",
    "name": "The Blackheath Poisonings",
    "original_info": {
        "id": "The Blackheath Poisonings_1992",
        "name": "The Blackheath Poisonings",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "notmicro"
        },
        "dateCreated": "2004-05-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0103826/"
        },
        "name": "Disappointing",
        "reviewBody": "Yet another example of why I gave up on PBS Masterpiece Theater years ago. I would not recommend it to anyone, except possibly rabid and desperate Anglophile fans of Victorian period mystery melodramas. On the whole, this thing is pretty dismal and lifeless, and with just a few slight changes it could become a Saturday Night Live skit titled something like \"Bad Victorian TV Playhouse\".\n\nThe plot is so shot full of holes that you could fly a fleet of space-shuttles through it. The \"evidence\" the police start out with is laughable; no one with any sense would take any action based on it, let alone take it to court. The worst part is that the trial ends up hinging on a key witness identifying the defendant as someone he had served in a shop, when as it turns out even a blind 5-year-old could not possibly have made that mistake.\n\nAnd its another promising production full of \"if-onlys\"; if only there had been a decent story to begin with, if only there had been decent direction, and better acting on the part of a few key characters. Its really too bad, because most of the actors are quite competent, but the young man is dismal. The production values are high, but the editing is poor. The problems pile up, and the minuses overwhelm the pluses in the end.\n\nInstead of wasting time on this thing, I would recommend seeking out a copy of \"The Cater Street Hangman\" (1998), available on VHS but unfortunately not on DVD.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0103826/"
}