{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Errol Flynn",
            "url": "/name/nm0001224/"
        },
        {
            "@type": "Person",
            "name": "Olivia de Havilland",
            "url": "/name/nm0000014/"
        },
        {
            "@type": "Person",
            "name": "Basil Rathbone",
            "url": "/name/nm0001651/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 52420,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Norman Reilly Raine",
            "url": "/name/nm0706993/"
        },
        {
            "@type": "Person",
            "name": "Seton I. Miller",
            "url": "/name/nm0589316/"
        },
        {
            "@type": "Person",
            "name": "Rowland Leigh",
            "url": "/name/nm0500284/"
        }
    ],
    "datePublished": "1938-05-14",
    "description": "When Prince John and the Norman Lords begin oppressing the Saxon masses in King Richard's absence in 1190s England, a Saxon lord fights back as the outlaw leader of a resistance movement.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Curtiz",
            "url": "/name/nm0002031/"
        },
        {
            "@type": "Person",
            "name": "William Keighley",
            "url": "/name/nm0445033/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Adventure",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjZjOTU3MTMtYTM5YS00YjZmLThmNmMtODcwOTM1NmRiMWM2XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "little john character,king john character,robin hood character,friar tuck character,prince john character",
    "name": "The Adventures of Robin Hood",
    "original_info": {
        "id": "The Adventures of Robin Hood_1938",
        "name": "The Adventures of Robin Hood",
        "year": "1938"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Igenlode Wordsmith"
        },
        "dateCreated": "2004-05-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0029843/"
        },
        "name": "In like Flynn - the ultimate Sherwood classic",
        "reviewBody": "This film *is* the Robin Hood of the screen: it's merry and witty, tender and bold, impudent, dashing and brightly clad... and an undoubted legend in its own lifetime! I recently had the chance to see it in the cinema for the first time, with the release of the remastered print, and wondered if it could possibly hold up to televised childhood memories. The joyous answer is that indeed it does. It's not only the breathtaking adventure I remembered; it's a fiery and surprisingly gentle romance that isn't afraid of laughs.\n\nIt's unthinkable, once you've seen it, to imagine this film with anyone other than Errol Flynn. Every subsequent interpreter has had to struggle to reclaim the part from the memory of his roguery and grace - and most modern 'Robin's have been handicapped by an insistence on authentic mediaeval murk and grime. In the 1930s, with Technicolour the latest craze, mud and homespun were the last thing a studio wanted. Flynn's Robin Hood sports the Lincoln green of legend and a forest as brightly coloured as a painted backdrop, and the rich furs and silks on show at Nottingham Castle are straight out of fairy-tale; or an illuminated manuscript.\n\nThe story itself is purest escapist magic. Greedy barons, a wicked usurper, a rightful king in exile, and a proud beauty in distress... and, of course, England's eponymous outlaw hero, robbing the rich to give to the poor with a jest on his lips in true swashbuckler style. The script sparkles. And the stunts, in those days before wire-fu or CGI, are all for real and still take the breath away. Flynn was in superb physical condition at the time - co-star Basil Rathbone, who played his proud opponent and would-be suitor to Marian's hand, Guy of Gisbourne, described him simply as 'a perfect male animal' - and misses no opportunity to show off his flamboyance.\n\nUnlike today's pretty-boy heroes, however, Flynn shows a surprising talent for acting with his face alone. The expressive reaction shots throughout his boudoir scene with Marian tell a different tale to the quickfire banter of his words, and, like Marian, despite ourselves we are drawn in. Olivia de Havilland, as Marian, is somewhat ill-served by her period costume - she is at her most beautiful in this scene, without her hair confined in her wimple - but together they duel their way through a classic tempestuous romance of the high-born lady and the outlaw, ultimately risking their lives to save each other. Marian is no anachronistic action heroine, but no-one, not even Robin, can keep her from what she thinks is right.\n\nAs Guy of Gisbourne, Basil Rathbone is also playing one of the landmark roles of his career, and gives a superb performance. His Gisbourne is no cardboard villain, but a clever, arrogant man, who matches wits and blades with Robin as a worthy rival, and whose courtship of Marian is not without grace. And his wily master, rufous Plantagenet Prince John (Claude Rains, in a small but well-cast part) is no fool either. He knows precisely what he wants and what he can get away with, wasting no time in bluster or empty threats.\n\nComedy of a broader nature is provided by the cowardly Sheriff of Nottingham, and by Bess, Marian's maid. But even Bess's farcical courtship with timid Much (she has buried more husbands than he has had kisses) is not without its tender moments, and perhaps only the Sheriff is entirely a cut-out figure of fun.\n\nFew people can whistle 'the theme from Robin Hood'. But the famous Korngold score, with its full orchestral depth and rousing fanfares, is as familiar today as it was seventy years ago, when it won its Academy Award. From the faultless casting through unforgettable pageantry and timeless romance to the final spectacular duel, when Robin and Gisbourne meet \"once too often\", this picture richly deserves its reputation as *the* Robin Hood on film - from which on present showing it is unlikely ever to be dethroned.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for the classic Errol Flynn film The Adventures of Robin Hood",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi324863001",
        "name": "The Adventures of Robin Hood",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTkzNTQ3NjE4OV5BMl5BanBnXkFtZTcwMTY0MTgyMw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTkzNTQ3NjE4OV5BMl5BanBnXkFtZTcwMTY0MTgyMw@@._V1_.jpg",
        "uploadDate": "2010-03-25T09:50:09Z",
        "url": "https://www.imdb.com/video/vi324863001/"
    },
    "url": "/title/tt0029843/"
}