{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "The Cramps",
            "url": "/name/nm3066849/"
        },
        {
            "@type": "Person",
            "name": "Bryan Gregory",
            "url": "/name/nm0339762/"
        },
        {
            "@type": "Person",
            "name": "Lux Interior",
            "url": "/name/nm0409418/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 171,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063966/"
        }
    ],
    "datePublished": "2004-02-10",
    "description": "The psychobilly rock group The Cramps perform a free concert for the patients at a state mental hospital in Napa, California.",
    "director": [
        {
            "@type": "Person",
            "name": "Joe Rees",
            "url": "/name/nm2357922/"
        }
    ],
    "duration": "PT20M",
    "genre": [
        "Documentary",
        "Short",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTgyYjE1NWQtMjQzNC00ZTRjLTlhN2MtNmNlMmFjYzk0NWViXkEyXkFqcGdeQXVyNjI5Mjg2MjM@._V1_.jpg",
    "keywords": "camp humour,tour,rockabilly,punk rock,punk music",
    "name": "The Cramps: Live at Napa State Mental Hospital",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Frequency270"
        },
        "dateCreated": "2010-03-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0758423/"
        },
        "name": "A Lesson Learned In How Not To Stage Your Concert.",
        "reviewBody": "The Cramps are a great act. Really, I promise. Unfortunately you could never tell it from this release.\n\nTo it's credit, it is truly epitomizes the spirit of punk. A roughly shot video, audience participation at all-time high and Lux Interior giving it his best, howling, snarling and doing his best to maintain control (but simultaneously indulging) an audience that simply will not give it.\n\nFirstly, it is way too short. At under 20 minutes of actual performance time, and quality of audio and video barely tolerable, 19.95 is way too much. Even Amazon's 17.99 isn't enough of an improvement. I could see maybe paying 9.99.\n\nNow the concept is hilarious, and, as far as that goes, the video lives up to expectations. Lux frequently loses control of his microphone & Bryan Gregory seems to have a couple of satellite loons who are enjoying themselves. Poison Ivy and the drummer seem to get unfairly neglected (though it looks like the bass drum was kicked in before the show even started). As said, the entire band performs with incredible aplomb in spite of the numerous interferences. If you like the Cramps style before, you'll love it now.\n\nBut ultimately the video looses out due to quality of recording and far too short run time. Maybe if they had included the Mutants performance. As it is, the video provides some excerpts from what am I assuming are other punk video releases.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0758423/"
}