{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joe Strummer",
            "url": "/name/nm0835329/"
        },
        {
            "@type": "Person",
            "name": "Terry Chimes",
            "url": "/name/nm0990452/"
        },
        {
            "@type": "Person",
            "name": "Topper Headon",
            "url": "/name/nm0372197/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 75,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065434/"
        }
    ],
    "datePublished": "2003-06-17",
    "director": [
        {
            "@type": "Person",
            "name": "Don Letts",
            "url": "/name/nm0504824/"
        },
        {
            "@type": "Person",
            "name": "Joe Strummer",
            "url": "/name/nm0835329/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWVjODYxYWYtYmZhYi00NzcxLWJiMGQtZDYyYTI2MmFmOTYxXkEyXkFqcGdeQXVyMDY4MzkyNw@@._V1_.jpg",
    "name": "The Essential Clash",
    "original_info": {
        "id": "The Clash: The Essential Clash_2003",
        "name": "The Clash: The Essential Clash",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2007-09-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0478574/"
        },
        "name": "Know Your Rights! Know your great-late 70s & 80s punk band in one neat package!",
        "reviewBody": "The Clash, needless to say, are one of the quintessential punk bands, if not THE best 'message' kind of band, if one is looking around for that sort of thing in punk. They weren't totally crude like the Pistols, nor did they have a line they walked between tough and jokey like the Ramones. They were working class who took the simple form of 60s rock n roll and turned it into hard-charging anthems, and later on experimented in doing as much as they could (London Calling, maybe their best album, showcasing everything from their punk roots to reggae/ska to songs that dared classification). This collection of videos and concert footage from their Broadway and Shea stadium show compliments the band at their most organized and highly charged- songs from their first album like Career Oportunities, Clash City Rockers, and Complete Control are \"pure\" punk songs, in form and attitude, and are hard to beat even by today's standards of what solid rock n roll should be, despite all of their descendants trying and only once in a blue-f*** moon reaching their heights.\n\nGranted, a song or two don't hold up quite as well to the main classics fans will bop and hop to all night long, specifically Bankrobber and The Call Up (albeit the former has a striking video with the Clash themselves as handkercheifed bank-robbers). But the overall tenor is that of reverence without even having one word from the band itself- at least in the track-listing- and with a kind of 'f***-off' statement from the band about selling out: \"If people keep coming and they can't sell anymore tickets, that's selling out.\" The DVD also includes the odd silent film Hell W10 shot by Joe Strummer, extra footage of a promos from White Riot, London Burning and, quite nifty, a live performance of I Fought the Law straight from Rude Boy. Though it's always best to let the albums and the live concerts speak for themselves, this mix is certainly one of the best assembled of any band- hence the title.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0478574/"
}