{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jackie Chan",
            "url": "/name/nm0000329/"
        },
        {
            "@type": "Person",
            "name": "Ho-Sung Pak",
            "url": "/name/nm0657064/"
        },
        {
            "@type": "Person",
            "name": "Lung Ti",
            "url": "/name/nm0862479/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 47153,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "The Legend of Drunken Master",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023852/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069083/"
        },
        {
            "@type": "Person",
            "name": "Edward Tang",
            "url": "/name/nm0849282/"
        },
        {
            "@type": "Person",
            "name": "Man-Ming Tong",
            "url": "/name/nm0867246/"
        },
        {
            "@type": "Person",
            "name": "Kai-Chi Yuen",
            "url": "/name/nm0950699/"
        }
    ],
    "datePublished": "2000-10-20",
    "description": "A young martial artist is caught between respecting his pacifist father's wishes or stopping a group of disrespectful foreigners from stealing precious artifacts.",
    "director": [
        {
            "@type": "Person",
            "name": "Chia-Liang Liu",
            "url": "/name/nm0514906/"
        },
        {
            "@type": "Person",
            "name": "Jackie Chan",
            "url": "/name/nm0000329/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmRiZTZiMWEtZGVlNS00YzU1LTkxZjYtODNiMDEyYTIxYjA0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "stepmother stepson relationship,protection of culture,kung fu master,slapstick comedy,asian woman",
    "name": "Jui kuen II",
    "original_info": {
        "id": "The World of Drunken Master_1979",
        "name": "The World of Drunken Master",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "diac228"
        },
        "dateCreated": "2007-02-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111512/"
        },
        "name": "With Jackie Chan behind the production and the time to perfect it, Legend of Drunken Master winds up becoming a martial arts legend itself",
        "reviewBody": "To describe Legend of Drunken Master is almost impossible. It has so much, it does so much, and it delivers in so many ways, you cannot really describe the experience. Legend of Drunken Master stands as Jackie Chan's best film, and arguably the greatest martial arts film in history. That's right Bruce Lee fanatics, it tops most/arguably all Lee films. Surely Lee had the strength and the power; but did not have the ensemble cast that Chan had, nor did Lee have any fights that can top the ones the Drunken Master engaged in throughout the 105 minutes of this kung fu madhouse.\n\nWith a decent plot, good acting, and a dash of humor to go along with the frenzied action, Legend of Drunken Master is one of those rare complete martial arts films that do more than just throw fights at you. Honestly, there has yet to be a perfect martial arts film. Whether its bad acting, a weak plot, too much focus on action, a pointless romantic story attached, or way too over-the-top substance, there hasn't been a martial arts film worthy of being up there with the best films in the modern era. Jui Kuen II (as they call it overseas) is the closest to the complete package as you can get.\n\nWe start the film off with Jackie Chan as the tough yet uncontrollable young kid by the name of Wong Fei-hung who accidentally takes a seal from British smugglers. The smugglers, also involved in overworking Chinese men in a factory resembling slave-like sweatshop of some sort, want the seal back. In the meantime, Wong's controversial fighting technique, drunken boxing, has been met by disapproval of his father, and wants him to refrain from ever using it. Drunken boxing also has a lot of competition and shun from others in the community. Chaos follows as soon as the British and their henchmen find out who has the seal, and vow to do whatever it takes to get it back and to spread fear in the community.\n\nThe plot isn't groundbreaking, but its something different than the average martial arts film. While it still contains the themes of family, honor, respect, and dignity contained in most Chinese movies of this genre, the preservation of Chinese art is a concept not used often. Nonetheless, it works, as we see the traditional values of the Chinese being threatened by the more modern mechanisms of the Europeans. There is also a major issue with honor, as Wong's father is morally against drunken boxing, and hates it when his reputation is damaged even a little. The acting involved with the tension amongst Chan and his family is at times a bit overblown, but for the most part gets the job right.\n\nJackie Chan is one of the few actors/actresses in modern cinema history that can both be taken seriously and lightly. We see Chan at his playful side, especially when he is drunk. But, take away the smile, watch him pose, and you will fear him. Seeing that look in his eye right before a major fight starts can send shivers down your spine, as you know he will not back down easy, and will use whatever technique necessary to take you out. His physical appearance isn't exactly intimidating, but his agility and amazing ability to be balanced and whip out an insane combo of punches and kicks remains to be matched by anyone else out there. The best of Chan is here in terms of acting, usage of props, and kung fu. Don't let his usage of props fool you, he can engage in a brutal victory without the use of any objects. Few Jackie Chan films prove this, but Drunken Master has its share of fights without any other objects floating around.\n\nThe fights are what Chan is best known for, and the fights are where the film excels towards jaw-dropping levels. From the first fight, involving swords and extending from underneath a train to a nearby house, to the final fight that lasts over 10 minutes without exaggeration; Drunken Master will wow you, will keep you on the edge of your seat, and will make you almost jump back in amazement. Hollywood does not have enough patience to spend four months on one fight alone, which is why we don't see fights in action films like the ones seen here. The final fight, involving a well-trained kicker and Chan at his drunkest stage is easily one of the best fights in historyit's so well choreographed, so well-timed, and so brilliantly executed, that it deserves a spot on one of modern film's greatest achievements. Raising the bar for generations to come, the last fight mixes speed, agility, humor, combos, fast movements, and unbelievable stunts. In truth, all the clashes prior do the same, but this one puts all the others to shame.\n\nBottom Line: Missing this film would be a travesty, especially if you enjoy a good martial arts film. This time its not Chan alone that makes the film; we have a good cast of characters and fighters, a decent plot, and never really drifts into an unbelievable level unlike most action movies of today. This is Chan at his absolute best; and this is famed director Chia-Liang Liu at his best. Almost a complete package in terms of quality and substance, Legend of Drunken Master is as close as you can get to martial arts perfection; and remains the greatest martial arts film of all-time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Legend of Drunken Master",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1190965273",
        "name": "Legend of Drunken Master",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjg0NTRhYmYtYzgzMi00ZjRlLTkyMGItMzZlMDg5ZDc4OWJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjg0NTRhYmYtYzgzMi00ZjRlLTkyMGItMzZlMDg5ZDc4OWJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-05-17T04:36:33Z",
        "url": "https://www.imdb.com/video/vi1190965273/"
    },
    "url": "/title/tt0111512/"
}