{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Preston",
            "url": "/name/nm0696481/"
        },
        {
            "@type": "Person",
            "name": "Shirley Jones",
            "url": "/name/nm0429250/"
        },
        {
            "@type": "Person",
            "name": "Buddy Hackett",
            "url": "/name/nm0004983/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18148,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Meredith Willson",
            "url": "/name/nm0932745/"
        },
        {
            "@type": "Person",
            "name": "Franklin Lacey",
            "url": "/name/nm0479923/"
        },
        {
            "@type": "Person",
            "name": "Marion Hargrove",
            "url": "/name/nm0362992/"
        }
    ],
    "datePublished": "1962-06-19",
    "description": "Traveling con artist Harold Hill targets the naïve residents of a small town in 1910s Iowa by posing as a boys' band leader to raise money before he can skip town.",
    "director": [
        {
            "@type": "Person",
            "name": "Morton DaCosta",
            "url": "/name/nm0196536/"
        }
    ],
    "duration": "PT2H31M",
    "genre": [
        "Comedy",
        "Family",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU4YWE5NzMtZmFlYS00MjQwLTk0YzctZjJhMGZmZGYwNTA3XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "brother sister relationship,spinster,reference to gary indiana,reference to the scarlet letter,librarian",
    "name": "The Music Man",
    "original_info": {
        "id": "The Music Man_1962",
        "name": "The Music Man",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "clive-38"
        },
        "dateCreated": "2000-12-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056262/"
        },
        "name": "Robert Preston brilliantly recreates his Broadway role.",
        "reviewBody": "One of the greatest musicals ever put onto film is how I would describe \"The Music Man\" with its show stopping numbers like \"Ya Got Trouble Right Here in River City\", \"The Sadder But Wiser Girl For Me\", \"Wells Fargo Wagon\", \"Seventy Six Trombones\" and many more.\n\nConfidence trickster Harold Hill arrives in River City with the intention of setting up a boy's band and taking money for costumes and instruments but intends to leave town with the money before these arrive. Things don't exactly work out to plan when he finds himself falling for the town's librarian and he becomes involved with the lives of many of the River City citizens. Meanwhile, the mayor tries his best to have Hill run out of town but one by one the River City townspeople begin to realise that Hill has actually brought much happiness and contentment to several of them since his arrival. Marian the librarian gradually succumbs to Hill's charms and defends him against the wild accusations of the mayor.\n\nA high class ensemble of players make this a captivating film - in addition to Robert Preston himself (absolutely brilliant as Professor Harold Hill) we have Shirley Jones as Marian Paroo (the librarian), Buddy Hackett as Hill's friend Marcellus Washburn, Harry Hickox as another salesman determined to expose Hill, Paul Ford as Mayor Shinn and Hermione Gingold as Mrs Eulalie Shinn. Paul Ford's excellent portrayal of Mayor Shinn was not that far removed from his role as Colonel Hall in the long running \"Sergeant Bilko\" TV series. (I half expected to see Phil Silvers turn up in River City with some new gambling scheme on his mind!). Also in the \"Music Man\" cast was a very young Ron Howard (aged only eight) as Winthrop Paroo who was outstanding in his featured number \"Gary, Indiana\" which he had to sing with a lisp!! (He is of course now well established as a competent film director). I was surprised to see the talented actor Max Showalter (also known as Casey Adams) only used in one scene at the opening of the film. An actor of his calibre should have had a much larger part I consider. I was delighted to see Percy Helton (albeit briefly), one of my favourite character actors, pop up as the train conductor at the beginning of the film. Percy Helton has appeared in hundreds of films and is instantly recognisable with his distinctive voice and chubby frame. A word of praise is due to \"The Buffalo Bills\" who provide many delightful musical interludes throughout the film. \"The Music Man\" was produced and directed by Morton da Costa and I loved his theatrical device when the screen went dark after some of the musical numbers - a fascinating innovation.\n\nSome favourite lines from the film:-\n\nHarry Hickox: \"But he doesn't know the territory!\".\n\nRobert Preston: \"Gentlemen, you intrigue me - I think I'll have to give Iowa a try!\".\n\nPaul Ford: \"I said all along - get his credentials didn't I?\".\n\nPaul Ford: \"Where's the band? Where's the band?\".\n\nPreston (to the boy's band): \"Now think, men, think!\".\n\nIn 1958 Robert Preston won the prestigious \"Tony\" Award as Best Actor in a musical (on Broadway) for \"The Music Man\" but was overlooked by the Academy of Motion Picture Arts and Sciences when it came to the \"Oscars\". Why Preston wasn't even nominated as \"Best Actor\" is a mystery to me as this was the perfect role for him having performed it so long on Broadway. He was ideally suited in the part of Harold Hill and played it to perfection. The film was nominated for six Academy Awards (including one for best picture but was beaten by \"Lawrence of Arabia\").\n\nA fabulous musical with entertaining storyline, noteworthy acting talent, and impeccably photographed in ravishing colour. \"The Music Man\" is an exceptional musical which can be viewed again and again with increasing enjoyment. 10/10. Clive Roberts.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1039597849",
        "name": "The Music Man",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmMxNzBlM2YtNmQ3YS00YWQ1LTk0YjMtMjQ4YmUwMGFkOTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmMxNzBlM2YtNmQ3YS00YWQ1LTk0YjMtMjQ4YmUwMGFkOTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:58:19Z",
        "url": "https://www.imdb.com/video/vi1039597849/"
    },
    "url": "/title/tt0056262/"
}