{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dominique Michel",
            "url": "/name/nm0584819/"
        },
        {
            "@type": "Person",
            "name": "Dorothée Berryman",
            "url": "/name/nm0077715/"
        },
        {
            "@type": "Person",
            "name": "Louise Portal",
            "url": "/name/nm0691925/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8478,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "The Decline of the American Empire",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002163/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006414/"
        },
        {
            "@type": "Person",
            "name": "Denys Arcand",
            "url": "/name/nm0000780/"
        },
        {
            "@type": "Person",
            "name": "Gabriel Arcand",
            "url": "/name/nm0033501/"
        },
        {
            "@type": "Person",
            "name": "Mark Blandford",
            "url": "/name/nm0087399/"
        }
    ],
    "datePublished": "1986-11-14",
    "description": "Sexual revelations emerge when a group of academics and their partners spend a weekend at a country retreat.",
    "director": [
        {
            "@type": "Person",
            "name": "Denys Arcand",
            "url": "/name/nm0000780/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTg2Y2UyZDAtNGQwMi00MzIxLWE5NmQtYTEyMDY0NjNiYWM5XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "sex comedy,homosexual,male frontal nudity,male full frontal nudity,pubic hair",
    "name": "Le déclin de l'empire américain",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bandw"
        },
        "dateCreated": "2006-07-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090985/"
        },
        "name": "A serious comedy",
        "reviewBody": "If you do not like dialog driven movies, then you will not like this, since it consists primarily of talk about sex with some general philosophizing added. With \"The Decline of the American Empire\" I don't know if director Arcand has served up a sweet dessert with a core of bitter almonds or a drink of Angostura bitters sweetened with a sugar cube. I lean toward the latter. \n\nI liked the leisurely pace of the opening credits which play over a long tracking shot moving down a long concourse terminating in our meeting two of the main characters - Dominique and Diane. Diane, a journalist for \"Writers Today,\" is interviewing Dominique about her new book, \"Changing Concepts of Happiness.\" Right up front we are introduced to the main thesis which is that a society is in decline when it becomes more concerned with individual happiness and instant gratification rather than with the general good. In such a society people resist sacrifice and marriages break down as people pursue personal happiness. What happens in the rest of the movie illustrates the point.\n\nIn short order we are introduced to two more women, Louise and Danielle, who are working out in a gym. They are joined by Diane and Dominique and, during their workouts, the women discuss in intimate detail some of their past sexual exploits.\n\nThen we are introduced to four men (Remy, Pierre, Alain, Claude) who are preparing an elegant dinner for the four women we have already met. Remy, Pierre, Claude are faculty in the history department of a Quebec university and Alain is a student. Dominique is the chairman of the department, Diane is a teaching assistant there, Louise is the wife of Remy and Danielle is Pierre's partner and an undergraduate, so it's a pretty close-knit bunch of intellectuals. As the men prepare the meal they talk endlessly about their sexual exploits as well, but, as can be imagined, the tone of their conversation is a bit different from the women's. We are clearly well into the post sexual revolution era as much adultery is confessed and sexual fantasies revealed, and Claude's homosexuality is totally accepted. It is an ironic twist that the men are preparing dinner and the women are in the gym, *but* the women are in the gym so that they can be more sexually attractive to men.\n\nI asked myself why I found the men's banter more entertaining than what I have overheard many times in men's locker rooms, and the answer is that it is witty and literate rather than crude and unimaginative. Perhaps more importantly all the actors seem to be having such fun and deliver their lines with such enthusiasm that it rubs off. Also, while \"The Decline of the American Empire\" is no \"Big Night,\" the dinner preparations and ultimate product are not without interest. Unless you are a gourmet cook, you will learn, as I did, about \"vesiga,\" \"velouté,\" \"coulibiac,\" and \"mousseline.\"\n\nAnd there are some special treats like when the four men act out a little dance about how they have to engage in that activity to please their women. While dancing they give voice to topics that they pretend interest in, for the same purpose. Their dance is clever, tightly choreographed, and hilarious.\n\nThe musical score is suitably highbrow, with a little help from Handel and Francois Dompierre.\n\nSo, why do I think that \"The Decline of the American Empire\" is ultimately depressing? Because it illustrates too well the destructive effects of the selfish pursuit of personal happiness, particularly with regard to sexual gratification. None of the relationships here is stable. And the philosophizing at the end espouses a cynical pessimism that intellectuals seem particularly good at. There is discussion to the effect that people should speak about what they know, and that's it. For example, \"the Pope knows all about masturbation and prostate ailments. He can talk about that - and the CIA. Don't underestimate the Pope.\" The group goes on to skewer Marx, Freud, Jung, sociologists, psychologists, and even themselves. They quote Wittgenstein to justify some of their behavior: \"Our only certainty is to act with our bodies.\" Academics, you gotta love 'em.\n\nIf you go on to see the sequel, \"The Barbarian Invasions\" (same actors, same characters, seventeen years later) you will see that Remy's life is a metaphor for the more general thesis expounded in \"The Decline of the American Empire.\" Each movie stands alone, but each benefits from having seen the other.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3219504409",
        "name": "Bande-Annonce [VO]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGI1MjQ4NjYtOTU3OC00ZDNkLThjNmMtYjVhYzk0OGYzM2E0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGI1MjQ4NjYtOTU3OC00ZDNkLThjNmMtYjVhYzk0OGYzM2E0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-03T11:54:55.057Z",
        "url": "https://www.imdb.com/video/vi3219504409/"
    },
    "url": "/title/tt0090985/"
}