{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Niamh Cusack",
            "url": "/name/nm0193657/"
        },
        {
            "@type": "Person",
            "name": "Rory Carty",
            "url": "/name/nm1569658/"
        },
        {
            "@type": "Person",
            "name": "Andrew Clitheroe",
            "url": "/name/nm1569889/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 71,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0569585/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103341/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Person",
            "name": "Beatrix Potter",
            "url": "/name/nm0693229/"
        },
        {
            "@type": "Person",
            "name": "Dianne Jackson",
            "url": "/name/nm0413452/"
        }
    ],
    "datePublished": "1992-10-23",
    "description": "The mischievous adventure of Peter Rabbit and his cousin, Benjamin Bunny in Mr. McGregor's garden come to life in this animated film.",
    "director": [
        {
            "@type": "Person",
            "name": "Dennis Abey",
            "url": "/name/nm0008688/"
        },
        {
            "@type": "Person",
            "name": "Geoff Dunbar",
            "url": "/name/nm0241837/"
        },
        {
            "@type": "Person",
            "name": "Dianne Jackson",
            "url": "/name/nm0413452/"
        }
    ],
    "duration": "PT26M",
    "genre": [
        "Animation",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTdhOGU0YzItMDIxOC00ZDczLTk5OGYtYjMwMDMyNDAxOWFhXkEyXkFqcGdeQXVyMjMyOTkyMDY@._V1_.jpg",
    "keywords": "half dressed cartoon animal,whipping a child",
    "name": "The Tale of Peter Rabbit and Benjamin Bunny",
    "original_info": {
        "id": "The Peter Rabbit Collection: The Tale of Peter Rabbit and Benjamin Bunny | The Tale of Mr. Tod_2001",
        "name": "The Peter Rabbit Collection: The Tale of Peter Rabbit and Benjamin Bunny / The Tale of Mr. Tod",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2016-07-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0750583/"
        },
        "name": "Always has been my personal favourite of 'The World of Peter Rabbit and Friends'",
        "reviewBody": "'The World of Peter Rabbit and Friends' always was one of my favourites as a child and still is, one of those rare shows with not a bad episode.\n\nAlthough only nine of Beatrix Potter's timeless stories were adapted for the show, a shame that not all of them were, 'The World of Peter Rabbit and Friends' are wonderful and very faithful adaptations of Potter's stories (plus the animation is just like Potter's drawings, Potter was just as outstanding an artist as she was a storyteller).\n\nIt is tough to pick a favourite usually, and while this reviewer loves all the episodes \"The Tale of Peter Rabbit and Benjamin Bunny\" as well as my introduction to the show has always been my personal favourite (Peter Rabbit is also my favourite of her stories too). \"The Tailor of Gloucester\" is not far behind.\n\n\"The Tale of Peter Rabbit and Benjamin Bunny\" looks exquisite visually. Not just the animation, which are as said like Potter's illustrations come to life, being colourful, quaintly charming and carefully drawn, but also the charming and exquisitely book-end live action scenes complete with splendid period detail and just as breathtaking scenery. The music is one of the episode's most memorable assets, especially the opening scene, the main theme, the music where Peter, Benjamin and Benjamin's father are walking home after being rescued and reprimanded and particularly \"Perfect Day\" which lives up to its name and is beautifully sung by Miriam Stockley.\n\nDialogue is beautifully written and again sticks very closely to the writing of the stories, almost word for word actually. The story never rushes or drags, remarkable for an episode with two stories in one, and is beautifully told. One is also really immersed in the world of Beatrix Potter as well, a world that is just wondrous. All the characters are unforgettable, and are nimbly voiced, June Whitfield being the biggest name. Niamh Cusack is perfectly cast also as Beatrix Potter herself.\n\nOverall, just wonderful and Beatrix Potter would be proud if she saw this episode and the show in its entirety. 10/10 Bethany Cox",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "timeRequired": "PT26M",
    "url": "/title/tt0750583/"
}