{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        },
        {
            "@type": "Person",
            "name": "Yul Brynner",
            "url": "/name/nm0000989/"
        },
        {
            "@type": "Person",
            "name": "Anne Baxter",
            "url": "/name/nm0000879/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 72627,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0578555/"
        },
        {
            "@type": "Person",
            "name": "Dorothy Clarke Wilson",
            "url": "/name/nm0933335/"
        },
        {
            "@type": "Person",
            "name": "J.H. Ingraham",
            "url": "/name/nm0408933/"
        },
        {
            "@type": "Person",
            "name": "A.E. Southon",
            "url": "/name/nm0816161/"
        }
    ],
    "datePublished": "1956-10-05",
    "description": "Moses, raised as a prince of Egypt in the Pharaoh's household, learns of his true heritage as a Hebrew and his divine mission as the deliverer of his people from slavery.",
    "director": [
        {
            "@type": "Person",
            "name": "Cecil B. DeMille",
            "url": "/name/nm0001124/"
        }
    ],
    "duration": "PT3H40M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODcxYjUxZDgtYTQ5Zi00YmQ1LWJmZmItODZkOTYyNDhiNWM3XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "bare chested male bondage,male whipping,chest whipping,camel,tough guy",
    "name": "The Ten Commandments",
    "original_info": {
        "id": "The Ten Commandments_1956",
        "name": "The Ten Commandments",
        "year": "1956"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Scaramouche2004"
        },
        "dateCreated": "2004-09-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0049833/"
        },
        "name": "Behold HIS mighty hand..DeMille's I mean.",
        "reviewBody": "What a fantastic movie to climax DeMille's illustrious career.\n\nCharlton Heston, king of the biblical epics, shines brightly as Moses, the one time Egyptian Prince, who now carries staff and perm in order to work Gods will and free his enslaved people from bondage.\n\nYul Brynner, in what I believe to be his finest turn before the camera plays Rameses the Pharoah who's hateful relationship with Moses spans the entire epic. He is charismatic and shows off the arrogance of a stubborn Pharoah to perfection. This is indeed a film stealing performance.\n\nThe beautiful Anne Baxter is at her sultry best as Nefretiri, the woman who would be queen to Rameses, but a slave in love to Moses. However the character is complex and I certainly had trouble in deciding who's side she was on in this epic battle of good verses evil. In the beginning she claims not to care for Moses' discovered background and is willing to be with him no matter what, however as the film progresses she does nothing but ridicule him and belittle him in true anti-semitic fashion.\n\nEdward G. Robinson, Vincent Price, John Derek, Sir Cedric Hardwicke, Yvonne De Carlo, Nina Foch, John Carradine, and Debra Paget all lend fine and memorable support, to an already colourful and breathtaking experience.\n\nIncidentally it is worth mentioning that so convincing was Martha Scott in her role as Moses' mother Yochabel, that she was given the chance to play Charlton Heston's mother again in the later epic Ben-Hur.\n\nAnother interesting fact is, it was Charlton Heston's own voice who spoke the words of God. It was Heston's own idea that to hear God would be to feel God from within, which is why he thought it would be interesting to hear His voice as his own.\n\nA remake of DeMille's earlier screen adaptation of the fine book of Exodus, many can see why this film ranks as his ultimate achievement. The sets were lavish and the story handled with suitable reverence and dignity.\n\nPeople today often make the mistake of comparing older films like this to the modern epics of today with regards to their effects and they quite wrongly categorize them as inferior. Today anyone can create CGI images on their PC. Even my three year old daughter can make something look convincing with a mouse and a keyboard and although these effects are great, people have to remember that CGI was not available in 1956.\n\nOkay there are a few obvious matte backdrops used here, but to achieve the effects they did nearly fifty years ago was an outstanding and impressive feat which took talent and knowledge. I tend to look upon these effects as superior because it took the use of mans own brain to bring them about. The human brain is the best computer available, yet one seldom used in todays world. So please take this on board before you slam The Ten Commandments for it's \"cheap and nasty\" look as one reviewer called it.\n\nThis movie is ALMOST faultless, even the length is forgivable as I was so engrossed, I hardly notice the time passing.\n\nOne fact that did rouse my curiosity was Moses' appearance throughout the film. I know he went to speak to God at the burning bush, but did he really have to stop off at the salon on the way back? Or did God appear to Moses complete with curling tongs and hair dryer? \"Just a little off the top Oh Lord.\" \n\nAnd why did Moses seem to age more than everyone else? It seemed like he went from a youthful dark to everyones favourite Santa in the space of a week.\n\nThis aside, this film is a fantastic piece of cinema and must rate as a personal favourite of all fans of Biblical epics."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "4K Ultra HD + Blu-Ray + Digital",
        "duration": "PT1M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi511950873",
        "name": "The Ten Commandments",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGIzZGYxZmQtZDc0My00MTkxLWFmNDMtMDlmYjM4YWYyZjEyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGIzZGYxZmQtZDc0My00MTkxLWFmNDMtMDlmYjM4YWYyZjEyXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-03-31T17:02:36.185Z",
        "url": "https://www.imdb.com/video/vi511950873/"
    },
    "url": "/title/tt0049833/"
}