{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wes Bentley",
            "url": "/name/nm0004747/"
        },
        {
            "@type": "Person",
            "name": "Peter Mullan",
            "url": "/name/nm0611932/"
        },
        {
            "@type": "Person",
            "name": "Ron Anderson",
            "url": "/name/nm0027385/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6473,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058221/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054762/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103757/"
        },
        {
            "@type": "Person",
            "name": "Frank Cottrell Boyce",
            "url": "/name/nm0101639/"
        },
        {
            "@type": "Person",
            "name": "Thomas Hardy",
            "url": "/name/nm0362762/"
        }
    ],
    "datePublished": "2001-07-27",
    "description": "A prospector who sold his wife and infant daughter in exchange for a mining claim, tries desperately to win them back as he helps to build the Pacific Railroad with a group of pioneer friends.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Winterbottom",
            "url": "/name/nm0935863/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Drama",
        "Romance",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmVjMzVhNWQtZDkyYS00N2YzLTk3M2QtMTY2ZDgxZDRjOTAxXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "family abandonment,buying a child,selling a baby,buying a wife,sierra nevada mountains",
    "name": "The Claim",
    "original_info": {
        "id": "The Claim_2000",
        "name": "The Claim",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0218378/"
        },
        "name": "Beautiful but lacks a real grit and emotional core",
        "reviewBody": "Daniel Dillon owns much of the town of Kingdom Come, an area he obtained in exchange for a woman and a baby that travelled with him as a young man. Now he has the chance to become richer when Mr Dalglish arrives in town from the railroad company to scope the area for a possible railway route. At the same time, the woman he traded in exchange for the claim to the land all those years ago, Elena, returns with her daughter Hope to ask for money from Dillon.\n\nDirector Winterbottom is almost enough to draw me to watch a film, while the great potential in the cast brought me the rest of the way. The film is rather slow and deliberate but this is not a problem as it suits the atmosphere of the town and the film. However the various threads are perhaps too restrained and insular for the film's own good. It is clear that Winterbottom is mirroring the coldness of his surroundings in the hearts of his characters, but it makes it difficult to be involved in the emotions of the story. Also the fact that everything is quite polite and restrained doesn't quite fit with what I expect from a small frontier town based around mining and prostitution.\n\nLikewise the characters were too mellow for the majority of the film - certainly Dillon does not seem like a man who has that in his past, he isn't anywhere near as complex as he should have been. This is not enough to ruin the film though; it still is interesting and reasonably involving as a collection of threads around the town. If only it had had more in the way of heart it would have been a much better film.\n\nThe cast are pretty good even though they are restricted by the material. Mullan is always worth watching and he does a reasonable job here. Jovovich is a very risky proposition sometimes but she stands out here mainly because her character allows her to show more of an emotional range. Kinski is wasted in a role that is key to the thrust of the film but is badly used and badly developed. Polley and Bentley are both very able actors but neither manage to convince; they are OK but their characters are not allowed to go where they needed to.\n\nThe story is interesting and, after seeing this, I will now try and read the original material it came from as I can see the potential that was quite missed by this version of it. The emotions of the story and the characters are not allowed to develop and it really robs the film of much of it's power. It looks great and feels very worthy but it is hard not to feel like something is missing. Well worth a look but it requires patience to enjoy."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Claim",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2296774937",
        "name": "The Claim",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWY5MWNkYmUtZjk2NC00M2MwLWFhYTctMjFiMzQ3MzgxYmRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWY5MWNkYmUtZjk2NC00M2MwLWFhYTctMjFiMzQ3MzgxYmRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-05-30T04:51:09Z",
        "url": "https://www.imdb.com/video/vi2296774937/"
    },
    "url": "/title/tt0218378/"
}