{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Humphrey Bogart",
            "url": "/name/nm0000007/"
        },
        {
            "@type": "Person",
            "name": "Lauren Bacall",
            "url": "/name/nm0000002/"
        },
        {
            "@type": "Person",
            "name": "John Ridgely",
            "url": "/name/nm0725891/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 87508,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "William Faulkner",
            "url": "/name/nm0001203/"
        },
        {
            "@type": "Person",
            "name": "Leigh Brackett",
            "url": "/name/nm0102824/"
        },
        {
            "@type": "Person",
            "name": "Jules Furthman",
            "url": "/name/nm0299154/"
        }
    ],
    "datePublished": "1946-08-31",
    "description": "Private detective Philip Marlowe is hired by a wealthy family. Before the complex case is over, he's seen murder, blackmail and what might be love.",
    "director": [
        {
            "@type": "Person",
            "name": "Howard Hawks",
            "url": "/name/nm0001328/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Crime",
        "Film-Noir",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjdiM2IyZmQtODJiYy00NDNkLTllYmItMmFjMDNiYTQyOGVkXkEyXkFqcGdeQXVyNDY2MTk1ODk@._V1_.jpg",
    "keywords": "private eye,philip marlowe character,reference to peter pan,murder,blackmail",
    "name": "The Big Sleep",
    "original_info": {
        "id": "The Big Sleep_1946",
        "name": "The Big Sleep",
        "year": "1946"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MatBrewster"
        },
        "dateCreated": "2005-05-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038355/"
        },
        "name": "Classic Noir",
        "reviewBody": "Read all of my reviews at www.midnitcafe.blogspot.com This classic film noir has very few of techniques generally associated with noir. It contains no skewed camera angles; and though it is darkly lit, it is not overcome with murky, obscuring shadows. The hero is not down-and-out, poor, or desperate. There is no retrospective narration, or flashbacks. Yet, the Big Sleep is widely considered to be one of the very best of this genre. It is a cynical, perverse, murderous world filled with loads of confusing action and unknown motives. It is, in fact, one of the great films of one of the screens greatest actors (for my personal top 10 actors list, click here), and most talented directors.\n\nIt was directed by Howard Hawks fresh off of the successful pairing of Humphrey Bogart and Lauren Becall in To Have and Have Not. The two star here again and it is easy to see why they made another two films together. Based on a Raymond Chandler novel of the same name, many people complain that this film is incomprehensible. Somewhat famously it is reported that Bogart and Hawks, after arguing over who killed one of the characters, called up Chandler to get the correct answer. Chandler didn't have the slightest idea, for the novel is rather vague on this point. It's true that both the novel and film leave many plot points as to who did what to whom more than unclear, but there is so much style in both that it's hard to make a convincing argument against them.\n\nA good deal of the confusion within the film comes from the production codes in effect at the time it was produced. Chandler's novel deals with murder, homosexuality, heterosexuality, and pornography. At the time, these things were deemed unfit to show on a movie screen and so Hawks had to hint at them using various subtle methods. For instance, when Carmen Sternwood (Martha Vickers) is found by detective Phillip Marlow (Bogart) in the novel she is completely nude and sitting posed for a hidden camera. Since pornography is explicitly against code, in the movie she is dressed in a silky, Japanese gown. There is still a hidden camera, and its missing film becomes a catalyst for much of the action in the film. We must infer from the exotic nature of the gown that there was more than just pictures of a woman in a gown going on. There are many similar instances in the film like this. For an audience member who has not read the book, they must pay close attention to the subtext, or the film will seem baffling.\n\nPersonally, I am very much a fan of the book, and all of Chandler's work. While I appreciate that some of the finer plot points are a bit vague in this film, I also understand that the film succeeds not in the details of the story, but in a sinister sense of style. The film oozes with a dark, disquieting atmosphere. Nearly everyone Marlowe meets is hiding something, and is of less than upstanding moral character. Hawks does a great job of keeping nearly every scene in the dark or in the rain, or both. There are so many characters coming in and out of the shadows and with their own shady character that it is difficult to keep up.\n\nBogart, of course, does a marvelous job as Marlowe. He seems to understand a lot more information than the audience is ever given. Chandler wrote Marlowe as a detective who sticks by his own set up morals, remaining somewhat of a noble creature trying to stay afloat amongst the muck and sewers of the city. Lauren Bacall does a very good job portraying Vivian Sternwood Rutledge, in a role that is much different than the one in the book. Like many films from this era, they create a romance that wasn't really in the source material. I don't mind though, because Bogart and Bacall really sizzle.\n\nWhat can I say that hasn't been said before? This is really classic noir at its best. It's got Bogart and Bacall. It was directed by Howard Hawks, written by William Faulkner from a novel by Raymond Chandler. What more could a lover of classic cinema want? More reviews at www.midnitcafe.blogspot.com",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Warner Bros. Pictures",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3817406745",
        "name": "The Big Sleep",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTZhZWNlYzAtMGFiZi00OTFjLThlZDktNDQ3OGUzZjBmNjNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTZhZWNlYzAtMGFiZi00OTFjLThlZDktNDQ3OGUzZjBmNjNhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:12:52Z",
        "url": "https://www.imdb.com/video/vi3817406745/"
    },
    "url": "/title/tt0038355/"
}