{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mary Philbin",
            "url": "/name/nm0679907/"
        },
        {
            "@type": "Person",
            "name": "Conrad Veidt",
            "url": "/name/nm0891998/"
        },
        {
            "@type": "Person",
            "name": "Julius Molnar",
            "url": "/name/nm0597146/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7349,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Victor Hugo",
            "url": "/name/nm0401076/"
        },
        {
            "@type": "Person",
            "name": "J. Grubb Alexander",
            "url": "/name/nm0018470/"
        },
        {
            "@type": "Person",
            "name": "Walter Anthony",
            "url": "/name/nm0031033/"
        }
    ],
    "datePublished": "1928-11-04",
    "description": "When a proud noble refuses to kiss the hand of the despotic King James in 1690, he is cruelly executed and his son surgically disfigured.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Leni",
            "url": "/name/nm0501902/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWRjODkxYmMtNjlhNS00NmEzLWFiMmUtZTA5NjJkM2Y3M2E0XkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_.jpg",
    "keywords": "creepy smile,england,clown,melodrama,blind girl",
    "name": "The Man Who Laughs",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rfkeser"
        },
        "dateCreated": "2000-07-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0019130/"
        },
        "name": "Veidt and Leni and Victor Hugo",
        "reviewBody": "A lord refuses to kiss the hand of King James II, so is doubly punished: he perishes in the \"Iron Lady\" [onscreen in a memorably handled sequence] while his son is sent to a surgeon who [offscreen] carves a grin on his face \"so he can forever laugh at his father\". Sheltered by a kindly playwright [\"like Shakespeare, only much better!\"], the boy grows up to join his troupe of itinerant players as the star attraction: \"The Man Who Laughs\". His fortunes lead him to a blind girl, an ambitious duchess, and Queen Anne, who reinstates him to the nobility, but with further complications.\n\nConrad Veidt, in a career stretching from CALIGARI to CASABLANCA, always found the emotional authenticity in bizarre roles. Here, in the familiar 19th century figure of the suffering clown, his performance is transfixing: whether tremulous as the girl's hand explores his face, or mortified by the laughter of the House of Lords, Veidt's face makes the role more than a simple martyr: he is man struggling with unjust destiny [\"A king made me a clown, a queen made me a lord, but first God made me a man!\"].\n\nBig-hearted and unashamedly dramatic, this is clearly the work of Victor Hugo, rags to riches in scope, offering consolation in love. The spirit of the French Revolution is very much in the air in this world of cruel privilege and class antagonism, full of secret doors, dungeons, and volatile mobs. While not as richly populated as Les Miserables and Hunchback, this adaptation still has spectacular set-pieces and elaborate settings.\n\nConsiderably less revolutionary is the conventional portrayal of women: virgin and vamp are the only alternatives. The former is the blind girl played by Mary Philbin [who had earlier unmasked Lon Chaney's Phantom]. With blond ringlets arranged to make her face heart-shaped, she edges close to simpering yet rises to genuinely moving moments. The vamp is Olga Baclanova [who became the blonde tormentor in Tod Browning's FREAKS], here writhing around in a black negligee and looking startlingly like Madonna.\n\nToday, the films of Paul Leni are hard to track down, but worth the effort. Starting as an art director, Leni developed his visual command in Berlin; this Germanic style stands out in some beautifully designed compositions, such as a dynamic night sequence: a ship, full of gypsies being deported, heaves through a furious snowstorm. Yet Leni always works at the heart of the human values in the story, sustaining intense moments for all his actors. While some scenes are staged in darkness to rival a film noir, Leni also floods Veidt and Philbin with light, often focusing on one nuance per shot, an old-fashioned but effective strategy.\n\nFilmed on the cusp of the sound revolution, this semi-silent has added sound effects and rather vague non-stop music but no spoken dialogue."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2470362649",
        "name": "The Man Who Laughs",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDhjZjM3ZWYtNzQyZi00MDljLTk4MTAtZDQ0MWFmZDBhYzk1XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDhjZjM3ZWYtNzQyZi00MDljLTk4MTAtZDQ0MWFmZDBhYzk1XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-09T17:03:12.334Z",
        "url": "https://www.imdb.com/video/vi2470362649/"
    },
    "url": "/title/tt0019130/"
}