{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alan Berliner",
            "url": "/name/nm0075627/"
        },
        {
            "@type": "Person",
            "name": "Alain Berliner",
            "url": "/name/nm0075626/"
        },
        {
            "@type": "Person",
            "name": "Allen Berliner",
            "url": "/name/nm0075629/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 249,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065252/"
        },
        {
            "@type": "Person",
            "name": "Alan Berliner",
            "url": "/name/nm0075627/"
        }
    ],
    "datePublished": "2002-01-05",
    "description": "In The Sweetest Sound, Alan Berliner (the filmmaker from New York) is tired of being mistaken for people who might share his name and decides to rid himself of the dreaded Same Name Syndrome (In HD).",
    "director": [
        {
            "@type": "Person",
            "name": "Alan Berliner",
            "url": "/name/nm0075627/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg2MDY4NzA0M15BMl5BanBnXkFtZTcwMzQ3NjAzMQ@@._V1_.jpg",
    "keywords": "family relationships,genealogy",
    "name": "The Sweetest Sound",
    "original_info": {
        "id": "The Sweetest Sound_2001",
        "name": "The Sweetest Sound",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "erinfinnegan"
        },
        "dateCreated": "2001-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0281249/"
        },
        "name": "Alan Berliner, the director, invites the twelve other Alan Berliners from around the world over for dinner.",
        "reviewBody": "I am so glad that I am not the only person in the world who has given so much thought to my own name. Alan Berliner proves to be even more obsessive than I am. After a number of \"Egosurfs,\" (which is the word given to the act of looking up your own name on the internet,) Alan Berliner found twelve other owners of his name and flew them out to New York for dinner.\n\nImagine having a party with a dozen of your namesakes! Introductions are easy, and you never forget anyone's name. However, it can make you really start to question your identity. In a room full of people named Alan Berliner, who's who? All of them turn out to be white, middle-class, and middle-aged men.\n\nThe bulk of the film is put together with stock footage, man-on-the-street interviews (What does the name Alan bring to mind? One woman's response: Fat!) and old home movies. At the end of the film, Mr. Berliner encourages the viewers to write to him and tell them if they've recognized any of the faces in the stock footage as their own relatives.\n\nThis is a pleasant and fun documentary that really makes you think. It is never boring for a minute, and is just as delightful as Sherman's March.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0281249/"
}