{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Max von Sydow",
            "url": "/name/nm0001884/"
        },
        {
            "@type": "Person",
            "name": "Dorothy McGuire",
            "url": "/name/nm0570192/"
        },
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10884,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0117169/"
        },
        {
            "@type": "Person",
            "name": "Fulton Oursler",
            "url": "/name/nm0653617/"
        },
        {
            "@type": "Person",
            "name": "Henry Denker",
            "url": "/name/nm0219281/"
        },
        {
            "@type": "Person",
            "name": "James Lee Barrett",
            "url": "/name/nm0057157/"
        }
    ],
    "datePublished": "1965-04-09",
    "description": "An all-star, large scale epic movie that chronicles the life and ministry of Jesus Christ.",
    "director": [
        {
            "@type": "Person",
            "name": "George Stevens",
            "url": "/name/nm0828419/"
        },
        {
            "@type": "Person",
            "name": "David Lean",
            "url": "/name/nm0000180/"
        },
        {
            "@type": "Person",
            "name": "Jean Negulesco",
            "url": "/name/nm0624535/"
        }
    ],
    "duration": "PT4H20M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU4NDQ3Mzg3Ml5BMl5BanBnXkFtZTcwNjg5MTkzNA@@._V1_.jpg",
    "keywords": "beating,torture,death,self immolation,reference to satan",
    "name": "The Greatest Story Ever Told",
    "original_info": {
        "id": "The Greatest Story Ever Told_1965",
        "name": "The Greatest Story Ever Told",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "schappe1"
        },
        "dateCreated": "2003-11-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059245/"
        },
        "name": "Biblical Epics",
        "reviewBody": "I just got my first DVD payer after holding out for year and have become a total convert. I am watching some of the old classics of my youth, both to see them again in mint condition and to have a look at all the special features, including the documentaries and commentaries. Presently I'm doing a festival of the great biblical epics of the 50's and 60's. My local video store had THE ROBE, (1953), BEN-HUR (1959), CLEOPATRA, (1963) and THE GREATST STORY EVER TOLD, (1965-let's call it TGSET). I thought I'd write a joint review comparing them. \n\nTHE ROBE was done at the tail end of the old Hollywood, a studio production whereas these others were all filmed primarily on location with the international casts and crews we often saw making movies in the later era. But THE ROBE has all the Hollywood know-how we've come to expect. Particularly important was the pacing. It's a history lesson and a reverent film but it's also an entertainment. Young Richard Burton, (he was about 28) shows the impressive voice and passionate style that made him a name actor in the next decade, (he was nominated for an Oscar). Jean Simmons is very good and the smaller parts are well cast, particularly Richard Boone as Pontius Pilate, who in once scene leave much more of an impression than Frank Thring or Telly Savalas, who do the same role in BEN-HUR and TGSET, respectively. \n\nBut BEN-HUR is clearly the pick of the litter. This is true epic, full of glorious action scenes including the justly famous chariot race. But, as directed by William Wyler, it's also a very thoughtful film. Charlton Heston is excellent as the passionate and idealistic hero. Stephen Boyd is my all-time favorite movie villain. He's the one who should have won the supporting actor Oscar, not Hugh Griffith for his Arab businessman. But it's Wyler who carries the day. Noted primarily as a director of actors, (and especially actresses), he was by this stage in his carrier looking for challenges. He'd never directed an epic before. By bringing to the mix his sense for dialog and characterization, eh give this a depth you can't find in something direct by DeMille, for example, who was more a director of pageants than movies. His use of water as constant symbolism for cleaning the body and spirit is brilliant and memorable. \n\nJoseph Mankiewicz was also known for making more intimate films than CLEOPATRA, (which is not quite biblical but close enough). Like Wyler, he brings to the project something a normal director of epics would not have and CLEOPATRA is a much more intimate film than I remembered. Sure there is the absurdly overdone entrance into Rome and the Battle of Actium. But most of the scenes take place in doors and looked like a filmed record of a stage play. Both Burton and Rex Harrison are excellent in their roles and Liz Taylor is fine, (and fine looking), as well, although I agree with suggestions that Sophia Loren would have been a better choice being more obviously Mediterranean. Like Martin Landau and others interviewed, I would like to see some effort to restore, as best as possible, the two missing hours of this film and its presentation in the two parts Mankiewicz intended, perhaps on one of the movie channels. Even in its present form, the film is better than I remembered. \n\nTGSET may be the greatest story every told but this is surely not the greatest telling of it. The film is long, s..l..o..w and mournful. It's like sitting through a three hour wake. The only scenes where anybody shows any joy are the resurrection scenes of Lazarus and Christ at the end. One scene is accompanied by the disciples singing the same mournful hymn over and over again. I don't think I would want to hang out with these guys for very long. The scenes in THE ROBE where Burton talks to the people who were touched by their relationship with Jesus and in BEN-HUR where he offers the hero water and where he is given it in return, are much more moving that Max Von Sydow's grim sermons in TGSET. We never see the results of living the way eh suggests. And the miracle of resurrections seems an almost pointless substitute. If Jesus's soul has gone to join his father in Heaven, what difference does it make that his grave no longer holds his physical body?\n\n TGSET is filmed not in the Holy Land but in the deserts of Arizona and Utah, (Christ's visit to Utah must have pleased the Mormons.) The place looks totally desolate, such that no one would ever want to live there. Indeed, the area was flooded by a damn project shortly after film was completed. Too bad they weren't doing NOAH'S ARK or the TEN COMMANDMENTS. The actors are totally dwarfed by the surrounding scenery. It makes them and their story look temporary, not everlasting. The eclectic cast with its all-star cameos was considered something of a joke in it's time. At the Last Supper, TV Land viewers can see Illya Kuryakin, Baretta and Klinger! And it's fun to see Ingmar Bergman's knight from `THE SEVENTH SEAL doing scenes with Ed Wynn, Vaudeville's `Perfect Fool'. George Stevens is quoted as saying that someday, people viewing this film will not know who the actors were and will just see the characters. He's right. They all blend in together today. The performances are all very good, except for John Wayne's gargling of `Truly, this man was the Son of God', which, as I recall, produced audible laughter in the theater in 1965 and still seems wildly inappropriate today. I remember feeling that Charlton Heston walked away with the film as John the Baptist and he still does four decades later. The acting isn't the problem with the film. It's the pace and the setting."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3004481817",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDk4ODc2NGYtZWMxMS00Y2EzLWFiYmYtOWZmNmUxMTY3YWExXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDk4ODc2NGYtZWMxMS00Y2EzLWFiYmYtOWZmNmUxMTY3YWExXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-12-21T14:44:29.002Z",
        "url": "https://www.imdb.com/video/vi3004481817/"
    },
    "url": "/title/tt0059245/"
}