{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mathew Scollon",
            "url": "/name/nm0778660/"
        },
        {
            "@type": "Person",
            "name": "Melissa Reneé Martin",
            "url": "/name/nm0002570/"
        },
        {
            "@type": "Person",
            "name": "Edward DeRuiter",
            "url": "/name/nm0220656/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 756,
        "ratingValue": 4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Roger Khristian Jones",
            "url": "/name/nm0429161/"
        },
        {
            "@type": "Person",
            "name": "Steve Taylor",
            "url": "/name/nm0853204/"
        }
    ],
    "datePublished": "2001-12-31",
    "description": "Four outcast teenagers acquire mystical powers that allow them to become gods on campus, with deadly consequences.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Taylor",
            "url": "/name/nm0853204/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA2ODA4ODU0NV5BMl5BanBnXkFtZTgwNDY4ODM5MTE@._V1_.jpg",
    "keywords": "superpower,tape over mouth,man tied up,bound and gagged,teen slasher",
    "name": "The Source",
    "original_info": {
        "id": "The Surge_2001",
        "name": "The Surge",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vchimpanzee"
        },
        "dateCreated": "2007-07-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0265787/"
        },
        "name": "Weird, but has a few good moments",
        "reviewBody": "Reese is the new kid at school. It probably doesn't help that his father is the new chemistry teacher. But he also dresses in black and wears makeup--though I've seen far worse. Reese's dad makes a comment about how things will likely be better at this school. Well, that isn't going to be the case.\n\nReese gets picked on more than most outcast teens I've seen in movies or on TV, but he does make friends. Zack is sort of a nerd, and his sister Ashley is an angry but sarcastic rebel. Phoebe is a new-age type who is allergic to most foods--and wool (but who eats wool?).\n\nZack has discovered a portal in the woods on the side of a mountain, and he has recorded his observations and calculations on his laptop computer. He believes if the energy (which he describes as fusion) could be harnessed, we would no longer be dependent on fossil fuels.\n\nBut the teens try something different. They discover that by stepping inside the field surrounding the portal, each one gets a different super power. Zack can read minds, Phoebe can move objects (in \"Carrie\" this was called telekinesis), and Ashley can persuade others to do whatever she says--provided the other person is not strong-willed enough to resist. Reese's power is harder to figure out--it turns out to be the ability to heal. The powers don't last but a few days, so periodic recharging is necessary.\n\nAt first, the teens' new abilities provide comedy relief as well as a fantasy for anyone who was ever mistreated (or even perceived themselves as being mistreated) in school, by students or faculty. But Moss, who has been working with Zack on studying the portal, warns Zack that these powers could be dangerous. Moss is right.\n\nThis was not that bad a movie. But one sign it wasn't great: actors with one line delivered that line with all the enthusiasm that one line deserves. In fact, in really good movies, a single line can be delivered so well that the performance is memorable.\n\nThe four lead actors did a good job at least some of the time. Melissa Martin did the best as the rebellious and sarcastic Ashley.\n\nThe dress and behavior of these lead performers did not fit stereotypes (of course, Ashley's actions went beyond the usual even before she received her abilities). None of them would have been perceived as weird-looking if we hadn't been told they were supposed to be. This is good in that the movie didn't resort to the device of making the characters extreme examples of a certain personality type. Zack wasn't a Steve Urkel, even if he seemed to have Steve's intelligence. In fact, his grades weren't that good.\n\nThe music, if you can call it that, usually managed to be quite loud. It was alternative rock and high-tech dance music, for the most part. Most of it wasn't as unnerving as what was used for the opening and closing credits--this would probably appeal to teens like Reese. It all sounds like garbage to me, but somehow I got the impression it might be considered quality stuff. Certainly the dance music wasn't of the Britney Spears/Hilary Duff variety. More like dark basements in the bad section of town with flashing lights at 2 in the morning. I did like the polka music in one scene where someone was trying to bring Ashley under control.\n\nI'm not hard to please when it comes to visual effects. Bright colored cloud effects and fast movement seemed to be enough here. Nothing ground-breaking. And of course each teen's eyes glowed in a weird color as each power was used.\n\nSurprisingly, this film had little real violence. We were constantly subjected to rapid-fire editing of some flashback of a bloody event in Reese's past which might explain his behavior. And we also saw the aftermath of an event in the movie itself.\n\nThe best thing I can say is that for mistreated teens, this film represents a fantasy, but it also shows consequences."
    },
    "url": "/title/tt0265787/"
}