{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Samy Naceri",
            "url": "/name/nm0618651/"
        },
        {
            "@type": "Person",
            "name": "Benoît Magimel",
            "url": "/name/nm0536095/"
        },
        {
            "@type": "Person",
            "name": "Nadia Farès",
            "url": "/name/nm0268626/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5614,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "The Nest",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010093/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025658/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047181/"
        },
        {
            "@type": "Person",
            "name": "Florent-Emilio Siri",
            "url": "/name/nm0802807/"
        },
        {
            "@type": "Person",
            "name": "Jean-François Tarnowski",
            "url": "/name/nm0961823/"
        }
    ],
    "datePublished": "2002-03-06",
    "description": "Alliances change when an armored car with an Albanian mafia boss prisoner escapes a mafia army by driving inside a warehouse, which is being robbed by a French gang stealing laptops etc.",
    "director": [
        {
            "@type": "Person",
            "name": "Florent-Emilio Siri",
            "url": "/name/nm0802807/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmI4M2U5ZmMtZmQ1OS00MDNhLWJjY2UtNzIwNjZkZDRjMTFlXkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_.jpg",
    "keywords": "watching tv,infrared,car,warehouse,trial",
    "name": "Nid de guêpes",
    "original_info": {
        "id": "The Nest_2002",
        "name": "The Nest",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "talltale-1"
        },
        "dateCreated": "2004-12-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0280990/"
        },
        "name": "Glossy French Action--C'est merveilleux!",
        "reviewBody": "One doesn't (when one is American, at least) expect to get glossy, high-budget action films from the French; I didn't realize they even MADE this kind of movie. Do industry folk believe that foreign action films won't travel well or be able to compete with similar Hollywood product? If so, I'm surprised THE NEST didn't change all that. (Maybe it went straight to DVD here in the US.) Whatever the reason, this superior example of tight, twisty action film-making is worth recommending to anybody interested. \n\nBoasting a great plot, better than average writing and acting, and knockout direction, the film involves four sets of people--two of them lawbreakers, the other two law enforcers, whom chance and a little coincidence bring together with frightening, violent, bloody and surprisingly believable results. Most of the action is confined to one huge warehouse, and the director manages to eek out every bit of surprise, suspense and clever logistics from this unusual location. I have not seen as good a film of this type since the original \"Die Hard.\"\n\nAn ensemble piece using a terrific group of actors, the movie waits until its close to list its cast. I was so involved by the logistics and fast pace that I failed to recognize several of my favorite French actors: Benoit Magimel (\"The Piano Teacher,\" \"The King Dances\"), Pascal Greggory (\"Those Who Love Me Can Take the Train\"), and Sami Bouajila (\"The Adventures of Felix\"). Director Florent Emilio Siri has a new film coming out next year (\"The Hostage\"); on the basis of his \"Nest,\" I can't wait.\n\nNote: the DVD comes in its original French language with English subtitles and with an English dubbed alternative--which I have heard is badly done. This is NOT a dialog-heavy movie (most actions films aren't) so try it with the subtitles. I did--and was hooked from start to finish.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0280990/"
}