{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ellen Burstyn",
            "url": "/name/nm0000995/"
        },
        {
            "@type": "Person",
            "name": "Max von Sydow",
            "url": "/name/nm0001884/"
        },
        {
            "@type": "Person",
            "name": "Linda Blair",
            "url": "/name/nm0000304/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 416827,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069305/"
        },
        {
            "@type": "Person",
            "name": "William Peter Blatty",
            "url": "/name/nm0087861/"
        }
    ],
    "datePublished": "1973-12-26",
    "description": "When a 12 year old girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter.",
    "director": [
        {
            "@type": "Person",
            "name": "William Friedkin",
            "url": "/name/nm0001243/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWFlZGY2NDktY2ZjOS00ZWNkLTg0ZDAtZDY4MTM1ODU4ZjljXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "exorcist,exorcism,demonic possession,demonic force,vomiting",
    "name": "The Exorcist",
    "original_info": {
        "id": "The Exorcist: Restored Version_1973",
        "name": "The Exorcist: Restored Version",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "clydestuff"
        },
        "dateCreated": "2004-07-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070047/"
        },
        "name": "The Devil Made Her Do It",
        "reviewBody": "In late 1973 and early 1974, women and men were lined up for blocks. People were known to become ill watching it. Some fainted. Some ran out of the theater in tears. There were reports of people having to be institutionalized, and at least one miscarriage was attributed to viewing it. No, it wasn't a Rolling Stones Concert. It was a film called The Exorcist.\n\nThe first time I had heard of something called The Exorcist was on late night television when the author, William Peter Blatty, was a guest on The Tonight Show. The conversation centered around how horrible some of the things in the book were. I had also seen the novel listed on The New York Times Bestseller List, and it seemed as if it would remain there forever. After having been on the waiting list for what seemed like an eternity at the local library, I was finally able to obtain a copy. It was the first book I had read in one sitting since probably Nancy Drew and The Hidden Staircase quite a few years earlier. And yes, for it's time it was filled with gut wrenching details of what happens when for some unexplained reason; an innocent girl is possessed by Satan. While reading the book I was sure that if it ever made its way to film, most of the details would certainly be either `cleaned up' or omitted altogether. As you know the film was made and it spared the movie going public absolutely nothing in the way of details.\n\nCertainly many of the people who lined up to see The Exorcist did so to watch some of the more gruesome scenes, the worst of which involved Regan's masturbation with a crucifix. Yet, the hysteria went well beyond the fact that such scenes were so vividly depicted. I think one needs to look no further than Mel Gibson's The Passion to find the answer as to why. I'm sure most of you have read the story of people leaving Mel's film in tears, some to the point of being hysterical. From most articles I have read, it seems that the majority of the audience that was moved were those people of strong religious beliefs. For many others, the depiction of the brutality in The Passion may have been uncomfortable to sit through, but weren't emotionally effected to any degree. Much of this same feeling can explain the hysteria surrounding The Exorcist. Those who had a definitive belief in Heaven and Hell, of Good and Evil, of Jesus as The Savior and Satan as the epitome of pure evil were affected by The Exorcist far more than those who were agnostic or just never had a strong belief in spiritual matters. There is no doubt though that much in the way The Passion did, The Exorcist caused many to reconsider how they felt about their faith. The Exorcist made the prospect of Satan being alive and well and a life of eternal damnation a very uncomfortable prospect. The fact that Blatty claims his book and screenplay were based on a true story seemed to give the film even more credibility.\n\nFor me, The Exorcist has always been more about the never ending conflict between pure evil and pure innocence than about being an average horror story. There are many more levels to this film than what initially meets the eye. There is no doubt that while the main story revolves around an innocent young girl, Regan McNeil (Linda Blair), being inhabited by Satan himself, Blatty enhances it greatly by adding different characters in various stages of conflict. Regan's mother, Chris McNeil (Ellen Burstyn) obviously cares deeply for her daughter. Yet she is not beyond reproach. In one scene when Reagan's father hasn't called on Regan's birthday, we see her desperately on the phone doing battle with an overseas operator. The problem is not how vicious the phone call is, but that she does it within ear shot of her daughter as if to drive the point home to Regan how worthless her father is. When, she finally does seek the aid of Father Damian Karras, we don't feel that she believes in exorcism anymore than he does, but is desperate enough to accept the fact that it is possible and will take any and all measures to save her daughter.\n\nFather Karras (Jason Miller) is a priest torn by conflict. He is ridden by overwhelming guilt for having abandoned his mother to enter the priesthood. He is torn spiritually by the confessions of those priests who seek his help as a psychiatrist, so much so that he now questions his own faith. When he states to the Bishop that `Regan's case meets all the criteria,' we know that even more than Chris, he doesn't really believe in the power of Satan to inhabit a living being in the manner that it has taken over Regan. Yet, he will do what is required of him as a priest concerned about the health of a child.\n\nJack McGowran gives a terrific performance as the alcoholic director filming Chris's latest film in Georgetown. Kitty Winn is Sharon Spencer, the secretary who works for Chris and always seems to be in the line of fire when Chris is angry. She is always there but for all the horror she witnesses, Winn appears too bland and emotionless and her performance is probably the weakest in the film.\n\nMax Von Sydow as Father Lancester Merrin is a no nonsense aging priest. He has done battle with evil before and he shows us its effect in every scene he occupies. One could pass it off to being just good make-up but it is so much more than that as Sydow demonstrates all the nuances that brings to life a man who has faced Satan and lived to tell about it. He knows what he is up against, understands he must do it again and the consequences of what that battle may be.\n\nIf I have a small complaint with The Exorcist it is in regards to the character of Lt. Kinderman (Lee J. Cobb). I have never been able to buy into the character. It is not the fault of Cobb who is his usual stalwart self in the role. The whole character should at best have only been necessary for a few brief scenes yet; he has several that go on way too long and do not add anything to the story. Even in his scenes with Chris or Damian, Kinderman is so odd that he distracts us too much from their characters and it is Chris and Damian's reactions that are more important to us, not his investigation. For all you trivia buffs out there, Blatty once sued the producers of Columbo, stating they based Peter Falk's character on Kinderman. If memory serves me correctly Blatty lost that one.\n\nAs for Director William Friedken, although he won the best director award for The French Connection, for me The Exorcist will always remain his defining film. The Final half hour of The Exorcist are still as dynamic today as they were 31 years ago, French Connection car chase be damned.\n\nIt seems that to many of the younger movie audiences of today, The Exorcist has become more of a joke than anything else. That's not surprising considering how many times it has been lampooned, even by Linda Blair herself in Repossessed. Yet, if they were to view the film in a more serious vein, not as just another creature feature, they may just find that there really is more to this film than a little girl spewing pea soup and spinning her head around 360 degrees. It is the ultimate battle between Heaven and Hell and Good and Evil. It is the story of the complete and total degradation of innocence. It is a study in character, and whether a man torn by the forces surrounding him, can regain his faith and his belief in God and mankind to save the life of a little girl, caught up in forces beyond her control.\n\nCall it a horror film, call it a religious film, call it what you want. For me, The Exorcist is and will always remain a classic in every sense of the word. And if I regard you as a classic of any kind I have no choice but to leave you with my grade, which for The Exorcist is an A.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When a 12-year-old girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her.",
        "duration": "PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3987325721",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWIxN2Q1ODQtMGVjYi00NzAwLTlhZWMtYzUxYTM1MzE2YTIyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWIxN2Q1ODQtMGVjYi00NzAwLTlhZWMtYzUxYTM1MzE2YTIyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-09-27T13:21:32.372Z",
        "url": "https://www.imdb.com/video/vi3987325721/"
    },
    "url": "/title/tt0070047/"
}