{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Garner",
            "url": "/name/nm0001258/"
        },
        {
            "@type": "Person",
            "name": "Julie Andrews",
            "url": "/name/nm0000267/"
        },
        {
            "@type": "Person",
            "name": "Melvyn Douglas",
            "url": "/name/nm0002048/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5372,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065715/"
        },
        {
            "@type": "Person",
            "name": "Paddy Chayefsky",
            "url": "/name/nm0154665/"
        },
        {
            "@type": "Person",
            "name": "William Bradford Huie",
            "url": "/name/nm0401239/"
        }
    ],
    "datePublished": "1964-10-27",
    "description": "An American Naval Officer's talent for living the good life in wartime is challenged when he falls in love and is sent on a dangerous mission.",
    "director": [
        {
            "@type": "Person",
            "name": "Arthur Hiller",
            "url": "/name/nm0002137/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzc3MzU1MDAtNTU1NS00Y2IxLWI4MzUtYzQyZGYyYzJlNGRjXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "world war two,military,naval officer,london england,based on novel",
    "name": "The Americanization of Emily",
    "original_info": {
        "id": "The Americanization of Emily_1964",
        "name": "The Americanization of Emily",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2005-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057840/"
        },
        "name": "\"I'm not interested in the truth, just the momentary fact of things.\"",
        "reviewBody": "For those of today's fans who think Julie Andrews made her film debut in Mary Poppins, they would be wrong. After leaving Camelot on Broadway, The Americanization of Emily was the vehicle with which Julie made her debut. And she sings not a note.\n\nShe didn't have to. Beneath all the comedy revolving around the scheming and conniving of James Garner to stay as far away from the hail of bullets as possible are some profound statements about the futility of war and the geopolitics that got the USA in that particular war.\n\nJames Garner is in a quintessential James Garner role as set down by Bret Maverick, the part that made Garner a star. He's a \"dog robber\" a military aide to an admiral who specializes in acquiring certain creature comforts for his boss. Garner became one after serving some combat in Guadalcanal and finding it not to his liking. Fortunately for him, he had the connections to get out of that situation unlike several thousand others. Not a very admirable man.\n\nBut despite herself, stiff upper lip Britisher Julie Andrews finds herself falling for him. There's is one rocky romance.\n\nThrough a combination of circumstances Garner finds himself going to the front on D-Day to film the Naval Engineers disabling the mines in the water at Normandy Beach. Once again, it's not to his liking.\n\nGarner and Andrews get good support from the supporting cast consisting of James Coburn, William Windom, Joyce Grenfell and Melvyn Douglas as the battle fatigued admiral who's Garner's boss and who got him in the situation described. \n\nOne of my favorite scenes involves two sailors, Keenan Wynn and Steve Franken who get assigned to Garner to make the film. The three of them get cockeyed drunk and Garner's immediate superior James Coburn finds them in a state of uselessness. He has them hauled aboard the transport with the cargo.\n\nOne of the great things this film had going for it was the Henry Mancini-Johnny Mercer title song of Emily. They were a hot combination of movie song writers then, having one back to back Oscars for Moon River and Days of Wine and Roses. Frank Sinatra, Jack Jones, and Andy Williams are some of the artists who recorded that song back in 1964. \n\nI can't give the ending away, but let's say that Garner through a bit of sophistry winds up doing exactly what he said he never would. But then again as Garner says, he's not interested in some great philosophical truth, just the momentary fact of things. He and Julie Andrews together are what counts most.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An American Naval Officer's talent for living the good life in wartime is challenged when he falls in love and is sent on a dangerous mission.",
        "duration": "PT2M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2372517401",
        "name": "Theatrical Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDY2NWMyNDMtZjc3YS00ZGY0LTk1NTgtZGFhNmNjOTk4NjU1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDY2NWMyNDMtZjc3YS00ZGY0LTk1NTgtZGFhNmNjOTk4NjU1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-04T11:26:27.836Z",
        "url": "https://www.imdb.com/video/vi2372517401/"
    },
    "url": "/title/tt0057840/"
}