{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charles Denner",
            "url": "/name/nm0219342/"
        },
        {
            "@type": "Person",
            "name": "Brigitte Fossey",
            "url": "/name/nm0287637/"
        },
        {
            "@type": "Person",
            "name": "Nelly Borgeaud",
            "url": "/name/nm0096501/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7030,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "The Man Who Loved Women",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106723/"
        },
        {
            "@type": "Person",
            "name": "Michel Fermaud",
            "url": "/name/nm0272749/"
        },
        {
            "@type": "Person",
            "name": "Suzanne Schiffman",
            "url": "/name/nm0771535/"
        },
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        }
    ],
    "datePublished": "1977-04-27",
    "description": "Bertrand Morane's burial is attended by all the women the forty-year-old engineer loved. We then flash back to Bertrand's life and love affairs, told by himself while writing an autobiographical novel. A film about romantic relati...",
    "director": [
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmUzNGUyMmQtMGE2Ni00NmVkLTg0MWMtNDU2NTM0MWMxZDQ1XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "sex scene,legs,female topless nudity,cat,white cat",
    "name": "L'homme qui aimait les femmes",
    "original_info": {
        "id": "The Man Who Loved Women_1977",
        "name": "The Man Who Loved Women",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dromasca"
        },
        "dateCreated": "2021-06-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0076155/"
        },
        "name": "this film could not have been made today",
        "reviewBody": "It would be impossible to make today a movie like 'L'homme qui aimait les femmes' (the English title is 'The Man Who Loved Women') directed in 1977 by François Truffaut. Not the way the French filmmaker wrote and directed it, in any case. The main hero is a serial womanizer, a man who usually looks at women from the legs up, who accumulates conquests inevitably followed by separations, who has no intention of establishing a stable relationship and who collects his trophy memories in drawers full of letters and photos before starting to write a book in which he describes his series of love adventures. Such a male hero could be in our times only a negative character and the fact that Truffaut describes him as an eternal lover whose fascination for women finds its justification in the way they are also attracted and fall under his charms would be hard to explain today. And yet, Don Juan and his disciples traverse the history of literature, opera, and cinema.\n\nIf someone still dares to write the script for a remake, he should change almost everything. There is a lot of on-screen smoking - at work, at the table, in bed. People send letters and use dial phones that ring threatening. Manuscripts of books are brought by the writers in envelopes and entrusted to the typists. Not only are there no mobile phones, but the engineer Bertrand Morane, the hero of the film, works for a company where telephone calls are accepted in a switchboard operated manually by a telephone operator. In the morning he is awakened by the voice of another telephone operator from a wake-up service. Any attractive woman who crosses his way becomes the object of his attention and fascination, regardless of her social or family status. The film is asymmetrical, in the sense that Truffaut is less interested in the psychology of his female heroines. Charles Denner, the actor who plays the main hero of the film is far from having the physical charm of an Alain Delon or the charisma of Belmondo, looks like a banal guy. What is the secret of his success with women? Maybe it's his fascination with the opposite sex that he reveals quite directly, without ostentation or traces of violence. If he misses a conquest, our hero shrugs and goes to the next woman he meets on the way. Truffaut conveyed to the film's hero his own fascination with women, embodied in his admiration for the actresses who starred in his films (and in a few alleged love stories).\n\nA few cinematic elements attract attention. The scenes that open and close the film are borrowed from the film noir genre, although what happens between them is completely different. Attentive viewers will identify in the first frame the director's cameo appearing, as in Hitchcock's film. The off-screen voice is used intensively, which is not a rarity in Truffaut's films, being inserted under the pretext of the hero's attempt to turn his adventures into a memoir book, like those of Casanova or Don Juan. As I am mentioning - again - Don Juan, this film lacks any kind of moralising judgment. Even in the libretto of Mozart's opera the great seducer is punished. Here it is hazard that is put at work. To substantiate psychologically the behaviour of his hero, Truffaut inserts some flashback scenes from his adolescence and introduces the figure of his mother, a kind of mirror replica of what would become his son. In 'L'homme qui aimait les femmes' two of the main themes of his films meet, the fascination for women and the sometimes painful coming to age. Plausible? Spectators are left to judge. The film deserves, in any case, a viewing or a re-viewing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0076155/"
}