{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Sheen",
            "url": "/name/nm0000640/"
        },
        {
            "@type": "Person",
            "name": "Rob Lowe",
            "url": "/name/nm0000507/"
        },
        {
            "@type": "Person",
            "name": "Allison Janney",
            "url": "/name/nm0005049/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 79463,
        "ratingValue": 8.9,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037310/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005035/"
        },
        {
            "@type": "Person",
            "name": "Aaron Sorkin",
            "url": "/name/nm0815070/"
        }
    ],
    "datePublished": "1999-09-22",
    "description": "Inside the lives of staffers in the West Wing of the White House.",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjk3ZWE3ZDctN2Q1YS00NzNhLWFjNmYtZTkwYWQxZmQ3NzM3XkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "dialogue driven,political drama,president,ensemble cast,social commentary",
    "name": "The West Wing",
    "original_info": {
        "id": "The West Wing: Season 1_1999",
        "name": "The West Wing: Season 1",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "liquidcelluloid-1"
        },
        "dateCreated": "2004-05-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0200276/"
        },
        "name": "\"Wing\" is a beautifully written, cinematically packaged series that satisfies the audience's desire to see behind these particular closed doors",
        "reviewBody": "Network: NBC; Genre: Drama; Content Rating: TV-PG; Available: DVD and syndication; Perspective: Modern Classic (star range: 1- 5); \n\nSeasons Reviewed: Complete Series (7 seasons) \n\nCreated out of the ashes of the tragic failure that ABC befell his neo-classic \"Sports Night\" (which I also highly recommend), Aaron Sorkin's next effort aims at nothing short of the most powerful office in the world. \"The West Wing\" takes us behind the scenes of the Bartlet (Martin Sheen) administration and his staff, which includes special counselor Leo (John Spencer), the dryly spunky Press Secretary C.J. (Allison Janney), Chief of Staff Josh (Bradley Whitford) and his model-like assistant Donna (Janel Moloney), morose Communications Director Toby (Richard Schiff), aid Charlie (Dule Hill) and Deputy Comm Director Will (Josh Malin, \"Sports Night\").\n\nTo best enjoy \"Wing\", with its occasionally maddening bouts of self indulgence and nose-in-the-air intellectual showboating, is to understand how purposefully different it is from just about anything else on TV. It lacks the kind of compelling situational drama you'd expect. Most of the real action occurs off screen, with us simply hearing that a crisis was solved. This show is about conversations, history and civics lessons and an ambitious deconstruction of wedge issues that you never heard spoken of so thoughtfully in entertainment television. \"Wing's\" vision of politics is an old-fashioned fantasy of a noble grass roots attempt, guided by history and the framers, where the political process is a necessary tool, o do what's right for the common man.\n\nThe political right has taken the show out to the woodshed for spouting liberal propaganda (every character is a vocal Democrat), but in my experience with it, it has been nothing but honest and fair with it's topics, unlike the blunt object beating we get from David E. Kelley and Dick Wolf shows. You have to be quick to catch inferences to tax cuts creating service cuts and women's lives being ruined by having a child and not an abortion. Free from a need to create simplistic sound-bytes or follow poll numbers of real-world politicians, Sorkin's world depicts the kind of well reasoned discourse lost in the modern, media-driven political climate.\n\nBack to the dialog and the most important thing. This is a show that can be written with such lyrical beauty and directed with such cinematic majesty that it elevates it from a conceptually tedious concept and static stories. Sorkin brings back the snappy, lightening-fast \"His Girl Friday\" conversations of \"Night\". A man in love with his dialog (I can't fault him for that), he crams very syllable of every crisp monologue in the running time.\n\nSatisfying the audience's desire to see behind these particular closed doors, \"Wing\" consciously maintains a fly-on-the-wall quality as we follow the White House staff through hallways and offices discussing everything from the most frivolous everyday annoyances and grammatical idiosyncrasies to weighty issues of domestic and foreign policy. It gives us the wonderful illusion we are seeing the real nit and grit behind the political process - from getting enough votes to pass a bill to keeping piece in the Middle East. This is C-SPAN stuff, packaged with beautiful, epic pageantry.\n\nAt series' end my initial reaction to the show still holds water. By comparison it doesn't have the heart or the laughs of \"Sports Night\". It has a rich look and feel but, for all its philosophizing and linguistic gymnastics, I still remain detached from the characters and any emotional core at all. Spencer is terrific and Janney and Whitford make TV stars of themselves with what are for the most part mechanical characters with just enough quirks to get them banging against each other nicely. That said, Whitford and Moloney have an engaging chemistry that draws us in and lets us root for them. A chemistry that the show takes a smart 7 years to pay off.\n\nSorkin and Sheen's president is a Frank Capra fantasy the melds together the most idealistic elements of politics and Americana into someone who can represent the best of his ideology and is still human enough to display the worst. Granted, this is Sorkin's fantasy so the latter is rare and Bartlet gets the last wise word most of the time.\n\nAfter the 4th season, Sorkin leaves the show amid rumors of drug use and studio hack John Wells is brought on board. Wells is a network hack who took over \"ER\" when Michael Crichton stepped away and turned it into a soap opera, and then did the same with his own \"Third Watch\". The show slowly changes under Wells and while he resists his usual urge to sadistically kill of major characters, Sorkin's trademark dialog is slowed down and the show gets more traditionally exciting, but the intellectual substance remains and Wells gels with the show well.\n\nI don't love \"The West Wing\" as much as others. Each episode starts strong and ends strong, but almost always looses steam in the long 2nd act. So goes entire seasons, which can bring us in and go out with an assassination, a kidnapping, terrorist attack or some other exciting peril for a main character and stall for entire hours in the winter.\n\nUnder Wells' control, the series ends with a spectacular bang. The final season brings an end to the Bartlet administration and follows the feverish presidential campaign of both parties race to win the election and instill their candidate - either Republican Senator Vinick (liberal He-man Alan Alda) or Democrat congressman Santos (Jimmy Smitts) - in as his successor. After 7 seasons the show goes out as rewarding and classy as it came in. A behind-the-scenes celebration of the American political process. It is an exceptional final season for a classy and classic show.\n\n* * * * / 5"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3802840601",
        "name": "Trailer Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTdhYWZkNDUtMDU2Zi00NmNmLWE4M2QtNDgwYzZmMThlOGNhXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTdhYWZkNDUtMDU2Zi00NmNmLWE4M2QtNDgwYzZmMThlOGNhXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg",
        "uploadDate": "2020-03-11T14:28:44.851Z",
        "url": "https://www.imdb.com/video/vi3802840601/"
    },
    "url": "/title/tt0200276/"
}