{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ralph Macchio",
            "url": "/name/nm0001494/"
        },
        {
            "@type": "Person",
            "name": "Pat Morita",
            "url": "/name/nm0001552/"
        },
        {
            "@type": "Person",
            "name": "Elisabeth Shue",
            "url": "/name/nm0000223/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 231185,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042549/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024560/"
        },
        {
            "@type": "Person",
            "name": "Robert Mark Kamen",
            "url": "/name/nm0436543/"
        }
    ],
    "datePublished": "1984-06-22",
    "description": "A martial arts master agrees to teach karate to a bullied teenager.",
    "director": [
        {
            "@type": "Person",
            "name": "John G. Avildsen",
            "url": "/name/nm0000814/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Action",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTkzY2YzNmYtY2ViMS00MThiLWFlYTEtOWQ1OTBiOGEwMTdhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "karate,teenager,training,fight,paint",
    "name": "The Karate Kid",
    "original_info": {
        "id": "The Karate Kid_1984",
        "name": "The Karate Kid",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "joebloggscity"
        },
        "dateCreated": "2019-09-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087538/"
        },
        "name": "Mr Miyagi is the mentor we all wish we had... A life impacting movie",
        "reviewBody": "Is there anything more that can be truly said of this inspiring movie? Possibly it is the most unlikely hit movie that has generated a strong faithful following.\n\nI rewatched it after 30 years on the back of falling for the Cobra Kai series, and loved it every bit as much as when I first saw it. I'm much older but find so many new things to relate to and remind myself of in life.\n\nThe premise of the film is simple, but it is almost impossible to explain the impact this movie had on a certain young generation on its release. It was its run in the video market that made it the huge success it became, and so much of it has become part of pop culture be it in its quotable lines and simple action.\n\nWhat made it stand out was that it clearly was the antithesis of all other martial arts movies of the time which were in a boom period on video rental, but they were all muscle bound and flying around at 100mph. The Karate Kid instead centres on peace, life philosophy, defence and self-betterment.\n\nThe crux is the central partnership between the central pair of Mr Miyagi and Daniel, which begins as teacher mentoring pupil but develops into a father & surrogate son relationship.\n\nThere are so many layers to this film, and the truth is that the karate is really secondary to all. Any action is short, simple and down to earth. The real fights are for the soul, against bullies and personal defeat. For Mr Miyagi it is a reawakening for him, for Daniel it is a journey of self discovery.\n\nThe greatest part is the acting. You simply can't take away from either of the two leads, the chemistry between them is just perfect. Pat Morita plays Mr Miyagi almost effortlessly but perfectly as the mentor to a young insecure Daniel, which becomes a father and surrogate son relationship. If anything the relationship helps bring Mr Miyagi out of his shell. For example, we see inside the soul of Mr Miyagi, and some of his inner torment (i.e. loss of wife & child), and Daniel becomes closer to him for it.\n\nMr Miyagi is the mentor & father all men wish they had. He practices & teaches peace & self-respect with humour & dignity. Something we can all learn from. His dry wit and personal reserve are humbling to see. Winning the tournament against the bullies is secondary, but the personal development is what comes first.\n\nThe Oscar nomination for Pat Morita for the role was deserved, and unfortunate not to win it, but his role has left a lasting legacy and is in the hearts of so many. I can only say to him thank you, and also to all who helped put this wonderful touching film together.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi813087257",
        "name": "The Karate Kid",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmU0YTU1MTQtMjM5OC00Yzg1LWFmOWQtYjFkOTJkYWRiMTgxXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmU0YTU1MTQtMjM5OC00Yzg1LWFmOWQtYjFkOTJkYWRiMTgxXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2019-02-02T17:14:40.415Z",
        "url": "https://www.imdb.com/video/vi813087257/"
    },
    "url": "/title/tt0087538/"
}