{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liam Neeson",
            "url": "/name/nm0000553/"
        },
        {
            "@type": "Person",
            "name": "Julian Ayer",
            "url": "/name/nm1101388/"
        },
        {
            "@type": "Person",
            "name": "John Blackborow",
            "url": "/name/nm1095345/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2071,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "The Endurance",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056361/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002948/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075875/"
        },
        {
            "@type": "Person",
            "name": "Caroline Alexander",
            "url": "/name/nm0018311/"
        },
        {
            "@type": "Person",
            "name": "Joseph Dorman",
            "url": "/name/nm0233771/"
        }
    ],
    "datePublished": "2001-12-21",
    "description": "A retelling of Sir Ernest Shackleton 's ill-fated expedition to Antarctica in 1914-1916, featuring new footage of the actual locations and interviews with surviving relatives of key expedition members, plus archived audio intervie...",
    "director": [
        {
            "@type": "Person",
            "name": "George Butler",
            "url": "/name/nm1000159/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NTkwNDcxNl5BMl5BanBnXkFtZTcwMDcwODcyMQ@@._V1_.jpg",
    "keywords": "reenactment,expedition,antarctica,wrought iron cross grave marker,voice over narration",
    "name": "The Endurance: Shackleton's Legendary Antarctic Expedition",
    "original_info": {
        "id": "The Endurance_2000",
        "name": "The Endurance",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Danusha_Goska"
        },
        "dateCreated": "2009-01-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0264578/"
        },
        "name": "Riveting. Moving. Thrilling. Disturbing. A Must See.",
        "reviewBody": "\"The Endurance\" is one of the most amazing, unforgettable movies I've ever seen (and I've seen a lot of movies.) I wish I could require everyone to see it. \"The Endurance\" makes a mockery of most of what passes for action-adventure. It leaves comic book movies like 2008's \"The Dark Knight,\" in its dust.\n\n\"The Endurance\" tells the story of Ernest Shackleton's alternately miraculous and disastrous Antarctic expedition of 1914. For the bulk of the film's runtime, I was on the edge of my seat, gasping, overwhelmed by the horror and magnitude of the nightmarish conditions Shackleton and his men confronted. The men, stuck in Antarctica, watch their ship, their sole sure escape, crushed into a pile of toothpicks by heaving chunks of ice. A man wakes in the middle of the night to realize that the ice under his tent has shifted; he plunges, in his sleeping bag, into Antarctic Ocean. Sled dogs go from being trusted allies and team members to something starving men debate eating. These conditions didn't last for an hour or a day or a month, but for over a year.\n\nBad luck is followed by almost miraculous momentary deliverance. At one desperate point, the fate of his men hanging on his ability to carry out an almost impossible task  walking non-stop for 36 hours across unmapped cliffs, mountains, and glaciers, after months of malnutrition and under-using the muscles in his legs  Shackleton is convinced that a supernatural companion accompanies him. Mary Crean O'Brien, daughter of Tom Crean, who also made this trek with Shackleton, insists that that ghostly companion had been sent by \"the man upstairs.\" One may scoff, but in this trek, Shackleton just missed a blizzard that, had he had to walk through it, would have certainly killed him. But what about all the bad luck that damned Shackleton and his men to their icy prison? This is a film that has you asking the big questions. Why do men do these crazy things? What does suffering mean, especially given how hard some people seek it out? Are these men greater than the rest of us, or merely mad? Where are frontiers, and heroes like this today? \"Endurance\" gets you thinking about culture. The British Empire gets a bad rap, but it did train its men to be honorable, and to live up to a code of conduct. Shackleton and his men were stoic, self-sacrificing, and learned to transcend class and ethnic differences. I had to wonder how a group of youths trained by our current values of whining, victimization, selfishness, identity politics and deviance would have responded under a similar catastrophe.\n\nThe film is beautiful to look at. The filmmakers traveled to the Antarctic and complement Frank Hurley's, antique, black-and-white film footage and still photographs with modern, color footage. The effect is mesmerizing. The modern film footage plunges you into the Antarctic; you will feel cold. You will contemplate turquoise shadows on pure white icebergs, ice-choked sea, and blizzards as aesthetic phenomena, as guardians of the last frontier, and as enemies who want to stop the blood in your veins and suck your body several fathoms down.\n\nI have to confess that I found this film hard to watch. And I couldn't stop watching it. After it was done, I really needed time to decompress. Moment after moment juggles human lives and fates. I'll never forget this film, though, and its demonstration of the power of the human spirit.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0264578/"
}