{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Christian Slater",
            "url": "/name/nm0000225/"
        },
        {
            "@type": "Person",
            "name": "Helmut Qualtinger",
            "url": "/name/nm0702818/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 111217,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "The Name of the Rose",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002257/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013358/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042444/"
        },
        {
            "@type": "Person",
            "name": "Umberto Eco",
            "url": "/name/nm0248767/"
        },
        {
            "@type": "Person",
            "name": "Andrew Birkin",
            "url": "/name/nm0001949/"
        },
        {
            "@type": "Person",
            "name": "Gérard Brach",
            "url": "/name/nm0102722/"
        }
    ],
    "datePublished": "1986-09-24",
    "description": "An intellectually nonconformist friar investigates a series of mysterious deaths in an isolated abbey.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Jacques Annaud",
            "url": "/name/nm0000269/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjEyZTdhNDMtMWFkMS00ZmRjLWEyNmEtZDU3MWFkNDEzMDYwXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "middle ages,abbey,monk,franciscan,14th century",
    "name": "Der Name der Rose",
    "original_info": {
        "id": "The Name of the Rose_1986",
        "name": "The Name of the Rose",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "edwardlamberti"
        },
        "dateCreated": "2004-09-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0091605/"
        },
        "name": "One of the most underrated movies of the eighties",
        "reviewBody": "Umberto Eco's novel has something of a reputation as one of the great unread bestsellers. To have it on the shelf in the early eighties was a fashion statement as much as it was a literary necessity. And yet when the film was released, it was attacked for being an ineffective adaptation. Turning the 600-page novel, a detective mystery enriched by descriptions of medieval life and semiotic ruminations characteristic of Eco's academic writings, into a mainstream two-hour movie was, of course, ambitious. Four credited screenwriters and an international co-production gave off a sense of struggle and indecision. The movie was, and remains, easy to deride.\n\nIt's true that the film, directed by Jean-Jacques Annaud, has to skip, or skirt, much of Eco's detail - the famous pages-long description of the doorway, for example, is acknowledged by a few camera shots - but it takes the novel's literary strengths and offers a cinematic equivalent: a vivid depiction of monastic life which thrusts the viewer into the period of the story. In this respect, the production is exemplary: cinematographer Tonino Delli Colli, art director Dante Ferretti and composer James Horner were all operating at the top of their game.\n\nAnd, as Renton in Trainspotting (1996) knows, Sean Connery proved a perfect choice as William of Baskerville, the 14th-century Sherlock Holmes figure investigating the deaths in an Italian monastery. It's one of Connery's best performances, a happy marriage of character acting and star casting: he suits the physical description of William and he properly conveys the character's wisdom, caution and sense of regret. Christian Slater's Adso, the narrator of the novel, is a surrogate for the viewer, expressing bafflement at the mystery story and awe at William's deductive powers; while F. Murray Abraham works wonders with the underwritten part of the inquisitor Bernardo Gui.\n\nThe Name of the Rose is one of the most underrated movies of the eighties. That it wasn't brilliant should not detract from the fact that it's as good as it is."
    },
    "url": "/title/tt0091605/"
}