{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Olson",
            "url": "/name/nm0647921/"
        },
        {
            "@type": "Person",
            "name": "Arthur Hill",
            "url": "/name/nm0384050/"
        },
        {
            "@type": "Person",
            "name": "David Wayne",
            "url": "/name/nm0915536/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 38470,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024434/"
        },
        {
            "@type": "Person",
            "name": "Michael Crichton",
            "url": "/name/nm0000341/"
        },
        {
            "@type": "Person",
            "name": "Nelson Gidding",
            "url": "/name/nm0317254/"
        }
    ],
    "datePublished": "1971-03-12",
    "description": "A team of top scientists work feverishly in a secret, state-of-the-art laboratory to discover what has killed the citizens of a small town and learn how this deadly contagion can be stopped.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Wise",
            "url": "/name/nm0936404/"
        }
    ],
    "duration": "PT2H11M",
    "genre": [
        "Mystery",
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzY4NGZkOTMtNTRjNy00NWY4LWI2ZmUtODc3NWY3MTBhNzE2XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "scientist,alien,new mexico,based on novel,new mexico desert",
    "name": "The Andromeda Strain",
    "original_info": {
        "id": "The Andromeda Strain_1971",
        "name": "The Andromeda Strain",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2008-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066769/"
        },
        "name": "Frighteningly absorbing piece of fiction that's fused with fact.",
        "reviewBody": "A satellite from the SCOOP project has crashed into the desert town of Piedmont, the SCOOP project basically entails that the satellite scoops outer space for any alien micro-organisms. After the crash all the residents of Piedmont are killed with the exception of a baby and an old gentleman booze hound. Mankind is on the verge of being destroyed by a leaked alien virus, so a crack team of scientists are gathered in the hope of containing and understanding the virus before the world gets devoid of human life!\n\n Taken from the novel by Michael Crichton, this film is a wonderful lesson in tension building as we follow the scientists through a carefully structured sci-fi plot that will eventually become a race against time thriller. What makes The Andromeda Strain stand out against other genre pieces is the astute and believable approach to the subject matter, we are (in the main) in the presence of proper scientists. There's no super hero tricks forthcoming from these people, these are sensible honest intelligent folk using their combined knowledge to hopefully save the planet? A masterstroke from the makers is that they used largely unknown actors for the film, this gives the story an added grounded believable factor, thus a very useful way of drawing the audience into the drama unfolding. The direction from Robert Wise is very clued in for serio narrative drive, the set design for the underground research facility is top notch, and the actors all give stoic and intelligent performances.\n\n However, it's not without a niggle, for after the excellence of the films first two thirds, it's disappointing to find that the final act reverts to type, which somehow seems misplaced given what the viewer has just been through. Don't get me wrong, it's a fine sequence of events that fuels the dramatic slant, but it comes off as just a bit too glossy in light of the preceding structure. Still, The Andromeda Strain is an intelligent, smart, mature, and knowing film that is standing the test of time for being a great piece of science fiction cinema. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2043330585",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGM4Mjg4ODItZGJkNi00NDI3LTkyMmEtZGZlMTI3Y2VmNGY1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGM4Mjg4ODItZGJkNi00NDI3LTkyMmEtZGZlMTI3Y2VmNGY1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-21T17:21:54.234Z",
        "url": "https://www.imdb.com/video/vi2043330585/"
    },
    "url": "/title/tt0066769/"
}