{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Gallagher",
            "url": "/name/nm0001251/"
        },
        {
            "@type": "Person",
            "name": "Elisabeth Shue",
            "url": "/name/nm0000223/"
        },
        {
            "@type": "Person",
            "name": "Alison Elliott",
            "url": "/name/nm0254362/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3700,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "alternateName": "The Underneath",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0133407/"
        },
        {
            "@type": "Person",
            "name": "Don Tracy",
            "url": "/name/nm0870511/"
        },
        {
            "@type": "Person",
            "name": "Steven Soderbergh",
            "url": "/name/nm0001752/"
        },
        {
            "@type": "Person",
            "name": "Daniel Fuchs",
            "url": "/name/nm0297190/"
        }
    ],
    "datePublished": "1995-04-28",
    "description": "A recovering gambling addict attempts to reconcile with his family and friends but finds trouble and temptation when caught between feelings for his ex-wife and her dangerous hoodlum boyfriend.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Soderbergh",
            "url": "/name/nm0001752/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTU5MjRlMGYtNWRhZS00YjA2LTllNjMtMWZmNzhjNjQ2OWU4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "armored car,lottery,female to male foot in crotch,robbery,pool hall",
    "name": "Underneath",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KnightsofNi11"
        },
        "dateCreated": "2011-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114788/"
        },
        "name": "Well made suspense",
        "reviewBody": "Steven Soderbergh always has interesting things to say about small Texas towns and the film The Underneath is one of his more interesting and articulate. Peter Gallagher stars as Michael Chambers, a gambler who returns to his small rural town for his mother's nuptials. While in town he tries to reignite an old flame with his ex-girlfriend, Rachel, but this leads to more problems than she's worth. Michael finds himself in a dangerous situation when Rachel's fiancée, Tommy, played by the hugely underrated William Fichtner, finds out about Michael. The Underneath has all of that familiar indie Soderbergh feel that is complete with suspense, mystery, ambiguity, and characters whose personal issues go far and beyond what the normal person living the normal life is used to.\n\nThe Underneath is a slow moving film that starts out seeming fairly pointless at first. But as it develops it grows more and more interesting. The noir-ish atmosphere combined with Soderbergh's tense cinematic style keeps this film quietly engaging. For a while it feels like a film that doesn't have much purpose and seems to be pretty straightforward. The first half of the film follows Michael as he tries to rebuild his relationships with all the people he abandoned years ago when he lost a substantial amount of money while betting. He tries to rekindle his love with Rachel, tries to make his mother happy with him again, and tries to keep his brother from hating him. The first half of the film holds no surprises but raises interesting questions and keeps you around waiting for more.\n\nThen comes the second half of The Underneath where things really kick off and it shapes into the film that it had set out to be from the opening suspenseful tone. The mystery builds and we become innately fascinated by what is going on. The plot twists and turns right up to the very last shot which throws the entire story for a loop. It's great filmmaking and excellently engaging storytelling on an intriguingly small scale. There's nothing flashy about The Underneath, but that's what one should expect from Soderbergh.\n\nI wouldn't say that this is a film for everybody, but fans of Soderbergh would be foolish not to check it out. It's a film with a great story, a compelling atmosphere, an consistently suspenseful tone, a good script, and decent acting. I don't know that there's much more that I could want from this fine little film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi268173593",
        "name": "The Underneath (1995)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTE1YmJlYmEtMzc2ZS00ODZlLWI2OTMtZTE2Y2Y0ZmI3YzkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTE1YmJlYmEtMzc2ZS00ODZlLWI2OTMtZTE2Y2Y0ZmI3YzkwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:18:18Z",
        "url": "https://www.imdb.com/video/vi268173593/"
    },
    "url": "/title/tt0114788/"
}