{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Buddy Ebsen",
            "url": "/name/nm0001171/"
        },
        {
            "@type": "Person",
            "name": "Donna Douglas",
            "url": "/name/nm0235031/"
        },
        {
            "@type": "Person",
            "name": "Irene Ryan",
            "url": "/name/nm0752576/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10181,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060358/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049888/"
        },
        {
            "@type": "Person",
            "name": "Paul Henning",
            "url": "/name/nm0377417/"
        }
    ],
    "datePublished": "1962-09-26",
    "description": "A nouveau riche hillbilly family moves to Beverly Hills and shakes up the privileged society with their hayseed ways.",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2MjY1OTgzMl5BMl5BanBnXkFtZTcwNzYxOTYwMg@@._V1_.jpg",
    "keywords": "hillbilly,rags to riches,millionaire,nouveau riche,1960s",
    "name": "The Beverly Hillbillies",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "roghache"
        },
        "dateCreated": "2006-04-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055662/"
        },
        "name": "Hilarious culture clash comedy revolves around integrity of Jed",
        "reviewBody": "This is a hilarious 1960's comedy that I grew up with and still never tire of every time I chance to encounter it in re runs. It surely stands among the best of its genre. The series revolves around the sidesplitting culture clash that ensues when the country bumpkin Clampett family moves to Beverly Hills after father, Jed Clampett, stumbles upon oil on his land and becomes a multi millionaire. The rest of the family joining him at their new Beverly Hills mansion include Jed's mother-in-law Granny, pretty daughter Elly May, and nephew Jethro Bodine.\n\nThe Clampetts are of course...something else...as they enter this alien world, where their mansion has every luxury imaginable including a cement pond. The superstitious & feisty Granny makes certain her kin always have lots of vittles, especially such delicacies as hog jowls and possum belly. She hangs out her shingle for the purpose of imparting her unique brand of down home doctoring & dentistry, and firmly believes that the South won (or at least is winning) the Civil War. Much of her time is spent chasing her great nephew, Jethro, out of her kitchen with a broom, trying to curtail his endless appetite. The dim witted Jethro is a scheming would be playboy, who's all proud that he graduated sixth grade and can cipher. Jed's sweet, innocent, & beautiful daughter, Elly May, has a penchant for critters, including a pet chimpanzee named Bessie. Granny is terrified that Elly's destined to become an old maid, as alas, she's still unwed at the ripe old age of eighteen. Much of Granny's energy is put into seeking out suitable beaux, although any courtin' & sparkin' in the Clampett parlour must be suitably chaperoned (or rather, cheered on) by spying through the closed door's keyhole.\n\nThe gem of the series is Jed, around whose unfailing integrity this ongoing saga revolves. He always seems blissfully unaware that he's wealthy, feels and acts no differently than he did back in the hills, and treats everyone the same (whether rich or poor). He gives generously to country folk and city slickers alike, is equally kind to both neighbours and total strangers...all the while dealing with the crazy antics of both Granny and Jethro and seeing to the lovely & rich Elly's various suitors, not all of whom have the most honourable of intentions. As another commented, if only everyone was like Jed Clampett! \n\nIn dramatic contrast to these hillbillies are the wealthy and status conscious Beverly Hills citizenry, as personified by Jed's banker, Mr. Drysdale, whose life revolves around maintaining the favour of his bank's main customer, Mr. Clampett, and protecting that thirty million dollars (or whatever the figure). His wife, Mrs. Drysdale, is a superficial & snooty dame who comes into frequent conflict with her neighbour, Granny. Jane Hathaway is Mr. Drysdale's very properly spinsterish but man hunting and bird watching secretary. She is the constant victim of her boss's greedy schemes and actually becomes quite a genuine friend to the Clampetts.\n\nThe actors are all stellar in their roles...Irene Ryan (Granny), Donna Douglas (Elly May), Max Baer Jr. (Jethro), Raymond Bailey (Mr. Drysdale), Nancy Kulp (Miss Hathaway), and especially the wonderful Buddy Ebsen (Jed).\n\nIt's a hilarious and side splitting romp, each episode funnier than the last. Through it all, Jed's integrity and honesty always shine through. The humble and good hearted neighbourliness of the Clampetts stands in sharp contrast to their affluent environment. It's Jed Clampett's desire for the simple pleasures of home, family, friends, and hard honest work versus Milburn Drysdale's blatant materialism. Every viewer realizes that, despite all the absurdity and the utterly ridiculous scenarios, the Clampetts know exactly what's important in life and that this family of uprooted hillbillies has a real life lesson to teach us all.\n\nIf only there were more TV shows like it today! Alas, our society has become far too sophisticated for its own good.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Beverly Hillbillies",
        "duration": "PT1M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi819182873",
        "name": "The Beverly Hillbillies",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2EzZWY0OGUtMzVlMC00Y2FjLWI5NjMtNTIwNDM5NGZkODNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2EzZWY0OGUtMzVlMC00Y2FjLWI5NjMtNTIwNDM5NGZkODNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-05T07:52:52.280Z",
        "url": "https://www.imdb.com/video/vi819182873/"
    },
    "url": "/title/tt0055662/"
}