{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Beck",
            "url": "/name/nm0065235/"
        },
        {
            "@type": "Person",
            "name": "James Remar",
            "url": "/name/nm0001664/"
        },
        {
            "@type": "Person",
            "name": "Dorsey Wright",
            "url": "/name/nm0942352/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 105244,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Sol Yurick",
            "url": "/name/nm0951050/"
        },
        {
            "@type": "Person",
            "name": "David Shaber",
            "url": "/name/nm0787072/"
        },
        {
            "@type": "Person",
            "name": "Walter Hill",
            "url": "/name/nm0001353/"
        }
    ],
    "datePublished": "1979-02-09",
    "description": "A street gang known as The Warriors must fight their way from the Bronx to their home turf on Coney Island when they are falsely accused of assassinating a respected gang leader.",
    "director": [
        {
            "@type": "Person",
            "name": "Walter Hill",
            "url": "/name/nm0001353/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTU2MWRiMTMtYzAzZi00NGYzLTlkMDEtNWQ3MzZlNTJlNzZkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "new york city,street gang,truce,survival,subway station",
    "name": "The Warriors",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "beezer_of_geordies"
        },
        "dateCreated": "2002-11-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080120/"
        },
        "name": "Let's Get Down To It Boppers...",
        "reviewBody": "Just a couple of points to add to the general accolades above:\n\nHere in England the BBC have twice shown a version of The Warriors with a prologue scene, edited from the released movie but restored to a point prior to the opening 'Wonder Wheel' shot. It shows Cleon (an otherwise very underused character), sitting on the Boardwalk in the late afternoon sunshine waiting for his eight footsoldiers to show, while his girlfriend pleads with him not to go to the Bronx. When the others arrive and line up he designates their roles, including the \"Swan: War chief and second in command\" alluded to later in the movie. Ajax gives an early sign of his belligerent nature, voicing his disapproval with bringing a boombox-guy and a graffiti-artist: \"They'll only slow us down\", but seems happy to be labelled as \"Heavy Muscle\" along with Cochise. Much of the dialogue from this scene is re-used in the credit-sequence, with the shots of Coney and the gathering forces intercut with short interchange between Warriors. However, the prologue scene ends unforgettably with a crane-shot of the nine striding up the Boardwalk and into the distance, casting long shadows on the decking and with Cleon's girlfriend trailing in their wake. Over this, a slow sixties surf-tune booms out as the waves wash against the shore. Bloody wonderful.\n\nUnfortunately I have never found a store-bought version which includes this material - DVD community, do you know?\n\nAnother thing I heard was that the original idea was that the movie was set \"Sometime In The Near Future\", but Walter Hill dropped the idea of having a caption stating as much at the start of the film. This explains some of the discrepancies with the actual New York gangland, being more about delinquent youth and 'Colours' than Organised Crime syndicates and shiny suits.\n\nThird - a fantastic action movie full of colour, vim and attitude, but which also never fails to break my heart every time I watch it. There are a couple of scenes like this - mostly Deborah Van Valkenburgh's - but the main one is with Swan and Mercy on the Subway as the High School 'Preppies' complete with ruffled shirts and massive lapels sit down opposite, their laughter and smiles soon fading as the contrast becomes blindingly obvious to them as well as us. Walter Hill plays this scene perfectly: with no dialogue as such, and with Swan and Mercy not even looking at each other as he takes her hand from her hair and places it firmly by her side. Och, goosebumps even thinking about it!\n\nFinally, having also read the original 'Anabasis' (I had to) when I was studying Ancient Civilisations of the Med at University, as a piece of pure drama The Warriors could shove a bat up it's ass and turn it into a Popsicle. Can You Dig It?!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In the near future, a charismatic leader summons the street gangs of New York City in a bid to take it over. When he is killed, The Warriors are falsely blamed and now must fight their way home while every other gang is hunting them down.",
        "duration": "PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi272284185",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2VmMGE1ZjItNTI1Yi00OWEzLTk1MTctNzA4ODQ3MmE3YjMyXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2VmMGE1ZjItNTI1Yi00OWEzLTk1MTctNzA4ODQ3MmE3YjMyXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg",
        "uploadDate": "2018-12-26T19:19:52.320Z",
        "url": "https://www.imdb.com/video/vi272284185/"
    },
    "url": "/title/tt0080120/"
}