{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cedric Hardwicke",
            "url": "/name/nm0362567/"
        },
        {
            "@type": "Person",
            "name": "Scott Marlowe",
            "url": "/name/nm0549325/"
        },
        {
            "@type": "Person",
            "name": "David McCallum",
            "url": "/name/nm0564724/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 69,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020746/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011888/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034753/"
        },
        {
            "@type": "Person",
            "name": "Joseph Stefano",
            "url": "/name/nm0825010/"
        }
    ],
    "datePublished": "1964-05-04",
    "description": "Near Aix-les-Bains (South-East of France), two women, Kassia and Leonora, are driven by a fanatical blackmailer, named André, in a white Rolls Royce at full speed. Suddenly, they stop near a lake, in the middle of the woods, where...",
    "director": [
        {
            "@type": "Person",
            "name": "Gerd Oswald",
            "url": "/name/nm0652631/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmIzOGNkM2YtN2RiZC00ZmI2LTg3YjMtMDZkZjZjOTUzZWZjXkEyXkFqcGdeQXVyMDYxMTUwNg@@._V1_.jpg",
    "name": "The Unknown",
    "original_info": {
        "id": "The Outer Limits: The Original Series: Season 1_1963",
        "name": "The Outer Limits: The Original Series: Season 1",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "telegonus"
        },
        "dateCreated": "2005-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0376292/"
        },
        "name": "The Nick Of Time",
        "reviewBody": "The Unknown (aka Forms Of Things Unknown) was originally aired as an episode of the Outer Limits TV series in 1964. Set in Europe, it concerns two American women who are manipulated and dominated by a sadistic man with whom they are both deeply involved, whom they decide to poison. After the murder they arrive at the home of a very peculiar young man whose hobby is playing with time. He has developed an elaborate machine to conduct his experiments and, as things turn out, succeeds in bringing back to life the dead man his two visitors have recently killed. Or has he? Once again, these women are being played with, this time in an even more sinister manner, only in this case the trickster is a retiring, benign seeming, scholarly fellow who, when not spying on the women at odd moments, is inclined to quote passages from Shakespeare's A Midsummer Night's Dream.\n\nThis is a daring and original film, beautifully photographed by Conrad Hall, and finely acted by a well chosen cast that includes Barbara Rush, Vera Miles, David McCallum, Scott Marlowe and Sir Cedric Hardwicke. It is in many ways a \"chamber film\", small-scale and intimate, done in a manner suggestive of Ingmar Bergman. Director Gerd Oswald does a superb job with the material, and Joseph Stefano's script is artistically ambitious, coming at times perilous close to going over the top, alternately provocatively philosophical and emotionally unnerving, it is like nothing else I have ever seen. If I hesitate to call it a masterpiece this is due mostly due to my resistance to the word, and also to the fact that I've only seen the film once in its entirety and would like to examine it more closely before making grand pronouncements about it. As it is, The Unknown is in a class by itself, and deserves wider distribution than it has thus far received. It is a compelling, utterly unique viewing experience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0376292/"
}