{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jet Li",
            "url": "/name/nm0001472/"
        },
        {
            "@type": "Person",
            "name": "Josephine Siao",
            "url": "/name/nm0796196/"
        },
        {
            "@type": "Person",
            "name": "Adam Cheng",
            "url": "/name/nm0155532/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4518,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "The Legend of Fong Sai-Yuk 2",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0083980/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Person",
            "name": "Kin Chung Chan",
            "url": "/name/nm0150977/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Lau",
            "url": "/name/nm0311508/"
        }
    ],
    "datePublished": "1993-09-25",
    "description": "The Cantonese hero Fong Sai Yuk becomes involved in the secret brotherhood \"The Red Flower\", who are trying to overthrow the Manchurian emperor and re-establishing the Ming dynasty. The social upheaval is combined with Sai Yuk's p...",
    "director": [
        {
            "@type": "Person",
            "name": "Corey Yuen",
            "url": "/name/nm0477035/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjllN2NhYmQtM2ZmYi00Y2ExLWI1NjYtZTIxNDgxY2NhOGVkXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "platform,hero,emperor,roundhouse kick,good versus evil",
    "name": "Fong Sai Yuk 2",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Grave44"
        },
        "dateCreated": "2002-05-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106937/"
        },
        "name": "English Language Edition is Terrible",
        "reviewBody": "The mandarin edition is the elite edition, it has a sub titles, but any one who can feel the emotions of the film, can over see over the sub titles with no problem. The voices from the mandarin edition are important just like the SOUNDTRACK and the original script.\n\nI first sore this great film when I was 13 and im now 19. I sore the mandarin edition on the channel 4 TV and managed to get it on video with a few minutes missing. I tried very hard to get hold of a copy of the film, but with no luck.\n\nTo day while checking the local video rental store, I found The Legend 2 `Also known as Fong Shi Yung or Fong Sai Yong'. With delight I rented it thinking of the English edition of the same film I had enjoyed many times.\n\nA few hours later I watched the film, with disgust as it was an American dubbed voice, with no feeling or matching of the characters. To make matters worst the script was terrible, nothing of the same script as the mandarin edition, which was funny, interesting and meaningful. This edition was like as episode of an American TV show attempting to mimic a successful film, it was like watching a cheap meaning less film on sky TV which had not been successful enough in America to be tried any where in the world. The original oriental feel which inspired me so much was ruined if I call it that, it was not there it was cold, meaning less and plain TERRIBLE. The soundtrack, which helped give the film, its graceful rhythm was cheap and badly done, making it sound like an episode of the power rangers, IT WAS TERRIBLE.\n\nWhen people want films from other countries, they want them as they are shown in the country it was made for, with sub titles or good audio dubbing with correct feels, with the correct soundtrack and if they cart do that they should leave sub titles and not mess it up.\n\nThe film is nearly 10 years old and is only just coming to some of the world. Many people have been waiting to be able to buy this film, this cheap edition film I sore was terrible, meaning, less, and some thing which would never even touch Crouching Tiger Hidden Dragon if it had a stick as big as the Titanic in length.\n\nI was so bored by the new script that I turned it off, even though I tried very hard to sit to the end to see if the film was even possibly enjoyable I ended up with at least 40mins till the end.\n\nEnd result, TERRIBLE and nothing of the good stuff the film was striped from.\n\nRest In Peace",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2161155609",
        "name": "The Legend 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODAyODU5ODktZDQ1Zi00ZGFjLTlkN2YtNjQ5ZTU0MzBhNzg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODAyODU5ODktZDQ1Zi00ZGFjLTlkN2YtNjQ5ZTU0MzBhNzg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:54:21Z",
        "url": "https://www.imdb.com/video/vi2161155609/"
    },
    "url": "/title/tt0106937/"
}