{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Traudl Junge",
            "url": "/name/nm0432622/"
        },
        {
            "@type": "Person",
            "name": "Michael Darlow",
            "url": "/name/nm0201438/"
        },
        {
            "@type": "Person",
            "name": "Eva Braun",
            "url": "/name/nm0105751/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 57,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "description": "Traudl Junge wanted to dance the ballet and so she went to Berlin. She already knew shorthand and typing, she applied for a vacancy in Hitler's chancellery. She became one of his private secretaries because of her resemblance to E...",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Darlow",
            "url": "/name/nm0201438/"
        }
    ],
    "duration": "PT23M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjBiYTdhNzAtZWYyYS00NGY5LTkyZjAtMDJlYzkyYmY1ZDk1XkEyXkFqcGdeQXVyNDc3NDk5Mw@@._V1_.jpg",
    "keywords": "reference to adolf hitler,interview,sequel",
    "name": "The World at War: A Special Presentation - Secretary to Hitler",
    "original_info": {
        "id": "The World at War_1974",
        "name": "The World at War",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MisterChandu"
        },
        "dateCreated": "2007-03-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0234685/"
        },
        "name": "Great interview film for serious students of the Third Reich.",
        "reviewBody": "This documentary is a must for any serious student of the Third Reich. It is a primary research vehicle with the account of Hitler's Secratary, a person who was present in the Bunker and who took Hitlers dictation of his last will and testament is about as close as you can get without knowing Hitler yourself. \n\nIf you are a student of the war then you will recognize many of the stories Traudl Junge speaks of. It is too bad that many of the other survivors of the war were not interviewed in such depth. many of the Bunker survivors lived until recently and many of the NAZI's present at such conferences as Wansee lived well into the 1980's. All and everything they may have said about what they experiences is now lost to the ages.\n\nShe is the women who contributed to the first Hitler Bunker film with Oscar Werner (Hitler: The Last The Days!) and also the most recent and best \"Downfall!\" \n\nMortality and every day that passes now makes this \"living history\" harder and harder to come by. At least we heard from Speer, Leni Refienstal, and many of the surviving Generals. They say we will never forget. I do not think thats true. Soon this will be like studying Napoleon.\n\nGood film for serious students of the war.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0234685/"
}