{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vincent Price",
            "url": "/name/nm0001637/"
        },
        {
            "@type": "Person",
            "name": "Joseph Cotten",
            "url": "/name/nm0001072/"
        },
        {
            "@type": "Person",
            "name": "Hugh Griffith",
            "url": "/name/nm0341518/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15756,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059622/"
        },
        {
            "@type": "Person",
            "name": "James Whiton",
            "url": "/name/nm0926365/"
        },
        {
            "@type": "Person",
            "name": "William Goldstein",
            "url": "/name/nm0326338/"
        }
    ],
    "datePublished": "1971-05-18",
    "description": "Doctor, scientist, organist, and biblical scholar Anton Phibes seeks revenge on the nine doctors he considers responsible for the death of his wife.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Fuest",
            "url": "/name/nm0297523/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWIwYjc5ZjEtZGI0Mi00ODVjLWFhODAtOWU3N2Q5NmNlZDFjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "revenge,cult film,art deco,tragic villain,anti hero",
    "name": "The Abominable Dr. Phibes",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2003-12-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066740/"
        },
        "name": "Dr. Phibes = horror like it should be",
        "reviewBody": "There are several actors in cinema that give away terrific performances all the time...No matter what role their cast in, they're always believable and impressive. But then, even beyond that, there are some actors who're just BORN to play certain role!! And that's the theory could be stated by Vincent Price in the Abominable Dr. Phibes. It's impossible to imagine this mad murderer being played by anyone else. Price IS Dr. Phibes and he makes the most of his role here. A truly powerful and fascinating performance that yet has to find its equal. Even if you're not into horror, I would recommend The Abominable Dr. Phibes if it were only for Price...it really is an acting job every self-respected fan of cinema should acknowledge.\n\n But The Abominable Dr. Phibes is much more than just a 'tour-de-force' by Price. It stands as one of the most entertaining and original horror movies ever made. It's an innovating movie in every way you look at it and - like none other - it passed the test of time. The film is over 30 years now and it still looks refreshing and extremely cool. To me personally, the single title also sums up several reasons to proof that horror is the most powerful genre in cinema. First and foremost, it brings together two types of cinema that are hard to amalgamate. Face it, the basic plot of Dr. Phibes is a love-story and a tale about how to deal with the loss of a loved one...Much more than a ravenous psychopath, Dr. Phibes is a hurt romanticist! Secondly - and most teachers will deny this - Dr. Phibes is an educational film!! I guess we've all learned about the Biblical Plagues that overcame the Pharaoh in school, but it'll be much more easy to number and memorize them after you've seen this film. You might even say The Abominable Dr. Phibes is a valuable history lesson. And finally, this movie really proofs to me that horror is the \"underdog\"-genre in cinema. Do you remember how the plot of Se7en impressed the whole world when it came out in 1995? Both critics and audiences called it innovating, dared and highly original...but were the true horror fans impressed as much? I don't think so because the basic principles the killer in Se7en uses are just a pale tribute to the methods Dr. Anton Phibes employed. \n\nAnyway...I start to sound way too dedicated in my love towards the genre. Basically, what I mean is: The Abominable Dr. Phibes is a perfect horror film and perhaps even one of the most entertaining cinema experiences you'll ever have. Especially when it's your first viewing, Dr. Phibes will be a satisfying purchase. It's a refreshing horror film with adorable British humor and solid acting and directing. The whole thing is just a chain of brilliant sequences. Almost impossible to determinate a few highlights...the entire movie is one HUGE highlight!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0066740/"
}