{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shawnee Smith",
            "url": "/name/nm0809938/"
        },
        {
            "@type": "Person",
            "name": "Kevin Dillon",
            "url": "/name/nm0001143/"
        },
        {
            "@type": "Person",
            "name": "Donovan Leitch Jr.",
            "url": "/name/nm6230258/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 39831,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005883/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0155635/"
        },
        {
            "@type": "Person",
            "name": "Theodore Simonson",
            "url": "/name/nm0800796/"
        },
        {
            "@type": "Person",
            "name": "Kay Linaker",
            "url": "/name/nm0510989/"
        },
        {
            "@type": "Person",
            "name": "Irvine H. Millgate",
            "url": "/name/nm0589614/"
        }
    ],
    "datePublished": "1988-08-05",
    "description": "A deadly entity from space crash lands near a small town, and begins consuming anyone in its path. Panic ensues, as shady government scientists try to contain the horrific creature.",
    "director": [
        {
            "@type": "Person",
            "name": "Chuck Russell",
            "url": "/name/nm0751080/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Horror",
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWIzYjFmZTAtNWMxZS00MmVhLTkyYmEtZjkzZWQwMzg0N2ZjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "monster,parasitic organism,alien organism,child in jeopardy,horror movie remake",
    "name": "The Blob",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "The_Void"
        },
        "dateCreated": "2005-11-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094761/"
        },
        "name": "Fifties Sci-Fi meet eighties trash with great results!",
        "reviewBody": "Remakes are often frowned upon by film fans, and for good reason, but Chuck Russell's take on the silly fifties Sci-Fi flick of the same name certainly doesn't disappoint! The film has the fifties plot structure and ideas, but it's been updated to the eighties - which means gratuitous amounts of special effects, a trashy atmosphere and lots and lots of gore! This remake has sentimental value for me personally, as it's the only film in history to make me physically sick. I would have been about seven at the time, and watching this film over breakfast isn't recommended for seven-year-old kids! However, I did, of course, get the day off school. I've grown up a bit since then, but upon watching The Blob again; I've got to say that it's lost none of it's charm, only I managed to hold back on being sick this time. The plot follows an asteroid that comes down from space. Upon inspecting it, a lowly bum finds himself with a strange organism stuck to his hand! The Blob also takes advantage of the eighties teen comedy craze, and after a couple of kids find the tramp on the road, they take him to the hospital, and that's where the fun really starts \n\nThe special effects are often silly, but nevertheless; very effective! The sequences are very imaginative, and take advantage of the eighties style humour that make eighties horror films what they are. The way that the blob consumes people is always disgusting, and seeing the half-melted outlines of people inside the creature is lots of fun and makes for some really good horror. Because it was made in the eighties; many of the scenes focus on raunchy kids, and this gives The Blob lots of room to manoeuvre the central monster into all kinds of hilarious situations. The acting, as you would expect, is nothing to write home about; but the cast approach their roles with gusto, and the fun performances help to make the film what it is. Chuck Russell does a great job of creating the right sort of atmosphere for the film and the screenplay is better than you would expect for a trashy eighties horror flick. Some will notice that the script was co-written by one Frank Darabont, who would, of course, go on to write and direct one of the 'best films of the nineties'. Personally, I'd rather this watch this film!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer 2",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi999210777",
        "name": "The Blob",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTk0NDQyYjgtZDNjMS00ZGRjLThkNTctN2IzNmQyZTMzNWU1XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTk0NDQyYjgtZDNjMS00ZGRjLThkNTctN2IzNmQyZTMzNWU1XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-10-09T17:03:02.019Z",
        "url": "https://www.imdb.com/video/vi999210777/"
    },
    "url": "/title/tt0094761/"
}