{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlotte Kirk",
            "url": "/name/nm5016840/"
        },
        {
            "@type": "Person",
            "name": "Sean Pertwee",
            "url": "/name/nm0675730/"
        },
        {
            "@type": "Person",
            "name": "Steven Waddington",
            "url": "/name/nm0905357/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3405,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0273446/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0474730/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0630936/"
        },
        {
            "@type": "Person",
            "name": "Neil Marshall",
            "url": "/name/nm0551076/"
        },
        {
            "@type": "Person",
            "name": "Charlotte Kirk",
            "url": "/name/nm5016840/"
        },
        {
            "@type": "Person",
            "name": "Edward Evers-Swindell",
            "url": "/name/nm1898082/"
        }
    ],
    "datePublished": "2021-02-05",
    "description": "Grace, a young widow haunted by the recent suicide of her husband Joseph, is falsely accused of being a witch by her Landlord after she rejects his advances.",
    "director": [
        {
            "@type": "Person",
            "name": "Neil Marshall",
            "url": "/name/nm0551076/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDdlZjA3MzgtNmJlNC00NGZkLWFhNGMtNTk4ZmQwMDM1YzY0XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
    "keywords": "young widow,widow,medieval england,plague,witch hunt",
    "name": "The Reckoning",
    "original_info": {
        "id": "The Reckoning_2004",
        "name": "The Reckoning",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lukem-52760"
        },
        "dateCreated": "2021-11-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt9182964/"
        },
        "name": "Charlotte Kirk is Excellent in this Savage true life Horror",
        "reviewBody": "This was a very grim & nasty Hammer Horror film made by the excellent Neil Marshall (Doomsday, Dog Soldiers, Centurion) who has created such a terrifying atmospheric film that is based on a true story & the facts of innocent women being accused of being Witches & murdered.\n\nIt still blows my mind that this ridiculously stupid & horrific things happened!!! All those innocent women & mostly because of vile men couldn't have their way with them so they damned them as Witches. Also all that bullsh#t \"God\" fearing crap had warped their pathetic minds so they believed in what they were doing, pathetic idiots.\n\nThis story is set during the plague times of the olden days with thoughts of deaths throughout England caused by the plague are being put on women as if they caused it by Witchcraft & one unlucky & absolutely stunningly beautiful lady called Grace, played Brilliantly by the beautiful Charlotte Kirk, has lost her loving husband to the plague & is left struggling to survive with her baby & as if that wasn't bleak enough she is accused of being a Witch because she fought back against her vile rapist landlord that is obsessed with her. Charlotte Kirk gives such a powerful & heroic performance & really was mesmerising on screen & in these times about protecting women in our times, well she is one brave & unstoppable strong women & she should be so proud of outstanding performance here but I'm not sure about how she is in real life? Sex scandals & all when she was a teen & with ugly old men that have power within the movie business!!! Freaky & vile stuff right there but as an actress she's very good.\n\nThis is a dirty, gritty, grim & brutal movie that doesn't shy away from the horrific brutality of women suffered back then by cowardly bully men. Grace is tormented & tortured to confess that she's an evil Witch but she will not break.\n\nA known Witch-hunter, Judge Moorcraft played by the excellent Sean Pertwee (Doomsday,Dog Soldiers, I.d,Soldier) a regular who Marshall usually casts & here he's a horrible & sadistic God worshipping sicko but he can't break an innocent woman this time.\n\nSome of the torture scenes were hard to watch & i was shocked that these sick events actually happened.\n\nThe men were cowards & believed in a non-existent entity \"GOD\" & that's why their all messed-up in the head like a freaky Cult.\n\nFor a low-budget Direct-to-dvd movie, Neil Marshall has really crafted a grisly, dark & savage Horror that mixes fantasy & fact together.\n\nWhat i loved about this movie was of course Charlotte Kirk's mesmerising Performance as Grace but also the fact it turns into a bloody vengeance Thriller that was so satisfying.\n\nThe Reckoning is another really good Neil Marshall movie with a powerhouse performance by Charlotte Kirk.\n\nMaybe not a film i could watch alot but i still gotta admit its damn good.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "After losing her husband during the Great Plague, Grace Haverstock (Charlotte Kirk) is unjustly accused of being a witch and placed in the custody of England's most ruthless witch-hunter, Judge Moorcroft (Sean Pertwee). Forced to endure physical and emotional torture while steadfastly maintaining her innocence, Grace must face her own inner demons as the Devil himself starts to work his way into her mind.",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1342619929",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWY4YjA4NjItMGNkMy00NGQ0LTllNjYtNjgzNmUxNDNiZDE0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWY4YjA4NjItMGNkMy00NGQ0LTllNjYtNjgzNmUxNDNiZDE0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-01-06T17:48:02.554Z",
        "url": "https://www.imdb.com/video/vi1342619929/"
    },
    "url": "/title/tt9182964/"
}