{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Diana Ross",
            "url": "/name/nm0005384/"
        },
        {
            "@type": "Person",
            "name": "Michael Jackson",
            "url": "/name/nm0001391/"
        },
        {
            "@type": "Person",
            "name": "Nipsey Russell",
            "url": "/name/nm0751369/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15826,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007638/"
        },
        {
            "@type": "Person",
            "name": "L. Frank Baum",
            "url": "/name/nm0000875/"
        },
        {
            "@type": "Person",
            "name": "William F. Brown",
            "url": "/name/nm0114912/"
        },
        {
            "@type": "Person",
            "name": "Joel Schumacher",
            "url": "/name/nm0001708/"
        }
    ],
    "datePublished": "1978-10-24",
    "description": "An adaptation of \"The Wizard of Oz\" that tries to capture the essence of the African-American experience.",
    "director": [
        {
            "@type": "Person",
            "name": "Sidney Lumet",
            "url": "/name/nm0001486/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Adventure",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzU0YzkzYjItOThjNi00NTU4LWIxZDEtN2U4NmFkMGFiOWI3XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "wizard,new york city,thanksgiving,dog,witch",
    "name": "The Wiz",
    "original_info": {
        "id": "The Wiz_1978",
        "name": "The Wiz",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Morlock"
        },
        "dateCreated": "1999-01-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078504/"
        },
        "name": "The art of adaptation...",
        "reviewBody": "Normally, I feel that it is a travesty to remake an older, classic film (sequels excepted). Profits aside, what is the motive? What is there to add? \"The Wiz,\" however, is one of the few exceptions to my belief. Whereas \"The Wizard of Oz\" is more of a child's film, the intended audience for \"The Wiz\" is a few steps above that. Like its predecessor, \"The Wiz\" is both visually stunning and musically engaging. It compliments the seriousness of its themes and situations--both of which it has in more abundance than its predecessor--with a copious amount of humor. Seldom have I witnessed a more creative work of adaptation than that which is presented by \"The Wiz,\" which is, of course, adapted from L. Frank Baum's \"The Wonderful Wizard of Oz.\" A few others that spring to mind are \"Logan's Run\" and \"The War of the Worlds.\" I mention these not because they were simply a good translation of book to film, but because they maintained the book's overall story (plot, theme, characters, etc.) while retailoring the environment and/or situation. \"The Wiz\" focuses on the \"black situation.\" It redresses all of the elements from its source material to meet the needs of its revamped, modern, social subject matter. From the Scarecrow, who represents a pitiable, underachieving product of his environment; to the poppies, which represent drug addiction; to the denizens of Oz, who are ready to follow the latest trend just to be \"in;\" the story presents its audience with a generalized glimpse at the breakdown of \"black\" culture and society. Though \"The Wiz\" does not convey the same childlike wonder, magic, and fantasy that both the original film and the novel do, it translates those elements into more of an industrialized, mechanical, inner city playground. Unfortunately, albeit appropriately, the Oz we witness is through an older Dorothy's eyes. Interestingly, due to her advanced age, the circumstances that befall her must be harsher in order to invoke the necessary change of heart. Unlike the setting in \"The Wizard of Oz,\" which exists in our dreams, \"somewhere over the rainbow,\" the setting in \"The Wiz\" occupies our nightmares. The contrast between Judy Garland's Oz and her native Kansas is many times greater than that between Diana Ross' Oz and her native New York. The incentive to return home is greater for Diana--even though the colorful lure of a fantasy land is not present--since her Oz may be merely a preview of things to come (back home), if she does not start to make a difference. One of the few things for which I did not care was all-too-recognizable, yet modified New York as Oz. Though the entire film's art direction was brilliant, I found New York to be too distracting and too contemporary to be an adequate Oz. Another subject of distaste for me was the \"end of slavery\" segment after Evillene's liquidation. The song and dance were nice and full of energy, but the symbolism was too literal and seemed out of place with regards to the rest of the film. I could have also enjoyed a bit more denouement and perhaps even an epilogue about Dorothy's reunion with her family. Three interesting notes: 1) The landscape of Oz in \"The Wiz\" actually does change after Dorothy intervenes to make a difference; this does not happen in \"The Wizard of Oz.\" 2) While Judy's visit to Oz seems to be concussion-induced, Diana actually appears to visit that fabled land, which is closer to the book. 3) \"The Wiz\" contains all four witches presented in the book; \"The Wizard of Oz\" only contains three. Though it seems rather dated today, \"The Wiz\" is still a fun movie to view, and it contains a number of known (Motown) celebrities."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Universal Pictures",
        "duration": "PT3M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2130051353",
        "name": "The Wiz",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjMxODgyYTItMzk1Mi00NGNlLTg3ZTctMjU0NzhjM2FiMWM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjMxODgyYTItMzk1Mi00NGNlLTg3ZTctMjU0NzhjM2FiMWM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:55:57Z",
        "url": "https://www.imdb.com/video/vi2130051353/"
    },
    "url": "/title/tt0078504/"
}