{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joel McCrea",
            "url": "/name/nm0566948/"
        },
        {
            "@type": "Person",
            "name": "Fay Wray",
            "url": "/name/nm0942039/"
        },
        {
            "@type": "Person",
            "name": "Leslie Banks",
            "url": "/name/nm0052203/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13043,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0760586/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041421/"
        },
        {
            "@type": "Person",
            "name": "James Ashmore Creelman",
            "url": "/name/nm0187256/"
        },
        {
            "@type": "Person",
            "name": "Richard Connell",
            "url": "/name/nm0175028/"
        }
    ],
    "datePublished": "1932-09-16",
    "description": "A psychotic big game hunter deliberately strands a luxury yacht on a remote island, where he begins to hunt its passengers for sport.",
    "director": [
        {
            "@type": "Person",
            "name": "Irving Pichel",
            "url": "/name/nm0681635/"
        },
        {
            "@type": "Person",
            "name": "Ernest B. Schoedsack",
            "url": "/name/nm0774325/"
        }
    ],
    "duration": "PT1H3M",
    "genre": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzU4MjYxMjI1N15BMl5BanBnXkFtZTgwNjk1NTAwMjE@._V1_.jpg",
    "keywords": "island,hunter,shipwreck,reef,hunting",
    "name": "The Most Dangerous Game",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CuriosityKilledShawn"
        },
        "dateCreated": "2000-06-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0023238/"
        },
        "name": "One of my fave (really old) movies",
        "reviewBody": "\"Until you've hunted men, you haven't hunted\" -Jesse Ventura, April 2001.\n\nThe story of a hunter having the tables turned on him is overly familiar to today's audiences. The basic premise of Richard Connell's short story \"The Most Dangerous Game\" has also been reinvented as a Game of Death, Run for the Sun, Hard Target, Surviving the Game, The Running Man, and even Predator (starring the Governor Ventura himself). But the irony and purity of the story are exercised best in this 1932 quickie, made by the King Kong team, using the same cast members and sets. It's legacy has been somewhat overshadowed by the popularity of Kong, but don't let it slip away, The Most Dangerous Game is a game worth playing.\n\nRobert Rainsford (Joel McCrea) is a big game hunter who is shipwrecked somewhere off the east coast of South America. He washes up on a beach of a lonely island and makes his way through the jungle where he is greeted by the eccentric Count Zaroff who has settled in a restored Portuguese fortress. The Count escaped Russia before the revolution and travelled the world hunting animals. But having killed all of the most savage he has grown bored and needs an animal with wits, cunning, and intelligence. Man; the most dangerous game of all.\n\nFinding his match with Rainsford, the Count releases him into the jungle, along with the screaming Eve Trowbridge (Fay Wray), and promises him freedom if he can survive the next 24 hours. The sets, the Gothic atmosphere, and even the loneliness creates a wonderful atmosphere. As one of the first \"talkies\" the film is backed-up by a score (in a time when music really had to carry wordless motion pictures) that really stands out to me for several reasons. It's certainly the earliest film I have seen with a recognizable melody and even goes as far as having the Count play the theme on his grand piano; a nice little in-joke. I never thought I'd recommend a score from a 1932 movie for being mysterious and action-packed but, if you excuse the pun, I suggest you hunt it down.\n\nAt 63 minutes the film doesn't outstay his welcome, but James Ashmore Creelman's screenplay was written as a film lasting no less than 85 minutes, so I'm curious to know what RKO Pictures cut out to keep the budget down.\n\nCriterion did a good job with the DVD, but the film desperately needs a full HD restoration. I suppose the original camera negative is gone, but a 4k master from a complete 35mm print is what this film needs. No nicks, no scratches, no missing frames. If The Most Dangerous Game doesn't get this an overlooked classic may be lost forever.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1389019161",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2Q3ZWZhMjgtNTRmNC00YjMxLThmNGItYmU1YWQ0MDc5YWY5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2Q3ZWZhMjgtNTRmNC00YjMxLThmNGItYmU1YWQ0MDc5YWY5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-21T16:40:24.774Z",
        "url": "https://www.imdb.com/video/vi1389019161/"
    },
    "url": "/title/tt0023238/"
}