{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Helmut Tausend",
            "url": "/name/nm0851553/"
        },
        {
            "@type": "Person",
            "name": "Marcel Verdier",
            "url": "/name/nm0893836/"
        },
        {
            "@type": "Person",
            "name": "Alexis Grave",
            "url": "/name/nm0336174/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3926,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "alternateName": "The Sorrow and the Pity",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0681457/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029520/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028284/"
        },
        {
            "@type": "Person",
            "name": "André Harris",
            "url": "/name/nm0364426/"
        },
        {
            "@type": "Person",
            "name": "Marcel Ophüls",
            "url": "/name/nm0649096/"
        }
    ],
    "datePublished": "1972-03-25",
    "description": "An in-depth exploration of the various reactions by the French people to the Vichy government's acceptance of Nazi invasion.",
    "director": [
        {
            "@type": "Person",
            "name": "Marcel Ophüls",
            "url": "/name/nm0649096/"
        }
    ],
    "duration": "PT4H11M",
    "genre": [
        "Documentary",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGJkYTdlMzctNjhhZi00Zjg4LTg0ODItNDUyY2M0ZGZiM2RhXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "nazi occupied country,maquis,french politician,interview,vichy government",
    "name": "Le chagrin et la pitié",
    "original_info": {
        "id": "The Sorrow and the Pity_1972",
        "name": "The Sorrow and the Pity",
        "year": "1972"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Masoo"
        },
        "dateCreated": "2002-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066904/"
        },
        "name": "The Greatest Documentary Film Ever Made",
        "reviewBody": "The Sorrow and the Pity is not only the greatest documentary film ever made, but also one of the greatest films of any kind. A straightforward description of the film seems to promise limitless boredom: more than four hours of talking-head interviews in at least three different languages, blended with old wartime footage and occasional clips from the likes of Maurice Chevalier. But Ophüls' mastery of film technique allows him to create a thinking-person's masterpiece from these seemingly mundane parts. He interviews people who experienced the Occupation (in the late 60s, when the film was being made, many of them were still alive). Some are famous \"big names\" of history, such as Pierre Mendes-France, imprisoned during the war, Premier of France later in life, and Sir Anthony Eden, a British prime minister in the mid-50s. But even these men are noteworthy more for their actions as \"regular\" folks than as statesmen, and the true \"stars\" of the movie are the various \"common men\" who tell their personal stories. The Grave brothers, for instance, local farmers who fought in the Resistance, are as far as one might get from Jean-Paul Belmondo, but their pleasure with life and their remembrances of friends and foes during the Occupation establish them as real life heroes.\n\nThirty years down the road, Ophüls' methodology is as interesting as the history he tells. Merely claiming that Ophüls had an argument seems to work against the surface of his film, for he disguises his point of view, his argument, behind the reminiscing of his interview subjects. The film is a classic of humanist culture in large part because Ophüls, in giving the people the chance to say their piece, apparently puts his faith in those people (and in the audience that watches them) to impart \"truth.\" However, the filmmaker is much cannier than this; he is not artless. The editing of the various perspectives in the movie allows the viewer to form conclusions of their own that don't always match those of the people who are doing the talking in the film. In fact, The Sorrow and the Pity makes great demands on the viewer, not just because of the film's length: Ophüls assumes you are processing the information he's providing, and so the film gets better as it progresses, with the viewer's attention being rewarded in direct correlation with the effort you put in.\n\nAnd Ophüls is himself the primary interviewer in the film; you don't often actually see him, but he's there, asking the questions, leading on his subjects and his audience, only partly hidden (visually and philosophically) from view. The movie might look easy; there are none of the showy flourishes of a Kubrick or Stone here (or of Max Ophüls, for that matter). But the viewer is advised to remember that Ophüls' guiding hand is always in the background, constructing the film's version of the truth just as the characters do in their stories.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Milestone",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2784624921",
        "name": "The Sorrow and the Pity",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGYwYzQ2MzgtYmE3My00NDQxLTk0YzAtNmEzOGZmNDMyM2VjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGYwYzQ2MzgtYmE3My00NDQxLTk0YzAtNmEzOGZmNDMyM2VjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:13:12Z",
        "url": "https://www.imdb.com/video/vi2784624921/"
    },
    "url": "/title/tt0066904/"
}