{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Karin Viard",
            "url": "/name/nm0895759/"
        },
        {
            "@type": "Person",
            "name": "Pierre-Loup Rajot",
            "url": "/name/nm0707466/"
        },
        {
            "@type": "Person",
            "name": "Catherine Frot",
            "url": "/name/nm0296594/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 632,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "The New Eve",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067852/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063732/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Person",
            "name": "Catherine Corsini",
            "url": "/name/nm0181117/"
        },
        {
            "@type": "Person",
            "name": "Marc Syrigas",
            "url": "/name/nm0843483/"
        },
        {
            "@type": "Person",
            "name": "Emmanuel Bourdieu",
            "url": "/name/nm0099802/"
        }
    ],
    "datePublished": "1999-01-27",
    "description": "Camille is having the time of her life, enjoying all that Paris' decadent nightlife has to offer a young single woman. She parties all night with sexual abandon, then stumbles home at dawn, hungover and ready to do it all over aga...",
    "director": [
        {
            "@type": "Person",
            "name": "Catherine Corsini",
            "url": "/name/nm0181117/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDQwM2M2MTMtYTkyMC00NzAzLWI0NjItOTFhODNmMDAyYzg4XkEyXkFqcGdeQXVyODgzNDIwODA@._V1_.jpg",
    "keywords": "f rated,title directed by female,sister in law sister in law relationship,scatterbrain,lesbian relationship",
    "name": "La nouvelle Ève",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Maxine-20"
        },
        "dateCreated": "2000-03-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0186397/"
        },
        "name": "7/10",
        "reviewBody": "Camille's story could be every woman's story and actually the main parts are played by women.Men are desired, missed, run after, dropped but it's the women who call the tune. If men seem useless it's only because Camille has to remain alone to acknowledge she needs someone to reach the happiness she's longing for. She needs to touch Eden and to lose it to keep it when met again. Before she succeeds her demands are strong even if not clearly defined but what is difficult to handle is the way society functions nowadays. Rules don't exist anymore and she has to make sense with a deconstructed and puzzling world : family doesn't exist anymore and in order to find a sort of equilibrium people get married, have children, are in politics, cling to real or occasional friends, use drug or forget themselves in a sexuality deprived of taboo. Indeed as they fail to be taboo sexual relationships become less attractive, deprived of desire . Camille is completely lost in this world she doesn't understand. The director succeeds in showing the life of this `new Eve' without making concessions but without judging her. Even when we could or do blame her for what she does, he manages to let her pain show in a very touching way. Moreover the way she throws herself into the fight makes her very likeable. Actually if the film was a success I think it's because she's a sort of French Bridget Jones and a lot of women can identify with her. Karine Viard is really wonderful in that role and makes of Camille a very endearing character. You really have to see that film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0186397/"
}