{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matthew Broderick",
            "url": "/name/nm0000111/"
        },
        {
            "@type": "Person",
            "name": "Neve Campbell",
            "url": "/name/nm0000117/"
        },
        {
            "@type": "Person",
            "name": "Andy Dick",
            "url": "/name/nm0004873/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 70643,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032298/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0092035/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060743/"
        },
        {
            "@type": "Person",
            "name": "Flip Kobler",
            "url": "/name/nm0462164/"
        },
        {
            "@type": "Person",
            "name": "Cindy Marcus",
            "url": "/name/nm0546083/"
        },
        {
            "@type": "Person",
            "name": "Jenny Wingfield",
            "url": "/name/nm0935053/"
        }
    ],
    "datePublished": "1998-10-27",
    "description": "Simba's daughter is the key to a resolution of a bitter feud between Simba's pride and the outcast pride led by the mate of Scar.",
    "director": [
        {
            "@type": "Person",
            "name": "Darrell Rooney",
            "url": "/name/nm0740311/"
        },
        {
            "@type": "Person",
            "name": "Rob LaDuca",
            "url": "/name/nm0480349/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTgxMWYwY2EtMGY4MS00MmRjLTg1MGQtMWU3MzgzMDA4ODQ2XkEyXkFqcGdeQXVyNjExODE1MDc@._V1_.jpg",
    "keywords": "timon character,pumbaa character,tomboy,interspecies friendship,simba character",
    "name": "The Lion King II: Simba's Pride",
    "original_info": {
        "id": "The Lion King II: Simba's Pride_1998",
        "name": "The Lion King II: Simba's Pride",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "travisimo"
        },
        "dateCreated": "2004-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120131/"
        },
        "name": "Not the Mightiest Lion",
        "reviewBody": "Being a big fan of the first Lion King, it would take a heck of a sequel to match my appreciation for the first flick. The Lion King II: Simba's Pride doesn't even come close in my eyes, but I don't think Disney was really shooting for that. The story is likeable enough with Simba's daughter, Kiara, growing up and trying to step out of Simba's shadow. She meets an outsider, Kovu who is some sort of descendant or handpicked successor of Simba's nemesis, Scar. Kiara and Kovu hit it off as young cubs but are told by Simba they can't see each other when Simba learns of Kovu's background. In a way it's kind of refreshing to see a flaw in our hero, Simba, as he holds a grudge against Kovu for something Kovu had absolutely no control over. Then again, I wondered where exactly these outside lions came from, as I don't recall seeing a glimpse of them at all in the first LK.\n\nAnyway, Kovu and Kiara grow up and fall in love and that stuff, but Kovu has been taught to hate Simba and the other Prideland lions. I'll stop there, but you get the sense of what the story is like. It's not groundbreaking material, but it's nice enough to keep you and/or the little ones interested. There are some flaws in LK2 that I just couldn't get over. The animation is obviously nowhere near that of the original as it was made from a much smaller budget. That's okay and all, as the story usually trumps visuals, but some effects like the fire scene were pretty bad. The fire just stood out like a sore thumb. I've seen better effects on David Letterman skits!\n\nMy next problem with the movie is the voice work. Most of it is done well by the original cast (Matthew Broderick, Nathan Lane, Ernie Sabella), but Rowan Atkinson is missed as the neurotic bird, Zazu. I also didn't like the actor who voiced Kovu, Jason Marsden. I don't dislike Jason Marsden personally, but he has done characters in the past that have just annoyed the crap out of me. I actually remember him as Eddie Munster in The Munsters Today. In the new version, Eddie becomes some sort of punk who rebels against his family. That's not the Eddie Munster I knew as a child. Furthermore, he also voiced Goofy's grownup son, Max, in The Goofy Movie. I liked Max when he was a kid in the TV series, Goof Troop, but as an adolescent, Max was just a whiny, selfish brat. So whenever I hear Jason Marsden's voice, I just get annoyed. It's my own issues, I know.\n\nNow for my last complaint, which is usually the same for any Disney sequel, the music is just not up to par with the original. Elton John and Tim Rice were desperately missed in this movie. Although I will say there was one song that was fairly good, Love Will Find a Way. It's a nice ballad that really can fit in with any Disney feature. It also sounded familiar to me, like maybe I've heard it on the radio. That is just something uncommon with Disney sequels.\n\nI know I've complained a lot, which is sort of hard for me to do, because I love The Lion King and Disney, but LK2 just isn't my type of flick. I'm very glad to see other reviewers enjoy it though. To each their own, I say!\n\nMy IMDb Rating: 5/10. My Yahoo! Grade: C+ (Flawed but Worthy)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Bonus Clip: Animating the Characters",
        "duration": "PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1953472793",
        "name": "The Lion King 2: Simba's Pride: Special Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWYyNDRhMzUtMTVmOS00MDJmLTlmY2QtM2NjOTNlOGJhNjJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWYyNDRhMzUtMTVmOS00MDJmLTlmY2QtM2NjOTNlOGJhNjJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-03-07T06:34:42Z",
        "url": "https://www.imdb.com/video/vi1953472793/"
    },
    "url": "/title/tt0120131/"
}