{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Boone",
            "url": "/name/nm0095524/"
        },
        {
            "@type": "Person",
            "name": "Toshirô Mifune",
            "url": "/name/nm0001536/"
        },
        {
            "@type": "Person",
            "name": "Mike Starr",
            "url": "/name/nm0823563/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 419,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093733/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0204463/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103496/"
        },
        {
            "@type": "Person",
            "name": "William Overgard",
            "url": "/name/nm0653857/"
        }
    ],
    "datePublished": "1981-06-19",
    "description": "A steel samurai blade that was to be given to the American ambassador by the Emperor of Japan is stolen. American sailors and Japanese samurai are sent to find it.",
    "director": [
        {
            "@type": "Person",
            "name": "Tsugunobu Kotani",
            "url": "/name/nm0467624/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Action",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDFiODk2MDYtNjM3Ni00NGU0LThmZGItOTkyY2RlZDkzMTFiXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "ninja,battle,sword,sword fight,swashbuckler",
    "name": "The Bushido Blade",
    "original_info": {
        "id": "The Bushido Blade_1979",
        "name": "The Bushido Blade",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Mark-129"
        },
        "dateCreated": "2005-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078918/"
        },
        "name": "A Very Dull Blade",
        "reviewBody": "Way back in 1980, I saw \"The Bushido Blade\" as a late night premiere on CBS. Much younger then, I was fairly impressed with the romance and action and the film was fondly remembered over the decades.\n\n25 years later, the film comes out in DVD and I had to get it.\n\nWell...\n\nMy disappointment was palpable. Richard Boone gives a loud, obnoxious performance as Commodore Matthew Perry, top billed James Earl Jones, while in fine voice and shape, only appears for about 2 minutes of screen time. The rugged Frank Converse comes off fairly well, but I can't understand why a Japanese actress was not cast as Tomoe instead of Laura Gemser. Sonny Chiba and Mako make good impressions, but something's not right when Mayumi Asano, playing Yuki, gives the best performance in the film. And this, with virtually no dialog. But, perhaps, that explains it right there.\n\nPoorly written by William Overgard, a Rankin-Bass in-house hack, the story, beginning with an offensive minstrel show, is about the search by American sailors for a stolen ceremonial samurai sword, meant as a gift for the President of the United States in 1854 Japan. The three Americans are aided in their search by noble samurai Chiba and half-caste warrior Gemser. What bothers me most is the lack of any texture in the story. Most scenes take place against utilitarian sets with no detail. The countryside, where most of what passes as action takes place, is flatly filmed. Worst of all, none of the local Japanese have any significant dialog, and surprisingly, have no involvement in the story, but, act only as background color for the three or four major characters. Very strange. I think there are less than 10 speaking roles and half of those are of the \"Yes, Sir. No, Sir\" variety from extras. \n\nAfter some disappointing samurai battle action over the sword against a lord and his poorly trained army of warriors...it just ends. You might be surprised by the suddenness of the fade out, but, that's all there is. I understand there is an alternate version running about 10 minutes longer, but, besides an extended ending, I can't imagine what might be missing or added to improve things. In retrospect, viewing the film after so many years brought back certain story reservations I had even as a youngster. Plot holes abound and the final fate of the sword and it's pursuers is not ironic as intended, but just leaves a bad taste in your mouth.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0078918/"
}