{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Courteney Cox",
            "url": "/name/nm0001073/"
        },
        {
            "@type": "Person",
            "name": "David Arquette",
            "url": "/name/nm0000274/"
        },
        {
            "@type": "Person",
            "name": "David James Elliott",
            "url": "/name/nm0004895/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1541,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017160/"
        },
        {
            "@type": "Person",
            "name": "Alison Balian",
            "url": "/name/nm0050198/"
        },
        {
            "@type": "Person",
            "name": "Joanna Johnson",
            "url": "/name/nm0425394/"
        }
    ],
    "datePublished": "2001-11-01",
    "description": "A young woman impersonates a shrink to win over her Prince Charming.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Benjamin",
            "url": "/name/nm0000907/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjMzZjE4OGItMjRiZC00ZTQxLWE2MDAtOTExMTBiMDczODY1XkEyXkFqcGdeQXVyMjM3NTU0NTQ@._V1_.jpg",
    "keywords": "breakup,dog,elevator,airplane,psychiatrist",
    "name": "The Shrink Is In",
    "original_info": {
        "id": "The Shrink Is In_2001",
        "name": "The Shrink Is In",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kelv-1"
        },
        "dateCreated": "2002-11-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0201394/"
        },
        "name": "An Incredibly Fun Movie",
        "reviewBody": "To me, 'The Shrink Is In' represented everything a flop had to offer. A newly wed couple doing a film together, a film that sits on the shelf for a couple of years then finding a copy of it at my local blockbuster. Surprisingly, it's a really great film worthy of repeat viewings. Everyone works hard in their roles and bring their all to it and it works! If it was released in cinemas, it could be a hugely succesful romantic comedy, I think. It has all the right ingredients too: A succesful TV star giving a great performance, her less known husband exceeding in his excellent role in every scene he's in, a strong suppoerting cast of unkown names but recognisable faces including Carol Kane, David James Elliot, Kimberley Davies and Viola Davis. The script and direction are impressive also, although both could have been improved on a little. I also felt that a lot was cut out of the script leaving a lot of loose ends to be tied. To be honest, I don't think you need a plot when the film itself is so much fun but, for those who care, the film is about Samantha (Courteney Cox), a good hearted girl who's been afraid of everything from elevators to crowded places after she was dumped by her boyfriend. When her shrink collapses, she privately takes up her jobonly to find herself getting romantically involved with a shy magazine salesman, Henry (David Arquette) while at the sametime being wooed by her neighbor who's in a relationship with french stoner bimbo who likes to be taken behind \"like a farm animal\". Not only that, but she's also illegally impersonating her shrink, something she knows won't end up good. Even more so when the real shrink, Dr. Rosenberg (Carol Kane) is starting to rehabilitate. This film is nothing but a good natured fun romp through this woman's romantic life and whileit may be predictable at times, it's just fun! All the actors seem to be having fun which keeps the film on a good tone throughout, excellent for repeat viewings. One great blink ands you miss it performance is Carol Kane as the shrink, especially in her breakdown scenes. The directing by Richard Benjamin works quite well even if he makes the occasional blunder here and there. The script is very enjoyable, but like I said I definitely think the film had a lot of stuff cut. Hopefully, when the filmmakers and public realise that a really great film is stuck nowhere, they will give it a special edition, with the deleted scenes."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi116654361",
        "name": "The Shrink Is In",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTYzOTg4MjktMTVmZC00NGNmLWFmZTYtNTQzMGEzNGEwNzQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTYzOTg4MjktMTVmZC00NGNmLWFmZTYtNTQzMGEzNGEwNzQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:48:13Z",
        "url": "https://www.imdb.com/video/vi116654361/"
    },
    "url": "/title/tt0201394/"
}