{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vincent D'Onofrio",
            "url": "/name/nm0000352/"
        },
        {
            "@type": "Person",
            "name": "Salma Hayek",
            "url": "/name/nm0000161/"
        },
        {
            "@type": "Person",
            "name": "Thomas Jane",
            "url": "/name/nm0005048/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1839,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063993/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001850/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027986/"
        },
        {
            "@type": "Person",
            "name": "James Still",
            "url": "/name/nm0830224/"
        }
    ],
    "datePublished": "1999-04-30",
    "description": "Ex porn star Valentino and Gary are in love with each other. But Valentino also has a girlfriend. Tragedy hits them, when Valentino collapses and is hospitalized with AIDS.",
    "director": [
        {
            "@type": "Person",
            "name": "Dan Ireland",
            "url": "/name/nm0006959/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4MDIzNjY2MF5BMl5BanBnXkFtZTcwNzY0MTUyMQ@@._V1_.jpg",
    "keywords": "grim reaper costume,dying,tears,hospital,punctuation in title",
    "name": "The Velocity of Gary",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "NJMoon"
        },
        "dateCreated": "1999-11-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120878/"
        },
        "name": "No Velocity - No Veracity",
        "reviewBody": "\"THE VELOCITY OF GARY\" starts out promising and quite cinematic with hunky Thomas Jane as daylight cowboy Gary (not his real name) showering in one of New York's open hydrants. Montage of Gary (n.h.r.n) in every cinematographer's NY tribute from Bowery to Brooklyn, which makes Gary (nhrn) one busy cruiser.\n\nNext up, Gary (nhrn) reluctantly comes to the aid of a young drag queen whose straight off the bus from one of the square states (swinging her suitcase and grinning as if she's just landed in the Greenwich Village of the musical \"Wonderful Town\" not the real-life scaresville of today) and is promptly set upon by gay bashers. Suffice it to say, the kid learns that interesting people do indeed live on Christopher Street.\n\n Unfortunately, this collection of downtown losers is of far more interest to themselves than us. Under-developed and preening constantly, they speak in bad poetic jargon (the film's stage roots showing terribly) and manage to grate on our nerves in a New York minute. Selma Hayek (real name) and Jane (real name) are both oddly drawn to super-loser bisexual idiot played by Vincent D'Onofrio (who should change his name after helping produce this mess). All need a haircut in the worst way, making their adventure look like a 60's flashback when it's anything but. Everything goes downhill after the first flash forward and never recovers.\n\n\"The Velocity of Gary\" is lacks both velocity and veracity. You're better off not having known their real names."
    },
    "url": "/title/tt0120878/"
}