{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbra Streisand",
            "url": "/name/nm0000659/"
        },
        {
            "@type": "Person",
            "name": "George Segal",
            "url": "/name/nm0001719/"
        },
        {
            "@type": "Person",
            "name": "Robert Klein",
            "url": "/name/nm0458951/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4091,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047780/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0141769/"
        },
        {
            "@type": "Person",
            "name": "Bill Manhoff",
            "url": "/name/nm0542337/"
        },
        {
            "@type": "Person",
            "name": "Buck Henry",
            "url": "/name/nm0377750/"
        }
    ],
    "datePublished": "1970-11-03",
    "description": "A stuffy author enters into an explosive relationship with his neighbor, a foul-mouthed, freewheeling prostitute.",
    "director": [
        {
            "@type": "Person",
            "name": "Herbert Ross",
            "url": "/name/nm0006889/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmZiNGEzZmItZWZkZS00NTViLWFhODYtNmJhNWRhYTcxYmIzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "prostitute,prostitution,sex comedy,based on play,porn actor in mainstream movie",
    "name": "The Owl and the Pussycat",
    "original_info": {
        "id": "The Owl and the Pussycat_1970",
        "name": "The Owl and the Pussycat",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KatMiss"
        },
        "dateCreated": "2002-07-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066195/"
        },
        "name": "BEST OF 1970 #10- a romantic comedy done right",
        "reviewBody": "TEN BEST OF 1970\n\n#10- The Owl and the Pussycat\n\nHerbert Ross' \"The Owl and the Pussycat\" is a prime of example of how to do a \"Battle of the Sexes\" romantic comedy right. Most modern romantic comedies are either drowning in their syrupy sentimentality (\"Serendipity\")or in crude hatred of one and/or both sexes (\"Tomcats\", \"Divine Secrets of the Ya-Ya Sisterhood\"). \n\nThe film stars Barbra Streisand as Doris, a part-time hooker/actress who doesn't go anywhere without her TV. George Segal plays Felix Sherman, a would-be writer whose life consists of writer's block and rejection slips. One fateful evening, Felix complains to the landlord about the constant noise coming from Doris' apartment. He goes to bed and is awakened by a loud knock. It's Doris, who was evicted from her apartment and has several bones to pick with Felix. It's the beginning of a battle that lasts for most of the film's 97 minute running time.\n\nWhat makes The Owl and the Pussycat such a standout film is the care that went into the production. Buck Henry has successfully transplanted Bill Manhoff's play from L.A. to New York and the film is better for it. New York is a much livelier town than L.A. and the city itself becomes a character that the others bounce off from. Herbert Ross proves he can handle comedy as well as he can handle musicals and choreography. His direction doesn't overwhelm the script and acting but compliments it in a way most people write off.\n\nOn paper, I suppose the Barbra Streisand-George Segal pairing doesn't look promising. But when you see the film, you will not think of more perfect casting. Streisand and Segal have good chemistry together and it makes some of the later events of the film more believable. Streisand has a gift for delivering brisk, snappy dialogue. Segal has a gift for being able to make his characters instantly likable. \n\nThe score is by Blood, Sweat and Tears. Made in between their second and third albums, the score doesn't feel like a time-filler throwaway. Dick Halligan's music fits the film like a well worn glove. I cannot imagine the movie without the music. It does like all good scores do, enhance the movie without giving it away. There is a mix-up in regards to the lyrics (credited to BS&T, but David Clayton-Thomas has said they were given to BS&T before the music was composed), but still, as sung by DC-T, the songs have a wonderful quality to them.\n\nAll people who even want to attempt a romantic comedy should watch \"The Owl and the Pussycat\". It shows how to make a movie like this without resorting to misogyny, chauvinism or drippy sentiment.\n\n**** out of 4 stars"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1115865113",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZThlYjZlYTMtM2EyZC00ODgwLTg4ZjgtMzQ2MmZmODE3NmY3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZThlYjZlYTMtM2EyZC00ODgwLTg4ZjgtMzQ2MmZmODE3NmY3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-03-31T01:36:53.046Z",
        "url": "https://www.imdb.com/video/vi1115865113/"
    },
    "url": "/title/tt0066195/"
}