{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eileen Walsh",
            "url": "/name/nm0909626/"
        },
        {
            "@type": "Person",
            "name": "Dorothy Duffy",
            "url": "/name/nm0240524/"
        },
        {
            "@type": "Person",
            "name": "Nora-Jane Noone",
            "url": "/name/nm1172901/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 27697,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026228/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104092/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0018776/"
        },
        {
            "@type": "Person",
            "name": "Peter Mullan",
            "url": "/name/nm0611932/"
        }
    ],
    "datePublished": "2003-08-29",
    "description": "Three young Irish women struggle to maintain their spirits while they endure dehumanizing abuse as inmates of a Magdalene Sisters Asylum.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Mullan",
            "url": "/name/nm0611932/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWExODI2ZjUtMTE2MS00NmRkLWJhYzYtYTkyMTFiMzEwMjkzXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "female full frontal nudity,irish,ireland,unwed pregnancy,unwed mother",
    "name": "The Magdalene Sisters",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Anonymous_Maxine"
        },
        "dateCreated": "2004-12-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0318411/"
        },
        "name": "The other, other kind of terrorism.",
        "reviewBody": "I inadvertently found myself watching a whole string of movies the other day about people being tortured or torturing themselves, without even looking for movies like that. I saw The Magdalene Sisters, Osama, and that IMAX film Everest, all in the same day, and was surprised at their similarities, particularly between the first two. The Magdalene Sisters and Osama are strikingly similar in that they are both about religious terrorism, specifically centered around women. Osama was a look at how the Taliban keeps women under tight control, not allowing them even the tiniest freedom (indeed, women could be arrested and severely punished for such crimes as walking alone in public or speaking to a man, even for such dangerous statements as, 'My father is sick.'), while The Magdalene Sisters is about the Catholic Church in Ireland in disturbingly recent times, severely punishing women as a result of what appears to be the Church's frothing and highly irrational fear of sex.\n\nThe film focuses on the plights of three women in particular, who have all committed 'crimes' of varying nature but who are all punished by being sent to the Magdalene laundry for an indefinite period of time. One girl, Rose, commits the greatest crime having a child out of wedlock, which neither of her parents will even look at. Interestingly, she had the child because an abortion would have been a sin. Bernadette makes the mortal mistake of flirting with boys outside the orphanage she lived in, and Margaret is raped at a family gathering by a cousin, only to be shipped off herself when she reports it to family members.\n\nAt the Magdalene laundry, the girls are subjected to psychological abuse and endless physical toil, all under the old theory that it will cleanse their souls. Some of the women that the three girls in question encounter as they enter the laundry have been there for decades, and they eventually figure out that the only way that they are ever going to get out of there is to escape. Bernadette is especially aware of this, and makes increasing efforts to escape, for which she is brutally punished.\n\nI am genuinely curious to know what path of logic leads people to believe that such practices in the name of religion can have any beneficial value. The Taliban has taken religious torture to its extreme, debasing themselves and their religion by performing unbelievably inhuman acts in the name of their God, and it appears that, while certainly not on the same level of cruelty, the Catholic Church has performed similar crimes against humanity. That the Catholic Church in Ireland promptly condemned the film is not surprising, but if such things are being committed under its name (and indeed continued being committed well into the late 1990s), I should think that the Church would at least allow the film to be shown so that people would be aware of such abuses, which tarnish the reputation of the Church. I believe that it would have been possible for the Church to defend its own validity while at the same time acknowledging abuses committed in its name, especially if the accusations of cruelty were untrue, although in this case they were not. Running, however, only makes you look guilty.\n\nThe Magdalene laundry is presided over by a nun who is simply evil. She is an elderly lady and generally soft-spoken, but this woman makes the wicked witch of the west look like a prancing schoolgirl. The viciousness of the rest of the Sisters of Mercy radiates off of this woman like some kind of sinister force, delicately but successfully walking the line between illustrating the harshness of a brutal religious regime and creating a movie monster. Her character is human, but she's not far from being a monster.\n\nIt's disheartening to see the things that people do in the name of religion, especially when the crimes are something as little as behaving like a normal person. There are natural and perfectly healthy behaviors that unfortunately are violations of arbitrary religious laws, which are subsequently punished with outlandish punishments like those seen in this movie. Religion is thrown into reverse, causing pain and suffering rather than offering an escape from it, shown in a modern setting that is so backwards that it could just as easily have taken place in the 1600s.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2278596121",
        "name": "The Magdalene Sisters",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzY4ODg5OTMtMzQxMi00OTdlLWE0OWItNjE1MjRiMGRkNmNkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzY4ODg5OTMtMzQxMi00OTdlLWE0OWItNjE1MjRiMGRkNmNkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:54:59Z",
        "url": "https://www.imdb.com/video/vi2278596121/"
    },
    "url": "/title/tt0318411/"
}