{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sacha Baron Cohen",
            "url": "/name/nm0056187/"
        },
        {
            "@type": "Person",
            "name": "Abe Mendel",
            "url": "/name/nm2576615/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3483,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103588/"
        },
        {
            "@type": "Person",
            "name": "Sacha Baron Cohen",
            "url": "/name/nm0056187/"
        }
    ],
    "datePublished": "2001-01-18",
    "description": "A series of reports by the ever enthusiastic Borat Karabzhanov, the Kazakhstani journalist.",
    "duration": "PT25M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGU1NjE0ZjItNjVjMS00YTJhLWFmNGQtYTNiYjRkMjIwMzg1XkEyXkFqcGdeQXVyNjM2NDIwMzQ@._V1_.jpg",
    "name": "The Best of Borat",
    "original_info": {
        "id": "The Best of Primetime Glick_2001",
        "name": "The Best of Primetime Glick",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "murrill001l"
        },
        "dateCreated": "2004-08-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0274367/"
        },
        "name": "Evaluation",
        "reviewBody": "The first time I saw the show 'Ali G' I wasn't too impressed. I myself thought that the whole fictional character impersonation scene was not really that funny. But just released in the U.K is 'The Borat Show', featuring scenes from two of the 3 impersonated stereotypes created and acted by Sacha Baron Cohen - Bruno the gay Austrian stylist, and Borat the Khazakstani T.V show presenter. In this particular show Borat tours the States and meets, interviews, and sometimes travels around with different people, ranging from deer hunters to politicans, and I warn you his scenes are not for the easily offended. I was in absolute hysterics. I have never ever seen an impression-based television show this funny. Borat's television show is strictly NOT for feminists, strict anti-racists, or people of firm religious beliefs. Lets just say the stereotypical way of life in Khazakstan is portrayed to be very very different from the traditional way of life of the Americans from Borat's point of view. Bearing in mind this man is not actually from Khazakstan, which probably distributes half of the shows comic genius. About 50% of the rest of the comic genius is supplied by the reactions of the people involved in the scenes. If you enjoy shows like Ashton Kutcher's 'PUNKD', you will love 'The Best of Borat', or the 'Borat Show'."
    },
    "url": "/title/tt0274367/"
}