{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Freeman",
            "url": "/name/nm0293509/"
        },
        {
            "@type": "Person",
            "name": "Yasiin Bey",
            "url": "/name/nm0080049/"
        },
        {
            "@type": "Person",
            "name": "Sam Rockwell",
            "url": "/name/nm0005377/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 201824,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031181/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136709/"
        },
        {
            "@type": "Person",
            "name": "Douglas Adams",
            "url": "/name/nm0010930/"
        },
        {
            "@type": "Person",
            "name": "Karey Kirkpatrick",
            "url": "/name/nm0456732/"
        }
    ],
    "datePublished": "2005-04-29",
    "description": "Mere seconds before the Earth is to be demolished by an alien construction crew, journeyman Arthur Dent is swept off the planet by his friend Ford Prefect, a researcher penning a new edition of \"The Hitchhiker's Guide to the Galaxy.\"",
    "director": [
        {
            "@type": "Person",
            "name": "Garth Jennings",
            "url": "/name/nm1134029/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Adventure",
        "Comedy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmU5MGU4MjctNjA2OC00N2FhLWFhNWQtMzQyMGI2ZmQ0Y2YyL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "snow adventure,hyperspace,robot,cow,norway",
    "name": "The Hitchhiker's Guide to the Galaxy",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "charlismorgan"
        },
        "dateCreated": "2005-04-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0371724/"
        },
        "name": "Don't Panic! Douglas Adams' legacy has been turned into a delicious acid-trip of a movie, featuring love, aliens and the answer to life, the universe and everything.",
        "reviewBody": "Douglas Adams turned his sci-fi phenomenon, The Hitchhiker's Guide to the Galaxy into a hit radio and TV series, a five-part trilogy of novels and a BAFTA-winning computer game, but complained making it into a movie was like \"trying to grill a steak by having a succession of people blow on it\". \n\nAfter a 20-year battle with Disney to get the film made - and a day after a planet was named after the story's protagonist Arthur Dent - Adams died of a heart attack. Fans rushed to their nearest webring to console each other when they discovered the bum-clenchingly great scripting responsibilities had been passed on to Karey Kirkpatrick, the brains behind fluffy kiddie flick, Chicken Run. \n\nTo make matters worse, Terry Gilliam and Jay Roach passed the honour of directing the film to Garth Jennings and Nick Goldsmith, two movie first-timers who made their livings as production duo Hammer & Tongs - the company behind music videos for REM, Supergrass and Pulp among others. \n\nBut Don't Panic! As Robbie Stamp, Adams' pal and the movie's executive producer, rightfully says, \"The cast and crew rose to the challenge and created the perfect tribute to Douglas.\"\n\nThe film carefully brings the story into the noughties without incurring the wrath of Hitchhiker fans, and adds enough smug nods in their direction to keep them happy. They will relish whispering to their unimpressed cinema neighbour, \"Look, Douglas Adams' face is in that shot\" or \"That's Marvin the Paranoid Android from the TV series.\" And for the uninitiated, there's an acid-trip of a movie featuring love, aliens and the answer to life, the universe and everything. \n\nA galaxy of stars were enlisted to bring the mind-boggling story to the big screen, including Martin Freeman, who reprises his superb Everyman role from The Office to play Arthur Dent, a tea-loving Londoner who becomes the last man from Earth, following its destruction to make way for a hyperspace bypass. \n\nMos Def proves not all hip-hop stars are fist-gnawingly embarrassing as actors, in his part as Ford Prefect, a revoltingly cool alien who accompanies Dent on his hitchhiking adventure around the universe.\n\nThe unspeakably delicious Zooey Deschanel provides the love story that was sadly lacking in Adams' script drafts. She plays Trillian, the last surviving humanoid female, who finds herself caught in an unsavoury love triangle between Dent and Zaphod Beeblebrox, the President of the Imperial Galactic Government and owner of three arms, two heads and one planet-sized ego. \n\nAnd if you've ever wondered what Freddie Mercury and George Bush's lovechild would be like (and frankly, who hasn't?) watch Sam Rockwell's extraordinary portrayal of Beeblebrox. As Rockwell testifies, \"I studied footage of US presidents and rockers for this role until I tasted blood.\"\n\nThe essential Britishness of the film is provided by the delectable Stephen Fry and Bill Nighy, who are more English than chips, awkward dinner parties and halitosis.\n\nWho better to voice The Guide, a book which contains all the knowledge in the universe, than bulging-brained Fry, who uses the perfect amount of middle-class haughtiness, irony and intelligence to narrate the delightfully complicated story.\n\nAnd Nighy can't fail as planet builder Slartibartfast (who, as every nerd knows, won an award for creating the twiddly bits around Norwegian fjords) because he based the world-weary alien on the nation's best-loved character, Bill Nighy.\n\nI almost missed out one character, insane religious leader Humma Kammula, a new character Adams wrote especially for John Malkovich. He is easily forgotten because despite his amusing dialogue, the special effects drown out his performance, preventing him from doing the honour justice.\n\nBut fans will forgive this small transgression, for the pleasure of seeing a beast of a movie which has defied the laws of the universe to make it onto the big screen.\n\nJennings and Goldsmith have proved that despite their movie virginity, the first time isn't always messy, awkward and disappointing, it can also be earth shattering, amusing and very, very satisfying.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Hitchhiker's Guide to the Galaxy (2005)",
        "duration": "PT2M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1099150873",
        "name": "The Hitchhiker's Guide to the Galaxy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjM5NDczOTg3OV5BMl5BanBnXkFtZTgwNjkzMTIyMDI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjM5NDczOTg3OV5BMl5BanBnXkFtZTgwNjkzMTIyMDI@._V1_.jpg",
        "uploadDate": "2016-10-04T05:19:38Z",
        "url": "https://www.imdb.com/video/vi1099150873/"
    },
    "url": "/title/tt0371724/"
}