{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Holden",
            "url": "/name/nm0000034/"
        },
        {
            "@type": "Person",
            "name": "Lilli Palmer",
            "url": "/name/nm0658339/"
        },
        {
            "@type": "Person",
            "name": "Hugh Griffith",
            "url": "/name/nm0341518/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2824,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0513195/"
        },
        {
            "@type": "Person",
            "name": "Alexander Klein",
            "url": "/name/nm0458643/"
        },
        {
            "@type": "Person",
            "name": "George Seaton",
            "url": "/name/nm0780833/"
        }
    ],
    "datePublished": "1962-07-02",
    "description": "Blacklisted in modern day WW2, a Swedish oil trader opts to assist British Allies, by means of infiltrating and surveying Nazi Germany.",
    "director": [
        {
            "@type": "Person",
            "name": "George Seaton",
            "url": "/name/nm0780833/"
        }
    ],
    "duration": "PT2H20M",
    "genre": [
        "Drama",
        "History",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTg1OWFjYzUtYTA2Ny00NDY1LTgzMTctZTNhNTZjYTlkZWZhL2ltYWdlXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "spy,copenhagen denmark,reference to adolf hitler,surveillance,city in ruins",
    "name": "The Counterfeit Traitor",
    "original_info": {
        "id": "The Counterfeit Traitor_1962",
        "name": "The Counterfeit Traitor",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "barnabyrudge"
        },
        "dateCreated": "2004-09-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0055871/"
        },
        "name": "Good, old-fashioned spy film, with impressive performances and plenty of real suspense.",
        "reviewBody": "Although unappealingly long - 140 minutes to be precise - The Counterfeit Traitor turns out to be an absorbing, disturbing and rather exciting wartime suspense film. It gives William Holden his second-best role of the '60s (surpassed only by his work in The Wild Bunch) and provides good subsidiary roles for Lilli Palmer, Hugh Griffith and Ernst Schroeder.\n\nHolden is terrific as a Swedish citizen born in the USA, named Eric Erickson. Erickson is a businessman trading oil from his Stockholm HQ during WWII. Many of his customers are Germans, and quite often he goes on business trips to war-torn Germany leaving the sanctuary of neutral Sweden behind. The British secret service approach him and plead for him to act as a spy, gathering sensitive information for them during his seemingly legitimate trips. Matters are complicated when Erickson meets fellow spy Marianne Mollendorf (Lilli Palmer), with whom he soon falls in love. His mission is seriously jeopardised when her spying antics are exposed, and she is seized by the Gestapo and taken away to be executed.\n\nThe film is well-made by ever-reliable director George Seaton. Seaton also wrote the screenplay, basing it on an Alexander Klein book, and he must be given credit for fashioning a thoroughly believable and suspenseful story. The film is shot on actual North European locations, and the use of real backdrops - as opposed to the usual studio lensing favoured by Hollywood in the early '60s - adds to the film's authentic flavour. Nowadays, the appeal of this kind of film is sadly limited, but if you have an affinity for this kind of stuff, then The Counterfeit Traitor is definitely a title worth tracking down.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0055871/"
}