{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Errol Flynn",
            "url": "/name/nm0001224/"
        },
        {
            "@type": "Person",
            "name": "Brenda Marshall",
            "url": "/name/nm0550782/"
        },
        {
            "@type": "Person",
            "name": "Claude Rains",
            "url": "/name/nm0001647/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10245,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Howard Koch",
            "url": "/name/nm0462321/"
        },
        {
            "@type": "Person",
            "name": "Seton I. Miller",
            "url": "/name/nm0589316/"
        }
    ],
    "datePublished": "1940-08-31",
    "description": "Geoffrey Thorpe, a buccaneer, is hired by Queen Elizabeth I to nag the Spanish Armada. The Armada is waiting for the attack on England and Thorpe surprises them with attacks on their galleons where he shows his skills on the sword.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Curtiz",
            "url": "/name/nm0002031/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Action",
        "Adventure",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWQ2NWM1OWUtMDU1Mi00MTRiLTlmYjItZDU5ZWQyODc2MzM4XkEyXkFqcGdeQXVyMTIzMzQ1ODg4._V1_.jpg",
    "keywords": "sword fight,spain,year 1585,king of spain,large map on wall",
    "name": "The Sea Hawk",
    "original_info": {
        "id": "The Sea Hawk_1940",
        "name": "The Sea Hawk",
        "year": "1940"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2006-02-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0033028/"
        },
        "name": "Errol at his best",
        "reviewBody": "My favorite Errol Flynn movie has always been The Sea Hawk. Flynn made this in 1940 at the height of his career. All it is missing is Flynn's usual screen partner in that period, Olivia DeHavilland.\n\nErrol Flynn plays the fictional privateer Geoffrey Thorpe who with the well known real characters like Drake, Frobisher, and Hawkins, raid the rich Spanish commerce from the New World which is what Europeans of the day were referring to the western hemisphere as. Queen Elizabeth of England gave all knowing wink to their activities and the realm took a cut of their loot.\n\nOne day Flynn attacks the ship carrying the Spanish ambassador Claude Rains and his niece Brenda Marshall who's English on her mother's side. That's it for Flynn.\n\nBut Queen Elizabeth has some traitors in her midst. The clever Lord Wolfingham played by Henry Daniell is in the Spanish pay. Daniell was one of the best screen villains ever. He was always a cold and calculating individual and had a voice with a built in sneer. He very cleverly deduces Flynn's future plans and lays a trap for him. See the film and find out, but suffice it to say Daniell is no fool.\n\nJack Warner saw that Flynn's films were always well scored musically. Flynn swashbuckled to some of the best film music ever composed. Here the composer is Erich Wolfgang Korngold, in other films with Warner Brothers, it's Max Steiner. Korngold's score isn't quite on par with the one he did for Robin Hood, but it's one you will not forget.\n\nThis was the last film Errol Flynn did with director Michael Curtiz. David Niven in his memoirs made of Curtiz a figure of some fun, he was the guy with the fractured English who uttered the memorable phrase that became Niven's title for his memoirs, 'bring on the empty horses.' Flynn in his memoirs hated him with a passion in that Curtiz put his players in some dangerous situations without regard for safety. After this he refused to work with him. But between them, Curtiz and Flynn did some grand entertainment. Curtiz later won an Oscar for directing Casablanca.\n\nFlora Robson repeats her role as Queen Elizabeth, she had previously portrayed Elizabeth in Fire Over England back in the old country. It's probably the part she's most identified with in her career.\n\nBrenda Marshall who is probably better known for being Mrs. William Holden, pinch hits for Olivia DeHavilland. Olivia was trying to get some better acting roles that she knew she could do and not be a crinolined heroine all the time. Jack Warner refused to see her as anything else for a long time. \n\nOthers in the cast who stand out are Alan Hale, Una O'Connor, Gilbert Roland and William Lundigan has a death scene that will haunt you for a long time.\n\nThe Sea Hawk is also a film that made use of a film process known as sepia tone. It's probably the film best known for it. The whole sequence of when Flynn sails his ship, the Albatross, to Panama is photographed in sepia tone. It makes the film come out a kind of brackish yellow. Since Warner Brothers didn't want to spring for full technicolor, this process is effective in demonstrating the jungle heat that Flynn and his men and the Spaniards for that matter operate under.\n\nIt is also no accident that this film was made in 1940 showing brave England refusing to buckle under to a tyrant from the European continent. Phillip II of Spain, played by Montagu Love, controlled a whole lot of the world's real estate at that point in time and wanted more. The meaning for the audiences of 1940 could not have been more clear.\n\nThe Sea Hawk is grand entertainment. In my humble opinion Errol Flynn's best film and one of the best of the swashbuckling genre.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this epic sea spectacle",
        "duration": "PT2M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4107273241",
        "name": "The Sea Hawk",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjhmZmNmMDktNzVkYS00NGE0LWI1MjAtYzEzZjExODMzMGRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjhmZmNmMDktNzVkYS00NGE0LWI1MjAtYzEzZjExODMzMGRkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T16:58:12Z",
        "url": "https://www.imdb.com/video/vi4107273241/"
    },
    "url": "/title/tt0033028/"
}