{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel Wu",
            "url": "/name/nm0943079/"
        },
        {
            "@type": "Person",
            "name": "Teresa Mak",
            "url": "/name/nm0538346/"
        },
        {
            "@type": "Person",
            "name": "Kong Sau Yam",
            "url": "/name/nm1234971/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 227,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "alternateName": "The Peeping",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0138015/"
        },
        {
            "@type": "Person",
            "name": "Jing Wong",
            "url": "/name/nm0939147/"
        }
    ],
    "description": "Private detective Calvin is hired to tape the sex life of a female politician Kwai Fung-Ming, but falls for her instead. He decides to help her counter-attack Law Sau-Nam, who is the mastermind to discredit Kwai.",
    "director": [
        {
            "@type": "Person",
            "name": "Marco Mak",
            "url": "/name/nm0156906/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYxMDc2MjExNV5BMl5BanBnXkFtZTcwOTEzNjIyMQ@@._V1_.jpg",
    "keywords": "lesbian,lesbianism,lesbian sex,kiss,detective",
    "name": "Tau kwai mou jeu",
    "original_info": {
        "id": "The Peeping_2002",
        "name": "The Peeping",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lor_"
        },
        "dateCreated": "2010-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0410433/"
        },
        "name": "Paging Andrew Stevens",
        "reviewBody": "An odd attempt at sanitized sleaze, this wimpy imitation of the popular Andrew Stevens/Shannon Tweed films of the early '90s is notable only for its throwback to the days when nude scenes were oh-so carefully unrevealing. It's a 90-minute teaseorama.\n\nDaniel Wu, of the brooding good looks, toplines as a self-divided surveillance expert in Hong Kong hired to go to Taiwan and get the video goods on a sexy femme politician. He brings along a trusty assistant and his girl friend Cindy.\n\nVery corny plot twists lead to an unexpected climax, which I won't spoil here, that represents the only genuine moment in the proceedings and is the sole reason to keep watching. Along the way there are endless simulated sex scenes, with the caveat that every single time one of the leading ladies gets naked she chastely covers up her breasts. This is the old '80s format where a local superstar like Annie Yip would make these sex films and proceed to cover up her nipples as if to dare the fans to figure out what she really looks like au naturel. At this late date, about 40 years after sexploitation films went routinely topless (beyond the mere Nudist Camp genre), the coy aspect of THE PEEPER is a drag. It's enough to get it rejected by Cinemax (whoa, that's quite an achievement).\n\nOther than the endless cheat, this one has promise for undiscriminating fans nostalgic for those far more explicit NIGHT EYES thrillers with Shannon and her sister."
    },
    "url": "/title/tt0410433/"
}