{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Duchovny",
            "url": "/name/nm0000141/"
        },
        {
            "@type": "Person",
            "name": "Gillian Anderson",
            "url": "/name/nm0000096/"
        },
        {
            "@type": "Person",
            "name": "Billy Connolly",
            "url": "/name/nm0175262/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 92400,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078377/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0241738/"
        },
        {
            "@type": "Person",
            "name": "Frank Spotnitz",
            "url": "/name/nm0819487/"
        },
        {
            "@type": "Person",
            "name": "Chris Carter",
            "url": "/name/nm0004810/"
        }
    ],
    "datePublished": "2008-07-25",
    "description": "Mulder and Scully are called back to duty by the FBI when a former priest claims to be receiving psychic visions pertaining to a kidnapped agent.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Carter",
            "url": "/name/nm0004810/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Crime",
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTk5MThhOTQtZTY5OC00MzgwLWE4MTctNTI4OGEwNjU3YTZjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "x files,fbi federal bureau of investigation,crossover,motor vehicle,car",
    "name": "The X Files: I Want to Believe",
    "original_info": {
        "id": "The X-Files: Season 1_2000",
        "name": "The X-Files: Season 1",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kimberly_ann"
        },
        "dateCreated": "2008-07-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0443701/"
        },
        "name": "Not as bad as people are making it out to be",
        "reviewBody": "Honestly, I thought this was a good film. I'll even go so far as to say a great film. I really think that Chris Carter, David Duchovny, and Gillian Anderson delivered what they had promised to. All along, throughout the post-production and press campaign we've been told that this is a creepy story with Mulder and Scully's relationship at its core. Well, that's what it is ... plain and simple. I really think that all the negativity and people's harsh reviews are from false and hyped up expectations of what this movie is supposed to be. If anything, you should just try to walk into the theatre with an open mind.\n\nBut I almost think some people who reviewed this film, saw a different film than I did ...\n\n1. I read a review in which the person said Gillian Anderson's acting was awful. That is false. It is quite the contrary. Gillian Anderson is probably one of the strongest aspects of this movie. Every time she's in a scene, you're captivated.\n\n2. I had read that Mulder and Scully don't show up in the film until 45 minutes into it. False. Scully appears in the 3rd scene - so what? no more than 7 minutes? - and Mulder directly follows.\n\n3. Someone complained about an irrelevant and torturously long scene where Mulder fills up his gas tank. This doesn't happen. He goes to a gas station, gets out of his car, and goes into a store.\n\n4. Lastly, it was rumored that the actors where flubbing up their lines all the time. Okay, even if they did, that wouldn't end up in the final film. Obviously they do multiple takes for a reason. The lines are solid.\n\nThis movie is not boring. The surprises are there. It may not be scary in a 'horror film' sort of way where things are jumping out at you every 2 seconds, but it is scary. The acting is amazing. Gillian Anderson on her own is a joy to watch, but when you put her in a scene with David it's either going to break your heart or melt it. The supporting cast won't let you down, and neither will the storyline. It's not paranormal in the sense of freaks and monsters, but religion and God. It's very much in the fashion of \"All Things\"; seeing the signs and following them. Finally, it is just excellently put together. Whoever edited this film did a phenomenal job! The inter-cutting and juxtaposition was out of this world.\n\nGIVE IT A CHANCE, FOLKS.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The X-Files: I Want To Believe (Reading The Script Exclusive)",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3535979545",
        "name": "The X-Files: I Want To Believe (Reading The Script Exclusive)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWI1Y2IwYmYtN2EzZi00Y2JlLTg1YmItNzZmNTlhNjg3NWJiXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWI1Y2IwYmYtN2EzZi00Y2JlLTg1YmItNzZmNTlhNjg3NWJiXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-03-03T19:07:11.576Z",
        "url": "https://www.imdb.com/video/vi3535979545/"
    },
    "url": "/title/tt0443701/"
}