{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Newman",
            "url": "/name/nm0000056/"
        },
        {
            "@type": "Person",
            "name": "Jackie Gleason",
            "url": "/name/nm0001276/"
        },
        {
            "@type": "Person",
            "name": "Piper Laurie",
            "url": "/name/nm0001453/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 83725,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043911/"
        },
        {
            "@type": "Person",
            "name": "Sidney Carroll",
            "url": "/name/nm0140987/"
        },
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        },
        {
            "@type": "Person",
            "name": "Walter Tevis",
            "url": "/name/nm0856677/"
        }
    ],
    "datePublished": "1961-09-25",
    "description": "An up-and-coming pool player plays a long-time champion in a single high-stakes match.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Drama",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTAwNGNlYWEtNDJlOC00NTE5LWJjNmQtMjExZDU2NDUyZTFlXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "playing pool,arrogance,pool cue case,death of girlfriend,insult",
    "name": "The Hustler",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2016-01-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054997/"
        },
        "name": "Some of the Best Acting You'll Ever See",
        "reviewBody": "The Hustler (1961) \n\n**** (out of 4) \n\n'Fast' Eddie Felson (Paul Newman) shows up to play the legendary Minnesota Fats (Jackie Gleason) in a game of pool and soon the hotshot realizes that there's more to winning than just talent. After some time off the hustler winds up with a woman (Piper Laurie) who suffers from alcohol abuse but even worse is when he teams up with a gambler (George C. Scott).\n\nRobert Rossen's THE HUSTLER is without question one of the greatest films of its type. Most people are connected to it because of its story of a hustler and the gambling aspect but there are some of the greatest performances you're ever going to see on display here as well as a pretty depressing look at losers. Throughout the movie Felson is constantly called a loser, which is a term that fits the majority of the characters in this rather grim, dark and depressing film.\n\nFor me the greatest thing here are the performances with Newman easily leading the way. It's easy to see why this is the film that turned Newman into a superstar. Up until this point he had played a fair share of troubled rebels but everything in him just came together for this role. He's certainly very believable as this young guy who can't seem to stay out of his own way when it comes to trouble. This is a very troubled character and the actor perfectly nails every aspect of it. Gleason will always be known as a comedic actor but he could nail drama when he needed and this is the perfect example. It certainly doesn't hurt that the two actors were also great pool players and this brings a real nature to the film.\n\nLaurie is rather heart-breaking in her role as the drunk and then you've got Scott playing one of the biggest snakes in film history. There's no question that his Burt character is one of the great villains in film history. Myron McCormick is excellent in his small role and then you've got a young Murray Hamilton. THE HUSTLER also benefits from some wonderful cinematography that perfectly captures this pool world. I mean, has there ever been a better example of why B&W is so great? Add in the terrific score and you've really got something special.\n\nTHE HUSTLER is a classic film that constantly gets better each time you view it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT3M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2475557145",
        "name": "The Hustler",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDg2YTMwMzktM2E5Zi00YjQ3LWI4OWMtYzE1NzI3ZWM5MjRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDg2YTMwMzktM2E5Zi00YjQ3LWI4OWMtYzE1NzI3ZWM5MjRlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:29:09Z",
        "url": "https://www.imdb.com/video/vi2475557145/"
    },
    "url": "/title/tt0054997/"
}