{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Myrna Loy",
            "url": "/name/nm0001485/"
        },
        {
            "@type": "Person",
            "name": "Dana Andrews",
            "url": "/name/nm0000763/"
        },
        {
            "@type": "Person",
            "name": "Fredric March",
            "url": "/name/nm0545298/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 66505,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016710/"
        },
        {
            "@type": "Person",
            "name": "Robert E. Sherwood",
            "url": "/name/nm0792845/"
        },
        {
            "@type": "Person",
            "name": "MacKinlay Kantor",
            "url": "/name/nm0437969/"
        }
    ],
    "datePublished": "1947-05-29",
    "description": "Three World War II veterans, two of them traumatized or disabled, return home to the American midwest to discover that they and their families have been irreparably changed.",
    "director": [
        {
            "@type": "Person",
            "name": "William Wyler",
            "url": "/name/nm0943758/"
        }
    ],
    "duration": "PT2H50M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2RmNTRjYzctODI4Ni00MzQyLWEyNTAtNjU0N2JkMTNhNjJkXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "readjusting to civilian life,world war two veteran,banker,speech,bombardier",
    "name": "The Best Years of Our Lives",
    "original_info": {
        "id": "The Best Years of Our Lives_1946",
        "name": "The Best Years of Our Lives",
        "year": "1946"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secondtake"
        },
        "dateCreated": "2010-10-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0036868/"
        },
        "name": "Highly structured but flawless and really moving drama about returning G.I.s",
        "reviewBody": "The Best Years of Our Lives (1946)\n\nThe whole point of this film when it was released still makes perfect sense today, though I'm sure it doesn't have the same impact it did in those first years after World War II ended. Returning servicemen, with all kinds of backgrounds before and during the war, hit a wall coming home: wives who no longer loved them, jobs that had dried up, a culture that was foreign to them and that found them, these men, to be foreign themselves.\n\nIt wasn't a crisis to take lightly. These were the guys who were drafted to fight the enemy, and in going overseas they lost some of the best years of their lives, if not their lives. The country knew its debt in the abstract, but it also knew it in sons and husbands who really did come home and who had to face it all. This movie was both a reckoning for the sake of national healing and a brilliant drama that would be beautifully pertinent and therefore successful. And what a success, then and now.\n\nThe consummate Hollywood director William Wyler shows in this fast, long movie just what a master he is at working the medium. With Gregg Toland at the camera, Wyler makes a highly fluid movie, visual and dramatic and weirdly highly efficient. With the three main plots interweaving and depending on each other, the drama (and melodrama) build but never beyond plausibility. Wyler knew his audience wouldn't put up with pandering or cheap mistakes. Casting Harold Russell as Homer, knowing the audience would hear about how Russell really was a soldier who lost both hands in the war, was a huge step toward creating both empathy and credibility. It even practices a key theme in the move--to go beyond your bounds to make a difference, to give these guys a break and help them assimilate.\n\nIt's interesting how singular this movie is, trying to show the truth in these kinds of situations. The other post-war films about army and navy men fall into two large and dominating categories--war films and film noir. And it is film noir that comes closest to getting at the problem of the G.I. not reintegrating well, making it a whole style, brooding and spilling over with violence. \"The Best Years of Our Lives\" has a highly controlled and even contrived plot structure, but it aims to be honest and representative. \n\nThat it's remarkable formally--the way it is shot and edited and acted, top to bottom--is not surprise, given the heights that Hollywood had reached by then, and given that Wyler is easily the slickest of them all, in the best sense. That the movie makes such beautiful sense and really works as a story, a moving and heartwarming story without undue sappiness, is a whole other kind of achievement. A terrific, rich, full-blooded, uncompromised movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from HBO Home Video",
        "duration": "PT1M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi730792217",
        "name": "The Best Years of Our Lives",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzJkNDkyNjMtNThhYS00ZjQwLWExYjctMTllMGM4NGIwOGM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzJkNDkyNjMtNThhYS00ZjQwLWExYjctMTllMGM4NGIwOGM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:31:50Z",
        "url": "https://www.imdb.com/video/vi730792217/"
    },
    "url": "/title/tt0036868/"
}