{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Holden",
            "url": "/name/nm0000034/"
        },
        {
            "@type": "Person",
            "name": "Nancy Kwan",
            "url": "/name/nm0477088/"
        },
        {
            "@type": "Person",
            "name": "Sylvia Syms",
            "url": "/name/nm0843401/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2629,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0143767/"
        },
        {
            "@type": "Person",
            "name": "Paul Osborn",
            "url": "/name/nm0651585/"
        },
        {
            "@type": "Person",
            "name": "Richard Mason",
            "url": "/name/nm0556922/"
        },
        {
            "@type": "Person",
            "name": "John Patrick",
            "url": "/name/nm0665875/"
        }
    ],
    "datePublished": "1961-01-25",
    "description": "A businessman moves to Hong Kong to pursue a career as an artist and falls in love with a prostitute he hires as a model.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Quine",
            "url": "/name/nm0703689/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmFjZmJlMzItMTJhMC00MmVjLWE3ZGYtN2Q0YWFkZjlhM2I5XkEyXkFqcGdeQXVyMzU4Nzk4MDI@._V1_.jpg",
    "keywords": "hong kong,interracial relationship,sailor,prostitute,based on novel",
    "name": "The World of Suzie Wong",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JamesHitchcock"
        },
        "dateCreated": "2011-02-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054483/"
        },
        "name": "More than a \"tart with a heart\" melodrama",
        "reviewBody": "\"The World of Suzie Wong\" was the second film in which William Holden plays an American who travels to Hong Kong and falls in love with a local girl; the first was \"Love is a Many Splendored Thing\" from five years earlier. The differences between the two films perhaps illustrate the way in which society was gradually changing as the fifties gave way to the sixties. In the earlier films the two principal characters, Mark Elliot and Han Suyin, are both middle-class professionals in their thirties. A film telling the story of their romance would therefore have been entirely uncontroversial were it not for the fact that Suyin is of mixed race, something which in 1955 was enough to make the film seem daringly controversial. (To soften the blow somewhat the character was played by a white actress, Jennifer Jones).\n\nHere Holden plays Robert Lomax, a middle-aged American architect who gives up his job and moves to Hong Kong in order to pursue his ambition to become a painter. (In Richard Mason's original novel, Lomax was British and considerably younger than the character portrayed here). His love interest is Mee Ling, alias Suzie Wong, a twenty-year-old prostitute from the notorious Wan Chai district. Unlike Han Suyin, Suzie is supposed to be of pure Chinese blood, although a mixed-race actress, Nancy Kwan, was cast in the role. The film deals with the problems posed to their relationship not only by differences in nationality but also by issues not explored in \"Love is a Many Splendored Thing\", namely differences in age, in social class and (most importantly) outlook.\n\nThis was Nancy Kwan's first film, and she makes a ravishingly beautiful and tender heroine. (She was only the second choice for the role, the first choice, France Nuyen, having been sacked, allegedly for putting on too much weight). Her inexperience as an actress does tend to show, but this did not prevent her from going on to become the second major Hollywood star of Chinese descent after Anna May Wong. Holden is better here than he was in \"Love is a Many Splendored Thing\", in which he made a rather uncharismatic hero.\n\nThe film was of course highly controversial in 1960, and remains so today, although for different reasons. We may no longer raise an eyebrow at films about prostitution or white-man-and-Asian-girl love stories, even if Hollywood prefers to steer clear of some other racial combinations, notably black-man-and-white-girl. \"The World of Suzie Wong\" has, however, been criticised for allegedly perpetuating the racist stereotype of the meek, submissive Oriental woman.\n\nThis is not, however, a criticism I would accept. To point out, as this film does, that some women in poor countries- and Hong Kong certainly counted as such in 1960- regard the idea of becoming the wife or mistress of a wealthy foreigner as the best way out of poverty is not a patronising racist stereotype but a regrettable statement of the economic facts of life. (For a time Suzie becomes the mistress of Ben Marlowe, a married British colonial official). Suzie does not act submissively because she is submissive by nature, but because she has been forced into prostitution by economic circumstances and because her clients expect submission from her. Much of the film's psychological drama arises from the efforts of the rather moralistic Lomax to realise this, and Suzie's efforts to realise that he is not just another Ben Marlowe, that he genuinely loves her and that she does not need to put on her submissive act with him. There have been \"tart with a heart\" films which have taken a much more patronising view of their heroines, but because these heroines have generally been white the films have not been criticised in the same way.\n\nThe film also gives us an interesting picture of Hong Kong at a key moment in its history. Before and immediately after the war it had been regarded as something of a backwater, and had the Nationalists won the Chinese Civil War it would doubtless have been returned to China much earlier. The Communist seizure of power, however, gave it a much greater strategic and economic importance to the West, and its population was boosted by the stream of refugees from Mao's regime, a stream which by 1960 had become a flood owing to political repression on the mainland and the famines which followed the so-called \"Great Leap Forward\". In the long run, of course, it was the entrepreneurial skills brought by these refugees which were to be responsible for Hong Kong's transformation into a dynamic, prosperous trading centre, but in the short run they added to the city's problems of poverty and overcrowding, shown in this film by the shanty-town in which Suzie is forced to live.\n\nMuch of the interest of \"The World of Suzie Wong\" is today historical, although it is still highly watchable as a moving love story between two people of very different backgrounds. It is more than a \"tart with a heart\" melodrama. It also has some pertinent points to make about colonialism and sexual exploitation. Although few colonies still remain, what it has to say on the latter subject is perhaps even more pertinent today than it was in the colonial era of fifty years ago. Then only a few colonial officials, businessmen and wealthy travellers could exploit women in this way; today the internet and cheap air travel have placed \"sex tourism\" and \"mail-order brides\" within the reach of many more. 7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT3M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2085535257",
        "name": "The World of Suzie Wong",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzBhYmIyMTAtYTdjZi00YjYwLWE3NDUtNzE0N2M3NzEwMTg4XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzBhYmIyMTAtYTdjZi00YjYwLWE3NDUtNzE0N2M3NzEwMTg4XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-29T17:02:29.507Z",
        "url": "https://www.imdb.com/video/vi2085535257/"
    },
    "url": "/title/tt0054483/"
}