{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lily Tomlin",
            "url": "/name/nm0005499/"
        },
        {
            "@type": "Person",
            "name": "Tony Curtis",
            "url": "/name/nm0000348/"
        },
        {
            "@type": "Person",
            "name": "Susie Bright",
            "url": "/name/nm0109192/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7193,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0706824/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0174795/"
        },
        {
            "@type": "Person",
            "name": "Vito Russo",
            "url": "/name/nm0751752/"
        },
        {
            "@type": "Person",
            "name": "Rob Epstein",
            "url": "/name/nm0258531/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Friedman",
            "url": "/name/nm0295243/"
        }
    ],
    "datePublished": "1996-03-15",
    "description": "A documentary surveying the various Hollywood screen depictions of homosexuals and the attitudes behind them throughout the history of North American film.",
    "director": [
        {
            "@type": "Person",
            "name": "Rob Epstein",
            "url": "/name/nm0258531/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Friedman",
            "url": "/name/nm0295243/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTAzZjQ1ZDktMmZlYS00MTMxLWI4ZWYtM2I0Mjg5OTQ1Y2IzXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "gay,homosexuality,homophobia,homosexual history,gay slur",
    "name": "The Celluloid Closet",
    "original_info": {
        "id": "The Celluloid Closet_1995",
        "name": "The Celluloid Closet",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Nic-8"
        },
        "dateCreated": "1998-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112651/"
        },
        "name": "Everyone should see this film.....every film lover especially so; every gay person definitely!",
        "reviewBody": "This is not a \"film\" in the traditional sense...perhaps\n\nThis is not a \"documentary\" in the traditional sense...probably\n\nWhat is it??\n\nThe Celluloid Closet is a comprehensive history of film - gay film, straight film, \"is she/isn't she?...\" film. Everything. It is the result of 10 years hard work - no-one (especially big film/tv studios) is keen to fund a 2 hour film on gay movie visibility, they're all too busy closetted away (often literally) making sure viewers won't be offended by their output...\n\nHowever the time, effort and sheer love that has gone into this is utterly evident and it may be a blessing in disguise that it took so very long. The film is based heavily on the late Vitto Russo's book of the same name. Russo was a film buff who catalogued in detail the visibility of gay and lesbian characters in cinema. He included film from across the globe and updated the book for the last time in the mid eighties (Parting Glances and My Beautiful Launderette having just been completed) before the explosion of new gay film of the last decade. The film takes the historical content of the book and uses the best editing *I* have ever seen to produce enlightening sequences on the treatment of gay people and issues. Although it only concentrates on Hollywood films, it has the advantage over the book in that it was right up to date at its time of completion.\n\nNot only does The Celluloid Closet use self-appointed gay films, it also takes enormous pleasure in covering those films we love and know as gay classics even though the tension is a subtle sub-plot often totally lost on a straight audience! Absolute treats are the celebrity comments (they will set a thousand conspiracy theories going in your head too!), better still is the input of relatively unknown behind-the-camera people, writers etc, who are at liberty to be far more honest about their views.\n\nThere are also clips from classics like Rebecca, Calamity Jane (the dykiest show on earth if you ask me!), Ben Hur, My Beautiful Launderette, Parting Glances.......etc etc.. Any film you can think of is probably there - if not then maybe you should write a sequel!\n\nDid you ever think that Laurel and Hardy were very cosy with each other? Did you think Mrs Danvers was a little forward going through Rebecca's undies? Did you explode at *that* kiss in Morroco? Have you always secretly thought The Hunger was a good movie? .............Well so did someone else. Quite a lot of someone elses - and some of them were the writers!\n\nThis is such a good film for too many reasons. I'd go as far as saying it's perfect film.\n\nIt has no characters/plot, etc but it shows the progress of gay visibility as one of the best stories there is. The people who made those movies are the cast. It is a film\n\nIt is informtive, funny, clever and revealing. It tells EVERYONE about their history and heritage. The general observations about film-watching apply to anyone. It's impressively detached and lets you draw your own interpretation. It's a documentary.\n\nYou will sit there thinking \"wow\" when it finishs. You will wonder how you view films - and how everyone else views them. It may even make you nostalgic for the days when closetted was the only option (and endless sex-scenes were impossible and forbidden so plot and dialogoue had to make do). You will think of omissions and ponder those included but it will get you thinking. That's the important part.\n\nIf this film doesn't make you want to go out and watch all your favourite movies plus all those featured in it then I'll be amazed!\n\n It may sound like it, but it's no chore to watch. It's a pleasure.\n\nIt's inspiring. wonderful. Ultimately uplifting. And you'll need to see it again.....and again....and again! ....oh yes! And kd lang sings \"Secret Love\" at the end! Wow!...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0112651/"
}