{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stephani Wells",
            "url": "/name/nm1997623/"
        },
        {
            "@type": "Person",
            "name": "Cory Nelson",
            "url": "/name/nm1999406/"
        },
        {
            "@type": "Person",
            "name": "Paul Gagné",
            "url": "/name/nm1278752/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 884,
        "ratingValue": 2.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0146031/"
        },
        {
            "@type": "Person",
            "name": "Paul Gagné",
            "url": "/name/nm1278752/"
        }
    ],
    "datePublished": "2005-06-28",
    "description": "Marty Sickle was accused of murdering a young girl inside the slaughterhouse where he lived. Soon after, four college kids brutally hung Marty in revenge.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Gagné",
            "url": "/name/nm1278752/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODk0MjZmNDctNGNkOC00YzZiLThhZDUtOGU2NWU0NGY5MmFiXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "sexploitation,teen slasher,co ed,female nudity,female full frontal nudity",
    "name": "The Slaughterhouse Massacre",
    "original_info": {
        "id": "The Slaughterhouse Massacre_2005",
        "name": "The Slaughterhouse Massacre",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "elkloc8ter"
        },
        "dateCreated": "2006-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0447448/"
        },
        "name": "Bad, Bad, Bad... At least it was consistent",
        "reviewBody": "First of all I had a really hard time giving this video a rating of one. Since there were no zero's I will have to suffer. Secondly, thanks to Lions Gate I have officially wasted good hard earned dough and 90 minutes out of my life. I wasn't going to dignify this film with a review at all, until I noticed their GLORIOUS CLAIM on the DVD box cover \"More frightening than The Texas Chainsaw Massacre\" - \"Independent Film Quarterly.\"\n\nNow, I'm not sure who it was over there at IFQ or should I say \"Lions Gate Affiliate\"... But the critic should be \"independently\" drawn and \"quartered\" for the cash exchanging hands in that deal. Although, I can say that the critic might be right in one respect. I was very frightening that anyone picked this film up for distribution and had the brass to put it on a rental shelf. I can forgive the bad acting, the bad effects, the bad sound and the over all bad direction of the film. After all it is a slasher film.\n\nI was a little lost at times in the story though, not because there was no real story to begin with. But, because they show a couple of the same shots over and over again throughout the film. So, I wasn't sure if my DVD player was having a fit because of the crap I put in it. Words to the filmmakers... Shoot coverage. I don't know might help in the future.\n\nAs for our Marty Sickle, I've been more frightened of the Telletubbies than I was of the comical sickle wielding Marty who was more annoying than scary. At least I can sort of understand what the telletubbies are saying. The effects in this film look like they were done on a second-generation etch-a-sketch. Eighty percent of this cast was pulled from the local strip club and the nudity and sex scenes were over the top and completely out of place in the story. At times I felt I was watching a really, really, really bad porn rather than just a really, really, really bad slasher film. At least get hot chicks if your going to go that route guys.\n\nThe audio in this picture is so terrible from bad mix levels that sixty-five percent of this video is completely inaudible. The acting was more than atrocious and the chase scenes in the slaughterhouse were comical to say the least, with four bumbling idiots running in circles from a corny run of the mill bad acting killer with... guess what?.... a sickle. Boy, the writer on this film must have felt so profound when he was pitching this. Oh wait, he must be profound. He wrote, directed, starred, and was a full time fluff girl on the set. I will however, say that the fake stuffed rat in the picture did a great job. I smell Oscar.\n\nIf you want to see scary, go into your kitchen, get out a dull butter knife and slit your own wrists with it. It's exactly what I wanted to do during this film. Congrats to the filmmakers and Lions Gate, you have added to the piles of crap the rest of us have to weed through to watch decent movies.\n\nHey, at least the DVD I returned to the rental shelves is now so scratched maybe they will just toss it... AVOID this film at all cost's.\n\nP.S. Note to filmmaker. Never put a fake claim on a DVD box cover. It just sets yourself up for bad comments.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0447448/"
}