{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stanley Tucci",
            "url": "/name/nm0001804/"
        },
        {
            "@type": "Person",
            "name": "Bridget Fonda",
            "url": "/name/nm0000403/"
        },
        {
            "@type": "Person",
            "name": "Giancarlo Giannini",
            "url": "/name/nm0316284/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 444,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046596/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006759/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005803/"
        },
        {
            "@type": "Person",
            "name": "Jeff Rothberg",
            "url": "/name/nm0745087/"
        },
        {
            "@type": "Person",
            "name": "George Zaloom",
            "url": "/name/nm0004043/"
        }
    ],
    "datePublished": "2003-02-11",
    "description": "On a mission to save his family's fireworks business, a man becomes distracted after he falls in love.",
    "director": [
        {
            "@type": "Person",
            "name": "George Zaloom",
            "url": "/name/nm0004043/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTI1MjYyNzctMTFmNS00ODU3LTkwYWEtMTc4M2E0ZmY4NDIzXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "independent film",
    "name": "The Whole Shebang",
    "original_info": {
        "id": "The Whole Shebang_2003",
        "name": "The Whole Shebang",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "inkblot11"
        },
        "dateCreated": "2017-02-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0219408/"
        },
        "name": "Truly lovely, funny and sweet; as Bridget Fonda's last film, she is great and so, so beautiful",
        "reviewBody": "In New Jersey, there are two well-established fireworks manufacturers. Family Bazzini, led by Pops (Giancarlo Giannini) concocts many innovative designs and has the whole family, including his wife Contessa (Talia Shire) working in their large shop. The other folks, the Zitos, are helmed by Tough Mama (Anna Maria Alberghetti) and a bevy of sons. Yet, the Zitos are always out to buy or steal recipes from the Bazzinni's, because they recognize that Pops is a superior inventor. Also, their financial position becomes more precarious when Pops Jr dies in a tragic accident at the shop, while having a clandestine affair. His widow, Val (Bridget Fonda), blonde and smart, is not Italian like the rest but totally committed to the family. Her only child, Bobby, refuses to speak after his dad's death. Aha, Mama Zito, sensing an opportunity, sends one of her sons to try and get Val out on a date, and, perhaps, get married in time. Yet, other things may throw her off kilter. Pops, still grieving and angry at this lost son, writes to his family back in Italy and begs for a creative cousin to come take his child's place. This Giovanni (Stanley Tucci), thwarted in love, has attempted clumsy suicide after suicide, with no luck. A strolling cafe violinist, he seizes on this new invitation to change his life. Once installed in family Bazzini, its obvious that Giovanni has eyes immediately for Val and that he may be able to bring young Bobby out of his traumatic silence. More importantly, with the Zitos breathing down their necks, can Giovanni provide the spark needed to invent the \"best\" fireworks in the region? This lovely, sweet, and funny film is a total treat. Yes, there may be some stereotypes of Italian Americans involved but weren't there some in other movies such as Moonstruck? The cast is wonderful, too, with Tucci transforming himself into a bumbling Italian while its so fabulous to see Giannini, Shire, and Alberghetti on screen. Most lovely of all is Fonda, who made this movie her last. She looks so beautiful as the blonde surrounded by brunettes and she gives a most touching and strong performance. In addition, the scenery, costumes, lively script and direction provide a most enjoyable film experience. Want to add a bit of fireworks to your life some future evening? Get The Whole Shebang and sparks will light up your sky.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "On a mission to save his family's fireworks business, a man becomes distracted after he falls in love.",
        "duration": "PT2M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1897906969",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWU0MTA2ZDYtYzA0ZC00NTA2LTljZTQtNWU0N2QzNDkzNjhlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWU0MTA2ZDYtYzA0ZC00NTA2LTljZTQtNWU0N2QzNDkzNjhlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-29T17:46:14.302Z",
        "url": "https://www.imdb.com/video/vi1897906969/"
    },
    "url": "/title/tt0219408/"
}