{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Cooper",
            "url": "/name/nm0000011/"
        },
        {
            "@type": "Person",
            "name": "Jean Arthur",
            "url": "/name/nm0000795/"
        },
        {
            "@type": "Person",
            "name": "James Ellison",
            "url": "/name/nm0255199/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2309,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Waldemar Young",
            "url": "/name/nm0950150/"
        },
        {
            "@type": "Person",
            "name": "Harold Lamb",
            "url": "/name/nm0482959/"
        },
        {
            "@type": "Person",
            "name": "Lynn Riggs",
            "url": "/name/nm0726704/"
        }
    ],
    "datePublished": "1936-11-16",
    "description": "Wild Bill Hickok attempts to stop an Indian uprising that was started by white gun-runners.",
    "director": [
        {
            "@type": "Person",
            "name": "Cecil B. DeMille",
            "url": "/name/nm0001124/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIyZWZhZDItMzA2ZC00ZWYwLWIzMzctNmE3Yzk1NjdjNGViXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "dakota territory,buffalo bill cody character,wild bill hickok character,calamity jane character,gun",
    "name": "The Plainsman",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Steffi_P"
        },
        "dateCreated": "2010-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0028108/"
        },
        "name": "\"Crookeder than a rattlesnake\"",
        "reviewBody": "There were not a lot of Westerns in the 1930s, at least not in the A-budget bracket. So why would that canny marketeer and bandwagon-hopper Cecil B. DeMille decide to make one in 1936? The answer is simple. After the failure of his few dramas in the early talkie period, he vowed to make only \"big\" pictures, and the Old West was simply another historical arena for grand heroic exploits, just like the crusades or the high seas.\n\nThis being DeMille, the idea seems to have been to do a kind of definitive take on the setting. Waldemar Young and Harold Lamb, DeMille's current hacks-du-jour, along with \"Oklahoma\" playwright Lynn Riggs have created a screenplay that is not so much a cliché-fest as a cosy, sanitised and highly anachronistic snapshot of Western mythology. So we get Wild Bill Hickok, Calamity Jane, Buffalo Bill and General Custer all cheerfully rubbing shoulders like an Old West version of The League of Extraordinary Gentlemen, and banding together against the common enemy (the injuns, of course). DeMille's penchant for historical accuracy may give the sets and costumes a look of authenticity, but does not extend as far as actually portraying Calamity as a drunken prostitute, and Hickok as a kind of 19th-century Lemmy from Motorhead.\n\nThe two leads may not look like their historical counterparts, but at least Gary Cooper and Jean Arthur have the rugged demeanour of frontierspeople. They are also good enough performers to do a decent job despite a lack of coaching from DeMille. But as is often the case, the most interesting players are the villains. Charles Bickford looks as if he was chiselled from the buttes of the plains themselves, and gives a performance comparable to Walter Huston's Trampas in the 1929 version of The Virginian. Victor Varconi, once a handsome lead man in the silents, now thanks to his accent and looks reduced to playing all manner of swarthy baddies, is compellingly menacing as Painted Horse. And finally a young Anthony Quinn makes a short but impressive appearance as a Cheyenne warrior, lending a degree of dignity to the natives that is woefully absent in the rest of the picture.\n\nDeMille himself though does not appear to have \"got\" the genre. Despite the title, we don't really get to see those plains, and there is none of the romance of the outdoor lifestyle that makes classic Westerns what they are. But looking at DeMille's style you can see he is not a fan of empty spaces. Bigness for him means fullness. He really goes to town on the steamboat boarding scene, conjuring up an image of lively bustle with people moving across the frame in layers receding in depth. This is a very effective way of making a place look crowded without having to place the camera too far back or hire out every extra on the books. In other scenes, such as the one where the townspeople threaten to tar and feather Jean Arthur he uses extras to build walls around the action, filling every spare space with people. Even in simpler scenes there tends to be a degree of complexity to the shot, like a classical painting that tries to cram every aspect of an idea onto the canvas. And DeMille's images are often beautiful in a painterly way, but still the lack of \"west\" on display stops this from feeling like a Western.\n\nThink of this then more as an adventure yarn than a horse opera. It may be silly as silly can be (my favourite daft moment is in the opening scene, when Abe Lincoln's wife bursts into a meeting to remind him he's going to be late for the theatre, followed by a doom-laden chord in the background score), but it is not bad as far as no-brainer entertainment goes. The action scenes are exciting and punchy, largely thanks to the dynamic editing of Anne Bauchens. This is by no means essential DeMille, and certainly not essential Cooper, but is good fun if you happen to catch it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Wild Bill Hickok attempts to stop an Indian uprising that was started by white gun-runners.",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1257751065",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzAyY2VmYTYtZjdjZC00ZTJhLThmNzItNmZmOWM1YTkwZDNkXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzAyY2VmYTYtZjdjZC00ZTJhLThmNzItNmZmOWM1YTkwZDNkXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-05-23T20:31:40.004Z",
        "url": "https://www.imdb.com/video/vi1257751065/"
    },
    "url": "/title/tt0028108/"
}