{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joan Allen",
            "url": "/name/nm0000260/"
        },
        {
            "@type": "Person",
            "name": "Kevin Costner",
            "url": "/name/nm0000126/"
        },
        {
            "@type": "Person",
            "name": "Erika Christensen",
            "url": "/name/nm0159776/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22447,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051264/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0114363/"
        },
        {
            "@type": "Person",
            "name": "Mike Binder",
            "url": "/name/nm0082802/"
        }
    ],
    "datePublished": "2005-04-01",
    "description": "When her husband unexpectedly disappears, a sharp-witted suburban wife and her daughters juggle their mom's romantic dilemmas and family dynamics.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Binder",
            "url": "/name/nm0082802/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIyODM2MzUzM15BMl5BanBnXkFtZTcwMDQ4MzgyMQ@@._V1_.jpg",
    "keywords": "spring the season,high on marijuana,drinking,baseball,anger",
    "name": "The Upside of Anger",
    "original_info": {
        "id": "The Upside of Anger_2005",
        "name": "The Upside of Anger",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gregorybnyc"
        },
        "dateCreated": "2005-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0365885/"
        },
        "name": "Costner's Gift to Joan Allen",
        "reviewBody": "I've always admired Kevin Costner's laconic screen presence, in BULL DURHAM, TIN CUP, even DANCES WITH WOLVES, JFK and PERFECT WORLD. Now no longer leading-man handsome, he's developed into a first- rate character actor, and as a washed-up, alcoholic ex-baseball player-turned radio talk-show host, Costner offers company and comfort to Joan Allen as a drinking buddy in the bittersweet THE UPSIDE OF ANGER. Mike Binder's superb film about an abandoned wife of four teenage girls should qualify as one of this year's best films. But because it was released so early, did only respectable business, and isn't a vehicle for an over-hyped box-office attraction on magazine covers now, it will probably only get the respect of word-of-mouth. I saw this engrossing, deeply wonderful film when it opened last winter, and made up my mind that I would have to have the DVD as soon as it became available. \n\nJoan Allen, as Terry Wolfmeyer dazzles us in a performance that is both comically and dramatically masterful as the drunken mother seemingly at war with her four beautiful daughters. Terry's rage over her husband's abandonment of her and their children, is a mean-spirited rebuke to her daughters, who try with great patience to survive their mother's theatrical bitterness. But mama has given them the gift of her humor, and I think it's what saves these girls. There's a look that Joan Allen gives when one of her daughters is doing exactly what she doesn't want them to be doing. What it is they are doing to upset their mother is always in doubt because she's never really making rational sense. She's only filtering her displeasure through the rheumy eyes of her last cocktail. There's a scene at the family dining room where Hadley, her eldest daughter (the ever fascinating Alica Witt, who should be starring in her own movies), announces she's pregnant with her second baby. Allen was none-to-happy that her daughter opted for marriage and motherhood over a career, and her beady- eyed stare at her daughter's latest announcement of her grand-motherhood is a comic masterpiece. But when Allen finally can no longer avoid facing her crippling anger, Allen breaks your heart. Having never had an outlet for her comic abilities, she's surprises you with her skill. That she walks this fine tightrope between both extremes says much for her talent as an actor. \n\nFinally back to Costner. Denny Davies might have been a dangerous character for Costner to revisit. Afterall, he's played washed up or played out sports characters before. His career has suffered a very precipitous fall following the media-created debacle of his so-called grandiose ego in WATERWORLD, and the opportunities have been few and far between since then. But Denny is a rich character any actor would love to sink their teeth into, and Costner embraces Denny's humanity with consummate ease. Discovering his neighbor has been abandoned by her husband, Denny offers to keep her company while they drink. They warily circle each other during these boozy afternoons of watching television, drinking and not saying much to each other. And when that changes, you see the transition from friend to lover mainly through the eyes of Denny. When she first proposes they sleep together, it's Denny who chickens out at the last minute. But as their relationship develops, you see Denny reach out to Terry's girls in a way that is sympathetic but also gives them room to accept and then love him in return. This is a terribly important test for Denny. So when the youngest of the girls finally asks him if he plans to marry Terry, Denny comes to understand that the girls have welcomed him into the family. Costner is sensational in this film, but he keeps it all so low-key, always keeping the focus on Allen's character, and he ends up giving her the film--and rightfully so, I think. This is a gift to Allen. Costner recognizes this, and I think the movie is all the better for his act of generosity. This is a performance that people will talk about for years to come. Like Jeff Bridges and Dennis Quaid, Costner is one of our best screen actors, and it's great to see him in a role that is truly worthy of his fine talent. \n\nEach of the daughter's is skillfully rendered by Erka Christensen, Evan Rachel Wood, Keri Russel and Alicia Witt. These young women look and act like siblings. Auteur Mike Binder has given himself a role as Denny's radio producer, who is romancing one of the daughters, much to her mother's disgust. He's funny, pathetic, and just a bit creepy as a Romeo with romantic ideas way above his station!\n\nBinder's fine script gives this ensemble film the ballast that keeps you laughing and crying. He's found the emotional core in these character's lives, and the pace of the film, which clocks in at just under two hours, provides a sense of completeness. \n\nUltimately it is Costner's generosity as an actor that so disarms the viewer. In every shot, Joan Allen's Terry is the riveting center, with Costner playing to her every moment without stealing attention away from her. That earns my whole- hearted respect. \n\nTHE UPSIDE OF ANGER should be seen and savored by anyone who cares deeply about moves with something to say about the human condition. Binder's adroit direction makes this a film to set beside TERMS OF ENDEARMENT, AS GOOD AS IT GETS, and Lasse Hallstrom's vastly underrated SOMETHING TO TALK ABOUT. Finally it's such a pleasure to see two pros such as Allen and Costner hit it right out of the park!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from New Line Cinema",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi855376153",
        "name": "The Upside of Anger",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmNhYWVjNDUtNDQwZC00MDFiLThkNWQtYjE4MTUzOWQ4NTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmNhYWVjNDUtNDQwZC00MDFiLThkNWQtYjE4MTUzOWQ4NTQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:18:31Z",
        "url": "https://www.imdb.com/video/vi855376153/"
    },
    "url": "/title/tt0365885/"
}