{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leehom Wang",
            "url": "/name/nm0910966/"
        },
        {
            "@type": "Person",
            "name": "Stephen Fung",
            "url": "/name/nm0298691/"
        },
        {
            "@type": "Person",
            "name": "Gigi Leung",
            "url": "/name/nm0504942/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 694,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "alternateName": "The Avenging Fist",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050080/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0239007/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0214790/"
        },
        {
            "@type": "Person",
            "name": "Sap Sam Chan",
            "url": "/name/nm1113644/"
        }
    ],
    "datePublished": "2001-12-07",
    "description": "A futuristic research compound develops a new police tool called the Power Glove. Supposedly, it gives the wearer incredible powers by letting him tap into the 'unused 80%' of his mental potential. It turns out that the glove also...",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Lau",
            "url": "/name/nm0490487/"
        },
        {
            "@type": "Person",
            "name": "Corey Yuen",
            "url": "/name/nm0477035/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Action",
        "Fantasy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc3MzQ0Mjc5N15BMl5BanBnXkFtZTgwOTg3ODQ5NjE@._V1_.jpg",
    "keywords": "superhero action,superhero fantasy,superhero sci fi,battle,martial arts",
    "name": "Kuen sun",
    "original_info": {
        "id": "The Avenging Fist_2001",
        "name": "The Avenging Fist",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Jordan-M"
        },
        "dateCreated": "2003-01-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0260136/"
        },
        "name": "\"Heyyy! One More!\"",
        "reviewBody": "\"The Avenging Fist\" is one of the many HK Special Effect movies to come out over the last few years. It stands out on its own points, though - like the fact that it takes place in the future as opposed to the present or past - which means that there's characters jumping around on flying cars and through neon lights.\n\nThe main focus of the story is that of Nova, an agressive young man who feels the need to fight (don't we all?) and is trying to get his hands on a \"Power Glove\" - not of the Nintendo variety - which increases the user's fighting ability considerably. Nova also has a father who disappeared during the development of the Power Glove, who left Nova records of a fighting style called, of all things, the \"Avenging Fists.\"\n\nAfter several events, Nova manages to obtain a power glove and proceeds to unleash serious adolescent justice upon faceless baddies. Of course, Nova can't do it all by himself - so a bartender/street fighter by the name of \"Iron Surfer\" comes into play.\n\nPersonally, I think the movie should've been about Iron Surfer (Stephen Fung). Not only does he look a lot more cool and intense than Nova, but he also doesn't have all of the family melodrama that's included in Nova's story. Iron Surfer's just a guy who wants to love a cute girl and beat the life out of anyone/thing that gets in his way... even a surprisingly well animated CG monster. Unfortunately, Iron Surfer just gets turned into a crutch for Nova to take on the main villain with.\n\nYuen Biao has a decent sized role in this movie, but I was wanting to see more of him. Perhaps there should be a prequel with him and Ekin Cheng (who has a cameo as a younger Sammo Hung) that better explains the origins of the prevalent power gloves/avenging fists... It's unlikely, though.\n\nRegardless, this movie very well accomplishes the SFX action spectacular it set out to be. You could go without seeing it and sleep comfortably at night, but if you're a sucker for these kinds of movies, give it a thorough viewing. \"The Avenging Fist\" is just fine."
    },
    "url": "/title/tt0260136/"
}