{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Phil Harris",
            "url": "/name/nm0365201/"
        },
        {
            "@type": "Person",
            "name": "Eva Gabor",
            "url": "/name/nm0001247/"
        },
        {
            "@type": "Person",
            "name": "Sterling Holloway",
            "url": "/name/nm0001359/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 107853,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "The Aristocats",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074039/"
        },
        {
            "@type": "Person",
            "name": "Larry Clemmons",
            "url": "/name/nm0166307/"
        },
        {
            "@type": "Person",
            "name": "Vance Gerry",
            "url": "/name/nm0314788/"
        },
        {
            "@type": "Person",
            "name": "Ken Anderson",
            "url": "/name/nm0027011/"
        }
    ],
    "datePublished": "1970-12-24",
    "description": "With the help of a smooth talking tomcat, a family of Parisian felines set to inherit a fortune from their owner try to make it back home after a jealous butler kidnaps them and leaves them in the country.",
    "director": [
        {
            "@type": "Person",
            "name": "Wolfgang Reitherman",
            "url": "/name/nm0718627/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU1MzM0MjcxMF5BMl5BanBnXkFtZTgwODQ0MzcxMTE@._V1_.jpg",
    "keywords": "1910s,butler,cat,animal protagonist,talking animal",
    "name": "The AristoCats",
    "original_info": {
        "id": "The Aristocats_1970",
        "name": "The Aristocats",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rapt0r_claw-1"
        },
        "dateCreated": "2004-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0065421/"
        },
        "name": "One of Disney's better features",
        "reviewBody": "The Aristocats is one of my favorite animated movies, but the comparisons between this movie and past Disney classics are reasonable. The dog napping plot of One Hundred and One Dalmatians is adapted to fit the catnapping plot of The Aristocats. O'Malley and Duchess are reconstructions of Lady and the Tramp at heart. But, as long as the end result is just as enjoyable as the past movies, why complain? No matter how the success was achieved, as long as it was achieved. \n\nThe plot is simple. Madame Adelaide Bonfamille is an old millionaires spinster in Paris, 1910. The only other people in her lonely life are her cat, Duchess, and her kittens, Toulouse, Marie and Berlioz, as well as the faithful butler, Edgar. When Madame's lawyer, Georges, comes over to make Madame's will, Edgar overhears her plans. She wants to leave all her belongings to her cats, and at the end of their lifespan, the vast sums of money will go to Edgar. Quite unreasonably, Edgar is infuriated, and drugs and catnaps the kittens and dumps them in the French countryside, miles from home. There they find Thomas O'Malley, an alley cat who helps them back home, mainly because of Duchess.\n\nThe characterization of O'Malley certainly doesn't seem to have been a problem. Voiced by Phil Harris (Baloo from The Jungle Book), he also acts like the lovable bear and even looks just like you would imagine Baloo to look like, were he transmogrified into a cat. His bunch of jazz cats, led by Scat Cat, are some of the more effective Disney cameo-players. My favorite was the long-haired, blonde English Cat (besides Scat Cat, the rest have no names but clearly distinct nationalities). Roquefort the house-mouse and Frou-Frou the horse have brief roles, but shine in these glimpses. Edgar isn't really the real Disney villain in that he is not evil...he is simply impatient. He is not cruel from the start--his only sin is impatience. If he hadn't known about the will, he would've taken care of the cats as if nothing had happened. One sees his point in a way--what would those cats DO with the money? Madame could have given her estate to Edgar, and the butler would never have abandoned the cats had they not been privileged more than himself. So I like Edgar, in some ways.\n\nThe story is a mix of other Disney classics. Besides Fantasia--which had NO plot--this was Disney's first shot at writing an original story for an animated feature, and even so they had to take shortcuts. Here are the main plot elements repeated: 1) Villain-pet naps-animals-for-personal-gain from One Hundred and One Dalmatians. 2) Pampered-pet-learns-of-life-on-streets-through-streetwise-friend from Lady and the Tramp. It also borrows a little bit from Chuck Jones and Abe Levitow's Gay Purr-ee (1962). The plot is berated for being too shallow, but I don't see how it can be with so many elements of faultless classics. Again, as in the first paragraph: If the audience enjoys a story, it doesn't matter how the story developed.\n\nThe animation, so often blasted for being lazy and flawed, can never be seen the same way by everyone. It's solely a matter of opinion. The animation isn't bad, like television cartoons: it's a different style, radically different from, say, Sleeping Beauty. If that great fairy tale were portrayed by such animation, it would be the greatest failure in history; the same way, the sketchy, loose, carefree style of The Aristocats is perfect to tell that kind of story with those characters. Sleeping Beauty needed to be immaculate, as near to photography as could be; The Aristocats is the most cartoony of Disney animated features.\n\nThe Aristocats will always have an advantage over many films in my book. It was one of the few movies my dad saw in theater, so I was exposed to it more than several other movies. Besides that, it has always been one of Disney's more enjoyable features, more fun than most. It doesn't aim for the realism and drama of Bambi. It's just wholesome entertainment.\n\n9/10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT Trailer for The Aristocats: Special Edition",
        "duration": "PT49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1521460505",
        "name": "The Aristocats: Special Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWYwZmQ2NDMtNTFjZi00ZjI2LTk0NGQtMjkxMzFjZmJkMWFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWYwZmQ2NDMtNTFjZi00ZjI2LTk0NGQtMjkxMzFjZmJkMWFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-07-12T03:43:01Z",
        "url": "https://www.imdb.com/video/vi1521460505/"
    },
    "url": "/title/tt0065421/"
}