{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Misa Shimizu",
            "url": "/name/nm0793679/"
        },
        {
            "@type": "Person",
            "name": "Nagiko Tôno",
            "url": "/name/nm0867392/"
        },
        {
            "@type": "Person",
            "name": "Masatoshi Nagase",
            "url": "/name/nm0619185/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1572,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "The Sea Is Watching",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0337584/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0338255/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0337730/"
        },
        {
            "@type": "Person",
            "name": "Kei Kumai",
            "url": "/name/nm0474743/"
        },
        {
            "@type": "Person",
            "name": "Akira Kurosawa",
            "url": "/name/nm0000041/"
        },
        {
            "@type": "Person",
            "name": "Shûgorô Yamamoto",
            "url": "/name/nm0945491/"
        }
    ],
    "datePublished": "2002-07-27",
    "description": "19th century. Oshin is a prostitute in a brothel of a red-light district. A disgraced samurai, Fusanosuke, rushes in the brothel seeking for a refuge, because he had wounded a powerful samurai. Oshin hides him from the authorities...",
    "director": [
        {
            "@type": "Person",
            "name": "Kei Kumai",
            "url": "/name/nm0474743/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Romance",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmRhM2IyNmUtZjBhMy00NGMyLWIwMDMtYjBiYzc5MjEyOWJhXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "prostitute,brothel,samurai,rescue,flood",
    "name": "Umi wa miteita",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gradyharp"
        },
        "dateCreated": "2005-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0316829/"
        },
        "name": "In Memoriam: Akira Kurasawa",
        "reviewBody": "'Umi wa miteita' ('The Sea is Watching') was Akira Kurasawa's swansong to film: his adaptation of his favored novelist Shugoro Yamamoto's story into a screenplay he intended to film was his final mark he left on a brilliant career. Director Kei Kumai pays homage to both Kurosawa and Yamamoto in presenting this visually stunning transformation of word to image.\n\nSet in 19th century Japan, the story explores the lives of the women of a Geisha house whose sole purpose in life is to earn money by pleasuring men. The house is run by an older couple who are genteel and the geishas are an enchanting group of women who know their trade and take pride in their careers. Each has a reason for turning to the life of geisha. Oshin (Nagiko Tono) supports her family who live in a neighboring village, Kikuno (Misa Shimizu) has customers both good and evil whom she manages to sustain with her stories of her higher caste. Oshin befriends an endangered samurai, falls in love with the gentle fellow, only to find that he must not marry out of his caste and leaves his pleasures with Oshin to marry his promised betrothed. Oshin's heart bruises easily but is always supported emotionally and physically/monetarily by Kikuno and the other geishas.\n\nA handsome samurai Ryosuke (Masatoshi Nagase) enters Oshin's life and develops the first trusted and devoted relationship with her. Kikuno is beset by problems, deciding whether to accept the humble love of an old man who wishes to marry her, and coping with a rich but abusive customer. All the while the sea is watching and as a typhoon destroys the geisha house and street, Oshin and Kikuno sit atop the roof waiting for the promised rescue by Ryosuke. The manner in which the story ends is one of sacrifice, love, and devotion. The sea is watching and will find protection for true love.\n\nThe photography by Kazuo Okuhara is breathtakingly beautiful: night scenes with glowing lanterns and colorful geisha interiors are matched with recurring glimpses of the sea both calm and turbulent. The acting is a bit strained for Edo art, but the characters are well created and keep the story credible. The one distraction which is definitely NOT something Kurosawa would have condoned is the tacky Western music score that sounds like cheap soap opera filler except for the isolated moments when real Japanese music on authentic instruments graces the track. But in the end there is enough of Kurosawa's influence to imbue this film with his brand of dreamlike wonder that will always maintain his importance on world cinema. Grady Harp",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "aka Umi wa miteita",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3908632857",
        "name": "The Sea Is Watching",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODViMzY0ZWEtOWE2Yi00NWY4LWIzMTAtZTQxYzdlOWVhZTFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODViMzY0ZWEtOWE2Yi00NWY4LWIzMTAtZTQxYzdlOWVhZTFmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:10:01Z",
        "url": "https://www.imdb.com/video/vi3908632857/"
    },
    "url": "/title/tt0316829/"
}