{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bill Pullman",
            "url": "/name/nm0000597/"
        },
        {
            "@type": "Person",
            "name": "Cathy Tyson",
            "url": "/name/nm0879154/"
        },
        {
            "@type": "Person",
            "name": "Zakes Mokae",
            "url": "/name/nm0596310/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26478,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Wade Davis",
            "url": "/name/nm0205634/"
        },
        {
            "@type": "Person",
            "name": "Richard Maxwell",
            "url": "/name/nm0561802/"
        },
        {
            "@type": "Person",
            "name": "Adam Rodman",
            "url": "/name/nm0800834/"
        }
    ],
    "datePublished": "1988-02-05",
    "description": "An anthropologist goes to Haiti after hearing rumors about a drug used by black magic practitioners to turn people into zombies.",
    "director": [
        {
            "@type": "Person",
            "name": "Wes Craven",
            "url": "/name/nm0000127/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjEzZjdjMzMtMGM5Mi00Y2JmLWFjYTEtYjcxNjA3NjdkNGQ3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "haiti,voodoo,haitian voodoo,ritual,surrealism",
    "name": "The Serpent and the Rainbow",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gavin6942"
        },
        "dateCreated": "2010-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096071/"
        },
        "name": "A Lesser Known Wes Craven Film, But not a Bad One",
        "reviewBody": "A researcher (Bill Pullman) goes to Haiti in order to find a \"zombie drug\" that can give someone the appearance of death, when in actuality their body is at its lowest functioning. They may not breathe, or bleed, but they are not truly dead. The researcher and the company he works for hope to use it as an anesthetic.\n\nThe film started as a book of the same name by anthropologist Wade Davis, who is probably the world's authority on voodoo and zombies. Discussions were made to have Peter Weir direct and/or Mel Gibson star, but obviously this never happened. The script found its way to Wes Craven, and Bill Pullman (at that point a young rising star) was given the lead.\n\nAuthor Wade Davis was on set from the very beginning and wanted to make the best film he could regardless of who the director would be. He notoriously did not like the way it went, and Bill Pullman says that both he (Pullman) and Wes Craven were disappointed, too, because they wanted a more serious angle and the studio (Universal) was pushing for a horror story. In retrospect, Davis seems to have become more accepting of the film and does not hold it against Craven. In fact, he praises many of the scenes for their authenticity, especially in comparison to other attempts at making voodoo films.\n\nThe filming took place throughout 1987, and the political tensions were getting nasty in Haiti. Dictator Jean-Claude \"Baby Doc\" Duvalier becomes part of the plot, which makes this not just an anthropological horror film, but a political one, too. If people are able to look past the horror aspects, there is actually an important cultural document here.\n\nWhile the film is quite interesting for a variety of reasons, it starts off slow, and does not really pick up until the second half. Bill Pullman's character is the only one you are going to get to know from this film, and the only character who gets a lot of development. The natives seem very flat, and most just come across as wanting to kill Pullman. In a way, this makes sense, because this story is essentially told from his point of view. \n\nBill Pullman reflected years later, \"I don't think any other movie I've done is as adventurous as this one.\" He did most of his own stunts, met with real voodoo priests and took part in a variety of activities that may not be your typical Hollywood situation. One scene was filmed in an actual Dominican grave. He confirms that writer Richard Maxwell had to be admitted to an asylum after consulting with a voodoo priest.\n\nFans of Craven ought to check this one out. It does not have the in-your-face slasher horror of Craven's \"Nightmare on Elm Street\", \"Scream\" or \"Last House on the Left\". But it is not intended to be. This is a film built on atmosphere, and in many ways a horror more realistic than any he had ever done before.\n\nAs always, the must-have version was released by the fine folks at Scream Factory. Those interested in the movie will have to watch the 25-minute \"making of\", which has interviews with cinematographer John Lindley, the father-son special effects team of Lance and Dave Anderson, Wade Davis, and some re-used audio from Pullman.\n\nThe audio commentary is disappointing. On the one hand, it is the first time the film has had a commentary track, so credit must be given to Scream Factory for giving the disc the attention that past companies (specifically Image and Universal) failed to do. But the commentary with Bill Pullman only goes halfway through the film, with no one left to take his place. The real tragedy is in the passing of Wes Craven (the disc is dedicated to him), who could have offered more insight. \n\nThere will undoubtedly never be a better release of this essential Wes Craven film... unless someone manages to convince Bill Pullman to hand over all the vacation footage he shot with his wife on set!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this thriller directed by Wes Craven",
        "duration": "PT1M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3782412057",
        "name": "The Serpent and the Rainbow",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2JmZDExZTAtY2JmYS00NTNlLWE2MGYtMjdhYWE2NGIwYzMyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2JmZDExZTAtY2JmYS00NTNlLWE2MGYtMjdhYWE2NGIwYzMyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T16:10:11Z",
        "url": "https://www.imdb.com/video/vi3782412057/"
    },
    "url": "/title/tt0096071/"
}