{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shirley Stoler",
            "url": "/name/nm0831471/"
        },
        {
            "@type": "Person",
            "name": "Tony Lo Bianco",
            "url": "/name/nm0516215/"
        },
        {
            "@type": "Person",
            "name": "Mary Jane Higby",
            "url": "/name/nm0383275/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5489,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0790944/"
        },
        {
            "@type": "Person",
            "name": "Leonard Kastle",
            "url": "/name/nm0440980/"
        }
    ],
    "datePublished": "1970-02-04",
    "description": "An obese, embittered nurse doesn't mind if her toupee-wearing boyfriend romances and fleeces other women, as long as he takes her along on his con jobs.",
    "director": [
        {
            "@type": "Person",
            "name": "Leonard Kastle",
            "url": "/name/nm0440980/"
        },
        {
            "@type": "Person",
            "name": "Martin Scorsese",
            "url": "/name/nm0000217/"
        },
        {
            "@type": "Person",
            "name": "Donald Volkman",
            "url": "/name/nm0901485/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTliYmQ5MWMtYzU1Ny00ZWIyLThmZDgtNTRiYTk4ODIwOWY3XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "female serial killer,spinster,writing a letter,valentine's day,loneliness",
    "name": "The Honeymoon Killers",
    "original_info": {
        "id": "The Honeymoon Killers_1970",
        "name": "The Honeymoon Killers",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rmax304823"
        },
        "dateCreated": "2002-12-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064437/"
        },
        "name": "Shocking Degeneracy",
        "reviewBody": "I went downtown to see some widescreen extravaganza at a Duplex Cinema and when I bought my ticket realized I'd been standing in the wrong line. (The story of my life.) Instead of seeing some technicolorama epic I wound up seeing this, a cheap black-and-white true crime story.\n\nWell, felix culpa! I emerged shocked. At the time of its release there was nothing quite like it. Two small-time murdering cons deeply in love with one another in some twisted kind of way. Balding, overacting Tony Lo Bianco. Plumply menacing battleaxe of a nurse, Shirley Stoler. The photography is grainy and primitive. Indoor lamps don't simply cast light -- they glare. The movie's idea of a proper family home looks like something that might be owned by a worker in the Pabst Brewery in Newark. \n\nLo Bianco as Ray is a minor Latin con type, adroit with lonely women, while Stoler, as Martha Beck (great name) is the passionate one, filled with jealousy and rage. I don't know if the victims were supposed to be seen as somehow contemptible, what with their obtuseness and whining, but we never forget that we're dealing with human beings here. The first murder is relatively genteel. Death on a bus follows a poisoning. The next is bone-chilling. To appreciate the shock value of the violence a viewer needs to remember that this was filmed before all the extended gore and homicides we see now in movies like \"Henry: Portrait of a Serial Killer,\" \"Atlantic City,\" and \"Torn Curtain.\"\n\nPreviously, when the victim was whacked hard on the head with a claw hammer, he or she slumped forward, decorously dead. Not here. As in \"The Assassination of Trotsky,\" the victim is momentarily stunned, then recovers screaming. The second homicide involves the only use of a directorial touch unusual enough to draw attention to itself. The victim is lying on her back in bed while her two attackers discuss the best way to murder her. The camera concentrates on her uncomprehending and frightened eyes flicking from side to side, then a sharp pan to a pistol pressed against her head, and the sound of a shot. (A contemporary review of the film criticized one of the scenes because we could hear Ray urinating into the toilet bowl offscreen.) \n\nThe last duet of murders exceeds the limits of any sympathy we might have felt towards the lovers. Ray has promised Martha that he's not going to boff the last victim, whereas, it is revealed, he's been unfaithful -- to Martha, that is. Well, that's enough for Martha. After disposing of both her last rival and child she drops the dime on the two of them. If she can't own Ray exclusively then no one's going to have a piece of him. Ray writes her a love letter in jail. His ability to forgive is almost religious in its magnitude. Either that or he just can't stop telling lies. \n\nThis is a true story, and it has the digressions and non sequiturs we find in a real-life script. People get into unexpected and awkward arguments that are accidentally heard offscreen. Ray's sleep is constantly interrupted by Martha arguing with a victim in the next bedroom. The fact that this is based on real events make it all the more scary. Skip Freddy and the rest if you want to be scared out of your wits. Catch this instead.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1405796377",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2RhN2IzYzgtM2UyMi00MmZhLWJjZDYtYzQxYTdkYmRiYzJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2RhN2IzYzgtM2UyMi00MmZhLWJjZDYtYzQxYTdkYmRiYzJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-21T16:40:28.512Z",
        "url": "https://www.imdb.com/video/vi1405796377/"
    },
    "url": "/title/tt0064437/"
}