{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rider Strong",
            "url": "/name/nm0835045/"
        },
        {
            "@type": "Person",
            "name": "Adam Frost",
            "url": "/name/nm0296466/"
        },
        {
            "@type": "Person",
            "name": "Lisa Zane",
            "url": "/name/nm0005571/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 396,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064379/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075704/"
        },
        {
            "@type": "Person",
            "name": "Brian Cameron Fuld",
            "url": "/name/nm0298077/"
        },
        {
            "@type": "Person",
            "name": "William Lee",
            "url": "/name/nm0498455/"
        },
        {
            "@type": "Person",
            "name": "Dick Lowry",
            "url": "/name/nm0523364/"
        }
    ],
    "description": "After witnessing the killing of his parents, a young teenage boy is put in a witness relocation program and sent to a boarding school in Canada to start a new life. He soon befriends a fellow student who is a hit man looking for him.",
    "director": [
        {
            "@type": "Person",
            "name": "Rodney Gibbons",
            "url": "/name/nm0316592/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA0NjA3MDk3Nl5BMl5BanBnXkFtZTgwMDY2OTk1MDE@._V1_.jpg",
    "keywords": "teenage boy,high school,witness protection,swimming lesson,hitman",
    "name": "The Secret Pact",
    "original_info": {
        "id": "The Pact_1999",
        "name": "The Pact",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jghedge"
        },
        "dateCreated": "2007-01-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0156859/"
        },
        "name": "Idiotic Storyline/Plot",
        "reviewBody": "The plot hinges upon a college freshman who witnesses his parents being murdered, but since he is wearing swimming goggles at the time, the killers do not get a good look at him, but they know who he is because they were business associates of the parents.\n\nHe enters the Witness Protection Program and is concealing his identity by registering with a fake identity at a university in Montreal. His pursuers, one of whom is a classmate, know what college he is attending because they have somehow penetrated the FBI Witness Protection Program, but do not know his fake name or have a picture of his face to put with either the real name or the fake one, so the classmate uses process of elimination to find the son.\n\nBut knowing his real name, why not just look through his high school yearbook, where he is on the swim team, to find his picture? Or do a DMV check, which should be no problem for crooks sophisticated enough to penetrate the FBI? And why would he be in Witness Protection before the trial - wouldn't he have to blow his cover to testify? And Polaroid cameras, and student records kept in manila folders in file cabinets instead of computers, in the year 2001?\n\nIt would be far more interesting than the film itself was to hear the writers explain how they thought anyone with an IQ higher than 10 could possibly overlook such gigantic holes in the plot. My hunch is that the writers themselves were possessed of no higher acumen than their target audience and were thus incapable of recognizing said holes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0156859/"
}