{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Lana Turner",
            "url": "/name/nm0001805/"
        },
        {
            "@type": "Person",
            "name": "David Farrar",
            "url": "/name/nm0268119/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3282,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "James Warner Bellah",
            "url": "/name/nm0068650/"
        },
        {
            "@type": "Person",
            "name": "John Twist",
            "url": "/name/nm0878605/"
        },
        {
            "@type": "Person",
            "name": "Andrew Geer",
            "url": "/name/nm0311614/"
        }
    ],
    "datePublished": "1955-06-04",
    "description": "As World War II begins, German freighter Captain Karl Ehrlich tries to get his ship back to Germany through a gauntlet of Allied warships.",
    "director": [
        {
            "@type": "Person",
            "name": "John Farrow",
            "url": "/name/nm0268513/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Action",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzlhZGNiYTAtMmIwMy00NmNmLTk3NDItODFkMzBiOGY2ZTdkXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "sea chase,sea captain,shark,sea battle,world war two",
    "name": "The Sea Chase",
    "original_info": {
        "id": "The Sea Chase_1955",
        "name": "The Sea Chase",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dglink"
        },
        "dateCreated": "2006-05-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048593/"
        },
        "name": "No Sparks between Luscious Lana and Stoic Duke on the High Seas",
        "reviewBody": "John Wayne as the captain of a German ship during the early days of World War II? The same John Wayne who rode tall in the saddle, saved a doomed airliner, and led the Green Berets? All right, he does not support German policies, but, nevertheless, casting Wayne in the part of Captain Karl Ehrlich was a bizarre choice. The Duke does not even attempt a German accent, and he actually mispronounces the only German words that he utters, \"Auf Wiedersehn.\" Perhaps the lure of starring opposite the luscious, if decidedly petite next to Wayne, Lana Turner was reason enough to ignore the mediocre script and listless direction by John Farrow.\n\nWhatever Wayne's motives for appearing in \"The Sea Chase,\" he plays John Wayne relatively well and outmaneuvers the pursuing British in the grand heroic style he pioneered. Of course, why the audience should be pulling for the Germans to escape the British during World War II is a moral dilemma with which to wrestle. However, somewhat akin to \"Das Boot,\" only one dastardly German serves among the otherwise apolitical crew, and a Nazi flag only appears once and briefly.\n\nAs Ehrlich, Wayne sails from Sydney just after hostilities begin in Europe, and, with a British ship in pursuit, which is captained by an officer that Wayne managed to insult over a woman, the glowing Ms. Turner, Wayne maneuvers his ship through the South Pacific towards safety in Valparaiso. Just before leaving Sydney, the German counsel tells Captain Ehrlich that he will be carrying a passenger, a spy who also seeks refuge in Valparaiso. Of course, the increasingly stunning Lana Turner is the passenger, who has managed to escape Sydney with only one bag. And what a bag that must have been, because, throughout the voyage, she has endless changes from one glamorous costume to another. Her makeup is never less than perfect, and the hairspray alone to keep her immaculately coiffed must have weighed a ton. How she maintained the perfection of her platinum blonde hair without a dye specialist on board remains a mystery. Of course, \"The Sea Chase\" is pure Hollywood hokum, and such questions of logic should never be asked.\n\nUnfortunately for the film and perhaps for Wayne, there appears to be little chemistry between the Duke and Turner. In the one kissing scene, Wayne seems to be biting Turner's jugular while holding his breath rather than exuding any passion. Turner does not turn up the heat either. In spite of her famous looks and figure, Lana exudes a chill towards most of the men in the film, although she tempts the sex-starved crew with tightly filled sweaters from her private deck. The decidedly non-Teutonic actors in the supposedly German crew include such familiar faces as James Arness, Tab Hunter, Claude Akins, Paul Fix, and Alan Hale, and each is decidedly superior to the lines they are forced to recite.\n\nAlthough the film is a supposedly a chase, there is a shortage of action, and the film plods along with little suspense other than that provided by Turner's wardrobe changes. John Wayne fans likely will want to see \"The Sea Chase,\" if only for the curiosity value. Others perhaps should steer clear unless it is a particularly rainy day with absolutely nothing else but reruns of \"My Mother the Car\" on the tube.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Sea Chase",
        "duration": "PT3M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4093182233",
        "name": "The Sea Chase",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDk5NWMxM2EtMWZjMC00YzFhLTlkZmMtMjU1NjNiZWI5ZjIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDk5NWMxM2EtMWZjMC00YzFhLTlkZmMtMjU1NjNiZWI5ZjIzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:09:58Z",
        "url": "https://www.imdb.com/video/vi4093182233/"
    },
    "url": "/title/tt0048593/"
}