{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lee Marvin",
            "url": "/name/nm0001511/"
        },
        {
            "@type": "Person",
            "name": "Fredric March",
            "url": "/name/nm0545298/"
        },
        {
            "@type": "Person",
            "name": "Robert Ryan",
            "url": "/name/nm0752813/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1740,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0123627/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130370/"
        },
        {
            "@type": "Person",
            "name": "Thomas Quinn Curtiss",
            "url": "/name/nm0193570/"
        },
        {
            "@type": "Person",
            "name": "Eugene O'Neill",
            "url": "/name/nm0642156/"
        }
    ],
    "datePublished": "1973-10-29",
    "description": "A salesman with a sudden passion for reform has an idea to sell to his barfly buddies: throw away your pipe dreams. The drunkards, living in a flophouse above a saloon, resent the idea.",
    "director": [
        {
            "@type": "Person",
            "name": "John Frankenheimer",
            "url": "/name/nm0001239/"
        }
    ],
    "duration": "PT3H59M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTAzOGMwMmEtMjRiMi00NzNiLWJlZDctYjljOGE5M2EyNzY5XkEyXkFqcGdeQXVyOTI2MjI5MQ@@._V1_.jpg",
    "keywords": "dutch,briton,new york city,reference to gilligan's island the postman cometh,saloon",
    "name": "The Iceman Cometh",
    "original_info": {
        "id": "The Iceman Cometh_1973",
        "name": "The Iceman Cometh",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RJBurke1942"
        },
        "dateCreated": "2008-07-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070212/"
        },
        "name": "Heeeeeeeere's Hickeyand he's here to help!",
        "reviewBody": "While I don't cover much of the plot in this long film, I do try to explain the philosophy that underpins why a bunch of drunks are sitting around a bar, in 1912 New York, waiting for their friend, Hickey, to arrive. If you'd rather see the film first, then read no further.\n\n*** \n\nWhen I saw this 1973 film in the seventies, I thought it was an interesting, if long-winded, exposition about the evils of alcohol addiction and sloth, and not much else. Being in my early thirties then, y'see, I was more interested in less depressing topics.\n\nRecently, however, I obtained a DVD and decided to have another look. When I finished I realized, of course, that the play is indeed much, much more than my first, immature assessment. In fact, as I watched, it became very clear to me that the whole play is an allegory that plays  no pun intended - with the biblical John the Baptist, The Last Supper, and the betrayal by Judas Iscariot.\n\nIntrigued by those thoughts, I searched the internet for O'Neill biographies (as I knew next to nothing about him) because I had an idea that O'Neill had been a Catholic who'd rebelled and that he had fully intended his play to (almost) parody those religious icons. Various search results confirmed O'Neill's religious background and his rejection of Catholicism while the following, from another online source, supports the idea of a religious underpinning for the play:\n\n \"The Iceman Cometh, the most complex and perhaps the finest of the O'Neill tragedies, followed in 1939, although it did not appear on Broadway until 1946. Laced with subtle religious symbolism, the play is a study of man's need to cling to his hope for a better life, even if he must delude himself to do so.\" \n\nSo, yes, the play is about a lot of drunken loafers in various stages of despair, but they all represent the status of humanity, according to O'Neill: besotted by its own self-delusion and self-pity.\n\nConsider Hickey (Lee Marvin, in a truly great performance) as a modern rendition of the biblical John: the quintessential salesman, the sharp-talking shark who can tear you to pieces verbally, and the man who has the message that will save you; yes, you twelve, you drunken bums, sitting on your asses twenty-four-seven, drowning yourselves in your collective delusions. Forget your pipe-dreams, says Hickey, stand up for yourselves, on your own feet, and get out there and face the world, the new world that is dawning for each, if only you would act! But first, you must give up the first, and maybe worst, crutch: booze. Because, continues Hickey, I've seen the light and I've given up drinking  ah, well, except for the odd, important and festive occasion, y'know...\n\nSo what could be more important than a birthday party for Harry Hope (Frederic March), the bar owner without hope, who hasn't stepped outside since his wife died twenty years earlier? He and the other eleven men in that bar have been waiting and waiting for Hickey to come and lavish his eloquence (and drinking money, of course) upon them all.\n\nSo, Hickey delivers, and then some, by convincing them all, except Larry Slade (Robert Ryan in his best-ever performance), in a moving - literally and figuratively - tirade during and after that Last Supper that Hickey will ever attend at this bar. Why last? Because Hickey has an unsavory secret that shocks them all, (except Larry) to the core when he is forced to reveal it and, in doing so, they all (except Larry again) reject Hickey's promise of personal salvation. Hence, when Hickey meets his fate with the law, as did the biblical John, and the bums go back to their booze and their delusions, Larry is the only one to realize that he can no longer remain on \"the grandstand of philosophical detachment\" and must act now according to his convictions.\n\nIronically, Larry's decision seals the fate of Don Paritt (a very young Jeff Bridges), a thoroughly unlikable coward and betrayer of lost causes. Lacking true courage to initiate the action to atone for his crime, Don beseeches Larry to decide for him, with the inevitable result. And, as Larry savors his new found \"freedom\", such as it is, he looks through the window, and specifically away from his one-time drinking partners who are all now busily, once again, deluding themselves with drink.\n\nAs the epitome of a modernity that rejects religion, Lee Marvin says it all, with consummate skill and panache; only Robert Ryan's Larry (O'Neill's alter ego), perhaps as a counterpoint to the biblical Peter, sees Hickey's message for what it truly is  a rejection of that \"opium of the masses\" as Karl Marx opined - and finally decides to act for himself. The other ten 'apostles' at the bar are lost souls because it's sufficient for O'Neill, in my opinion, that Larry finally woke up; the rest of the world can live in Hell.\n\nWhat's missing  or, rather, who's missing  from this whole play is, of course, a Christ-figure. Again, given O'Neill's view of religion as a delusion, that is entirely fitting.\n\nThe setting  all in one long, dark and moody bar  the directing from Frankenheimer, the photography that uses long takes and medium closeups throughout, the production standards, all add up to an experience that is only rarely presented. And, without a doubt, all of the actors performed to the peak, I think, of their prowess.\n\nHighly recommended for all theatre and cinema buffs.\n\nI must now, of course, search for a DVD of the 1960 version and prepare a comparative review.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A salesman with a sudden passion for reform has an idea to sell to his barfly buddies: throw away your pipe dreams. The drunkards, living in a flophouse above a saloon, resent the idea.",
        "duration": "PT2M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2755576601",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGQyODdjZDEtOWE0Mi00Yzg1LThhMzEtNjczODQzNTIyMThjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGQyODdjZDEtOWE0Mi00Yzg1LThhMzEtNjczODQzNTIyMThjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-08T00:31:52.197Z",
        "url": "https://www.imdb.com/video/vi2755576601/"
    },
    "url": "/title/tt0070212/"
}