{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel Williams",
            "url": "/name/nm0990258/"
        },
        {
            "@type": "Person",
            "name": "Matthew James Thomas",
            "url": "/name/nm0859228/"
        },
        {
            "@type": "Person",
            "name": "Brock Everitt-Elwick",
            "url": "/name/nm1309883/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2024,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103588/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        },
        {
            "@type": "Person",
            "name": "Stephen Poliakoff",
            "url": "/name/nm0689081/"
        }
    ],
    "datePublished": "2004-10-17",
    "description": "Based on the story of a British royal Prince locked away because of epilepsy.",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Poliakoff",
            "url": "/name/nm0689081/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTlkNWQzOTctYTQ0MC00ZDYzLWFkYzYtMzM4YzQ2NzMwYjI3XkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "shooting party,brother brother relationship,1900s,tv mini series,romanov",
    "name": "The Lost Prince",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Eric-1226"
        },
        "dateCreated": "2003-10-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0349747/"
        },
        "name": "Touching movie that plays like a post-card version of your high school history classes",
        "reviewBody": "(Aired over two nights this week on the Canadian station, CBUT, which we get here in Seattle...)\n\nSuperbly photographed and exquisitely acted, this movie primarily focuses on England's Prince John, youngest son of George V and Queen Mary who, in his tragically short life, suffered not only from periodic epileptic seizures but was also handicapped by what appeared to be some form of retarded mental development.\n\nThe creators of this film were kindly and charitable in not showing the boy's ailments in too negative a light. Enough was shown though to give the viewer to understand that the poor lad had problems - so much so that his immediate family and caretakers felt that he clearly wasn't cut out for royal service. As a result he was whisked away to a sort of royal \"nether-world\" out in the English countryside, away from public view, where hopefully he would not become an object of curiosity, scorn, ridicule, etc.\n\nSad though the plight of the boy was, you couldn't help but feel that he and his dysfunctional condition was a metaphor for the plight of the entire royal or aristocratic system which held sway over most all of Europe at the time. The boy's ailments and weaknesses eventually lead to his downfall, and all of this plays out simultaneously with the royal families of Europe (most of whom are shown being connected through marriage or bloodline) attempting to cope  quite ineffectually  with the onslaught of the tragedy of World War One.\n\nThe film includes several scenes of interaction between the British royal family and the Russian royal family (the Czar and Czarina and their wonderful kids). They are closely related, which makes their death (or shall we say murder, at the hands of the Bolsheviks, which is graphically depicted) all the more chilling, tragic and thought provoking.\n\nThere is so much to contemplate in this movie that I'd rather not sit here and prattle on about it, but instead would rather simply recommend that people go rent a copy and just watch it. It may not be for everyone, as it is a bit long and covers many facets of early 20th century history that will glide right over your head if you weren't paying attention in history class. But even if you ignore entirely the historical aspects of the movie, it is nonetheless a very touching picture: sad, compelling, and ultimately life-affirming, with wonderful performances and beautifully photographed images that will stick in your mind for a long time to come."
    },
    "url": "/title/tt0349747/"
}