{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Al Giordano",
            "url": "/name/nm0320217/"
        },
        {
            "@type": "Person",
            "name": "Desi del Valle",
            "url": "/name/nm0884902/"
        },
        {
            "@type": "Person",
            "name": "Jeff Constan",
            "url": "/name/nm1042706/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 104,
        "ratingValue": 3.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "K.M. Soehnlein",
            "url": "/name/nm1041572/"
        },
        {
            "@type": "Person",
            "name": "Jack Walsh",
            "url": "/name/nm0909672/"
        }
    ],
    "description": "Futuristic story of Carlos and Ben who fall in love in high school despite the racism and and homophobia. When Fundamentalist forces threaten to take over the U. S. the pair join forces with an underground resistance movement.",
    "director": [
        {
            "@type": "Person",
            "name": "Jack Walsh",
            "url": "/name/nm0909672/"
        }
    ],
    "duration": "PT53M",
    "genre": [
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA5MjA5NjI0Ml5BMl5BanBnXkFtZTcwOTE1MzUyMQ@@._V1_.jpg",
    "keywords": "anti semitism,gay interest,independent film",
    "name": "The Second Coming",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "benc7ca"
        },
        "dateCreated": "2004-06-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0293923/"
        },
        "name": "Why Bother Coming at All?",
        "reviewBody": "It looks like some one gave a bunch of high school students a camera and told them to go for it. The result is 'The Second Coming', written by Jack Walsh and K.M Soehnlein and directed by Jack Walsh. This is about a religious fanatical group that takes power in the United States and begins to rewrite the Constitution based on the bible. Fags and Lesbians are out. So are Jews, apparently, and anyone else not 'Christian'. Usually I can find something good to say about a movie, no matter how dismal an effort it is, but this one leaves me speechless. The acting (what there is of it ) is so bad as to be embarrassing. Mr. Walsh uses the movie to convey his own paranoid political ideology and does it poorly. Documentary film footage is slipped in, jarring scenes of poverty are stitched together and he uses a sledge hammer to get his message across. I realized early on that the movie was basically unwatchable but I persevered just to see how bad it could get.\n\nIt got worse. Much worse. You are warned.\n\nHowever, in the DVD bonus feature there is a short film by Mr. Walsh entitled \"A Letter to Rock\". It is touching and thought provoking. This too was filmed in 1994 before the AIDS cocktail began to prolong the lives of so many people. It is an interesting and very affecting film about how hopeless it all was back then. How ignored we were by the powers that be when we weren't being vilified by them. I know. I was there. I remember. Thanks, Mr. Walsh for that.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0293923/"
}