{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barry Fitzgerald",
            "url": "/name/nm0280178/"
        },
        {
            "@type": "Person",
            "name": "Howard Duff",
            "url": "/name/nm0003318/"
        },
        {
            "@type": "Person",
            "name": "Dorothy Hart",
            "url": "/name/nm0366253/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14376,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106706/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021358/"
        },
        {
            "@type": "Person",
            "name": "Albert Maltz",
            "url": "/name/nm0540816/"
        },
        {
            "@type": "Person",
            "name": "Malvin Wald",
            "url": "/name/nm0907013/"
        }
    ],
    "datePublished": "1948-03-04",
    "description": "A step-by-step look at a murder investigation on the streets of New York.",
    "director": [
        {
            "@type": "Person",
            "name": "Jules Dassin",
            "url": "/name/nm0202088/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzlmZDZiYWEtOTFkOC00Yjg5LTlkNjYtMjRkZGNmMTgwNDE3XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "manhattan new york city,murder investigation,police detective,police procedure,murder",
    "name": "The Naked City",
    "original_info": {
        "id": "The Naked City_1948",
        "name": "The Naked City",
        "year": "1948"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2019-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0040636/"
        },
        "name": "Eight million stories in the naked city",
        "reviewBody": "There were quite a few reasons for wanting to see 'The Naked City'. Like Barry Fitzgerald in a lot of other films ('And Then There Were None' being my introduction to him and still consider his performance in that one of his best), though it was interesting to see him in a lead role rather than his relative usual supporting roles and an atypical one at that. Really like what has been seen so far of Jules Dassin's work, especially 'Night and the City'. Also wanted to see whether the film lived up to its highly influential reputation.\n\nGood news is mostly 'The Naked City' does. One can see why 'The Naked City' was influential in its documentary style, which at the time and even by today's standards innovative, and how it is treated in a way that is driven by its characters and with an emphasis on the police and how they worked. And that makes it a highly interesting film and elevates that is fairly conventional, with familiar genre tropes, in the story department. Yet still makes a gripping film regardless of that.\n\nNot many problems here, though for my tastes Don Taylor seemed bland and detached, not always looking very comfortable either.\n\nDo think that the narration could have been used less, as some of it did not always feel needed.\n\nConversely, 'The Naked City' is immaculately photographed and New York, like its own character, is a major star here. The cinematography and editing Oscars were richly deserved. The haunting score adds hugely, as does Dassin's direction. Dassin is highly successful in creating an authentic, audacious and sometimes unsettling visual style. He is equally successful at keeping the story at a controlled, yet never in my mind mannered or tedious, way that sustains the suspense brilliantly.\n\nLoved the layered tautness of the script outside of the narration, while the story is gripping and its intelligence, high suspense and a knockout of a final chase made me able to forgive that it was quite conventional. The opening sequence is a unique one. Outside of Taylor, didn't actually have an issue with the performances. Although an effective Fitzgerald has been widely talked about, on both sides of good and not so good (am in the former camp), for me the best performance came from chilling Ted De Corsia.\n\nIn conclusion, very good film and deservedly influential. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0040636/"
}