{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Roscoe Lee Browne",
            "url": "/name/nm0001975/"
        },
        {
            "@type": "Person",
            "name": "Bruce Dern",
            "url": "/name/nm0001136/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15089,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "GP",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0254134/"
        },
        {
            "@type": "Person",
            "name": "William Dale Jennings",
            "url": "/name/nm0421266/"
        },
        {
            "@type": "Person",
            "name": "Irving Ravetch",
            "url": "/name/nm0712419/"
        },
        {
            "@type": "Person",
            "name": "Harriet Frank Jr.",
            "url": "/name/nm0290809/"
        }
    ],
    "datePublished": "1972-01-13",
    "description": "Rancher Wil Andersen is forced to hire inexperienced boys as cowhands in order to get his herd to market on time but the rough drive is full of dangers and a gang of cattle rustlers is trailing them.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Rydell",
            "url": "/name/nm0041932/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Adventure",
        "Drama",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzBhNDhmODEtMzFhMS00ZWQ0LTk5ZjItNmNkOTc1NDk0MjQzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "coming of age,evil man,good versus evil,psychopath,child uses a gun",
    "name": "The Cowboys",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slokes"
        },
        "dateCreated": "2008-01-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068421/"
        },
        "name": "The Brady Bunch Meets The Wild Bunch",
        "reviewBody": "John Wayne led many a cattle drive, but there's something especially satisfying about this final turn on the trail, alongside ten young boys for what turns out to be a hardnosed yet winning salute to the Duke's legacy of manly comportment.\n\n\"It's not how you're buried, it's how they remember you,\" Wayne's Wil Andersen tells one of his charges, the half-breed Cimarron (A Martinez), and \"The Cowboys\" is a two-hour rumination on that theme, of how Andersen, a man whose hard-bitten ways cost him two sons, finds a sort of redemption with these boys who come to help him take his cattle 400 miles to Belle Fourche while the only menfolk are either off panning for gold or else aiming to get their fortune in seedier ways.\n\nJohn Wayne in his post-Oscar years didn't have much to prove, and many of his movies from that time play today as little more than agreeable trips to the well. \"The Cowboys\" is different. Picking up on the rougher theme of post-\"Wild Bunch\" westerns, it presents a modern sensibility where people swear and bleed profusely when shot or punched. Wayne might seem out of place, yet he finds the right balance here between his characteristic latter-day gruff humorousness and the sterner stuff we remember from his classic turns in \"Red River\" and \"The Searchers\".\n\nThe key to Andersen are those dead sons he has buried out in his spread back home. \"They went bad on me,\" is about all he can say on the matter. \"Or I went bad on them. I can't figure it out.\" Seen through that prism, everything Andersen does with his young cowboys makes a lot of sense, right down to the famously grim finale with Bruce Dern, whose memorable \"Long Hair\" is one of the great Wayne-movie villains.\n\nBut there's a lot of joy in \"The Cowboys\", too. Another scene early on, just as classic, has Andersen deciding to give the boys a lesson with a wild mare, Crazy Alice, only to get taught a lesson in turn by these surprisingly spry youngsters, who each manage to prove themselves to Wil's wry chagrin.\n\n\"I hope I haven't ridden all the rough off her!\" one offers as he hands back the reins.\n\n\"You'll do,\" Wil replies, about all the affection he gives or they want.\n\nThen there's Jebediah Nightlinger, the cook and only other adult figure on the scene, who tries less hard than Wil to hide his enjoyment of the situation. Hard as it is to imagine \"The Cowboys\" without Wayne, it's harder to imagine it without Roscoe Lee Browne, whose every utterance has a quality of burnished bronze.\n\nDirector Mark Rydell finds the right tempo and look for his film, aided by John Williams' stirring score and Robert Surtees' camera work. Every shot has the quality of a glossy Louis L'Amour cover, majestic pines and grassy hills stretching out into infinity.\n\nAbout the only thing keeping \"The Cowboys\" from classic status is an ending which, while satisfying, comes off very pat on reflection. Despite the long time we spend with them, many of the Cowboys themselves lack for individuality, an exception being Robert Carradine, who plays Slim the de facto leader of the kids, and is the real-life son of Wayne's \"Stagecoach\" co-star John Carradine.\n\n\"The Cowboys\" wasn't Wayne's swansong, yet it's a stirring valedictory effort all the same, a chance to see an enduring screen legend at his late and glorious apex, showing a new generation, and generations yet unborn, a thing or two about getting it done.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Bros. Pictures",
        "duration": "PT3M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi307691545",
        "name": "The Cowboys",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzlmMDZjY2YtZjE4NC00M2IzLWI2M2EtNzIwZTAzZWQwMDAxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzlmMDZjY2YtZjE4NC00M2IzLWI2M2EtNzIwZTAzZWQwMDAxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-11-05T06:59:00Z",
        "url": "https://www.imdb.com/video/vi307691545/"
    },
    "url": "/title/tt0068421/"
}