{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jackie Chan",
            "url": "/name/nm0000329/"
        },
        {
            "@type": "Person",
            "name": "Ho-Sung Pak",
            "url": "/name/nm0657064/"
        },
        {
            "@type": "Person",
            "name": "Lung Ti",
            "url": "/name/nm0862479/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 47153,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "The Legend of Drunken Master",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023852/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069083/"
        },
        {
            "@type": "Person",
            "name": "Edward Tang",
            "url": "/name/nm0849282/"
        },
        {
            "@type": "Person",
            "name": "Man-Ming Tong",
            "url": "/name/nm0867246/"
        },
        {
            "@type": "Person",
            "name": "Kai-Chi Yuen",
            "url": "/name/nm0950699/"
        }
    ],
    "datePublished": "2000-10-20",
    "description": "A young martial artist is caught between respecting his pacifist father's wishes or stopping a group of disrespectful foreigners from stealing precious artifacts.",
    "director": [
        {
            "@type": "Person",
            "name": "Chia-Liang Liu",
            "url": "/name/nm0514906/"
        },
        {
            "@type": "Person",
            "name": "Jackie Chan",
            "url": "/name/nm0000329/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmRiZTZiMWEtZGVlNS00YzU1LTkxZjYtODNiMDEyYTIxYjA0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "stepmother stepson relationship,protection of culture,kung fu master,slapstick comedy,asian woman",
    "name": "Jui kuen II",
    "original_info": {
        "id": "The Legend of Drunken Master_1994",
        "name": "The Legend of Drunken Master",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chuckrules"
        },
        "dateCreated": "2002-06-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111512/"
        },
        "name": "how can you not like Jackie?",
        "reviewBody": "Jackie Chan is the trouble prone son of a local doctor and martial arts instructor. In an attempt to help his Dad avoid paying taxes on some ginseng he is bringing home for one of his patients, Jackie stows the root in luggage belonging to a local political official. When he attempts to retrieve it, he finds someone else digging in the same baggage and a battle ensues. Jackie is stymied at every turn, even when he uses his famous Drunken Boxing, but finally retrieves the precious package and makes it back to the train as it is leaving the station. \tUnfortunately as all Jackie Chan fans can figure, Jackie got the wrong box. It seems the official was smuggling out a famous Chinese artifact and the man who was going through the luggage was a special investigator trying to get evidence. This local official is using the factory in Jackie's town to hide all the other relics he has stolen and becomes enraged when he discovers the theft has been committed. He ships his men all over town searching and they final track down Jackie and his spitfire step-mother and try to steal the artifact back. Jackie is a ball of fire rolling through the group but is vastly outnumbered. His step-mother takes matters into her hands and begins throwing bottles of liquor at him since what could better help a master of Drunken Boxing than getting drunk. \tJackie ends up beating the gang and disgracing his father in the process who has always told him not to use this style. His father knows that many practitioners of this style end up as drunks in the end and worries the same will happen to his son. \tFinally Jackie is forced into helping rescue some of his friends who are trapped in the factory. The battle that follows is a dazzling display of Drunken Boxing at it's finest. \tThis movie succeeds at all levels. It doesn't promise any hidden agenda and fail to deliver. It promises a martial arts packed movie with dazzling stunts and comedy to boot...and it works. Jackie was trained in the Hong Kong Opera at an early age and his talents are never more on display. The opening fight which takes part under a train is something that must be seen to be believed. The two combatants use a spear and a sword in their battle and basically are in a crouch the entire length of the car. Subsequent scenes incorporating the drunken movies are both hilarious and awesome in the ease of the choreography. \tAnother good point for this movie is the dubbing is better than any many I have seen. They even allow Jackie to dub his own voice which is something that doesn't always happen for English speaking foreign actors. As usual with a Jackie Chan movie you must also watch the deleted scenes that are shown during the credits."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Legend of Drunken Master",
        "duration": "PT1M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1190965273",
        "name": "Legend of Drunken Master",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjg0NTRhYmYtYzgzMi00ZjRlLTkyMGItMzZlMDg5ZDc4OWJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjg0NTRhYmYtYzgzMi00ZjRlLTkyMGItMzZlMDg5ZDc4OWJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-05-17T04:36:33Z",
        "url": "https://www.imdb.com/video/vi1190965273/"
    },
    "url": "/title/tt0111512/"
}