{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Walter Brennan",
            "url": "/name/nm0000974/"
        },
        {
            "@type": "Person",
            "name": "Richard Crenna",
            "url": "/name/nm0001077/"
        },
        {
            "@type": "Person",
            "name": "Kathleen Nolan",
            "url": "/name/nm0634303/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1196,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025344/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022861/"
        },
        {
            "@type": "Person",
            "name": "Irving Pincus",
            "url": "/name/nm0683913/"
        }
    ],
    "datePublished": "1957-10-03",
    "description": "From the hills of West Virginia, Amos McCoy moves his family to an inherited farm in California. Grandpa Amos is quick to give advice to his three grandchildren and wonders how his neighbors ever managed without him around.",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE4NDg3MTY5NF5BMl5BanBnXkFtZTcwODM2MDUyMQ@@._V1_.jpg",
    "keywords": "immigrant,mexican,sitcom,farmer,hillbilly",
    "name": "The Real McCoys",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2007-11-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050053/"
        },
        "name": "Grandpappy Amos, The Girls And The Boys",
        "reviewBody": "A small part of a very large family named McCoy who hailed from the hills of West Virginia, put a down payment on a land in the Imperial Valley of Southern California and moved there and into our television sets for a considerable in the late fifties and early sixties. We know there was a whole lot more of them because occasionally some kinfolk came to visit.\n\nAfter a career with three Oscars under his belt and at that time he was the only one who had that many, you'd think Walter Brennan might want to slow up at the age of sixty three when he started that series. Not only did he keep up the grind of a weekly television series, but Brennan's movie career didn't slow down a might. You might remember he played a pretty substantial role in Rio Bravo and in How the West Was Won while The Real McCoys were still running.\n\nThe rest of the McCoys consisted of Richard Crenna and Kathleen Nolan as Luke and Kate, a pair of young marrieds. Kate married into the McCoys, but like Ethel Kennedy you'd think she was born into the clan instead. Kathleen was a wise old soul in her own way inside a beautiful young lady. She was the heart of the show, more than Brennan at times.\n\nRichard Crenna went on to a career that involved him playing a lot more than hayseeds like Luke McCoy. But he said many times that the real value of The Real McCoys for him was as an acting school. Just working with and watching Walter Brennan every week was more valuable than acting lessons with Stella Adler or the Royal Academy of Dramatic Arts.\n\nTwo younger siblings came along with Luke, Kate, and Grandpa. There was Lydia Reed and Michael Winkelman as Hassee and Little Luke. I thought it a bit much to name a kid after Tallahassee because someone sent them a picture postcard from the place and they thought the name was so pretty. Lydia had enough teenage angst, settling from West Virginia into sophisticated southern California without that added to her woes. As for Little Luke, I guess the McCoy clan got squeamish on names after Tallahassee and stuck with one tried and true.\n\nTony Martinez, all barely five feet of him, played their Chicano farmhand, Pepino. The Chicano and hill cultures blended very well together. At the time Tony Martinez was considered to have a breakthrough part for Latinos. Pepino was always a cheerful guy, but a hardworking person of real dignity and was never demeaned in any way by the stories.\n\nAs I said other McCoys got in the cast. Jack Oakie did several episodes as Uncle Rightly McCoy when Brennan was on extended leave in a movie. And several episodes had the McCoys make a visit back to West Virginia where we ran into the real head of the clan, Great Grandma McCoy played by Jane Darwell. That's right, Jane was Amos's mother and in fact she was just about old enough in real life to be just that. \n\nThey should have canceled the show after Kathleen Nolan left or paid her what she wanted. A lot got taken out of the show when she left and Luke was left a widower.\n\nIn many ways the Real McCoys was a survival story about a family leaving one culture and trying and succeeding in making it in a different location with different ways. Maybe that's why The Real McCoys was as successful as it was. Isn't that what the American Dream is all about?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3052978969",
        "name": "The Real McCoys Trailer - Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWVmM2IzZmItZDA1Mi00ODMzLTljNTYtYjhjMTY4ZGQ1YzI3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWVmM2IzZmItZDA1Mi00ODMzLTljNTYtYjhjMTY4ZGQ1YzI3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-05T01:48:44.945Z",
        "url": "https://www.imdb.com/video/vi3052978969/"
    },
    "url": "/title/tt0050053/"
}