{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cynthia Khan",
            "url": "/name/nm0451195/"
        },
        {
            "@type": "Person",
            "name": "Waise Lee",
            "url": "/name/nm0498429/"
        },
        {
            "@type": "Person",
            "name": "Benjamin Chan",
            "url": "/name/nm5615675/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 65,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "The 13 Cold Blooded Eagles",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0284721/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093036/"
        },
        {
            "@type": "Person",
            "name": "Yi Yu",
            "url": "/name/nm5231624/"
        }
    ],
    "datePublished": "1993-11-11",
    "description": "The Eagles are a group of orphans raised as killers.",
    "director": [
        {
            "@type": "Person",
            "name": "Dongqin Lu",
            "url": "/name/nm1280206/"
        },
        {
            "@type": "Person",
            "name": "Fat Tsui",
            "url": "/name/nm0268808/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Action",
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmYyZjM3NGUtY2EwNS00MzAxLWEyYjgtMTc4ZDQxMjdjMzY2XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg",
    "keywords": "rape",
    "name": "Xin leng xue shi san ying",
    "original_info": {
        "id": "The 13 Cold-Blooded Eagles_1993",
        "name": "The 13 Cold-Blooded Eagles",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2003-07-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105858/"
        },
        "name": "13 COLD-BLOODED EAGLES - below-average HK swordplay adventure",
        "reviewBody": "THE 13 COLD-BLOODED EAGLES is a rather disappointing wire-fu extravaganza from 1992. While the fights are well-staged, with lots of leaping up huge distances and flying from tree to tree or across bodies of water, the story is too convoluted and the cast notably lackluster, with only Cynthia Khan (DEADEND OF BESIEGERS, BLADE OF FURY) standing out. The Hong Kong production was shot in Taiwan and tells a tale of the title warriors who are manipulated by their leader, \"Lifu\" (Foster Father), into eliminating his enemies and acquiring their secret martial arts manuals, all in the name of ridding the country of evil. When dissenters question the leader's motives, the other Eagles turn on them and all hell breaks loose.\n\n One of the big problems with the film is its inability to settle on a central hero. Waise Lee (A BULLET IN THE HEAD), as Red Eagle, appears to be taking that role until, less than an hour in, another character moves to center stage. This character, Yinmin, finds his loyalty to the master faltering, but sets out anyway on an assignment to assassinate Quihua (Cynthia Khan), the daughter of the assassinated kung fu master who passed on the \"Star-Bleed Skill\" book to her. Unbeknownst to Yinmin, Quihua is the mysterious woman who had saved his life earlier in the film. When they meet again, the stage is set for another round of shifting loyalties and internecine wire fu combat.\n\nFoster Father is played by veteran kung fu performer Yen Shi-Kwan (ONCE UPON A TIME IN CHINA). He and Waise Lee are adequate in their roles, but lend little star power to the proceedings. Wild-eyed Chung Fat (ENCOUNTERS OF THE SPOOKY KIND) turns in a lively bit as \"Shinshu Monster,\" but, aside from Cynthia Khan, there are no other familiar faces on hand. The film ultimately comes to rest on Cynthia's pretty shoulders. Fortunately for her fans, she is seen to great effect in a dazzling array of flowing, colorful costumes. She does less kung fu here than swordplay and flying about on wires. Still, she's always a delight to watch and she energizes the film whenever she's on screen, which isn't often enough. The film is well-photographed on a variety of picturesque locations, including a river set against majestic cliffs which serves as the scene for a lengthy fight on a boat.\n\n The film's plot overlaps a bit with that of AVENGING EAGLES, the 1978 Shaw Bros. classic which stars Ti Lung and Fu Sheng and is also reviewed on this site. In that film, Ti Lung is also trying to quit the 13 Eagles and turns against his master. Cynthia and Waise Lee both starred together in another wire fu film from 1992, ZEN OF SWORD, which is also reviewed on this site."
    },
    "url": "/title/tt0105858/"
}