{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fernando Rey",
            "url": "/name/nm0721073/"
        },
        {
            "@type": "Person",
            "name": "Delphine Seyrig",
            "url": "/name/nm0786891/"
        },
        {
            "@type": "Person",
            "name": "Paul Frankeur",
            "url": "/name/nm0291289/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 44450,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "The Discreet Charm of the Bourgeoisie",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012071/"
        },
        {
            "@type": "Person",
            "name": "Luis Buñuel",
            "url": "/name/nm0000320/"
        },
        {
            "@type": "Person",
            "name": "Jean-Claude Carrière",
            "url": "/name/nm0140643/"
        }
    ],
    "datePublished": "1972-10-22",
    "description": "A surreal, virtually plotless series of dreams centered around six middle-class people and their consistently interrupted attempts to have a meal together.",
    "director": [
        {
            "@type": "Person",
            "name": "Luis Buñuel",
            "url": "/name/nm0000320/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzNhMmY1OTItNDg4YS00YTI2LWI1NTEtYzcwM2Q3Njk5NDM5XkEyXkFqcGdeQXVyNDE0OTU3NDY@._V1_.jpg",
    "keywords": "absurdism,social commentary,avant garde,experimental film,decadence",
    "name": "Le charme discret de la bourgeoisie",
    "original_info": {
        "id": "The Discreet Charm of the Bourgeoisie_1972",
        "name": "The Discreet Charm of the Bourgeoisie",
        "year": "1972"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ilpositionokb"
        },
        "dateCreated": "2004-05-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068361/"
        },
        "name": "An incisive satire on social mores and class hypocracy",
        "reviewBody": "\"The Discreet Charm of the Bourgeoisie\", a leisurely paced, incisive satire on social mores and class hypocrisy, opens with a group of friends arriving on the wrong day of a dinner engagement. this is only the begining of a succession of unexpected and unusual events to follow. The dinner party is the movie's main setting and it is there that reality and illusion often times blend imperceptibly together. The film is structured as a series of surreal sequences, which prompted esteemed film critic Pauline Kael to opine 'His(Director Louis Bunuel) indifference to dramatic logic is complete.' And how. Bunuel's narrative plays an elaborate game with the viewer through it's subconscious imagery and audacious use of time. His tendency to experiment with technique and form often times led to discovery and innovation. The cinema of Louis Bunuel invariably deals with the discrepancy between appearance and reality; decorum and desire. His world view was subversive and anarchistic. He was a cheerful pessimist, skeptical but not susceptible to Bergmanian despair. His skepticism extended to all of those he found playing too neat a social game. The filmmaker's career was one sustained assault on authoritarianism. Witness an indiscreet character in the film who claims: 'No one system can help the masses acquire refinement.' He believed man was, unconsciously, a slave to custom and aimed to shock viewers out of their unthinking acceptance of established values. \"The Discreet Charm of the Bourgeoisie\"(An Academy Award winner in 1972 for Best Foreign Film) is a boldly inventive picture. Dozens of frames are filled with clever filmic devices: environmental noises increase inordinately during routine conversations; an ambiguous procession is inserted freely within the text. These cinematic ploys add intrigue to the already peculiar goings-on. The walk by the main group of characters along a country roadside is mysterious and compelling. The players are noticeably silent and contemplative. Is this an anxious dream? The afterlife? An insignificant flashback? Whichever, the recurring sequence underscores the obliqueness and cool obscurity of the film. One might not identify closely with the disenchanted Bunuelian sensibility or the unsentimental stance he takes, however one knows immediately and unmistakably that they are in the gifted hands of a film technician like a Godard or Kurosawa. A director in complete control of his medium. A highly personal filmmaker frequently referred as 'a poet of hallucination who follows the caprices of his fantastical imagination.' Someone whose fanciful paths of creation were invariably led by the irrational. \"The Discreet Charm of the Bourgeoisie\", with it's arresting mixture of calculation and carelessness, remains a unique and influential movie. The acerbic films of Robert Altman and the perverse mischievousness of the Coen brothers films, to mention but a few, pay a large debt to the strange universe and unconventional perspective of Louis Bunuel. Film lovers uninitiated in surrealist cinema will find \"The Discreet Charm of the Bourgeoisie\" an alluring and beguiling crash course.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Discreet Charm of the Bourgeoisie",
        "duration": "PT53S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3737891865",
        "name": "The Discreet Charm of the Bourgeoisie: 40th Anniversary",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzE5ZDdlNTQtZjZhMy00NjFlLWIxNTItNDU1MjEwMTIxYTBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzE5ZDdlNTQtZjZhMy00NjFlLWIxNTItNDU1MjEwMTIxYTBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-05-19T21:54:01Z",
        "url": "https://www.imdb.com/video/vi3737891865/"
    },
    "url": "/title/tt0068361/"
}