{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ralph Macchio",
            "url": "/name/nm0001494/"
        },
        {
            "@type": "Person",
            "name": "Pat Morita",
            "url": "/name/nm0001552/"
        },
        {
            "@type": "Person",
            "name": "Robyn Lively",
            "url": "/name/nm0001477/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 65756,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053318/"
        },
        {
            "@type": "Person",
            "name": "Robert Mark Kamen",
            "url": "/name/nm0436543/"
        }
    ],
    "datePublished": "1989-06-30",
    "description": "Ostracised villain John Kreese attempts to gain revenge on Daniel and Miyagi, with the help of a Vietnam War comrade, the wealthy owner of a toxic waste disposal business.",
    "director": [
        {
            "@type": "Person",
            "name": "John G. Avildsen",
            "url": "/name/nm0000814/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Action",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODk0NzA4MTMtNGQ3Zi00OTdlLThiZmQtOTI0YWEyNDFiMTg2XkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_.jpg",
    "keywords": "teenage boy,vietnam war veteran,underdog,pain,blood",
    "name": "The Karate Kid Part III",
    "original_info": {
        "id": "The Karate Kid Part III | The Next Karate Kid_1989",
        "name": "The Karate Kid Part III / The Next Karate Kid",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "suadabeslagic1976"
        },
        "dateCreated": "2015-06-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0097647/"
        },
        "name": "Deeply flawed, but undeserving of 4 razzie nominations",
        "reviewBody": "The Karate Kid, Part III、as the title suggests, is the third film in the Karate Kid film series, released in 1989, directed by John Avlidsen, and starring Ralph Macchio as Daniel and Pat Morita as Mr. Miyagi. The Karate Kid film series is a rather typical example of other 1980s film series (such as Robocop) which just run out of steam as time goes on to the extent that they began with a bang and ended with a whimper. Despite its flaws however, The Karate Kid, Part III isn't nearly as bad as some people make it out to be and is certainly no Robocop 3. This review will discuss the problems with the movie as well as what it gets right, with an overall assessment of the Karate Kid original film series as a whole.\n\nOne of the biggest problems with this movie is the lack of continuity with the Karate Kid Part II, which for all its flaws did genuinely advance the story and develop Daniel and Miyagi's character. The film is fairly graceless in its dumping of Daniel's love interest Kumiko; it's explained that she just got a job in Japan that she couldn't turn down. This just didn't strike me as believable, perhaps because they had done it before in Part II. Daniel's relationships always happen to end between films? It's frankly insulting when sequels hit the reset button like this.\n\nBut the real continuity problem is one that is never addressed at all, and that is the relationship between Yuki and Miyagi. This is not presented as a mere superficial teenage romance, but instead as true love. Miyagi even says that he would stay in Okinawa, if not for the people trying to kill him. So why doesn't Miyagi stay in Okinawa after the conclusion of Part II, or take Yuki to America? It's never explained. This film takes a dump on Miyagi and Daniel's development; the second film may as well have never happened.\n\nMoreover, all the balance and self-control that Daniel developed in the first two films is gone, indeed Daniel if anything seems even more neurotic and unbalanced than he was at the beginning of the original film. Daniel is whiny and angsty, going into long diatribes about his own inadequacy. This would be less irksome if it were a response to something far more drastic; but in Part II the villains were trying to kill him and his master; in Part III they are just trying to take away his title as champion by defeating him in a local karate tournament. So, Daniel is cool-headed when threatened with death in a foreign land, but the prospect of losing his title to a bunch of local punks turns him into a nervous wreck? The film also fails to find a coherent theme, besides poorly retreading the original.\n\nThat said, the film does manage to get some things right. As whiny as Daniel is, he retains something of his likability, even if it is diminished. We also have the things that make the whole series fun; wonderfully over-the-top villains and pseudo-eastern wisdom. The emotional core of the film is tarnished but intact; that of the relationship between Daniel and Miyagi. These two characters, although somewhat botched, still work together well.\n\nNone of the original Karate Kid films are by themselves incoherent, but taken as a whole the series is rather lopsided. They do get progressively worse as the series goes on, and by the end of Part III one is glad they never made a fourth film (unless you count the Next Karate Kid, and I don't). Still, while it's a shame that they never managed to quite recapture the magic of the first film, I'm glad I got to spend 3 films in the company of these terrific characters.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2075836185",
        "name": "The Karate Kid, Part III",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGU2MGVhNzctNTY0OS00NzA2LWEwMzItMWRiNzJjZWEyMGI3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGU2MGVhNzctNTY0OS00NzA2LWEwMzItMWRiNzJjZWEyMGI3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-30T17:05:47.257Z",
        "url": "https://www.imdb.com/video/vi2075836185/"
    },
    "url": "/title/tt0097647/"
}