{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Henry Fonda",
            "url": "/name/nm0000020/"
        },
        {
            "@type": "Person",
            "name": "Jane Darwell",
            "url": "/name/nm0002034/"
        },
        {
            "@type": "Person",
            "name": "John Carradine",
            "url": "/name/nm0001017/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 95456,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Nunnally Johnson",
            "url": "/name/nm0425913/"
        },
        {
            "@type": "Person",
            "name": "John Steinbeck",
            "url": "/name/nm0825705/"
        }
    ],
    "datePublished": "1940-03-15",
    "description": "An Oklahoma family, driven off their farm by the poverty and hopelessness of the Dust Bowl, joins the westward migration to California, suffering the misfortunes of the homeless in the Great Depression.",
    "director": [
        {
            "@type": "Person",
            "name": "John Ford",
            "url": "/name/nm0000406/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzJiOGI2MjctYjUyMS00ZjkzLWE2ZmUtOTg4NTZkOTNhZDc1L2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "great depression,based on novel,capitalism,national film registry,bakersfield california",
    "name": "The Grapes of Wrath",
    "original_info": {
        "id": "The Grapes of Wrath_1940",
        "name": "The Grapes of Wrath",
        "year": "1940"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "inkblot11"
        },
        "dateCreated": "2018-04-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0032551/"
        },
        "name": "Everyone should see Grapes of Wrath and be thankful for what they have!",
        "reviewBody": "In rural Oklahoma, Tom Joad (Henry Fonda) is walking and hitchhiking home from prison, after a stay of four years. After taking a knife at a dance, Tom hit the attacker with a pan, killing him. Nevermind that it was self-defense, Tom still gets sent to prison. He hasn't heard from his parents, Ma (Jane Darwell) or Pa because they aren't the \"writing types\". A fierce dust storm makes Tom's final few steps treacherous. Arriving back at their small cabin, where his family are sharecroppers, Tom and his passing friend, Casy (John Carradine) are startled to find no one at home. A shell-shocked neighbor informs the other two that the family has been kicked off their land in foreclosure. They are nearby at Uncle John's house, where his family is about to suffer the same fate. Its the Depression and the Dust Bowl has ruined the land, taking off the top soil; no one can grow crops. When Tom catches up with his Ma and company, they are overjoyed to see him, for their plans are to pack a truck and move to California, where handbills show pickers are needed. Grandpa doesn't want to leave the only home he has ever known, so they drug him with medicine and haul him along. Now on the Mother Road, route 66, the journey is difficult; the truck breaks down frequently, no one wants them to stay long anywhere they rest, and Grandpa dies of a stroke. Will California really be the Golden, Promised Land? NOT ON YOUR LIFE! This heartbreaking adaptation of Steinbeck's classic is a must-see for the whole wide world. This family of hard-working folks has one calamity after another, just trying to earn an honest and living wage. Those who lived in the Dust Bowl part of the country were hit especially hard, as the soil had been overworked and winds took the topsoil off, creating damaging storms to crops, humans, and animals. No better were the \"lies\" of the handbills, advertisements that migrants were needed in California, where over 300,000 poor helpless folks showed up for very few jobs. The cast, with Fonda at the helm, is wonderful as is the scenery, costumes, and careful direction to show the truth of a desperate situation. Wanna get down on your knees and thank the Lord for what you have, Americans? You will when you view this amazing film!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from 20th Century Fox",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1686962457",
        "name": "The Grapes of Wrath",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWFkZDgzZDgtM2NjNS00Yjc0LWJmZTctZjZlMzcxN2FlYTc2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWFkZDgzZDgtM2NjNS00Yjc0LWJmZTctZjZlMzcxN2FlYTc2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:25:25Z",
        "url": "https://www.imdb.com/video/vi1686962457/"
    },
    "url": "/title/tt0032551/"
}