{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Max von Sydow",
            "url": "/name/nm0001884/"
        },
        {
            "@type": "Person",
            "name": "Gunnar Björnstrand",
            "url": "/name/nm0085038/"
        },
        {
            "@type": "Person",
            "name": "Bengt Ekerot",
            "url": "/name/nm0252345/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 188495,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "alternateName": "The Seventh Seal",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050989/"
        },
        {
            "@type": "Person",
            "name": "Ingmar Bergman",
            "url": "/name/nm0000005/"
        }
    ],
    "datePublished": "1958-10-13",
    "description": "A knight returning to Sweden after the Crusades seeks answers about life, death, and the existence of God as he plays chess against the Grim Reaper during the Black Plague.",
    "director": [
        {
            "@type": "Person",
            "name": "Ingmar Bergman",
            "url": "/name/nm0000005/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWM3MmE0OGYtOGVlNC00OWE1LTk5ZTAtYmUwMDIwM2ZlNWJiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "chess,death,knight,death personified,church",
    "name": "Det sjunde inseglet",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CinemaClown"
        },
        "dateCreated": "2020-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050976/"
        },
        "name": "An Allegorical Take On Life, Death, Religion, Faith & Existential Angst",
        "reviewBody": "Painting a grim portrait of the western world plagued by the Black Death, threading together several norms of the medieval era into a single setting, and addressing its themes by observing them through contemporary lens, The Seventh Seal is a fable of life, death, religion, faith & existential angst that, despite the allegorical treatment, makes sure its narrative remains somewhat accessible.\n\nWritten & directed by Ingmar Bergman, one of the first things that stands out about this sermon is the dark & deathlike atmosphere the plot comes drenched in. Add to that, the whole premise of playing chess against the Grim Reaper with one's life on the line sounds interesting on paper. The story however piles on more subplots and digs deeper into the philosophical & spiritual elements that only slow down the ride.\n\nThe crisp black n white cinematography is captivating throughout. Characters of all moods are present in the picture. The period details may not be appropriate but the gloomy aura is finely captured. And comfortably steering the film past the finish line are the sturdy performances, led by Max von Sydow who plays a knight locked in a game with Death itself, latter personified by Bengt Ekerot. And the scenes between the two are easy standouts.\n\nOverall, The Seventh Seal is actually easier to navigate than what I was expecting, and the parallels viewers can draw between the medieval pandemic and one we're dealing with currently makes the journey rather intriguing. Nonetheless, the relaxed pace & numbing speeches still made it a frustrating sit for me and failed to strike an emotional chord. As is the case with previous Bergman entries, I do get its legacy & repute but don't feel any personal love for it."
    },
    "url": "/title/tt0050976/"
}