{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Stewart",
            "url": "/name/nm0000071/"
        },
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        },
        {
            "@type": "Person",
            "name": "Betty Hutton",
            "url": "/name/nm0002149/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15235,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Fredric M. Frank",
            "url": "/name/nm0290931/"
        },
        {
            "@type": "Person",
            "name": "Barré Lyndon",
            "url": "/name/nm0528530/"
        },
        {
            "@type": "Person",
            "name": "Theodore St. John",
            "url": "/name/nm0820693/"
        }
    ],
    "description": "The dramatic lives of trapeze artists, a clown, and an elephant trainer are told against a background of circus spectacle.",
    "director": [
        {
            "@type": "Person",
            "name": "Cecil B. DeMille",
            "url": "/name/nm0001124/"
        }
    ],
    "duration": "PT2H32M",
    "genre": [
        "Drama",
        "Family",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzg5MWIyMjItYWMyYS00YTFjLWFlZGMtZTJkNzgyY2VmY2U2XkEyXkFqcGdeQXVyNzE2NDk3NTY@._V1_.jpg",
    "keywords": "circus train,horseback riding,blockbuster,freak show,all star cast",
    "name": "The Greatest Show on Earth",
    "original_info": {
        "id": "The Smallest Show on Earth_1957",
        "name": "The Smallest Show on Earth",
        "year": "1957"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Calysta"
        },
        "dateCreated": "2000-09-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0044672/"
        },
        "name": "A colourful, light hearted and entertaining epic",
        "reviewBody": "It would validate this film best if I state outright at this point that I am a great fan of the movie SINGIN' IN THE RAIN, also released in 1952 and generally ignored by the Academy, seemingly due to the shower of accolades handed out to AN AMERICAN IN PARIS. THE GREATEST SHOW ON EARTH did not win many Oscars beyond the coveted best picture award, but even this fact has poisoned my viewpoint of the justification of the Academy's decision, and that this in itself displays the incomprehensible factor that the statuette ended up at Paramount, not MGM. \n\nHowever, my eventual purpose of viewing this film was threefold: to see Jimmy Stewart, Dorothy Lamour and one of the final best pictures of the 1950s, which I had not seen. All my SINGIN' IN THE RAIN prejudices aside, I was very pleasantly surprised.\n\nCecil B. DeMille's opinions of the circus as a human machine made up of many parts' is interesting as it evokes the assemblage of any motion picture, and certainly, an enormous production such as this one. The script, generally convincing in its theme, can deliver on its expectations and bring to life a drama-comedy-epic-action-romance-musical that actually works, all elements and sub-plots played alongside. Even if these aspects make for melodramatic story lines, I have assumed that the purpose of the film is generally basic entertainment. And the basic storythe dramatic lives of circus performers culminating and reaching their peak underneath the glamour and colour of the big top isn't too bad either. DeMille's well-handled direction is intriguing and always expectantly, a job well done.\n\nThere are many good examples of an all-star ensemble cast, but this one ranks close to the topBetty Hutton, Cornel Wilde, Charlton Heston, Jimmy Stewart, Dottie Lamour, Gloria Grahameeach may bear no resemblance to their character's personalities, but play their parts interestingly well. Generally, I found Stewart's portrayal as Buttons the clown, masked behind a multiple personality, to be the best performance in the film. It is difficult also not to mention the many great and entertaining real-life circus performers that truly made up the spirit of THE GREATEST SHOW ON EARTH, and continue to do so in their differed entertaining medium today, so it is really quite a nice tribute to their dedication.\n\n To satisfy the varied genres of the film, each character is where they are to fuel the particular element. Angel (Grahame) enhances the comedy with her natural talents, and Phyllis (Lamour) and Holly (Hutton) to fill out the musical aspects with an extensive musical program, including `Jumpin' Jack' and the title song. Romance is demonstrated in a series of different love triangles involving five of the six lead characters. Drama is seen with the integration of all these aspects, involving Buttons (Stewart), tension between Sebastian (Wilde) and Brad (Heston), and the case of post ANNIE GET YOUR GUN competitive one-upmanship between Holly and Sebastian on the trapezes. Finally, in the case of action, the sensationalism of the train scene brings all these emotions to a haltto create one of the biggest epics of 1950s Hollywood, and to destroy some of the colourful and glamourous illusions of circus life.\n\nDespite the fact the film definitely exceeded my original expectations of it and the fact that it filled its three-hour plus running time certainly impressed me. However, I would like to continue to retain my position on the unfair juxtaposition of SINGIN' IN THE RAIN, and it is doubtful my opinion will swing to favour THE GREATEST SHOW ON EARTH any time soon.\n\n Rating: 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT6M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1932115481",
        "name": "The Greatest Show on Earth",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGJkOTBiNTYtMGUxYi00NDA5LTkyZTMtZmM0ZWU4MjQxOTQwXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGJkOTBiNTYtMGUxYi00NDA5LTkyZTMtZmM0ZWU4MjQxOTQwXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-18T17:04:53.298Z",
        "url": "https://www.imdb.com/video/vi1932115481/"
    },
    "url": "/title/tt0044672/"
}