{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rachel Harker",
            "url": "/name/nm1408895/"
        },
        {
            "@type": "Person",
            "name": "MacKenzie Nimmo",
            "url": "/name/nm1407458/"
        },
        {
            "@type": "Person",
            "name": "Ken Cheeseman",
            "url": "/name/nm0154914/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 33,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108421/"
        },
        {
            "@type": "Person",
            "name": "John Stimpson",
            "url": "/name/nm0830387/"
        }
    ],
    "datePublished": "2003-08-01",
    "description": "In a tiny summer community on Cape Cod the houses sit boarded up and vacant for eight months of the year. Or do they?",
    "director": [
        {
            "@type": "Person",
            "name": "John Stimpson",
            "url": "/name/nm0830387/"
        }
    ],
    "duration": "PT14M",
    "genre": [
        "Drama",
        "Sci-Fi",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg1NjI3NTcwNl5BMl5BanBnXkFtZTcwMjgyNzA3Ng@@._V1_.jpg",
    "name": "The Winter People",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2008-07-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0373459/"
        },
        "name": "Like an entire movie crammed into a film short",
        "reviewBody": "This was included on the disk \"Shorts: Volume 2\"--a rather dull collection of short films. Shorts are among my favorite style of films but somehow the people assembling this second collection had a hard time finding quality content--and it wasn't nearly as good as the first volume or other shorts collections. This particular short film probably the best overall in the set.\n\nA young girl and her mother travel to their vacation home. However, it's not to relax but to prep the house for a long winter and perhaps as a prelude to being sold. It seems the parents are divorcing and there's a strong feeling of melancholy about the film. \n\nThe little girl has the odd idea that when the house is locked up for the winter that \"people\" (perhaps ghosts) come to live in the home. Surprisingly, there are a few clues around the house that MIGHT support this, though Mom tells her to forget about such nonsense.\n\nWhere the story goes next, I'd rather not say--it would spoil the film. However it is a rather interesting way to take the story and my daughter and I enjoyed this film a lot--something we just can't say about the rest of these shorts. The reason we liked it so much was how well written and professional the whole thing was--and it made us want to see more.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0373459/"
}