{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Ingle",
            "url": "/name/nm0408834/"
        },
        {
            "@type": "Person",
            "name": "Kenneth Mars",
            "url": "/name/nm0550318/"
        },
        {
            "@type": "Person",
            "name": "Miriam Flynn",
            "url": "/name/nm0283565/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2744,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0202966/"
        },
        {
            "@type": "Person",
            "name": "Dev Ross",
            "url": "/name/nm0743361/"
        },
        {
            "@type": "Person",
            "name": "Judy Freudberg",
            "url": "/name/nm0294440/"
        },
        {
            "@type": "Person",
            "name": "Tony Geiss",
            "url": "/name/nm0312076/"
        }
    ],
    "datePublished": "2002-12-10",
    "description": "Littlefoot befriends with a mysterious, fun-loving dolphin-like creature named Mo, who is trapped in \"new water\" caused by heavy rain. The gang then goes on an adventure to the \"big water\" to bring Mo home.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Grosvenor",
            "url": "/name/nm0343799/"
        }
    ],
    "duration": "PT1H11M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjQzNTIxOTM1N15BMl5BanBnXkFtZTgwODk4NTAwNzE@._V1_.jpg",
    "keywords": "helping a friend,sea,stegosaurus,grandparents,earthquake",
    "name": "The Land Before Time IX: Journey to Big Water",
    "original_info": {
        "id": "The Land Before Time IX: Journey to Big Water_2002",
        "name": "The Land Before Time IX: Journey to Big Water",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Smells_Like_Cheese"
        },
        "dateCreated": "2009-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0345543/"
        },
        "name": "Journey to the Big Water",
        "reviewBody": "The Land Before Time IX: Journey to the Big Water, the ninth installment in the Land Before Time series and once again I really enjoyed this sequel. Honestly what was so wrong with this film? I thought it was absolutely adorable. Again I know that these movies are a bit silly and very kidish, but they are just light hearted fun that provide entertainment for the whole family. Seeing Littlefoot and his friends on another adventure together, though these kids seem to get into more trouble than your average group of friends, these stories are nevertheless always very fun to watch. The animation is getting brighter, it's a little different than the original, but it's still all good and I'm enjoying what these sequels have brought since the original Land Before Time.\n\nWhen heavy rains create a mysterious \"new water\", Littlefoot sets off to explore the Great Valley. All his friends are busy trying to fix whatever happened during the rain to their land, so he goes beyond the Great Valley. He quickly becomes friends with Mo, a swimming fish like dinosaur who has been isolated from his pod by the weather. Littlefoot's friends finally catch up with him when they're all done with their chores and are introduced to Mo. They decide to help Mo get home safely, but the families don't want to risk the possible danger ahead of them. Littlefoot decides to go ahead anyways and his friends are going to help him. When Littlefoot and his friends get separated from their parents because of the Earthshake, they help Mo get back home to the Big Water, while avoiding a hungry dinosaur that looks like the Lochness Monster. On the way, Littlefoot and Mo discuss such interesting and see dangerous things like imaginary friends, the concept of loneliness, and the true meaning of a brother.\n\nThe Land Before Time IX: Journey to the Big Water is a good family film, I mean how could you not love Mo? Yeah he's a bit hyper and crazy, but still he was so cute and such a party animal. I loved the friendship between him and Littlefoot, it kind of reminded me of Chomper from the second sequel in the Land Before Time series. This has great morals, good humor, and a fun story as the adventures continue, OK that's a little cheesy, but these movies are making me smile. Don't take the ratings on here seriously, these are great family films and are just harmless fun. Littlefoot, Mo, Spike, Cera, Peetry, and Ducky are awesome! If you don't like them, you have no heart.\n\n6/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2643394841",
        "name": "The Land Before Time: Journey to Big Water",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2ZmODZiMjgtOTIxNS00NjQ2LWFiYWYtYjRiMDAzMTczNTg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2ZmODZiMjgtOTIxNS00NjQ2LWFiYWYtYjRiMDAzMTczNTg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:32:49Z",
        "url": "https://www.imdb.com/video/vi2643394841/"
    },
    "url": "/title/tt0345543/"
}