{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Patrick Stewart",
            "url": "/name/nm0001772/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 97,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057495/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028316/"
        },
        {
            "@type": "Person",
            "name": "Desmond Hawkins",
            "url": "/name/nm1852135/"
        }
    ],
    "datePublished": "1993-11-24",
    "director": [
        {
            "@type": "Person",
            "name": "Adrian Warren",
            "url": "/name/nm0912708/"
        }
    ],
    "duration": "PT42M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcyNTY5OTMwNV5BMl5BanBnXkFtZTYwMTM4OTc5._V1_.jpg",
    "keywords": "nature,imax,ecological,independent film",
    "name": "The Secret of Life on Earth",
    "original_info": {
        "id": "The Secret of Life on Earth: IMAX_1993",
        "name": "The Secret of Life on Earth: IMAX",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2022-12-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111111/"
        },
        "name": "Shouldn't stay secret",
        "reviewBody": "1993's 'The Secret of Life on Earth' immediately appealed to me prior to watching. Absolutely love nature documentaries (have done ever since seeing 'Planet Earth' and 'The Blue Planet' for the first time when they first aired) and despite the topic being quite a broad one rather than one that focuses on one aspect. Life on Earth is always fascinating and it is very hard to go wrong with the unmistakable voice of Patrick Stewart, who is always worth watching as an actor.\n\n'The Secret of Life on Earth' is very, very good and lived up to high expectations. It may not be one of the best documentaries ever made and would have been better if it focused on a little less content and spent more time on a couple of specific topics rather than one broad one, and done it as a two or three part series. There is a huge amount to admire though about 'The Secret of Life on Earth' and as far as the IMAX documentary short films go seen in the past few weeks it is somewhere around high middle.\n\nLike a lot of the IMAX documentary short films, 'The Secret of Life on Earth' is too short and would have been better with 20 minutes more or split into two or three parts, for a topic so broad.\n\nDid feel too that it did try to pack in a little too much and with the length being as short as it was it did feel rushed at times for my tastes.\n\nHowever, so much is good and just wanted to reiterate that before people were thinking \"this person hated this\". It looks absolutely beautiful for one thing, with beautiful yet unforgiving scenery and especially the photography that leaves one in awe at its best. The IMAX is not overused and doesn't look cheap. There is though more to 'The Secret of Life on Earth' than cute animals and plants in beautiful environments, one is reminded without being preached at that there are daily challenges.\n\nExpectedly there is some messaging, but it is as relevant today as it was back then so it is hardly outdated. It also makes its point quite powerfully and thoughtfully, was very worried about it being preachy but there are documentaries that are a million times worse at that. The music, with an accessible style, is relaxing in some parts while having some edge in other parts. The animals and plants are a great mix of adorable, formidable and exotic and their behaviours and ways to survive are relatable, surprising and inspiring.\n\nWhen it comes to the information, it is very educational and the narration entertains and informs without preachiness or being gimmicky. Any familiar content is approached freshly, and in a way that will captivate and never disturb kids while not being cookie cutter. Stewart's delivery is resonant, soothing but also enthusiastic without trying too hard.\n\nVery good overall. 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0111111/"
}