{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Spader",
            "url": "/name/nm0000652/"
        },
        {
            "@type": "Person",
            "name": "Keanu Reeves",
            "url": "/name/nm0000206/"
        },
        {
            "@type": "Person",
            "name": "Marisa Tomei",
            "url": "/name/nm0000673/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 27746,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0307064/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0941832/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0307029/"
        },
        {
            "@type": "Person",
            "name": "Darcy Meyers",
            "url": "/name/nm0583514/"
        },
        {
            "@type": "Person",
            "name": "David Elliot",
            "url": "/name/nm0254213/"
        },
        {
            "@type": "Person",
            "name": "Clay Ayers",
            "url": "/name/nm0043769/"
        }
    ],
    "datePublished": "2000-09-08",
    "description": "David Allen Griffin is a cool killer- time and time again, he chooses a female victim, studies her for weeks till he knows her routine to the smallest detail, makes meticulous preparations using his forensic knowledge to gain entr...",
    "director": [
        {
            "@type": "Person",
            "name": "Joe Charbanic",
            "url": "/name/nm0152741/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGE4ZDRiNmItOTdhNy00YjFkLWEzMWQtYTZkZjhmNTg3ZGYyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "serial killer,serial murder,villain,maniac,bad guy",
    "name": "The Watcher",
    "original_info": {
        "id": "The Watcher_2000",
        "name": "The Watcher",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "2000-10-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0204626/"
        },
        "name": "it is Predictable and the same situation is repeated over and over. ** (out of four)",
        "reviewBody": "THE WATCHER / (2000) ** (out of four)\n\nBy Blake French:\n\n\tA serial killer wreaks havoc on a large city while playing mind games with an FBI agent who is desperately attempting to save his targets before they meet a horrifying death. Sound familiar? It should. Joe Charbanic's \"The Watcher\" is another rehearse in Hollywood's obsession with serial killer films that call for big stars and bloody murders. Just a few weeks ago, \"Urban Legends: Final Cut\" was released, also detailing a psychopath brutally murdering young adults while teasing potential victims with cruel gimmicks. I am getting very tired of the same old recycled material found in this kind of production. \n\n\tAll serial killer movies have a gimmick; this film's is the protagonist's involvement with the killer himself. The main character, Joel Campbell (James Spader), is an FBI agent who recently moved from Los Angeles to Chicago to escape the stress and recollections of his experiences tracking down psychotic murderers, specifically David Allen Griffin (Keanu Reeves), who's trademark includes strangling young women with piano strings. Campbell's past has left him with severe migraine headaches and a dependency on prescription medication, both problems he and Dr. Polly Peilman (Marisa Tomei), a young psychiatrist, are trying to solve. \n\n\t It isn't long before Griffin discovers Campbell and begins playing cat and mouse games again. Griffin mails Campbell a photo of his next victim and allows 24 hours for the police to find and rescue her. With the help of two other detectives, Hollis Mackey (Chris Ellis) and Mitch Casper (Robert Cicchini), Campbell is determined to bring down this mad man.\n\n \tThe movie is over the top in most elements. The style teases and interrogates, but is also boastful and distracting. The protagonist's personality is also exaggerated, supported by blunt dialogue (supporting character: \"That is gonna be hard.\" Campbell: \"Life is hard.\") and filled with familiar clichés including personal tragedy involved with the killer and his own family. But the killer himself lacks successful development. The movie lazily introduces Griffin through voice-over narration and silhouetted images; we never really receive a description, but instead intuition and implications. \n\n\tA big problem I had with the film is that many of its murder sequences consist of a brainless victim screaming helplessly instead of attempting to defend themselves. The victims stand out more than the main characters here, so they should have much more priority in their murder sequences. They also need further examination so we actually care about someone in the story. There is a lengthy, exciting, and suspenseful sequence in which a homeless young woman actually puts up a fight to escape the clutches of Griffin, developing tension and one of the most insinuating chase scenes all year. Too bad there were not more of this type of incident in \"The Watcher.\" \n\n The performances are actually better than the movie deserves, as is some of the suspense. Perhaps the biggest controversy found within this movie is Keanu Reeves playing a villain. After being in movies like \"The Matrix\" and \"Speed,\" audiences come to expect him to save the day, not brutally murder women. As Griffin, he makes more of the character than the film provides; I liked his effective performance, although he does not include the psychotic touch that actors like Vince Vaughn and Christian Bale have. James Spader comes off as his usual stale, boring self in a role that is way too oppressive for his capabilities. \n\n\t\"The Watcher\" is a one-line script: it is predictable and the same situation is repeated over and over, sagging its line of tension. It concludes in a predicable, expected outcome that is explosive and action packed, but lacks a satisfying feeling we normally experience in this kind of movie. \"The Watcher\" is simply another serial killer picture made with the hopes of grossing millions of dollars, which probably explains why there are so many things wrong with it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3941925145",
        "name": "The Watcher",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2FiZGRmYjItNWIwZC00NjAyLWIzOWYtZjFhNzBlODgyMmY4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2FiZGRmYjItNWIwZC00NjAyLWIzOWYtZjFhNzBlODgyMmY4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:54:27Z",
        "url": "https://www.imdb.com/video/vi3941925145/"
    },
    "url": "/title/tt0204626/"
}