{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tony Curtis",
            "url": "/name/nm0000348/"
        },
        {
            "@type": "Person",
            "name": "Sidney Poitier",
            "url": "/name/nm0001627/"
        },
        {
            "@type": "Person",
            "name": "Theodore Bikel",
            "url": "/name/nm0000942/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16393,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0859457/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086377/"
        },
        {
            "@type": "Person",
            "name": "Nedrick Young",
            "url": "/name/nm0949917/"
        },
        {
            "@type": "Person",
            "name": "Harold Jacob Smith",
            "url": "/name/nm0808414/"
        }
    ],
    "datePublished": "1958-09-27",
    "description": "Two chained-together escaped convicts, white and Black, must learn to get along in order to elude capture.",
    "director": [
        {
            "@type": "Person",
            "name": "Stanley Kramer",
            "url": "/name/nm0006452/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDc3M2E4YTktNjU2ZC00OWVkLWJmNTAtNWQ5MDNmMjRjYWQ1XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "manhunt,train,swamp,prejudice,escape from prison",
    "name": "The Defiant Ones",
    "original_info": {
        "id": "The Defiant Ones_1958",
        "name": "The Defiant Ones",
        "year": "1958"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mdm-11"
        },
        "dateCreated": "2004-10-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051525/"
        },
        "name": "The Poitier/Curtis Jail-Break Classic",
        "reviewBody": "Sidney Poitier continues to break race barriers with this formula jail-break drama. Teamed with Tony Curtis, the escaped prisoners encounter many situations, where their difference in color seems to matter more than the fact that both are fugitives from the law. Throughout the film, the viewer empathizes with the escapees, figuring that they always got a bum deal in life. A scene towards the end, where a single mother sees a chance to \"hook up\" with Curtis, shows how Curtis, although often disagreeing, even physically fighting with Poitier, still sees Poitier as an equal in their quest for freedom. Rather than \"sell out\" his friend, he would rather die trying to save him. The inevidable ending (remember that one of the rules in Old Hollywood was that the bad guys can never win)is quite moving.\n\nDefinitely among the established Hollywood Classics. Although many of the \"old ways\" have changed drastically since the late 50s, this film offers insight into a piece of Americana many people living today can still recall. An important piece of Film History, and highly recommended."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Nominated for nine Academy Awards including Best Picture, Stanley Kramer's THE DEFIANT ONES broke new ground by delivering its message of racial tolerance through a fast-moving blend of action and suspense. It remains a raw, powerful film that is as exciting as it is moving, real and literate. \n\nJohn \"Joker\" Jackson (Tony Curtis; The Vikings, Some Like It Hot) and Noah Cullen (Sidney Poitier; Guess Who's Coming to Dinner, In the Heat of the Night) are two convicts on the run. Escaping from a Southern work gang, the two men are bound together by an unbreakable iron chain and separated by an unbridled hatred towards each other. Relentlessly pursued by a bloodthirsty posse, they must put aside their differences if they are going to survive.\n\nHighly acclaimed upon release for its directing, writing, cinematography and acting, (Sidney Poitier won numerous awards for his role, including the coveted Silver Bear for Best Actor) THE DEFIANT ONES remains one of the most influential films of its era, and Eureka Classics is proud to present the film on Blu-ray for the first time in the UK in a special Dual Format edition.",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi813414425",
        "name": "THE DEFIANT ONES (Eureka Classics) New & Exclusive Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDNkZDczNWUtZmQ2Mi00NjQ2LWEwMDMtOGExMTYwOGRlNGNkXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDNkZDczNWUtZmQ2Mi00NjQ2LWEwMDMtOGExMTYwOGRlNGNkXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-04-09T10:58:32Z",
        "url": "https://www.imdb.com/video/vi813414425/"
    },
    "url": "/title/tt0051525/"
}