{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Hilary Minster",
            "url": "/name/nm0591678/"
        },
        {
            "@type": "Person",
            "name": "Robert J. Groden",
            "url": "/name/nm0342830/"
        },
        {
            "@type": "Person",
            "name": "Cyril H. Wecht",
            "url": "/name/nm0917064/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 610,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056790/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003716/"
        }
    ],
    "datePublished": "1991-09-27",
    "description": "A detailed examination of the assassination of U.S. President John F. Kennedy, with emphasis on the discrepancies and inconsistencies in the government's official version of events.",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzczODkzMjIxM15BMl5BanBnXkFtZTcwNDU0NDYxMQ@@._V1_.jpg",
    "keywords": "kennedy assassination conspiracy,john f. kennedy assassination,president,cover up,political cover up",
    "name": "The Men Who Killed Kennedy",
    "original_info": {
        "id": "The Men Who Killed Kennedy_1988",
        "name": "The Men Who Killed Kennedy",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gsellars-1"
        },
        "dateCreated": "2015-06-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0254033/"
        },
        "name": "Since neither the Government nor the Media will tell you...",
        "reviewBody": "Read this review (and copy it) now--it might not be here later.\n\nThis is required viewing for anyone who wants to know the truth about the JFK assassination. You'll never hear this information from any major network, magazine nor newspaper. They absolutely will never tell you. That's how much power the forces have who murdered our 35th President in a coup d'état. I would not be surprised if this review is never featured on IMDb once it's seen by those who control the media. If the government calls IMDb and says, \"We'd appreciate it if you'd remove this review,\" do you really think anyone would refuse? This series, along with Douglas Horne's video \"Finally hearing the TRUTH about the JFK cover-up\" provide an overwhelming amount of proof that JFK's murder was, in fact, a coup d'état and not the work of a the man who correctly identified himself on national TV as \"the patsy\" not too many hours before Jack Ruby (who was ordered to do so) murdered him.\n\nYou NEED to know, not only what happened then, but you need to connect the dots to understand why the wicked people who were behind JFK's murder are still in control.\n\nThe first question that should provoke is, \"Aren't they dead?\" Almost everyone who planned the coup is dead, but the self-serving power structure that was behind the scenes then is more powerful today and their plan is far more developed than 51 years ago and this information provokes too many questions along with a curiosity that these people DO NOT WANT the citizens to develop. They want you to just pretend we're \"The Land of the Free and the Home of the Brave\" while they continue their plans to make the backbone of this nation their serfs.\n\nThe evil scenario has so developed that you would never believe it no matter who tells you. You must discover it bit by bit for yourself. It's worse than 1984.\n\nThat's why you need to learn for yourself. This series and the video report of the Assassination Records Review Board are the very best places to start.\n\nFor a short bio on Douglas Horne: http://spartacus-educational.com/JFKhomeD.htm",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0254033/"
}