{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edward Judd",
            "url": "/name/nm0431837/"
        },
        {
            "@type": "Person",
            "name": "Janet Munro",
            "url": "/name/nm0613130/"
        },
        {
            "@type": "Person",
            "name": "Leo McKern",
            "url": "/name/nm0571674/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5614,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103186/"
        },
        {
            "@type": "Person",
            "name": "Wolf Mankowitz",
            "url": "/name/nm0542554/"
        },
        {
            "@type": "Person",
            "name": "Val Guest",
            "url": "/name/nm0346436/"
        }
    ],
    "description": "When the U.S. and Russia unwittingly test atomic bombs at the same time, it alters the nutation (axis of rotation) of the Earth.",
    "director": [
        {
            "@type": "Person",
            "name": "Val Guest",
            "url": "/name/nm0346436/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama",
        "Romance",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjZmYTUxZDktZDA5YS00OTE0LWFjZWItNjc1ZDU1Mjg5YmIyXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "newspaper,reporter,journalist,nuclear bomb,newsroom",
    "name": "The Day the Earth Caught Fire",
    "original_info": {
        "id": "The Day the Earth Caught Fire_1962",
        "name": "The Day the Earth Caught Fire",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bunuel1976"
        },
        "dateCreated": "2006-09-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054790/"
        },
        "name": "The Day The Earth Caught Fire (Val Guest, 1961) ***1/2",
        "reviewBody": "Surely one of the best - and most realistic - sci-fi dramas ever made: sober, unflinching and totally absorbing (at the time, I'm sure it must have also been quite scary) - yet the script, delivered at breakneck speed as befits its journalistic milieu, is extremely witty (in an obviously darkish tone). While the film has garnered a cult reputation along the years, it hasn't been given its due in my estimation and seems mainly to be appreciated by connoisseurs - though when released it was certainly well-received, copping as it did the BAFTA award for the year's Best Screenplay! \n\nDirector Guest had already dabbled in sci-fi and even then, despite the fanciful plots concerned, he gave it a ring of truth by approaching the genre more or less as semi-documentary; this time, however, with paranoia about nuclear obliteration at its highest during the early 60s, it seemed more feasible than ever before and that anything was possible! The opening and closing moments are orange-tinted (the rest of the story is told in monochromatic flashback) in order to convey the tremendous heatwave which has enveloped Planet Earth - caused to spin off its axis by a number of simultaneous nuclear blasts! - on its way towards the Sun.\n\nThe film also incorporates the human element in the form of a blossoming romance (but given the appropriate tension by making it a love/hate relationship!) between maverick reporter Edward Judd (undergoing divorce proceedings from wife Renee' Asherson, who turns up for a 30-second bit!) and spirited meteorological employee Janet Munro; while both actors proved charismatic leads here, playing very well off each other, their careers faltered pretty quickly - Judd seemed to be typecast in sci-fi roles and was also something of a hellraiser, while Munro unfortunately fell prey to alcoholism and died quite young!\n\nLeo Mc Kern is simply marvelous as the burly yet dynamic Science Correspondent of the \"Daily Express\" who sees his pragmatic theories about Armageddon (which he still admits to being largely guesswork on his part) realized to their most horrific extent and Arthur Christiansen (Editior-in-Chief for many years of the real newspaper featured here), actually brought in as technical adviser, was persuaded to appear in it more or less as himself - which further adds to the film's striving for complete authenticity (extending also to the meticulous recreation of Fleet Street - London's famous newspaper sector - on a studio set, though some of it was shot on actual locations). All of this, then, is superbly captured by Harry Waxman's stark cinematography; also, though no official score for the film was composed, sparse use is made of appropriately ominous library cues chosen by Stanley Black (with the beat-nik rhythms of one particular scene provided by Monty Norman, who immediately afterwards became world-famous for composing the James Bond theme!). The film, too, manages some very effective crowd scenes (one featuring a pre-stardom Michael Caine as a copper!) - as are the various manifestations of catastrophe the world over (despite relying heavily, in the latter case, on the use of stock footage).\n\nEven if I was perfectly happy with Anchor Bay's R1 SE DVD - apart from the bland cover art, that is - I decided to purchase Network's R2 disc (though not before its price-tag had reasonably scaled down) due to an additional 8-minute interview with Leo McKern (recorded shortly before his death)...and a wonderful little extra it turned out to be too which, circumstances as they were, gave it added poignancy (and since then, even Val Guest himself has gone - who, of course, recorded an enthusiastic full-length Audio Commentary for the film moderated by Ted Newsom); that said, I miss the typically exhaustively-researched talent bios supplied by Anchor Bay - the biography section on the Network DVD is actually a misnomer, as it only provides filmographies for the director and the major cast members!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When the U.S. and Russia unwittingly test atomic bombs at the same time, it alters the nutation (axis of rotation) of the Earth.",
        "duration": "PT2M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3290612505",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjllNTE5M2EtYmQ0ZC00YTk5LWI4YzktZTM0MjAzNDg2YzJiXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjllNTE5M2EtYmQ0ZC00YTk5LWI4YzktZTM0MjAzNDg2YzJiXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-11T21:52:32.622Z",
        "url": "https://www.imdb.com/video/vi3290612505/"
    },
    "url": "/title/tt0054790/"
}