{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jason Statham",
            "url": "/name/nm0005458/"
        },
        {
            "@type": "Person",
            "name": "Shu Qi",
            "url": "/name/nm0795517/"
        },
        {
            "@type": "Person",
            "name": "Matt Schulze",
            "url": "/name/nm0776580/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 309052,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0048273/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079764/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051228/"
        },
        {
            "@type": "Person",
            "name": "Luc Besson",
            "url": "/name/nm0000108/"
        },
        {
            "@type": "Person",
            "name": "Robert Mark Kamen",
            "url": "/name/nm0436543/"
        }
    ],
    "datePublished": "2002-10-11",
    "description": "Frank Martin, who \"transports\" packages for unknown clients, is asked to move a package that soon begins moving, and complications arise.",
    "director": [
        {
            "@type": "Person",
            "name": "Louis Leterrier",
            "url": "/name/nm0504642/"
        },
        {
            "@type": "Person",
            "name": "Corey Yuen",
            "url": "/name/nm0477035/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk2NDc2MDAxN15BMl5BanBnXkFtZTYwNDc1NDY2._V1_.jpg",
    "keywords": "gunfight,mixed martial arts,car,motor vehicle,ex military",
    "name": "The Transporter",
    "original_info": {
        "id": "The Transporter_2002",
        "name": "The Transporter",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "freemantle_uk"
        },
        "dateCreated": "2013-07-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0293662/"
        },
        "name": "A B-Movie for the MTV generation",
        "reviewBody": "Back in the 1990s Luc Besson was a top action director in the US and France, best known for films like Leon and Nikita. In the early part of the 21st Century, he turned to producing and one of his major hits was The Transporter, the film that made Jason Statham into an action star.\n\nFrank Martin (Statham) is an ex-military man who turned into a driver for hire in the South of France. He lives by three rules: No.1 never change the deal, No.2 no names, No.3 never open the package. But on a job he opens the package to find a Chinese woman (Shu Qi) tied up and gag, resulting with him crossing an American gangster, Bettencourt (Matt Schulze) who wants Frank dead. Frank has to work with the woman, Lai, and a police detective, Inspector Tarconi (François Berléand), to bring down Bettencourt and his operator.\n\nThe Transporter takes a basic B-Movie plot and story and gives it an MTV flash. The highlight of the film is action sequences which director Corey Yuen injected a load of fun elements with martial arts, gun battles, an axe fight and the famous oil fight scene. There are flashy moments like when a gun is in the air and the downwards camera on a gun when a machine gun magazine clip drops to the ground. There is some weak CGI but it is rare and the best parts of the action is the practical effects and stunt work. The real problem with the action is at times there was too much quick cutting which made some of the action sequence and it made them hard to follow: this was the particularly the case with the fight in the bus which was too tight, too close and overly edited. The best sequence for me was the highway chase because it was easier to tell what was happening and for the most part the fighting and gun fights were well done.\n\nThe Transporter was Statham's first leading role outside of Guy Ritchie's films. He had the action chops with his physique and his martial arts ability and he was already showing his shy wit. But he gave his character a weak American accent which kept slipping. Likely Statham had enough charisma and was able to give Frank enough menace in his look. Statham also had very good chemistry with Qi who did have charm as Lai. The pair worked well and were surprisingly believable in the context of their world.\n\nThe Transporter lacked a threaten villain: Schulze played his role more as a man who is partier then a ruthless crime lord who will kill anyone who crosses him. Schulze's performance also did not help giving the character smug, frat boy characteristics. The film also introduces a character called Leon who was able to beat up and knock out Frank, leading you to think that there is going to be a showdown between the characters: but it never comes about, which is very disappointing.\n\nStanley Clarke gave The Transporter a more modern, techno score which was fitting for the most part, especially when it becomes pumping for the action sequences near the end. The score combined by the French setting reminded me a little bit of The Bourne Identity. But The Bourne Identity is a much more intelligentially stimulating film.\n\nThe Transporter is a very paced actioner that does not rest. There are fine action sequences throughout the film and a decent start to The Stath's action persona: but this is a film for Statham fans.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Coming Soon\"",
        "duration": "PT34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3455779097",
        "name": "The Transporter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2RjMjA2ZGQtMDJlMy00Mzk4LWJjNDYtNGJjMzczNzc3MGQwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2RjMjA2ZGQtMDJlMy00Mzk4LWJjNDYtNGJjMzczNzc3MGQwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:16:39Z",
        "url": "https://www.imdb.com/video/vi3455779097/"
    },
    "url": "/title/tt0293662/"
}