{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anthony Perkins",
            "url": "/name/nm0000578/"
        },
        {
            "@type": "Person",
            "name": "Arnoldo Foà",
            "url": "/name/nm0289450/"
        },
        {
            "@type": "Person",
            "name": "Jess Hahn",
            "url": "/name/nm0353916/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22449,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "alternateName": "The Trial",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057637/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086394/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017070/"
        },
        {
            "@type": "Person",
            "name": "Pierre Cholot",
            "url": "/name/nm0158971/"
        },
        {
            "@type": "Person",
            "name": "Franz Kafka",
            "url": "/name/nm0434525/"
        },
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        }
    ],
    "datePublished": "1962-12-22",
    "description": "An unassuming office worker is arrested and stands trial, but he is never made aware of his charges.",
    "director": [
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2JiZTM2ZWMtOWI5ZS00ZjI2LWI5OTktNTJjZmU2NzM4NGE2XkEyXkFqcGdeQXVyNDE0OTU3NDY@._V1_.jpg",
    "keywords": "dystopia,paranoia,uncertainty,judicial system,surrealism",
    "name": "Le procès",
    "original_info": {
        "id": "The Trial_1962",
        "name": "The Trial",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stryker-5"
        },
        "dateCreated": "1999-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057427/"
        },
        "name": "\"The Logic Of A Dream\"",
        "reviewBody": "Franz Kafka was a citizen of the moribund Austro-Hungarian Empire, a dead culture in which mere administration had replaced government. Aware that its civilisation was decaying, the Austrian ruling class of Kafka's day could summon up no vitality or creativity, and devoted itself to suppressing 'The Revolution'. A state with thirteen languages and twice that number of separatist movements spent all its time trying to retard its own centrifugal forces. Austria-Hungary in these final decades was a honeyless hive in which minor officials and secret policemen busied themselves, striving feverishly to preserve the unpreservable. Kafka's dark novels capture the ugly mood of a dying political system whose instincts were authoritarian and whose inefficiency sapped all hope of reform.\n\nIn 1962, Welles was struggling through his locust years. Having long since alienated himself from Hollywood's money, he was living a vagabond life in Europe, flitting back and forth across the continent to scrape funds together, plan stage productions which hardly ever came to fruition, and sleepwalk through a dozen cameo roles in other people's films. The critical and financial catastrophe of 'Chimes' was hanging over him like a pall, and he had far too many distractions - squabbles with his Irish partners, tax bills in London and potentially ruinous law suits to stave off. With all this to contend with, he was still sporadically shooting portions of \"Don Quixote\" in Spain, a stuttering project that was by now in its sixth year of filming. Welles was desperately short of money, and as his biographer Higham puts it, \"he could manage almost anything except austerity\".\n\nA harmless, inconsequential clerk wakes up one morning to find himself accused of something (he never discovers what). Secret policemen enter his bedroom and subject him to a frightening interrogation in which every answer provokes a new line of questioning. This is psychological torture, the mind's innate sense of justice constantly probing for some higher reference-point, some appeal to fairness, when in fact none exists. Josef K returns repeatedly to the obvious question, \"But what have I done?\" But there are no rules of justice here, no recourse to an autonomous code of law. \"You have the unmitigated gall to pretend you don't know?\"\n\nA cry of anguish from the individual who finds himself overwhelmed by soulless bureaucracy, \"The Trial\" is a deeply personal statement by Welles, and as Higham puts it, \"a symbol, if there ever was one, of his own career\". Welles had been the enfant terrible whose erratic genius had alienated the big Hollywood studios. Cut off from the big money, he was to spend the subsequent forty years globetrotting aimlessly, picking up work as best he could.\n\nAutobiographical elements of Kafka's own life, contained in \"The Trial\", are given prominence in the film. Austria-Hungary launched World War One in the same year that Kafka began work on the novel. Ironically, the limited war against Bosnia, intended to restore Austria's international credibility, turned into a conflagration bigger and more horrific than anything previously experienced on earth, and set in train the global violence which was to characterise the twentieth century. It also destroyed Austria-Hungary. Welles closes this story of 1914 with an image of nuclear catastrophe, stressing the oneness of the century's horror. Kafka was bullied by his father, and reference is made in the course of the film to K's sense of filial guilt. The office is depressing and demeaning, echoing Kafka's own experiences as a clerk in a bloated bureaucracy.\n\nThe State is remorseless and pitiless, grinding down and perverting even the strongest of human bonds, those of familial and sexual love. K is forced to reject his little cousin Irmie (Maydra Shore), who has to remain 'outside'. Later, an allegation of sexual impropriety concerning Irmie arises. Any magnanimity towards another is interpreted by the authorities as a denunciation. The torture scenes involving the secret policemen are the most disturbing part of the film, both because K realises how his own protests have borne poisoinous fruit, and because of the grinning obsequiousness of the victims. The State turns its problems into spineless curs who acquiesce in their own degradation.\n\nNot only does K find himself becoming an accuser: he even assumes the role of interrogator, questioning Bloch and the Defendants. Anyone who is not a keyholder within the pitiless apparatus of The State cannot help but take on its deadly pallor. Keys are important. Leni, the Court Guard and Zitorelli are empowered through possessing keys. They are a corrupt priesthood in this cult of political disease.\n\nKafka's experiences with women were deeply ambivalent. He had many intense relationships in his life, none of which proved satisfactory. His book treats women as both temptresses and objects of loathing. Welles follows this line, the women being desirable guide-figures and also deformed monstrosities. The trunk-carrier, Lena and the hunchback girl all have bodily malformations.\n\nWelles shot most of the film in Zagreb, capturing strikingly the two clashing styles of architecture of Mittel-Europa, overblown ugly Habsburg baroque and drab communist functionalism. It is as if the Prague of Mozart cannot help but decay into the Prague of Krushchev. \"Ostensibly free\" is the best K can hope for, and 'ostensibly individual' is our optimum condition, as the shadows of the Stalinist apartment blocks crowd in on us."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT3M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2136456217",
        "name": "The Trial",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWUwOTExYmUtMmYwNi00NDA0LWFlNGUtZTA1NjI0Yzg1ZDE0XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWUwOTExYmUtMmYwNi00NDA0LWFlNGUtZTA1NjI0Yzg1ZDE0XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-03T17:13:07.871Z",
        "url": "https://www.imdb.com/video/vi2136456217/"
    },
    "url": "/title/tt0057427/"
}