{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Malkovich",
            "url": "/name/nm0000518/"
        },
        {
            "@type": "Person",
            "name": "Armin Mueller-Stahl",
            "url": "/name/nm0000090/"
        },
        {
            "@type": "Person",
            "name": "Gottfried John",
            "url": "/name/nm0424167/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2626,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "The Ogre",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027625/"
        },
        {
            "@type": "Person",
            "name": "Michel Tournier",
            "url": "/name/nm0869675/"
        },
        {
            "@type": "Person",
            "name": "Jean-Claude Carrière",
            "url": "/name/nm0140643/"
        },
        {
            "@type": "Person",
            "name": "Volker Schlöndorff",
            "url": "/name/nm0772522/"
        }
    ],
    "datePublished": "1996-09-12",
    "description": "Frenchman Abel Tiffauges likes children, and wants to protect them against the grown-ups. Falsely suspected as child molester, he's recruited as a soldier in the 2nd World War, but very soon he is taken prisoner of war. After shor...",
    "director": [
        {
            "@type": "Person",
            "name": "Volker Schlöndorff",
            "url": "/name/nm0772522/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4MTYyMzIzNl5BMl5BanBnXkFtZTcwNzg2OTQxMQ@@._V1_.jpg",
    "keywords": "forced sex,boyfriend girlfriend relationship,boy in jeopardy,children,castle",
    "name": "Der Unhold",
    "original_info": {
        "id": "The Ogre_1996",
        "name": "The Ogre",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lawprof"
        },
        "dateCreated": "2001-11-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118043/"
        },
        "name": "Treason in the Name of Child Protection",
        "reviewBody": "Abel is not simply slow-witted, he is morally shortchanged and has little if any ability to recognize even the reality much less the depth of his willing collaboration with the Germans. Abel is a survivor and while his concern for the children being trained as proto-Nazis in an ancient castle is real, so is his ruthlessness in collecting them by force for his German superiors with the aid of snarling Dobermans.\n\nThe film abounds in caricatures beginning with an outdoor picnic by complacent, indeed moronic, French officers who fail to even remotely perceive the danger of the onrushing Wehrmacht. Reichsmarshall Goring is portrayed as a grinning fool except when he approaches the state of barking madness. This is a legitimate dramatic device but the real Goring, cured before World War II of doctor-induced morphine addiction, was more complex and, in that sense, more interesting (decades ago I took a psychology course with Dr. Gilbert, who examined Goring at Nuremberg and wrote a book about the experience which is still available in second-hand bookshops. HIS Goring was chilling, no one to laugh at.).\n\nThe film is most effective when it eerily recreates what must have been the almost erotic attraction of nighttime rallies with flags, bunting, torches and the steady beat of martial music. That little boys were inculcated with the madness of Nazism through these rituals is powerfully shown here.\n\nIt was hard for me to care about Abel one way or the other but the character is well-acted as are the other main roles."
    },
    "url": "/title/tt0118043/"
}