{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Stacy Keach",
            "url": "/name/nm0005078/"
        },
        {
            "@type": "Person",
            "name": "John Hammond",
            "url": "/name/nm0358713/"
        },
        {
            "@type": "Person",
            "name": "Julia Duffy",
            "url": "/name/nm0240564/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1747,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0185617/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041442/"
        },
        {
            "@type": "Person",
            "name": "John Leekley",
            "url": "/name/nm0498637/"
        }
    ],
    "datePublished": "1982-11-14",
    "description": "America just before and during the Civil War, as seen through the eyes of an artist correspondent.",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ2NTU0Nzg5NV5BMl5BanBnXkFtZTcwMTkwMDAzMQ@@._V1_.jpg",
    "keywords": "american history,confederate,journalist,american civil war,army",
    "name": "The Blue and the Gray",
    "original_info": {
        "id": "The Blue and the Gray_1982",
        "name": "The Blue and the Gray",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2010-04-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083387/"
        },
        "name": "Brother Against Brother",
        "reviewBody": "Back in the early Sixties there was a short lived television series called The Americans about two brothers who after their father was killed decided to fight on opposite sides in the Civil War. The whole business about brother against brother was no exaggeration. Right up to the very top with Mary Todd Lincoln having relatives who fought for the Confederacy, families were torn apart. The Blue And The Gray brings that aspect of the Civil War better than any other film made for the big or small screen since The Americans.\n\nThe families are the Geysers and the Hales related by the mothers, Diane Baker and Colleen Dewhurst being sisters. The Hales are from Gettysburg, Pennsylvania and the Geysers from what would now be West Virginia in and around Harper's Ferry and that's not even 100 miles distance. But the families are true to the sectional divide. \n\nWith the exception of John Geyser played by John Hammond who has made a black friend, a free man played by Paul Winfield who gets lynched for helping runaway slaves. He won't fight for a section that espouses slavery as a cause, but won't enlist in the Northern Armies either. A passing acquaintance played by Stacy Keach who gets himself involved in a lot of the major events of the war and married into the Hale family with Julia Duffy persuades Hammond to become a war correspondent and put his artistic talents to good use. Hammond becomes a pictorial chronicler of the seminal event of his generation.\n\nWithout ever losing control of the main story lines, what happens to the various Geyser and Hale family members, The Blue And The Gray captures the sweep and pageantry of the Civil War. Such real characters as Abraham Lincoln played by Gregory Peck and John Brown played by Sterling Hayden in what was his farewell performance do take a life of their own. With Peck we see a public and a private Lincoln which is true to the Lincoln mythology and yet quite a human character.\n\nIf I had to single out one performance that was especially touching it would be that of David W. Harper as one of the Hale brothers. The young man was eager to be the first to enlist in his town of Gettysburg, but he never made it to the battle that town became famous for. A not well covered portion of the war was the lack of sanitary facilities in army camps. Young Harper falls victim to dysentery and his performance will move you.\n\nA few years later North and South covered a lot of the same ground that this particular mini-series did and it was as well done as The Blue And The Gray. I would recommend them both highly especially for young audiences to gain a real understanding of what the Civil War meant to the average individual/",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Blue And The Gray",
        "duration": "PT35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi44022809",
        "name": "The Blue And The Gray",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTAzNWFmMjYtYzA4Ny00NTQyLWEzNTktN2UxMGRhZTNjMmU0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTAzNWFmMjYtYzA4Ny00NTQyLWEzNTktN2UxMGRhZTNjMmU0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-22T20:42:41.407Z",
        "url": "https://www.imdb.com/video/vi44022809/"
    },
    "url": "/title/tt0083387/"
}