{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Andrew",
            "url": "/name/nm5653841/"
        },
        {
            "@type": "Person",
            "name": "Brian Blessed",
            "url": "/name/nm0000306/"
        },
        {
            "@type": "Person",
            "name": "Richard Brimblecombe",
            "url": "/name/nm2257791/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 613,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103723/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103724/"
        },
        {
            "@type": "Person",
            "name": "Bob Carruthers",
            "url": "/name/nm0141094/"
        }
    ],
    "datePublished": "1996-04-12",
    "description": "In the early 14th century, Scottish warrior and Earl Robert the Bruce is crowned King of Scots, leading Scotland during the First War of Scottish Independence against England.",
    "director": [
        {
            "@type": "Person",
            "name": "Bob Carruthers",
            "url": "/name/nm0141094/"
        },
        {
            "@type": "Person",
            "name": "David McWhinnie",
            "url": "/name/nm0574761/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDkyNTM5Mzc1M15BMl5BanBnXkFtZTcwNTExNjMyMQ@@._V1_.jpg",
    "keywords": "character name as title,robert the bruce character,nickname as title,three word title,robert the bruce",
    "name": "The Bruce",
    "original_info": {
        "id": "The Truce_1996",
        "name": "The Truce",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "warriorbadger"
        },
        "dateCreated": "2012-08-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115766/"
        },
        "name": "'The Bruce' made me want to scoop my own eyes out...",
        "reviewBody": "What was the most irritating thing about this film?\n\nThe appalling acting? The revelation that medieval knights apparently fought with an assortment of *very* wobbly rubber axes and other assorted joke shop armaments (honestly, a Pythonesque cow flip would not have been misplaced). The fact that one of the most important battles in 14th century Europe looked more like a disorganised pub fight, with no discernible cues to the viewer as to who was English or Scottish? The incomprehensibly boring narrative? The most ham-fisted, cheesiest, cliché ridden 'tottie-scone' dialogue, ever? \n\nPerhaps all of the above.\n\nTo me, however, there was a general eclipse of all that. It was the following.\n\nThe quest for Scottish Independence was decades in the making. It saw some of the most deftifying, heroic, savage, heartbreaking and bloodthirsty history that's ever been. We're talking about a time that, when the Scottish defensive wall at Berwick developed a weak spot, children and woman were sent to fill the place to keep the invader out. Every man, woman and child was at war.\n\nIn 1996 Scotland deserved a 'proper' movie. Yes, Braveheart was a movie that *deserved* to be made, in it's identification and selling of Scottish history - I applauded it's success - but in doing so I also openly acknowledged the fact that it was a bad film. A very bad film.\n\nConsequently, 'The Bruce' served only to mutilate and befoul not only history itself, but the chance of one day exploring that history in a better capacity than Braveheart ever did - through film - by simply telling the story (trust me, a Screenwriter's dream - as it is, left well alone) on the back of a good budget and high-profile pitch.\n\nThe Director of the Bruce should be trialled for Cultural crimes and then, publicly, carted naked through the old streets of Edinburgh, before slowly being drawn against 'The Maiden'.\n\nShooting adverts for spam products might have been a challenge for him. Instead, he created the single worst movie on the planet (in every conceivable sense) with material that would have gifted a talented directorial new-start with a plethora of creative devices and opportunity. \n\nIn short, I wanted to scoop my own eyes out and replace them with cartoon bomb-jacks. And, in short, he ruined it for real directors of the future.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0115766/"
}