{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael C. Maronna",
            "url": "/name/nm0549535/"
        },
        {
            "@type": "Person",
            "name": "Danny Tamberelli",
            "url": "/name/nm0848543/"
        },
        {
            "@type": "Person",
            "name": "Judy Grafe",
            "url": "/name/nm0333763/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9648,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "TV-Y",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051202/"
        },
        {
            "@type": "Person",
            "name": "Will McRobb",
            "url": "/name/nm0574509/"
        },
        {
            "@type": "Person",
            "name": "Chris Viscardi",
            "url": "/name/nm0899531/"
        }
    ],
    "datePublished": "1993-11-28",
    "description": "This delightfully quirky show looks at the lives and adventures of two red-headed brothers with the same name.",
    "genre": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzMxNDkzZTctZTY5OS00MmZiLWJiOTgtM2YwODcwZGY1NjMxXkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "boy wears eyeglasses,girl wears eyeglasses,people with the same name,two characters with the same name,repetition in title",
    "name": "The Adventures of Pete & Pete",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Nick_Dets"
        },
        "dateCreated": "2003-02-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105933/"
        },
        "name": "The Best Show of the Early 90's!!",
        "reviewBody": "1993. What a good year for Nickelodeon. \"Rocko's Modern Life\" aired its first season and continued to break ground for animated television along with others such as \"Ren and Stimpy\", and \"Doug.\" The icing on the cake, though, is the spunky, indie show \"Pete and Pete\" with enough originality to spawn a film series.\n\nThere is an undeniable wonder of \"Pete and Pete\" with it a magical quirk that made it so appealing. It revolves around the two title brothers (big and little Pete) and a town filled with colorful, complex characters. Big Pete narrates his whimsical and poignant look at growing up with an intellectual commentary of struggling in a bizarre suburban world.\n\nThe best episodes? I've narrowed it down to three. The first, \"Yellow Fever\"...it is a clever and hilarious narration of tensions building on a long bus trip. Everyone on the bus has a problem with someone or something and conflicting feelings build and build as the wild day progresses. Notably the lovelorn bus driver Stu and a boy who's ear seems to be a target for everyone to flick. Things boil over in an insane, chaotic conclusion wrapped up in a settling and likable denouement which never lets the episode get over the top.\n\nNumber two is an episode called \"King of the Road\" which captures life on the road with an oddly adroit authenticity of the pains of a family vacation. In this episode, Pete falls in love with a girl who will turn into just another car passed on the highway, but it leaves him feeling like the unanswered question of why you only see on shoe and not two on the side of the road.\n\nFinally, there is an episode from which I can't remember the title, but it follows big Pete's struggle with a new responsibility as the ball collector at a driving range. Pete hides behind a costume of a grizzly bear to hide his humiliation and discovers himself as he finds different problems with his new job.\n\nA brilliantly funny characterization of the local superhero Arty by Tobi Huss and excellent music by Polaris make \"Pete and Pete\" a one of a kind winner. I grew up with this show and still find new interests in the episodes as it is thankfully showed on Noggin (God bless digital cable!)."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2985870105",
        "name": "The Adventures of Pete & Pete Trailer - Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDRjNjM5MjMtOGY3ZS00YmE3LWI3MDYtY2MzZGE3YWE5M2E1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDRjNjM5MjMtOGY3ZS00YmE3LWI3MDYtY2MzZGE3YWE5M2E1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-05T01:34:00.962Z",
        "url": "https://www.imdb.com/video/vi2985870105/"
    },
    "url": "/title/tt0105933/"
}