{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ingrid Thulin",
            "url": "/name/nm0862026/"
        },
        {
            "@type": "Person",
            "name": "Gunnel Lindblom",
            "url": "/name/nm0511458/"
        },
        {
            "@type": "Person",
            "name": "Birger Malmsten",
            "url": "/name/nm0540311/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20407,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "alternateName": "The Silence",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050989/"
        },
        {
            "@type": "Person",
            "name": "Ingmar Bergman",
            "url": "/name/nm0000005/"
        }
    ],
    "datePublished": "1964-02-03",
    "description": "Two estranged sisters, Ester and Anna, and Anna's 10-year-old son travel to the Central European country on the verge of war. Ester becomes seriously ill and the three of them move into a hotel in a small town called Timoka.",
    "director": [
        {
            "@type": "Person",
            "name": "Ingmar Bergman",
            "url": "/name/nm0000005/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjQyZWRlYjctZDRlZS00MjI1LTg2M2EtODEzYWNlNGUxZjkyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "female masturbation,nihilism,room,illness,translator",
    "name": "Tystnaden",
    "original_info": {
        "id": "The Silence_1963",
        "name": "The Silence",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "andrabem"
        },
        "dateCreated": "2007-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057611/"
        },
        "name": "Silence reveals",
        "reviewBody": "Ester, Anna and her little son, Johan. They arrive in a strange city in a strange country. The two sisters have a long-standing love-hate relationship covered by the veneer of a fragile truce. Johan (Jörgen Lindstrom) tries to hold on to his mother Anna (Gunnel Lindblom) but she's too busy with her own desires and resentments to pay him much attention. Ester (Ingrid Thulin), Anna's older sister, is very sick - she represents for Anna an authority figure (once feared and respected).\n\nEster, Anna and Johan are in a city whose language they don't understand and no one understands their language. Isolation, silence.\n\nThere's something surreal, almost buñuelesque, in \"The Silence\". Johan sees and feels many things, but he can't really understand them. The train is arriving in the city and Johan stares out of the train window - he sees many war tanks heading somewhere. He doesn't know what to do with himself... he wanders through the corridors of the hotel in which they are staying and he meets midgets from a wandering troupe. The relationship between the two sisters, Anna (his mother) and Ester (once so strong and now so very sick) is growing tenser. Johan tries to understand, walks along the hotel corridors, plays... he tries to lean on someone.\n\nWe see through the eyes of Johan (chaos and the search for love) and Anna (rebellion, desire, the search for something/someone) and Ester (fear and hope succeeding each other).\n\nEster, Anna and Johan - they are together but so very far apart. Johan, Anna's little son, is the only one that wants to establish a real connection, but when the film ends, he has already begun to suspect what life's about - the first steps to a rude awakening.\n\nThere are not many films like \"The Silence\". This film is really what could be called a masterpiece. It is very difficult for me to describe \"The Silence\" and the feelings/emotions it provoked in me. All I can say that it is a very rich film and each viewing will reveal new things and different angles to the viewer. \"The Silence\" is cinematic art in its purest form.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0057611/"
}