{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aldo Fabrizi",
            "url": "/name/nm0264762/"
        },
        {
            "@type": "Person",
            "name": "Gianfranco Bellini",
            "url": "/name/nm1106808/"
        },
        {
            "@type": "Person",
            "name": "Peparuolo",
            "url": "/name/nm2518733/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3801,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "The Flowers of St. Francis",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0004944/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062467/"
        },
        {
            "@type": "Person",
            "name": "Roberto Rossellini",
            "url": "/name/nm0744023/"
        },
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        },
        {
            "@type": "Person",
            "name": "Félix Morlión",
            "url": "/name/nm0605813/"
        }
    ],
    "datePublished": "1952-10-06",
    "description": "A series of vignettes depicting the lives of the original Franciscan monks, including their leader and the bumbling Ginepro.",
    "director": [
        {
            "@type": "Person",
            "name": "Roberto Rossellini",
            "url": "/name/nm0744023/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjg4NWU5ZjktNmZiMy00NDI4LWEzOGEtNmYzYWExNWNjMWYwXkEyXkFqcGdeQXVyMDY4MzkyNw@@._V1_.jpg",
    "keywords": "saint francis of assisi,franciscan,franciscan monk,roman catholicism,catholicism",
    "name": "Francesco, giullare di Dio",
    "original_info": {
        "id": "The Flowers of St. Francis_1950",
        "name": "The Flowers of St. Francis",
        "year": "1950"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2006-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0042477/"
        },
        "name": "Promotes compassion for the poor",
        "reviewBody": "The Criterion DVD release of Rossellini's Flowers of St. Francis offers a fully restored version in high contrast black and white of the long unavailable 1950 film, considered one of Rossellini's finest. It is interesting that two of the finest films about religion, The Gospel According to St, Matthew and Flowers of St. Francis, were directed by avowed atheists, (Pier Paolo Pasolini and Roberto Rossellini), both capturing, through non-professional acting and neo-realist technique, a sense of purity and poetry missing in the heavy-handed message of newer religious films. Unlike Pasolini, however, Rossellini's film does not contain peak dramatic moments or even a linear narrative.\n\nIt is a series of vignettes that does not attempt a history of the period or a biography of St. Francis of Assisi as did the woeful Brother Sun, Sister Moon by Zefferelli. Rather it shows Francis, a 13th century monk who founded the order known as the Franciscan Friars and his followers (particularly brother Ginepro) in easy going and often light-hearted fashion going about their daily life with devotion and humility before God. While I do not subscribe to the idea that allegiance to God requires extreme self-denial, the film is persuasive in showing the simple compassion of the Friars and how it changed the lives of the people around them, although the line between simple and simple-minded as depicted by Rossellini is often tenuous.\n\nFlowers does not attempt to bludgeon us with a point of view, but suggests by example that there is an alternative way to live our lives that does not involve ego and greed. The episodes illustrate different aspects of Franciscan life, all introduced by intertitles. In the first, the brothers seek to find shelter in a pouring rain in a little hut they have built in the woods near Assisi. When they arrive, they discover that a farmer has appropriated the hut with his donkey and refuses to let the brothers in. Francis responds by telling his followers, \"Have we not now reason to rejoice? Providence has made us useful to others.\" In another episodes, Ginepro cuts off a pig's foot for a meal requested by a hungry ailing brother. Unfortunately, no one questions what brother pig thinks about his leg being sacrificed and the episode left me feeling queasy.\n\nIn other sequences, the Friars prepare a rebuilt chapel to receive Sister Chiara, Francis meets a leper during his walk and embraces him in a childlike, loving manner, and Ginepro is provided lessons on how actions rather than words win souls for God. In one of the later sequences played mostly for laughs but with a potent message, Ginepro is in danger of losing his life to a group of bandits led by the corpulent Nicolaio until the power of faith rules the day. Flowers of St. Francis presents an idealized version of a \"pure\" form of Christianity and promotes love, humility, and compassion for the poor. While the film is a welcome antidote to the cynicism and despair common in films these days, ultimately it leaves the viewer to decide whether or not excessive missionary zeal practiced by those who are convinced they alone have the true faith has been a positive or negative force throughout history.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A series of vignettes depicting the lives of the original Franciscan monks, including their leader and the bumbling Ginepro.",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1739244057",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWQ1YzE2OWQtOWJiOS00OTlkLWIzYjUtNzEwZWE5NzE4YjgxXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWQ1YzE2OWQtOWJiOS00OTlkLWIzYjUtNzEwZWE5NzE4YjgxXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-04-19T18:04:24.793Z",
        "url": "https://www.imdb.com/video/vi1739244057/"
    },
    "url": "/title/tt0042477/"
}