{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rob Lowe",
            "url": "/name/nm0000507/"
        },
        {
            "@type": "Person",
            "name": "Thomas Haden Church",
            "url": "/name/nm0002006/"
        },
        {
            "@type": "Person",
            "name": "Paget Brewster",
            "url": "/name/nm0108295/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2430,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063786/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062103/"
        },
        {
            "@type": "Person",
            "name": "James Gunn",
            "url": "/name/nm0348181/"
        }
    ],
    "datePublished": "2000-09-18",
    "description": "The sixth or seventh best superhero team in the world pursue their rightful place in the harshly competitive world of toy tie-ins and fighting evil.",
    "director": [
        {
            "@type": "Person",
            "name": "Craig Mazin",
            "url": "/name/nm0563301/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Action",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzMTI5MDYwM15BMl5BanBnXkFtZTcwNDk0MzEyMQ@@._V1_.jpg",
    "keywords": "non comic book superhero,2000s,superhero action,superhero fantasy,superhero sci fi",
    "name": "The Specials",
    "original_info": {
        "id": "The Specials_2000",
        "name": "The Specials",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "J. Spurlin"
        },
        "dateCreated": "2008-11-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0181836/"
        },
        "name": "Joyless comedy about superheroes",
        "reviewBody": "The Specials, the sixth or seventh greatest superhero group in the world, count the geeks and the oddballs among their fans. They don't have the prestige or the money that a group like the Crusaders has. But they've found their niche as the Ringo Starr of superhero teams. There's the Weevil (Rob Lowe), the most popular member and the one pursued by other teams; the blue-skinned, foul-mouthed Amok; Minute (My-noot) Man, who is sensitive about his oft-mispronounced name; the ever-sneering Deadly Girl; the naive and boyish U.S. Bill; the Strobe, the leader of the team; the Strobe's wife, Ms. Indestructible, who is having an affair with the Weevil; the irritatingly perky Power Chick; the green-skinned weirdo, Alien Orphan; the fat and pompous Mr. Smart; and Eight, who has eight different bodies. The new member is a longtime fan who calls herself Nightbird. Unfortunately, she joins just when Cosgrove Toys creates a new line of action figures based on the Specials. The company's disastrous press conference could mean the end to this cut-rate super-group.\n\n\"The Specials\" is a comedy about superheroes that, thanks to a tiny budget, has no special effects and no scenes where the heroes demonstrate their powers (until the very end). For the filmmakers to have gotten away with this deficiency, they would have needed smart writing and fascinating characters. They had neither. The plot involves a possible dissolution of the super-team, but because everyone is contemptuous of one another, and because no one is especially likable anyway, we're not exactly heartbroken at the idea. The writer, James Gunn (who also plays Minute Man), made no attempt to create believable human beings, even though 82 minutes is too long to spend with shallow parodies of comic book drawings. The gags are paramount, and the gags aren't even funny.\n\nThe movie earns a certain perverse admiration from us for studiously avoiding the inevitable; and then it ruins even that with a brief, godawful special effects scene at the end that isn't even enjoyably cheesy; it's just bad. Kudos to the makeup department for their striking work on the blue-skinned, purple-lipped, red-eyed Amok (Jamie Kennedy). Otherwise, the film is worthless."
    },
    "url": "/title/tt0181836/"
}