{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Timothy Dalton",
            "url": "/name/nm0001096/"
        },
        {
            "@type": "Person",
            "name": "Maryam d'Abo",
            "url": "/name/nm0001881/"
        },
        {
            "@type": "Person",
            "name": "Jeroen Krabbé",
            "url": "/name/nm0469103/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 101353,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054040/"
        },
        {
            "@type": "Person",
            "name": "Richard Maibaum",
            "url": "/name/nm0537363/"
        },
        {
            "@type": "Person",
            "name": "Michael G. Wilson",
            "url": "/name/nm0933865/"
        },
        {
            "@type": "Person",
            "name": "Ian Fleming",
            "url": "/name/nm0001220/"
        }
    ],
    "datePublished": "1987-07-31",
    "description": "James Bond is sent to investigate a KGB policy to kill all enemy spies and uncovers an arms deal that potentially has major global ramifications.",
    "director": [
        {
            "@type": "Person",
            "name": "John Glen",
            "url": "/name/nm0322515/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjI4MjBmYzItYTY5OC00OWYzLWE0NWYtZDQxNDQxM2QzYjA4XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "defection,soviet afghanistan war,betrayal,deception,007",
    "name": "The Living Daylights",
    "original_info": {
        "id": "The Living Daylights_1987",
        "name": "The Living Daylights",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "David_Frames"
        },
        "dateCreated": "2004-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0093428/"
        },
        "name": "A New Era Dawns...Temporarily.",
        "reviewBody": "The year: 1987, the Man: Timothy Dalton, the film? The Living Daylights and good news for adults across the globe because after sending off their kids to joke it up with Roger Moore for over a decade they could finally sit down to a Bond movie which, whisper it quietly, resembled a real thriller...and a good one at that. We should be grateful for Dalton's two stints as the Bond because they came within a whisp of never existing. Had the studio had their way, Moore would have been wheeled off for Brosnan and a serious reinvention of the series would have been dropped in favour of the, er, \"winning\" return to form we've been privileged enough to have enjoyed since 1995's Goldeneye.\n\nDalton's take on the character was to return it (and I hope you're sitting down) to the brooding, cruel and methodical assassin envisioned by Flemming in his original stories. TD was a RADA trained Shakespearian actor for God's sake and certainly had no intention of smirking and punning his way through each adventure. Dalton said that half the world loved Connery and the other half loved Moore (which is hedging your bets a bit) but he bravely chose to play it like neither. We can only imagine at the relief Richard Maibrum must have felt, given the opportunity to finally write an real screenplay tailored to the new approach, having been no doubt advised in previous outings that plot and character was superfluous to requirements. The result is a story set in the real world . Goodbye super-villains bloated on world domination plots and hello to arms dealers, Afgan resistance fighters, double crosses and political assassinations. After so many remakes of You Only Live Twice it certainly is a tonic and Dalton's hard-edged, professional spy washes over you like a radox bath following a 300 mile trek through the Gobi. His performance reinvigorates the series and makes all thats old new again. The familiar elements are all here - the car, the girls, the locations, but anchored in a real cold war setting with Pretenders loving KGB agents round every corner and the credible whiff of counter-espionage, the whole thing crackles with an energy and an urgency that would have been a fantasy in any of Moores mirth-ridden efforts. Even John Barry's music, in his final contribution to the series, is a fresh and exciting affair - blending high tempo action cues with his usual gift for generating a sense of foreboding and pathos in equal measure. Yes, Bond hadn't felt this good or LOOKED this good since the mid-sixites but as if to prove the old adage that you can't have too much of a good thing, we didn't. Audiences found Dalton humorless and the heady excesses of good story, three-dimensional characterisation and real world setting somewhat distracting. After all, where were all the puns (Dalton's \"he got the boot\" aside), the jokes and the evil bloke at the end who plans to ravage the planet with deadly spores? People were beginning to ask and Dalton still had two films to go on his contract...."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4162371097",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGUzNDA3YmYtYWNiZS00YjAxLTk3OTEtMTM5MWFhMjI2ZjVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGUzNDA3YmYtYWNiZS00YjAxLTk3OTEtMTM5MWFhMjI2ZjVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-29T13:17:15.557Z",
        "url": "https://www.imdb.com/video/vi4162371097/"
    },
    "url": "/title/tt0093428/"
}