{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anna Magnani",
            "url": "/name/nm0536167/"
        },
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Marisa Pavan",
            "url": "/name/nm0667542/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4231,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0128419/"
        },
        {
            "@type": "Person",
            "name": "Tennessee Williams",
            "url": "/name/nm0931783/"
        },
        {
            "@type": "Person",
            "name": "Hal Kanter",
            "url": "/name/nm0437900/"
        }
    ],
    "datePublished": "1955-12-13",
    "description": "A Sicilian seamstress who idolizes her husband must deal with several family crises upon his sudden death.",
    "director": [
        {
            "@type": "Person",
            "name": "Daniel Mann",
            "url": "/name/nm0542702/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzgxYTQ0OGItOGExZi00MDg0LWE3MTUtMTA5OTZlZmRiMDAzXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "truck driver,widow,italian american,seamstress,tattoo",
    "name": "The Rose Tattoo",
    "original_info": {
        "id": "The Rose Tattoo_1955",
        "name": "The Rose Tattoo",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "burgbob975"
        },
        "dateCreated": "2002-03-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048563/"
        },
        "name": "An uneven film, with one great performance",
        "reviewBody": "Time has not been kind to The Rose Tattoo, a 1955 release that garnered three Oscars, plus additional nominations. Originally written by Tennessee Williams as a play, the film's shortcomings now cancel out much that audiences might have found entertaining about it 47 years ago. The deficits include bad acting all around (with the exception of the star, Anna Magnani) and an uneven script by Williams (who among other things was apparently clueless about how an adolescent boy and girl, attracted to each other, might talk or behave).\n\nPlaying the role of the dim-witted but sexy truck driver who courts a grieving widow (Magnani), Burt Lancaster gives a highly exaggerated \"comedy performance\" that is occasionally embarrassing to watch. A great natural actor in his other films and noted for his controlled physicallity, Lancaster here gawks, bends, waves his arms, makes faces, cries (clownishly), and is generally ape-like, all the while failing to get inside the character he's portraying. (Leading American actors have always had a problem convincingly playing people less intelligent than themselves; see Lon Chaney, Jr. in Of Mice and Men or, more recently, Jack Nicholson in Prizzi's Honor for more examples of this.)\n\nUnder the direction of Daniel Mann (who also directed the play), and intended as a comedy-drama, almost everything in Rose Tattoo is either loud or overblown (though it may have been Williams' wish that it be played this way in a misguided attempt to heighten the humorous dimension of the story). The host of supporting characters are all portrayed as one-dimensional grotesques or harpies who telegraph their every thought or emotion by arm-waving, facial contortions, or semiphoring the kind of villainousness that went out in the early '30s. Nor does Mann seem to have fine control over the physical goings-on by cast members. In some scenes small groups of people rush back and forth like obedient cattle, too obviously responding to off-camera direction; and at the high school prom a male extra noticeably freezes for a second or two as he waits for Marisa Pavan and her sailor dance partner to leave the floor ahead of him.\n\nMagnani, for whom the play was written (though she just appeared in the film, after she had mastered the rudiments of the English language), comes across as the only real human being among a slew of posturing marionettes. Her portrayal of a terribly put-upon Sicilian widow fighting off the knowledge of her dead husband's infidelity and desperately trying to maintain her dignity in the face of snide remarks and out-and-out insults is awe-inspiring. I doubt that her performance has ever been matched by any American actress before or after. (Only Vivien Leigh, a Brit, comes to mind as a mentally disintegrating Blanche du Bois in the film version of Williams' A Streetcar Named Desire.) Williams, who was famously homosexual, understood and probably identified with vulnerable women. (Years before, his own sister, when a young woman, had been seriously mentally ill, \"put away,\" and had undergone a lobotomy. It was no coincidence that her name was Rose.)"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi387431961",
        "name": "The Rose Tattoo",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWY0ZTYyYjUtOTlhMC00ZTgwLTgxYzEtNmRhYWFiMDU4ZTY3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWY0ZTYyYjUtOTlhMC00ZTgwLTgxYzEtNmRhYWFiMDU4ZTY3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-27T17:02:48.801Z",
        "url": "https://www.imdb.com/video/vi387431961/"
    },
    "url": "/title/tt0048563/"
}