{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jimmy Durante",
            "url": "/name/nm0002051/"
        },
        {
            "@type": "Person",
            "name": "Eddie Jackson",
            "url": "/name/nm0413482/"
        },
        {
            "@type": "Person",
            "name": "Jack Roth",
            "url": "/name/nm1042198/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 43,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0275786/"
        }
    ],
    "datePublished": "1954-10-02",
    "description": "A half-hour variety show, hosted by the veteran vaudevillian Jimmy Durante. The show aired on NBC from October 1954, to June 1956.",
    "genre": [
        "Comedy",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzRiYmY4OGUtY2FkYi00MmJhLWIzNDItNDVhMjIzN2QzZGI4XkEyXkFqcGdeQXVyMjcyMDU4NA@@._V1_.jpg",
    "keywords": "four word title,variety show,actor name in series title,stand up comedy,stand up comedian",
    "name": "The Jimmy Durante Show",
    "original_info": {
        "id": "The Unknown Jimmy Durante_2000",
        "name": "The Unknown Jimmy Durante",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "krorie"
        },
        "dateCreated": "2006-07-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0046613/"
        },
        "name": "And good night, Mrs. Calabash--wherever you are",
        "reviewBody": "\"The Jimmy Durante Show\" on the NBC network was just that, a half hour with the schnozzola. Though he had guests and regulars, including his old vaudeville partner, Eddie Jackson, the man with the raspy voice was the show. Jimmy was the one the TV audience tuned in to see and hear.\n\nThe setup was appropriate for highlighting Durante and his guests. Durante was the owner of a small club. One of his duties was to audition talent for the Club Durant. He also had to deal on a day to day basis with his employees, including Jules Buffano, pianist, Jack Roth, drummer, and a chorus line called The Durante Girls.\n\nBut the heart of the show continued to be Jimmy Durante sitting at the piano performing material that had made him famous. Wearing his trademark ruffled hat, Jimmy would look down at the keyboard, shaking his head in rhythm, singing \"A-ink, a-inka doo, a-ink-a dinka doo,\" then pause to either tell a joke or say one of his noted lines. He might slam the keyboard cover down, jump up, grab his hat, look straight into the camera and comment, \"Everybody wants to get into the act!\" \n\nMany of the comics on TV during its early days were currently popular at the movies and on the radio; such acts as Abbott and Costello, Martin and Lewis, Donald O'Connor, who at first shared alternate weeks with Jimmy Durante on what was called \"Texaco Star Theatre,\" Martha Raye, Lucille Ball, Bob Hope, Red Skelton, and Jack Beny are good examples. Most of the others were new television personalities such as Sid Caesar, Ernie Kovacs, and Imogene Coca. Few were veteran comedians from the Vaudeville days, most long retired or deceased. Oldtimers such as Ed Wynn and Eddie Cantor enjoyed a brief revival as a result of television, but Jimmy Durante was the most successful, though now in his 60's. As a result he found himself making movies again. In \"Billy Rose's Jumbo,\" nearly a decade later, Jimmy has one of the best lines ever. Confronted by the authorities while leading a stolen circus elephant, Jimmy looks perplexed and exclaims, \"What elephant?\" \n\nThe most revered part of Jimmy's show was the finale when he would slowly fade away walking through a succession of spotlights, pausing in each one to either look down or look back at the audience. He did this after bidding farewell, commenting, \"And good night, Mrs. Calabash--wherever you are!\" Who was Mrs. Calabash? No one but Jimmy ever knew. This led to all sorts of speculation. The most accepted came to be that it was a pet name for Jimmy's first wife, Jeanne Olsen. Another was that it referred to the place where Jimmy and Jeanne lived, Calabasas, California. The latest is perhaps the correct one, that it refers to the owner of a restaurant in Calabash, North Carolina, where Jimmy and his troupe stopped once to eat. He was so taken by the food, the service, and the chitchat that when he left he turned and said,\"Good night, Mrs. Calabash,\" not knowing the lady's name. All these could be apocryphal. Only Jimmy knew. His reply when asked: \"Ha-cha-cha-chaaaaaaa!\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0046613/"
}