{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jim Henson",
            "url": "/name/nm0001345/"
        },
        {
            "@type": "Person",
            "name": "Frank Oz",
            "url": "/name/nm0000568/"
        },
        {
            "@type": "Person",
            "name": "Dave Goelz",
            "url": "/name/nm0324397/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21958,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108294/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005883/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042549/"
        },
        {
            "@type": "Person",
            "name": "Tom Patchett",
            "url": "/name/nm0665305/"
        },
        {
            "@type": "Person",
            "name": "Jay Tarses",
            "url": "/name/nm0850695/"
        },
        {
            "@type": "Person",
            "name": "Frank Oz",
            "url": "/name/nm0000568/"
        }
    ],
    "datePublished": "1984-07-13",
    "description": "Kermit and his friends go to New York City to get their musical on Broadway only to find it's a more difficult task than they anticipated.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Oz",
            "url": "/name/nm0000568/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmFiYTU2YjEtNjcxNy00MzViLTljMGEtNWI4OTU0ZTRhZTM1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDIwODAwNzg@._V1_.jpg",
    "keywords": "borough name in title,the muppets,puppetry,four word title,action girl",
    "name": "The Muppets Take Manhattan",
    "original_info": {
        "id": "The Muppets Take Manhattan_1984",
        "name": "The Muppets Take Manhattan",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TJBNYC"
        },
        "dateCreated": "2001-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0087755/"
        },
        "name": "\"That'll teach ya to mess with a lady!\"",
        "reviewBody": "I distinctly remember seeing \"Muppets Take Manhattan\" in the movie theater when I was 8 years old--following the film, I immediately demanded that my parents purchase the soundtrack LP (yes, on vinyl!). I loved this movie then; I love it still.\n\nActually, it's my favorite among the first three, classic Muppet films; \"Muppet Movie\" is great but overlong, while \"Great Muppet Caper\" is terrific, but seems a bit dated now. \"Muppets Take Manhattan,\" on the other hand, never fails to entertain me, still makes me laugh out loud (the purse-snatching scene; Kermit in his Bert Convy 'fro), and even tugs at my heartstrings.\n\nWhat's particularly nice about this adventure is that it's an affectionate love letter to Hollywood musicals of yore, without being overly parodying. The musical comedy cliches are presented in a matter-of-fact manner; just as we were expected to suspend our disbelief when Ruby Keeler went out onstage a nobody but \"came back a star!\", we suspend our disbelief to encompass a group of talking animals putting together a big budget Broadway musical in 2 weeks. These kind of hoary plot devices are presented straight-faced, without any self-conscious \"winking\" or irony.\n\nThe songs are all pretty darn terrific; the show-stopping \"Together Again\" finale is as good as any contemporary musical number of the last 20 years or so, while \"It's Time for Saying Goodbye\" always puts a lump in my throat: it's sentimental without being maudlin. The finale, \"He/She Makes Me Happy\" goes from being sweet to comically over-the-top in less than 3 minutes, and it's a joy.\n\nThe expected parade of cameos work well within the structure, without being intrusive. My particular favorites are Liza Minnelli's (the whole Sardi's scene is wonderful), Linda Lavin's (another terrific comedy moment: \"YOU are Mr. Enrico Tortellini of Passaic, New Jersey!\"), and Joan Rivers' (another gem). The Muppet performers are their usual, endearing selves: lovable, warm, likable. The \"love triangle\" between Kermit, Piggy and the human Jenny plays surprisingly well, and Piggy's jealous reactions are hysterical.\n\nThese days, \"family entertainment\" usually means disgustingly white-washed pap that anyone over 10 or 11 would find either sedating or inane. (Disney's live action \"101 Dalmations\" and its sequel spring to mind.) The Muppet movies proved that a G-rated film could be intelligent, witty, funny and entertaining for all ages. It's a formula that has yet to be improved upon, and \"The Muppets Take Manhattan\" just might be the best example of it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi116850969",
        "name": "The Muppets Take Manhattan",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmUwMmI4YTktOWNkYy00YjVmLWE3ZjgtMGJkMWEwNGNlYjg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmUwMmI4YTktOWNkYy00YjVmLWE3ZjgtMGJkMWEwNGNlYjg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:58:12Z",
        "url": "https://www.imdb.com/video/vi116850969/"
    },
    "url": "/title/tt0087755/"
}