{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Myrna Loy",
            "url": "/name/nm0001485/"
        },
        {
            "@type": "Person",
            "name": "Robert Mitchum",
            "url": "/name/nm0000053/"
        },
        {
            "@type": "Person",
            "name": "Louis Calhern",
            "url": "/name/nm0129894/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1148,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020540/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044182/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008366/"
        },
        {
            "@type": "Person",
            "name": "John Steinbeck",
            "url": "/name/nm0825705/"
        }
    ],
    "datePublished": "1949-03-28",
    "description": "A ranch boy is gifted with a colt, grows to love him but the colt escapes, with tragic results.",
    "director": [
        {
            "@type": "Person",
            "name": "Lewis Milestone",
            "url": "/name/nm0587277/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama",
        "Family",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjZiZDIzZjQtMWNmZC00YmY4LTgxNGYtMmU5NDc2MGIyOTc3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
    "keywords": "sick animal,toad,croaking,girl,snake",
    "name": "The Red Pony",
    "original_info": {
        "id": "The Red Pony_1949",
        "name": "The Red Pony",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "matchettja"
        },
        "dateCreated": "2008-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041792/"
        },
        "name": "Worth watching for Mitchum and Calhern performances",
        "reviewBody": "\"The Red Pony\" tells the story of a ranching family living near Salinas, California and the obsessive love of a boy for his pony. Within that story, certain dramas are being played out; a man unsure of himself and his ability, feeling a stranger in the place he lives, even within his own family; his wife, struggling to keep the family homestead going, unsure of her man's determination and grit; an old man whose time has passed him by, struggling to cope in a world he no longer fully comprehends; a boy coming of age, having to deal with nature's cruel injustice as well as the knowledge that adults are not infallible but also make mistakes. \n\nRobert Mitchum is outstanding in the role of the ranch hand, Billy Buck, who seems to know everything there is to know about horses, thus earning the adoration of Tom, the ranch owner's son. Equally impressive is grandfather Louis Calhern, a former wagon train boss no longer needed for such kind of work. He is reduced to recycling stories that no one wishes to hear any longer. Myrna Loy, on the other hand, seems a bit too casual and matter of fact to be the challenged wife of an unsteady partner in the ranching business. She is much better suited to romantic comedy, playing such roles as Nora, the madcap wife in \"The Thin Man\" series. Peter Miles, who plays Tom, is satisfactory, but not as charismatic as some other child actors of the period. \n\nThe gifted American composer, Aaron Copland, does the music score, teaming successfully with the great American story teller, John Steinbeck, who wrote the screenplay based on his novel. \"The Red Pony\" may not be the best adaptation of Steinbeck to appear on the silver screen, on the order of \"The Grapes of Wrath\" or \"East of Eden\", but it is certainly worth watching, especially for the performances of Mitchum and Calhern, as well as for the music of Copland.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0041792/"
}