{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Nicole Jaffe",
            "url": "/name/nm0415476/"
        },
        {
            "@type": "Person",
            "name": "Casey Kasem",
            "url": "/name/nm0440487/"
        },
        {
            "@type": "Person",
            "name": "Don Messick",
            "url": "/name/nm0582106/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5166,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024579/"
        }
    ],
    "datePublished": "1972-09-09",
    "description": "The Mystery Inc. gang investigate more supernatural sightings with various guest stars and characters.",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWEwYTZhMGQtMDU0ZC00NmYyLTk0OWEtMjg1OTY5OTY5N2EyXkEyXkFqcGdeQXVyMTEzNjA2NzM@._V1_.jpg",
    "keywords": "1970s,animal character name in series title,scooby doo character,laugh track,superhero",
    "name": "The New Scooby-Doo Movies",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Zantara Xenophobe"
        },
        "dateCreated": "2002-06-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068112/"
        },
        "name": "Scooby at His WORST!",
        "reviewBody": "I have loved Scooby Doo since I was a little kid. I looked forward to seeing him everyday after school. The station that showed it (I think TBS, mid-80's) would show the 1969-1971 episodes on Monday, half a `New Scooby Movie' on Tuesday, its second part on Wednesday, and 1976 episodes on Thursday and Friday. Without a doubt, Mondays were my favorite. Looking at Scooby as a whole, you just can't get any better than those wonderful episodes. I also liked most of the 1976 shows. But I always hated Tuesdays and Wednesdays because I hated sitting through a `New Scooby Doo Movie.' Not really knowing why, I carried the memory of them throughout the years with resentment, and over the years I would hear people praising the 1972 run whenever the topic of Scooby Doo came up. A few months ago, I decided to see if my feelings have been wrong all these years. I sat down and watched every single `Movie.' And you know what? My memory was almost exactly right. I remembered every episode and my old feelings for nearly every one of those episodes was unmoving. To me, this set of episodes is about as detrimental to the Scooby franchise as the first few miserable years of Scrappy Doo were before they mercifully scrapped his tough-pup personality for something more mellow (Although whoever it was that decided to KEEP Scrappy around for another decade will have a nice warm seat in Hades someday; right next to the seat of Scrappy's creator).\n\nSo what exactly is it that I hate about these episodes? We can start with the guest stars. I had an advantage on others my age when I was young in that I knew who most of the stars were. The problem is that the scripts are forced to haul a lot of attention to the guests and their antics, especially if the guest was a comedian or there was a large group of guests. With another big chunk of attention going to Shaggy and Scooby, there was little time for anything else. The fundamental thing that is a Scooby Doo episode---the mystery---was pushed aside and forgotten or mishandled in favor of showcasing the guests. It also caused most mysteries to be simplified, the plot either being recycled or sloppily executed. Suspects? No time! Just throw in some ghosts, a so-called crime, and call it a mystery!\n\nWorse yet, the animation took a huge nose-dive. It's as if all the money went to paying the real guests to do their own voices that there was nothing left for a good animation crew. Sure, there were plenty of glitches in the 1969 shows, but the `Movies' went overboard on them. Direction also seemed poorer, like Hanna & Barbera just stopped caring. Even a staple of the show, the ghosts, usually looked incredibly cheap. Many episodes give us a conglomeration of poorly conceived ghosts that continuously pop up and befuddle the gang. It's not very clever and robs interest from the plot if there isn't one specific ghost to catch. Other times, they just take a crudely drawn ghost and give them no color. How boring it is to watch a colorless figure running after the gang. The worst of these (and the rock-bottom, worst episode for that matter) is the one where they merely took the Redbeard characters from 1969 and stripped them of their color. Really, if you had solved a mystery of Redbeard three years before and were suddenly hounded by his ghost again, wouldn't you immediately know it was a hoax?\n\nPerhaps these elements wouldn't be so bad if the writing was good, but that is the most criminal aspect of them all. The humor is usually really terrible, with much of it relying on the charm of the guest star to provide its yuks, but much of the humor is so poor that it wipes away the charm of the guest. The most hideous examples of comedy are the episodes with Don Adams and Don Knotts. And you would think that these comedians would be a perfect fit with Scooby's atmosphere! There are also characters which should never, ever have been paired with Scoob: Batman & Robin, Jeannie, and the Addams Family. And there is something sad about the Cass Elliot episode, where Elliot made a bunch of cracks about her weight, an issue she was sensitive about and that would help take her life one year later. The thing that really gets to me is the flagrant time wasting. Characters will step out of the plot and do a long, drawn-out, unfunny activity. It happens all the time, but the worst is in a Globetrotters episode where we are forced to sit through the basketball playing, watching the same animated shots over and over again. Keep in mind there are THREE Globetrotter episodes, all with flagrant time wasting! Now, not all episodes are poorly written. The Davy Jones episode is the best, with good ghosts, good use of Jones, and a good plot. Same with the Three Stooges/Red Baron and Tim Conway episodes. The big shock for me was the Dick Van Dyke episode. The ghosts and story were nothing special, but the funny writing and humor with Van Dyke was so good that it made the episode exceptional.\n\nFor what it is worth, here are the episodes followed by a rating for each one, in descending order: Davy Jones--10; Three Stooges (Red Baron)--9; Dick Van Dyke--9; Tim Conway--8; Laurel & Hardy--7; Batman & Robin (Counterfeit Case)--7; Sonny & Cher--6; Phyllis Diller--6; Speed Buggy--6; Jerry Reed--5; Jonathan Winters--5; Batman & Robin (Flying Suit)--5; Cass Elliot--5; Three Stooges (Ghost Town)--5; Sandy Duncan--4 Addams Family--3; Globetrotters (Revolutionary Ghosts)--2; Josie & the Pussycats--2; Globetrotters (Haunted Island)--1; Jeannie--1; Don Adams--1; Don Knotts (Captain Moody)--1; Don Knotts (Spooky Fog)--1; Globetrotters (Redbeard)--1.\n\nThanks to the 1976 series, Scooby survived this blast against his credibility, only to be doused with gasoline and lit aflame a few years later with the coming of Scrappy. Still, at least it only took you thirty minutes to label a Scrappy episode as junk, not a full hour. Scrappy was bad, but for my money, `The New Scooby Movies' rank as the worst Scooby series."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1652621593",
        "name": "Scooby Doo Meets the Harlem Globetrotters",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTJhMWRhMWEtYmU0Ny00NjI5LTgwOGQtMGNmZjM2ODYwMjk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTJhMWRhMWEtYmU0Ny00NjI5LTgwOGQtMGNmZjM2ODYwMjk3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:43:54Z",
        "url": "https://www.imdb.com/video/vi1652621593/"
    },
    "url": "/title/tt0068112/"
}