{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lili Taylor",
            "url": "/name/nm0000666/"
        },
        {
            "@type": "Person",
            "name": "Pamela Z",
            "url": "/name/nm1303288/"
        },
        {
            "@type": "Person",
            "name": "Jim Lange",
            "url": "/name/nm0486148/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3692,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0089364/"
        }
    ],
    "datePublished": "2003-11-13",
    "description": "The remarkable story of The Weather Underground, radical activists of the 1970s, and of radical politics at its best and most disastrous.",
    "director": [
        {
            "@type": "Person",
            "name": "Sam Green",
            "url": "/name/nm0338316/"
        },
        {
            "@type": "Person",
            "name": "Bill Siegel",
            "url": "/name/nm0796903/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Documentary",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDE1ODUwMTgtZDllMS00NzAyLWFhODQtZWFkMGM5OTFiMTBlXkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "terrorists,domestic terrorism,united states of america,american terrorist,american terrorists",
    "name": "The Weather Underground",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "smilin'-2"
        },
        "dateCreated": "2003-10-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0343168/"
        },
        "name": "Great Film - Important Message Against the War Machine",
        "reviewBody": "The Weather Underground presents a well-balanced view of the militant faction of the 1960s anti-war group that orchestrated a series of direct actions (including bombings) in protest of the Vietnam War and American imperialism.\n\nTo its credit, the film is not overly sympathetic to the members of the group. Rather, it portrays them in a direct and logical manner that tends to explain their more violent activities as the desperate attempts of extremely dedicated activists to engender dynamic change in lieu of those \"publicly-sanctioned\" methods which they felt were not sufficiently powerful to stop the war machine (i.e., non-violent demonstrations). It should be mentioned that none of the group's bombings resulted in injuries to people, with the notable exception of 3 WU members who were killed accidentally while making a bomb that was destined for an ill-advised attack on military personnel - a seminal moment the the organization's history that \"opened their eyes\" to the darkness they were headed towards. One cannot help but wonder what would have transpired had that attack been carried out - this is the chilling central lesson of the film, poignantly described by one former member who plainly stated that \"the violence didn't work.\"\n\nAt the screening I attended the audience had the good fortune of listening to two of the Weather Underground's key members in person: Bernadette Dohrn and Bill Ayers. This proved particularly interesting, as both individuals, while still espousing their anti-militarism/anti-imperialism views to strong effect, did not express the need for radical tactics as one would imagine they may (given the current climate gripping the nation). Instead, they talked of engaging the issue through learning, organized activism, personal growth and social consciousness/responsibility.\n\nIt is this dialectic that makes this film so important right now, and I think that the directors have made an important step towards educating Americans in the subject of social awareness. My only complaint is that this lesson needs a counterpoint, something to break the ultimately sad feeling that one is left with when the screen flickers off at the end. Perhaps if viewed in tandem with a film that explores the victories that have been made through non-violent protest \"The Weather Underground\" can achieve its best potential."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2432434457",
        "name": "The Weather Underground (2002)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjgxYjVjMjgtNmRiYi00MTZiLWFkMDktNTM1N2QzOTViZTlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjgxYjVjMjgtNmRiYi00MTZiLWFkMDktNTM1N2QzOTViZTlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:20:41Z",
        "url": "https://www.imdb.com/video/vi2432434457/"
    },
    "url": "/title/tt0343168/"
}