{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Humphrey Bogart",
            "url": "/name/nm0000007/"
        },
        {
            "@type": "Person",
            "name": "Fredric March",
            "url": "/name/nm0545298/"
        },
        {
            "@type": "Person",
            "name": "Arthur Kennedy",
            "url": "/name/nm0447913/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10320,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Joseph Hayes",
            "url": "/name/nm0371092/"
        },
        {
            "@type": "Person",
            "name": "Jay Dratler",
            "url": "/name/nm0237225/"
        }
    ],
    "datePublished": "1955-10-12",
    "description": "Three escaped convicts move in on and terrorize a suburban household.",
    "director": [
        {
            "@type": "Person",
            "name": "William Wyler",
            "url": "/name/nm0943758/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUwMTI2NTgyMV5BMl5BanBnXkFtZTgwNTc1Nzk1MzE@._V1_.jpg",
    "keywords": "suburb,indianapolis indiana,hostage,fiance fiancee relationship,held at gunpoint",
    "name": "The Desperate Hours",
    "original_info": {
        "id": "The Desperate Hours_1955",
        "name": "The Desperate Hours",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "abooboo-2"
        },
        "dateCreated": "2001-01-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0047985/"
        },
        "name": "Bogie's No Rourke and Yes That's a Good Thing",
        "reviewBody": "A lot of loopy comments out there about this one. \"Predictable\" is a very over-used adjective that I've certainly been guilty of myself, but what exactly is supposed to happen in a hostage-taking, domestic thriller like this? Are aliens supposed to land in the Hilliards' back yard and vaporize everyone? Is Bogart's escaped con supposed to dress up in drag at some point and decide he wants to become a chorus girl? Would that satisfy those who find this movie predictable?\n\n\"The Desperate Hours\" keeps you on the edge of your seat; it more than passes the test as a thriller and it most certainly has not mellowed over time. The script is fine, intelligently examining how the respectably middle class but somewhat complacent father (Frederic March) draws strength and courage from the love of his wife and kids in handling the ordeal. Though each family member is formulating their own strategy for how best to resolve the crisis (their brains are always going \"clickity-clickity-click\" as Bogart mockingly keeps reminding them) they recognize March as the father and as such the captain of the ship. They look to him for leadership and he responds. It's telling that when the young son disobediently puts his ill-conceived plan into action, it undermines the father's nearly successful tactic. Though he had earlier suspected his dad of being cowardly for not taking a more aggressive stance, from this point on he begins to appreciate all the variables he must take into account and looks up to him once more. The idealized, but by no means wildly unrealistic domestic situation reflects the mood of the time. Why on earth would it possibly reflect cynically 90's attitudes and sensibilities, as some reviewers seem to desire?\n\nThere are casting decisions pertaining to age differences which raise an eyebrow, but do not seriously detract from William Wyler's (as masterful and dependable a director as Hollywood has ever cranked out) otherwise polished production. At 42 of course, Gig Young seems a tad old for the family's 19 year old daughter (beautiful Mary Murphy) but he's still youthful enough looking and he puts an interesting spin on what is usually the thankless role of the boyfriend who stumbles into things. One of the beauties of B&W photography is that it can always be used to make actors look as many as 5-15 years younger than they are. This comes into play with Bogart's character as well, as he's asked to be the older brother of 32 year old Dewey Martin, and it's something that I didn't have too hard a time buying. It's difficult to believe this was one of his last films, as he seems quite vigorous and robust in the part.\n\nTense, exciting, well-acted and directed; this is indisputably far superior to Michael Cimino's bloody and botched 1990 Mickey Rourke \"star\" vehicle remake.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi303545881",
        "name": "The Desperate Hours",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjRmMGJlZDgtZWZmMC00YzAxLTkwMzEtOGQ2ZTc5NDMzYzdhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjRmMGJlZDgtZWZmMC00YzAxLTkwMzEtOGQ2ZTc5NDMzYzdhXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-06-27T17:02:29.650Z",
        "url": "https://www.imdb.com/video/vi303545881/"
    },
    "url": "/title/tt0047985/"
}