{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Louis de Funès",
            "url": "/name/nm0000086/"
        },
        {
            "@type": "Person",
            "name": "Miou-Miou",
            "url": "/name/nm0591877/"
        },
        {
            "@type": "Person",
            "name": "Suzy Delair",
            "url": "/name/nm0216177/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13877,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "The Mad Adventures of Rabbi Jacob",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031163/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0070084/"
        },
        {
            "@type": "Person",
            "name": "Gérard Oury",
            "url": "/name/nm0653620/"
        },
        {
            "@type": "Person",
            "name": "Danièle Thompson",
            "url": "/name/nm0860019/"
        },
        {
            "@type": "Person",
            "name": "Josy Eisenberg",
            "url": "/name/nm1000119/"
        }
    ],
    "datePublished": "1973-10-18",
    "description": "A bigoted Frenchman finds himself forced to impersonate a popular rabbi while on the run from a group of assassins - and the police.",
    "director": [
        {
            "@type": "Person",
            "name": "Gérard Oury",
            "url": "/name/nm0653620/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjc3MmFmYWYtY2NkYy00ZjI3LTgwOWItNzFiZjIzMjY5YzJlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
    "keywords": "assassin,fake rabbi,slapstick comedy,rabbi,jewish community",
    "name": "Les aventures de Rabbi Jacob",
    "original_info": {
        "id": "The Mad Adventures of Rabbi Jacob_1974",
        "name": "The Mad Adventures of Rabbi Jacob",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ElMaruecan82"
        },
        "dateCreated": "2012-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069747/"
        },
        "name": "The Most Ecumenical Comedy of All-Time ...",
        "reviewBody": "\"Solomon, you're Jewish?\" \n\nVictor Pivert is so baffled at the very thought that his long-time driver was Jewish all along that he asked this question at least three times with a shocked look of disbelief. Solomon even mentioned that his uncle Jacob, coming from New York is a Rabbi. \"But he's not Jewish\" hopes Pivert, immediately deceived by Solomon's smiling nod. \n\nThis brief exchange is one of the most memorable comedic movie scenes of French cinema and I admire Gérard Oury, who directed the film, for his equal talent as a writer. It's funny because no one would make such a big deal about having a Jewish driver and be so damn serious about it, and it's also smart because it sets the tone of our lead character: Louis de Funès as Victor Pivert, a racist, xenophobic and narrow-minded bigot. The scene is even funnier because he was previously attacking all the foreigners through their driving or mocking an interracial couple in a wedding, and even smarter because ten seconds before, the guy was stating that he wasn't racist. Not racist but glad though that his daughter is marrying a white, \"very white  even a little bit too pale\" in his opinion.\n\nOnly Louis de Funès could have played a despicable character with such comical appeal. Although we don't share Pivert's views, we feel sorry for his ignorance and only hope that he'll be taught a good lesson. And this lesson is very explicit in the film's synopsis: Pivert becomes the hostage of an Arab revolutionary leader named Mohamed Larbi Slimane (Claude Giraud) and to escape from some other Arab goons, both disguise as rabbis. In a nutshell, you have a Catholic and a Muslim passing for Jews. And beyond this ethnic premise, one of the funniest movies of French cinema: a comedy of slapstick and errors, but not without a subtle and poignant touch of social and political commentary.\n\n\"The Mad Adventures of Rabbi Jacob\" marks also the pinnacle of the collaboration between Gérard Oury and Louis de Funès, after three of the greatest French box-office successes, with a de Funès, at the top of his game with his hot-tempered mannerisms and all the expressions that elevate his talent to the level of Chaplin, Keaton and Donald Duck. Take the way he mimics the sound of a woodpecker ('Pivert' in French) when he gives his name, his devilish smiles, his body language, a true comical talent who alas would never be the same after \"The Mad Adventures of Rabbi Jacob\". Indeed, Louis de Funès suffered a massive heart attack two years after the film, and would never have the same range of physical talent. But let's get back to the laughs.\n\n\"The Mad Avdentures of Rabbi Jacob\" starts with a respected Rabbi leaving New York for the first time after 30 years, to celebrate his nephew's bar mitzvah. Rabbi Jacob is played by Marcel Dalio, Gabin's companion in \"Grand Illusion\", the croupier in \"Casablanca\", an underrated figure of French cinema, miserably exploited by the Nazi occupation to denounce the Jewish control on filmmaking. Rabbi Jacob is Dalio's last memorable role and what a fitting way to share it with another veteran actor. And involuntarily, it's Rabbi Jacob and his assistant who contribute to the misunderstanding, because they share the same physical features than Pivert and Slimane, so when the lead pair is seen at the airport by an old Jewish grandmother who can barely see, Pivert becomes Rabbi Jacob, and Slimane Rabbi Zeligman.\n\nThe film is a spell-binding rodeo of gags, involving Pivert, Slimane, three Arab agents, three French cops, the Schmoll Family, Pivert's wife, from a chewing-gum factory to a dentist's room, from a synagogue to a Jewish quarter street, with an interesting running-gag involving Slimane's fondness on red-headed women. The film also features a series of unforgettable lines and moments now deeply rooted in French Pop-Culture. \"Silence, Rabbi Jacob, he will dance!\" shouts the grandmother with her strong Yiddish accent, and then starts the most emblematic moment of the film when Rabbi Jacob performs the Hassidic group dance. If you haven't seen the film yet, just watch this part on Youtube: a real classic of French cinema.\n\nThe film is punctuated with more serious moments, particularly relevant in the context of the film (released right before the Kippur War) and even today, when both Pivert and Slimane bless the Jewish boy, and the powerful handshake between Sliman and Salomon, after Pivert genuinely asked them \"Sliman, Salomon  are you guys cousins?\" Like the greatest comedies, the film knows how to loosen up, and it was a nice touch for Gérard Oury to think of such moments. \"The Mad Adventures of Rabbi Jacob\" is also the proof that we can mock any race or religion, through caricature and stereotypes, without being labeled as racist or Anti-semitic. Oury, from a Jewish background, can hardly be accused of Anti-Semitism of course, but through his film, he proves that one of the most essential elements of Jewish humor is self-derision.\n\nThe film features also one of the most memorable scores of French cinema from the Master Vladimir Cosma, the sight of New York with his catchy Yiddish-like tone is the film's most unforgettable signature, enriched with a more melancholic melody at the end. Speaking of the ending, it's a bit chaotic in the way it sweeps off many of the subplots with some deus ex machina resolutions or cringe-worthy dated humor, but it doesn't really affect the film, not after so many great laughs anyway. \n\nNow, I've always been perplexed by Slimane's statement : \"When we ask a Jew question, he always replies by another question\" I asked one of my Jewish friends about that, and his reply was : \"What makes you think so?\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi709999129",
        "name": "Bande-annonce [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDVlMzA2M2EtNTk5Ni00ZTQwLWJiNzctY2Y5YzIwYmFjYzJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDVlMzA2M2EtNTk5Ni00ZTQwLWJiNzctY2Y5YzIwYmFjYzJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-02-21T11:08:04.903Z",
        "url": "https://www.imdb.com/video/vi709999129/"
    },
    "url": "/title/tt0069747/"
}