{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cate Blanchett",
            "url": "/name/nm0000949/"
        },
        {
            "@type": "Person",
            "name": "Katie Holmes",
            "url": "/name/nm0005017/"
        },
        {
            "@type": "Person",
            "name": "Keanu Reeves",
            "url": "/name/nm0000206/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 71333,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005323/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049706/"
        },
        {
            "@type": "Person",
            "name": "Billy Bob Thornton",
            "url": "/name/nm0000671/"
        },
        {
            "@type": "Person",
            "name": "Tom Epperson",
            "url": "/name/nm0258370/"
        }
    ],
    "datePublished": "2001-01-19",
    "description": "A fortune teller with extrasensory perception is asked to help find a young woman who has mysteriously disappeared.",
    "director": [
        {
            "@type": "Person",
            "name": "Sam Raimi",
            "url": "/name/nm0000600/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Drama",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTUzMDY3ZDAtY2RiNC00ZGM4LWJjNmMtNWU0MGVjOWVkNjcwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "nipples visible through clothing,abusive husband,clairvoyant,widow,secret",
    "name": "The Gift",
    "original_info": {
        "id": "The Gift_2000",
        "name": "The Gift",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mattymatt4ever"
        },
        "dateCreated": "2002-06-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0219699/"
        },
        "name": "A compelling, genuinely intriguing, very well-acted mystery/thriller",
        "reviewBody": "Cate Blanchett's performance alone make this solid thriller worth watching. I saw her in this movie, and I became baffled as to why she wasn't considered for an Oscar nomination. She carries this film on her shoulders, and never once budges. Not only does she totally get rid of her Australian accent and perfectly don a Southern accent, but she gives a deep, powerful performance as the innocent widow, Annie Wilson, who is looked down by many in her community but simply wants to share her psychic gifts with her willing clients. Blanchett communicates great emotion with a simple facial expression.\n\nOf course, I also have to give it up for the multi-talented supporting cast. Though most of them, with the exception of Hilary Swank, couldn't really nail down the Southern accent, they are absolutely terrific. The only actor I felt was miscast was Katie Holmes. Not only is her accent phony and over-the-top, but she just seems too young and innocent for the role. Giovanni Ribisi, on the other hand, is a revelation. I knew, ever since his breakthrough performance in \"Suburbia,\" that he had great promise as an up-and-coming actor, but in \"The Gift\" he delivers his most powerful performance up-to-date. I would even argue that he deserved an Oscar nod. He constantly stirs up sympathy in his audience, despite his mental instability and momentary outbursts of anger. I was also extremely impressed with Keanu Reeves, who delivers a genuinely haunting performance. It's times like this where I just can't fathom why many people still insist on picking on Keanu, regarding him as dull and cardboard. Personally, I thought he was great ever since his emotional performance in \"Permanent Record.\" But he better demonstrates his versatility as an actor as the abusive Donny. He made his debut, as a villain, in the throwaway thriller \"The Watcher,\" but I found him much more haunting in this role. Plus, he sports a rugged look, totally shedding his pretty-boy image. Greg Kinnear is good and subtle, and Hilary Swank continues to flaunt her brilliant acting abilities as the vulnerable wife of Donny who constantly takes beatings from him, yet still maintains her love for him.\n\nThe story is very intriguing, revolving around a cast of colorful characters. This isn't a \"scary\" movie as it somewhat looks in the previews, but it is full of mystery and thrills, without cheaply going for shock value. There is a nifty twist at the end, which is credible and not thrown from left field, but the plot isn't packed with surprises. We're simply going along on an emotional journey, through the mind of our protagonist, Annie, and that's how the tension is created. Sam Raimi creates a haunting mood and Billy Bob Thornton wrote a fine script. The story is easy-to-follow, and not as mind-bending as some of these other supernatural thrillers. Just keep in mind that this is not a horror movie. But it's a good mystery and a good mood piece and a damn good film altogether.\n\nMy score: 7 (out of 10)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M15S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3589407001",
        "name": "The Gift (2000)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzI3MTk4Y2ItNDQ3MS00YTg4LWJlODYtMzUyYjFkYzk5YWQ1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzI3MTk4Y2ItNDQ3MS00YTg4LWJlODYtMzUyYjFkYzk5YWQ1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:43:51Z",
        "url": "https://www.imdb.com/video/vi3589407001/"
    },
    "url": "/title/tt0219699/"
}