{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Busey",
            "url": "/name/nm0000997/"
        },
        {
            "@type": "Person",
            "name": "Don Stroud",
            "url": "/name/nm0835144/"
        },
        {
            "@type": "Person",
            "name": "Charles Martin Smith",
            "url": "/name/nm0001747/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9536,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037058/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071050/"
        },
        {
            "@type": "Person",
            "name": "Alan Swyer",
            "url": "/name/nm0842905/"
        },
        {
            "@type": "Person",
            "name": "John Goldrosen",
            "url": "/name/nm0325981/"
        },
        {
            "@type": "Person",
            "name": "Robert Gittler",
            "url": "/name/nm2021948/"
        }
    ],
    "datePublished": "1978-09-06",
    "description": "The story of the life and career of the early rock and roll singer, from his meteoric rise to stardom, to his marriage and untimely death.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Rash",
            "url": "/name/nm0711114/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmZjNWUzZjEtYTE2MS00OGVlLTg5ZjgtMTk3YjMyYzAzMDExXkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "texas,character name as title,buddy holly character,four word title,timeframe 1950s",
    "name": "The Buddy Holly Story",
    "original_info": {
        "id": "The Real Buddy Holly Story_1987",
        "name": "The Real Buddy Holly Story",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "slokes"
        },
        "dateCreated": "2004-04-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077280/"
        },
        "name": "Great Busey Performance, Weak Everything Else",
        "reviewBody": "When Gary Busey got nominated for an Oscar for his performance in \"The Buddy Holly Story,\" alongside Robert DeNiro, Warren Beatty, Laurence Olivier, and winner Jon Voight, it turned a lot of heads and made people pay more attention when the film came out on video and cable. Seeing it then for the first time years ago, I was amazed by Busey's powerful dynamism, the way he lives through each moment of the film so authentically. The rest of the film was enjoyable, funny, perceptive, and made me feel like I really understood something about Buddy Holly.\n\nWatching it again years later, I still think Busey is terrific. But the rest of the film feels like a 1970s TV movie, with broad characterizations by the likes of Conrad Janis as a record exec. The Crickets are woefully portrayed, or perhaps a better word might be betrayed, given this shows them to be racist mediocrities who hold their buddy Buddy down. Even when the history isn't wrong, it feels wrong, like the scene of the Buffalo DJ who locks himself in his studio and plays \"That'll Be The Day\" non-stop until the police break down the door, helping launch the band.\n\n\"How'd get that dynamite sound?\" the actor playing the DJ asks, hamming it up.\n\n\"Well, there's a guitar, drums, a stand-up bass and a cricket,\" Buddy replies, meaning an insect got in the middle of the recording session and made some background noise.\n\n\"Wow, Buddy Holly and the Crickets! What a super name!\"\n\nThere's some truth behind the anecdote, a cricket apparently did find its way into the studio and inspired the band's name, but it just feels too contrived. Same with Buddy's problems back home in Lubbock, Texas, where his girl wants him to shape up and go to college. The actress playing the girlfriend is cute and winsome, but she pouts like a sitcom actress and says her lines like she's auditioning to play Marsha Brady.\n\nBut when the camera is on Busey as Holly, something takes over. He throws himself into every song with utter abandon, losing himself in Buddy's big glasses and pompadoured curls. It's not a note-perfect Buddy, but it encapsulates his spirit in a defining way. The only other actor who so dominated a film was George C. Scott in \"Patton.\"\n\nThe fictionalized Crickets, only two instead of three, Don Stroud and Charles Martin Smith, are pretty terrific as backing musicians. I especially liked Stroud as Jesse the drummer, the way he cracks the skins and hammers the high hats with door-slamming authority. All the numbers are performed live, an unusual and brave choice by director Steve Rash that pays off brilliantly, capturing the raw vibrancy of straight-ahead rock 'n' roll.\n\nThere's a great opening sequence, done with a swooping camera shot inside a roller rink to where Buddy and his band play some bop for the kiddies and scandalize the community. Just the way the band switches from the soporific \"Mockingbird Hill\" to the thumping \"Rock Around With Ollie Vee,\" with the audience reacting in comically but believably different ways (kids rushing the stage clapping their hands, adults rushing the exits clapping their ears) is a thrilling capsule commentary on what rock overcame to take over American culture. Also good are the period touches at the rink, like the malt bar, the roller skates, the sad fellow with the combover who plays rinkydink piano until someone taps him on the shoulders in mid-note.\n\nAlso good is the Apollo Theater scene, where Buddy and the Crickets become the first white band to play in that Harlem venue, getting a hilariously cold reaction when the curtain goes up, then winning the crowd over. I sort of doubt it happened like that, but there's some funny exchanges with the theater manager, and it's nice seeing Stymie from \"Our Gang\" in an adult role, complete with his trademark derby.\n\nBasically, any scene where Buddy is performing is good, though his final performance at the Winter Dance Party in Clear Lake, Iowa, by which point he has become a solo act, is a little overdone, what with the over-the-top violins on \"True Love Ways\" and Ritchie Valens joining him on stage at the end with maracas.\n\nMeanwhile back home, the Crickets come over to Buddy's apartment, and after talking to Buddy's pregnant wife Maria Elena, decide to surprise Buddy at his next tour stop in Moorhead, Minnesota. Yeah, right. Of course Buddy won't be there, he and Ritchie and the Big Bopper having picked the wrong night to fly. All that's left is a freeze frame of Buddy and some sad music over the credits.\n\nWe only had Buddy for 18 months, and this film, along with Don McLean's 1972 hit \"American Pie,\" gave him back to us in a small but tangible way. For that, and for Busey's breakout moment, it is worth treasuring, and there are some nice scenes here and there. But playing with the facts is no way to tell a legend's story, especially when it serves sitcom-caliber punch lines. It's a good movie, but the real story behind it is better.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1685110809",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2NhZTQyYmItZDQxYi00YTAxLWIyNDktYmNlODQ5MTNkY2JiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2NhZTQyYmItZDQxYi00YTAxLWIyNDktYmNlODQ5MTNkY2JiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-07-16T17:23:48.324Z",
        "url": "https://www.imdb.com/video/vi1685110809/"
    },
    "url": "/title/tt0077280/"
}