{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Gatiss",
            "url": "/name/nm0309693/"
        },
        {
            "@type": "Person",
            "name": "Steve Pemberton",
            "url": "/name/nm0671487/"
        },
        {
            "@type": "Person",
            "name": "Reece Shearsmith",
            "url": "/name/nm0790501/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11633,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "2000-06-19",
    "description": "An interweaving narrative chronicling the antics of such diverse characters as: a transgender taxi driver, a family obsessed with hygiene and toads, a fiery reverend, a carnival owner who kidnaps women into marriage, and a xenopho...",
    "genre": [
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTY1NTAxYmMtYTMxNS00ZDhlLWFiYzEtMTYyMDEyMTYyMjYxXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "based on radio show,cult favorite,british comedy,ensemble cast,absurd comedy",
    "name": "The League of Gentlemen",
    "original_info": {
        "id": "The League of Gentlemen: Series 1_1999",
        "name": "The League of Gentlemen: Series 1",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ApplePiePerson"
        },
        "dateCreated": "2004-06-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0184135/"
        },
        "name": "local series for local people",
        "reviewBody": "If you haven't encountered the League of gentlemen before *whats wrong with you*?? In short, its like what would happen if Kids in the Hall performed Twin Peaks playing all the characters (Mark as Log Lady or Bruce as Nadine the eye patch lady). And all this set in the moorland backwaters of Northern England much beloved by previous writers like James Herriot or The Brontes. The show has also been described as Twin Peaks-Mervyn Peake-Peak Practise which is also apt. You don't have to come from Northern England (like me) to 'get it' - most jokes are universal to those with similar senses of humour.\n\nAnyway - the story is as follows. the League are Mark Gatiss, Steve Pemberton, Reece Shearsmith and Jeremy Dyson (writer who does not perform). The show started out at Edinburgh fringe (where it won the Perrier award), then BBC Radio 4 and then on to BBC TV. The 3 series so far follow the lives of various residents of Royston Vasey, the town you will never leave. All characters (male and female) are performed by Gatiss/Shearsmith/Pemberton.\n\nthis is an amazing feat and shows the versatility and talent of each performer. \n\nCharacters include a homicidal snub-nosed couple who run a local shop, a bigoted vicar, a lesbian ex-con once proud restart officer and an inept vet with strong shades of that Herriot creation Tristan Farnham amongst others. Papa Lazarou is one of the most enduring creations - he is like a bizarre hybrid of a black & white minstrel, Jerry Sadowitz, Pennywise from IT and a white-slave-trader. The show is also a must for any fan of horror and cult movies as the references to classics like \"The Wicker Man\", \"Don't Look Now\", \"the Jungle Book\", \"The Railway Children\" and more humble fare like 80s kids show \"Pipkins\" will keep film fans eager and happy for a long time. Above all its very funny and very clever - from visual jokes (animal face painting and draining the swede being favourites) to subtle in-depth homage (the portmanteau style of Xmas special echoes Amicus classics like \"Asylum\")\n\nSeries one and two followed a similar pattern whilst the Gents departed with form and took a brave step with series 3 making some dramatic changes. The Xmas special was perhaps key in this change also. Gone were some old favourite characters and new ones were introduced. Episode formula was less sketch driven and story lines were longer. And also a new theme tune was introduced with shades of \"Scheulmadchen report\" with it grooviness. But some 'fans' hated the changes (dullards) because they broke with the norm and indicated a bold change in direction. I personally **love** the new changes(like a lot of fans) and think that Series 3 contains some of the best work done so far. Thank god they got rid of the laughter track!!!!! Kudos to the guys for not being formulaic and always challenging expectations and actually *thinking* about what to bring along next. The work is thus fresh, complex and keeps you on your toes. Hooray to that as there is nowt as bad as stale comedy.\n\nNOW BRING ON THE FILM!!!!!"
    },
    "url": "/title/tt0184135/"
}