{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Lee",
            "url": "/name/nm0000489/"
        },
        {
            "@type": "Person",
            "name": "Charles Gray",
            "url": "/name/nm0336509/"
        },
        {
            "@type": "Person",
            "name": "Nike Arrighi",
            "url": "/name/nm0037316/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9539,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103175/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060069/"
        },
        {
            "@type": "Person",
            "name": "Richard Matheson",
            "url": "/name/nm0558577/"
        },
        {
            "@type": "Person",
            "name": "Dennis Wheatley",
            "url": "/name/nm0923676/"
        }
    ],
    "description": "Devil worshipers plan to convert two new victims.",
    "director": [
        {
            "@type": "Person",
            "name": "Terence Fisher",
            "url": "/name/nm0279807/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWEwMjRhMWMtZTk3My00MzBiLWFmODctNmQ0NjkzZjMzM2U1XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "baphomet,coven,devil worship,satanic goat,damsel in distress",
    "name": "The Devil Rides Out",
    "original_info": {
        "id": "The Devil Rides Out_1968",
        "name": "The Devil Rides Out",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "El-Stumpo"
        },
        "dateCreated": "2003-10-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062885/"
        },
        "name": "\"The Goat of Mendes - the Devil himself!\"",
        "reviewBody": "Heading the great Hammer Horror Revival was Terence Fisher, the director whose adaptations of the Universal horror classics, The Curse Of Frankenstein (1957), The Horror of Dracula (1958) and The Mummy (1959) sealed the studio's fate as the leading producer of British gothic horror for almost 20 years. Throughout the 60s, while half of Hammer's output were rather silly adventure yarns (The Viking Queen, The Vengeance Of She) and lazy exercises in generic conventions (Curse Of The Mummy's Tomb, The Old Dark House), Fisher created more adult-oriented horror - psychological, almost Freudian horror (The Gorgon, Frankenstein Created Woman), drawing on the sexual conflicts of the repressive English social climate starting to fray at the seams. Fisher's final film, Frankenstein And The Monster From Hell (1973) is British horror at its bleakest - a deeply disturbing and amoral portrait of amorality in the figure of Fisher's greatest creation, Baron Frankenstein as essayed by Hammer icon Peter Cushing. Over twenty years after his death he is still regarded as Britain's greatest ever horror director.\n\nFisher began work on The Devil Rides Out, the first of three Dennis Wheatley adaptations, in the summer of 1967. From the opening credits, an indecipherable mass of occult symbols appearing out of a red mist punctuated with James Bernard's ominous orchestral score, screenwriter Richard Matheson (I Am Legend author and scriptwriter of Roger Corman's Edgar Allen Poe series) sharpens Crowley's prose to create a frighteningly real world of dark forces at work beneath the genteel surface of the English aristocracy. At a reunion of old friends at a country estate, occult expert the Duc de Richelieu (Christopher Lee) and his well-meaning but impulsive lantern-jawed sidekick Rex (Leon Greene) discover their young comrade Simon (Patrick Mower) has become involved in `astrological society', a thinly-veiled satanic cult lead by the charismatic Mocata (Charles Gray). Richelieu and Rex kidnap Simon to prevent his Devil's baptism, but he escapes. Mocata then uses Richelieu's friends Richard (Yes Minister's Paul Eddington) and his family, and Tanith (Nike Arrighi), a young French beauty also marked for baptism, as bait to lure Richelieu to his destruction.\n\n For a studio defined by its reworkings of Dracula and Frankenstein, Mocata is one of Hammer's most frightening monsters. Veteran Shakespearean actor Gray, best remembered these days as the Bond villain in Diamonds Are Forever (1971) and the narrator in The Rocky Horror Picture Show (1975), conveys the palpable menace from his cold, unflinching steel-gray eyes and his carefully modulated voice, a master of hypnosis and mind control no doubt based on real-life characters from Wheatley's days in British Intelligence (some say Mocata is smoother version of the `Great Beast', occultist Alistair Crowley, whom Wheatley was acquainted with). Matheson's script changes the Mocata character from a swarthy European figure of Word War 2-era intrigue into an English `gentleman', more forcefully underpinning the tension between England's exterior pastoral elegance and class respectability, and its repressed bacchanalian urges. Wheatley, a British author best known for his black magic tales and costume adventure stories, was an avid collector of occult esoterica and was reportedly delighted with the film, as Matheson's script had expanded on his own research his Black Magic rituals with an eye for detail, drawing on Crowley's writings as well as Sumerian and Egyptian legends, occult and pagan texts.\n\nOf course the film's focus is on the imposing figure of the six foot four Christopher Lee, by 1967 a genre superstar having played Dracula, the Frankenstein monster, the Mummy, Rasputin, even Sherlock Holmes. Lee had in fact pressed Hammer to purchase the rights for Wheatley's novel, and was delighted to play a character on the side of `good' after a decade typecast as Dracula.\n\nHammer films are characterized by relatively low budgets, compensated by taut direction and expert characterization, and a winning combination of tight studio sets and English country exteriors. The Devil Rides Out utilizes its stagebound scenario to chilling effect: Simon's cold gray observatory turns malevolent purely by adding scratching noises from a cupboard. The budget only lets the film down in its two major setpieces; both the final sacrificial ceremony at Mocata's mansion and the Grand Sabbat, supposedly a grand ritual orgy for Simon and Tanith's intended baptism, veer toward poorly-staged pantomime. When Mocata invokes Satan (`The Goat of Mendes - the Devil himself!') at the Sabbat, the sight of a rather wretched figure with pin-on horns and raccoon eyes tends to blunt the scene's horrific implications. Indeed the film's scariest scene is set in an empty room; Richelieu, Rex and the family take refuge inside a chalk circle and are confronted by a series of apparitions conjured by Mocata. Again the scene is only marred by the final ghastly figure: a horsebound Angel of Death, whose mask drops to reveal a cheap-looking grinning plastic skull.\n\n The Devil Rides Out was an artistic triumph but not a commercial success. Perhaps it was the unfamiliar tone of the film, or the fact Christopher Lee had his fangs filed down; two further Duc de Richelieu adventures starring Lee, Strange Conflict and Gateway To Hell were abandoned. Hammer's next venture after The Devil Rides Out, The Lost Continent (an ambitious reworking of Wheatley's Jules Verne style adventure novel Uncharted Seas) went wildly overbudget and Wheatley was not impressed, citing a number of plot changes by director Michael Carreras. The third Wheatley adaptation, a grotesque updating of To The Devil A Daughter with Richard Widmark and an embarrassed Christopher Lee, was Hammer's horror swansong in 1976, and the company sank soon after. Maybe it was the curse of Dennis Wheatley after all - still, for us horror iconoclasts, we still have The Devil Rides Out, a film that remains after 35 years one the finest examples of the gone but never to be forgotten house of Hammer."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from 20th Century Fox",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3549102361",
        "name": "The Devil Rides Out",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjM3NDE4MmQtNzMxMy00MjBjLTk5NTQtMDQ5MWEzYjg0Y2FlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjM3NDE4MmQtNzMxMy00MjBjLTk5NTQtMDQ5MWEzYjg0Y2FlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:18:45Z",
        "url": "https://www.imdb.com/video/vi3549102361/"
    },
    "url": "/title/tt0062885/"
}