{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sandy Gore",
            "url": "/name/nm0330765/"
        },
        {
            "@type": "Person",
            "name": "Michael Cole",
            "url": "/name/nm1467030/"
        },
        {
            "@type": "Person",
            "name": "Maj-Brith Bergström-Walan",
            "url": "/name/nm0075060/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 166,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0027159/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0160260/"
        },
        {
            "@type": "Person",
            "name": "John D. Lamond",
            "url": "/name/nm0483625/"
        },
        {
            "@type": "Person",
            "name": "Alan Finney",
            "url": "/name/nm0278262/"
        }
    ],
    "datePublished": "1978-03-03",
    "description": "A tongue-in-cheek sex education documentary covering a different subject for each letter of the alphabet, e.g. A is for Anatomy, B is for Babies, etc.",
    "director": [
        {
            "@type": "Person",
            "name": "John D. Lamond",
            "url": "/name/nm0483625/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Documentary",
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjQyNzM5ODEtYmU0OC00OTRhLWI1ZTQtNzBkZWQwZjg4MmQzXkEyXkFqcGdeQXVyNjU1MTEwMjI@._V1_.jpg",
    "keywords": "group sex,ozploitation,clitoral masturbation,sex comedy,sex spoof",
    "name": "The ABC of Love and Sex: Australia Style",
    "original_info": {
        "id": "The Map of Sex and Love_2001",
        "name": "The Map of Sex and Love",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sol-"
        },
        "dateCreated": "2016-01-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077116/"
        },
        "name": "Learn your ABCs",
        "reviewBody": "About as much as one would expect from a film with such a title, this Australian documentary provides facts and advice about sex and sexuality with content organised into chapters according to the alphabet. Chapters include \"C is for Contraception\", \"M is Masochism\", \"S is for Seduction\" and so on. While not particularly enlightening, the film offers an interesting snapshot of attitudes and values in the 1970s. Of particular interest are the vary opinions as to just what constitutes pornography and why it has such a social stigma. An interviewee also curiously informs us that sex education has been a mandatory subject in Scandinavian primary schools for a number of years. The segments vary significantly in their effectiveness though. The \"H is for Homosexual\" sequence is particularly cringe-worthy, packed full of gay stereotypes despite preaching tolerance. The film also bizarrely omits three letters of the alphabet; Q and Z are admittedly understandable omissions, but V has at least a couple of very obvious topics that could have been covered. Even more bizarre though are the stretches made for other letters; \"J is for Jealousy\" never really seems relevant. There is also something to be said for the copious time spent on chapters such as \"D is for Dreams\" while \"T is for Temptation\" is barely twenty seconds long! While a bit of a mixed bag overall, the documentary is arguably essential viewing though for novelty value alone. The stop motion opening sequence set in a primary school classroom is utterly uncanny at the very least.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0077116/"
}