{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ryan Phillippe",
            "url": "/name/nm0000202/"
        },
        {
            "@type": "Person",
            "name": "Benicio Del Toro",
            "url": "/name/nm0001125/"
        },
        {
            "@type": "Person",
            "name": "Juliette Lewis",
            "url": "/name/nm0000496/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 34170,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014903/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0077965/"
        },
        {
            "@type": "Person",
            "name": "Christopher McQuarrie",
            "url": "/name/nm0003160/"
        }
    ],
    "datePublished": "2000-09-08",
    "description": "Two criminal drifters without sympathy get more than they bargained for after kidnapping and holding for ransom the surrogate mother carrying a baby for a powerful, shady man.",
    "director": [
        {
            "@type": "Person",
            "name": "Christopher McQuarrie",
            "url": "/name/nm0003160/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTAyNjEyMDEwMzBeQTJeQWpwZ15BbWU4MDczMjY1NDEy._V1_.jpg",
    "keywords": "criminal,money,kidnapping,pregnant woman,truck stop",
    "name": "The Way of the Gun",
    "original_info": {
        "id": "The Way of the Gun_2000",
        "name": "The Way of the Gun",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DICK STEEL"
        },
        "dateCreated": "2006-01-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0202677/"
        },
        "name": "A Nutshell Review: (DVD) The Way of the Gun (2000)",
        "reviewBody": "Written by the same dude who wrote The Usual Suspects, The Way of the Gun is a much simpler tale compared to the award winning Suspects. It tells of two small time crooks, played by Ryan Phillippe and Benicio Del Toro, who get entangled in a game of crooks versus crooks when they try to pull of a kidnapping.\n\nDreaming of bigger things in life, but regardless of the method used to achieve their dreams of riches, they overhear a conversation at a sperm bank clinic (one of the most happening dialogues in the movie happens there) about a surrogate mother bearing the child of some rich family. They decide to kidnap the lady, played by Juliette Lewis, and hold the mother and child hostage.\n\nHowever, they embroil themselves into a bigger web of intrigue, as every character, from the mother, the husband and wife who employed her, the doctor, the bodyguards, to the \"bagmen\", all have their own agenda, and the relationships between one another must be one of the most complex written for the screen in recent times. Everything is more than meets the eye, and betrayals and double crossings are the agenda for the day.\n\nThe pacing is well measured, and there are moments of suspense masterfully injected at points in the movie. I like the initial hostage taking scene, where the sudden shift of focus and introduction of complexity catches our two anti-heroes Longbaugh (Del Toro) and Parker (Phillippe) completely off guard. The car chase and pursuit is also one of the more innovative and quirky scenes in the movie, one which Del Toro actually suggested, and got it made on screen. You have to watch it to believe.\n\nThe finale gives a kick to western shoot-em-up fans, as Longbaugh and Parker go head to head with everyone in a Mexican brothel, using modern day weapons of shotguns and handguns. Thrown into the mix is veteran James Caan, as a bag-man extraordinaire, having been so long in the business because of his experience in staying alive.\n\nDel Toro and Phillippe exude an excellent bond of camaraderie between their characters - they trust nobody except for themselves, while I thought Juliette Lewis was terrific in her role as the very pregnant mother caught between both sides, and yet bringing out strength as she fights for her child's and her own survival, taking her interests in her own hands.\n\nIt's a good mix of action and workout for your brain as you figure out the relationships between the characters as the narrative moves along. Suited for those mundane afternoons in which you want to break out from.\n\nNo special additions in this Code 1 DVD.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT2M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1677459737",
        "name": "The Way of the Gun",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjBlODc3MTgtOWQyOS00NDlkLWEzNDItMTJmNjQ4ZjQyY2JiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjBlODc3MTgtOWQyOS00NDlkLWEzNDItMTJmNjQ4ZjQyY2JiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:20:32Z",
        "url": "https://www.imdb.com/video/vi1677459737/"
    },
    "url": "/title/tt0202677/"
}