{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Thomas Dekker",
            "url": "/name/nm0215281/"
        },
        {
            "@type": "Person",
            "name": "Kenneth Mars",
            "url": "/name/nm0550318/"
        },
        {
            "@type": "Person",
            "name": "Anndi McAfee",
            "url": "/name/nm0563884/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3673,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0202966/"
        },
        {
            "@type": "Person",
            "name": "Libby Hinson",
            "url": "/name/nm0385922/"
        },
        {
            "@type": "Person",
            "name": "John Loy",
            "url": "/name/nm0523431/"
        },
        {
            "@type": "Person",
            "name": "Judy Freudberg",
            "url": "/name/nm0294440/"
        }
    ],
    "datePublished": "1998-12-01",
    "description": "Grandpa tells Littlefoot about their mythical hero called the Lone Dinosaur. Sarah gets two little lively cousins to take care of. Later, the kids accidentally chip the lucky Saurus Rock, and need to fix it before the bad luck hits.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Grosvenor",
            "url": "/name/nm0343799/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzQ5MjQ0NzEwMV5BMl5BanBnXkFtZTgwNTM0NTAwNzE@._V1_.jpg",
    "keywords": "story,legend,brachiosaurus,diplodocus,grandparents",
    "name": "The Land Before Time VI: The Secret of Saurus Rock",
    "original_info": {
        "id": "The Land Before Time VI: The Secret of Saurus Rock_1998",
        "name": "The Land Before Time VI: The Secret of Saurus Rock",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "IonicBreezeMachine"
        },
        "dateCreated": "2021-04-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0167247/"
        },
        "name": "The Land Before Time: Little Foot Goes West(kind of).",
        "reviewBody": "Littlefoot, Cera, Ducky Petrie, and Spike listen to Grandpa Longneck's stories of a heroic longneck known as The Lone Dinosaur who heroicly and selflessly protected those at the mercy of Sharpteeth. The story ends with the Lone Dinosaur leaving as mysteriously as he came and a Longneck shaped rock appearing during in earthquake that they name Saurus Rock, along with a legend stating that should anything happen to it a curse of bad luck will descend upon the Great Valley. Littlefoot becomes fascinated with the Lone Dinosaur legends, even acting them out with his friends, only to find the sudden appearance of a soft spoken Dinosaur named Doc who bares a striking resemblance to the Lone Dinosaur.\n\nThe Land Before Time: The Secret of Saurus Rock marks the sixth entry in the direct to video film series and the last to use traditional cell animation before all Universal Home Video exclusives switched to digital ink and paint. The movie continues with the Charles Grosvenor era of Land Before Time sequels going for more high concept premises than the relatively grounded \"lesson based\" affairs of the Roy Allen Smith entries. This time Grosvenor along with writers Libby Hinson and John Hoy, give us a very odd sequel with western hero subtext.\n\nWhen we are introduced into the movie by Grandpa Longneck's story (with an amusing sight of the group gathered around a volcanic vent as if it were a camp fire that was mildly amusing) the amount of western references in the story is enough to make your head spin. Not only do we have the rather obvious parallel between Lone Dinosaur and Lone Ranger, but the story even ends with a reference to the Alan Ladd movie Shane. Even Doc who may or may not be the Lone Dinosaur (the movie never makes it clear if he is or not) is voiced by Kris Kristofferson who plays the \"man of few words\" trope to a \"T\".\n\nThere's sort of an endearing cheesiness to Secret of Saurus Rock with its on the nose western themes (including a song Little Foot sings that's reminiscent of singing cowboy movies) that it's honestly kind of hard not to crack a smile. The rest of the movie is pretty standard land before time stakes involving a macgruffin that needs to be chased, retrieved, or etc and encounters with various hazards and obstacles. The one draw back is a pair of obnoxiously high pitched baby three-horns, Dana and DInah (confusingly identified as Cera's nieces since Cera calls herself \"Auntie Cera\") who are basically chaos engines designed to get in trouble and spout gibberish.\n\nLand Before Time VI continues the franchise for better or worse. It's a decent enough movie for kids as far as children's direct to video films go.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0167247/"
}