{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nicole Eggert",
            "url": "/name/nm0001176/"
        },
        {
            "@type": "Person",
            "name": "David McCallum",
            "url": "/name/nm0564724/"
        },
        {
            "@type": "Person",
            "name": "Christopher Halsted",
            "url": "/name/nm0357073/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 925,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0083952/"
        },
        {
            "@type": "Person",
            "name": "Edgar Allan Poe",
            "url": "/name/nm0000590/"
        },
        {
            "@type": "Person",
            "name": "R.J. Robertson",
            "url": "/name/nm0731992/"
        },
        {
            "@type": "Person",
            "name": "Jim Wynorski",
            "url": "/name/nm0691061/"
        }
    ],
    "datePublished": "1990-02-09",
    "description": "Loosely based on the short story by Edgar Allan Poe, a witch is sent to death, only to try & return from the grave, seventeen years later, to possess her daughter's adult body.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Wynorski",
            "url": "/name/nm0691061/"
        }
    ],
    "duration": "PT1H22M",
    "genre": [
        "Horror",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjkyNjZkOTMtNjAzMy00YzgzLWE5NTEtOTQ2MGZlNzg4NDI4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "murder of a nude woman,female rear nudity,female frontal nudity,based on short story,possession",
    "name": "The Haunting of Morella",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2019-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0099743/"
        },
        "name": "Before she was a Baywatch-babe, she was a Witch-baby!",
        "reviewBody": "I hit puberty in the early 90s, so in other words, I was a horny and hormone-controlled teenager when \"Baywatch\" first aired on TV, and naturally had a crush on practically every babe that paraded through the screen in a skimpy red bathing suit. Pamela Anderson, evidently, but I was even far more enchanted by two other blond and typically nineties' beauties; - Erika Elaniak and Nicole Eggert. The latter was a cherubic and polished but nonetheless very sexy girl-next-door type. Whoever knew that, before her \"Baywatch\" period, Eggert had already appeared in a cheap and ultra-sleazy Roger Corman production loosely - VERY loosely - inspired by Edgar Allan Poe's writings? At the beginning of the film, Eggert depicts the fiercely foul-mouthed witch Lenora who gets executed in front of an angry town's mob and her powerlessly staring husband who's holding their few weeks' old baby in his arms. Nearly 18 years later, the baby matured into the gorgeous Nicole Eggert again. Morella is excited to celebrate her birthday and taste adulthood, but little does she know that the voluptuous nanny has been carefully preparing Lenora's reincarnation via the pure body and soul of her daughter.\n\nRoger Corman knows Poe, trust me. He was single-handedly responsible for the absolute greatest Edgar Allan Poe film-adaptations during the early sixties, like \"House of Usher\", \"The Masque of the Red Death\", \"Premature Burial\", etc. If Corman really wanted to make an atmospheric, qualitative and genuinely frightening adaptation of Poe's short story, he certainly could have done so. Instead, he cleared just hired Jim Wynorski (\"Chopping Mall\", \"Transylvania Twist\") to direct a cheap but profitable B-movie with a focus on ravishing women, tacky horror, secondhand sets & scenery and boobs, boobs, boobs! 18-year-old Eggert still gets a stand-in for her nude sequences, but Corman regulars Lana Clarkson, Maria Ford and Gail Thackray showcase their bodily assets gratuitously and repeatedly. The sets and stock-footage, like the numerous lightening strikes, are shamelessly edited from much older flicks (you might recognize \"The Terror\" - 1963) and our producer would still continue to recycle them in later films like \"The Haunting of Hell House\" - 1999. \"The Haunting of Morella\" is nevertheless fun and amusing, at least if you don't mind the derivative plot and the dull moments in between the cheesy gore and the nudity.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0099743/"
}