{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tyrone Power",
            "url": "/name/nm0000061/"
        },
        {
            "@type": "Person",
            "name": "Maureen O'Hara",
            "url": "/name/nm0000058/"
        },
        {
            "@type": "Person",
            "name": "Robert Francis",
            "url": "/name/nm0290295/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3019,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079825/"
        },
        {
            "@type": "Person",
            "name": "Edward Hope",
            "url": "/name/nm0393971/"
        },
        {
            "@type": "Person",
            "name": "Marty Maher",
            "url": "/name/nm0536865/"
        },
        {
            "@type": "Person",
            "name": "Nardi Reeder Campion",
            "url": "/name/nm0133065/"
        }
    ],
    "datePublished": "1955-01-04",
    "description": "In 1898, Irish immigrant Martin Maher is hired as a civilian employee at West Point where, during a 50-year career, he rises to the rank of NCO and instructor.",
    "director": [
        {
            "@type": "Person",
            "name": "John Ford",
            "url": "/name/nm0000406/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjYzZmNiYTMtOGRjZC00ZDc3LWIzYmUtMjQwZDVlYmJmM2UzXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "west point,military academy,1900s,based on book,car",
    "name": "The Long Gray Line",
    "original_info": {
        "id": "The Long Gray Line_1955",
        "name": "The Long Gray Line",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2005-07-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048312/"
        },
        "name": "It took him 40 years or so to get the hang of it.",
        "reviewBody": "Sergeant Martin Maher is in to see President Eisenhower who he knew back in the day when Ike was a West Point Cadet. The army wants to mandatorily retire him. So as Marty pleads his case before the country's most famous West Point Graduate, we're flashed back to the day as a fresh Irish immigrant he arrives at West Point to work as a waiter in their mess.\n\nAnd the rest of the film is taken up with the telling of Martin Maher's remarkable story which he wrote in a book entitled Bringing Up the Brass on which this film is based. The subject is a can't miss project for John Ford with two of his dearest loves involved, Irish and military tradition.\n\nTyrone Power who had played in lots of costume pictures as the dashing hero at his home studio of 20th Century Fox, got a chance to do a real character part here. His skill as a player makes us completely believe that he ages during the film from his twenties to his seventies. Of course makeup helped, but I doubt if certain actors could have brought it off.\n\nMaureen O'Hara matches Power equally as Mary O'Donnell the fresh and fiery colleen who marries him. Her relationship with John Ford as she tells in her recent memoirs had its ups and downs, but she respected his talent and gives one of her best acted roles. And O'Hara adored Tyrone Power, she says of him he was a tease at times, loved to play practical jokes, but a fine man and a thorough professional at his job.\n\nThe supporting cast is the usual familiar faces in a John Ford production. I would have to single out Ward Bond as the head of West Point's Athletic Department who Power goes to work for as the best of the group. Also note Donald Crisp as Power's father, one of Crisp's best screen parts.\n\nTyrone Power was very proud of this film, it was a personal favorite and he and John Ford wanted to work together again. They did, but only with Power's voice providing the narration for an anthology film of three Irish stories in The Rising of the Moon in 1957. Tyrone Power's sudden and tragic death in 1958 put an end to what might have been a great actor/director collaboration.\n\nAt the beginning of the flashback, Power tells the actor playing Ike that it took him forty years or so to get the hang of the army. At the end he says that now everything he's ever known and loved is in that institution known as West Point. As Power says it, I defy anyone to remain dry eyed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT4M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2352397337",
        "name": "The Long Gray Line",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmMxNjg4NDEtZDNlNS00MzI0LWFmNDUtY2Q1NDMyMDM5N2QzXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmMxNjg4NDEtZDNlNS00MzI0LWFmNDUtY2Q1NDMyMDM5N2QzXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2019-06-12T17:18:40.444Z",
        "url": "https://www.imdb.com/video/vi2352397337/"
    },
    "url": "/title/tt0048312/"
}