{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jennifer Love Hewitt",
            "url": "/name/nm0001349/"
        },
        {
            "@type": "Person",
            "name": "Elijah Wood",
            "url": "/name/nm0000704/"
        },
        {
            "@type": "Person",
            "name": "Peter Gallagher",
            "url": "/name/nm0001251/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 676,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005875/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100425/"
        },
        {
            "@type": "Person",
            "name": "Hans Christian Andersen",
            "url": "/name/nm0026153/"
        },
        {
            "@type": "Person",
            "name": "Willard Carroll",
            "url": "/name/nm0141033/"
        }
    ],
    "datePublished": "2002-08-06",
    "description": "When two tiny people reunite fifteen years after their village was ransacked by a giant, they learn that they were very special people in the village.",
    "director": [
        {
            "@type": "Person",
            "name": "Glenn Chaika",
            "url": "/name/nm0149665/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Animation",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY2MjIyNzgxNF5BMl5BanBnXkFtZTcwMzM3MDQyMQ@@._V1_.jpg",
    "keywords": "thumbelina character,tom thumb character,psychotronic film,reference to king kong,village",
    "name": "The Adventures of Tom Thumb & Thumbelina",
    "original_info": {
        "id": "The Adventures of Tom Thumb and Thumbelina_2002",
        "name": "The Adventures of Tom Thumb and Thumbelina",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dcjc"
        },
        "dateCreated": "2005-02-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0185143/"
        },
        "name": "Compared to the likes of \"Rings\", \"Chihiro\" and \"Belleville\", this is completely downright FORGETTABLE.",
        "reviewBody": "It was but two and a half years ago that I saw an ad for this Miramax/Hyperion straight-to-DVD release on TV. From what I saw in it, I hoped it was nice and looked forward to it.\n\nThen, on the morning of Sunday, February 20th, at noon, it premiered on the Disney Channel. Still expecting something nice, I gave it my best shot...\n\nAnd what can I say? From the looks of things, DTV cartoons don't get any much worse than this...\n\nIt's such a living shame that the studio who brought a talking toaster and his friends to the world in the 80's--by that I mean Hyperion--is setting its standards down in this horrible marriage of two famous fairy tales. The animation is the most cheaply-made I have ever encountered, some of the lines are among the industry's bluest, and the musical rampage--well, what can I ever think about that?--is just forgettable.\n\nThe film suffers mainly in its two biggest problems:\n\n1) Elijah Wood--aka Frodo the Hobbit--starring as Tom, among all people?! As miscast as \"The Wiz's\" Diana Ross playing a grown-up Dorothy, and \"Hook's\" Robin Williams in the role of (ironically) the boy who never grew up, Peter Pan. Why couldn't they get anyone younger than that?\n\n2) Just how on earth can two people, who have never met each other, reunite?!! One of the biggest plot holes ever discovered in a cartoon. (Indeed...you have been WARNED!!!)\n\nEven puzzling is the participation of Bebe Neuwirth from \"All Dogs 2\", as Thumbelina's mom, and...\"America\" author Jon Stewart?\n\nSo, for those before me who have watched it, I urge you to steer clear of this mess, and stick with either the 1994 Don Bluth version of \"Thumbelina\", or MGM's 1959 adaptation of \"tom thumb\"!\n\nALSO RECOMMENDED: Pirates of the Caribbean 1, the LOTR trilogy, The Triplets of Belleville, Sen to Chihiro... (Spirited Away), Pokémon Heroes: Latios and Latias, The Brave Little Toaster, and the Shrek films.\n\n6\\10 -- A good watch for all its detestable worth, but (unless you're under age 5 and don't have any good sense of Hollywood) not worth watching again in your lifetime.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0185143/"
}