{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Tibbets",
            "url": "/name/nm0862544/"
        },
        {
            "@type": "Person",
            "name": "Harry S. Truman",
            "url": "/name/nm0874288/"
        },
        {
            "@type": "Person",
            "name": "W.H.P. Blandy",
            "url": "/name/nm0087426/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4311,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016488/"
        }
    ],
    "datePublished": "1982-10-29",
    "description": "Disturbing collection of 1940s and 1950s United States government-issued propaganda films designed to reassure Americans that the atomic bomb was not a threat to their safety.",
    "director": [
        {
            "@type": "Person",
            "name": "Jayne Loader",
            "url": "/name/nm0516363/"
        },
        {
            "@type": "Person",
            "name": "Kevin Rafferty",
            "url": "/name/nm0706268/"
        },
        {
            "@type": "Person",
            "name": "Pierce Rafferty",
            "url": "/name/nm0706274/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzQxMWY5ZGMtNWUzMi00Y2Y0LTk1MjctMWNkOTZlZGY4YTJjXkEyXkFqcGdeQXVyMjI3NDAyNg@@._V1_.jpg",
    "keywords": "human experimentation,detonation,hiroshima japan,bikini atoll,atomic fallout",
    "name": "The Atomic Cafe",
    "original_info": {
        "id": "The Atomic Cafe_1982",
        "name": "The Atomic Cafe",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ayse_hamid"
        },
        "dateCreated": "2004-11-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083590/"
        },
        "name": "History Repeating",
        "reviewBody": "Watching Atomic Café is like witnessing history repeating, since the scenes are a compilation of bits and pieces from pre-existing films taken from government and education films from the '40s and '50s. As a compilation film, Atomic Café has resulted in a totally new film that is much richer and more meaningful than the sum of its parts.\n\nAtomic Café, will be more understandable if we are familiar with the roots of its historical material. As a history film, Atomic Café takes us to experience three levels of time. The first is the internal time, the Cold War, communism versus the free world, when propaganda about the atomic bomb was made to persuade the people that only nuclear weapons would protect them from the \"Evil Empire\". The period of the'Nuclear Free' movement comes next. And thirdly, the present time, when the world is changed but has to face the same irony that still is just as relevant today, the fear of weapons of mass destruction.\n\nIn the beginning, the film appears to be a straightforward history of America's development and use of atomic weapons. Historical footage is used to add credibility to the information presented. The power of the bomb is demonstrated by showing dramatic footage of the Trinity test; interviews with Bikini Islanders, and preserved eyewitness congressional testimony of atomic bomb veterans. The impact of the weapon is documented through footage of the bomb victims. The intention is not to make us become objective about certain issues, rather it 'is designed to make us question the nature of the information presented' (Freeman Reading Packet, 108).\n\nThe film uses unique techniques. It is like a collage that 'sacrifices the conventions of continuity editing and the sense of a very specific location in time and place that follows from it to explore associations and patterns that involve temporal rhythms and spatial juxtaposition' (Nichols, 102). It is all about editing raw material and splicing segments? of military training films, civil defense films, archive footage, interviews, newsreel material, and fifties music. Many sequences are edited to show the most ridiculous side of the duck-and-cover drills and how naïve the Americans were at that time. To make it more derisive the film shows how the military training films were so amateurishly acted and misleading, such as the scene about the beauty of the H-bomb. I believe that the filmmakers have made their point in choosing all the footage for the film. Perhaps the intention is to challenge and deprive the intended message of the original footage.\n\nIf we take a look in more detail, Atomic Café chooses and juxtaposes its various elements to support its point-of-view. One of the examples is the continual references to radio receivers. Perhaps it is a symbol that is used to invoke the idea of the power of mass media. The intention is 'to sensitize us to the danger of uncritical media consumption' (Freeman Reading Packet, 110). It is so ironic to see how people in the '50s could be so passive that they believed in every single thing that they heard about the atom bomb on the radio. We can see from the footage how people became so afraid and escaped to their shelter after hearing that a bomb was launched. Perhaps fear had taken such control of these people that the more frightened they were, the more they were easily persuaded.\n\nI guess it would be a great mistake to ignore the political message that is contained in the film. Maybe for some viewers this is just a gimmick about the Cold War and things that happens during the '50's. But really, Atomic Café gives us an historical perspective for reconsidering the effect of the issues of war, nuclear warfare and weapons of mass destruction."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1069988633",
        "name": "The Atomic Cafe",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGEwYzUzN2UtYWYwNC00ZWUwLWFjNGYtMDc5YmNkMDZjNWRkXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGEwYzUzN2UtYWYwNC00ZWUwLWFjNGYtMDc5YmNkMDZjNWRkXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-07-20T17:14:32.058Z",
        "url": "https://www.imdb.com/video/vi1069988633/"
    },
    "url": "/title/tt0083590/"
}