{
    "@context": "https://schema.org",
    "@type": "VideoGame",
    "actor": [
        {
            "@type": "Person",
            "name": "Melissa Hutchison",
            "url": "/name/nm1563502/"
        },
        {
            "@type": "Person",
            "name": "Scott Porter",
            "url": "/name/nm2187603/"
        },
        {
            "@type": "Person",
            "name": "Mara Junot",
            "url": "/name/nm5235708/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7638,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "alternateName": "The Walking Dead: Season Two",
    "contentRating": "M",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0180284/"
        },
        {
            "@type": "Person",
            "name": "Charlie Adlard",
            "url": "/name/nm1891501/"
        },
        {
            "@type": "Person",
            "name": "Matt Allmer",
            "url": "/name/nm3468088/"
        },
        {
            "@type": "Person",
            "name": "Nick Breckon",
            "url": "/name/nm5805479/"
        }
    ],
    "datePublished": "2014-10-14",
    "description": "Left to fend for herself, Clementine has been forced to learn how to survive in a world gone mad. Many months have passed and she is in search of safety.",
    "director": [
        {
            "@type": "Person",
            "name": "Sean Ainsworth",
            "url": "/name/nm4302051/"
        },
        {
            "@type": "Person",
            "name": "Jason Latino",
            "url": "/name/nm6339980/"
        },
        {
            "@type": "Person",
            "name": "Dennis Lenart",
            "url": "/name/nm1520755/"
        }
    ],
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjcwOGVmODgtMWUxYS00Mjk3LTlkZDMtYjZkZDA3ZWJiYTI3XkEyXkFqcGdeQXVyNTM3NzExMDQ@._V1_.jpg",
    "keywords": "single player,xbox 360,microsoft windows,playstation 3,graphic adventure",
    "name": "The Walking Dead: The Game - Season 2",
    "original_info": {
        "id": "The Wire: Season 2_2003",
        "name": "The Wire: Season 2",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "quincytheodore"
        },
        "dateCreated": "2014-10-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3390964/"
        },
        "name": "Walking Dead is a brilliant, private and profound gaming experience.",
        "reviewBody": "It's pretty impressive that amidst all the next gen colossal titles, a game with much simpler nature will stand tall, merely by the brilliantly told story and passionately sympathetic characters. Continuing on the tradition and previous season, Telltale succeeds in delivering a personal and emotionally investing journey, this time focusing on Clementine. After surviving the hardship, baptized by blood and flesh, Clementine is slowly becoming more mature and tougher, while losing bits of innocence a little girls should hold for years to come, a proses which can be quickened by players' choice. Walking Dead will naturally draw players into caring for her, both her physical continuation and her mental well-being, and also characters she interacts with. This is a trait envied by many other games.\n\nPlayers will assume control over Clementine, she can relatively defend herself better this time, but as a child there are still many limitations to her. The game creates many situations where she has to trust or rely on others. This is a bit different than Lee and Clementine relationship before, although the main purpose is the same; to keep her safe. Characters might treat Clementine differently or have contradicting motives, furthermore they are not one dimensional and quite hard to predict, a great writing on Telltale's part. This uncertainty brings more dynamic trust play, but the mutual dependency of Lee and Clementine is admittedly missed.\n\nGraphic doesn't veer much from what Telltale is known for, comic style characters and background. Colors are nicely done, outline for visual are thick and heavily influenced by comic. Design for setting is sound, unique between each chapter and condition. The expressions are well made and this time around there are less lag when transitioning from scenes, although some bugs or stuttering persist. Action segments are more polished with the same concept of QTE is still in use. Loading time is also shortened a little. It's a slight improvement in technical department and also remains an artistic rendition, but certainly not as superior as majority of game nowadays.\n\nThe game's bread and butter are interaction and decisions. It is an interactive story, mixed breed between movie and game, so players will determine how Clementine will respond to certain events. Everything isn't a simple good or bad, there are times where hard decisions with looming consequences have to be made. The game really shines on the story, it feels personal and charming. While some scenes are probably inevitable, it's nice to see simple decisions might affect the scenes afterwards, be it small or large repercussion.\n\nNarrative is a very strong point in this game, dialogues are intimate and emotional. Dubbing as a crucial part of the game doesn't disappoint as the cast perform splendidly to bring characters to live, especially Melissa Hutchison who sounds so organic as Clementine. Accents are defined, subtle sobbing , light snicker or frightened scream fit very well depend on the circumstances. Considering how many possibilities and situations, the actors do incredible job. There's not much in term of music aside from instrumental tunes for moody vibe and some songs, particularly at the end of each episode. What little it has works fine.\n\nThe structure between episodes is solid, however season one was better constructed, just by a thin margin. While it does have advantage of having decisions more far reaching and more diverse conclusion, season 1 had mystery tone to it. Personally, I don't think there's a bond as strong as that of Lee and Clementine, and season 1 just had a very memorable ending. However, this merely constitutes as opinion as both games are undoubtedly excellent.\n\nThe game is relatively short, about two hours per episode. It keeps the appeal of the prequel with Clementine as the heart of the game, players will likely try to protect and nurture her. It's an achievement in storytelling to captivate audience and make them care for fictional characters. Walking Dead is a brilliant, private and profound gaming experience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Walking Dead: Season 2: In The Pines",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2405088537",
        "name": "The Walking Dead: Season 2: In The Pines",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWIzOTcwNjEtMmU3Ny00YmY3LWI0ZjUtZTVhMDMzOTcwZDA1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWIzOTcwNjEtMmU3Ny00YmY3LWI0ZjUtZTVhMDMzOTcwZDA1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-17T03:36:16.419Z",
        "url": "https://www.imdb.com/video/vi2405088537/"
    },
    "url": "/title/tt3390964/"
}