{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Candice Bergen",
            "url": "/name/nm0000298/"
        },
        {
            "@type": "Person",
            "name": "Brian Keith",
            "url": "/name/nm0001417/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9667,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "John Milius",
            "url": "/name/nm0587518/"
        }
    ],
    "datePublished": "1975-06-26",
    "description": "A Berber chieftain triggers an international incident, drawing the involvement of Theodore Roosevelt, when he kidnaps an American widow and her children in 1900s Morocco.",
    "director": [
        {
            "@type": "Person",
            "name": "John Milius",
            "url": "/name/nm0587518/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODA2YWFhMmMtMTRlZC00YTJlLWJlODEtNGEzMTBmYTA3MWNjXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "morocco,kidnapping,honor,battle of the sexes,boy",
    "name": "The Wind and the Lion",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cariart"
        },
        "dateCreated": "2003-08-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0073906/"
        },
        "name": "Connery Magnificent in Milius Masterpiece!",
        "reviewBody": "'The Wind and the Lion' is, simply put, one of the greatest adventure films ever made, a classic that helped break the 'James Bond' stereotype for Sean Connery, solidified Brian Keith's reputation as one of America's finest character actors, and gave action-oriented director John Milius his most 'audience-friendly' success. It is a sweeping epic in the tradition of 'Lawrence of Arabia', without the earlier film's subtexts of megalomania and sexual ambiguity. Here, the personalities are clearly defined; they start off on opposing sides, but through the nobility of their characters, their unspoken codes of honor, and a sense of old-fashioned chivalry in a modern world of betrayal and greed, by the film's climax, they become allies against a greater evil. \n\n Some critics attempted to link Theodore Roosevelt's world view in the film to the eventual U.S. debacle in Vietnam. That is unfair to both the film, and to Milius, who, if anything, admires and respects the 'big stick' idealism and machismo of our only true 'cowboy' President. (This respect led the director to film the excellent 'The Rough Riders', twenty-four years later, for TNT). Rest assured, 'The Wind and the Lion' is NOT a boring political treatise!\n\n The setting is Morocco in 1904, where an American woman (Candice Bergen, in perhaps her best screen performance), and her two children are kidnapped by 'the last of the Barbary Pirates' Sean Connery and his large band of followers, who are seeking restitution for a long political imprisonment by his family. In Washington, dynamic young President Teddy Roosevelt (brilliantly portrayed by Brian Keith) uses the incident to send in American marines, both to rescue the family, and influence the country's politics (much to the chagrin of Secretary of State John Huston!) Privately, Roosevelt admires the Arab's courage and honor, and wishes the two could face off in a duel to resolve matters.\n\n As her captivity continues, Bergen learns that the real villain is not Connery, who is truly the 'Chosen' leader of his people, but those who imprisoned him. The Americans discover this, too, as they see alliances being forged between the usurpers and greedy European powers, particularly Germany. Ultimately, this leads to a rip-roaring battle between the two forces, full of unforgettable images (Connery on horseback, at full gallop, snatching up a rifle offered by Bergen's son, is one of the great moments in film history!), as the film reaches a VERY satisfying conclusion.\n\n There are many wonderful aspects to this film, and Jerry Goldsmith's rousing score must be singled out; it is one of the finest of his long career, ranking with his soundtracks for 'Star Trek: The Motion Picture', and 'Patton'.\n\n 'The Wind and the Lion' is the kind of epic adventure \"they don't make anymore\". Happily, John Milius has proven that cliche wrong. This film is ABSOLUTELY essential in any Connery or action film collection. I HIGHLY recommend it!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from MGM",
        "duration": "PT3M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3847225369",
        "name": "The Wind and the Lion",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWY4Mzk0YjktNTY2MS00Zjg0LWE2M2QtNzgzMDAzZTVmZDBjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWY4Mzk0YjktNTY2MS00Zjg0LWE2M2QtNzgzMDAzZTVmZDBjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-30T03:57:59Z",
        "url": "https://www.imdb.com/video/vi3847225369/"
    },
    "url": "/title/tt0073906/"
}