{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Cagney",
            "url": "/name/nm0000010/"
        },
        {
            "@type": "Person",
            "name": "Humphrey Bogart",
            "url": "/name/nm0000007/"
        },
        {
            "@type": "Person",
            "name": "Priscilla Lane",
            "url": "/name/nm0485509/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14541,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Jerry Wald",
            "url": "/name/nm0907003/"
        },
        {
            "@type": "Person",
            "name": "Richard Macaulay",
            "url": "/name/nm0531335/"
        },
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        }
    ],
    "datePublished": "1939-10-28",
    "description": "Three men attempt to make a living in Prohibitionist America after returning home from fighting together in World War I.",
    "director": [
        {
            "@type": "Person",
            "name": "Raoul Walsh",
            "url": "/name/nm0909825/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTAwMTY5YjYtN2U1MC00ZGUxLWE2NzgtM2E1NDQ0Njk2ZWJhXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "organized crime,love triangle,new york city,rise and fall,bootlegger",
    "name": "The Roaring Twenties",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bsmith5552"
        },
        "dateCreated": "2005-02-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0031867/"
        },
        "name": "One of the Best of Warner's Gangster Films!",
        "reviewBody": "\"The Roaring Twenties\" more or less marked the end of Warner Bros. gangster films popular during the 1930s. For the next few years WWII would form the backdrop of their action films.\n\nThis one is full of action and memorable characters due largely to the presence of legendary director Raoul Walsh and its stellar cast.\n\nThree soldiers meet on the WWI battlefield in 1918. One is the all good lawyer Lloyd Hart (Jeffrey Lynn), one the thoroughly bad George Hally (Humphrey Bogart) and the third, an everyman named Eddie Bartlett (James Cagney). Eddie is smitten with a girl, Jean Sherman (Priscilla Lane) who has been corresponding with him from home.\n\nWhen the war ends Eddie returns to New York and hooks up with buddy Danny Green (Frank McHugh) who is a Gabie. Eddie goes to meet Jean but is disappointed to learn that she is just a teenager. Unable to find work, Eddie is forced to share the driving of Danny's cab. In the meantime, prohibition takes effect and Eddie discovers that bootlegging is the way to get rich. At the onset he meets saloon girl Panama Smith (Gladys George) who turns out to be his only friend.\n\nFast forward to 1924 and Eddie re-discovers Jean in a chorus line and decides to take a hand in her career. Eddie is now hopelessly in love with Jean much to the dismay of Panama. Jean however, is in love with Lloyd who has turned up as Eddie's lawyer. One night while hijacking a load of booze from rival gangster Nick Brown (Paul Kelly), Eddie meets up with George Hally (what are the chances of that?) who works for Brown. Hally decides to double cross Brown and throw in with Eddie. All the while Eddie is buying up taxis until he has immersed a fleet of 2,000 cabs.\n\nEverything is running smoothly until Hally begins to get his own ambitions and sets up Brown to Murder Eddie. The plot fails. Meanwhile Jean leaves Eddie and runs off with Lloyd and Eddie begins to drink. At the same time come the stock market crash of 1929 and Eddie is ruined. Hally however, didn't play the stocks and buys out Eddie's cab business for a small figure and leaves Eddie with but one cab for himself.\n\nEddie hits the skids along with the ever faithful Panama until Hally threatens Jean and Lloyd and.............\n\nCagney as usual dominates the picture. He is his usual cocky Irish tough guy but with character flaws. His love for Jean ultimately is what destroys him. Lane contributes a couple of classic songs (in her own voice) as Jean. Bogart as the thoroughly evil Hally gives us a preview of the Bogart tough guy image to come in the 40s. Gladys George almost steals the picture from Cagney as the tragic Panama and McHugh is sympathetic as Danny.\n\nOddly enough, for a gangster picture, there are no major characters in respect of crusading cops or district attorneys. All of the action is between the gangsters.\n\nCagney would not appear in another gangster film for ten years until \"White Heat\" (1949).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this film about an era",
        "duration": "PT3M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3218080793",
        "name": "The Roaring Twenties",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmUyNmNlNmYtOWZlZi00ZWJhLThmMTItNzAzMjg0YzE1ZmIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmUyNmNlNmYtOWZlZi00ZWJhLThmMTItNzAzMjg0YzE1ZmIyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T16:56:46Z",
        "url": "https://www.imdb.com/video/vi3218080793/"
    },
    "url": "/title/tt0031867/"
}