{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ulrich Mühe",
            "url": "/name/nm0618057/"
        },
        {
            "@type": "Person",
            "name": "Martina Gedeck",
            "url": "/name/nm0311476/"
        },
        {
            "@type": "Person",
            "name": "Sebastian Koch",
            "url": "/name/nm0462407/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 394354,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "alternateName": "The Lives of Others",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008261/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051615/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014456/"
        },
        {
            "@type": "Person",
            "name": "Florian Henckel von Donnersmarck",
            "url": "/name/nm0003697/"
        }
    ],
    "datePublished": "2007-03-30",
    "description": "In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives.",
    "director": [
        {
            "@type": "Person",
            "name": "Florian Henckel von Donnersmarck",
            "url": "/name/nm0003697/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmQyNmJjM2ItNTQzYi00ZjMxLWFjMDYtZjUyN2YwZDk5YWQ2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "1980s,stasi,spy,political thriller,berlin wall",
    "name": "Das Leben der Anderen",
    "original_info": {
        "id": "The Taste of Others_1999",
        "name": "The Taste of Others",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "drgyn2000"
        },
        "dateCreated": "2007-04-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0405094/"
        },
        "name": "Best film in years",
        "reviewBody": "After seeing the outstanding Pan's Labyrinth, I could not understand how anything could beat it to the Oscar for Best Film, let alone the accolade of Best Foreign Film. That was until I saw The Lives of Others.\n\nPutting it simply, this is the best film released in years. The framework of the story surrounds a Stasi officer who is assigned to monitor a writer and his actress girlfriend considered loyal to East German regime. That is all I am prepared to reveal because this film operates on so many levels that I wouldn't know where to begin. On the surface this can be enjoyed as a taut drama but essentially it is a study of the human condition and the capacity for compassion and humanity exists in even the most inhumane people. All of this is shot against the backdrop of the greys and browns of communist East Germany.\n\nAs a film it is virtually flawless. The three central performances are nothing short of electric, with particularly Ulrich Muhe giving one of the greatest leading man performances since Al Pacino in The Godfather. None of this would be possible without a brilliant script and exemplary direction, that brings the characters to life extracting the best out of the actors. The result is no words are wasted, and every scene is relevant and expertly conceived. This manages to explore deep issues without being turgid, is moving without being draining and remains gripping and entertaining without being superficial.\n\nIn summary, this is film-making at its finest. It is the sort of movie that you'll go down on bended knee and pay homage to the inventor of cinema, because it is films like this that cinema was created for. You'll forgive a year of tedious sequels and cash cows, for the one day that films like this get released.\n\n10 out of 10 is too modest.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0405094/"
}