{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jon Lovitz",
            "url": "/name/nm0001484/"
        },
        {
            "@type": "Person",
            "name": "Nick Jameson",
            "url": "/name/nm0417068/"
        },
        {
            "@type": "Person",
            "name": "Maurice LaMarche",
            "url": "/name/nm0005606/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8690,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041442/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042369/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078141/"
        },
        {
            "@type": "Person",
            "name": "Al Jean",
            "url": "/name/nm0419830/"
        },
        {
            "@type": "Person",
            "name": "Mike Reiss",
            "url": "/name/nm0718514/"
        }
    ],
    "datePublished": "1994-01-26",
    "description": "Jay Sherman is a New York film critic who has to review films he doesn't like for a living.",
    "genre": [
        "Animation",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmU0YzVmMTgtOWU4Ny00YzljLWE3ZTktYjVlZTU2NmJlMDdmXkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "critic,jay sherman,talk show host,movie spoof,movie review",
    "name": "The Critic",
    "original_info": {
        "id": "The Critic: The Complete Series_1994",
        "name": "The Critic: The Complete Series",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "film-critic"
        },
        "dateCreated": "2004-10-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0108734/"
        },
        "name": "Well, like most of America's cultural elite, I worship Pan, goat god.",
        "reviewBody": "Like most Simpsons watching fanatics that are also latched tightly to the Family Guy, I couldn't help but walk (never run) to buy this series when it came out. Jay Sherman is my inspiration for my excessive amounts of film reviews. He was never afraid to speak his mind about the garbage distributed by Hollywood ever week. His classic line, 'It stinks' inspired me to find those horrible films and make sure I warned others before it was too late. He is a God among Gods in my book!\n\nCreated by the same team that did The Simpsons, Sherman great to life through not only the witty banter that leapt from his mouth, but also his surrounding characters. Parodying some of cinema's finest, you cannot help but laugh at this obese critic that wants nothing more than to have respect and eat his Charleston Chew. Duke Phillips is one of the funniest characters created and provides some of the funniest social commentary on the extremely wealthy in our country. Sherman, in my eyes, represents the little man. While making $270,000 a year, he doesn't rise above anyone else. He reminds all of us of who we are, whether it would be running a marathon or trying to clean-up his hometown of New York, Sherman represents our desires and wants. One of our biggest desires is to see good cinema. We pay top dollar to see good movies, why does Hollywood continually fill our plate with all the bread we can eat before giving us the main course? Suddenly, we are too full to enjoy it.\n\nI would like to applaud Jay Sherman for his fight against a repetitive and uncreative Hollywood. As an avid film-goer it is nice to see the battle being fought in the animated world. Sadly, I only wish this series could have lasted long enough to endure some of the garbage released today. We need a new Jay Sherman to help us wade through and poke fun of today's Hollywood. \n\nI HIGHLY recommend this series to anyone that is as upset with Hollywood as I. This series will make you laugh at a large man that loves food and life.\n\nHe is our, and especially my, hero!\n\nGrade: ***** out of *****"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi562757913",
        "name": "The Critic",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2I2Y2U2NmYtZTQyZi00ZjY4LWIxY2YtMTU5YjQxYzI1OTk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2I2Y2U2NmYtZTQyZi00ZjY4LWIxY2YtMTU5YjQxYzI1OTk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:16:53Z",
        "url": "https://www.imdb.com/video/vi562757913/"
    },
    "url": "/title/tt0108734/"
}