{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Bowie",
            "url": "/name/nm0000309/"
        },
        {
            "@type": "Person",
            "name": "Rip Torn",
            "url": "/name/nm0001800/"
        },
        {
            "@type": "Person",
            "name": "Candy Clark",
            "url": "/name/nm0163748/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 27356,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103038/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078504/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033878/"
        },
        {
            "@type": "Person",
            "name": "Paul Mayersberg",
            "url": "/name/nm0562577/"
        },
        {
            "@type": "Person",
            "name": "Walter Tevis",
            "url": "/name/nm0856677/"
        }
    ],
    "datePublished": "1976-04-08",
    "description": "An alien must pose as a human to save his dying planet, but a woman and greed of other men create complications.",
    "director": [
        {
            "@type": "Person",
            "name": "Nicolas Roeg",
            "url": "/name/nm0001676/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTVhM2JhZDAtYWMwMS00NjE5LWI5ZTEtNDQxZmIxMzIxYzVlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "based on novel,alien,sex scene,dying planet,nonlinear timeline",
    "name": "The Man Who Fell to Earth",
    "original_info": {
        "id": "The Man Who Fell to Earth_1976",
        "name": "The Man Who Fell to Earth",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2008-02-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074851/"
        },
        "name": "visually a real trip. emotionally something else",
        "reviewBody": "Nicholas Roeg is a little tricky at times when it comes to narrative. Sometimes he experiments with it excellently (Bad Timing), and other times he slightly dulls the senses in an experimental kind of way (Dont Look Now). The Man Who Fell to Earth seems to be told mostly in a linear fashion, and there seems to be something of a story going on, but... I never felt it completely click. Maybe that is part of Roeg's point with the material, to create a kind of alienation that the alien, no pun intended, feels whilst gathering up the billions he needs to get supplies back to his home planet. But something just doesn't feel like it goes the way it should, even when things are fascinating in a scene, maybe even brilliant, and the actors do end up trying their best along with Roeg's knack at capturing a mood in a specific, strange but bewildering way.\n\nIt isn't totally clear where the plot could be headed, aside from the usual oblivion of the protagonist to the wretched TV, excess of alcohol, and some drugs to boot. Which is fine as a route of a plot. But it's perhaps that there doesn't seem to be a sharper satirical stabbing motion being made in the context of the story, of what Bowie's \"man\" is doing on Earth, except in bits and pieces. Perhaps he's a reflection of how some of us act right here on our planet, or that there's even a sorrow to the state of affairs with Thomas Newton, who is sensitive, sometimes weak, and at least a little unnerving in his detachment via the almighty dollar. Maybe there are some valid points made in connection with the suffering of a human being, in what it does to his soul the longer they're on some strange planet, by way of a horrible and dehumanizing marketplace. But the way it's presented, to once again pop up a word that gets tossed like a beach ball at a concert, in a pretentious manner.\n\nOr, to amend that with another tired cliché: the parts are better than the sum or the whole. I did enjoy very much just looking at the Man Who Fell to Earth, with some scenes, some shots, some transitions, some jabs at \"real\" cinema, displaying Roeg's natural gifts as an auteur at the peak of his powers. Just seeing that New York skyline, for instance, is a minor thrill, or in the cutbacks Newton has to his old world. Hell, even the sex scenes, much lauded in some of the more negative reviews, have a certain messy charm to them. And who doesn't love seeing Rip Torn as some smart but dangerous scientist who moves on from a penchant for young students in the sack to Newton's possible rocket-ship? Seeing scenes with Bowie and Rip Torn are, indeed, exciting in their indescribable link (Bowie, of course, so fits into Newton it's hard to figure anyone else in the part). I even loved the quirky, old rock and roll/jazz type of music Roeg used, when the first assumption would be Bowie would glam-rock the whole place up.\n\nIf there's anything that keeps the Man Who Fell to Earth from being a truly spectacular cult item though, if only for this reviewer, it's a certain mood overall to the piece, an uncertainty as to what to do with everything in the book and how to make it so unusual a piece of science fiction that its own alienation could potentially affect the viewer in unexpected ways. It's got guts to go where it does, to be sure, but it's a tough journey along the way, with romance, wonderment of the unknown, mental deconstruction, and corporate fables all entwined. Whatever you have to say about it there's nothing else like it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Man Who Fell to Earth: 35th Anniversary",
        "duration": "PT1M45S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi227718425",
        "name": "The Man Who Fell to Earth: 35th Anniversary",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzNkOTJiNGMtZmQzZC00MTY0LWEyMTUtMTU2OGQyYzk0NGM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzNkOTJiNGMtZmQzZC00MTY0LWEyMTUtMTU2OGQyYzk0NGM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-01-15T08:05:18Z",
        "url": "https://www.imdb.com/video/vi227718425/"
    },
    "url": "/title/tt0074851/"
}