{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Georgia Engel",
            "url": "/name/nm0257077/"
        },
        {
            "@type": "Person",
            "name": "Mickey Rooney",
            "url": "/name/nm0001682/"
        },
        {
            "@type": "Person",
            "name": "Jackie Burroughs",
            "url": "/name/nm0123201/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5645,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015560/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0178234/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004278/"
        },
        {
            "@type": "Person",
            "name": "Peter Sauder",
            "url": "/name/nm0766558/"
        },
        {
            "@type": "Person",
            "name": "Linda Edwards",
            "url": "/name/nm0250172/"
        },
        {
            "@type": "Person",
            "name": "Muriel Fahrion",
            "url": "/name/nm0265283/"
        }
    ],
    "datePublished": "1985-03-29",
    "description": "The Care Bears team up with a troubled brother and sister who just moved to a new town to help a neglected young magician's apprentice whose evil spell book causes sinister things to happen.",
    "director": [
        {
            "@type": "Person",
            "name": "Arna Selznick",
            "url": "/name/nm0783676/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmUwNTgzMzAtMmQ5Yi00ZmE2LTkxNjMtNGFjZTA4NjI2MmQyXkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "magician,cartoon bear,good versus evil,evil book,monkey",
    "name": "The Care Bears Movie",
    "original_info": {
        "id": "The Care Bears Movie_1985",
        "name": "The Care Bears Movie",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "San Franciscan"
        },
        "dateCreated": "2002-04-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0088885/"
        },
        "name": "I always hated the Care Bears... until now.",
        "reviewBody": "I always hated the Care Bears.\n\nThe reason why is simple. Let's face it: The Kenner Company itself admitted that the movies and TV episodes were designed to sell the toys of the same name, a nauseating trend that eventually bored kids to death by the end of the eighties. And I immediately hated anything that was so crass as to be merely an animated advertisement because it was pointing to a very uncertain future for the industry as a whole at the time. \n\nI was in my teens when the Care Bears were unleashed, and even with my reputation for creating cartoon animal characters I couldn't stand them and simply ignored them with every chance I got. The toys were EVERYWHERE and unavoidable, the TV show seemed to always be on in whatever store you went into and Kenner made a fortune. Trendy overload!\n\nI don't know exactly when the craze stopped...probably around the time the decade ended, I guess... and I forgot all about them until my little foster sister recently told me about how much she loved the Care Bears when she was a toddler, and would I like to watch this movie with her?\n\nI watched partially because I knew she wanted to share something special with me, but also because I was surprised to discover that this movie was animated by one of my all-time favourite studios, the award-winning Nelvana company up in Canada.\n\nAnd now, guess what?\n\nNow that the toys are all long gone (with the exception of being available online for collectors) and the merchandise is no longer being shoved down your throat until you want to scream, now that the trendiness has evaporated, and the movie has been long since stripped of any possibilities of being an advertisement for anything commercial at all... a film that once was the epitome of \"commercial sellout\" and \"unoriginal trendy tripe\" has now aged surprisingly well, and manages to stand on its own as a genuinely charming children's offering.\n\nAnd I never thought I'd ever be defending \"Care Bears\" anything.\n\nBut what once seemed like pop shlock trash now feels genuinely charged with lighthearted spirits, a childlike-wonder innocence and well-meant passion. The animation here, simply put, is gorgeous. But then, Nelvana has always had a rich tradition of adding top quality to whatever they set their minds to. Even more surprising, the songs are provided by Carole King and John Sebastian (both who now seem like perfectly logical and touching choices to musically illustrate this morality tale).\n\nIt actually managed to get me misty-eyed and even on the verge of a tear, especially since it now serves as a reminder of how much innocence has been lost in the animation industry since the 80s. Back then, animation was seen in the United States as kiddie fluff, and so no one except the artists who loved the medium took it seriously. But in the 90s, we got a vicious backlash as a whole crowd of new animators--all sick and tired of being mocked for being cartoonists while growing up--unleashed upon the world a torrent of the ugliest, most thoroughly vicious and vile animation until the situation completely reversed itself, and suddenly animation is now seen as too \"adult\" for its own good. Things like this simply never get made anymore.\n\nSo in the real world, much to my surprise, the Care Bears actually HAVE succeeded in doing what they were always claiming to be doing in their show--they've survived all this time and now they really ARE bringing a caring and sensitive Christian message to a world and especially an entire industry which has lost its innocence. Our world is becoming uglier and more jaded by the year. We desperately need films like this to show our children now as opposed to \"South Park\", \"Beavis and Butthead\" and \"Ren & Stimpy\".\n\nOne note I wish to make, though: if you decide to check out any other Care Bears videotapes, be sure they are done by Nelvana and are NOT the early attempts by DIC Enterprises (also sarcastically known as \"Do It Cheap\"). The DIC cartoons are horrid and just plain awful. But anything with the famous Canadian Nelvana label is guaranteed to be created by artists who--no pun intended--genuinely care."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Care Bears team up with a troubled brother and sister who just moved to a new town, to help a neglected young sorcerer's apprentice whose evil magic book causes sinister things to happen.",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2365375257",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzFkZjM4YjUtNDI2MC00YjZiLWI3ZjctOThhOTI3YzBkN2IyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzFkZjM4YjUtNDI2MC00YjZiLWI3ZjctOThhOTI3YzBkN2IyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-08T21:44:58.373Z",
        "url": "https://www.imdb.com/video/vi2365375257/"
    },
    "url": "/title/tt0088885/"
}