{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marlene Sanders",
            "url": "/name/nm1745441/"
        },
        {
            "@type": "Person",
            "name": "Adolf Hitler",
            "url": "/name/nm0386944/"
        },
        {
            "@type": "Person",
            "name": "Lothar Machtan",
            "url": "/name/nm1688184/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 118,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0088431/"
        }
    ],
    "datePublished": "2004-06-17",
    "description": "German historian Lothar Machtan proposed in his book that Hitler may have been gay and his desire to keep it a secret motivated many of his actions. This film details Machtan's explorations and provides other historians a chance t...",
    "director": [
        {
            "@type": "Person",
            "name": "Fenton Bailey",
            "url": "/name/nm0047259/"
        },
        {
            "@type": "Person",
            "name": "Randy Barbato",
            "url": "/name/nm0053190/"
        },
        {
            "@type": "Person",
            "name": "Gabriel Rotello",
            "url": "/name/nm0744748/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzM4OTAxMDUwMl5BMl5BanBnXkFtZTcwNzcyNTY1Mw@@._V1_.jpg",
    "keywords": "world war two,nazi,gay interest,closeted homosexual,character name in title",
    "name": "The Hidden Führer: Debating the Enigma of Hitler's Sexuality",
    "original_info": {
        "id": "The Hidden Fuhrer: Hitler's Sexuality_2004",
        "name": "The Hidden Fuhrer: Hitler's Sexuality",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2005-12-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0414097/"
        },
        "name": "very interesting but very self-serving",
        "reviewBody": "The title for this documentary is incorrect. You would think that the film discusses Hitler's sex life but it does not cover a broad range of theories or evidence but SOLELY focuses on homosexuality.\n\nThe theory that Hitler was gay certainly has SOME foundation. It is obvious to anyone who has studied this man's life that he was both a very sick monster and was, at best, unconventional in his sexual tastes. I already knew about some of the allegations of his homosexuality but the movie, at times, gives some convincing arguments I had never heard. Unfortunately, at other times, the connections are very tenuous at best (such as \"he loved Wagnerian operas--therefore he was gay\" comment). Plus, there is ample evidence of other possible theories about his sexuality that are completely ignored because it didn't fit the professor's theory. Downplayed are Hitler's relationships with women as well as the allegations he had them participate in sado-masochistic rituals (such as having them urinate on him). His relationship with his 16 year-old niece, Geli, is passed off in the documentary as \"being non-sexual\" and talked about for about 30 seconds is just inaccurate and unfair. They had been together exclusively for a couple years and Hitler was intensely jealous of her. She had hinted about his bizarre sexual requests and ultimately killed herself because all her efforts to leave him were thwarted. Isn't this relevant to the discussion of Hitler's sex life? Geli's suicide and Eve Braun's several attempted suicides could point to evidence he was gay OR had such sick sexual requests that the women would have rather died than complied.\n\nConsidering that books and documentaries have made these claims about sick relationships with women in the past, it is VERY odd that they aren't even mentioned in the film--probably because they paint a slightly different view of Hitler. All reputable historians would agree that Hitler was a sadistic maniac whose sex life was either non-existent or violent or strongly repressed. But the professor chooses, instead, to chart his own path and ignore evidence that might either challenge his theory or paint a picture of bisexuality. This just doesn't appear to be good research.\n\nSo why does the film still get a 7? Well, it does try hard to be different and did present some compelling evidence. There have been countless documentaries about Hitler that simply re-hashed old material. If the film were edited to include ALL evidence and theories, though, it could have been a lot better.\n\nFor another different take on Hitler, try watching Hitler and Stalin: Roots of Evil (or perhaps it's entitled \"Stalin and Hitler: Roots of Evil\"). This documentary compared the childhood and early years of both monsters to try to find psychological commonalities between them. Both had remarkably similar childhoods and the show is a sort of blueprint for what NOT to do when raising a child.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0414097/"
}