{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stacy Keach",
            "url": "/name/nm0005078/"
        },
        {
            "@type": "Person",
            "name": "Susan Tyrrell",
            "url": "/name/nm0879073/"
        },
        {
            "@type": "Person",
            "name": "Tisha Sterling",
            "url": "/name/nm0827594/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 483,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053968/"
        },
        {
            "@type": "Person",
            "name": "Edward Mann",
            "url": "/name/nm0542735/"
        },
        {
            "@type": "Person",
            "name": "Robert Chamblee",
            "url": "/name/nm0150468/"
        },
        {
            "@type": "Person",
            "name": "Jim Thompson",
            "url": "/name/nm0860292/"
        }
    ],
    "description": "Haunted by visions from his abusive childhood, Montana deputy sheriff Lou Ford gradually exhibits the signs of a homicidal schizophrenic.",
    "director": [
        {
            "@type": "Person",
            "name": "Burt Kennedy",
            "url": "/name/nm0447944/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODc5YmZkMmYtYjUzMS00YjUwLTk4MDAtNzhjNjhjZjEwZWE2XkEyXkFqcGdeQXVyMDY4MzkyNw@@._V1_.jpg",
    "keywords": "neo noir,cigar smoking,psychotronic film,prologue,scene during opening credits",
    "name": "The Killer Inside Me",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2007-02-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074746/"
        },
        "name": "Killer? Nah, he can't be. His such a good guy.",
        "reviewBody": "Lou Ford is the Deputy Sheriff of a small mining town of Central City Texas. He's one friendly, well-respected man of the community, who doesn't believe carrying around a gun in a well-balanced town. Though there's another side to Lou that no one else knows about. He has a past-inflicted schizophrenic trait, which causes him to snap when pushed by a hooker Joyce Lakeland.\n\nAfter watching director Burt Kennedy's obscured potboiler \"Wolf Lake\" not too long ago, he surprised me again with this curiously hypnotic psycho-thriller. Adapted from the novel of Jim Thompson, this diluted psychological study focus on a fatigue mind cracking under the insanity of something that's just too troubling to conceal without simply leading to dangerous lash-outs. The way Kennedy leisurely paces the opening half of the film is there to build upon that genuine feel created between Keach's character and the townsfolk. That when the sudden change in character and appearance takes hold, it has manipulated us into like everyone else that his character couldn't do a thing like that. The well-devised plot (which has a noir touch and a quietly disturbing streak within it) keeps an unpredictable rhythm about it and that also could be put down to Stacy Keach's blindingly full-rounded performance as the shadily relaxed and soft spoken town Sheriff Lou Ford. He manages to demonstrate a moodily emotional attachment to this troubled soul that becomes horrifyingly more chilling as the film goes on. This goes for how things seem to fall into place with a little help in making sure they do so. The story falls more into the mould of a character builder, organising and analysing its true intentions and dark insight than an all-out thriller looking for a jolt every couple minutes. For a small budget, Kennedy's direction is reliably accomplished along with William Fraker's vigorously grounded cinematography. Cooked up was a misguidedly, piercing tuneful sounding music score by Tim McIntire and John Rubinstein. Stacy Keach was terrific, but the supporting cast were just as good. A vivid Susan Tyrell (who was with Keach in \"Fat City (1972)\") added a scorning touch to her hooker Joyce. Don Stroud is fitting as the Mayor's loutish son Elmer. Tisha Sterling is sweetly likable as Ford's lady Amy Stanton. Keenan Wynn and John Carradine (in an entertaining small role) are solid in their parts. \n\nAn interestingly dark and well-written item with prominent performances (Keach and Tyrell), although its far from gob-smacking. Actually it has made me more interested in reading the book.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0074746/"
}