{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Walken",
            "url": "/name/nm0000686/"
        },
        {
            "@type": "Person",
            "name": "Elias Koteas",
            "url": "/name/nm0000480/"
        },
        {
            "@type": "Person",
            "name": "Virginia Madsen",
            "url": "/name/nm0000515/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32020,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0010508/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064505/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001270/"
        },
        {
            "@type": "Person",
            "name": "Gregory Widen",
            "url": "/name/nm0927074/"
        }
    ],
    "datePublished": "1995-09-01",
    "description": "At the scene of a bizarre murder, L.A. homicide detective Thomas Dagget discovers a lethal heavenly prophecy now being fulfilled on earth. In his fight to stop the forces of evil, he finds an unlikely ally in an elementary school ...",
    "director": [
        {
            "@type": "Person",
            "name": "Gregory Widen",
            "url": "/name/nm0927074/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjM4N2I0ZjYtMTFmNC00ZGQ0LWIzNmMtZDZjNzIwOGM1NzA0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "angel,scene of the crime,heaven,profanity,porn magazine",
    "name": "The Prophecy",
    "original_info": {
        "id": "The Prophecy_1995",
        "name": "The Prophecy",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "baumer"
        },
        "dateCreated": "1999-06-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114194/"
        },
        "name": "What a cast! A shockingly good film.",
        "reviewBody": "Religion has always been a clouded issue to me. There is absolutely no evidence that there is a God or an afterlife. But that hasn't stopped me ( and billions of people ) from believing in something. And I have always been taught that if there is good, then there is also the bad. If there is a heaven, there has to be a hell. The Prophecy tells us that there is, but it is not necessarily that cut and dried. The ruler of hell in this film is more like a character in a Martin Scorsese film. He is evil ( he has to be, he is Lucifer ) but he is not necessarily here to make God's life miserable. He is not necessarily good, but he is in a self serving kind of way.\n\nThe Prophecy is a very confusing and convoluted but brilliant film. The story ( bear with me here, it's been a while since I've seen this film ) is about a war between angels. Some angels became jealous when God decided he loved humans more than them. They become bitter and decide to start a war in heaven with the angels that are loyal to God. Their theory is that if the angels that oppose them are gone, they can take over certain things and hopefully get God's love back. To do this, they must steal the soul of the most heinous person that ever lived. We meet Gabriel, the lead angel in this crusade, and played by Christopher Walken, he is one of the most entertaining characters I have ever seen in the history of film. He has a sense of humour, he is vicious and he uses humans as slaves to do his dirty work. He catches them just before they are about to die and uses them with the promise that he will kill them once their job is finished. Here we meet Jerry, as his human monkey,and the only reason I mention this is because it is one of Adam Goldberg's early roles. He was Upham in Saving Private Ryan and watching this you could tell he had talent and that he would go places. He is fantastic in this film.\n\nElias Koteas plays Thomas, the only one who may have an insight into what is going on. He was a former priest who understands how religion is playing a part in all of this.\n\nEric Stoltz plays Simon, one of the good angels that is trying to save the world from Gabriel and he is very affective here as well.\n\nBut the star of this film is absolutely Walken. He is perfect as Gabriel. He has a sense of humour and he is evil at the same time. And in some ways you are rooting for him to win. That is until the very end when Satan shows up, because he steals every scene he is in as well.\n\nSatan is played with wicked slickness by Viggo Mortensen. When he speaks he almost slithers and creeps his words onto the screen. He makes a dark scene darker and he keeps you glued to the screen. And his role in this film is one that epitomizes convolution. He is awesome.\n\nThis film is one that should not be missed. If you don't understand everything about it the first time, watch it again and again. You'll learn something new every time. And you'll enjoy it more and more. This is one hell of a film!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3050348057",
        "name": "The Prophecy",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2EzNWFiYjAtNmFiYy00ZjMxLWIxZWEtYTIzNTZhNzgyZTEwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2EzNWFiYjAtNmFiYy00ZjMxLWIxZWEtYTIzNTZhNzgyZTEwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:56:15Z",
        "url": "https://www.imdb.com/video/vi3050348057/"
    },
    "url": "/title/tt0114194/"
}