{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Lemmon",
            "url": "/name/nm0000493/"
        },
        {
            "@type": "Person",
            "name": "Walter Matthau",
            "url": "/name/nm0000527/"
        },
        {
            "@type": "Person",
            "name": "John Fiedler",
            "url": "/name/nm0275835/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35954,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Neil Simon",
            "url": "/name/nm0800319/"
        }
    ],
    "datePublished": "1968-05-16",
    "description": "A New Yorker newly separated from his wife moves in with his best friend, a divorced sportswriter, but their ideas of housekeeping and lifestyles are as different as night and day.",
    "director": [
        {
            "@type": "Person",
            "name": "Gene Saks",
            "url": "/name/nm0757256/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDVhNzQxZDEtMzcyZC00ZDg1LWFkZDctOWYxZTY0ZmYzYjc2XkEyXkFqcGdeQXVyMjA0MDQ0Mjc@._V1_.jpg",
    "keywords": "friends who live together,buddy movie,male couple,friendship,male protagonist",
    "name": "The Odd Couple",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "policy134"
        },
        "dateCreated": "2006-06-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063374/"
        },
        "name": "One of my all-time favorites plus one of the quintessential comedy pairings of 20th century",
        "reviewBody": "I simply can't get over how brilliant the pairing of Walter Matthau and Jack Lemmon is. It's like the movie doesn't even need additional characters because you can never get tired of the dialog between these two.\n\nLemmon had already been in several well-known films like Mr. Roberts and The Apartment and Matthau was fresh off his Oscar win for The Fortune Cookie (another Billy Wilder film also with Lemmon). That particular movie wasn't as great as this one because the story couldn't sustain such a long running time (I think it was almost 2 hours). However, this goes by at a brisk hour and a half, even though the introduction of the events leading up to Lemmon ending up at Matthau's apartment is a tad long (so was this sentence). That's a minor quibble though and for the rest of the running time you have a marvelous time.\n\nI have already written a comment about how the follow-up to this film sucked and I won't go deeper into that. The reason why this is such a joy is probably that the movie was made just as the innocence of American movies was beginning to fade fast into oblivion. There are some sexual references but they are dealt with in such an innocent way that you couldn't even get a \"Well, I never...\" out of the most prudish person out there. It is kind of fun to see a movie from a long lost era and that was probably why the sequel didn't work because you had Matthau and Lemmon say quite a few f-words and that just doesn't fit them.\n\nOf course, now they are both gone and you can just be happy that you still can enjoy them in a marvelous film like this. I think the only male actor in this film who is still alive is John Fiedler. Edelman died recently. So there you have it. Simply one of the best comedies and films ever.\n\nAdd: I have just learned recently that John Fiedler has died so to all the fans of him I am deeply sorry. I didn't mean any disrespect and I will try to be more careful of what I am blah blah blahing next time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi291487513",
        "name": "The Odd Couple",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTE2OThiYjctNTQ2Mi00NWRiLTk1ZWUtMzMzOGFjY2M4NTgxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTE2OThiYjctNTQ2Mi00NWRiLTk1ZWUtMzMzOGFjY2M4NTgxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-07T23:28:14.718Z",
        "url": "https://www.imdb.com/video/vi291487513/"
    },
    "url": "/title/tt0063374/"
}