{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ulrich Thomsen",
            "url": "/name/nm0860947/"
        },
        {
            "@type": "Person",
            "name": "Lisa Werlinder",
            "url": "/name/nm0921320/"
        },
        {
            "@type": "Person",
            "name": "Ghita Nørby",
            "url": "/name/nm0639152/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4793,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "The Inheritance",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0136662/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0148051/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056285/"
        },
        {
            "@type": "Person",
            "name": "Per Fly",
            "url": "/name/nm0283377/"
        },
        {
            "@type": "Person",
            "name": "Kim Leona",
            "url": "/name/nm0502547/"
        },
        {
            "@type": "Person",
            "name": "Mogens Rukov",
            "url": "/name/nm0750000/"
        }
    ],
    "datePublished": "2004-07-09",
    "description": "A young man is torn between his individual hopes and his sense of duty when his father dies and he is expected to take over the family industry.",
    "director": [
        {
            "@type": "Person",
            "name": "Per Fly",
            "url": "/name/nm0283377/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk5Nzc5NjcwMl5BMl5BanBnXkFtZTcwMzExMTkyMQ@@._V1_.jpg",
    "keywords": "actor,female full frontal nudity,female frontal nudity,duty,vomiting",
    "name": "Arven",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gradyharp"
        },
        "dateCreated": "2006-11-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328844/"
        },
        "name": "Family: Obligations, Commitments, Consequences",
        "reviewBody": "Writer/director Per Fly is a strong filmmaker from Denmark who is unafraid to make controversial statements that challenge certain 'family values' sentiments prevalent in this country. In this brilliantly written, directed and acted film he manages to reveal the inner destruction of a family under whose surface is an institution of envy. It is a riveting film that despite its in excess of two-hour length keeps us riveted to our seats in its never-ending exploration of the darker side of familial machinations.\n\nChristoffer (Ulrich Thomsen) has escaped his Danish family and is comfortably ensconced in Stockholm as a successful restaurateur, living with the beautiful actress Maria (Lisa Werlinder) whose love for life extends beyond the fulfilling pleasures of the boudoir. Their bliss is interrupted by an unexpected visit from Chrisoffer's father who briefly spends time with the couple, happy for their state of success in all things. Upon his departure Christoffer receives a phone call that his father has hung himself and his presence is demanded in Denmark. Christoffer and Maria fly home to the matriarch of the family, Christoffer's mother Anneliese (the brilliant Ghita Norby) who immediately takes charge of the family, demands that Christoffer take over the failing family steel company thus skipping over Christoffer's designated brother-in-law Ulrick (Lars Brygmann), a fact that tears at Christoffer's sister Benedikte (Karina Skands). Taking the position of head of the family business would mean his giving up his dreams in Stockholm, negate Maria's burgeoning acting career, and placing Christoffer in the ominous position of having to fire longtime employees and make changes that would decimate many - not the least of which would be Christoffer's character. But Anneliese is strong and gets her way and thus the destruction of Christoffer's humanity and life begins.\n\nChristoffer is able to merge the company with a French company and make the family business successful. But at what a cost? Maria leaves him after they have a child, Benedikte collides with him over his ruining her life with Ulrick, and Christoffer moves to France where he drowns his sorrows in alcohol. Per Fly is not one to tidy up all of the loose ends of a family disintegration: he leaves the end results of a bad decision up to the audience to figure out. It is this respect for the audience that endears this artist to us. The script is brilliantly written, the acting is superb, and the direction is tight and sensitive to the storyline. In every way this is a film worthy of our attention, not only as an art piece, but also as a means of re-examining 'family values' that here are presented in quite a different light than our usual reference phrase suggests. Highly recommended. Grady Harp",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0328844/"
}