{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edouard Baer",
            "url": "/name/nm0046347/"
        },
        {
            "@type": "Person",
            "name": "Marie-Josée Croze",
            "url": "/name/nm0189887/"
        },
        {
            "@type": "Person",
            "name": "Clovis Cornillac",
            "url": "/name/nm0180404/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1710,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "The Story of My Life",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037192/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048273/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079764/"
        },
        {
            "@type": "Person",
            "name": "Laurent Tirard",
            "url": "/name/nm1016687/"
        },
        {
            "@type": "Person",
            "name": "Grégoire Vigneron",
            "url": "/name/nm0897065/"
        }
    ],
    "datePublished": "2004-09-08",
    "description": "Raphael is a ghostwriter who takes a job writing for famous footy player Kevin. To his delight and his girlfriend, Murials horror, Kevins current girlfriend is an old (easily rekindled) flame of Raphaels. A freak accident leaves a...",
    "director": [
        {
            "@type": "Person",
            "name": "Laurent Tirard",
            "url": "/name/nm1016687/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMwOTk1ODU3NV5BMl5BanBnXkFtZTcwODI4MzgyMQ@@._V1_.jpg",
    "keywords": "narrative,self discovery,romantic rivalry,pregnancy,ghost writer",
    "name": "Mensonges et trahisons et plus si affinités...",
    "original_info": {
        "id": "The Story of the Weeping Camel_2004",
        "name": "The Story of the Weeping Camel",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fabibi"
        },
        "dateCreated": "2004-09-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0383025/"
        },
        "name": "Incredibly funny comedy about thirtysomethings in love",
        "reviewBody": "God did I laugh all the way through this movie ! I just loved, loved, loved it. I agree it is not as profound as a Woody Allen feature, nor will it be remembered as a masterpiece in sociological studies, but this enchanting comedy manages to be funny and heartwarming without taking the audience for granted. I bet anyone over 30 will recognize something about him/her self in the characters.\n\nRaphael (Edouard Baer, France's answer to Hugh Grant) is in his mid thirties. He's writing famous people's autobiographies -- and obviously his name never appears on the book's sleeve. And he's fine with that. His girlfriend, Muriel (Marie-José Croze, a character actress with girl-next-door appeal) doesn't understand his reluctance to publish his own works under his name : what is he hiding from and what exactly is he scared of ? One day, Raphael's boss assigns him to write the biography of a dumb, ultra famous football player, Kevin (Clovis Cornillac, hilarious). When Raphael realizes that Kevin's girlfriend is his former college flame, Claire (Alice Taglioni, playing the high powered bitch you can't help falling for), things go reaaaaaally ugly... and incredibly funny. Add to that Raphael's two buddies, neo hippie Jeff (Eric Berger) and yuppie Max (Jean-Michel Lahmi), and you've got a movie that's really hilarious in its depiction of french thirtysomethings searching for the true meaning of their lives.\n\nThe film has already been despised by some movie critics and intellectuals who wrote in their columns that the situations are so exaggerated that they build an unbreakable wall between the movie and the audience. But that's the point of a farce, actually. And when deep within the farce and the absurdity of the comic situations you can still be moved and you still recognize yourself, then the director's won the game. And I totally surrender to Laurent Tirard (the director)'s talent : the movie's a knock-out, albeit a funny one.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0383025/"
}