{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Cargol",
            "url": "/name/nm0137105/"
        },
        {
            "@type": "Person",
            "name": "Françoise Seigner",
            "url": "/name/nm0782563/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8529,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "The Wild Child",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0289659/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106723/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026336/"
        },
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        },
        {
            "@type": "Person",
            "name": "Jean Gruault",
            "url": "/name/nm0344171/"
        },
        {
            "@type": "Person",
            "name": "Jean Itard",
            "url": "/name/nm0411639/"
        }
    ],
    "datePublished": "1970-09-11",
    "description": "In a French forest in 1798, a child is found who cannot walk, speak, read or write. A doctor becomes interested in the child and patiently attempts to civilize him.",
    "director": [
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzgyNTdlMDYtYjQzYS00YWYxLTg2ODUtODQyNTk4ZGQ1MWM5XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "education,countryside,doctor,feral child,alphabet letter",
    "name": "L'enfant sauvage",
    "original_info": {
        "id": "The Wild Child_1969",
        "name": "The Wild Child",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2006-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064285/"
        },
        "name": "Truffaut asks the question through a dramatic narrative- can humanity be brought out through science?",
        "reviewBody": "The Wild Child could be the kind of movie that doesn't work. In a way it's hard to find what the dramatic conflict of the film would be if not for the push & pull struggle between the scientists and his 'test' subject of sorts, Victor, the wild child of the title. But somehow it does- Truffaut laces the film with a kind of undertone of logic for the audience (how can a boy for most of his life be out in the wild and become suddenly domesticated), while making a sort of nature versus society statement. The film also has the director's trademark lightness, which helps to not make the film's subject matter too bleak or disparaging. For it could be- Truffaut actually gives a kind of suspense to the narrative at times, that just when you think Victor is on his way to success, he stumbles and starts to act out on the floor or escape into the wild for a breather. It's a very curious film, not just because Truffaut (in one of his few times) gives himself the starring role, but also that the child- like Makim Munzak in Kurosawa's Dersu Uzala- had his only significant role ever in the film. And it's quite the seemingly impulsive, and always alive, performance that filmmaker's rarely get out of children.\n\nVictor is named this only halfway through the film, and it starts off with him being chased by a small mob and their dogs through the woods. It's maybe the most exciting part of the film, but then this segways into the early stages of the boy's troubles. He's placed in a deaf and dumb school, beat up by the other kids, and still with the passions and intelligence that the woods have given him. It becomes a fascination in the story of what the limits, if any, are for him to learn everything real boys do. Once he's put into Dr. Itard's (Truffaut) care, then the film sets off onto a very direct path- how will he learn, will he, and how long will it it take? As with his other films, the literary aspect kicks in as the scientist takes repeated notes on the boy, using a kind of pre-Darwinian way of scientific methods. But it's within the little moments in the film, like when Victor is out on his walks, or makes his little successes, where Truffaut as a filmmaker picks up the best parts of the film.\n\nThis could be a very routine picture, and for some it may actually be a little dull and disheartening. Will the boy ever learn? The film actually does raise questions within its format, as it is based on a true case (from taking science classes I know there are also others of this kind as well). It brings to mind about what is pure and delicate about the ways of an animal and what separates them and humans. Each little test becomes dramatic conflict in the structure Truffaut puts forth, and in a way it's rather experimental. And it even becomes delightful in certain scenes, like when he first learns how to ask for milk, and then this expands. This, along with a sweet Vivaldi score in the background, and interesting visuals (love the iris usage), makes it a worthwhile entry in Truffaut's oeuvre. Not one of his absolute best, but up there.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In a French forest in 1798, a child is found who cannot walk, speak, read or write. A doctor becomes interested in the child and patiently attempts to civilize him.",
        "duration": "PT1M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3355558425",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWU3YzMyYTItMGExMi00MTQ2LWJkMGItZTNmNmZmYzkwMDY0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWU3YzMyYTItMGExMi00MTQ2LWJkMGItZTNmNmZmYzkwMDY0XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-08-05T00:02:53.678Z",
        "url": "https://www.imdb.com/video/vi3355558425/"
    },
    "url": "/title/tt0064285/"
}