{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ron Perlman",
            "url": "/name/nm0000579/"
        },
        {
            "@type": "Person",
            "name": "Daniel Emilfork",
            "url": "/name/nm0256399/"
        },
        {
            "@type": "Person",
            "name": "Judith Vittet",
            "url": "/name/nm0900136/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 69758,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "The City of Lost Children",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070568/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054943/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0545615/"
        },
        {
            "@type": "Person",
            "name": "Gilles Adrien",
            "url": "/name/nm0012496/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Jeunet",
            "url": "/name/nm0000466/"
        },
        {
            "@type": "Person",
            "name": "Marc Caro",
            "url": "/name/nm0001988/"
        }
    ],
    "datePublished": "1995-12-15",
    "description": "A scientist in a surrealist society kidnaps children to steal their dreams, hoping that they slow his aging process.",
    "director": [
        {
            "@type": "Person",
            "name": "Marc Caro",
            "url": "/name/nm0001988/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Jeunet",
            "url": "/name/nm0000466/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Drama",
        "Fantasy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjBlOGFhODEtZThmMS00OTgwLTk0MjAtNDgxNWFhY2JhYTE1XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "psychotronic film,underwater scene,slimehouse,steampunk fantasy,steampunk sci fi",
    "name": "La cité des enfants perdus",
    "original_info": {
        "id": "The City of Lost Children_1995",
        "name": "The City of Lost Children",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Mike Z-2"
        },
        "dateCreated": "2001-11-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112682/"
        },
        "name": "Wonderfully Bizarre",
        "reviewBody": "Written for English class my freshman year in high school.\n\nLights! Camera! Action! What makes a good movie? Better yet, what makes a great movie? In my opinion, a great movie should include almost flawless acting, a finely woven and gripping plot, music that is both beautiful and suitable, and great direction. Of course, mesmerizing visuals and art direction can also contribute to great films. So, for all the reasons above, I consider \"The City Of Lost Children\" the best film of 1996.\n\nThe plot of \"The City Of Lost Children\" is completely original and it never lets your mind wander off to other places. It also involves quite a few fascinating and somewhat weird characters in a dreary harbor town called \"The City Of Lost Children\" (hence the title). One(that is his name) is a slow-minded circus strongman who searches for his adopted little brother who has been kidnapped by a group of henchmen with robotic eyes called the Cyclops. One's little brother has been kidnapped and taken to a quickly aging mad scientist named Krank so that his dreams may be stolen. The mad scientist needs the dreams of children so that he will not age so quickly. The source of this problem is a curse that was put upon him. Because of this curse, his wife is a midget, he cannot dream, and he has seven identical sons (all of whom have a strange sleeping disorder). In this movie there is somewhat of a subplot that involves a wicked pair of unseparated siamese twin sisters. These women run a sort of school where they have the children in it steal for them. One small, but tough, girl named Miette runs away from the school, finds One, and aides him in his search. When the two women find out about their little thief, they go to Marcello, a retired man who used to run a circus freakshow, to get what they need to catch and kill the little girl and her newfound friend. Although this plot seems a bit hard to follow, it all fits together perfectly in the end with wondrous results. To accompany this odd story, there is a beautiful soundtrack composed by Angelo Badalmenti with one song (\"Who Will Take Your Dreams Away\") by Marianne Faithful. This music fits the mood and plot of the story perfectly and stays with you(as does the movie itself) long after the credits have rolled.\n\nThe casting director of \"The City Of Lost Children\", Pierre-Jacques Benochou, sure knew what he was doing, because there is not one poor (or mediocre one, for that matter) performance in the whole film. In fact, I might just say all the performances were virtually flawless. Ron Perlman's performance as the slow and dimwitted circus strongman One is beautifully acted. Mr. Perlman should especially be recognized because he is an American actor and this is a subtitled French film. Daniel Emilfork as the depressed and dreamless mad scientist with a short temper is outstanding and most believable. Dominique Pinon is wonderful (perhaps the best actor in the whole movie) as the seven rubberfaced identical brothers (yes, he does play all of them, and with fantastic results, too). The two different actresses who portray the siamese twins, Odile Mallet and Genevieve Brunet, are perfectly wicked and their timing is impeccable. Last, but not least, the children, with Judith Vittet as Miette in a stand-out performance, all carry out their roles with smashing results.\n\nAnother reason for me choosing \"The City Of Lost Children\" as the best movie of 1996 is its stunning direction. This movie was directed by the famous French directing team of Jean Pierre Jeunet and Marc Caro(a.k.a. \"Jeunet and Caro\"). The camera angles that are used during the course of this film are a totally different experience and they keep you mesmerized from start to finish. The directors of this film are, in my opinion, masters of the camera. The visuals in this movie also contributed to my conclusion that this is the best movie of 1996. Whatever it might have been, whether the bleak and unique use of colors or the special effects, I was absolutely captivated by what I was seeing on the screen. What I particularly liked about this film's special effects was that they were not the typical flashy and in-your-face computer special effects that some of today's blockbusters and other genre films seem to have. I think such special effects distract you from the rest of the movie. On the contrary, the special effects of \"The City Of Lost Children,\" however, are very subtle. A final thing I liked about this film were its sets. From the waterlogged streets of the dank and moldy town to the spectacular gadgetry of Krank's laboratories everything was a magnificent panorama for the eye to behold.\n\nWas the plot great? Yes. How was the acting? Outstanding. Was the direction done well? Definitely. How did the visuals appear? They were beautifully presented. From what you have read, whether you have concluded to avoid this movie completely or go out and rent it right away (I do understand that this movie does have a select audience), I am hopeful that you understand the picture I am trying to paint. Even if the story will not appeal to you, it is still splendidly done. Overall, though, \"The City Of Lost Children\" is definitely the best movie of 1996 for me.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4236902681",
        "name": "The City of Lost Children",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDlkNTAzY2MtNmVjYS00Mzk5LWJlNGYtNzI1N2JhZDgwMmMxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDlkNTAzY2MtNmVjYS00Mzk5LWJlNGYtNzI1N2JhZDgwMmMxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:15:47Z",
        "url": "https://www.imdb.com/video/vi4236902681/"
    },
    "url": "/title/tt0112682/"
}