{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dennis Quaid",
            "url": "/name/nm0000598/"
        },
        {
            "@type": "Person",
            "name": "Jake Gyllenhaal",
            "url": "/name/nm0350453/"
        },
        {
            "@type": "Person",
            "name": "Emmy Rossum",
            "url": "/name/nm0002536/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 457267,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050111/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060306/"
        },
        {
            "@type": "Person",
            "name": "Roland Emmerich",
            "url": "/name/nm0000386/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Nachmanoff",
            "url": "/name/nm0618680/"
        }
    ],
    "datePublished": "2004-05-28",
    "description": "Jack Hall, paleoclimatologist, must make a daring trek from Washington, D.C. to New York City to reach his son, trapped in the cross-hairs of a sudden international storm which plunges the planet into a new Ice Age.",
    "director": [
        {
            "@type": "Person",
            "name": "Roland Emmerich",
            "url": "/name/nm0000386/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWNkNzljZjktY2MwNi00OWExLTliNTMtOTk0NGU2ZDQ3ZTEyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "global warming,end of the world,climate crisis,climate,weather",
    "name": "The Day After Tomorrow",
    "original_info": {
        "id": "The Day After Tomorrow_2004",
        "name": "The Day After Tomorrow",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Victor Field"
        },
        "dateCreated": "2004-06-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0319262/"
        },
        "name": "It's the end of the world as we know it, and I feel okay.",
        "reviewBody": "\"The Day After Tomorrow\" is a disaster movie, but it isn't a disastrous one. But if Roland Emmerich really thought he was making a movie with a message, he didn't quite succeed - to be honest, Emmerich is to serious film-making as Naomi Wolf is to recommending \"Voluptuous\" magazine. The fact that the movie begins with the Twentieth Century Fox logo under stormy skies doesn't make it any more significant.\n\nWell-intentioned it may be, but the movie's plot takes second place to the imagery - the opening credits over an icy landscape, the massive weather systems over the planet, colossal hailstones pelting down on Tokyo, snowstorms over India, tidal waves - and the numerous effects houses make it an eye candy feast, especially for people with a grudge against the Big Apple (kudos to Industrial Light and Magic, Digital Domain and all the less renowned FX companies involved). So on that level, it works; the music by Harald Kloser and Thomas Wanker is also a bonus, being more restrained and serious in its support than is usually the way with Emmerich movies.\n\nAnd then there's the script - it has a whole load of characters but doesn't do much with any of them. Example: Climatologist Dennis Quaid's relationship with son Jake Gyllenhaal doesn't seem to be as estranged as it's intended to be, and similarly the friendship Quaid has with a longtime colleague gets about as much emphasis as the crush his younger colleague has on fellow scientist Tamlyn Tomita (and the movie pays for it later on in a sequence shamelessly ripped off from \"Vertical Limit,\" which has little of the emotional resonance it should). In fact, all the human elements - Gyllenhaal's repressed feelings for classmate Emmy Rossum, his doctor mother Sela Ward's problems with a young patient, etc - all of them are underdeveloped or just plain undeveloped, and some moments practically scream \"Contrived Climax Ahoy!\" \n\nThose moments are there because \"The Day After Tomorrow\" doesn't have an enemy as a natural outgrowth of its story; the elements aren't really villainous as they have no concept of right or wrong, and the closest thing to a villain here is the current administration in the White House, so Emmerich and co-writer Jeffrey Nachmanoff have to impose a tangible enemy (why else are those wolves there?) on the proceedings. This does help things from getting totally boring in the second half, though it's still pretty watchable even then - but if some more thought had been put into the screenplay, like exploring the characters or developing the promising ideas therein (like Americans fleeing to Mexico, or further looks at the Government side), it would have carried more weight and made the movie into more than an improvement on \"Godzilla.\" \n\nAs it is, it's a competently done if implausible attention-holder that wants to be more; that it actually had the potential to be more makes it a bit of a disappointment, but at least it's a watchable one."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3008019993",
        "name": "The Day After Tomorrow",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjljZjVhMGMtYjM3ZS00YWFmLWE2NjAtMjJjYjRkMmMxNjdiXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjljZjVhMGMtYjM3ZS00YWFmLWE2NjAtMjJjYjRkMmMxNjdiXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-27T17:06:37.630Z",
        "url": "https://www.imdb.com/video/vi3008019993/"
    },
    "url": "/title/tt0319262/"
}