{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tien Miao",
            "url": "/name/nm0583964/"
        },
        {
            "@type": "Person",
            "name": "Kang-sheng Lee",
            "url": "/name/nm0497642/"
        },
        {
            "@type": "Person",
            "name": "Yi-Ching Lu",
            "url": "/name/nm0523717/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3124,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "The River",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020354/"
        },
        {
            "@type": "Person",
            "name": "Ming-liang Tsai",
            "url": "/name/nm0158857/"
        },
        {
            "@type": "Person",
            "name": "Yi-chun Tsai",
            "url": "/name/nm0874642/"
        },
        {
            "@type": "Person",
            "name": "Pi-ying Yang",
            "url": "/name/nm0946040/"
        }
    ],
    "datePublished": "1997-08-07",
    "description": "A young man develops severe neck pain after swimming in a polluted river; his dysfunctional parents are unable to provide any relief for him or themselves.",
    "director": [
        {
            "@type": "Person",
            "name": "Ming-liang Tsai",
            "url": "/name/nm0158857/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODI3YTA0MzQtNjZmYi00Njk4LWE1N2MtZWJjNmQ0YjlmYWM0XkEyXkFqcGdeQXVyNjY5MDUyMjE@._V1_.jpg",
    "keywords": "gay father,gay son,gay,closeted gay,swimming",
    "name": "He liu",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2002-10-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119263/"
        },
        "name": "Disturbing depiction of emotional disconnect",
        "reviewBody": "In The River (1997) by Taiwanese director Tsai Ming-Liang, Xiao-kang (Lee Kang-sheng), meets a young woman (Chen Shiang-chyi) on an escalator in a downtown Taipei mall. The woman introduces him to a film director (Ann Hui) who recruits him to play a corpse floating down a polluted river. Shortly afterward, Xiao-kang mysteriously experiences severe neck pain. Although he receives medical, chiropractic, and acupuncture treatment, his condition worsens and he spends most of the film groaning in pain and holding his neck. As in Todd Haynes' Safe (1995), another film about illness that worsens despite treatment, it remains uncertain whether the cause is physical or psychological.\n\nThere have been many films about the failure of modern society to provide a coherent set of values for people, particularly Wim Wenders' Paris, Texas, and Michael Haneke's Code Unknown, but none convey the feeling of emotional deadness and isolation more effectively than The River. It is so alienating in its lethargic pace that it makes Andrei Tarkovsky look like Michael Bay. With no close-ups, no soundtrack other than environmental noises, minimal dialogue and plot, and long takes that focus on objects for minutes at a time, the film challenges us to stay tuned in.\n\nRelationships in The River are cold and impersonal, and Xiao-kang's family is about as profoundly isolated as can be imagined. All we see in the beginning are three individuals going their separate ways, performing most of life's routine chores exclusively by themselves. It is well into the film until we even know they are a family unit. They never speak to each other, sleep or eat together. The father (Miao Tien) is a retired, dumpy-looking man who frequents the Gay saunas. Xiao-kang's mother (Lu Hsiao-ling) is an elevator operator who watches pornographic videos that she obtains from her secret lover, a seller of such material. Xiao himself has a brief affair with the young woman he met at the beginning of the film.\n\n There is no emotion in the film. Only the brief, anonymous sexual encounters provide any form of intensity. All of these scenes, however, are shot almost entirely in the dark with only little snippets of light showing parts of trembling bodies. This technique creates a sensual but rather unnerving and distancing experience. Water is a prevalent thread throughout the film -- in the polluted river, the leaking ceiling of the father's bedroom which ultimately floods the apartment; rain showers, bathing showers and baths at the sauna. It plays a central symbolic role, perhaps as a metaphor for the flow of life. As Jonathan Rosenbaum concludes: \"Sex and plumbing, seduction and infection, a river and a spray of steam and a torrent of rain are all part of the same inexorable flow.\" \n\nThe River says a great deal about people thrown together in big cities, living in close proximity, and yet emotionally and psychologically distant. They live an existence surrounded by silence, unwilling or unable to reach out to each other, handling problems with inaction and patchwork solutions. I found The River to be a very unsettling experience, unpleasant to watch but very powerful in its dark message. In a shocking scene towards the end of the film, father and son meet in a sauna at a gay bathhouse but fail to recognize each other. In this tender but disturbing depiction of emotional disconnect, the film is succinctly summarized."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1324941593",
        "name": "The River (1997)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODFmNTQ1YjgtMDA5MS00ZTRkLWE3ZDYtNDJjZDU3MDA1NGI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODFmNTQ1YjgtMDA5MS00ZTRkLWE3ZDYtNDJjZDU3MDA1NGI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:08:02Z",
        "url": "https://www.imdb.com/video/vi1324941593/"
    },
    "url": "/title/tt0119263/"
}