{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marilyn Burns",
            "url": "/name/nm0122782/"
        },
        {
            "@type": "Person",
            "name": "Edwin Neal",
            "url": "/name/nm0623605/"
        },
        {
            "@type": "Person",
            "name": "Allen Danziger",
            "url": "/name/nm0200758/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 168468,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0117561/"
        },
        {
            "@type": "Person",
            "name": "Kim Henkel",
            "url": "/name/nm0377066/"
        },
        {
            "@type": "Person",
            "name": "Tobe Hooper",
            "url": "/name/nm0001361/"
        }
    ],
    "datePublished": "1974-10-11",
    "description": "Five friends head out to rural Texas to visit the grave of a grandfather. On the way they stumble across what appears to be a deserted house, only to discover something sinister within. Something armed with a chainsaw.",
    "director": [
        {
            "@type": "Person",
            "name": "Tobe Hooper",
            "url": "/name/nm0001361/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDI3OWE0ZWMtNGJjOS00N2E4LWFiOTAtZjQ4OTNiNzIwN2NkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "leatherface,cannibal,chainsaw,rural setting,american horror",
    "name": "The Texas Chain Saw Massacre",
    "original_info": {
        "id": "The Texas Chainsaw Massacre_1974",
        "name": "The Texas Chainsaw Massacre",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Infofreak"
        },
        "dateCreated": "2003-04-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0072271/"
        },
        "name": "Pure, uncompromised horror! A modern classic which still confronts, disturbs and terrifies audiences worldwide.",
        "reviewBody": "Tobe Hopper's 'The Texas Chain Saw Massacre' is a landmark low budget horror movie which must be considered a modern classic. Hooper's subsequent career has ben extremely uneven, and frequently disappointing, but even if he never made another movie he would still be a legendary figure. As would Leatherface (Gunnar Hansen) and his twisted family played by Edwin Neal and Jim Siedow, and immortal scream queen Marilyn Burns. These actors never have to set in front of a camera again, they'll never be forgotten by horror buffs worldwide! In this day and age of cynically conceived and marketed MTV-friendly teen slashers it's a revelation to see old school horror classics like this, Romero's 'Night Of The Living Dead' and Craven's 'Last House On The Left'. Uncompromising movies, pure horror that makes no attempt to water themselves down and court a mainstream audience. This movie was one of the most controversial of the 1970s, censored or banned here in Australia, and in Britain, and despite the hundreds of horror movies released since, it is still powerful and fresh. There is an undercurrent of bizarre black humour underneath the film, a lot subtler than the sequel and other more obvious \"horror comedies\". The terror isn't compromised, the uneasy giggles make the extreme images even more difficult to dismiss. The cast, all unknowns at the time, and from what we know know paid diddley squat, are all pretty good, especially Marilyn Burns (who Hooper used in his underrated 'Eaten Alive' and who also appeared in the Charles Manson TV biopic 'Helter Skelter'), and whiny paraplegic Paul A. Partain (who went on to bit parts in 70s Drive-In faves 'Race With The Devil' and 'Rolling Thunder' and very little else). One would have thought both would have went on to bigger things watching their performances in this movie but sadly it wasn't meant to be. Gunnar Hansen is absolutely extraordinary as Leatherface. An amazing performance with his features obscured and no real dialogue to speak of. I don't think it's an exaggeration to compare it to Boris Karloff in the original 'Frankenstein'. Leatherface is a horror icon, and 'The Texas Chain Saw Massacre' is a landmark movie that remains essential viewing for every horror buff. It's a sensational movie that still has the power to confront, disturb and terrify audiences worldwide!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Texas Chainsaw Massacre: 40th Anniversary",
        "duration": "PT1M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1118680345",
        "name": "The Texas Chainsaw Massacre: 40th Anniversary",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTM1ODNhNTItMGRkZS00MWFiLTkzMDEtNzU1MjAyMmJmYmM4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTM1ODNhNTItMGRkZS00MWFiLTkzMDEtNzU1MjAyMmJmYmM4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-01-13T08:16:49Z",
        "url": "https://www.imdb.com/video/vi1118680345/"
    },
    "url": "/title/tt0072271/"
}