{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mel Gibson",
            "url": "/name/nm0000154/"
        },
        {
            "@type": "Person",
            "name": "Sigourney Weaver",
            "url": "/name/nm0000244/"
        },
        {
            "@type": "Person",
            "name": "Linda Hunt",
            "url": "/name/nm0001373/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21940,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0174838/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028012/"
        },
        {
            "@type": "Person",
            "name": "David Williamson",
            "url": "/name/nm0932011/"
        },
        {
            "@type": "Person",
            "name": "Peter Weir",
            "url": "/name/nm0001837/"
        },
        {
            "@type": "Person",
            "name": "C.J. Koch",
            "url": "/name/nm0462272/"
        }
    ],
    "datePublished": "1983-02-18",
    "description": "A young Australian reporter tries to navigate the political turmoil of Indonesia during the rule of President Sukarno with the help of a diminutive photographer.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Weir",
            "url": "/name/nm0001837/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmE3MjM4MGMtYmZiMi00MzU4LTk1YWMtMjI1YmRmNDc2MjdlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "foreign correspondent,journalist,embassy,diplomat,journalism",
    "name": "The Year of Living Dangerously",
    "original_info": {
        "id": "The Year of Living Dangerously_1983",
        "name": "The Year of Living Dangerously",
        "year": "1983"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chaos-rampant"
        },
        "dateCreated": "2011-04-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086617/"
        },
        "name": "Elemental cinema",
        "reviewBody": "I had forgotten what it is to inhabit the frame, that is to be immersed not only in the world these characters experience but in the sensations made available in it. To feel a draught of air or the scorching heat.\n\nPeter Weir here in his best period reminds me again. His fascination in this period with the otherworldly is firstly Australian, that of a man awed by the mysteries of an alien, ancient landscape that trumps comprehension, outlasts our follies and dreams, then foremostly mystical, implying a communion with worlds beyond. \n\nIn this world answers are denied us, and we can only hear vague echoes of the questions we have asked. This is Picnic at Hanging Rock as well as The Last Wave and The Year of Living Dangerously, the tingle of excitement and fear before this enormous complexity to which we are only small and transient. The Hanging Rock here becomes Jakarta.\n\nThese visions of Jakarta, a veritable jungle of humanity teeming with passions and cruelties, he presents from a point of view that communicates alienation and fear. When our white characters venture out into the crowded slums, human misery reaches out at them with filthy gaunt arms. All this he doesn't merely document for the sake of political discourse, he stylizes as an experience meant to stir things in the soul. This also outlines Weir's limitations; that these visions are perhaps too tawdry, the savages noble and the gnomes magical.\n\nAll this in mind, the film is best experienced for me as a spiritual journey. But towards what? \n\nA dwarf is our guide through this, an ominpresent being that seems to create the story we are watching, an avatar of the filmmaker's consciousness. He narrates our hero's arrival, then makes him see his limits by offering him his folly, the desire for an exclusive story. In a poignant scene early in the film, holding shadow puppets before a canvas screen, he reveals to him a fundamental tenet of Buddhist thought. How desire clouds the soul so that reality itself becomes concave.\n\nThis is not always perfect of course, Peter Weir is no Antonioni after all. Our hero eventually gives up the big scoop to pursue love, but this is accomplished through violence perpetrated to him rather than a personal realization that comes from having experienced the folly of the mind (which Antonioni brilliantly dismantles for us in Blowup). Lying halfdead on a filthy bed somewhere in Jakarta, he remembers the wise words of how desire blinds the soul, but is none the wiser.\n\nHe doesn't willingly give up anything, which is to say even if his precious tape recorder (the tool by which he records the world, seeking \"truth\") is snatched from him in the airport at the last moment, he has essentially lost nothing that he doesn't carry inside of him.\n\nPerhaps this is the film's apogee then, that faced with a chaos and violence which outlasts them and reveals them to be small and diminutive, mere specs of sand in the cosmic beach, the characters of the film stubbornly remain the same, having brushed off that encounter only as an exciting, dangerous escapade into the dark side. \n\nThe weather reflects that chaos in Weir's films, acting as an agent of transience whereby the world is shown to be in constant flux and motion. But the characters are phazed little by this, anxious to pursue their desires and enact their little charades of meaning. When a tropic downpour suddenly rains down on them, they laugh and play in it.\n\nBut if Weir's fascination with the mystical is entirely white Australian, his cinema is elemental, Aboriginal. Here is the communion made possible.\n\nThe fact that he unerringly insists to submerge his characters in these impenetrable worlds that defy understanding, where the sole reward is a moment's glimpse of the soul in spiritual hazard, means that the glimpse is reward enough because for that moment the apparent reality is peeled back to afford us a gaze into a yawning universe beyond. This yearning for the mechanisms of the universe to be made apparent is in itself the primal, ultimate urge of these films. The Last Wave takes us on the brink and gives us a vision of apocalypse (a revelation), this one stops just short of that."
    },
    "url": "/title/tt0086617/"
}