{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        },
        {
            "@type": "Person",
            "name": "Anthony Zerbe",
            "url": "/name/nm0001875/"
        },
        {
            "@type": "Person",
            "name": "Rosalind Cash",
            "url": "/name/nm0143614/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32557,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030268/"
        },
        {
            "@type": "Person",
            "name": "John William Corrington",
            "url": "/name/nm0181019/"
        },
        {
            "@type": "Person",
            "name": "Joyce Hooper Corrington",
            "url": "/name/nm0181020/"
        },
        {
            "@type": "Person",
            "name": "Richard Matheson",
            "url": "/name/nm0558577/"
        }
    ],
    "datePublished": "1971-08-01",
    "description": "Biological war has decimated life on Earth. Los Angeles is a windswept ghost town where Robert Neville tools his convertible through sunlit streets foraging for supplies.",
    "director": [
        {
            "@type": "Person",
            "name": "Boris Sagal",
            "url": "/name/nm0755963/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Action",
        "Drama",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjI0YzMxNTEtNTU0OS00NWVhLTlmMTQtZTMzYmNlNDMxMDdkXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "plague,post apocalypse,based on novel,global pandemic,antidote",
    "name": "The Omega Man",
    "original_info": {
        "id": "The Omega Man_1971",
        "name": "The Omega Man",
        "year": "1971"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "barnabyrudge"
        },
        "dateCreated": "2005-05-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067525/"
        },
        "name": "Thought-provoking, violent sci-fi story.",
        "reviewBody": "Omega is the last letter of the Greek alphabet, so the \"Omega\" Man is a round-a-bout way of saying The \"Last\" Man. Indeed, this violent science fiction actioner is a remake of a 1964 movie called The Last Man On Earth; in this version Charlton Heston assumes the role played by Vincent Price in the earlier film. It is a depressing - and in many ways thought-provoking - story set in a future where the human population has been wiped out.\n\nRobert Neville (Heston) is the only remaining survivor of a worldwide plague, other than a race of vampiric mutants who come out at night. When the plague was first reaching epidemic proportions, numerous scientists were given serums to try - Neville was the one who got the correct serum, but he never managed to get back to HQ in time to report the good news. Most of the world's people went on to be killed by the plague, but those who survived have evolved into light-sensitive mutants. Every day, Neville drives around the empty streets of LA scavenging for food, fuel and useful objects; every night he returns to his ultra high-security house from which he fends off the creepy minions who come out to taunt him and, perhaps, one day kill him. The mutants are led by Matthias (Anthony Zerbe), formerly a TV newsreader, now an anti-technology crusader who encourages his followers to destroy the scientific and technological items they find, as he blames meddling scientists for ultimately decimating the world's population.\n\nWhat's so chilling about The Omega Man is that Neville is gradually shown to be the real \"mutant\". He is the only man left from the world as it WAS; Zerbe and his mutant hordes are the evolutionary creatures of the world as it IS. Distressing as it is, The Omega Man is saying that in the event of a worldwide catastrophe human life would find a way to prevail, but the remnants of previous human life might need eradicating first. From the sensational opening - in which Heston screeches his car to a halt on an empty street and starts shooting at an unseen being in a skyscraper - to the climax (which is simultaneously happy AND sad), The Omega Man constantly raises questions and manipulates our fears. It has weaknesses - sometimes the metaphors and morals are too heavy-handed; parts of the film are slow-going, with an excess of talk which merely goes over plot details already mentioned; there are dated elements (music, decor, costumes, vehicles, slang speech) which deny the film its topicality over 30 years on. But, in spite of all that, The Omega Man remains a worthwhile sci-fi actioner and another cult flick in the Charlton Heston \"shock sci-fi\" canon (see also Planet of the Apes '68 and Soylent Green '73).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT3M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2627911193",
        "name": "The Ωmega Man",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTkyN2ZiMTctNzQxMy00NzViLWIxN2YtZDg5OTgxMWIzYTY5XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTkyN2ZiMTctNzQxMy00NzViLWIxN2YtZDg5OTgxMWIzYTY5XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-05T17:04:44.040Z",
        "url": "https://www.imdb.com/video/vi2627911193/"
    },
    "url": "/title/tt0067525/"
}