{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kenny Baker",
            "url": "/name/nm0048653/"
        },
        {
            "@type": "Person",
            "name": "John Barclay",
            "url": "/name/nm0054061/"
        },
        {
            "@type": "Person",
            "name": "Martyn Green",
            "url": "/name/nm0338139/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 777,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0489347/"
        },
        {
            "@type": "Person",
            "name": "W.S. Gilbert",
            "url": "/name/nm0318275/"
        },
        {
            "@type": "Person",
            "name": "Geoffrey Toye",
            "url": "/name/nm0870296/"
        }
    ],
    "datePublished": "1939-05-01",
    "description": "The son of the Mikado of Japan, a wandering minstrel, falls for a girl who is engaged to her guardian.",
    "director": [
        {
            "@type": "Person",
            "name": "Victor Schertzinger",
            "url": "/name/nm0006276/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGI1MWJiY2YtM2ZmZi00YjE1LWE1MzQtYmQ5MTQ4NTcwZTUxXkEyXkFqcGdeQXVyNzQ1NDIxMDQ@._V1_.jpg",
    "keywords": "operetta musical,minstrel,executioner,filmed opera,romantic rivalry",
    "name": "The Mikado",
    "original_info": {
        "id": "The Mikado_1939",
        "name": "The Mikado",
        "year": "1939"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "harleyquinn220"
        },
        "dateCreated": "2002-08-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0031650/"
        },
        "name": "Suffers from cuts, but makes up in the quality of the performers--Modified rapture!",
        "reviewBody": "In the 1930s the decision was made to do a movie of a Gilbert and Sullivan operetta as a star vehicle for Kenny Baker. They decided to do \"The Yeomen of the Guard\" with Baker as Fairfax and engage members of the D'Oyly Carte Opera Company for other roles in the film--including Martyn Green as Jack Point. However, they went back in this decision and decided to make a movie of \"The Mikado\" instead. In his autobiography, Green states that he feels \"Yeomen\" would have made a better movie.\n\nThis is an interesting Mikado, with both its upsides and its downsides. The biggest downside being the large amount of song cuts. The Mikado is one of Gilbert and Sullivan's best works, and it's a shame that so much of G&S's score is left out. Missing from the production are Pooh-Bah's \"Young Man Despair;\" Ko-Ko's excellent \"Little List\" song; \"So Please You Sir, We Much Regret\" (the quartet between Pooh-Bah and the girls); much of the Act I Finale; the quintet between Pooh-Bah, Pitti-Sing, Ko-Ko, the Mikado, and Katisha--\"See How the Fates Their Gifts Allot;\" Katisha's solo \"Alone and Yet Alive;\" and Katisha and Ko-Ko's duet \"There is Beauty in the Bellow of the Blast.\" I assume these were all cut due to time, but it is a shame to lose them. Much of the dialogue is cut as well, cutting out some of Gilbert's funniest lines.\n\nAll this is made up for, however, by the actors. Despite the fact that it's Kenny Baker and Jean Colin's faces you see on the front of the box, the star here is Martyn Green as Ko-Ko. Green was the principle comic baritone with the D'Oyly Carte Opera Company (a name which has always been synonymous with the best performances of Gilbert & Sullivan you can find) for many years and both this and the many recordings he made show that he was one of the best actors to ever play the Grossmith roles. He gives a stellar performance as Ko-Ko, the lord high executioner, and it really is a shame the list song was cut. Another D'Oyle Carte regular, Sydney Granville, plays Pooh-Bah and he is excellent as well. His Pooh-Bah is just as great as Green's Ko-Ko. There are quite a few other D'Oyly Carters here as well--Elizabeth Paynter and Kathleen Naylor (Pitti-Sing and Peep-Bo), the entire chorus, and Gregory Stroud (Pish-Tush) had done a bit of work with the D'Oyly Carte during the 1926 season. The rest of the cast does an excellent job as well. Victor Schertzinger manages to transfer the show to film quite well without it feeling too awkward on the screen (although I agree with Martyn Green in feeling that Yeomen would have made a better movie).\n\nAll in all, despite the song cuts, it is an excellent production of the Mikado, one that is well worth seeing. Of the Mikados I have seen on video and/or DVD (including this one, Stradford's production, Opera World's, and English National Opera's), I would say this is the best one out there. This is G&S performed the way it should be performed, the only disadvantage being that there's not enough of it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0031650/"
}