{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brad Pitt",
            "url": "/name/nm0000093/"
        },
        {
            "@type": "Person",
            "name": "Sean Penn",
            "url": "/name/nm0000576/"
        },
        {
            "@type": "Person",
            "name": "Jessica Chastain",
            "url": "/name/nm1567113/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 179658,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0308699/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0120121/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028932/"
        },
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "datePublished": "2011-05-17",
    "description": "The story of a family in Waco, Texas in 1956. The eldest son witnesses the loss of innocence and struggles with his parents' conflicting teachings.",
    "director": [
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMwNjQ0NjMzN15BMl5BanBnXkFtZTcwNjMxMTkyNA@@._V1_.jpg",
    "keywords": "childhood,strict father,waco texas,1950s,death",
    "name": "The Tree of Life",
    "original_info": {
        "id": "The Life of Jesus_1997",
        "name": "The Life of Jesus",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2011-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0478304/"
        },
        "name": "Great in specific moments but ultimately doesn't come together as a whole and is surprisingly pretentious at times",
        "reviewBody": "The occasional films of Terrance Malick are something that many look forward to because the man is an artist and his films are often touched with that aspect rather than being what they appear to be at first glance. I always remember how taken I was by The Thin Red Line – a film I did not know was his and one I watched expecting it to be a competing film with Saving Private Ryan; I loved it and it stayed with me for some time. So I came to Tree of Life knowing what to expect (or at least knowing not to expect a \"normal\" story) and I was quite looking forward to it.\n\nAlthough at times it far from it, most of the film follows a rough narrative that is a lot more sturdy than I expected. In 2011 a man is recalling his childhood as he reflects on the death of his brother many years ago when he was 19. These memories are of a harsh father and a loving mother and they are preceded by the birth of the universe, the evolution of life from single celled organisms, dinosaurs being kind to one another and the adult son stumbling around in what appears to be a desert. The official line is that Malick is a genius and that this film is a meditation over life and spirituality and I have read far too many reviews where those that love it gush generally about it while those that hate it are dismissed as being idiots and having an IQ of penguin weather levels. It doesn't help this massive split in opinion that Malick doesn't appear to give a tinker's cuss what you think – he is making the films he wants to make the way he wants to make them.\n\nThe first 40 minutes is the real tester and if you are loving the film after them, then you'll love the whole film. For the majority of the first hour we have lots of whispering voices saying profound things, lots of universe-creating explosions and shots of planets and life forming. We also have a terribly pointless moment walking with dinosaurs. All of this plays out under operatic music which practically screams \"look how epic and beautiful all this stuff is\". As it is at the start of the film, there is no real context for it and you really do have to trust Malick at this point – although that is not to say that he will reward your trust if you stick with it. For me this part of the film was overlong and really added very little once it had gone on for so long.\n\nAfter this we get to the heart of the film for me, which is the memories of the family. As individual moments, the majority of these memories are great and well delivered – telling us a lot about the adult son even though we've barely seen him. I enjoyed many of these moments because they were naturally written, consistent, had characters that rang true and engaged me and were really well acted by all involved (Pitt in particular seems to totally \"get\" his character). However, as a narrative linking back to the adult son, it doesn't work as a whole for me and at the end of the film we are spat back out into another beautifully shot but pretentiously delivered moment of spirituality and \"beauty\" where the adult son learns we are all connected, are all part of the universe, are all loved or, to be honest, whatever lesson the specific viewer wants to take – as with a lot of art, things are wide open to be interpreted however you like. For me personally I only found visual beauty in these parts of the film, while in the family parts I only specific moments that worked really well, but nothing that joins it all up.\n\nI wanted to be drawn in by it but at times it seems deliberately difficult and for many viewers (myself included) the film will come across as pretentious. The whispers and shots of nature that worked so well for me in Thin Red Line, mostly smacked of artsy navel gazing at best and out and out pretentious waffle at worst – and sadly, as a whole, this is how I took the film. I will stress though that the majority of the film is focused on the family in the 1950's and that these scenes all worked for me as individual scenes, which meant I enjoyed the film when there, but looking back on it I do have to say it never even slightly came together as a total package for me and I didn't really want to think about the wider spiritual parts because I felt so alienated from so many of them by the overdone music and the many shots of \"beauty\" and \"meaning\".\n\nThe Tree of Life, like many of Malick's films, is not for everyone, and in this case I unfortunately am one of those on the outside. It has a lot to like about it and I really liked the core of the film in the specific moment, but when I looked to the film to expand for me beyond any of the specific memories, it just didn't – instead I got dinosaurs petting one another, overly earnest opera, Sean Penn touching someone's feet on a beach and lots of shots of nature and beauty. Worth a look for the experience and the strengths in the core, but you may find yourself with me and be unable to see the awesome film that so many others are gushing over."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A preview of Terrence Malick's \"The Tree of Life\" starring Brad Pitt, Sean Penn and Jessica Chastain.",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi612735001",
        "name": "The Tree of Life Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTg0ODQ2MjI2NV5BMl5BanBnXkFtZTcwOTY1MTMyNA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTg0ODQ2MjI2NV5BMl5BanBnXkFtZTcwOTY1MTMyNA@@._V1_.jpg",
        "uploadDate": "2010-12-17T11:11:18Z",
        "url": "https://www.imdb.com/video/vi612735001/"
    },
    "url": "/title/tt0478304/"
}