{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Astin",
            "url": "/name/nm0000276/"
        },
        {
            "@type": "Person",
            "name": "David Atkinson",
            "url": "/name/nm0040695/"
        },
        {
            "@type": "Person",
            "name": "Leslie Bega",
            "url": "/name/nm0066664/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 346,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023712/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067897/"
        },
        {
            "@type": "Person",
            "name": "Clyde Hayes",
            "url": "/name/nm0370879/"
        }
    ],
    "datePublished": "2001-02-09",
    "description": "An old-time mogul struggles to reenter the club where power and money make the rules.",
    "director": [
        {
            "@type": "Person",
            "name": "Burt Reynolds",
            "url": "/name/nm0000608/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU3MjE4MzU0NF5BMl5BanBnXkFtZTcwNzU1NDkxMQ@@._V1_.jpg",
    "keywords": "hollywood,father in law son in law relationship,studio executive,movie studio,movie producer",
    "name": "The Last Producer",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dona000"
        },
        "dateCreated": "2002-11-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0201726/"
        },
        "name": "Not the best movie but not the worst either.",
        "reviewBody": "I saw this on video last night. It has the feel of a made for TV movie, maybe like an old Rockford show. Once you get over the obvious face lift on Burt Reynolds, you begin to like his character Sonny Wexler. Sonny was making movies back in the glory days of Hollywood. He is now a has been. But he has fallen on a great script. He has friends at the studio who want to help him make the movie but they aren't in charge, they are sort of has-beens too. Benjamin Bratt plays Mr. Black,a real S.O.B. who is now in charge. Sonny used to know the guy in charge but he has retired. We follow Sonny as he tries to come up with the money that is required to give to Mr. Black by the deadline of Friday at 5 p.m. I think Burt Reynolds plays Sonny Wexler really well. He is a loveable has been. Benjamin Bratt (the reason I was watching it. I am a Huge Bratt fan)is the jerky, mean, powerful, egotistical creep,\"Mr. Black\". Ben is handsome in this movie as always but he is so slick and slimy, just what the character should be. His is a supporting role. Most of the other characters are loveable but odd people. Ann Margaret is Sonny's wife. Rod Steiger is a tough guy. Sean Austin is the person who wrote the movie they are trying to get made. At first I thought \"Hey, he is a dork. How could he write a great script.\" But he is very believable as a writer as the movie progresses. Charles Durning is Sonny's old friend, who can't help him. Overall it moves slowly but I would watch it at least once.\n\nIf you do, pay attention to how well the acting is done. I think they make it look so easy that you could think that they aren't really acting but just having a good time. But good actors make it look easy, don't they?"
    },
    "url": "/title/tt0201726/"
}