{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chris O'Donnell",
            "url": "/name/nm0000563/"
        },
        {
            "@type": "Person",
            "name": "Renée Zellweger",
            "url": "/name/nm0000250/"
        },
        {
            "@type": "Person",
            "name": "Artie Lange",
            "url": "/name/nm0005119/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18630,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007933/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005167/"
        },
        {
            "@type": "Person",
            "name": "Roi Cooper Megrue",
            "url": "/name/nm0576362/"
        },
        {
            "@type": "Person",
            "name": "Jean C. Havez",
            "url": "/name/nm0369841/"
        },
        {
            "@type": "Person",
            "name": "Clyde Bruckman",
            "url": "/name/nm0115669/"
        }
    ],
    "datePublished": "1999-11-05",
    "description": "A commitment-phobic man goes in search of a bride, including his fed-up girlfriend, to inherit his grandfather's one hundred million dollar inheritance.",
    "director": [
        {
            "@type": "Person",
            "name": "Gary Sinyor",
            "url": "/name/nm0802551/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODgxMGM0N2ItOWFlNi00MGUzLTkzMDctNGE2NTlkMGI1YWU5XkEyXkFqcGdeQXVyNDAxNjkxNjQ@._V1_.jpg",
    "keywords": "inheritance challenge,race against time,death of grandfather,greed,bachelor",
    "name": "The Bachelor",
    "original_info": {
        "id": "The Bachelor_1999",
        "name": "The Bachelor",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "djexplorer"
        },
        "dateCreated": "2001-08-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120596/"
        },
        "name": "Calling this movie misogynist is a hoot!",
        "reviewBody": "\"The Bachelor\" is a pretty good light romantic comedy. Brook Shields does indeed have the best scene in the whole flick. It's well described below, and is wonderfully funny. Rene Zellweger is both very good and very charming, as is Chris O'Donnell. It's not the sort of movie that will stay with you for much, but its pretty good fun while it's going on.\n\nThere's one thing I have to say though, and the main reason I'm bothering with a comment to this flick. Those that claim this movie is unrealistic and misogynist because of it's depiction of O'Donnell's former girlfriends and the huge number of women desperate for 100 million dollars, are infected with a serious case of delusional feminist PC propaganda. I can guarantee you that if an ad (turned into a front page article) with a picture guaranteeing sharing in a $100 million fortune for marrying a guy who looks like Chris O'Donnell the next day in a big American city (and clarifying that he was deadline desperate due to the date of his grandfather's death and the will provisions, so that many would feel they had a chance and he wasn't necessarily an impossible loser), there would indeed be hordes of women lining up to do it. Many wouldn't of course. But there'd be legions willing to take their chances. One of the main things limiting the numbers in fact would be self selection. The cliché that women (especially after their early 20's) tend to be attracted to money (or its prospect), fame and or success, while men tend to be attracted to beauty, has more than a little truth to it. Of course there also has to be personal chemistry in the ordinary course, but with $100 million on the table, a great many women would take their chances. So the crowd scenes are indeed plausible (if so many managing the wedding dresses on a few hours notice isn't).\n\nWhat's most unrealistic is the PC \"balancing\" rejection this centi-millionaire gets from all but one of his former girl friends. That of course is what takes up the bulk of the movie. That is what is impossible to believe in the real world. In other words, \"The Bachelor\" actually leans over backwards to pretend that a far higher proportion of women wouldn't be swayed by the $100 million than is realistic. But just imagine how a more accurate balance would be criticized by the American media (not to mention academic) pundits of the moment. There are endless dismissive allusions to men being unduly or primarily interested in women's looks in today's American films -- and that that is terrible. (Why -- well, because women tend to have different priorities, and women must be right not only for themselves, but for men as well, of course.). That sort of commentary (with some basis in truth, if not in how it is characterized), often clearly intended as a put down of males, is perfectly fine under the reigning Hollywood ideology. Whereas highlighting women's special attraction (often enough) to men with power of various sorts -- money, fame, politics or sometimes physical power -- is dangerous ground indeed. Gee, I wonder why that is."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Home Entertainment",
        "duration": "PT2M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4254400793",
        "name": "The Bachelor",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmZjMzJmMDAtMmMyOC00MjhlLWJmZTgtMThmNzAwOTVkMzI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmZjMzJmMDAtMmMyOC00MjhlLWJmZTgtMThmNzAwOTVkMzI4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:59:19Z",
        "url": "https://www.imdb.com/video/vi4254400793/"
    },
    "url": "/title/tt0120596/"
}