{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ken Berry",
            "url": "/name/nm0077607/"
        },
        {
            "@type": "Person",
            "name": "Sandy Duncan",
            "url": "/name/nm0242098/"
        },
        {
            "@type": "Person",
            "name": "Harry Morgan",
            "url": "/name/nm0604702/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5527,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024579/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010588/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0884374/"
        },
        {
            "@type": "Person",
            "name": "Ted Key",
            "url": "/name/nm0450774/"
        }
    ],
    "datePublished": "1978-06-09",
    "description": "Three scientists help an Alien feline, stranded on Earth, to repair its damaged spacecraft in order to return home but their efforts are hampered by inept army officials and foreign spies.",
    "director": [
        {
            "@type": "Person",
            "name": "Norman Tokar",
            "url": "/name/nm0865709/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Comedy",
        "Family",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjk1Njk3ZjYtMmE4Yi00NzMwLTllNWEtN2ZjNTJjN2NhNjRhXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "cat,human alien relationship,talking cat,alien,cat movie",
    "name": "The Cat from Outer Space",
    "original_info": {
        "id": "The Cat from Outer Space_1978",
        "name": "The Cat from Outer Space",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "soymilk"
        },
        "dateCreated": "2004-09-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0077305/"
        },
        "name": "Close Encounters of the Purred Kind",
        "reviewBody": "Wow, now this is certainly a rarity  a talking animal flick that doesn't rely on that moving-mouth-n-lip-synch gimmick which has really been dogging the genre of late (bad pun on my part, I know). Sure, the only thing we can attribute this merit to is its age  as others round here have already pointed out, were this movie shot in this day and age the overused and overplayed technique would have undoubtedly been employed. I also imagine that, at some point during the running time, they'd have Jake spit up a big slimy hairball, mark his territory over some sucker's flowerbed, and stick a leg in the air so he can lick at his crotch  along with any other animal bodily function they could swipe a gag out of. It's one of those reasons why, for all its skimpy production values, 'the Cat from Outer Space' is now such a refreshing blast from the past  in an era swamped by crude, flashy animal movies made exclusively for the under-12 market, this is comes across as quite a pleasant piece of nostalgia, harking back to the good old days when the humour was always clean, and any critter who wanted to wrap their tongue around the English language did so the conveniently telepathic way. (Yikes, I'm starting to sound like a right old whinger here, which really I'm not, but that's just how jaded I am).\n\nAs a stand-alone film, TCFOS is very much a cheesy but warm-hearted affair and, for fans of all things sublime n' feline like myself, this was a childhood classic growing up in the 1980s. Back then, it always qualified as my runner-up pick for Disney's coolest live action feature, second only to the original 'Incredible Journey' (yeah, I *did* watch Mary Poppins', but never really got much further than the animated sequences  it just got boring after that). I happened to come across it on my shelves recently, having left it undisturbed for several years, and decided it was time for a revisit.\n\nThe worst thing about it is inevitably the title (which just screams 'B Movie!', don't it?), only just managing to pip some of the flat and, quite frankly, irritating human characters on display to the post, who've more-or-less accepted that churning out even Oscar-worthy performances ain't gonna spare them from being upstaged by the four-legged favourite. Sandy Duncan in particular portrays a bimbo so staggering it'll make your jaw drop that she even made it into the paranormal research department (plus, she believes all of Frank's lame excuses  yikes, how dumb is she?). Then there's that spy character who insists on speaking with such loathsome smarminess not seen since 'the Shop Around the Corner', you could break your TV screen trying to sock him one in the mouth.\n\nThe best things about TCFOS, oddly enough, owe a lot to the retrospectives we have after 26 years. Jake is definitely entitled to feel smug that he was getting himself stranded on planet Earth, amongst all the typically hostile folks, and making his human ally's bicycle fly *four freakin' years* before ET showed up on the scene (is that uncanny or what?). Not to mention the casually conniving fashion in which Jake goes about trying to secure his way back home, somehow managing to involve rigged sports games along the way; ethics so dodgy by today's standards that really you gotta love it. And the special effects are now so crude and outdated that, well, they're cute! Jake is undeniably the star of this vehicle, churning out all the better lines of dialogue, and this is such an endearing story deep down that it's all too bad that the script never delves particularly deeply into his friendship with Frank (after all, ET's major trump card was always his lump-in-the-throat relationship with Elliot), choosing instead to skim through the character interactions at such a pace that the film never really has the chance to deliver any true emotional wallop.\n\nI did also get a kick out of reading the previous comment concerning the body language of the feline double act playing Jake, and will verify it all the way  pay close attention to the climax in particular, and note that the poor kitty currently on the scene looks positively bewildered!\n\nSure, it's imperfect and now that I'm older I can see where the faults lie a lot more than I used to  but still, it's a likable and evocative romp, and personally I'd much rather be subject to this than to recent animal conspiracy theory trash like 'Cats and Dogs' or 'Good Boy!', any day. A real treat for cat lovers everywhere.\n\nGrade: B-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4267426073",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjJhMjUwNTQtOGFkMy00N2VhLTg5MjQtMzAwYzQwZjEzZmQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjJhMjUwNTQtOGFkMy00N2VhLTg5MjQtMzAwYzQwZjEzZmQ1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-09T23:21:52.683Z",
        "url": "https://www.imdb.com/video/vi4267426073/"
    },
    "url": "/title/tt0077305/"
}