{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jennifer Lopez",
            "url": "/name/nm0000182/"
        },
        {
            "@type": "Person",
            "name": "Vince Vaughn",
            "url": "/name/nm0000681/"
        },
        {
            "@type": "Person",
            "name": "Vincent D'Onofrio",
            "url": "/name/nm0000352/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 104934,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067485/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029540/"
        },
        {
            "@type": "Person",
            "name": "Mark Protosevich",
            "url": "/name/nm0698873/"
        }
    ],
    "datePublished": "2000-08-18",
    "description": "An F.B.I. Agent persuades a social worker, who is adept with a new experimental technology, to enter the mind of a comatose serial killer in order to learn where he has hidden his latest kidnap victim.",
    "director": [
        {
            "@type": "Person",
            "name": "Tarsem Singh",
            "url": "/name/nm0802248/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Crime",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDY1NmVmOTItYWU0NC00OGU2LWIyNTctYTU3NTY3ZjJkOWJjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "serial killer,race against time,coma,intestines,sadomasochism",
    "name": "The Cell",
    "original_info": {
        "id": "The Cell_2000",
        "name": "The Cell",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Anonymous_Maxine"
        },
        "dateCreated": "2000-09-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0209958/"
        },
        "name": "Every once in a while a film comes along that stands apart from all others made in years. The Matrix did it last year, and The Cell has done it in 2000.",
        "reviewBody": "The last film that provided a vivid and disturbing look at what insanity is probably like was In Dreams. In that movie, you didn't see insanity, you were THERE. Now The Cell comes along with an updated and much more disturbing portrayal of the inside of the mind of a psychotic killer. The opening scene takes you into the seemingly innocent mind of a comatose little boy, and the things that Catherine Deane (Jennifer Lopez) sees are first fascinating and then terrifying. The things that she later sees in the mind of Vincent Stargher (Vincent D'Onofrio) are amazingly imaginative and fascinating, most of this stuff has never been seen in film before.\n\nThe story of The Cell is not exactly something that is really groundbreaking. In fact, it is basically the same as the story in The Silence of the Lambs. You have a killer in custody and these people have to enter his mind to find a female victim who is currently in danger of losing her life. The only real difference between the foundation of the plots is that in The Silence of the Lambs, you have to enter the mind of a killer to find a different killer as well as his current victim, while in The Cell, you have to enter the mind of a killer to find his own victim. However, despite the unfortunately weak story, The Cell completely revolutionizes the genre of the psychological thriller. None that have ever been made even come close to it. \n\nAlso, the film had good direction and was extremely well acted. Vince Vaughn delivers another of his characteristically excellent performances (he was even good as Norman Bates in the pathetic 1998 re-make of Psycho), and even Jennifer Lopez puts forth the second good effort of her career (the other being the great Out of Sight). Nothing can be said of the cinematography in The Cell to give it sufficient credit, it was imaginative and fascinatingly done and is unparalleled by anything ever seen in cinematic history. The Cell is an incredibly well-made film, and it deserves to be recognized.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Cell",
        "duration": "PT2M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4235764761",
        "name": "The Cell",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmU3MWZmZTAtZWYwOC00ODAzLTk0YzktNmM2ODAxODU3Y2FjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmU3MWZmZTAtZWYwOC00ODAzLTk0YzktNmM2ODAxODU3Y2FjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-10-27T03:34:48Z",
        "url": "https://www.imdb.com/video/vi4235764761/"
    },
    "url": "/title/tt0209958/"
}