{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nigel Hawthorne",
            "url": "/name/nm0001329/"
        },
        {
            "@type": "Person",
            "name": "Helen Mirren",
            "url": "/name/nm0000545/"
        },
        {
            "@type": "Person",
            "name": "Rupert Graves",
            "url": "/name/nm0001291/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17317,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016710/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052720/"
        },
        {
            "@type": "Person",
            "name": "Alan Bennett",
            "url": "/name/nm0003141/"
        }
    ],
    "datePublished": "1994-12-28",
    "description": "When King George III goes mad, his Lieutenants try to adjust the rules to run the country without his participation.",
    "director": [
        {
            "@type": "Person",
            "name": "Nicholas Hytner",
            "url": "/name/nm0405336/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTNiNzk1YjMtODViOC00MjUyLWI3MmMtZjhkMjlkYTM0NjU2XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "porphyria,king of england,restraint,self destructiveness,politics",
    "name": "The Madness of King George",
    "original_info": {
        "id": "The Madness of King George_1994",
        "name": "The Madness of King George",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Sophie-3"
        },
        "dateCreated": "2000-07-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110428/"
        },
        "name": "Satisfyingly sharp and funny",
        "reviewBody": "THE MADNESS OF GEORGE III (called MADNESS OF KING GEORGE in the States because of reported studio concern, probably not apocryphal, that most Americans would wonder why they missed MADNESS I and II) begins with an act of lese majesty, a look behind the scenes as the family and ministers of George III prepare for the ceremony to open Parliament in 1788. We see the confusion of an equerry who has no idea of what his duties are, a royal attendant hurriedly spit on and cuff-polish a jewel on the kingly crown, the boredom of the king's eldest sons who would rather be just about anywhere else than waiting for their father in the chilly anteroom. (\"Colder in here than a greyhound's nostril,\" mutters the Lord Chancellor.) It's a theme that will carry through the entire film. Kingship and royalty are shams, it seems - magic acts that require faith on the part of the audience. A peek behind the curtain of noblesse oblige and it's all likely to fall to pieces.\n\nThe story remains fairly true to the facts. Late in 1788, George III is taken by a mysterious illness (lately surmised to be porphyria) that strongly resembles the then-popular conception of madness. Chaos ensues, mainly in the desperate efforts of the Government (headed by William Pitt - Julian Wadham) to hush the whole matter up lest the forces of the Whig Opposition (led by Charles James Fox - Jim Carter) use the power vacuum to place the king's eldest son, the Prince of Wales, at the head of a regency sympathetic to their political cause. But Alan Bennett, who originally wrote the script for the theatre, is wise enough to treat the potentially tragic story as essentially comic even while raising the question of the basic insanity behind all pretensions to royalty. (\"Some of my lunatics fancy themselves kings,\" notes the \"mad doctor\" who undertakes the case. \"But he IS the king. Where shall his fancy take refuge?\")\n\nThe power of the film radiates from neither history nor comedy but from performances, and Nigel Hawthorne, who sharpened his characterization of George III over months of playing it on stage, dominates a roster of top-notch actors. Whether brow-beating his older children with admonitions of \"Do not be fat, Sir! Fight it! Fight it!\" or, freed from his self-imposed strictures of kingship by illness, slipping the reins and pawing under the stays of Lady Pembroke (Amanda Donahoe), Hawthorne is both maddeningly and appealingly autocratic. Perhaps his Farmer George, England's prime example of husbandry both in his knowledge of horticulture and in his brood of 15 children, is more sympathetic than the historical personage, but in the end that matters little. It's a superbly nuanced performance.\n\nAnd he's given able support by Helen Mirren as his faithful Queen Charlotte, who's devoted her life to supporting the man who rescued her from the obscurity of a small Germanic kingdom and married her despite her rather spectacular lack of good looks. Mirren's accent is variable; her etching of Charlotte's desperate groping at every straw in order to see her husband cured is not.\n\nThe rest of the cast is impeccable as well. Ian Holm is all steely religious conviction turned to medical practice as Dr. Willis, who undertakes to treat the king. Rupert Everett, despite the double handicap of an obviously false stomach and the silliest wig in the film, does a creditable turn as the Prince of Wales, though the script treats Prinny unfairly, mainly for the comic potential of doing so. Ministers of state and Parliamentarians Wadham, Carter and John Wood handle their lines with a panache and wit that would do credit to any authentic 18th-century gentleman. Some of the best lines go to Wood, who as usual gives his unsurpassable style and timing, as when he growls out in church, \"I'm praying, goddammit!\"\n\nThe costumes are both faithful and sumptuous, the cinematography is luminous and the sets, borrowed at low cost from various castles and colleges, are lovingly handled. Of special note is the music of Handel, adapted so cleverly by George Fenton that one would swear the old boy in the knee breeches wrote the score himself for every scene."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When King George III goes mad, his Lieutenants try to adjust the rules to run the country without his participation.",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2755510553",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDRiYmZmNmYtYWI4Ny00YTNiLTg0NDQtYjZiZjZlZjhlNGRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDRiYmZmNmYtYWI4Ny00YTNiLTg0NDQtYjZiZjZlZjhlNGRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-12-03T11:56:29.568Z",
        "url": "https://www.imdb.com/video/vi2755510553/"
    },
    "url": "/title/tt0110428/"
}