{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Gambon",
            "url": "/name/nm0002091/"
        },
        {
            "@type": "Person",
            "name": "Jodhi May",
            "url": "/name/nm0562003/"
        },
        {
            "@type": "Person",
            "name": "Polly Walker",
            "url": "/name/nm0908116/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 426,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053289/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079239/"
        },
        {
            "@type": "Person",
            "name": "Fyodor Dostoevsky",
            "url": "/name/nm0234502/"
        },
        {
            "@type": "Person",
            "name": "Katharine Ogden",
            "url": "/name/nm0644628/"
        },
        {
            "@type": "Person",
            "name": "Charles Cohen",
            "url": "/name/nm0169271/"
        }
    ],
    "datePublished": "1997-11-07",
    "description": "Russian author Fyodor Dostoyevsky (Sir Michael Gambon) must write a novel in twenty-seven days in a deal to pay off his gambling debts, and feverishly dictates the novel \"The Gambler\".",
    "director": [
        {
            "@type": "Person",
            "name": "Károly Makk",
            "url": "/name/nm0538652/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4MjEzMzgwOV5BMl5BanBnXkFtZTcwMDQwODAyMQ@@._V1_.jpg",
    "keywords": "writer,stenographer,roulette,older man younger woman relationship,novelist",
    "name": "The Gambler",
    "original_info": {
        "id": "The Gambler_1997",
        "name": "The Gambler",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2010-01-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0129111/"
        },
        "name": "Luck Be A Lady To Fyodor",
        "reviewBody": "Someone decided that the story of Fyodor Dostoyevsky writing The Gambler might be a better story than the novella itself. Thus this film The Gambler came into being. \n\nMichael Gambon plays Dostoyevsky who is really under the gun. He should have had a lawyer looking over the contract he signed with a publisher. He had a year to deliver a novel to them and if he didn't everything word he ever would write would belong to that selfsame publisher. Of course our friend Fyodor spent the advance quite liberally on his pleasures and now he's got only a month to deliver a book. \n\nSo Gambon takes the unusual step of hiring a live-in stenographer to take down his words played by Jodhi May. She gets to live and observe the Dostoyevsky family their talents and their excesses. From which came the novella The Gambler.\n\nGambon plays Dostoyevsky as a man like a lot of gifted people, someone whose talents seem to entitle them to excessive behavior. To be sure this also was a man survived Siberian exile and is probably enjoying the fleshpots of Moscow as much as he can.\n\nThe Gambler is also the final appearance of recent centenarian Luise Rainer. She plays the live person who became the grandmother in the novella who threw her fortune away at roulette. Unless someone gets the idea to team Luise with upcoming centenarian Gloria Stuart and wouldn't that be an interesting film, I doubt she's doing another. It's worth it to see her give one bravura performance.\n\nGreat literature gets born under unusual circumstances. Talk about publish or perish. The Gambler is an interesting piece on the life of its creator Fyodor Doestoyevsky.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0129111/"
}