{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tony Curtis",
            "url": "/name/nm0000348/"
        },
        {
            "@type": "Person",
            "name": "Natalie Wood",
            "url": "/name/nm0000081/"
        },
        {
            "@type": "Person",
            "name": "Jack Lemmon",
            "url": "/name/nm0000493/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18556,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0867819/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066779/"
        },
        {
            "@type": "Person",
            "name": "Arthur A. Ross",
            "url": "/name/nm0743232/"
        },
        {
            "@type": "Person",
            "name": "Blake Edwards",
            "url": "/name/nm0001175/"
        }
    ],
    "datePublished": "1965-12-17",
    "description": "In the early 20th century, two rivals, the heroic Leslie and the despicable Professor Fate, engage in an epic automobile race from New York to Paris.",
    "director": [
        {
            "@type": "Person",
            "name": "Blake Edwards",
            "url": "/name/nm0001175/"
        }
    ],
    "duration": "PT2H40M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjg5MDU1ZjUtZjQ2ZS00MTg2LTljMzEtMjVjNDgzNjI5MmQ5XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "car racing,alaska,car,hero,pie fight",
    "name": "The Great Race",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "markcarlson2222"
        },
        "dateCreated": "2003-03-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059243/"
        },
        "name": "Lemmon's most underrated role",
        "reviewBody": "Now I've read most of the comments on this film and while I might agree with some of the more specific comments regarding the looser and less plausible plot in the last third of the film and that Natalie Wood might have been more of a contribution and less of a distraction, these are moot points. The film is funny, enjoyable and a great tribute to the heyday of silent villains and heroes in a way that doesn't overdo it. Curtis' flashing smile, Wynn's turn-of-the-century mechanic character, the harried and frazzled O'Connell as Goodbody, and especially Falk's on-again, off-again sycophant/lackey/nobody's fool Max are memorable and fun. But as much as I like the main movie, my fave bits are the early scenes in which Professor Fate, always in black and macabre emblems, tries to outdo the stunts of the gleaming white, perfect and popular Great Lesile Gallant III. The stunts are fun, witty and totally unbelieveable. The plane pickup, the rocket train, the garishly painted torpedo with a mawkishly wonderful gramaphone speaker on top are priceless Victorian images of a time that we all imagine existed but never really did. Lemmon is a gem as Fate, right from the great use of his eyes under thick brows and black hat, to the spooky house in his own Munster's décor to the crème de la crème, the Hannibal Twin 8 race car. That car is a masterpiece of mechanical and artistic design. I wonder where it is now. Even the sound it generates in the film, that sinister and harmonious hum are perfect for Fate's élan.\n\nWhat I've never understood is why I never heard more of Lemmon's comments on this film. It had to be fun to make and work with Curtis, but the role of Fate is so underrated. You never see it mentioned in Biography or any anthologies of Lemmon's work. I still roll in peals of laughter at his dizzy 'Let's see the Great Leslie try THAT one on for size...' as he passes out in the mud. Or when Max breaks off the moustache in the freezing storm, and all you see is Fate's astonished look of shock followed by a sideways glare that could cut glass. The last part of the film, the entire Prince Hapnik and Potsdorf sequences are less than helpful, and they really aren't needed, despite a record pie fight, but it does serve to give Lemmon another role, diametrically different from Fate. Again he uses his eyes and his voice to great effect. `Baron Rolf von SHTUPP!!'(Any relation to Lilly von Shtupp in Blazing Saddles?) With perfect timing. I mean it. Try it some time and you'll never match that unique panache which Lemmon displayed. All in all, a wonderful and fun film. No deep message, just good turn-of-the-century atmosphere, great gags and lively dialogue. Enjoy, and don't take it too seriously. After all, it's not PEARL HARBOR, is it? **** our of **** for me."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this comedy starring Jack Lemon",
        "duration": "PT2M51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4038460697",
        "name": "The Great Race",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDA4YTRiMjMtN2E1Ni00MjgzLTk1N2YtNjVkYjY3Yzc0ZjY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDA4YTRiMjMtN2E1Ni00MjgzLTk1N2YtNjVkYjY3Yzc0ZjY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-22T05:54:26Z",
        "url": "https://www.imdb.com/video/vi4038460697/"
    },
    "url": "/title/tt0059243/"
}