{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Conrado San Martín",
            "url": "/name/nm0760701/"
        },
        {
            "@type": "Person",
            "name": "Diana Lorys",
            "url": "/name/nm0521224/"
        },
        {
            "@type": "Person",
            "name": "Howard Vernon",
            "url": "/name/nm0894677/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1690,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "alternateName": "The Awful Dr. Orlof",
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070629/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010444/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009671/"
        },
        {
            "@type": "Person",
            "name": "Jesús Franco",
            "url": "/name/nm0001238/"
        }
    ],
    "datePublished": "1964-12-02",
    "description": "Dr. Orlof, a former prison doctor, abducts beautiful women from nightclubs and tries to use their skin to repair his daughter's fire-scarred face.",
    "director": [
        {
            "@type": "Person",
            "name": "Jesús Franco",
            "url": "/name/nm0001238/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTczODBhNTgtZGNjZi00YTVlLWFjOTMtMjAyYTA4ZWEzZmQzXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "psychotronic film,proto giallo,male police officer,police officer,timeframe 1910s",
    "name": "Gritos en la noche",
    "original_info": {
        "id": "The Euroshock Collection: The Awful Dr. Orlof_1962",
        "name": "The Euroshock Collection: The Awful Dr. Orlof",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bogey Man"
        },
        "dateCreated": "2002-07-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056040/"
        },
        "name": "Franco's masterpiece",
        "reviewBody": "Jess Franco's Awful dr. Orlof aka Gritos en la noche (1962) stars Howard Vernon as dr. Orlof, who makes experiments and skin transplants on girls he kidnaps in order to return her savagely injured daughter back to her physical beauty. He has Morpho, a horribly disfigured human monster, with him helping him and kidnapping the girls. A police detective starts to investigate the strange disappearances and soon he gets some clues where the missing girls might be..\n\nThe story is pretty close to many classic monster horrors like King Kong (1933) and other stories in which a desperate character tries to fight against wrongs and obstacles he has encountered, only to find himself even deeper in the misery. Orlof wants to safe his daughter's face and beauty, but by doing bad things (murder, torture) he cannot reach his goal, and this is the moral and message of this film. The ending in Orlof is very sad and tragic, and also close to King Kong's ending. It is all as tragic as the life itself, and by watching these immortal classics among cinema we have an opportunity to understand little better how things in our lives should be solved and by which means, no matter what. Also this film teaches us to value all the positive things in our life, not just to think about what there ISN'T in our lives. There are always somebody whose life is very sad and miserable compared to yours and mine.\n\nOrlof is also very atmospheric horror film and shows the talent of director Franco, who has also specialized in trash and exploitation in many of his films. His other achievements among many are Bloody Moon (sex/slasher), Love Letters of a Portuguese Nun (nunsploitation), Sadomania (WIP), Faceless (ultra gore), Virgin Among the Living Dead (sexploitation, vampires) etc etc. Awful dr. Orlof is definitely among his greatest cinematic achievements, and is as effective and valuable as other black and white Euro classics like Mario Bava's La Maschera Del Demonio (1960) starring Barbara Steele.\n\nThere are many great scares in Orlof and atmospheric segments in the castle of Orlof and in his chamber. Franco uses weird camera angles effectively here and they work fine and create the ominous feel to the film. This is the kind of film which should be seen in movie theatre on big screen. I give Awful dr. Orlof definitely 9/10 rating and recommend it highly to every one interested in classic black and white European horror cinema, which has all the unique elements usually lacking in nowadays' commercial efforts. Awful dr. Orlof is also a must see for those who think Franco is bad film maker.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0056040/"
}