{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joe DeRita",
            "url": "/name/nm0220388/"
        },
        {
            "@type": "Person",
            "name": "Larry Fine",
            "url": "/name/nm0004310/"
        },
        {
            "@type": "Person",
            "name": "Moe Howard",
            "url": "/name/nm0002935/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 766,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0695279/"
        },
        {
            "@type": "Person",
            "name": "Norman Maurer",
            "url": "/name/nm0560816/"
        },
        {
            "@type": "Person",
            "name": "Elwood Ullman",
            "url": "/name/nm0880493/"
        },
        {
            "@type": "Person",
            "name": "Jules Verne",
            "url": "/name/nm0894523/"
        }
    ],
    "datePublished": "1963-08-21",
    "description": "The Three Stooges play servants to an ancestor of Phileas Fogg and embark on a trip around the world.",
    "director": [
        {
            "@type": "Person",
            "name": "Norman Maurer",
            "url": "/name/nm0560816/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDc4NzFiNWItNjc5Ny00NmIxLWI5MzEtN2E5MmEzY2VlNTBhXkEyXkFqcGdeQXVyMzU4Nzk4MDI@._V1_.jpg",
    "keywords": "the three stooges,psychotronic film,sleeping in a car,punched in the face,con man",
    "name": "The Three Stooges Go Around the World in a Daze",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "simeon_flake"
        },
        "dateCreated": "2015-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057580/"
        },
        "name": "The best of the Joe Derita features...",
        "reviewBody": "While I'm not wildly enthusiastic about the Moe, Larry and Curly-Joe trio of the late 50s and 1960s--not to mention the softer approach the boys were taking during this time period--every now and then I find myself in the mood to watch a full-length Three Stooges feature, and this is the one I generally view the most.\n\nThis film spends a lot of time at the beginning setting up the plot and introducing us to all the main players of this story--in what I can assume is an effort on Norman Maurer's part to get us to care about these characters.\n\nOf course--with seemingly any stooge feature of this period--a love story seemed to be requisite to help pad out the running time. As far as love interests go, Jay Sheffield is competent I would say. Not quite as cardboard or unlikable as some romantic leads I've seen in other movies and Joan Freeman is quite the looker.\n\nBut, the reason I think any of us are paying attention to this particular film is the stooges themselves and I would say they bring considerable \"funny\" to this feature. Most of it seems to occur during the second half of the film--although there is the good scene in the opening minutes where the \"boys\" are introduced and they have quite a time preparing Mr. Fogg's breakfast.\n\nStooge fans all over the world have no doubt been debating for years Joe Derita's \"skills\" in handling old Curly Howard material--most notably in this film, \"Pop Goes the Weasel\" and the \"Maharajah\" routine. I would say I think Derita did well in his handling of said material. While I'm not exactly crazy about \"Curly-Joe\", he could on occasion deliver a good one-liner or display some skill at slapstick--and let's be honest, anyone would have been a step up from Joe Besser.\n\nFunniest moment in the movie has to be Curly-Joe's sumo wrestling rematch with Itchy-Kitchy.\n\n7 stars",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0057580/"
}