{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Oliver Reed",
            "url": "/name/nm0001657/"
        },
        {
            "@type": "Person",
            "name": "Diana Rigg",
            "url": "/name/nm0001671/"
        },
        {
            "@type": "Person",
            "name": "Telly Savalas",
            "url": "/name/nm0001699/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3070,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "M",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0025510/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Michael Relph",
            "url": "/name/nm0718838/"
        },
        {
            "@type": "Person",
            "name": "Jack London",
            "url": "/name/nm0518711/"
        },
        {
            "@type": "Person",
            "name": "Robert L. Fish",
            "url": "/name/nm0279302/"
        }
    ],
    "datePublished": "1969-03-21",
    "description": "A woman causes a group of assassins to face their greatest challenge.",
    "director": [
        {
            "@type": "Person",
            "name": "Basil Dearden",
            "url": "/name/nm0213136/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWY2NjU5MWItZWMxOS00OGY4LTllMDMtM2Y0MzU0YzI0OGMyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "period drama,assassin,assassination,hitman,double cross",
    "name": "The Assassination Bureau",
    "original_info": {
        "id": "The Assassination Bureau_1969",
        "name": "The Assassination Bureau",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bogmeister"
        },
        "dateCreated": "2005-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064045/"
        },
        "name": "When Assassination was mere Amusement",
        "reviewBody": "To enjoy and even admire this period piece, set just before the industrial revolution of the 20th century, one has to understand what it is. It's certainly not a parody of James Bond or some off cue thriller; it's high comedy, a farce of magnificent proportions, aided & abetted by fine action. You have to get in on the joke with Oliver Reed, Diana Rigg, Telly Savalas and the rest, all obviously enjoying themselves, but not at our expense. Let them amuse you and bemuse you, and you'll have a grand time. By this point, over 35 years after this was filmed, it may be difficult for younger viewers to follow along with Reed and realize when he is winking at them during one of his outrageous pronouncements. He's the head of the organization of the title - it is what you think it is, no pretensions there - its business is killing people, for money. But that is about the only thing which is up front in this picture. Everyone is not who they seem to be, usually having a decent public face and the secret hidden one - the one catering to the less moral side of all of us.\n\nThis is probably my favorite Oliver Reed performance. He grabs the role of the debonair gentleman assassin and turns it into uniquely his own. Some of his dry line delivery, particularly when sparring with Rigg, is priceless; my favorite is when they meet and she informs him who she wants killed; he soon demands her reasons, yelling \"Is That it? Is That It!?!\" Later in the film, she calls him annoying. \"I have been told that,\" he replies, but never have we heard the line spoken that way. He needs to carry the picture, outsmarting and fooling all the other sneaky assassins out for his blood with disguises, role-playing and careless bravado. This is where the picture really shifts into high gear, turning into a duel among a group of master killers who, luckily, do not yet have the advantages of 20th century weaponry. The supporting cast are all terrific, including Savalas as Reed's main nemesis, Jurgens as a German general and Noiret who, besides being an assassin, also runs a brothel (no limits to the French).\n\nThe script and dialog are continually witty throughout, many of the lines classic and too numerous to mention here. Again, some of this may be lost on anyone under 30 years old; in a way, this brand of humor can now be termed sophisticated - no gross bodily function joking. It does revolve around death, so a kind of dark farce results, of course - yet it's not morbid. That's probably because most of the victims deserve their ends as presented here; they made their beds, as it were. The dialog is complemented by inventive turns in the plot; there's actually quite a bit of suspense as the story turns & twists here and there, especially during the sequence in Venice, where the order of characters being killed is not as expected. The finale is also suspenseful - you may wonder how Reed will pull it off, stopping an entire zeppelin and its crew. And please keep in mind the special FX are over 35 years old, as well. Just glorious stuff.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0064045/"
}