{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bing Crosby",
            "url": "/name/nm0001078/"
        },
        {
            "@type": "Person",
            "name": "Grace Kelly",
            "url": "/name/nm0000038/"
        },
        {
            "@type": "Person",
            "name": "William Holden",
            "url": "/name/nm0000034/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6267,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0513195/"
        },
        {
            "@type": "Person",
            "name": "Clifford Odets",
            "url": "/name/nm0644048/"
        },
        {
            "@type": "Person",
            "name": "George Seaton",
            "url": "/name/nm0780833/"
        }
    ],
    "datePublished": "1955-05-17",
    "description": "A director hires an alcoholic has-been and strikes up a stormy relationship with the actor's wife, who he believes is the cause of all the man's problems.",
    "director": [
        {
            "@type": "Person",
            "name": "George Seaton",
            "url": "/name/nm0780833/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTdjODFiZTItOGRkMS00YzNkLWJhNzMtMzBmZTQzMmNmYTJjXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "based on a stage play,theater director,theatre producer,remade,alcoholic",
    "name": "The Country Girl",
    "original_info": {
        "id": "The Country Girl_1954",
        "name": "The Country Girl",
        "year": "1954"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2004-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0046874/"
        },
        "name": "Incredible Highs.",
        "reviewBody": "Bing Crosby's career reached its dramatic heights in The Country Girl. In fact the trio of Crosby, Grace Kelly, and William Holden all hit incredible highs with this one. Clifford Odets's play was a good backstage drama without any great political statement that characterized his earlier work \n\nIt would be another three years before Bing Crosby would do a film without singing at all. But for those who've never seen the Odets play, the story is one without any music. Crosby's role on Broadway was originated by Paul Kelly. When Paramount bought the screen rights they had Harold Arlen and Ira Gershwin write the songs that Crosby sings in The Country Girl. Curiously enough none of them, good that they were, became any kind of hit for Bing. Also this was Ira Gershwin's last score for either the stage of screen.\n\nIt's fitting that Grace Kelly won her Oscar for this part. Uta Hagen who played Georgie Elgin on Broadway won a Tony for her performance. Kelly was up against some stiff competition that year and upset the betting favorite Judy Garland for A Star Is Born. Other nominees included Dorothy Dandridge for Carmen Jones, Jane Wyman for Magnificent Obsession and Audrey Hepburn for Sabrina. I suppose it was the fact that Kelly was cast against type in her portrayal. Usually playing chic blonde princesses, she's almost dowdy looking in this film.\n\nCrosby plumbed some dramatic depths also and was nominated for Frank Elgin. However after three successive years of being nominated and not winning, Marlon Brando was not going to be denied in 1954. The rest of that field included Humphrey Bogart for The Caine Mutiny, James Mason for A Star Is Born and Dan O'Herlihy for Robinson Crusoe. Not a shabby field there either and Crosby's personal best came up against Brando's consolation for not winning for Streetcar Named Desire. Oscar politics at its finest.\n\nBill Holden's part of Bernie Dodd was originated on Broadway by Steven Hill who today's audiences know as DA Adam Schiff from Law and Order. After years of playing what he called \"Smiling Jim\" roles, his acting took on some bite with Sunset Boulevard. He's a cynical man here also, but there was an additional edge here. One of the plot elements was alcoholic Crosby knowing about Holden's bad marriage and using that knowledge to blame his bad behavior on Kelly. Holden was in the midst of a bad marriage himself, the only one he ever had. Marked by bitterness, recriminations, and mutual infidelities, he and Brenda Marshall stayed married for over 20 years for the sake of their children. When Holden's Bernie Dodd talks about his former wife there's an edge that I'm sure came from personal experience.\n\nThe only other role of any size is that of producer Phil Cook and it's played Anthony Ross. Another plot element is Holden's championing Crosby going head to head a few times with Ross who never really wanted him in his show. One of Ross's condition to using Crosby is that he given a contract with a two weeks notice clause and not a run of the play contract. Ross gets hoisted on his own petard for that one. Sadly this was Ross's last film, he died the following year.\n\nThe Country Girl is mature and intelligent and avoids the usual Hollywood clichés concerning show business stories. Even if you're not a fan of any or all of its three stars, this can be enjoyed on its artistic merits.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount",
        "duration": "PT2M39S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2414870809",
        "name": "The Country Girl",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODBiZTQ2OWEtMDU3Yy00MTUwLWJkOGMtZjg0ZWI4MWQxMDk1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODBiZTQ2OWEtMDU3Yy00MTUwLWJkOGMtZjg0ZWI4MWQxMDk1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:36:31Z",
        "url": "https://www.imdb.com/video/vi2414870809/"
    },
    "url": "/title/tt0046874/"
}