{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Demi Moore",
            "url": "/name/nm0000193/"
        },
        {
            "@type": "Person",
            "name": "Alec Baldwin",
            "url": "/name/nm0000285/"
        },
        {
            "@type": "Person",
            "name": "Joseph Gordon-Levitt",
            "url": "/name/nm0330687/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19267,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "George Dawes Green",
            "url": "/name/nm0205923/"
        },
        {
            "@type": "Person",
            "name": "Ted Tally",
            "url": "/name/nm0848217/"
        }
    ],
    "datePublished": "1996-02-02",
    "description": "A juror in a Mafia trial is forced to convince the other jurors to vote not guilty by an obsessive mob enforcer.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Gibson",
            "url": "/name/nm0001270/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWZlNGEzNjUtZGRiZi00ZWMxLWJiMjAtN2E1OWI3MTM4MjdjXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "sex scene,female nudity,ankle holster,murder of a nude woman,two word title",
    "name": "The Juror",
    "original_info": {
        "id": "The Juror_1996",
        "name": "The Juror",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DennisLittrell"
        },
        "dateCreated": "2000-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0116731/"
        },
        "name": "Underrated thriller",
        "reviewBody": "Alec Baldwin comes on quoting from the Tao Te Ching, making me think he's my kind of anti hero. He's urban, sophisticated and seemingly very safe since he's an art curator, or seems to be. Demi Moore as Annie Laird, a gifted and original sculptor (she sculpts works of art that you feel with your hands by reaching up into them: it's all tactile), is thrilled when he offers to buy her work and sell it to the Japanese. Wow. She has arrived as an artist.\n\nThus we have an intriguing and original premise for a thriller. One almost wishes that there weren't this little matter of her agreeing to serve on the jury in the case of a Mafia boss on trial for murder..\n\nI will gloss over the excellent, if unlikely, plot since it would be preemptive to reveal any of it, and concentrate on Demi Moore who is gorgeous, strange and riveting.\n\nIt might seem impossible to give an 'heroic' performance in a thriller, since the point of a thriller is pure entertainment, but this movie manages to look into the nature of good and evil a bit more than most, and Moore plays her part like our dream of a true heroine. Her character has strength and cunning; she's sharp without pretension. I always thought Moore was better than her reputation, but somehow she always seemed a little on the not entirely bright side, the kind of actress who would never presume to play Shakespeare. But now I think she's a 'natural,' like a gifted athlete-I'd almost say an 'animal'-as an actress, which is probably why some people don't like her. She can project the beautiful woman, an ordinary woman, or herself as a matronly woman with just a turn of her head. She can display a wide range of emotions and be, by turns, both a masculine and a feminine entity; but she is not androgynous. The role she plays here is, in a sense, the feminine counterpart of many Harrison Ford roles, the ordinary person elevated to heroic action by compelling circumstances. I would not say that Demi Moore is a great actress, but she is close, and I could be wrong.\n\nAlec Baldwin combines megalomania with a seductive cynicism. He fills the screen with his presence like something you can't get rid of. He is so compelling you want to push him away or just give up. And he is charming-evil, but charming.\n\nBrian Gibson's direction is unobtrusive and clever, and he pays attention to detail. The script is relatively free of the implausibilities that usually mar the genre, and the editing is crisp without jarring. The story practically transcends the genre by making us feel the evil of violent crime and how it perverts society, the sort of revelation not usually attempted in a thriller. I was especially delighted to see the Mafia demeaned and defeated, even if it's only by a new breed of international criminal. This is a superior thriller.\n\n(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Pictures",
        "duration": "PT1M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3472097561",
        "name": "The Juror",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTVhZDQzZWMtYmVhNS00ZmVmLTk4MzEtMGE0MjRjN2YyNDE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTVhZDQzZWMtYmVhNS00ZmVmLTk4MzEtMGE0MjRjN2YyNDE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:50:42Z",
        "url": "https://www.imdb.com/video/vi3472097561/"
    },
    "url": "/title/tt0116731/"
}