{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Randall Adams",
            "url": "/name/nm0011278/"
        },
        {
            "@type": "Person",
            "name": "David Harris",
            "url": "/name/nm0364595/"
        },
        {
            "@type": "Person",
            "name": "Gus Rose",
            "url": "/name/nm0741410/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25004,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057924/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024370/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028455/"
        },
        {
            "@type": "Person",
            "name": "Errol Morris",
            "url": "/name/nm0001554/"
        }
    ],
    "datePublished": "1988-08-25",
    "description": "A film that successfully argued that a man was wrongly convicted for murder by a corrupt justice system in Dallas County, Texas.",
    "director": [
        {
            "@type": "Person",
            "name": "Errol Morris",
            "url": "/name/nm0001554/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Documentary",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTE3MTViMDUtNjkxYy00NWY2LTg5MzEtYjFiNzRkMTgwYTJmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "color in title,reenactment,wrongful conviction,national film registry,hitchhiking",
    "name": "The Thin Blue Line",
    "original_info": {
        "id": "The Thin Blue Line_1988",
        "name": "The Thin Blue Line",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2008-10-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096257/"
        },
        "name": "A simple and matter-of-fact condemnation of a miscarriage of justice",
        "reviewBody": "Randall Adams was a drifter who was picked up by runaway teenager David Harris when he ran out of petrol. The two men hang out for a while, drank some beer, went to the movies, smoked some weed. At this point Adams says he went his own way to his motel with his brother, watched TV and went to sleep. Alternatively, Harris says the two men stayed together were stopped by the police when Adams took out a gun and opened fire on a police officer before driving off. This film follows the court case which charged Adams for the murder of a police officer, with the underage Harris (who was ineligible for the death penalty) as one of the main witnesses against him.\n\nI do enjoy a Perry Mason film because, after a solid hour of red herrings and question-marks, it always come down to the big reveal with Mason demanding \"isn't it true? ISN'T IT?\" as everyone gasps, the guilty confesses on the stand and justice is done. Sadly this is not a documentary but a basic TVM series and what the Thin Blue Line does so effectively is to get passed all our ideas of how justice works from films and presents a near-unquestionable miscarriage of justice. At no point does the \"guilty\" person get totally exposed (although the suggestion is very clearly there as to who it was) but instead Morris goes after the idea of reasonable doubt (which, if there is any, then the charged should not have been convicted). Starting at the very start of the fateful evening, Morris uses interviews and some reconstructions to tell the story of what happened from various points of view  initially with a focus very much on the events as the courts saw it.\n\nFrom here he then uses these same contributions to inject a huge amount of doubt into the vast majority of the case for the prosecution. If you want to find it, there are things in here that could be taken as anti-death penalty but for me the film is pro-justice as opposed to anti-anything as it is essentially reinforcing the importance of reasonable doubt. By virtue of doing this, everyone involved looks bad and Morris wisely doesn't need to pick on anybody in particular directly. It is fascinating as a film but I can understand the occasional claim of it being \"dull\"  I cannot agree with it but I can understand because, in a world where excess is the norm (style, action, violence, opinion) anything that is actually restrained and even handed could be taken as \"dull\".\n\nThis modern moaning aside though, The Thin Blue Line is a well made film that simply and matter-of-factly condemns the justice system as it applied to Randall Adams. One of Morris' best films and worth seeking out."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official trailer for Errol Morris' 'The Thin Blue Line'",
        "duration": "PT2M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi765049369",
        "name": "'The Thin Blue Line' Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWVkMmEyYTctNjRlOS00MzMzLWIyNjItZGIzYWMxOTU3ZGY2XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWVkMmEyYTctNjRlOS00MzMzLWIyNjItZGIzYWMxOTU3ZGY2XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-10-16T15:50:17.901Z",
        "url": "https://www.imdb.com/video/vi765049369/"
    },
    "url": "/title/tt0096257/"
}