{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Larry Vincent",
            "url": "/name/nm0898691/"
        },
        {
            "@type": "Person",
            "name": "Curley Myers",
            "url": "/name/nm2373672/"
        },
        {
            "@type": "Person",
            "name": "Hal Fryar",
            "url": "/name/nm0296799/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1165,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0004733/"
        }
    ],
    "description": "Television airings of the classic shorts featuring the crazy trio.",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmIyYTZlZTYtMTA1ZS00ODQ0LTk2OTktNDA4MGJlZDI1YmMzXkEyXkFqcGdeQXVyNTg2ODExNzA@._V1_.jpg",
    "name": "The Three Stooges Show",
    "original_info": {
        "id": "The Three Stooges: Stop_1960",
        "name": "The Three Stooges: Stop",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Amthermandes"
        },
        "dateCreated": "2023-02-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0850645/"
        },
        "name": "The fathers of slap-stick, Kings of situational comedy, absolute legends whose legacies will never die",
        "reviewBody": "I can't believe this show has been around for basically 90 years, and I'm only the second person to leave a review of this classic milestone in Hollywood comedy.\n\nIf anything, it's a historical documentary of how people talked and behaved during the 1930's through the 1950's. From the accents to the slang, it's a time capsule of the comedy and vernacular of mid-20th century New York and such.\n\nIt's not just the slapstick comedy, it's the also the well-timed lines and dialogue that are still funny almost a century later. \"I'm a victim of soy-kum-stance!\" is a classic.\n\nIn the modern age, Moe is a manipulative, abusive, selfish, sexist pig who would be immediately rejected if introduced in this day and age. But screw PC ideologies, Moe's a classic character who steers the Stooges in the direction of comedy success.\n\nLarry is lovable and usually the most under-appreciated of the trio (not taking Shemp into account, despite how pivotable his role was for the show). Talented at the violin (in the show AND in real life), his character is quintessential in the development of both plot and his relationship with the other Stooges.\n\nAnd who can forget CURLY. Alongside Buster Keaton and Charlie Chaplin, he is the EPITOME of both early, and industry-wide comedic genius. His mannerisms and ability to withstand constant physical (and even emotional) abuse will forever live on. From the classic \"Nyuk nyuk nyuk\" to the famous \"floor spin\" to the ever classic \"neeuuhhh neeuuhhh neeuhhh!\" whilst slapping his own face repeatedly in comedic fashion, his idiosyncrasies will live on forever. His comedy was the basis for comedy that thrives today, that feeds on the appreciation of audiences who never even knew he existed.\n\nThis art is simple, and so well respected. It's earned its due, so even haters should have the common decency to tip their hats.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Three Stooges Collection Volume 5",
        "duration": "PT1M53S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi555858969",
        "name": "The Three Stooges Collection Volume 5",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjQ3ZWY5YjYtMzBjZi00OTVjLWFiOTgtNDVkMzU0NDE2NWZkXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjQ3ZWY5YjYtMzBjZi00OTVjLWFiOTgtNDVkMzU0NDE2NWZkXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-06-19T13:01:38.206Z",
        "url": "https://www.imdb.com/video/vi555858969/"
    },
    "url": "/title/tt0850645/"
}