{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kristen Miller",
            "url": "/name/nm0588766/"
        },
        {
            "@type": "Person",
            "name": "Elena Uhlig",
            "url": "/name/nm0880212/"
        },
        {
            "@type": "Person",
            "name": "Paul T. Grasshoff",
            "url": "/name/nm0335886/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3036,
        "ratingValue": 4.4,
        "worstRating": 1
    },
    "alternateName": "The Pool",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057092/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046968/"
        },
        {
            "@type": "Person",
            "name": "Lorenz Stassen",
            "url": "/name/nm0823723/"
        },
        {
            "@type": "Person",
            "name": "Boris von Sychowski",
            "url": "/name/nm0842957/"
        },
        {
            "@type": "Person",
            "name": "Andreas Bütow",
            "url": "/name/nm0127332/"
        }
    ],
    "datePublished": "2002-12-13",
    "description": "International students at an elite Prague school are stalked and murdered while holding a party in an abandoned water park.",
    "director": [
        {
            "@type": "Person",
            "name": "Boris von Sychowski",
            "url": "/name/nm0842957/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxMzk3MjMwN15BMl5BanBnXkFtZTcwOTQwMzIyMQ@@._V1_.jpg",
    "keywords": "mask,masked killer,mystery killer,mysterious killer,grindhouse film",
    "name": "Swimming Pool - Der Tod feiert mit",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dellamorte_Dellamore07"
        },
        "dateCreated": "2006-06-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283027/"
        },
        "name": "Uneven and predictable...but still worth a watch or two.",
        "reviewBody": "I just finished watching and I get the impression I will not watch it again, or intend to rent it. Not's not saying it was awful. I'll start with the plot which isn't that layered and has all the clichés you'd expect. Typical opening credits that rip off the Drew Barrymore scene in Scream...then we are introduced the the cannon fodder at the local university. All of them brag and act arrogant, which wasn't exactly annoying...kind of fun because you know the majority if not all will meet their just desserts.\n\nWell anyways it's the night of the grad and all these yuppies want to throw a unique party so they get some dude who looks like the older brother in Adventures in Baby Sitting to break into a huge pool/resort type health spa thingy and they of course all get access to the free booze and are all supplied with swim wear. While this is going on some angry bimbo who dumps her one dimensional boring boyfreind gets sliced and diced...for some apparent reason she was walking in the thick of the night in deep forest for no apparent reason...\n\nAfter montages and constant unlikely dialouge of the partying teens the killer has made his presence apparent by slicing some ditzy couple in a water slide scene that was one of the best things in this movie. (Reminded me of the ice stalking scene in \"Curtains\" and the swimming scene in \"The Prowler\") the group all split up and we are in 80ies land as the plot drops everything but a a very uneven pace and a positive body count. A big peeve with this movie is that there was far too many characters, where you stopped even trying to keep track of names. Just wait until each die in brutal and unrelenting glee. Then you find out who the killer is by a boring and pointless sub plot involving some fat cop who gets all these back ground stories from various moronic bland characters.\n\nThe revealing of the killer was dumb and predictable, and he had a very tedious monologue like all those Scream/Urban Legend type killers and his costume was far from interesting or inventive.\n\nThough for its awesome high body count, very visually appealing and stylish directing that set ups all the kills nicely and has a take no prisoners mean spiritedness streak to it, and some tension at certain stalk scenes, it wasn't a total waste of time.\n\nWhoever was responsible for the soundtrack should wait till there at least 20 before composing and selecting songs for movies. It reeked of cheese and was lamer then the soundtrack of hmm..save the last putrid dance? I give this movie **out of **** You'll watch it it and most likely just forget about it it shortly afterwards."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Artisan",
        "duration": "PT1M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1828192537",
        "name": "The Pool (2001)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDNkM2JiNzctOTQ0Ny00OWY2LTk0YzEtOThkMWNhMjUxN2QzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDNkM2JiNzctOTQ0Ny00OWY2LTk0YzEtOThkMWNhMjUxN2QzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:03:22Z",
        "url": "https://www.imdb.com/video/vi1828192537/"
    },
    "url": "/title/tt0283027/"
}