{
    "@context": "https://schema.org",
    "@type": "VideoGame",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Schine",
            "url": "/name/nm1797878/"
        },
        {
            "@type": "Person",
            "name": "Melissa Hutchison",
            "url": "/name/nm1563502/"
        },
        {
            "@type": "Person",
            "name": "Carlos Antonio",
            "url": "/name/nm0031378/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3796,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "The Walking Dead: A New Frontier",
    "contentRating": "M",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0180284/"
        },
        {
            "@type": "Person",
            "name": "Matt Allmer",
            "url": "/name/nm3468088/"
        },
        {
            "@type": "Person",
            "name": "Nick Breckon",
            "url": "/name/nm5805479/"
        },
        {
            "@type": "Person",
            "name": "Michael Choung",
            "url": "/name/nm7649589/"
        }
    ],
    "datePublished": "2016-12-20",
    "description": "A teenage Clementine and a new survivor named Javier are brought together when a new threat worse than the dead arises.",
    "director": [
        {
            "@type": "Person",
            "name": "Rebekah Gamin",
            "url": "/name/nm4302165/"
        },
        {
            "@type": "Person",
            "name": "Jason Latino",
            "url": "/name/nm6339980/"
        },
        {
            "@type": "Person",
            "name": "Chris Rebbert",
            "url": "/name/nm5092166/"
        }
    ],
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2ExZDc1ZGMtOGNmMi00YWUwLTk2YTMtYzYwMDMyMGVkODZiXkEyXkFqcGdeQXVyNDQ2MTMzODA@._V1_.jpg",
    "keywords": "zombie,zombie apocalypse,choice,nonlinear timeline,brother brother relationship",
    "name": "The Walking Dead: The Game - Season 3",
    "original_info": {
        "id": "The Dead Zone: Season 3_2004",
        "name": "The Dead Zone: Season 3",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pjtaylor-96-138044"
        },
        "dateCreated": "2021-04-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt5785978/"
        },
        "name": "The dead still walk the Earth.",
        "reviewBody": "'The Walking Dead: A New Frontier (2016)' is a sequel/spin-off to Telltale's first two 'Walking Dead' titles. It puts you in the shoes of a new protagonist called Javier and relegates series regular Clementine to an NPC. It's a bit of an odd one within the wider series because it doesn't relate to the other titles in an especially meaningful way, even though it shows us some of what Clem has been up to since we left her at the end of 'The Walking Dead: Season 2 (2013)' and briefly alludes to what she'll get up to after the events of this title. Still, that doesn't mean its narrative is bad. It's as compelling and well-written as you'd expect from the storytelling studio. It's interesting to view Clem from a different perspective, too. With plenty of shocking moments, impactful decisions and well-rounded characters, the game keeps you engaged throughout its relatively short campaign. It's built around a conversation system and a series of quick-time action scenes, with brief segments in which you actually control the movement of your character and can explore your surroundings. It works surprisingly well, as it always has, feeling like an interactive story rather than a restricted game. Of course, there are ways to do similar choice-based storytelling within titles that have more substantial gameplay ('The Witcher 3: Wild Hunt (2015)', for example). However, the piece never feels constrained in a meaningful way; for what it is, it works very well. The game does have its issues, though. Firstly, there are a number of graphical glitches (such as unloaded textures) and game-breaking bugs. The thing locked up on me twice, with the second time requiring a complete system restart to solve. Secondly, the title often undercuts your major choices to the point that it actually becomes frustrating. Instead of allowing for branching paths, most big moments are simply interrupted before their consequences can unfold. At times, this leads to an unintentional sense of helplessness and it sometimes makes retrospection a rather sour experience. It isn't the best - or, perhaps, most elegant - way to make sure the plot hits the beats it needs to. Having said that, though, there are some choices that do clearly have an impact on the overall affair. The game will play out pretty much the same way regardless of your actions, but the characters you're with and your relationship to them will change depending on what you do. There are several endings, too, which vary from one another relatively significantly. Plus, the game is great at making you feel like what you do matters, even if it usually doesn't. You can't control the narrative, as such, but you can sculpt it to the point that it feels as though it belongs to you. It doesn't achieve this illusion as well as some of its peers, but it achieves it nevertheless. Ultimately, although this is almost certainly the weakest game in Telltale's 'Walking Dead' series, it's an engaging and entertaining time throughout. It's gripping, exciting and enjoyable. 8/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt5785978/"
}