{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin Howarth",
            "url": "/name/nm0397721/"
        },
        {
            "@type": "Person",
            "name": "Mark Stevenson",
            "url": "/name/nm1317863/"
        },
        {
            "@type": "Person",
            "name": "Antonia Beamish",
            "url": "/name/nm1028030/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3983,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103822/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104672/"
        },
        {
            "@type": "Person",
            "name": "James Handel",
            "url": "/name/nm1183860/"
        },
        {
            "@type": "Person",
            "name": "Julian Richards",
            "url": "/name/nm0003332/"
        }
    ],
    "datePublished": "2005-05-13",
    "description": "A serial killer uses a horror video rental to lure his next victim. What begins as a teen slasher transforms into a disturbing journey through the mind of Max Parry, a mild mannered wedding photographer with a taste for human flesh.",
    "director": [
        {
            "@type": "Person",
            "name": "Julian Richards",
            "url": "/name/nm0003332/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTI3NDcxNDM0Nl5BMl5BanBnXkFtZTgwNTA1NzAwMTE@._V1_.jpg",
    "keywords": "found footage,low budget film,exploitation,remake,slasher",
    "name": "The Last Horror Movie",
    "original_info": {
        "id": "The Last Horror Movie_2004",
        "name": "The Last Horror Movie",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "a-f-beeton"
        },
        "dateCreated": "2004-03-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0319728/"
        },
        "name": "British filmmaking with an unnerving edge",
        "reviewBody": "Though the title of this film might suggest conventional horror forthcomings, don't despair. The last Horror Movie is a unique cinematic exploration in to the mind of a serial killer. Wedding filmmaker Max Parry [Kevin Howarth] is a London bachelor who enjoys looking after his sisters' kids, entertaining friends and honing the art of murder. He decides to make his own horror film in order to help him discover his victim's attitudes to death. The commonsensical style of this movie is its real charm. It lacks the sardonic comedy that makes Rémy Belvauxs' Belgian film Man Bites Dog an obvious fiction, but henceforth the horror becomes much more feasible. Howarth conceivably becomes someone we could know, and like. His charismatic portrayal of Parry makes us open to his rational debates of art vs. humanity. The last horror movie takes the horror genre and turns it on its head; it pushes the viewer to challenge why they enjoy purveying murder and brutal senseless acts of killing. It forces us to consider the value of a human life and then contradicts our opinion with the general antipathy shown for human life in the third world. It tries to make us believe that murder is in essence a force of nature. The protection and reassurance of your own home is no longer a safe haven but a fruitful opportunity to gratify the predator among us. If you can stomach horror and gore then go and see this film. It's a powerful piece of British filmmaking with an unnerving edge. Director Julian Richards commented that the real horror of this film starts when you leave the cinema, a concept that entertained me, as I lay awake, convincing myself that the squeaking floorboards below were not as innocent as they sounded."
    },
    "url": "/title/tt0319728/"
}