{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Cruise",
            "url": "/name/nm0000129/"
        },
        {
            "@type": "Person",
            "name": "Jeanne Tripplehorn",
            "url": "/name/nm0000675/"
        },
        {
            "@type": "Person",
            "name": "Gene Hackman",
            "url": "/name/nm0000432/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 139128,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022730/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038270/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "John Grisham",
            "url": "/name/nm0001300/"
        },
        {
            "@type": "Person",
            "name": "David Rabe",
            "url": "/name/nm0704792/"
        },
        {
            "@type": "Person",
            "name": "Robert Towne",
            "url": "/name/nm0001801/"
        }
    ],
    "datePublished": "1993-06-30",
    "description": "A young lawyer joins a prestigious law firm only to discover that it has a sinister dark side.",
    "director": [
        {
            "@type": "Person",
            "name": "Sydney Pollack",
            "url": "/name/nm0001628/"
        }
    ],
    "duration": "PT2H34M",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDMzNDEwM2EtN2I4YS00NjRjLTk5ZTAtZTg5NjI1OWZhN2FkXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "seduction,frame up,briefcase,law,law firm",
    "name": "The Firm",
    "original_info": {
        "id": "The Firm_1993",
        "name": "The Firm",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2007-06-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106918/"
        },
        "name": "Lawyer/Client Privilege",
        "reviewBody": "Tom Cruise, the All American kid from the trailer park who worked his way through Harvard Law School, just got the dream job with a prestigious white shoe law firm in Memphis, Tennessee. Sounds like he's on his way to the top with wife Jeanne Tripplehorn. But it turns out to be a nightmare. \n\nThis Firm's main client is a Chicago crime family and they launder the mob's money. Now the FBI in the persons of fatherly Steven Hill and hard-nosed Ed Harris are squeezing Cruise to infiltrate and get incriminating information. That would result in disbarment for violating lawyer/client privilege. And The Firm isn't a gang of boy scouts either. They're not above a little blackmail and entrapment and they've got a security man in Wilford Brimley who's real good at it.\n\nHow Tom Cruise gets out of this rock and a hard place situation is the plot of The Firm. Sydney Pollak gave him one stylish cast in support and everyone of them delivers. Even players like Gary Busey, Hal Holbrook, Gene Hackman, take essentially supporting roles because this film was a guaranteed blockbuster. All of John Grisham's novels have their own built in audience, The Firm is no exception. I do remember my mother was a devoted reader of his work, whereas I always await the film version.\n\nHolly Hunter got an Oscar nomination for her small role as private detective Gary Busey's secretary and girl Friday. When Hunter witnesses Busey's murder without the hit men knowing it, she sets the wheels in motion for the downfall of the bad guys. Hunter got nominated for Best Actress for The Piano and Best Supporting Actress for The Firm, a most unusual occurrence. She won for The Piano in 1993, but lost the Supporting Actress Award to her co-star in The Piano, Anna Paquin. Winning both would have just been a bit too much for the Academy voters.\n\nThe Firm has a far fetched plot to be sure in the way that Tom Cruise brings them all down. Still that's the charm of it. It's almost Hitchcockian in its pace and mood, and even more resembles the Mission Impossible television series in the way it's all brought off. Small wonder that Tom Cruise was chosen to star in the big screen adaptations of that television classic.\n\nWhen I watch The Firm, I'm reminded of that line from another television classic that one Hannibal Smith used to say about he loved it when a plan comes together. That's what you will like about The Firm.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1802548249",
        "name": "The Firm",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjMwNmZlMDctMWEyZC00ZTIyLWIzNjYtNzViOWJiNWIyNTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjMwNmZlMDctMWEyZC00ZTIyLWIzNjYtNzViOWJiNWIyNTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-06-03T22:07:10Z",
        "url": "https://www.imdb.com/video/vi1802548249/"
    },
    "url": "/title/tt0106918/"
}