{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Will Smith",
            "url": "/name/nm0000226/"
        },
        {
            "@type": "Person",
            "name": "Matt Damon",
            "url": "/name/nm0000354/"
        },
        {
            "@type": "Person",
            "name": "Charlize Theron",
            "url": "/name/nm0000234/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 58010,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0819670/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0166202/"
        },
        {
            "@type": "Person",
            "name": "Steven Pressfield",
            "url": "/name/nm0696267/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Leven",
            "url": "/name/nm0505230/"
        }
    ],
    "datePublished": "2000-11-03",
    "description": "A down-and-out golfer attempts to recover his game and his life with help from a mystical caddy.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Redford",
            "url": "/name/nm0000602/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Drama",
        "Fantasy",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWYzOGE4NGItYTAyNy00NDBkLTljYjMtYzE4MjFmYTY4NGVlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "golf,female removes her clothes,no music during opening credits,plus fours,barefoot male",
    "name": "The Legend of Bagger Vance",
    "original_info": {
        "id": "The Legend of Bagger Vance_2000",
        "name": "The Legend of Bagger Vance",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ExpendableMan"
        },
        "dateCreated": "2007-10-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0146984/"
        },
        "name": "Will Smith and Matt Damon playing golf for two hours, much better than it sounds",
        "reviewBody": "The thing you have to bear in mind when watching The Legend of Bagger Vance is that sports movies, by their very definition, tend to match the atmosphere of the sport they depict. Football or Ice hockey movies for instance tend to be loud, bombastic and flashy, just like the games themselves. Basketball movies meanwhile often rely on the street/hip hop connection and are just as loud, but with a slightly more gritty edge to them, provided you completely forget about the atrocious Space Jam. Bagger Vance on the other hand revolves entirely around golf and consequently, is a lot quieter, slower paced and gentle than its brash genre cousins, but it nevertheless possesses a charm and subtlety that is quite endearing.\n\nTold completely in flashback, the film's story involves Matt Damon's depressed World War One veteran Rannulph Junnuh taking part in a highly publicised golf tournament against two established (real life) professionals - Walter Hagen and Bobby Jones. At first things don't look good, Junnuh hasn't played the game since getting back from the trenches and is a slovenly drunken washout. Despite having the support of the townsfolk, nobody really expects him to win. And then he gets a new caddy in the shape of Bagger Vance (Will Smith).\n\nAt this point I imagine alarm bells are ringing in your head. Will Smith must mean wise-cracking, one-liners and the word 'damn' being stretched out so that it consists of two syllables right? Well you'll be relieved to know that Bagger is a pleasant change of direction for the normal Smith stereotype. Relaxing on his heels and working his acting muscles instead of his action hero ones, Smith is the undeniable soul of the movie. His eminently likable charm is still there, but he relies more on home spun wisdom and gentle prodding to help Damon back into his game, rather than calling him names and effecting a cocky swagger. Playing off against him, Matt Damon is suitably vulnerable and insecure but is overshadowed a bit. Thankfully, Junnuh's redemption and Vance's easy going friendship is enough to carry the film and the story, while corny, is just as charming as the title character.\n\nElsewhere, director Robert Redford once again shows off his knack for beautiful cinematography. As most of the film takes place on golf courses you're never too far away from some gorgeous scenery and the contrast between the vibrant green vegetation and stunning blue sky makes Bagger Vance a feast for the eyes. Given the film's somewhat slow pace, it also makes this an ideal choice for a wet Sunday afternoon where you'd like to go for a walk and appreciate the countryside but are unable to thanks to the rain.\n\nThat said, Bagger Vance still has its faults. The writing is a bit hackneyed and anyone who doesn't like cheese would do well to stay away. Junnuh's love interest sub-plot with golf promoter Adele Invergordon (Charlize Theron) meanwhile feels tacked on and unnecessary, as though somewhere along the production line someone decided that if Junnuh was to fully come to terms with himself he'd have to get it on with a sweet country belle. The positives outweigh the negatives though and if you're in the mood for a relaxing, slow paced movie with a lot of subtleties that not everyone will appreciate, you can't really go wrong with Bagger Vance. This is a film to watch with your feet up, the house clean and a big mug of hot chocolate in your hand. And refreshingly enough for a sports movie, it doesn't feature a scene where a big crowd begins cheering wildly while over-the-top power ballads play in the background, that alone should be enough to raise an eyebrow or two.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Dreamworks",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2833645849",
        "name": "The Legend of Bagger Vance",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTljZTRjZTAtMjdlZC00ZDE2LTg4ZmQtZGViYzI4ODlkZWY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTljZTRjZTAtMjdlZC00ZDE2LTg4ZmQtZGViYzI4ODlkZWY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-05-30T05:48:05Z",
        "url": "https://www.imdb.com/video/vi2833645849/"
    },
    "url": "/title/tt0146984/"
}