{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michel Serrault",
            "url": "/name/nm0785664/"
        },
        {
            "@type": "Person",
            "name": "Mathilde Seigner",
            "url": "/name/nm0782565/"
        },
        {
            "@type": "Person",
            "name": "Jean-Paul Roussillon",
            "url": "/name/nm0746085/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2323,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "The Girl from Paris",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036163/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014425/"
        },
        {
            "@type": "Person",
            "name": "Christian Carion",
            "url": "/name/nm0137228/"
        },
        {
            "@type": "Person",
            "name": "Eric Assous",
            "url": "/name/nm0039903/"
        }
    ],
    "datePublished": "2001-09-05",
    "description": "Sandrine, a woman in her thirties gets tired of life in Paris and decides to leave her work in computers and become a farmer. She takes the required practice for two years, and after that she buys an isolated farm from Adrien, an ...",
    "director": [
        {
            "@type": "Person",
            "name": "Christian Carion",
            "url": "/name/nm0137228/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmNjOWY3ZmUtMjAwZC00OTBkLTg5ODctMjIyYTE3MGNmMGQzXkEyXkFqcGdeQXVyMjE4NzY3Mw@@._V1_.jpg",
    "keywords": "farmer,farming,bed and breakfast,female farmer,farm",
    "name": "Une hirondelle a fait le printemps",
    "original_info": {
        "id": "The Girl from Paris_2001",
        "name": "The Girl from Paris",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "writers_reign"
        },
        "dateCreated": "2004-08-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0240149/"
        },
        "name": "Young Mathilde Had A Farm",
        "reviewBody": "It's formulaic, of course, but the trick with formulas is to act as if they're NOT formulaic and play it as if it were the most original story that ever came down the Pike. And that's what we get here, a charming, dazzling and ultimately Moving film that explores as if for the first time age-old concerns. Serrault has been here before in Nelly and Monsieur Arnaud so this is a good time to deal with the six degrees of separation aspect. In 'Nelly' Serrault was the older man and Manu Beart the younger woman; in Manon des Source Manu Beart tended goats and here Mathilde Seigneur does the same thing. So much for trivia. They really put more than the usual five minutes thought into this one because the credits come up over breathtaking aeriel shots of the Vercours and you can see why so many English people are inspired to buy second homes in France or even move there entirely. This is reinforced when in the first sequence we cut to Sandrine (Seigneur) caught up in a traffic jam in Paris and looking thoughtfully at a travel poster of Vercours on a bus in front of her. This is economical storytelling and in the very next scene she is telling her mother of her decision to move to the Vercours - in the Rhone Alps - and become a goat-farmer. The mother can't understand, natch, why a girl born and bred in Paris and a successful computer instructor would want to give it all up to become a sort of recluse about town. So we get the argument out of the way in the first reel. Sandrine is a gifted student, one of the best in Agricultural school and soon she is ready to invest 450,000 Francs in a remote goat farm. The farm belongs to old Adrien (Michel Serrault) and he comes with it, at least til he can move into his new flat in Grenoble some 18 months away. We are now ready for the classic battle of Old versus New, Young versus Old, initial antagonism giving way to mutual affection. Like I said, we've seen it all before. But what we HAVEN'T seen before is two Class Acts like Serrault and Seigneur and what they serve up is pure DELIGHT. We are spared nothing, this isn't a Travelogue because after an idyllic Summer comes the Winter of Discontent, so bad that Seigneur seriously considers throwing in the towel. Essentially a two-hander that stands or falls by the the quality of the two pricipals it is also fleshed out with really strong support in the shape of Adrien's neighbor and contemporary, Sandrine's colleague from Paris and sometime lover, and her mother. This is the kind of movie that Hollywood has completely forgotten how to make and which the accountants who run the place wouldn't sanction anyway. Thank God the French and other European countries can still turn them out like this. 10/10"
    },
    "url": "/title/tt0240149/"
}