{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Downey Jr.",
            "url": "/name/nm0000375/"
        },
        {
            "@type": "Person",
            "name": "Chris Evans",
            "url": "/name/nm0262635/"
        },
        {
            "@type": "Person",
            "name": "Scarlett Johansson",
            "url": "/name/nm0424060/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1406970,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051941/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Joss Whedon",
            "url": "/name/nm0923736/"
        },
        {
            "@type": "Person",
            "name": "Zak Penn",
            "url": "/name/nm0672015/"
        }
    ],
    "datePublished": "2012-05-04",
    "description": "Earth's mightiest heroes must come together and learn to fight as a team if they are going to stop the mischievous Loki and his alien army from enslaving humanity.",
    "director": [
        {
            "@type": "Person",
            "name": "Joss Whedon",
            "url": "/name/nm0923736/"
        }
    ],
    "duration": "PT2H23M",
    "genre": [
        "Action",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDYxNjQyMjAtNTdiOS00NGYwLWFmNTAtNThmYjU5ZGI2YTI1XkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
    "keywords": "superhero,marvel cinematic universe,avengers,alien invasion,s.h.i.e.l.d.",
    "name": "The Avengers",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "scotts863"
        },
        "dateCreated": "2012-04-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0848228/"
        },
        "name": "A Flat out Exceptional Movie Event. (Best Villain in Years!)",
        "reviewBody": "I'm happy to report that everything established in previous movies pays dividends in a big way. It's not that anyone needs to see those other Avenger solo films before seeing this gem but it certainly adds depth and texture to this amazing product. Not having to intro big main characters deeply allows the action to flow but also allows for better development. This also allows them to probe deeper into the character's personalities. This heightens the tension, so often missing from comic-book movies, and adds real weight to the story as well as the action sequences which are thrilling and often mesmerizing. The result is a film that's just flat out exceptional.\n\nOf course all the phenomenal heroes got to shine and the story accommodated them all perfectly. What I loved is that Marvel did it again with their main villain. Loki was just so wonderful and complex in this amazing movie. Spurned Loki masterfully dances on the fault lines of villainy and redemption. He always keep people guessing and. Again, that's just shear perfection coming from the god of mischief. He has such a mixture of emotional psychological complexity. You have somebody who's capable of thinking and strategizing at the speed of light, but underneath that is a deep well of pain that at any moment threatens to boil over and Tom Hiddleston plays it like the master he has become. This is Oscar worthy villain performance good.\n\nThe performances in this movie are as good as any I've ever seen in an adventure film. The great actors say that acting akin to playing tennis. The rally that they play with a new partner is completely different from one to the other. Each of these GREAT actors have such specific talents that it's fun to see them play off each other at different times in this movie. I think Whedon realized this as both director and writer and shuffled things around on purpose to play to strengths. It's just another wonderful aspect of this spectacular movie event."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Nick Fury of S.H.I.E.L.D. brings together a team of super humans to form The Avengers to help save the Earth from Loki and his army.",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1891149081",
        "name": "Blu-ray Version",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTcwNTg1Nzg2MF5BMl5BanBnXkFtZTcwNDEwOTUwOA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTcwNTg1Nzg2MF5BMl5BanBnXkFtZTcwNDEwOTUwOA@@._V1_.jpg",
        "uploadDate": "2012-06-30T06:43:24Z",
        "url": "https://www.imdb.com/video/vi1891149081/"
    },
    "url": "/title/tt0848228/"
}