{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rita Hayworth",
            "url": "/name/nm0000028/"
        },
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        },
        {
            "@type": "Person",
            "name": "Everett Sloane",
            "url": "/name/nm0806041/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 31446,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003016/"
        },
        {
            "@type": "Person",
            "name": "Sherwood King",
            "url": "/name/nm0455271/"
        },
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        },
        {
            "@type": "Person",
            "name": "William Castle",
            "url": "/name/nm0145336/"
        }
    ],
    "datePublished": "1948-04-14",
    "description": "Fascinated by gorgeous Mrs. Bannister, seaman Michael O'Hara joins a bizarre yachting cruise, and ends up mired in a complex murder plot.",
    "director": [
        {
            "@type": "Person",
            "name": "Orson Welles",
            "url": "/name/nm0000080/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWZkNTYxZjQtN2IwZi00OGExLTg3ZDEtODNjMDFkN2Y5Y2NkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "attempted suicide,femme fatale,hall of mirrors,national film registry,taxi",
    "name": "The Lady from Shanghai",
    "original_info": {
        "id": "The Lady from Shanghai_1948",
        "name": "The Lady from Shanghai",
        "year": "1948"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2004-04-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0040525/"
        },
        "name": "Mirror, mirror...",
        "reviewBody": "One can only imagine the film Mr. Welles might have finished without the interference of the studio! This film is a flawed Welles, but worth every minute of it because one can see the greatness of perhaps America's best motion picture director of all times!\n\nWe can see the toll it took on Orson Welles the filming of this movie. The story has a lot of holes in it, perhaps because of the demands of the studio executives that didn't trust the director. \n\nIt is curious by reading some of the opinions submitted to IMDB that compare Orson Welles with the Coen brothers, Roman Polanski, even Woody Allen, when it should be all of those directors that must be regarded as followers of the great master himself. No one was more original and creative in the history of American cinema than Mr. Welles. Lucky are we to still have his legacy either in retrospective looks such as the one the Film Forum in New York just ended, or his films either on tape or DVD form.\n\nRita Hayworth was never more lovingly photographed than here. If she was a beauty with her red hair, as a blonde, she is just too stunning for words. Everett Sloan and Glenn Anders made an excellent contribution to the movie.\n\n The only thing that might have made this film another masterpiece to be added to Orson Welles body of work, was his own appearance in it. Had he concentrated in the directing and had another actor interpret Michael O'Hara, a different film might have been achieved altogether. Orson Welles has to be credited for being perhaps a pioneer in taking the camera away from the studio lot into the street. The visuals in this film are so amazing that we leave the theater after seeing this movie truly impressed for the work, the vision and the talent he gave us.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0040525/"
}