{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emily Woof",
            "url": "/name/nm0941056/"
        },
        {
            "@type": "Person",
            "name": "Rufus Sewell",
            "url": "/name/nm0001722/"
        },
        {
            "@type": "Person",
            "name": "Cal MacAninch",
            "url": "/name/nm0531229/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 724,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103757/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027008/"
        },
        {
            "@type": "Person",
            "name": "Thomas Hardy",
            "url": "/name/nm0362762/"
        },
        {
            "@type": "Person",
            "name": "David Rudkin",
            "url": "/name/nm0748814/"
        }
    ],
    "datePublished": "1998-02-06",
    "description": "The story is set in late 19th century rural corner of South England. The daughter of timber merchant Melbury, Grace, returns to the town after finishing school. Her father now believes she can find a better husband than her childh...",
    "director": [
        {
            "@type": "Person",
            "name": "Phil Agland",
            "url": "/name/nm0013078/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI1MzU3NDMwOV5BMl5BanBnXkFtZTcwOTI1MDkyMQ@@._V1_.jpg",
    "keywords": "tree planting,merchant,childhood sweetheart,timber merchant,timber",
    "name": "The Woodlanders",
    "original_info": {
        "id": "The Woodlanders_1997",
        "name": "The Woodlanders",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Marcio Cuzziol"
        },
        "dateCreated": "2002-05-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120532/"
        },
        "name": "The Hardy Way",
        "reviewBody": "Typical British drama based on a novel by Thomas Hardy, the author of \"Jude the Obscure\", \"Tess of the d'Urbevilles\" and \"Far from the Madding Crowd\". As usual in Hardy's stories, it is set on British countryside and focuses on the ordinary lives of its local people. As usual in this kind of movie, it is really well-made and extremely well-acted, but also bureaucratically directed.\n\nHardy's characters are quite human, they are always looking for happiness in the wrong places, making bad choices, missing the best opportunities. Here is not different. Marty loves Giles who loves Grace who loves him no more. She is unsure about her feelings since she returned from a period of studies in the town. The small village where she grew up doesn't look much attractive now, neither Giles does. She dreams about going abroad with Mrs. Charmond, the rich landowner widow, while she flirts with the newcomer young doctor - he also came from the town. Soon all of them will be facing the unavoidable fate.\n\nThe woodworker Giles (Rufus Sewell) reminds me the shepherd Gabriel from \"Far from the Madding Crowd\": both are honest, hard-working, heartbroken men. Emily Woof is just perfect as Grace; she looks like Cate Blanchett and she can even play like her. Unfortunately Jodhi May has just a small role as Marty the poor girl who sells her beautiful long hair to survive, a very sympathetic character. Tony Haygarth is also excellent as Grace's father, a well-intentioned man who wishes only the best for his daughter, but practically manipulates her life. I usually see Haygarth playing weird roles, like Renfield in \"Dracula\" (1979) or the Mad Hatter from Alice's Wonderland in \"Dreamchild\", so it is refreshing to see him playing normal types. Good film, good story, but not recommended for people looking for something light."
    },
    "url": "/title/tt0120532/"
}