{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Sellers",
            "url": "/name/nm0000634/"
        },
        {
            "@type": "Person",
            "name": "Ringo Starr",
            "url": "/name/nm0823592/"
        },
        {
            "@type": "Person",
            "name": "Isabel Jeans",
            "url": "/name/nm0419978/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3683,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "M/PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021964/"
        },
        {
            "@type": "Person",
            "name": "Terry Southern",
            "url": "/name/nm0816143/"
        },
        {
            "@type": "Person",
            "name": "Joseph McGrath",
            "url": "/name/nm0569825/"
        },
        {
            "@type": "Person",
            "name": "Graham Chapman",
            "url": "/name/nm0001037/"
        }
    ],
    "datePublished": "1969-12-12",
    "description": "The world's richest man and his adopted hobo son set out to test the limits of human vanity and greed through a series of \"money games\".",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph McGrath",
            "url": "/name/nm0569825/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGQ4MjFmMGUtOGJkYi00ZDczLWI4ZDUtMDMwNWU4ZGQ4Zjk1XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "ten pound note,big ben,napoleon bust statue,sleeping on the ground,brushing teeth",
    "name": "The Magic Christian",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mfisher452"
        },
        "dateCreated": "2001-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064622/"
        },
        "name": "Still entertaining after all these years",
        "reviewBody": "After more than 40 years, The Magic Christian still entertains. Its style is very much of the Sixties, but its profoundly cynical message---that anything can be bought, that everyone has his price---is, if anything, more relevant now than in 1969 when the film was released. The star, of course, is Peter Sellers as the obscenely wealthy Sir Guy Grand, who manages to seem almost childlike as he spreads his bounty of cynicism throughout London.\n\nThis is not a great film, or even necessarily a good one, but even second- or third-rate Peter Sellers may be preferable to a lot of first-rate work by others. The childless Sir Guy decides one morning to acquire an heir, so he goes to the park and picks up a homeless man played by Ringo Starr, and adopts him as his son, Youngman Grand. (Ringo actually doesn't have much to do in this film except react to Sellers.) Sir Guy then enlists Youngman in escapades that, in his hands, skewer the stuffed shirts of upper-class London society and turn the most solemn occasions into a carnival of absurdist nihilism. The most extreme comes at the end of the film, where he scatters money into a huge vat of blood, urine and excrement, and then watches as bowler-hatted City of London types wade into it for the money. This scene doesn't quite work. There is an extended sequence aboard a bogus cruise ship called The Magic Christian that tends to try one's patience because it degenerates into a very Sixties psychedelic montage. One moment from this sequence, however, is worth the whole thing: Raquel Welch as the Priestess of the Whip. Dressed as a dominatrix, she never looked more luscious or voluptuous. Film aficionados will appreciate the many old-line British actors who contributed supporting or cameo roles (Spike Milligan, Lawrence Harvey, Richard Attenborough, John Le Mesurier, Wilfrid Hyde-White, Christopher Lee, and others less well known outside the UK) as well as glimpses of younger now-famous faces, especially John Cleese in a hysterically funny scene at Sotheby's. Cleese plays the terminally smarmy, unctuous, patronizing curator Mr. Dougdale, whose supercilious mien is punctured beyond repair by Sir Guy in a scene involving the defacing of a priceless painting. There is a Monty Python skit that looks like it was directly inspired by this scene. This film was shot at about the time of the first season of Monty Python's Flying Circus, and what with the appearance in the film of at least two Pythons that I could identify, there are definitely echoes of Python in it. The other Python was (an uncredited) Graham Chapman as the leader of the Oxford team during the famous Oxford-Cambridge boat race. Watch also for an uncredited Yul Brynner playing a female impersonator who does a sexy torch song. Alert listeners---especially lovers of the classic 1950s BBC radio comedy program the Goon Show---will also notice that Sellers does almost all of the off-screen voices and several voices of characters seen only in long shot, reminiscent of the films of Orson Welles; so if you suddenly think you hear Henry Crun or Major Bloodnok off-screen, it's not your imagination.\n\nAll in all, a solid five or six stars out of ten.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0064622/"
}