{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Gambon",
            "url": "/name/nm0002091/"
        },
        {
            "@type": "Person",
            "name": "Patrick Malahide",
            "url": "/name/nm0538869/"
        },
        {
            "@type": "Person",
            "name": "Joanne Whalley",
            "url": "/name/nm0000695/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4562,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051111/"
        }
    ],
    "datePublished": "1986-11-16",
    "description": "Tormented and bedridden by a debilitating disease, a mystery writer relives his detective stories through his imagination and hallucinations.",
    "genre": [
        "Drama",
        "Musical",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAzODY5ODE0MF5BMl5BanBnXkFtZTYwNTU1Mzg5._V1_.jpg",
    "keywords": "anger,wife,surrealism,absurdism,cranky",
    "name": "The Singing Detective",
    "original_info": {
        "id": "The Singing Detective_1986",
        "name": "The Singing Detective",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ThreeSadTigers"
        },
        "dateCreated": "2008-03-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090521/"
        },
        "name": "A landmark work of detective fiction and personal examination",
        "reviewBody": "The Singing Detective is one of those great works that inspire something deep within the viewer, leaving them both shaken and elated by the spectacle they have just witnessed. Few cinematic works can inspire such a feeling, let alone a work for television; and it is this sense of genius that elevates this work above the comparatively \"okay\" likes of say, Cracker, Brideshead Revisited, and Prime Suspect et al. This is down to the fact that The Singing Detective is a work far greater than anything else; a microcosm of life, love, anger, defeat, consciousness and the sub-conscious. It deals with the intricate realms of fantasy and reality, the written, the understood and the real. If this sounds complicated then we're on the right track, because this is one of Dennis Potter's most detailed narrative constructs. The story chronicles a writer's decent into personal hell, as well as a decent into a book being written in his own imagination and a book written many years before; with his past, present and future all jostling for our attention throughout the epic, six-hours-plus running-time.\n\nIt is a testament to Potter's ability as a screenwriter that the whole thing zips along so quickly, with the multi-layered story never pausing for a moment; constantly being carried along at every step by the combined genius of Potter's characters, the skillful and visually rich direction of Jon Amiel and that towering central performance from the brilliant Michael Gambon. The writing is truly ecstatic, with Potter obviously relishing every chance he gets to play with both the musical and detective-movie clichés - bringing to mind both Casablanca and Potter's own-classic Pennies From Heaven - whilst the dialog of Gambon's inner-monologues have more in common with the profane poetry of 60's playwrights that anything you'd expect to hear on BBC 2. The story also has obvious political overtones, with Potter using the hospital setting of the present sequences to double as an allegory of 80's Britain under the tyrannical leadership of Margaret Thatcher (bringing to mind the Elvis Costello song Tramp the Dirt Down and those other hospital set political parables, One Flew Over the Cuckoo's Nest and Britannia Hospital).\n\nThe story is also somewhat semi-autobiographical from Potter's point of view, with the writer, at this point in time, suffering from the same psoriatic-arthritis that Gambon's character Marlow has (creating that devastating, iconic image of the paralytic Marlow languishing half-naked in bed, being greased by a young Joanne Whally). There are also the much deeper autobiographical aspects with the young Marlow's childhood in the shady and evergreen Forest of Dean, in which the pastoral setting gives way to some truly shocking moments; recalling similar childhood traumas from such diverse examples as Iain Bank's Complicity and Rob Reiner's film Stand by Me. However, within this mire of bitterness, surrealism, bouts of lip-synced cabaret and phantasmagorical shoot-outs, there is also a great deal of humour. Anyone who has seen one of Potter's early TV plays or, for that matter, later classics like Karaoke and Cold Lazarus will know of his depth and range as both a humorist and a satirist; and it is this darkly acerbic wit that underlines the central narrative strands of The Singing Detective.\n\nSome would argue that this is the best that television has to offer, though I would politely disagree. The Singing Detective is a work of art too good to be considered simply for television. Now, thanks to the magic of DVD we have the chance to experience Potter's classic in its definitive unabridged, unedited, uninterrupted from. A truly great piece of work."
    },
    "url": "/title/tt0090521/"
}