{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Bettany Hughes",
            "url": "/name/nm1655796/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 225,
        "ratingValue": 8,
        "worstRating": 1
    },
    "description": "A history of the ancient Spartans, featuring historian Bettany Hughes as presenter and narrator.",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg4OTE1Njg2NV5BMl5BanBnXkFtZTcwNzkwOTUyMQ@@._V1_.jpg",
    "keywords": "spartan,tv mini series,society,narration,ancient greece",
    "name": "The Spartans",
    "original_info": {
        "id": "The Spartans_2004",
        "name": "The Spartans",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "johnnieroderickbyrne"
        },
        "dateCreated": "2006-10-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0416424/"
        },
        "name": "Why History Matters to ME.",
        "reviewBody": "Oh The Spartans - that was the name of one of the programmes I saw.\n\nOne reason \"Why history matters to me\" which I wouldn't have posted on the History Matters site was highlighted by Five Live, the radio station. So I blame them for initially reminding me of Bettany Hughes and sending me towards the History Matters site for a lot of futile activity trying to post my \"One Day In History\" - 17 October 2006. \n\nThis is the era where you HAVE to find someone else to blame isn't it? I was listening to Simon Mayo interviewing Ray Winston I think when suddenly realised the guest had changed to some one feminine. Just as I learnt it was Bettany Hughes, historian, plugging the \"One Day In History\" exercise. \n\nApropos nothing I had heard, she suddenly asked Simon to look at her top garment and tell her if he could see her breasts? Boy if I hadn't been sitting down already....! Anyway, Mr Mayo being the gallant gentleman he is demurred from undertaking the good Doctor's request for an examination. Me  I was off and running to get my stamp collectors magnifying glass (two bands of light helps with viewing thru it). I closely inspected my radio but am sad to report I couldn't see Ms Hughes top half. Sigh! Yes I can say in 3 words one of the reasons history matters to me. \"Doctor Bettany Hughes\". With the David Starkey's, Simon Sharma's and Peter Ackroyd's shoving themselves into camera shot on every occasion they can  mostly when history programmes are on (which my missus loves) I find something more urgent to do. Like watching paint dry in another room, which hasn't been re-decorated in a decade. \n\nBut then I saw one of Doctor Hughes' historical programmes and was hooked. What a shallow person I am! I usually yell at the men presenters draping themselves all over my view of the pyramids, whatever. But ask me what subject each Bettany Hughes' programme was on, be it an hour or even two hours long and I would no doubt only mutter incoherently \"Bettany! Bettany!\" I am a disrespectful viewer with Peter Ackroyd  his shows on The Romantics and London were wonderful but his constant presence on the screen looking moodily off into the middle distance irritated the heck out of me.\n\nBut I consider it a frame of film wasted if Dr Hughes isn't in it. Her head, just so, the sun glinting off that raven wings jet black hair. I go weak.\n\nHey, someone move those damn pyramids out of the way! Are you ready for your close up, Dr Hughes?"
    },
    "url": "/title/tt0416424/"
}