{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Willis",
            "url": "/name/nm0000246/"
        },
        {
            "@type": "Person",
            "name": "Damon Wayans",
            "url": "/name/nm0001834/"
        },
        {
            "@type": "Person",
            "name": "Chelsea Field",
            "url": "/name/nm0001210/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 106457,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0120075/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019968/"
        },
        {
            "@type": "Person",
            "name": "Shane Black",
            "url": "/name/nm0000948/"
        },
        {
            "@type": "Person",
            "name": "Greg Hicks",
            "url": "/name/nm0382855/"
        }
    ],
    "datePublished": "1991-12-13",
    "description": "A private detective's protected female witness is murdered, prompting him and the victim's boyfriend to investigate the crime that leads to a corrupt politician and a crooked football team owner.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Scott",
            "url": "/name/nm0001716/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2QxYjAwNDUtYWIzMC00ZTg3LTg5YjMtOGM4YzAyZmUxMzI2XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "assassination attempt,car in a swimming pool,neo noir,two man army,polish joke",
    "name": "The Last Boy Scout",
    "original_info": {
        "id": "The Last Boy Scout_1991",
        "name": "The Last Boy Scout",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LukeS"
        },
        "dateCreated": "1999-05-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102266/"
        },
        "name": "A genre classic - oft copied, never matched",
        "reviewBody": "Although this film receives a lot of credit for reinvigorating the action/buddy genre movie, the praise is too often misdirected. For instance, whilst Bruce Willis gives a solid performance as low-life private eye Joe Hallenbeck, we have seen the act a dozen times. There are remnants of Die Hard's John McClane in every knowing smirk and pained cigarette inhalation. Equally, Tony Scott's direction is still based on an obsession with placing bright lights behind the actors and turning up the volume of car chases and gunshots. Jimmy Dix, the faded football hero, is given a suitably comic persona by Damon Wayons and the action sequences are as good as you will find elsewhere in Hollywood. However, these are not the attractions of the film for me.\n\nYou might think, from what is written above, that I disliked the film but you would be mistaken to think that as I believe it to be an absolute classic of its kind. I truly think The Last Boy Scout should be used as a teaching tool at film schools the world over. In spite of its glaring limitations it is a movie that has everything! The opening scene is a modern movie classic - up there with those of Raiders Of The Lost Ark and Goodfellas. If there is a film-goer alive whose mouth didn't gape in wonderous amusement at the climax to the opening scene then I am amazed. The plot, as far fetched as it is, provides a perfect vehicle for the key elements that go towards making this the gem of a movie that it is.\n\nFirst in the list of key elements is the wonderfully funny dialogue. Shane Black's hallmark of snappy one-liners is all over the sizzling repartee between the two heroes. Even Hallenbeck's daughter gets a couple of laugh-out-loud lines. Secondly, the story benefits from the ideal combination of: sport, gambling, violence, comedy, the odd topless dancer, important values of family and friendship, revenge and honour. Take out the topless dancer and they pretty much all feature in The Godfather!\n\nThe third crucial component for the success of The Last Boy Scout is the perfect casting of the bad guys. Milo, played to chilling perfection by Taylor Negron, is a bad guy with a difference. He isn't just a mindless hard man. His brilliantly annoying habit of calling people by their elongated names is a superb touch (Joe becomes Joseph, Jimmy becomes James and so on), as are his attempts at civility when trying to \"do a formal introduction\" with the kidnapped Hallenbeck. Other bad guys are fleshed out and distinguished by quirky traits or funny lines. They are not merely there to make the good guys look good.\n\nOverall, this film is not a piece of celluloid art. It is, however, a perfect example of popcorn-friendly entertainment. It is the sort of movie you imagine the makers would like to see as movie-goers themselves. Without being utterly contemptible or mindlessly low-brow it entertains. An ideal Saturday night movie to watch with a group of friends.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT2M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2475622681",
        "name": "The Last Boy Scout",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDRmZjJmMTYtNTgzNy00NzRhLThhY2UtYTFlYzZmNjY0ODI2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDRmZjJmMTYtNTgzNy00NzRhLThhY2UtYTFlYzZmNjY0ODI2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:32:53Z",
        "url": "https://www.imdb.com/video/vi2475622681/"
    },
    "url": "/title/tt0102266/"
}