{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lee Marvin",
            "url": "/name/nm0001511/"
        },
        {
            "@type": "Person",
            "name": "Ernest Borgnine",
            "url": "/name/nm0000308/"
        },
        {
            "@type": "Person",
            "name": "Charles Bronson",
            "url": "/name/nm0000314/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 75609,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031354/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045848/"
        },
        {
            "@type": "Person",
            "name": "Nunnally Johnson",
            "url": "/name/nm0425913/"
        },
        {
            "@type": "Person",
            "name": "Lukas Heller",
            "url": "/name/nm0375355/"
        },
        {
            "@type": "Person",
            "name": "E.M. Nathanson",
            "url": "/name/nm0622284/"
        }
    ],
    "datePublished": "1967-10-22",
    "description": "During World War II, a rebellious U.S. Army Major is assigned a dozen convicted murderers to train and lead them into a mass assassination mission of German officers.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Aldrich",
            "url": "/name/nm0000736/"
        }
    ],
    "duration": "PT2H30M",
    "genre": [
        "Action",
        "Adventure",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2Y1ZTI0NzktYzU3MS00YmE1LThkY2EtMDc0NGYxNTNlZDA5XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "redemption,criminal,commando unit,commando,world war two",
    "name": "The Dirty Dozen",
    "original_info": {
        "id": "The Dirty Dozen_1967",
        "name": "The Dirty Dozen",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SgtSlaughter"
        },
        "dateCreated": "2005-03-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061578/"
        },
        "name": "Excellent WWII Action Piece and Representation of 60s Pop Culture",
        "reviewBody": "Acclaimed director Robert Aldrich (also famous to war film buffs for his rule-breaking drama, \"Attack\") twists the familiar 'unit picture' into a famous story of unexpected heroism in the midst of World War II. Instead of making his heroes clean-cut, American draftees, we're looking at the dirtiest convicts the Armed Forces has got to offer. \n\nOSS Major Reisman (Lee Marvin, \"Hell in the Pacific\") is an insubordinate Army officer who's facing a court-martial, when he's given one last chance for a reprieve: select twelve Army prisoners from a maximum-security detention center, train them for a top-secret mission behind the German lines, and then lead them into battle. If they succeed in the mission, they'll be released. For Reisman, it's a tough call, but it's his only chance to save his career. \n\nThe men he was to work with are a mixed batch, and director Aldrich packs a lot of character development into a two-and-a-half-hour movie. The most important of the \"Dirty Dozen\" is Franko, a small-time Chicago hoodlum who's facing the gallows for robbery and subsequent murder of a British civilian. It's clear from the start that Franko is a loner who thinks he's big stuff, but Reisman manages to prove that he's really all talk. More than once, he considers and even attempts escape from the remote training camp that the Dozen are forced to build  but maybe, just maybe, beneath that rebellious attitude, there's a chance for redemption. \n\nThen there are some more sympathetic types: Wladislaw (Charles Bronson, \"Battle of the Bulge\") was once a front-line infantryman who shot his platoon's medic when the medic got scared under fire and started running  Bronson says \"He took off with all the medical supplies only way to stop him was to shoot him.\" Jefferson (Jim Brown, \"Ice Station Zebra\") has been convicted for murder  his defense is he was defending himself from vicious, racist MPs who were abusing him. Wladislaw and Jefferson find themselves allied in order to get Franko on their side, because they have faith in Reisman and aren't willing to let Franko's rebellion become infectious. \n\nAlso in fine support is Clint Walker (\"None But the Brave\") as the big Navajo, Posey, who punched a man too hard for shoving him. He really didn't mean to kill him; he just doesn't like being pushed. Posey comes off as a cuddly teddy bear who'd never intentionally hurt a soul, and it's clear from the start that he's one of the good guys. Finally, Telly Savalas (\"Kelly's Heroes\") lends a hand as the psychotic, racist, religious fanatic Maggot, who believes his job is to punish the other 11 men for their \"wickedness\". His motives are never really clear; all we really know is that Maggot is somewhat unhinged and potentially dangerous. \n\nEven though Reisman and his squad don't get along, they're forced to become allied against a common enemy  the American General Staff, who want to do nothing short of shut the operation down. Aldrich again breaks the rules, making the conventionally \"good guys\" into the enemy. The Germans are barely mentioned throughout the first two acts, and only become involved for the explosive finale. The heart of this movie is anti-establishment behavior, right in the vein of the protest culture of the 60s: the good guys are the unshaven criminals, and the bad guys are the clean-cut, well-dressed Generals who come across as stupid and vain. As Colonel Everett Dasher Breed, Robert Ryan (\"Flying Leathernecks\") makes an excellent bully, a villain that the Dozen eventually unite to take action against. \n\nOnce the men have been trained and are finally cooperating and acting as a unit, it's time to set them loose on the Nazis. And still, the story doesn't become stereotypical. The mission is simple: the men will parachute into occupied France, penetrate a château being used as a rest center for high-level German officers, and kill as many of said officers as possible in a short amount of time. This operation involves stabbing defenseless women, machine-gunning prisoners, and finally, locking several dozen German officers and their mistresses in an underground bomb shelter, pouring gasoline down on them through air vents, loading said air vents with hand grenades, and then blowing up the whole place. \n\nCharacters and story aside, the film benefits from some superb editing by Michael Luciano. Director Aldrich and cinematographer Edward Scaife work hand in hand to compose every shot. The cramped, dank prison cells in the first act are utterly convincing, and the layout of the huge, magnificent German-occupied château looks, quite appropriately, like a cross between a marvelous mansion and an impregnable fortress. The battle scenes are well-choreographed, too. Never does a moment go by where we do not know where one encounter is happening in relation to what the rest of the squad is dealing with in and around the Château. Frank de Vol's sweeping score is used sparingly, and adds to both the humor and suspense of the picture. One scene, in which Donald Sutherland's character \"inspects\" a platoon of the 82nd Airborne, is set to a live orchestra's performance perfectly. \n\nWar is a really a dirty business  this isn't a movie about men playing by the rules. It's about breaking every rule in the book to get a job done, and if a few innocent bystanders get in the way, they're simply collateral damage. On a higher level, Aldrich's film reflects culture attitudes of the late 60s. Moviegoers wanted a film which encouraged breaking the rules, which showed the higher levels of the American military as deeply flawed, and made the dregs of society into the heroes of the piece. It's a cynical representation of the time it was made in, but holds up flawlessly 40 years later, in a culture which has probably been shaped by the attitudes the film reflects in every frame. \n\n10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2266873369",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjE1M2Q0MjItMjViOC00YmJlLTliNzMtMjhhNjRiNzU1NDgwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjE1M2Q0MjItMjViOC00YmJlLTliNzMtMjhhNjRiNzU1NDgwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-02T18:10:59.274Z",
        "url": "https://www.imdb.com/video/vi2266873369/"
    },
    "url": "/title/tt0061578/"
}