{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean Dominique",
            "url": "/name/nm0231608/"
        },
        {
            "@type": "Person",
            "name": "Aboudja",
            "url": "/name/nm0008886/"
        },
        {
            "@type": "Person",
            "name": "Ronald Reagan",
            "url": "/name/nm0001654/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 980,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093046/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0123742/"
        }
    ],
    "datePublished": "2004-03-31",
    "description": "The true story of Jean Dominique, a Haitian radio journalist and human rights activist.",
    "director": [
        {
            "@type": "Person",
            "name": "Jonathan Demme",
            "url": "/name/nm0001129/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA5NjUwNzU2N15BMl5BanBnXkFtZTcwMDE4NDUyMQ@@._V1_.jpg",
    "keywords": "cia central intelligence agency,timeframe 1970s,timeframe 1980s,timeframe 1990s,timeframe 2000s",
    "name": "The Agronomist",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lawprof"
        },
        "dateCreated": "2004-05-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0377031/"
        },
        "name": "A Disturbing Inside Look at the Wreckage of a Nation",
        "reviewBody": "Haitian agronomist turned civil rights activist with a perilous base, a radio station lost several times to violence, Jean Dominique paid the ultimate price for his unwavering dedication to the ideals of democracy, free speech and an open and uncensored press. He was shot dead outside his radio station, Radio Haiti, by persons still unknown but it wasn't a robbery. It was a final attempt to silence a man revered by countless thousands of his fellow Haitians, especially the poor and dispossessed.\n\nDirector Jonathan Demme provides much interview footage of Dominique in this ninety-minute documentary. His American-educated widow, Michele, (Homecoming Queen at the University of Maine, participant in the Vietnam-era Columbia riots) was also his partner in the radio station which she now runs.\n\nDominique was born into a comfortable family which in Haiti meant they either worked with the corrupt administration of the day or didn't oppose it. His father inspired nationalistic feelings in the young man who went off to France, as many well-off Haitians did and do, to study. In the interviews, his words are frequently punctuated with a sardonic laugh undoubtedly cultivated in the cafes of Paris.\n\nDominique never gave quarter to \"Papa Doc\" Duvalier, his idiot son and successor or to Aristide and the military junta that alternated with the now again deposed priest/president.\n\nArticulate and fascinating, Dominique had to know he was in mortal peril virtually every day other than the two brief exile periods in New York (where he and Michele wed). Although he both found sanctuary in America and disliked U.S. foreign policy, especially after Reagan succeeded Carter, his ideological values reflect the best ideals of this country. American involvement with and in Haiti do not.\n\nInterspersed with the interviews of Dominique and Michele are scenes of near anarchy and brutal violence in the incredibly poor country as well as shots of rituals reflecting the nativist tradition of a largely neglected rural class.\n\nI would have passed this film by but for the recommendation of a colleague who used to travel to Haiti decades ago. I'm grateful to him for an eye-opening and deeply disturbing peek into a cauldron whose temperature continues above the social and political boiling point.\n\nAt the end of the film Michele is seen broadcasting from the station reporting that her murdered husband is alive and still campaigning for the values for which he died. It's not tongue-in-cheek, it's a moving legacy to a man who states in the film that democratic ideals of freedom can't be killed. He was right but he certainly could be and he paid the price for his lifelong heroism.\n\n9/10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Agronomist Scene: Jean Dominique's Return To Haiti",
        "duration": "PT55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2177483801",
        "name": "The Agronomist Scene: Jean Dominique's Return To Haiti",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWNjMDFhMWMtMTI0MS00NGFmLWExN2QtNDVjYzc0ZGZlMGIzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWNjMDFhMWMtMTI0MS00NGFmLWExN2QtNDVjYzc0ZGZlMGIzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-03-03T19:10:03.061Z",
        "url": "https://www.imdb.com/video/vi2177483801/"
    },
    "url": "/title/tt0377031/"
}