{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kirk Douglas",
            "url": "/name/nm0000018/"
        },
        {
            "@type": "Person",
            "name": "Alex Cord",
            "url": "/name/nm0179376/"
        },
        {
            "@type": "Person",
            "name": "Irene Papas",
            "url": "/name/nm0660327/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1066,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026217/"
        },
        {
            "@type": "Person",
            "name": "Lewis John Carlino",
            "url": "/name/nm0137573/"
        }
    ],
    "datePublished": "1969-01-31",
    "description": "The son of a powerful Mafia don comes home from his army service in Vietnam and wants to lead his own life, but family tradition, intrigues and powerplays involving his older brother dictate otherwise, and he finds himself being s...",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Ritt",
            "url": "/name/nm0728688/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWU2Njg1MjMtYTI5MC00NDFkLWFlMjgtZGUwNTA1OGI3YjUxXkEyXkFqcGdeQXVyNjA5MTAzODY@._V1_.jpg",
    "keywords": "italy,palermo italy,airplane,plane landing,ringing telephone",
    "name": "The Brotherhood",
    "original_info": {
        "id": "The Brotherhood_1968",
        "name": "The Brotherhood",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2006-08-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062760/"
        },
        "name": "Keep Your Friends Close And Your Enemies Closer",
        "reviewBody": "The Brotherhood as a title has a double meaning. It's not just about that Italian fraternal order of criminals that so many films and books have been made and written about. It's about two brothers also, the Ginettas, Frank and Vince.\n\nKirk Douglas is Frank Ginetta a made man, high up in the councils and his younger brother Vince played by Alex Cord who's just back from the Army like Michael Corleone was. But Michael married an outsider while Vince Ginetta is marrying the daughter of another Mafia capo, Luther Adler.\n\nThough he's younger than Adler, Douglas is a guy who likes to do things the old fashioned way, the way his dad who was a button man back in the day did them. He also loves hanging around with the ancient survivors of the old Mafia wars among them Eduardo Ciannelli. Adler and Douglas get to be at loggerheads over Cord and the role he should take in the business. \n\nThe old guys learn something and give Douglas a contract that's going to cause him considerable problems, personal and organizational. What's a good Mafia guy to do when you get a contract. Then Alex Cord is given a contract to make his bones so to speak.\n\nThe main difference between the Godfather films and this is that the Brotherhood is set in the present, whereas the Godfather films are rooted in the past. By 1968 organized crime at the highest levels was hardly an Italian only concern. You don't see hardly any non-Italians in the first Godfather film and in the second the alliance is pretty wary. The non-Italians dominate the high councils in New York, Val Avery, Alan Hewitt and Murray Hamilton together with Luther Adler outvote Douglas all the time.\n\nMartin Ritt shot a whole lot of this film in New York and many of the sites are recognizable to a native New Yorker. Still it's not one of his better films and it took Francis Ford Coppola to do the modern gangster film right.\n\nOne thing though, Douglas certainly did NOT heed Vito Corleone's advice about keeping your friends close and your enemies closer. Not that the higher ups wouldn't have found out at some point anyway, but when you watch The Brotherhood you'll know that Douglas was the obvious suspect when he makes that fateful hit.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0062760/"
}