{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sophia Loren",
            "url": "/name/nm0000047/"
        },
        {
            "@type": "Person",
            "name": "Richard Harris",
            "url": "/name/nm0001321/"
        },
        {
            "@type": "Person",
            "name": "Martin Sheen",
            "url": "/name/nm0000640/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9309,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103475/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0179289/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037641/"
        },
        {
            "@type": "Person",
            "name": "Robert Katz",
            "url": "/name/nm0441828/"
        },
        {
            "@type": "Person",
            "name": "George P. Cosmatos",
            "url": "/name/nm0181902/"
        },
        {
            "@type": "Person",
            "name": "Tom Mankiewicz",
            "url": "/name/nm0542539/"
        }
    ],
    "datePublished": "1977-02-09",
    "description": "Passengers on a European train have been exposed to a deadly disease. Nobody will let them off the train. So what happens next?",
    "director": [
        {
            "@type": "Person",
            "name": "George P. Cosmatos",
            "url": "/name/nm0181902/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWNkYjhhNzUtMzBiYi00OWE2LTgxMDUtYzdjMDcxZTEyODUzXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "race against time,disease,bridge collapse,train derailment,shootout",
    "name": "The Cassandra Crossing",
    "original_info": {
        "id": "The Cassandra Crossing_1976",
        "name": "The Cassandra Crossing",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Katz5"
        },
        "dateCreated": "2021-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0074292/"
        },
        "name": "One of the grittier '70s disaster flicks",
        "reviewBody": "Ah, the disaster films of the 1970s......every natural (and some man-made) disaster had its movie. Earthquakes, fires, tidal waves, floods (courtesy of a made-for-TV movie simply called Flood!), volcanoes, hurricanes, doomed airliners, ships, bombings, subway hijacks......the one hold out was tornadoes, but that was remedied two decades later in 1996. The disaster movies that remain somewhat relevant in the 21st century are actually the ones involving terrorists, hijacking, snipers, and bomb plots--movies like Rollercoaster, Black Sunday, Juggernaut, Two-Minute Warning, The Taking of Pelham 1, 2, 3, and The Cassandra Crossing. But as the case with other (more \"escapist fare\") disaster movies, the checklist applies. Ensemble, all-star (for the time) casts: Check. Generous running time, usually over two hours: Check. Multiple plot lines: Check. Impressive special effects (created the old-fashioned way, before CGI--models): Check. O. J. Simpson: Check. An actor from Hollywood's golden era (usually William Holden, Charlton Heston, or Burt Lancaster): Check.\n\nIn The Cassandra Crossing, the terrorists who kick off the plot are actually ecoterrorists, who attempt to to blow up a WHO-like organization in Geneva. They fail, but end up being exposed to a deadly virus, and one of them winds up on a trans-Europe train. The virus spreads and the military and other officials decide the best way to contain the outbreak is to re-route the train to a decrepit bridge in Poland, likely to collapse once the train passes over it, and the authorities can then blame the tragedy on the defective bridge. And this being a '70s disaster movie, expect multiple storylines based on the eccentrics on the train.\n\nGeorge P. Cosmatos, who would later direct Sly Stallone in two big hits (Rambo: First Blood Part II in 1985 and Cobra a year later), as well as the lesser-known underwater disaster film Leviathan, skillfully directs the proceedings and maintains tension throughout as we see the train hurtling toward its doom. Cosmatos also includes several effective images of the dangerous bridge taken from various angles - the audience realizes there is no way in hell the train could make it across this thing. The climax is graphic, slapping this movie with an R-rating; also somewhat unusual in that most '70s disaster movies got PGs (exceptions being the equally gritty Taking of Pelham 1,2,3, Two-Minute Warning, and Black Sunday).\n\nYou never turn to a disaster movie for heavy intellectualism, but this one is definitely one of the better and more timeless examples of the subgenre.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0074292/"
}