{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leni Riefenstahl",
            "url": "/name/nm0726166/"
        },
        {
            "@type": "Person",
            "name": "Marlene Dietrich",
            "url": "/name/nm0000017/"
        },
        {
            "@type": "Person",
            "name": "Arnold Fanck",
            "url": "/name/nm0266691/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2983,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "alternateName": "The Wonderful, Horrible Life of Leni Riefenstahl",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014456/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0712800/"
        },
        {
            "@type": "Person",
            "name": "Ray Müller",
            "url": "/name/nm0618284/"
        }
    ],
    "datePublished": "1994-06-06",
    "description": "A documentary about the life and work of Leni Riefenstahl, a German film director most notorious for making the most effective propaganda films for the Nazis.",
    "director": [
        {
            "@type": "Person",
            "name": "Ray Müller",
            "url": "/name/nm0618284/"
        }
    ],
    "duration": "PT3H3M",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTZhMDI4YTQtMTNlNS00NWZjLTkwOWEtMGExMTk1NDc4MGU1XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "film director as character,female film director as character,female film director,woman director,reference to leni riefenstahl",
    "name": "Die Macht der Bilder: Leni Riefenstahl",
    "original_info": {
        "id": "The Wonderful_1993",
        "name": "The Wonderful",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bramptonbryan"
        },
        "dateCreated": "2008-03-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0107472/"
        },
        "name": "Riefenstahl and Eisenstein",
        "reviewBody": ">>>> \"Why is Leni Riefenstahl, who created propaganda for the murderous Hitler (\"Olympia\" -- which pioneered many of the techniques now cliché in sports camera-work and editing, and the notorious \"Triumph of the Will\"), despised and reviled while the work of Eisenstein and others who created propaganda for the murderous Stalin is lovingly taught in film schools?\" \n\nRiefenstahl was a brilliant technical innovator, whose status among the top film-makers of the century has never been challenged. I would be very surprised if film schools ignore her work.\n\nOn the other hand, she has lied and lied again about her relationship with the Nazis. For example, she has claimed that she met after the war all the Roma and Sinti prisoners whom she used as extras. They were sent to Auschwitz after she had finished with them. She has tried to persuade us that she was a naive ingenue who knew nothing about Nazism and who was horrified that her films were used as propaganda.\n\nEisenstein was an unapologetic believer in communism, although of a very different kind from that of Stalin. His relations with the regime were extremely difficult after Stalin took power, because of his politics, his artistic techniques and the amount of time he spent abroad. He was forced to write self-denunciations for his deviations from party orthodoxy. Of the five films he made in Russia during the last 20 years of his life, two were banned and two were destroyed.\n\nHis films are marred at points by traces of immediate political concerns, as when he hints in \"The Battleship Potemkin\" (1925), set in 1905, at the \"petty-bourgeois individualism\" of some Kronstadt sailors, to justify the slaughter of the Kronstadt soviet in 1921. Nevertheless, several of his films are clearly great achievements, despite all the censorship he had to endure.\n\nAs for other film-makers who were propagandists for the Soviet Union, as opposed to Russians who made films, such as Mikhail Romm and his pupils, the obvious examples are the documentarists Karmen and Vertov. Karmen is hardly known in the English-speaking world. Vertov is much better known, as a technical innovator and theoretician of film, but his career was destroyed by the rise of \"socialist realism\".\n\nEisenstein was never a propagandist for Stalin in the way that Riefenstahl was for Hitler, and the visibility of other Stalinists is decidedly limited. Of course, one could decide that every unpurged Russian director was a Stalinist, or every unpurged American director was a McCarthyite."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Kino International",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1098422809",
        "name": "The Wonderful, Horrible Life of Leni Riefenstahl",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmMzZDQwNzItYjZkNS00OGI1LTg3N2YtZjA2MmM5ZmJkOTBhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmMzZDQwNzItYjZkNS00OGI1LTg3N2YtZjA2MmM5ZmJkOTBhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-02-11T06:45:32Z",
        "url": "https://www.imdb.com/video/vi1098422809/"
    },
    "url": "/title/tt0107472/"
}