{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leslie Cheung",
            "url": "/name/nm0002000/"
        },
        {
            "@type": "Person",
            "name": "Chien-Lien Wu",
            "url": "/name/nm0943072/"
        },
        {
            "@type": "Person",
            "name": "Xiaolin Geng",
            "url": "/name/nm5317597/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 854,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "The Phantom Lover",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039100/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0350017/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0239007/"
        },
        {
            "@type": "Person",
            "name": "Gaston Leroux",
            "url": "/name/nm0503693/"
        },
        {
            "@type": "Person",
            "name": "Roy Szeto",
            "url": "/name/nm0844036/"
        },
        {
            "@type": "Person",
            "name": "Raymond Pak-Ming Wong",
            "url": "/name/nm2260417/"
        }
    ],
    "datePublished": "1995-07-22",
    "description": "In 1930's China, an opera troupe arrives at an abandoned theater, haunted by the spectral figure of it's previous owner - a once great opera singer - who now seeks to turn the company's young leading men into a great star like him...",
    "director": [
        {
            "@type": "Person",
            "name": "Ronny Yu",
            "url": "/name/nm0950553/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3ODMwOTk1MV5BMl5BanBnXkFtZTcwNzU1MDIyMQ@@._V1_.jpg",
    "keywords": "blindness,song,slow motion,lifting female in air,lifting someone into the air",
    "name": "Ye ban ge sheng",
    "original_info": {
        "id": "The Phantom Lover_1995",
        "name": "The Phantom Lover",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Libretio"
        },
        "dateCreated": "2005-03-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115016/"
        },
        "name": "Magnificent, absolutely magnificent",
        "reviewBody": "THE PHANTOM LOVER (Ye Ban Ge Sheng)\n\nAspect ratio: 2.39:1 (Panavision)\n\nSound format: DTS\n\nChina, 1936: An impoverished acting troupe restores a ruined theatre with the help of a mysterious figure who haunts the backstage area, reopening old conflicts with local villains who want the theatre to remain closed forever.\n\nThe late and much-lamented teen idol Leslie Cheung toplines Ronny Yu's superb Gothic melodrama, a uniquely Chinese reinterpretation of Gaston Leroux's 'The Phantom of the Opera'. Cheung plays a famed actor in 1920's China whose affair with the daughter (Jacklyn Wu) of a scheming industrialist is opposed by their respective families, culminating in a terrible disaster that consumes the magnificent theatre in which Cheung made his fortune. Ten years later, an impoverished theatre troupe restores the now-derelict building, and the principal actor (Huang Lei, from Chen Kaige's LIFE ON A STRING) finds Cheung living amongst the ruins, a phantom-like recluse who hides his disfigured face from the world which once adored him. But the villainous factions which drove the ill-fated lovers apart are still active, and history begins to repeat itself, with potentially tragic consequences...\n\nTHE PHANTOM LOVER ranks alongside John Woo's BULLET IN THE HEAD (1990) as one of the crowning achievements of Hong Kong cinema. With spectacular Gothic sets designed by the late Eddie Ma and swooping camera-work by world-class cinematographer Peter Pau (whose expansive images demonstrate the full potential of the wide Panavision frame), this sublime masterpiece represents a sensational marriage of old-fashioned storytelling and cinematic technique. The fast-moving narrative is heightened by director Yu's operatic film-making style, a style he perfected two years earlier in the acclaimed fantasy THE BRIDE WITH WHITE HAIR (1993), providing a near-perfect synthesis of plot, characterization and technical virtuosity. The script (by Roy Szeto, Raymond Wong and director Yu) is essentially a reworking of SONG OF MIDNIGHT (1937), an early effort by pioneering Chinese horrormeister Ma-xu Weibang, though Yu's film emphasizes atmosphere and melodrama over outright horror, and the film's central section - the heartbreaking disintegration of Cheung's relationship with Wu - is played to perfection by an attractive cast, underscored by Chris Babida's melancholy score. The only false note is sounded by Cheung's contribution to the soundtrack, a handful of feeble songs which fail to convey an appropriate sense of heartache and tragedy. Otherwise, this is the best adaptation of Leroux's novel to date, a shining example of Pure Cinema. Original title: YAU BOON GOH SING (Cantonese) or YE BAN GE SHENG (Mandarin).\n\nNB. The film was recorded in sync-sound (a rarity for HK movies at the time) with the actors speaking Mandarin, but it was dubbed into Cantonese for domestic theatrical release. However, most DVD versions contain the original soundtrack, along with its dubbed alternative.\n\n(Mandarin dialogue)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0115016/"
}