{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "David Duchovny",
            "url": "/name/nm0000141/"
        },
        {
            "@type": "Person",
            "name": "Gillian Anderson",
            "url": "/name/nm0000096/"
        },
        {
            "@type": "Person",
            "name": "Billy Connolly",
            "url": "/name/nm0175262/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 92400,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078377/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0241738/"
        },
        {
            "@type": "Person",
            "name": "Frank Spotnitz",
            "url": "/name/nm0819487/"
        },
        {
            "@type": "Person",
            "name": "Chris Carter",
            "url": "/name/nm0004810/"
        }
    ],
    "datePublished": "2008-07-25",
    "description": "Mulder and Scully are called back to duty by the FBI when a former priest claims to be receiving psychic visions pertaining to a kidnapped agent.",
    "director": [
        {
            "@type": "Person",
            "name": "Chris Carter",
            "url": "/name/nm0004810/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Crime",
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTk5MThhOTQtZTY5OC00MzgwLWE4MTctNTI4OGEwNjU3YTZjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "x files,fbi federal bureau of investigation,crossover,motor vehicle,car",
    "name": "The X Files: I Want to Believe",
    "original_info": {
        "id": "The X-Files: Season 2_2000",
        "name": "The X-Files: Season 2",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "scott-sw"
        },
        "dateCreated": "2008-07-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0443701/"
        },
        "name": "Good movie.",
        "reviewBody": "There is a difference in reviewing bad film-making as opposed to personal taste. Frankly, I argue this movie more from personal taste, although X-Files - I Want to Believe is certainly not bad film-making. In all honesty, I was very nervous about X-Files I Want to Believe. Ever since Star Wars the Phantom Menace, I have learned to lower my expectations when venturing into Hollywood movies (although lowering your expectations to nothing could not save the Star Wars Prequels). Nothing is worse than a huge let-down. Indiana Jones and the Crystal Skull comes to mind the quickest. With X-Files, I Want to Believe, I went in with no expectations whatsoever and was thoroughly entertained. It made me pine for the old television series I loved to watch in the 1990's (at least until Seasons 8 and 9). Dr. Dana Scully is working at a Catholic Hospital, fighting for a young boy who has little to no chance of surviving. She pushes herself hard, not giving up hope in the wake of despair. She fights for Alexander (the son she lost in the television series). The FBI comes to her, asking for help in tracking down Fox Mulder. They want his help in a baffling case. An FBI agent has disappeared. The only link is an unusual psychic. Not only does he have scant visions, he also is pedophile priest under house arrest. Of course, Mulder wants to believe this man. Scully, however, does not. This not only stems from her usual scientific mind, but also her moral outrage at his crimes. As this psychic leads them to various clues, a case slowly uncovers. Some strange, bizarre, twisted scheme of harvesting organs for nefarious purposes arises. Mulder of course ventures closer, putting himself in peril. Scully, balks, wondering if she can continue in Mulder's dark world. Believe it or not, this one works. In fact, I liked it better than Fight the Future. While Fight the Future was inserted in the ongoing mythology of government conspiracies and alien extra-terrestrials, this one works more as a stand-alone movie, much like the episodes of the same flavor. I admit I liked the latter episodes better. So for the X-Philes who liked the conspiracy episodes better, you may want to stick to Fight the Future. That gets me to wonder if this movie will find new fans for the 15-year-old franchise, or only appeal to X-Philes. Only time can tell on that one. What makes this work for me, though, is that it is in the spirit of the original television series. It does not rely on paranoid delusions, government conspiracies, and alien extra-terrestrials. Instead, it relies more on a potentially dangerous and real situation with surrealism in the background. Just like some of the stand-alone episodes of X-Files, the outcome is not predictable. Also, by the end, the surrealism takes a back-seat to the suspense of catching the antagonists. It also unfolds slowly, not giving us a full glimpse into the nefarious plot finally revealed in the end. Just like the series, the antagonists goal is evil and eerie--pushing the envelope of imagination and fear. Just like the series, the plot is also based on real fringe scientific experiments. Both the movie, and the reality sent a shiver up my spine (by the way, leave the kids at home on this one. Kids younger than 11 or 10 might get some nightmares.) This paves the way for one thing X-Files television series did well: lacing messages of philosophy, religious allegory, and faith. Some of the best stuff comes when Fox and Dana converse with each other. Scully fears being with Mulder because his world brings around so much darkness, and she fears that. She also doubts her own faith. Mulder must ask himself questions in regards to his relentless search of the \"truth.\" Another warning must go out that this movie is not an action movie. It works more like a thriller and a suspense movie instead of lacing itself with shootouts,car chases, and outlandish stunts. It also is not scary, but rather suspenseful. I think if Cris Carter were a better director, it might have found a little more suspense, and possibly a little more fright. That being said, I still think this movie works--at least for me.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The X-Files: I Want To Believe (Reading The Script Exclusive)",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3535979545",
        "name": "The X-Files: I Want To Believe (Reading The Script Exclusive)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWI1Y2IwYmYtN2EzZi00Y2JlLTg1YmItNzZmNTlhNjg3NWJiXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWI1Y2IwYmYtN2EzZi00Y2JlLTg1YmItNzZmNTlhNjg3NWJiXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-03-03T19:07:11.576Z",
        "url": "https://www.imdb.com/video/vi3535979545/"
    },
    "url": "/title/tt0443701/"
}