{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeremy Brett",
            "url": "/name/nm0107950/"
        },
        {
            "@type": "Person",
            "name": "Edward Hardwicke",
            "url": "/name/nm0362570/"
        },
        {
            "@type": "Person",
            "name": "Rosalie Williams",
            "url": "/name/nm0769315/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12604,
        "ratingValue": 8.7,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103289/"
        },
        {
            "@type": "Person",
            "name": "John Hawkesworth",
            "url": "/name/nm0370058/"
        }
    ],
    "datePublished": "1987-02-05",
    "description": "Sherlock Holmes and Dr Watson solve the mysteries of the devil's foot, Silver Blaze, Wisteria Lodge and the Bruce-Partington Plans.",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjM1OTc0MjMtZjFmOS00ZmQ0LTk1ZWItM2U1YTc5ODZjZjI3XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg",
    "keywords": "sherlock holmes character,dr. john watson character,timeframe 19th century,five word title,detective",
    "name": "The Return of Sherlock Holmes",
    "original_info": {
        "id": "The Return of Sherlock Holmes_1986",
        "name": "The Return of Sherlock Holmes",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Filmtribute"
        },
        "dateCreated": "2001-04-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090509/"
        },
        "name": "Excellent interpretation of Conan Doyle's Sherlock Holmes",
        "reviewBody": "In this Granada TV Series, Jeremy Brett presented us with, in my view, the definitive portrayal of Sherlock Holmes. The attention to detail was superb with an interpretation far closer to Sir Arthur Conan Doyle's creation than previously shown on film by the deerstalkered Basil Rathbone et al. Jeremy Brett's wild, haunted and melancholy performance of the second series in 1985 was, by his own admission, heavily influenced through the personal tragedy of the loss of his wife to cancer. He adapted the role somewhat for the return series and managed to introduce some levity, even though he found it difficult to play a character who was all mind and no heart.\n\nDavid Burke and his successor Edward Hardwicke (who took on the role in the third series: `The Return of Sherlock Holmes') both gave intelligent performances as Dr John Watson. Jeremy Brett and Edward Hardwicke made an exceptionally good team and brought the relationship alive with a believable friendship more than any previous characterisations had done.\n\nThe series combined fine period detail and atmosphere to create a very credible late 19th century London, and the dialogue replicated the novels fairly closely although production necessities altered some aspects of the stories.\n\nHowever, the Granada TV series' storyline adaptations and format may have removed some of the exploration into the incisive detective skills of Conan Doyle's Sherlock Holmes, and the series became sanitised with the playing down of both of Holmes' addictions to cocaine and atrocious violin scratching.\n\nThe problem may lie in actually dramatising the novels, as Jeremy Brett observed, they are better read, and he described performing the action of crawling through the bracken like a golden retriever as `hysterically funny'. The concept of the images being better seen in the mind's eye would explain why the excellent BBC radio productions of the 1990's with Clive Merrison and Michael Williams worked so well.\n\nThe choice of guest actors was consistently of a high standard and I remember The Abbey Grange' in particular as it provided a personal treat to see Anne Louise Lambert (Picnic at Hanging Rock) display her unique talents in a sadly all too rare role for her. Congratulations are due to the director (Peter Hammond) on an inspired piece of casting.\n\nThe exclusive video rights in the UK for the Granada TV series have passed from VCI to Britannia Music so that membership is necessary to obtain copies of the videos in PAL format."
    },
    "url": "/title/tt0090509/"
}