{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sterling Hayden",
            "url": "/name/nm0001330/"
        },
        {
            "@type": "Person",
            "name": "Louis Calhern",
            "url": "/name/nm0129894/"
        },
        {
            "@type": "Person",
            "name": "Jean Hagen",
            "url": "/name/nm0353405/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28289,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Ben Maddow",
            "url": "/name/nm0534693/"
        },
        {
            "@type": "Person",
            "name": "John Huston",
            "url": "/name/nm0001379/"
        },
        {
            "@type": "Person",
            "name": "W.R. Burnett",
            "url": "/name/nm0122446/"
        }
    ],
    "datePublished": "1950-05-12",
    "description": "A major heist goes off as planned, but then double crosses, bad luck and solid police work cause everything to unravel.",
    "director": [
        {
            "@type": "Person",
            "name": "John Huston",
            "url": "/name/nm0001379/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWYxNWZjZmEtOTk1Ny00ZWE0LWI1YjAtZmQ0ZjM4OGUwNmJjXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "jewel heist,fatal wound,gunshot wound,planning a robbery,jewel robbery",
    "name": "The Asphalt Jungle",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2010-08-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0042208/"
        },
        "name": "Experience has taught me never to trust a policeman. Just when you think one's all right, he turns legit.",
        "reviewBody": "Out of MGM, The Asphalt Jungle is directed by John Huston and based on the novel of the same name by W.R. Burnett. It stars Sterling Hayden, Jean Hagen, Sam Jaffe, Louis Calhern, James Whitmore, Teresa Celli, and in a minor but important role, Marilyn Monroe. Miklós Rózsa scores the music and Harold Rosson photographs it in black & white. Plot sees Erwin \"Doc\" Riedenschneider (Jaffe) leave prison and quickly assemble a gang to execute a long in gestation jewellery heist. However, with suspicion rife and fate waiting to take a hand, the carefully constructed caper starts to come apart at the seams.\n\nJohn Huston liked a tough movie, having given film noir in America a jump start with The Maltese Falcon in 1941, he also that same year adapted W.R. Burnett's novel High Sierra. Burnett also had on his CV crime classic stories Little Caesar & Scarface, so it's no surprise that Huston was drawn to The Asphalt Jungle. As it turned out, it was a match made in gritty urban heaven.\n\nThe Asphalt Jungle was one of the first crime films to break with convention and tell the story from the actual side of the criminals. Where once it was the pursuing law officers or private detectives that were the heavy part of the plotting, now under Huston's crafty guidance we have a study in crime and a daring for us to empathise with a bunch of criminals, villains and anti-heroes. As a group the gang consists of very differing characters, and yet they have a common bond, for they each strive for a better life. Be it Hayden's luggish Dix, who dreams of buying back his father's horse ranch back in Kentucky, or Jaffe's Doc, who wants to retire to Mexico and surround himself with girls - it's greed and yearning that binds them all together - With alienation and bleakness, in true film noir traditions, featuring heavily as the plot (and gang) unravels.\n\nWith gritty dialogue and atmospherically oozing a naturalistic feel, it's also no surprise to note that Huston's movie would go on to influence a ream of similar type films. Some good, some bad, but very few of them have been able to capture the suspense that is wrung out for the actual heist sequence in this. Fabulous in its authenticity, and with that out of the way, it then sets the decaying tone for the rest of the piece. Interesting to note that although we are now firmly in the lives of the \"gang\", including their respective women (Hagen, Monroe & Celli all shining in what is a very macho movie), we still know that the society outside of their circle is hardly nice either! This is stripped down brutalistic film noir. Merciless to its characters and thriving on ill fate, and closing with a finale that is as perfect as it gets, this is a top line entry in what is the most wonderful of film making styles. 9.5/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3478765337",
        "name": "The Asphalt Jungle",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWFiNGI4MmEtNWQyOS00YmI5LTgzMzAtMzFiNmViMDljNjgxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWFiNGI4MmEtNWQyOS00YmI5LTgzMzAtMzFiNmViMDljNjgxXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-04T17:04:48.657Z",
        "url": "https://www.imdb.com/video/vi3478765337/"
    },
    "url": "/title/tt0042208/"
}