{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daphne",
            "url": "/name/nm4218380/"
        },
        {
            "@type": "Person",
            "name": "Reanna",
            "url": "/name/nm4217767/"
        },
        {
            "@type": "Person",
            "name": "Gina",
            "url": "/name/nm4217904/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1288,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022229/"
        }
    ],
    "datePublished": "1998-09-23",
    "description": "Documentary about a multiple murder in rural Nebraska in 1993.",
    "director": [
        {
            "@type": "Person",
            "name": "Susan Muska",
            "url": "/name/nm0615767/"
        },
        {
            "@type": "Person",
            "name": "Gréta Olafsdóttir",
            "url": "/name/nm0645880/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Documentary",
        "Biography"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDgyNjQ0MzQtNDZlZS00MTY0LWJjYTYtMTI4MmFmMjkwNzg3XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "homophobia,trans man,transphobia,murder,transgender",
    "name": "The Brandon Teena Story",
    "original_info": {
        "id": "The Brandon Teena Story_1998",
        "name": "The Brandon Teena Story",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tankgrrrl13"
        },
        "dateCreated": "2008-11-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0144801/"
        },
        "name": "Reply to \"rot in hell\" post",
        "reviewBody": "Just a note of clarification. Brandon, did not lie about his gender. Brandon lived his short troubled life trying to express his gender the way he saw it and wanted others to see it. What he did however cover up was the truth of his biological sex. I tend to agree that full disclosure of these facts to his sexual partners would have been just. However, people are often not understanding of issues of gender nonconformity. Nor, have many people been equipped with the language, self-understanding, support, safe-space, and confidence to speak about these things without fear of being met with fear, ignorance and hatred. \n\nOur society has a strictly enforced binary gender system that is extraordinarily hard on those who do not conform. This is so entrenched in the sub-conscious of most everyone from such an early age that sometimes it seems that only those of us who do not fit in that system know that it is there and has been constructed by a society built on easy answers and small thinking that limits so many of us in numerous ways. It is so ingrained in people to believe that woman = feminine / man = masculine and all the stereotypes and behaviors that go with these two choices that they think these unwritten (and sometimes written) rules are natural. Therefore those who do not, nay, cannot play by these rules are unnatural, sick, sinful .. etc. So while I was disgusted by the behavior of the local authorities (including the civil court judge) I was not shocked. Serious deep changes need to be made to the way we as the human race see sex and gender or this type of appalling hatred will continue.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0144801/"
}