{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gregory Peck",
            "url": "/name/nm0000060/"
        },
        {
            "@type": "Person",
            "name": "Christopher Plummer",
            "url": "/name/nm0001626/"
        },
        {
            "@type": "Person",
            "name": "John Gielgud",
            "url": "/name/nm0000024/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3368,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106082/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035035/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033098/"
        },
        {
            "@type": "Person",
            "name": "J.P. Gallagher",
            "url": "/name/nm0302391/"
        },
        {
            "@type": "Person",
            "name": "David Butler",
            "url": "/name/nm0124878/"
        }
    ],
    "datePublished": "1983-02-02",
    "description": "Vatican efforts, led by Monsignor Hugh O'Flaherty, to save Allied P.O.W.s and downed Allied airmen as the Nazis invade Rome.",
    "director": [
        {
            "@type": "Person",
            "name": "Jerry London",
            "url": "/name/nm0518719/"
        }
    ],
    "duration": "PT2H23M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyNzUzMDYxMV5BMl5BanBnXkFtZTcwMDg4MjAzMQ@@._V1_.jpg",
    "keywords": "based on real person,hero,20th century,1940s,italy",
    "name": "The Scarlet and the Black",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vaughan-birbeck"
        },
        "dateCreated": "2005-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086251/"
        },
        "name": "Inspiring true-life adventure",
        "reviewBody": "I tuned to this by accident one evening on TV when it seemed there was nothing else worth watching and it grabbed my attention for over two hours.\n\nThis is the true story of a man whose conscience will not let him stand by while the world goes to hell around him. Gregory Peck plays an O'Flaherty whose quaint 'Oirish' charm hides a cunning and resourceful leader who has to balance the demands of his conscience with his role as an official in the Vatican government. \n\nPope Pius makes it clear he understands O'Flaherty's motivation while warning him that if he is arrested, the Pope will not compromise Vatican neutrality to save him. The film does its best to restore Pius XII's reputation - he has been called \"Hitler's Pope\" - but it is unclear how much he knew of, or even condoned, O'Flaherty's activities. O'Flaherty cannot compromise, and continues with his work despite the Gestapo having orders to shoot him on sight if he is found outside the Vatican, and suffering a failed assassination attempt in St Peter's itself. \n\nChristopher Plummer is always worth watching and his performance here is no exception. Shown first as an arrogant man who feels the Nazis now \"own Rome... it's ours\", we later see that Kappler is at the mercy of this ruthless regime even as he plays his part in it. Finally the only person he can turn to is his arch-enemy from the Vatican. This is a fairly conventional irony, but during the course of the film Plummer also suggests how Kappler is losing his soul to his inhuman work, becoming isolated from his family as he begins to loathe what he is doing. You feel Kappler hates O'Flaherty not simply because of what he does, but because O'Flaherty represents the better part of himself.\n\nI would give the film more stars but it is about 15 minutes too long and becomes rather episodic towards the end. However, it's a great story, well-acted by a strong cast, and can be viewed and enjoyed many times.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0086251/"
}