{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Peppard",
            "url": "/name/nm0000577/"
        },
        {
            "@type": "Person",
            "name": "Alan Ladd",
            "url": "/name/nm0000042/"
        },
        {
            "@type": "Person",
            "name": "Robert Cummings",
            "url": "/name/nm0191950/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2352,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066648/"
        },
        {
            "@type": "Person",
            "name": "Harold Robbins",
            "url": "/name/nm0730356/"
        },
        {
            "@type": "Person",
            "name": "John Michael Hayes",
            "url": "/name/nm0371088/"
        }
    ],
    "datePublished": "1964-10-21",
    "description": "Jonas Cord is a disagreeable young tycoon who's building planes, directing films, and catting around on the corporate make in 1930s Hollywood.",
    "director": [
        {
            "@type": "Person",
            "name": "Edward Dmytryk",
            "url": "/name/nm0229424/"
        }
    ],
    "duration": "PT2H30M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmZiYzNlMDAtZDVjMS00NTFkLWJhM2ItZmFlYjI2OTgxMDI1XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "tycoon,hollywood,movie producer,showbiz,based on novel",
    "name": "The Carpetbaggers",
    "original_info": {
        "id": "The Carpetbaggers_1964",
        "name": "The Carpetbaggers",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Poseidon-3"
        },
        "dateCreated": "2004-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057917/"
        },
        "name": "Leaves one (carpet)begging for more.",
        "reviewBody": "When a film is based on a Harold Robbin's novel, it's pretty clear that the story isn't going to be about Amish furniture building or love among the hollyhocks. His brand of fiction is usually racy, tawdry and more than a little tasteless, yet readers lap it up, page after page, book after book and moviegoers have lapped at several films based on his work. Unfortunately, since it was 1964, not all the dirt hits the screen this time around. Peppard is the ne'er do well son of a chemical company president who, when his father drops dead in mid tongue-lashing, proceeds to boss everyone around and acquire, acquire, acquire! He doesn't just accumulate businesses and wealth, he also likes to collect women, starting with his own step-mother (Baker) a girl he dated prior to her defection to his father. He marries a sassy young flapper (Ashley), but soon enough is neglecting her, turning her into a clinging nag. He becomes involved in the aeronautics industry and the movie business as well, all the time burning out the men and women around him who do most of the dirty work. Eventually, it takes a wake up call or two to make him see what he's become, but it may be too late for him to change. Peppard gives a very one-note performance. He is great at the forceful, demanding and cold-hearted aspects of the character, but offers no warmth or buried kindness that can allow the audience to care what happens to him. (As the film progresses, he is outfitted with ridiculously made up eyebrows that give him an extra-fiendish look!) Ashley is extremely attractive in a variety of Edith Head concoctions and is the epitome of patience as she lives through Peppard's humiliations. Baker also looks smashing in a wide array of Head's silk robes and slinky evening dresses. Both women have incredibly distinct voices and deliver quite a few amusing and/or suggestive lines of dialogue in their own special way. Several solid and professional actors give decent portrayals as well. Erickson is appropriately tough and overbearing as Peppard's father, Ayres is low-key, but effective, as Peppard's put-upon attorney and Cummings is deliciously slick and sneaky as an opportunistic talent agent. Other good work comes from Ladd as a friendly father figure with a past, Balsam as a cocky studio head, Hyer as a hooker-turned-movie star and Totter as a kindly prostitute. The whole film is lavishly appointed, beautifully scored and full of eye-popping sets, costumes, cars and furnishings. What's ostensibly bad about the film (the tacky storyline, the tart, suggestive dialogue, the unbelievability of the situations) now makes it that much better for an audience that delights in flashy, showy Hollywood cheese. If it had been made only a couple of years later, it could have really been a whopping piece of sexploitation. As it stands, it's more of a tease than anything, but it holds definite rewards for those in the mood. Ladd (who clearly shows the ravages of drink and drugs in this film) would be dead of an overdose within a year. Ashley (who later married Peppard in real life) soon gave up her promising start for about 5 years and never really regained her momentum entirely."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi990232089",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTUwYzdhMDgtYTc1Ni00Y2I1LTlkZDQtYTJmNTllYWJiOTEwXkEyXkFqcGdeQWdhbWF6b2E@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTUwYzdhMDgtYTc1Ni00Y2I1LTlkZDQtYTJmNTllYWJiOTEwXkEyXkFqcGdeQWdhbWF6b2E@._V1_.jpg",
        "uploadDate": "2020-07-08T14:17:39.678Z",
        "url": "https://www.imdb.com/video/vi990232089/"
    },
    "url": "/title/tt0057917/"
}