{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Kaufman",
            "url": "/name/nm0001412/"
        },
        {
            "@type": "Person",
            "name": "Elayne Boosler",
            "url": "/name/nm0095607/"
        },
        {
            "@type": "Person",
            "name": "Jim Brady",
            "url": "/name/nm2932043/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 126,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Person",
            "name": "Andy Kaufman",
            "url": "/name/nm0001412/"
        },
        {
            "@type": "Person",
            "name": "Bob Zmuda",
            "url": "/name/nm0957474/"
        }
    ],
    "datePublished": "1983-07-15",
    "description": "Andy Kaufman interviews guests and performs skits in his own absurd fashion.",
    "director": [
        {
            "@type": "Person",
            "name": "Dick Carter",
            "url": "/name/nm1236900/"
        }
    ],
    "duration": "PT58M",
    "genre": [
        "Comedy",
        "Music",
        "Talk-Show"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAwNTViOWItZDNjZC00NDdlLWEyZGUtOWE4NDIxZTk3ZTU5XkEyXkFqcGdeQXVyMTgwOTE5NDk@._V1_.jpg",
    "keywords": "parody comedy,interview,guest,variety show,tv special",
    "name": "The Andy Kaufman Show",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "redryan64"
        },
        "dateCreated": "2015-05-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1179022/"
        },
        "name": "What are we watching?",
        "reviewBody": "ONCE AGAIN WE the public are charged with doing the impossible; that being, trying to classify some film that is truly unique and singularly in its own \"category.\" In this case we are not referring to CITIZEN KANE; but rather to this odd little bit of video known as THE ANDY KAUFMAN SHOW.\n\nWE STUMBLED ONTO this video-taped funny bone tickler quite by accident. We had some of the family over for one of the girls' birthday party and we did some channel surfing (even though the term was as of then unknown to us). So here was Andy Kaufman coming on the screen in total hysterics with his \"guest\". Inasmuch as the voice over by Chicago TV personality, Marty Robinson, stated: \"We now join THE ANDY KAUGFMAN SHOW already in progress\", we knew nothing of what was transpiring.\n\nAS IT TURNED out, the \"show\" was a sham, a sort of fraudulent come on and attention grabber for this one shot film. The confusion and unfamiliar events that were obviously in progress before we \"arrived\" (or were they) were part of a far bigger gag.\n\nTHE WORLD WAS already familiar with Mr. Kaufman's antics from his appearances on such network venues as Saturday NIGHT LIVE, VAN DYKE AND COMPANY and LATENIGHT WITH David LETTERMAN. But the viewers would undoubtedly ask themselves, what was he doing here.\n\nIN THIS CASE \"here\" would be on WTTW, Channel 11 in Chicago; which is a PBS affiliate. It was at that station's studios that this curio was made. But what was a guy like Kaufman doing on \"Educational Television?\" ONE'S TASTE IN humor is a widely disparate as are our tastes in food, wine and what is appealing in the opposite sex. So no one finds everything or everybody in the Comedy Business as being what they would consider to be \"funny.\" This goes for every stand-up, comic actor and circus clown. Andy Kaufman's niche is certainly no exception to this rule; being a brand o funny business that has a special., somewhat narrow band of highly loyal followers.\n\nTHE PRODUCTION TOOK elements familiar to all of us from various aspects of what is commonplace and the \"norm\" in TV and the movies. He mixed them in generous proportions and came out with yet another product. To this he added an array of totally unrelated \"guests\", such as: Singer Jim Brandy, Pro Grappler Stan Frazier, comedienne Elaine Bousler and Howdy Doody. These and yet a few others gave us a lampoon of the talk show genre.\n\nIN TRYING TO analyze this show (which is a nearly impossible task), we must conclude that like him or not, Andy was different, both in approach and in his subjects.\n\nHE DARED TO be different and succeeded; kind of like Victor Laszlo in CASABLANCA. Isn't that right, Schultz?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Clip: Already in progress",
        "duration": "PT1M11S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3451257113",
        "name": "The Andy Kaufman Show",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWUzNGJmYmMtOGRkMy00ZjY3LWJjZjUtNmUyN2EzNDY2Y2Y3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWUzNGJmYmMtOGRkMy00ZjY3LWJjZjUtNmUyN2EzNDY2Y2Y3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T11:40:19Z",
        "url": "https://www.imdb.com/video/vi3451257113/"
    },
    "url": "/title/tt1179022/"
}