{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dean Martin",
            "url": "/name/nm0001509/"
        },
        {
            "@type": "Person",
            "name": "Stella Stevens",
            "url": "/name/nm0001771/"
        },
        {
            "@type": "Person",
            "name": "Daliah Lavi",
            "url": "/name/nm0492002/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3510,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0170441/"
        },
        {
            "@type": "Person",
            "name": "Donald Hamilton",
            "url": "/name/nm0357824/"
        },
        {
            "@type": "Person",
            "name": "Oscar Saul",
            "url": "/name/nm0766665/"
        }
    ],
    "datePublished": "1966-03-16",
    "description": "Retired agent Matt Helm is re-activated in order to stop an evil organization from exploding an atom bomb over the USA and starting WWIII.",
    "director": [
        {
            "@type": "Person",
            "name": "Phil Karlson",
            "url": "/name/nm0439597/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWUyZTFlMGQtZmNhMy00YmEzLTg0NzctYTFhMTExNTM1YTAyXkEyXkFqcGdeQXVyODY3MzUwMg@@._V1_.jpg",
    "keywords": "1960s,female stockinged legs,black lingerie,pantyhose,murderess",
    "name": "The Silencers",
    "original_info": {
        "id": "The Silencers_1966",
        "name": "The Silencers",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mahatmarandy"
        },
        "dateCreated": "2006-05-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060980/"
        },
        "name": "A 1966 teen aged boy's dream",
        "reviewBody": "The Matt Helm movies were in fairly steady rotation on the local UHF channel in my town in the 70s. I watched them quite a bit as a kid, when I was little because they involved gadgets and explosion,and when I was a slightly older kid because they involved gadgets and explosions and literally acres of almost-naked gorgeous women. Needless to say, this movie was a pretty big hit in 1966 when it was first released, however it trades pretty much entirely on the desire of teen aged boys to see as many nearly-naked women as possible. This was back in the days before VCRs and DVDs and Cable TV made smut into a major industry, and when it was presumably much harder to get a copy of Playboy if you were a kid, so the appeal was not to be understated. \n\nAlas, on this end of the 20th century, where you literally can't check your Email w/out someone offering you pictures of naked women, that aspect of the film has lost some of it's allure. The movie is something like a late night soft-core Cinemax film, only without the actual nudity. (Well, actually, there's plenty of nudity, most of which is conveniently obscured by a chair back, or a coffee cup or whatever) The plot is, well, mostly incoherent, and functions mainly as a means of getting Helm from one sexual situation to another. If the Bond formula is \"Kiss Kiss Bang Bang\" then the Matt Helm formula is 3-parts Kiss Kiss to one quarter cup of Bang, so it actually gets rather tedious. \n\nThe direction is pretty much atrocious, and that adds to the proto-soft-core feel of the film. Production values are on the whole about equal to the level of a good Irwin Allen TV show, and the gadgets are pretty lame, even by the standards of the day, and there is frankly just too much sex. I don't mean that to sound prudish, but come on! That's why Playboy pads out each issue with articles about Peruvian oil wells, it can't *All* be about the T&A. Ideally, a spy parody like this should be something like an Oreo cookie, where the sweet, creamy middle of Stella Stevens (Pretty amazing as a redhead, BTW) is sandwiched in between the chocolate cookies of good storytelling and an interesting plot. Instead, this film plays out like you've scraped the filling off of three or four Double Stuffs, and piled it all on an Andes Candy, so that in the end all you've got is a big pile of sweetened lard and, well, it never ends up tasting as good as you thought it would when you started slapping it all together.\n\nOther Caveats: The brilliant Victor Buono is horribly underused in this film playing a character that *might* possibly be Chinese, but more likely simply *wants* to be Chinese. Or he might simply be an overweight female impersonator with a particularly unfortunate fashion sense. Another odd feature is that the movie is at it's worst when Dino actually acts. Most of the time he sleepwalks through the film in his trademark personality, seeming slightly buzzed, but at random intervals he'll actually act and emote in a scene (\"Did you think you bought me off last night?\") and then suddenly you remember that Dino was one half of the second-most-successful comedy team of all time, and actually a pretty talented actor on occasion. Those glimmers pull you out of the films sugar shock, and, well, it's distracting. The film was apparently running rather short, so they decided to pad it out with a lengthy and pathologically un-funny scene where we spend about ten minutes watching Stella Stevens attempt to get out of a station wagon in the rain and repeatedly fall in the mud. It's painful to watch, and I can't believe they didn't cut it out. Horrible.\n\nOn the bright side, Stella is amazing looking, and not at all shy about it. Indeed, all the women in the film have that inexplicable mid-60s va-va-voom quality, but the most striking of them is the 45-year-old Cyd Charise who is just jaw-droppingly sexy in her two brief appearances in the film. And as ever, it's impossible not to like Dino.\n\nTwo notes for the DVD version of this film: If you saw this show on UHF back in the day, the uncut DVD version is...well, surprisingly lurid. There's nothing on here that wouldn't get past a network censor in 2006, but even so the tone of it is kind of aggressively pornographic, so keep that in mind before you screen it for the youth group on Wednesday night at church. Also, stick around through the end credits! There's a teaser for the next film in the series that features an almost-blooper by Martin, who's clearly thinking \"What in the hell am I doing?\" that makes the preceding 90 minutes of cheeze whiz all the more worthwhile."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Retired agent Matt Helm is re-activated in order to stop an evil organization from exploding an atom bomb over the USA and starting WWIII.",
        "duration": "PT3M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi300532505",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWU2ZTYyNzUtMmQ1NC00NTE1LTkyYTMtMTI4ODU5MzJmN2IyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWU2ZTYyNzUtMmQ1NC00NTE1LTkyYTMtMTI4ODU5MzJmN2IyXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-18T21:43:30.461Z",
        "url": "https://www.imdb.com/video/vi300532505/"
    },
    "url": "/title/tt0060980/"
}