{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lillian Gish",
            "url": "/name/nm0001273/"
        },
        {
            "@type": "Person",
            "name": "Mae Marsh",
            "url": "/name/nm0550615/"
        },
        {
            "@type": "Person",
            "name": "Henry B. Walthall",
            "url": "/name/nm0910400/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25330,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0159923/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0186074/"
        },
        {
            "@type": "Person",
            "name": "Thomas Dixon Jr.",
            "url": "/name/nm0228746/"
        },
        {
            "@type": "Person",
            "name": "D.W. Griffith",
            "url": "/name/nm0000428/"
        },
        {
            "@type": "Person",
            "name": "Frank E. Woods",
            "url": "/name/nm0940488/"
        }
    ],
    "datePublished": "1915-03-21",
    "description": "The Stoneman family finds its friendship with the Camerons affected by the Civil War, both fighting in opposite armies. The development of the war in their lives plays through to Lincoln's assassination and the birth of the Ku Klu...",
    "director": [
        {
            "@type": "Person",
            "name": "D.W. Griffith",
            "url": "/name/nm0000428/"
        }
    ],
    "duration": "PT3H15M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTM4ZDhiYTQtYzExNC00YjVlLTg2YWYtYTk3NTAzMzcwNTExXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "ku klux klan,civil war,reconstruction era,american civil war,propaganda",
    "name": "The Birth of a Nation",
    "original_info": {
        "id": "The Birth of a Nation_1915",
        "name": "The Birth of a Nation",
        "year": "1915"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "satya232"
        },
        "dateCreated": "2000-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0004972/"
        },
        "name": "What does it mean to say something is 'Politically Correct'?",
        "reviewBody": "I don't think there's ever been a more maligned phrase than \"politically correct\" out there; the words immediately evoke a kind of liberal pseudo-fascism that some would have you believe is dominating freedom of speech and thought around universities and media outlets everywhere. I'm not so sure about that, but I am concerned at the counter-trend, of things that are labeled politically incorrect now proudly sporting that label as if they were a rebel, a David fighting these psedo-fascist Goliaths. That is hardly the case. D.W. Griffith's movie, far from being a politically incorrect movie unfairly condemned by the liberal elite, was a movie that perpetuated and, to a certain extent, created a Southern Myth that was damning to black people all throughout the country. The scary bit about this movie is not that it is one voice amoung many giving a personal recount of reconstruction. The movie is not presented that way, nor was it received that way. Until the 1960s, this movie WAS the commonplace, everyday understanding of reconstruction, understood by both Northerners and Southerners (aside: notice how the movie intentionately put as much distance between Northerners and Southerners as possible? The enemy is blacks and \"radicals\" (who were nothing of the sort), not Lincoln or the union soldiers. The movie was trying to appeal to a Northern audience).\n\nAnyone who ever complains about the political correctness or historical \"revisionism\" of today's academics, see this movie. And understand, that it is the work of historical \"revisionists\" that are responsible for teaching the facts about our nation's history, grasped out of the hands of fictions like Griffith's horrific Birth of a Nation. And don't be so smug about complaining of political correctness in the future.\n\nAnd don't try to seperate this film as an artistic work with the historical perspective of the film. Keep in mind, this film was not only a portrayl of history, it was also a *part* of history. It served to defend racial segregation, lychings, and the Klan at a time when all three of those were very real political issues. It is not a coincidence that the greatest period of lychings and Jim Crow laws came shortly after this movie. In short, this film oppressed people. So don't treat it like it existed in an entertainment vacuum, unaffected by and unaffecting everything else around it."
    },
    "url": "/title/tt0004972/"
}