{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Obba Babatundé",
            "url": "/name/nm0044762/"
        },
        {
            "@type": "Person",
            "name": "Rae Dawn Chong",
            "url": "/name/nm0001044/"
        },
        {
            "@type": "Person",
            "name": "Charmin Lee White",
            "url": "/name/nm0924600/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 272,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0063499/"
        },
        {
            "@type": "Person",
            "name": "Kosmond Russell",
            "url": "/name/nm0751277/"
        },
        {
            "@type": "Person",
            "name": "Jordan Walker-Pearlman",
            "url": "/name/nm0908326/"
        }
    ],
    "datePublished": "2001-04-20",
    "description": "A young man dying in prison brings his family together for a fateful visit, and proceeds to put his life back together.",
    "director": [
        {
            "@type": "Person",
            "name": "Jordan Walker-Pearlman",
            "url": "/name/nm0908326/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzMwMjI3NTE3M15BMl5BanBnXkFtZTcwNDAyNjEzMQ@@._V1_.jpg",
    "keywords": "based on play,independent film",
    "name": "The Visit",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jimcheva"
        },
        "dateCreated": "2001-02-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0199129/"
        },
        "name": "Beyond issues to the human heart",
        "reviewBody": "Any film about a young black male in prison just BEGS for rhetoric. Add AIDS in the mix, and the traps are everywhere.\n\nThis film manages to illuminate more than one of the issues involved in both subjects without ever becoming tendentious or trite. And it does so largely because of the deeply felt work of Hill Harper and the other actors involved. Through shades of rage, neediness, fear, frustration and the most affecting, immediate, infant love, Harper brings us right to the heart of a man who knows he's done wrong, but nonetheless has been done greater wrong.\n\nWith all the complex personal and political issues at play here, what shines through and holds the film is the raw, heartbreaking yearning of the main character.\n\nNot that larger situations aren't observed. When his successful businessman brother (played by Obba Bobatunde) comes to visit, the obligatory search by a guard becomes one more humiliation of a black man. This isn't underlined - it's simply shown. His father's rant about how young blacks become what many whites already think they are could come right out of an article on the subject - except that he's talking about his son and the father (uncompromisingly played by Billy Dee Williams)is being his pompous self-satisfied self.\n\nA number of other vignettes refer to larger issues without every losing sight of the specific human stories that we're following.\n\nEverybody in the cast is superb without being flashy: simply real. Rae Dawn Chong remains believable even when her character's relentlessly positive character borders on the Pollyannaish. It's not a surprise that she's luminous in these scenes - that over-used word applies more appropriately to Chong than almost any other actress -, but in the flashbacks showing her as a crack whore she becomes every bit as beaten down and dispairing as she is radiant in redemption.\n\nAlso, two scenes are fascinating simply for the freedom of interplay that the director manages to achieve - the parole board's part pompous, part compassionate negotiations and the extended dialogue between Harper and Chong's characters during her first visit. In both, there is that Cassavetes quality of a scene almost veering out of control while continuing to convey its dramatic point.\n\nThough several scenes take place in a church, the film avoids the increasingly cliched use of a gospel choir to suddenly provide an emotional uplift. Yet nontheless, towards the end, we are treated to an extended montage over a unique version of \"Sometimes I Feel Like A Motherless Child\" by the sublime Sweet Honey in the Rock.\n\nThat kind of tasteful deflection of expectations informs the whole film. It's really a wonderful piece of work."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from HBO Home Video",
        "duration": "PT35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1610350873",
        "name": "The Visit (2000)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDlkNTUzNDItOGE2MS00YzgzLThmMmYtZWY1ODA0OWQ5OTgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDlkNTUzNDItOGE2MS00YzgzLThmMmYtZWY1ODA0OWQ5OTgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:19:41Z",
        "url": "https://www.imdb.com/video/vi1610350873/"
    },
    "url": "/title/tt0199129/"
}