{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Rock Hudson",
            "url": "/name/nm0001369/"
        },
        {
            "@type": "Person",
            "name": "Gayle Hunnicutt",
            "url": "/name/nm0402281/"
        },
        {
            "@type": "Person",
            "name": "Bernie Casey",
            "url": "/name/nm0143378/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2343,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075653/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        }
    ],
    "datePublished": "1980-01-27",
    "description": "In the 21st century, Earth begins the colonization of Mars. However, things do not go as planned, at first due to the hostile Martian natives and later because of the self-destructive Earthmen.",
    "genre": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTc5OTY2OTMtM2ZiZS00ZjQyLTk2MDAtODY4N2IyMmM0YjY3XkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "episodic structure,psychotronic series,robe,disrespect,mars",
    "name": "The Martian Chronicles",
    "original_info": {
        "id": "The Martian Chronicles_1980",
        "name": "The Martian Chronicles",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "eric_oliver_nicolas"
        },
        "dateCreated": "2009-09-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080242/"
        },
        "name": "Doesn't deserve anything less than a 6, and here is why",
        "reviewBody": "The Martian Chronicles (both the book and the miniseries) is not science fiction. I am surprised almost nobody picked this up. It is a tale about human nature, and how it is thrown in sharp contrast when facing something as viscerally non-human as an alien culture on a new distant world. So forget about Star Wars, and forget about fact accuracy about Mars: this is just a tale. \n\nI suppose you need to have seen this miniseries as a child in order to like it. Short of that, its shortcomings must really seem unforgivable for a late 70's production. And yet there are so many aspects that make this show highly enjoyable. And first and foremost its lessons: colonization is not all good; in the process of wiping out the strange and the unknown in order to make room for the newcomers and allow them to settle in comfortably, a lot of interesting and possibly life-changing ideas are lost. \n\nAs for the cold war and the message from the Chronicles being outdated, surely the world is no better today place than it was 40 years ago... \n\nTo me, visually outdated as it is, the Chronicles still retain the charm of a frontier tale about how important it is to open up when traveling to new strange shores, as opposed to taking your whole world with you ( a theme brilliantly exploited in The Beach for instance). I told you, this is no Sci-Fi !!!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0080242/"
}