{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Milla Jovovich",
            "url": "/name/nm0000170/"
        },
        {
            "@type": "Person",
            "name": "John Malkovich",
            "url": "/name/nm0000518/"
        },
        {
            "@type": "Person",
            "name": "Rab Affleck",
            "url": "/name/nm0012683/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 67849,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "The Messenger: The Story of Joan of Arc",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0172053/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0147982/"
        },
        {
            "@type": "Person",
            "name": "Andrew Birkin",
            "url": "/name/nm0001949/"
        },
        {
            "@type": "Person",
            "name": "Luc Besson",
            "url": "/name/nm0000108/"
        }
    ],
    "datePublished": "1999-11-12",
    "description": "A young girl receives a vision that drives her to rid France of its oppressors.",
    "director": [
        {
            "@type": "Person",
            "name": "Luc Besson",
            "url": "/name/nm0000108/"
        }
    ],
    "duration": "PT2H28M",
    "genre": [
        "Adventure",
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmIyYzliMjEtMjY5MC00YzFlLWI4ZjktMWYwMTA2NjEzODA0XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "france,soldier,joan of arc,religious conviction,medieval times",
    "name": "Joan of Arc",
    "original_info": {
        "id": "The Story of Top Gun_1999",
        "name": "The Story of Top Gun",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dave13-1"
        },
        "dateCreated": "2013-04-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0151137/"
        },
        "name": "A lot of reviewers loathed this film",
        "reviewBody": "...but it still made interesting viewing. More biographies of Jeanne d'Arc exist than of any other person, and any attempt to portray her rather incredible life as France's greatest heroine and martyr on film can expect to encounter a similarly large number of second-guessers. This is precisely what happened when this picture came out. Reviewers went on at length about what the picture should have been about, and how Joan should have been portrayed (and by whom), leaving readers to wonder what they thought of the picture that HAD been made. This tendency to review the picture they wish had been made is a classic failing in many critics and this picture seemed to bring it out especially often.\n\nThe picture that Luc Besson made here deserves to be appreciated on its own merits. It is visually stunning, rousingly action-packed, and full of interesting period details. Yes, casting his supermodel wife Milla Jovovich in the lead was a risky choice, as her looks were hardly those of a typical medieval peasant. Yes, her performance did not resonate with the period the way one by a more classically trained actress might, although she was clearly never trying to be Ingrid Bergman. Still, Milla's hyperactive personality made her interesting and watchable as a historical person about whom so much has been written, who nonetheless existed so far back in the past that she lacks a strongly identifiable humanity. When somebody makes a better statue than a person, as Joan does from a contemporary viewpoint, odd casting choices can be forgiven if they work. Milla's twisty mannerisms, rolling eyes and whispery speech give the viewer constant occasions to ponder just how much of Joan's fanaticism came from genuine devotion to God and the church and how much was just an under-medicated personality disorder. This is actually one of the key scholarly issues surrounding Joan's life, and the picture brings it to the fore in its latter part as Joan herself tries to come to terms with her own claims of divine communication by means of a debate with Dustin Hoffman as her confessor-priest/conscience. That Besson takes no particular viewpoint here is an interesting choice, and one which actually helps the viewer to understand why Joan's story has compelled so many generations of historians.\n\nThe political aspects of Joan's life and legend were also dealt with in a nicely balanced fashion. Like many figures in times when political and national alliances changed with the seasons, Joan herself blew back and forth between being tremendously useful to the French throne at times and dangerously inconvenient at others. Fame is a powerful commodity at any time, and the picture carefully tracked the rise and fall of Joan's fortunes as she watched hers be manipulated, leveraged and ultimately put on trial.\n\nI thought a lot of The Messenger and recommend it. Religious and historical scholars are advised to approach with caution.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Columbia Pictures",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2801139993",
        "name": "The Messenger: The Story of Joan of Arc",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWUyZDhjM2EtYzUzZS00NTljLTlmN2YtZTNmY2Q5YzgxYTEzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWUyZDhjM2EtYzUzZS00NTljLTlmN2YtZTNmY2Q5YzgxYTEzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:57:01Z",
        "url": "https://www.imdb.com/video/vi2801139993/"
    },
    "url": "/title/tt0151137/"
}