{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Wahlberg",
            "url": "/name/nm0000242/"
        },
        {
            "@type": "Person",
            "name": "Thandiwe Newton",
            "url": "/name/nm0628601/"
        },
        {
            "@type": "Person",
            "name": "Tim Robbins",
            "url": "/name/nm0000209/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10745,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0133270/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093046/"
        },
        {
            "@type": "Person",
            "name": "Peter Stone",
            "url": "/name/nm0832099/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Demme",
            "url": "/name/nm0001129/"
        },
        {
            "@type": "Person",
            "name": "Steve Schmidt",
            "url": "/name/nm0773206/"
        }
    ],
    "datePublished": "2002-10-25",
    "description": "A woman returns from holiday to find her husband has been murdered, and several groups of people are pressuring her to unravel the mystery of his true identity and activities during his final days.",
    "director": [
        {
            "@type": "Person",
            "name": "Jonathan Demme",
            "url": "/name/nm0001129/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzk5MzA3MGEtN2UzZi00ZDUyLTljYjgtYjM3Yzk0ZWYyNGY1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "ex soldier,female police officer,woman wears a uniform,divorce,death",
    "name": "The Truth About Charlie",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2002-11-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0270707/"
        },
        "name": "An Insult to a Great Classic",
        "reviewBody": "Mystery films come and go; a precious few stand the test of time. \"Charade,' for my money the greatest whodunit ever made, is a masterpiece of tone, miraculously blending the disparate elements of suspense, humor and romance more successfully than any film I've ever seen. Enhanced by the dashing beauty and charisma of its two stars, Audrey Hepburn and Cary Grant, the sophisticated wit of its ingenious script, the shimmering beauty of its on-location photography, and, of course, the classic strains of its Henry Mancini score, \"Charade\" is a movie that one can enjoy no matter how many times one has seen it.\n\nI wonder how many people will be saying the same thing about `The Truth About Charlie' - Jonathan Demme's utterly pointless remake of this great film - four decades from now (the original title, `Charade,' is actually more appropriate because the story deals with lies, deception and falsehoods in general and not just in relation to that particular character). I have absolutely no idea how anyone unfamiliar with the original work will respond to this film. I can just say that, for diehard devotees of the 1963 Stanley Donen classic, `The Truth About Charlie' is a travesty on every level imaginable. (And, alas, that great Henry Mancini score is nowhere to be found on this version's soundtrack, the first of many strikes against this modern rehash).\n\nAlthough this new version shares the basic plot premise of the original, it has completely eliminated most of the elements that made `Charade' such a world-class, timeless charmer. First of all, in what universe could Mark Wahlberg and Thandia Newton possibly be considered replacements for Cary Grant and Audrey Hepburn, two of the greatest screen legends of all time? Yes, Ms. Newton has a certain attractiveness and appeal at times, but her one-note expression of pouting bemusement does grow tiresome after awhile. The real trouble, however, comes with Wahlberg, a fine actor who has turned in some impressive film performances in the past, but who is just plain disastrous in this part. His character is supposed to be a suave, debonair gentleman who attempts to win Reggie's confidence after her husband has been murdered for stealing $6 million and she becomes the hapless target of a band of hooligans who want their share and who believe she knows where it is. Wahlberg has never looked more uncomfortable or out of place than he does here, trying to appear `sincere' and `concerned, ' but coming across as merely epicene and amateurish. This is, in fact, the worst case of miscasting I have seen in a film in a long, long time. How can one have a remake of `Charade' - of all films! - with two stars who lack charisma and generate zero romantic chemistry when they're together on screen? \n\n Even more detrimental, perhaps, is the fact that virtually all the wonderful humor from the original script has been excised, a strange turn of events indeed considering the fact that the original writer, Peter Stone, also had a hand in this venture (here he has assumed the pseudonym of `Peter Joshua,' one of the names ascribed to the Grant character in the earlier film, although the name, for no apparent reason, has been inverted for Wahlberg). The very few comic lines that have been retained are delivered so poorly by the actors that we wince every time we hear them. \n\nSo now we have a remake of `Charade' utterly devoid of humor and romance. What else could go wrong? Well, in the original, the secondary characters all stood out as finely drawn figures in their own right. The three men chasing Reggie for the money  James Coburn, Ned Glass and Arthur Kennedy  had each a retinue of fascinating personality quirks that helped distinguish one character from the other. In `Charlie,' the three `villains' not only comprise a blandly homogenous group, but they do not even remain consistent as characters. The most egregious example is Lola (Lisa Gay Hamilton) who spends the entire film bullying and threatening Regina, then inexplicably and in a matter of minutes, becomes some sort of heroine whom Regina comes to love and admire. It makes no sense at all. The concluding scene, in which the characters all meet up together to reveal their true identities and unravel the mystery, is so ham-handed in its execution that one wonders if the filmmakers ever even saw the flawlessly executed Donen original. It is the low point in a film made up of little else but low points. Demme has also injected an idiotic plot strand involving Reggie's husband's insane mother, but the less said about that the better. In fact, one suspects that the sole reason for this storyline is to allow the director to feature famed French director Agnes Varda in a cameo role. Indeed, `Charlie' is filled with all sorts of pointless homages to French culture in general and the French New Wave in particular, including a clip from Truffaut's `Shoot the Piano Player' and a truly bizarre cabaret scene with famed Jean Luc Godard actress Anna Karina belting out a song while the characters perform a surreal tango that throws us out of the film's world completely. In fact, Demme has tried to recreate much of the style of 60's cinema by employing a camera that rarely ever sits still and a razzle-dazzle editing technique that attempts to substitute style for substance. The effort is too self-consciously cutesy to be even slightly effective.\n\n This does, however, bring us to the one undeniable element of value in `The Truth About Charlie': Tak Fujimoto's eye-popping cinematography, which does a superlative job bringing out the colorful richness of the Paris setting.\n\nA word of praise to anything or anyone else involved in this production would, however, be excessive. Demme has taken a film that just about defines the word `style' and turned it into a hollow, soulless exercise utterly devoid of wit, suspense, romance and star charisma  all the elements in fact that made `Charade' such a golden, timeless treasure. Avoid the theaters and head to the nearest video store to pick up a copy of `Charade' - and see what a great film is really all about."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4076536089",
        "name": "The Truth About Charlie",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDdlNTJhNzEtMmUyZi00NWNlLWJkYWItY2NlODI5OTU0YWQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDdlNTJhNzEtMmUyZi00NWNlLWJkYWItY2NlODI5OTU0YWQ4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:17:44Z",
        "url": "https://www.imdb.com/video/vi4076536089/"
    },
    "url": "/title/tt0270707/"
}