{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Spader",
            "url": "/name/nm0000652/"
        },
        {
            "@type": "Person",
            "name": "Claire Forlani",
            "url": "/name/nm0001231/"
        },
        {
            "@type": "Person",
            "name": "Paul Giamatti",
            "url": "/name/nm0316079/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1494,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093881/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060381/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Jason Horwitch",
            "url": "/name/nm0395842/"
        }
    ],
    "datePublished": "2003-03-09",
    "description": "Defense worker Daniel Ellsberg seeks to publish a series of classified government documents detailing the true nature of America's involvement in the Vietnam War.",
    "director": [
        {
            "@type": "Person",
            "name": "Rod Holcomb",
            "url": "/name/nm0390103/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama",
        "History",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjIzNzYwMDI0OF5BMl5BanBnXkFtZTcwNTY3MTUyMQ@@._V1_.jpg",
    "keywords": "vietnam war,information leak,lingerie slip,politics,pentagon papers",
    "name": "The Pentagon Papers",
    "original_info": {
        "id": "The Pentagon Papers_2003",
        "name": "The Pentagon Papers",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "classicalsteve"
        },
        "dateCreated": "2012-12-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0330760/"
        },
        "name": "James Spader Offers His Best Performance of the Unlikely Hero Who Exposed Government Documents",
        "reviewBody": "Sometimes the people who have the best perspective on a side of an issue are those who were formerly advocating for the other side. Daniel Ellsberg was employed by the Rand Corporation and then the US Executive Branch at the Pentagon as a mid-level researcher. In the 1960's, Ellsberg advocated for the war in Vietnam. He believed that the cause for democracy around the world was worth the sacrifice of the lives of young men in the South Pacific. After a tour of Vietnam and acquisition of federal documents revealing the history of the war, Ellsberg began to question the morality of the US's Vietnam involvement.\n\nJames Spader offers perhaps his best and most important performance as the young and middle-aged Daniel Ellsberg, the man Nixon referred to as a \"traitor\". The made-for-TV film chronicles Ellsberg's career as a high-level researcher in international affairs. After finishing his doctorate, Ellsberg first worked for the Rand Corporation and then later the Pentagon. He had been completely sold on America's involvement in Vietnam. He is then sent to Vietnam as a researcher to contribute to the Pentagon's internal study of the war.\n\nUpon his return, Ellsberg begins to doubt whether the war in Vietnam is simply a self-perpetuating abattoir with no end in sight, a slaughter-house which keeps feeding upon itself. Were the ends really about spreading the cause of democracy or about some other political ends? Ellsberg sends in his contribution to the study based on his experiences in Vietnam. He then learns that his writing as well as many other researchers were compiled together in a 7000-page internal document chronicling the history of the war in Vietnam.\n\nEllsberg requests from the Pentagona a copy of the internal study, later dubbed the Pentagon Papers by the Press. Ellsberg reads the entire 7000-page monstrosity only to learn that the Vietnam cause goes as far back as Truman, and the ends for Vietnam were not really about the cause of democracy but more about short-term political gains. In other words, no US President wanted to declare Vietnam a failure on their watch, and passed the buck to the next president. Ellsberg is appalled at the disregard for human life for the purposes of political ends. But what can he do about it? A thoroughly engrossing and underrated film about Daniel Ellsberg and the Pentagon Papers. Spader is completely believable as the man regarded as both hero and villain, depending upon the perspective. Nixon and his cronies regarded Ellsberg as a traitor, compromising their goals in Vietnam. They used the old \"threat to national security\" argument as the reason that the papers should not be released to the public. Others believed that all the information about the war needed to be exposed to encourage healthy debate. How can we, as a supposed democracy, ever make sound judgments on an issue if we are deprived of all the facts?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0330760/"
}