{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kathy Bates",
            "url": "/name/nm0000870/"
        },
        {
            "@type": "Person",
            "name": "Zach Staenberg",
            "url": "/name/nm0821205/"
        },
        {
            "@type": "Person",
            "name": "Jodie Foster",
            "url": "/name/nm0000149/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3090,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0193194/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067184/"
        },
        {
            "@type": "Person",
            "name": "Mark Jonathan Harris",
            "url": "/name/nm0365057/"
        }
    ],
    "datePublished": "2004-10-12",
    "description": "Documentary about the art of film editing. Clips are shown from many groundbreaking films with innovative editing styles.",
    "director": [
        {
            "@type": "Person",
            "name": "Wendy Apple",
            "url": "/name/nm1743280/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Documentary",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDM2ZTE5Y2ItYjQwYi00Yzk2LThjZWUtYzI4YmVjNjkwNTc1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "entertainment documentary,editing,filmmaking,film history,film editor",
    "name": "The Cutting Edge: The Magic of Movie Editing",
    "original_info": {
        "id": "The Cutting Edge: The Magic of Movie Editing_2004",
        "name": "The Cutting Edge: The Magic of Movie Editing",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TBJCSKCNRRQTreviews"
        },
        "dateCreated": "2010-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0428441/"
        },
        "name": "There's power in juxtaposition",
        "reviewBody": "This is one of the two feature-length documentaries on the 2-Disc Special Edition DVD of Bullitt. With a running time of 95 minutes, it is the longer one, by about 12 minutes. It consists of interviews and film clips(old, new, fiction, documentary(including propaganda works), famous and unknown, and a little real life footage; note that there are spoilers for many of the movies) used as examples or such, and narrated well by Kathy Bates. It is ironic that the invisibility and underrating of the role of the editor is somewhat shown by the fact that a couple of the directors here are actors first(big names, of the kind that draw attention), but other than that, I can say nothing negative about this. Everyone here has something to say(no, I know, I didn't expect much from Rob Cohen, the man behind xXx, either), and those who have the most to offer genuinely *are* the ones we see for the majority of this. Speaking as someone who *loves* the art of cutting, I can't say if this will be as compelling to those who aren't into the craft, however, this is clearly made for said group, and if you find yourself in it, you will not regret watching this. Before seeing this, I would not have dared suggest that one could successfully tell the history of its development and cover this amount of ground on the \"theory\" of it(like the line I quote in the summary, to give just one example) in a mere hour and a half. The whole thing is extremely interesting and informational. It has a great sense of humor without trying too hard. The numerous analogies and the like are excellent. As is fitting for the subject, this is put together rather well. There is a little strong language in this. I recommend this to anyone who wants to know more. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0428441/"
}