{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jonathan Brandis",
            "url": "/name/nm0000970/"
        },
        {
            "@type": "Person",
            "name": "Kenny Morrison",
            "url": "/name/nm0607213/"
        },
        {
            "@type": "Person",
            "name": "Clarissa Burt",
            "url": "/name/nm0123418/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26653,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011145/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031121/"
        },
        {
            "@type": "Person",
            "name": "Karin Howard",
            "url": "/name/nm0003369/"
        },
        {
            "@type": "Person",
            "name": "Michael Ende",
            "url": "/name/nm0256779/"
        }
    ],
    "datePublished": "1991-02-08",
    "description": "A young boy with a distant father enters a world of make-believe and magic through a portal within an antique book.",
    "director": [
        {
            "@type": "Person",
            "name": "George Miller",
            "url": "/name/nm0004305/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTZkNzNkMDYtYTIxYS00YjA4LWJkYmQtMTA0Njg0YjJmYmQ2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "travel,swimming pool,fear of heights,deception,high fantasy",
    "name": "The NeverEnding Story II: The Next Chapter",
    "original_info": {
        "id": "The NeverEnding Story 2: The Next Chapter_1989",
        "name": "The NeverEnding Story 2: The Next Chapter",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Atreyu_II"
        },
        "dateCreated": "2008-11-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100240/"
        },
        "name": "The Neverending Mess: First Chapter",
        "reviewBody": "Just take a look at my summary and you'll get a great idea about what I think of this movie. I wasn't originally planning to watch this, but I decided to because it was in a day I had not much to do and so I did, if only to see how weak this would be. I wasn't really expecting much from it, but it turned out to be even weaker than I imagined.\n\nBut let's go by parts. \"The Neverending Story II: The Next Chapter\" is a sequel to the original and much beloved 1984 film. Unlike the original, this wasn't directed by Wolfgang Petersen, but by George T. Miller. About the cast, with the exception of Thomas Hill as Mr. Koreander, the whole cast is completely different. This already says a lot. The original one has a cast you just gotta appreciate, but I can't say the same about this one.\n\nBastian is now played by Jonathan Brandis, Atreyu by Kenny Morrison and the Childlike Empress by Alexandra Johnes. Jonathan Brandis had a tragic ending in real life. In the role of Bastian, he wasn't all that bad, but we cannot compare him to Barret Oliver, the one and only Bastian. Kenny Morrison is good as a Atreyu, but naturally not as much as \"the real Atreyu\" - Noah Hathaway. Nevertheless, Kenny Morrison looks a bit like Noah Hathaway, but with a stronger Indian-like appearance. Alexandra Johnes really doesn't fit at all as the Childlike Empress, unlike Tami Stronach.\n\nThe characters from the first movie we all love so much are not as appealing here. Bastian has nothing to do with the loving Bastian from the original and here he proves not to be very smart - including whenever Atreyu warns him to be careful about what he's doing. Atreyu is cool here, but not as much as the Atreyu from the earlier film. As for the Childlike Empress, they really managed to ruin her image. Here, she's just an ordinary-looking girl with freezy hair - she has nothing to do with the angelical and innocent-looking Childlike Empress of the original.\n\nFalkor is not the same here. He looks quite artificial and ugly here, while in the first movie he looks so real and perfect. Besides, is it just me or did he become smaller in this film? Another equally bad thing is his voice here. Golly, his voice here sounds awful! It's as if he was talking with his mouth full all the time. And the same can be said about the Rockbiter's voice here. Speaking of Rockbiter, now he has a son? That Junior is a little annoying, isn't he? Mr. Koreander is nowhere near as amusing here as he is in the first movie, despite being portrayed by the same actor. Bastian's father is now younger? And how come Bastian has a mother now, considering she's not alive in the original film?\n\nAs for the visuals, only a few are still good, but aside that Fantasia is simply not the same Fantasia I love so much from the 1st movie. The gorgeous and fantastic landscapes seem to be gone. The magic and special effects that give the 1st movie a feeling of something out-of-this-world are missing. Besides, Fantasia is now a silver city, which just doesn't please me.\n\nThe soundtrack is nothing special. Nothing to do with the wonderful and inspiring soundtrack of the original movie.\n\nVery little in this movie resembles \"The Neverending Story\". In fact, this seems more like a mix of \"The Lord of the Rings\", \"Star Wars\" and a Power Rangers episode, with its extreme darkness and mostly because of all those horrible mechanical giants. I hate creatures like those. I also hate the new villain, the sorceress Xayide. And that ridiculous big bird...\n\nAs for the humor, nothing worthy to mention. Aside one or two very small things, there's nothing to laugh in this movie. The original has classic and funny humor.\n\nSo many things just don't fit in this sequel. Conclusion: this is a shadow of the original and a mockery on the original. It is an easily forgettable movie. Maybe kids will enjoy this, so I'd only recommend this for them.\n\nJust to finish, did anyone else notice that some scenes with Atreyu riding Artax during the quest were literally taken from the first film? I noticed that.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1727184665",
        "name": "The Neverending Story II: The Next Chapter",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2E4YjE4NjItMWIwOC00NWRjLTliYzEtNGRiOGNjMDEyOTZhXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2E4YjE4NjItMWIwOC00NWRjLTliYzEtNGRiOGNjMDEyOTZhXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-10-11T17:02:34.295Z",
        "url": "https://www.imdb.com/video/vi1727184665/"
    },
    "url": "/title/tt0100240/"
}