{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Anna Nicole Smith",
            "url": "/name/nm0000645/"
        },
        {
            "@type": "Person",
            "name": "Daniel Smith",
            "url": "/name/nm1226410/"
        },
        {
            "@type": "Person",
            "name": "Howard K. Stern",
            "url": "/name/nm1229774/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 791,
        "ratingValue": 4.3,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022548/"
        }
    ],
    "datePublished": "2002-08-04",
    "description": "Reality show starring everyone's favorite plus sized model Anna Nicole Smith!",
    "genre": [
        "Comedy",
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxOTMyMjkzNF5BMl5BanBnXkFtZTcwODM0MTUyMQ@@._V1_.jpg",
    "keywords": "actress name in series title,four word series title,2000s,anna nicole smith,female protagonist",
    "name": "The Anna Nicole Show",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "andy-227"
        },
        "dateCreated": "2002-09-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0328732/"
        },
        "name": "Television has reached the nadir of idiocy.",
        "reviewBody": "First of all, before I comment on this, let me set the record straight. I don't watch much TV. I prefer not to. The overabundance of idiotic reality TV shows and ungodly irritating commercials makes me wonder how the human being can withstand such systematic torture for such prolonged periods of time. With the exception of \"The History Channel\", \"Sundance/IFC\", the news, and some documentary channels, TV is an absolute waste. And I realize I'll probably receive some sort of backlash because of my comment on television altogether, but in all honesty I don't really care because I'm entitled to my opinion just like you're entitled to your own. Anyway, one with \"Anna Nicole Show\"...\n\nWow, really, wow! I realize that TV's trying to cater to society's lowest common denominator, but this is ridiculous! Someone please tell me how this became one of the highest rated shows on the network! Please tell me why any of this is viewed as funny. For comedy, I find things funny because of timing and comedic talent. Anna Nicole herself is such a no-talent brain-dead, we wonder if she even knows her own ass from a hole in the ground. If the answer to finding Anna Nicole funny is that it's a \"riot\" to watch her bumble around from place to place with only one hemisphere of her mind turned on, then the answer doesn't make me laugh. It makes me cringe. Sure we like to laugh at people like Anna Nicole, but isn't there an infinitely better and vaster amount of things to watch besides that? \n\n And again, those of you watching it and find enjoyment out of it...go ahead! Feel free to watch it! I'm not one to say watch it or don't. But watching something like \"Anna Nicole\" and seeing how someone show dull in intelligence can make so much money and celebrity causes me to fear greatly for the future generations to come, whatever those may be."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Anna Nicole Show: Season 1",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3837181209",
        "name": "Anna Nicole Show: Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzZlNDdjM2MtMjA1ZS00NjI1LTgyYzAtZDc5ZDljZWI3NjI1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzZlNDdjM2MtMjA1ZS00NjI1LTgyYzAtZDc5ZDljZWI3NjI1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-15T02:32:02.013Z",
        "url": "https://www.imdb.com/video/vi3837181209/"
    },
    "url": "/title/tt0328732/"
}