{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Larry Sullivan",
            "url": "/name/nm0837942/"
        },
        {
            "@type": "Person",
            "name": "Steve Braun",
            "url": "/name/nm0105853/"
        },
        {
            "@type": "Person",
            "name": "Ray Baker",
            "url": "/name/nm0048844/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3856,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0009299/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0431144/"
        },
        {
            "@type": "Person",
            "name": "Miles Swain",
            "url": "/name/nm0841504/"
        }
    ],
    "datePublished": "2002-05-05",
    "description": "Romance, politics, sex and humor all collide during two men's 11-year journey of passion, self-discovery and adventure.",
    "director": [
        {
            "@type": "Person",
            "name": "Miles Swain",
            "url": "/name/nm0841504/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA3MTUwMTM5Ml5BMl5BanBnXkFtZTYwNTcxMjI3._V1_.jpg",
    "keywords": "male underwear,pornographic magazine,male male kiss,male rear nudity,adult magazine",
    "name": "The Trip",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "augiedog"
        },
        "dateCreated": "2002-07-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250067/"
        },
        "name": "Incredibly entertaining jewel of a film about matters of theheart",
        "reviewBody": "The only reason that I rate this film a ten is because the rating scale on IMDB doesn't reach 227. The Trip isn't just a film - it's an extraordinary, a true gem about everything that matters in life - people, relationships, pride in one's self, matters of the heart and soul. The film shows what can be achieved when millions aren't poured into special effects and high-priced superficial \"talent\". I saw The Trip on the last day of the Philadelphia Gay and Lesbian Film Festival 2002. The timing was truly fitting, because it was a fantastic grand finale to a festival which included many other fine films. The Trip, however, was by far, the best of the festival and, in my opinion, walked away with the award for Best of Everything in all Categories. The film follows the relationship between two men starting from 1973 continuing into the 80's, giving an opportunity for many political and social commentaries having to do with the times, including Anita Bryant and Ronald Reagan, and gay rights. There was also much opportunity to fill the film with with many truly hysterical fashions and one-liners inspired by those times. These qualities make The Trip a wonderfully balanced film with both genuinely funny moments along with many warm, heart-teasing scenes too, particularly because the characters are so constantly involving, as is the superbly written storyline. The cast is outstanding, to say the very least. Larry Sullivan and Steve Braun are excellent, both simply amazing as the lead characters, Alan and Tommy. Steve Braun is so charming as Tommy, and Larry Sullivan easily steals everyone's hearts - including mine - as Alan - he's truly wonderful. To portray a Republican with as much heart and vulnerability as Alan displays is no small accomplishment, and Larry Sullivan does this with commanding skill. Sirena Irwin and Alexis Arquette are terrific in supporting roles, but it is Jill St. John who steals every scene she enters as Alan's mother, reminding us that she should be seen More, More, More! It's rare that a director displays such talent and skill in a film while, at the same time and in equal parts, shows such joy and love for his craft. Only a truly talented director could accomplish this, making his hard work appear so effortless, resulting in the most fun an audience has had in years. Please see The Trip if you have the opportunity - don't let it pass you by. And to any distributors that may read this - please take notice of this movie. Please help this truly wonderful film to be seen by everyone as it should be.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Romance, politics, sex and humor all collide during two men's 11-year journey of passion, self-discovery and adventure.",
        "duration": "PT2M14S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2796274201",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzE3NjJmZTQtNGYxYS00N2I0LTkzZDUtYTk3YzA1NWYyNTI3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzE3NjJmZTQtNGYxYS00N2I0LTkzZDUtYTk3YzA1NWYyNTI3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-04-20T15:01:04.968Z",
        "url": "https://www.imdb.com/video/vi2796274201/"
    },
    "url": "/title/tt0250067/"
}