{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Niki Karimi",
            "url": "/name/nm0439312/"
        },
        {
            "@type": "Person",
            "name": "Mohammad Nikbin",
            "url": "/name/nm0631642/"
        },
        {
            "@type": "Person",
            "name": "Atila Pesiani",
            "url": "/name/nm0675977/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 846,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "The Hidden Half",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050259/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0020380/"
        },
        {
            "@type": "Person",
            "name": "Tahmineh Milani",
            "url": "/name/nm0586841/"
        }
    ],
    "datePublished": "2002-03-08",
    "description": "An official is sent from his home in Tehran to hear the final appeal of a woman sentenced to death, a political prisoner. The official's wife of nearly 20 years, Fereshteh Samimi, writes him a letter to read when he reaches the ho...",
    "director": [
        {
            "@type": "Person",
            "name": "Tahmineh Milani",
            "url": "/name/nm0586841/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5MDc5MTM4MF5BMl5BanBnXkFtZTcwNjYwODYxMQ@@._V1_.jpg",
    "keywords": "female protagonist,title directed by female,revolution,communist,letter",
    "name": "Nimeh-ye penhan",
    "original_info": {
        "id": "The Hidden Half_2001",
        "name": "The Hidden Half",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kynoceph"
        },
        "dateCreated": "2003-03-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0277925/"
        },
        "name": "Flawed, but compelling",
        "reviewBody": "It's hard to criticize this film. The director spent time in jail because of the subject matter and the viewpoint of the movie. She is currently out on bail but could be re-imprisoned at any time. This makes it extremely difficult to say negative things about the movie; the idea that the director suffered for her art, literally, almost negates any criticism. But in the end, if we are viewing the movie as art for art's sake, we have to consider the movie for what it is artistically and not confuse it with the creator's sufferings.\n\nIt's easy to see why the film fell foul of the Iranian government. Iran is not the most understanding country in the world, and this film violates several Iranian taboos. It depicts Communist activity in pre-revolutionary Iran, it makes the fundamentalists look more than a little like gangsters, and one of its primary characters is a married man who fools around on his wife and almost lures the lead character, a pretty young 19-year-old, into\n\nhis philanderer's trap. These are all taboos in the fundamentalist regime of Iran, and depicting them onscreen is brave and honest. It also speaks honestly about the lack of life choices women in post-Revolutionary Iran have, which is also brave.\n\nOn the other hand, it has to be said that this is an extremely melodramatic movie. In spite of the setting and the story, I often had an unsettling feeling that I was watching a Lifetime TV production. You know the movies I mean: all men are bad and/or stupid, all women are good, and it's the women's job to somehow keep stupid foolish men from doing bad things to women, because men left to their own devices are just idiots who screw things up and/or cads who only want to break women's hearts.\n\n The heart of the film is a \"forbidden love\" story that Bette Davis in her prime would not have hesitated a moment in playing. A young Communist falls in love with a prominent publisher, who neglects to tell her that he's married. His wife, who has been trailing the young Communist, reveals to her in an astoundingly melodramatic scene that her husband does not love her for who she is; he loves her because she resembles the wife's sister, a beautiful Communist revolutionary who died in the unrest of 1953. The young woman is then packed off to another town by the wife, who conveniently happens to be rich. In exile, she becomes housekeeper/nurse to an old woman and marries the old woman's son, who becomes a judge in post-revolutionary Iran.\n\nThe frankly histrionic story is framed by a letter that the communist-turned-good subservient Iranian wife gives to her husband before he departs on a trip to prosecute a case against a woman who has committed unspecified \"crimes against the government.\" Her letter revealing her past is meant to inspire him to have mercy on the jailed woman.\n\nThere are flaws aplenty in this movie. It is histrionic without a break, on a high soap-operatic level, and it is completely aimed at women. The male characters are either thugs or heartbreakers, with little characterization of either. The women are almost all noble and good with only one exception. The love story at the center of the plot is so overwrought it almost verges on camp.\n\nThere are moments, though, when it breaks out of this trap. When the heroine tries to apply for University and is turned away because of her Communist past, the reality of life for women under what is essentially a fundamentalist Islamic regime comes clear. When the heroine's naive confidence in her Communist ideals meets up with the gang-member brutality meted out to those who diverge from the Revolutionary Iran mindset, the story becomes gripping and compelling.\n\nHowever, unfortunately, these moments of truth are few and far between. Too much time and emphasis is placed on the love story. To be honest, if the love story part of the movie was in English, starred English-speaking people wearing everyday American clothes, and was set in a non-exotic location, I wouldn't have spent five minutes watching it. It was that hokey.\n\n Overall, though, I think the movie is seeing because it is an Iranian woman's viewpoint of an Iranian woman's life. Despite its flaws it gives insight into women's lives in pre- and post-Revolutionary Iran, and a glimpse into a lifestyle that we here in the United States do not get to see. On that basis alone I can recommend it, but bear in mind that the movie, as a work of cinema, is basically and nearly fatally flawed. If it were not for the performance of Niki Karimi, who can make even the most hokey moments of this movie somehow believable, I wouldn't have been able to finish it. But if you give it a chance despite the histrionic plot, you may be drawn in as I was.\n\nIt needs to be mentioned this movie is in Farsi and is subtitled in English. Unfortunately the subtitles are in white type, which was a mistake, as it makes some of the dialogue hard to read, especially during daylight or brightly-lit scenes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0277925/"
}