{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bradley Beesley",
            "url": "/name/nm0064022/"
        },
        {
            "@type": "Person",
            "name": "Steve Burns",
            "url": "/name/nm0122886/"
        },
        {
            "@type": "Person",
            "name": "Dolly Coyne",
            "url": "/name/nm2915811/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1128,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0110208/"
        }
    ],
    "datePublished": "2005-03-13",
    "description": "A documentary on the evolution of the Oklahoma band The Flaming Lips.",
    "director": [
        {
            "@type": "Person",
            "name": "Bradley Beesley",
            "url": "/name/nm0064022/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Documentary",
        "Biography",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWIyMjcxNzgtOGQ5NC00ZDg2LWFjZDAtZmEzMDVkNzg0ZTMyXkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
    "keywords": "music documentary,music history,oklahoma city,rock 'n' roll,kitchen",
    "name": "The Fearless Freaks",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jamesv-1"
        },
        "dateCreated": "2005-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0441758/"
        },
        "name": "A very real, very honest and heartfelt movie",
        "reviewBody": "I really liked this movie a lot. I first learned of The Flaming Lips a couple years ago, when a friend lent me their CD. So, I'm not a huge fan by any means, just someone who likes their music. Before watching the movie, I knew nothing about the band, its members, or their history. This movie changed all that. It's a documentary about the band members as well as the lives of people who are touched in some way by this band. It's a very real, very honest, and a very heartfelt movie. I walked away with much adoration and appreciation of Wayne Coyne not only as a musician and artist, but also as a human being. The guy seems like a genuinely nice person.\n\nIn some ways, the story is about a band that has changed and grown over time, just as any of us do in life. Their music reflects this. Seeing the long transformation of the band into what they have become today was fascinating. Like a butterfly emerging from a cocoon, we see the band undergo its own metamorphosis. You can actually hear and see the maturity of the band in their song-writing, the mastery of their instruments, and most importantly, in their music.\n\nThe movie also provides us a glimpse into Steve Drozd's journey to face his demons. I saw this movie at its world premiere, and the director asked the audience what we thought about the film. Was it too long? No, and actually I wasn't even aware of the time passing, it was that good. What did we think about the \"scene\" with Steve? I'm glad the director included it.\n\nThis movie is a real picture of the band. In many ways, the director, Bradley Beesley, provided us a glimpse into many of the band member's personal lives. We see Wayne confronting the reality of his father's passing. We see Steve confronting the consequences of his drug addiction. As I said, it's a very real film. And it's genuine.\n\nBrad, thank you. You did a great job."
    },
    "url": "/title/tt0441758/"
}