{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Errol Flynn",
            "url": "/name/nm0001224/"
        },
        {
            "@type": "Person",
            "name": "Claude Rains",
            "url": "/name/nm0001647/"
        },
        {
            "@type": "Person",
            "name": "Henry Stephenson",
            "url": "/name/nm0827261/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2659,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Mark Twain",
            "url": "/name/nm0878494/"
        },
        {
            "@type": "Person",
            "name": "Laird Doyle",
            "url": "/name/nm0236418/"
        },
        {
            "@type": "Person",
            "name": "Catherine Chisholm Cushing",
            "url": "/name/nm0193693/"
        }
    ],
    "datePublished": "1937-05-08",
    "description": "A poor boy named Tom Canty and the Prince of Wales exchange identities but events force the pair to experience each other's lives as well.",
    "director": [
        {
            "@type": "Person",
            "name": "William Keighley",
            "url": "/name/nm0445033/"
        },
        {
            "@type": "Person",
            "name": "William Dieterle",
            "url": "/name/nm0226189/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDgxZTJlNjUtMTY4Yi00MzQyLTgyMmQtYzg1MTU1MWE5NjY0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg",
    "keywords": "king henry viii,identity swap,based on novel,biscuit,murder of a priest",
    "name": "The Prince and the Pauper",
    "original_info": {
        "id": "The Prince and the Pauper_1937",
        "name": "The Prince and the Pauper",
        "year": "1937"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cariart"
        },
        "dateCreated": "2003-09-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0029440/"
        },
        "name": "Twain Classic, with Flynn in Support of the Mauch Twins!",
        "reviewBody": "In 1937, the WB, capitalizing on Errol Flynn's spectacular performances in CAPTAIN BLOOD and THE CHARGE OF THE LIGHT BRIGADE, cast him in four films, with varying degrees of success. The best, by far, was William Keighley and William Dieterle's production of the Mark Twain classic, THE PRINCE AND THE PAUPER, where he supported new WB 'discoveries' Billy and Bobby Mauch, portraying London urchin Tom Canty and his look-alike, Prince Edward Tudor. The twins were gifted, young (12 at the time of the filming) actors, with a Freddie Bartholomew-like quality of engaging innocence, and they gave this version of the oft-filmed tale a sense of reality that split-screen performances by a single actor could never achieve.\n\nThe story is an engaging one, as young Canty, inspired by his mother and a local priest to dream of a finer life than his father, an ill-tempered beggar (Barton MacLane) could provide, sneaks onto the grounds of Buckingham Palace. There, he meets young Prince Edward, who is thrilled to meet a boy his own age...and, after cleaning him up a bit, is astonished to discover that the pair could pass as twins. Edward decides this is a golden opportunity to see what life outside the Palace is really like, so, against Canty's misgivings, the two exchange clothing, and the Prince leaves...creating far more of an uproar than either boy could ever imagine!\n\nCanty is soon considered 'mad', as he insists he is not Edward, and the Prince, abused and ridiculed by Tom's father, is unceremoniously thrown off the Palace grounds when he attempts to return, by a disbelieving Captain of the Guards (Alan Hale, in the first of 11 films he'd make with his friend, Errol Flynn). The ambitious Earl of Hertford (the always brilliant Claude Rains) investigates Canty's claim, and realizes, after interviewing the Captain, that the boy is telling the truth, giving him a golden opportunity to seize power. Ordering the Captain to find and kill the Prince, the Earl then threatens to kill Canty if he doesn't obey his commands.\n\nThings grow desperate for the young Prince, as he attempts to evade his murderous 'father' on the streets, until Miles Hendon (Flynn), a roguish but good-natured 'soldier-for-hire' comes to his aid. Offering his protection to the lad, Hendon thinks him a bit balmy, as well...until events (the child's obvious despair over the death of Henry VIII, the Palace search party, and a sword duel with the Captain, where Flynn KILLS Alan Hale!!!) convince him otherwise. Then it becomes a race against time to smuggle the real King into the Coronation, before Canty is crowned, and the Earl assumes \"the Power behind the Throne\".\n\nBlessed with a gifted cast, including wonderful character actor Montagu Love as the dying Henry VIII, the film offers a truly exceptional film score by Erich Wolfgang Korngold (who would eventually expand the theme into a symphonic work). Audiences have always been surprised that Errol Flynn's role is not larger, but as a faithful Twain adaptation, the focus had to be on the two boys, and not on the impoverished soldier. Flynn had fun playing Hendon, and the Mauch twins were nothing less than superb as the leads.\n\nWith THE ADVENTURES OF ROBIN HOOD less than a year away, and Errol Flynn's star continuing to ascend, the WB had every reason to celebrate, and THE PRINCE AND THE PAUPER is a pleasure to watch, to this day!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this film based on the story by Mark Twain",
        "duration": "PT3M58S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2026898457",
        "name": "The Prince and the Pauper",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjY5OWExNDMtODljYy00NGM5LWEwNzUtODA1MmM1MGJhYTVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjY5OWExNDMtODljYy00NGM5LWEwNzUtODA1MmM1MGJhYTVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T16:54:45Z",
        "url": "https://www.imdb.com/video/vi2026898457/"
    },
    "url": "/title/tt0029440/"
}