{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Bud Abbott",
            "url": "/name/nm0007941/"
        },
        {
            "@type": "Person",
            "name": "Lou Costello",
            "url": "/name/nm0182579/"
        },
        {
            "@type": "Person",
            "name": "Sid Fields",
            "url": "/name/nm0276352/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1260,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0018069/"
        }
    ],
    "datePublished": "1957-09-14",
    "description": "Bud and Lou are unemployed actors living in Mr. Fields' boarding house. Lou's girlfriend Hillary lives across the hall. Any premise would lead to slapstick, puns, lots of gimmicks from their movies.",
    "genre": [
        "Comedy",
        "Family",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzMxNTY5MjYzNF5BMl5BanBnXkFtZTcwMTgxNDEzMw@@._V1_.jpg",
    "keywords": "sitcom,wisecrack humor,slapstick comedy,gag humor,performer name in title",
    "name": "The Abbott and Costello Show",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "frankfob"
        },
        "dateCreated": "2002-06-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0044229/"
        },
        "name": "The grandfather of modern sitcoms?",
        "reviewBody": "Sitcoms had been around for a few years when this show premiered, but none of them were anywhere near as funny (Jerry Seinfeld is on record as saying this show was the inspiration for his creating \"Seinfeld\") as this one. The premise of the show lent itself to Bud & Lou's reprising many of their most famous routines, and it was good to see them back in action. The two of them--especially Costello--seemed to have regained the spark they once had before a string of movie failures and the team's personal and physical problems (Lou's infant son had fallen into their backyard pool and drowned several years previously, a tragedy Lou never got over; Bud--unknown to many at the time--had epilepsy and his seizures were becoming more serious) combined to send their career into a tailspin, and this show was their chance to revive it. Even though Costello was no longer a young man (he was in his mid-50s when the series debuted) he could still take the pratfalls he was famous for, and the team's exquisite sense of timing seemed to have resurfaced (in one episode they did their famous \"Lemon\" gag that was simply amazing to watch). A first-rate supporting cast and a somewhat more adult atmosphere (Costello had a major--and completely understandable--case of the hots for beautiful Hillary Brooke, and he and Joe Besser's wonderful Stinky had some quite nasty fights) elevated this show beyond just kid's fare.\n\nAlthough it lasted only two seasons, this is a very fondly remembered show. It holds up well and is just as funny today as it was back when it was first shown."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Abbott And Costello Show: The Pigeon",
        "duration": "PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2843000089",
        "name": "The Abbott And Costello Show: The Pigeon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDM1OWFjOWUtZjRlYy00OGEzLWI1MjktZTZlNzM4ZmU0Mzc1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDM1OWFjOWUtZjRlYy00OGEzLWI1MjktZTZlNzM4ZmU0Mzc1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-13T03:46:10.739Z",
        "url": "https://www.imdb.com/video/vi2843000089/"
    },
    "url": "/title/tt0044229/"
}