{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean-Louis Trintignant",
            "url": "/name/nm0004462/"
        },
        {
            "@type": "Person",
            "name": "Klaus Kinski",
            "url": "/name/nm0001428/"
        },
        {
            "@type": "Person",
            "name": "Frank Wolff",
            "url": "/name/nm0938231/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16790,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "The Great Silence",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0036054/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042129/"
        },
        {
            "@type": "Person",
            "name": "Sergio Corbucci",
            "url": "/name/nm0179281/"
        },
        {
            "@type": "Person",
            "name": "Vittoriano Petrilli",
            "url": "/name/nm0678008/"
        },
        {
            "@type": "Person",
            "name": "Mario Amendola",
            "url": "/name/nm0024589/"
        }
    ],
    "datePublished": "1969-01-27",
    "description": "A mute gunfighter defends a young widow and a group of outlaws against a gang of bounty killers in the winter of 1898, and a grim, tense struggle unfolds.",
    "director": [
        {
            "@type": "Person",
            "name": "Sergio Corbucci",
            "url": "/name/nm0179281/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmZlZDU5MmYtNzg1NC00M2QyLTgwY2YtYzc2YmYxNjgwZjc3XkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "spaghetti western,snow,small town,nudity,interracial sex",
    "name": "Il grande silenzio",
    "original_info": {
        "id": "The Great Silence_1968",
        "name": "The Great Silence",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Witchfinder-General-666"
        },
        "dateCreated": "2006-05-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063032/"
        },
        "name": "Brilliant And Unique, One Of The Best Westerns Ever Made!",
        "reviewBody": "Sergio Corbucci's masterpiece \"Il Grande Silenzio\" aka. \"The Great Silence\" is more than just one of the greatest Westerns of all-time. Unlike Corbucci's earlier masterpiece \"Django\" from 1966, which is a violent Spaghetti Western, but also full of dark humor, \"The Great Silence\" is an uncompromisingly bleak movie from the beginning to the end, a brutal tale about misery, greed and selfishness, about injustice and the desire for revenge.\n\nWinter of 1898, in the mountain town of Snow Hill, Utah. People who were forced to steal in order to survive an ice cold winter, are mercilessly chased and murdered by unscrupolous bounty hunters, who don't care who they kill as long as there is a reward on their victim's head. The most atrocious of these bounty hunters is vicious Loco, outstandingly pictured by Klaus Kinski. In their calamity, desperate relatives of the head hunters' victims hire a mute gunman called Silence, in order to avenge their loved ones and end the killings.\n\nThe acting in this movie is brilliant. Nobody could be as diabolical as Klaus Kinski in the role of Loco, Jean-Louis Trintignant performance as Silence is just great, and Vonetta McGee is amazing as Pauline, a beautiful black woman, who falls in love with Silence after losing her husband to the bountykillers. The supporting cast contains such great Spaghetti Western actors as Luigi Pistilli, Mario Brega and Frank Wolff. The Music by Ennio Morricone is, once again, excellent (how couldn't it), the main theme is one of his greatest compositions. The locations are very well-chosen, impressive images of a snowy mountain wasteland make you almost feel the cold. \"The Great Silence is\", after \"Django\", Sergio Corbucci's second film that could be described as one of the most important Westerns of all-time. Both brutal and both masterpieces, the two movies are still completely different. While Django was violent but, in its dark way, also humorous, The Great Silence is sad, serious and brutally bleak. Incomparable in every aspect, \"The Great Silence\" even surpasses \"Django\" in its brilliance, and easily deserves to be named as one of the greatest Westerns ever made.\n\nThe Great Silence is a must-see, not only for fans of Spaghetti Westerns, but for every lover of film. Brilliant And Unique, one of the greatest Westerns ever made! 10/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0063032/"
}