{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ellen Burstyn",
            "url": "/name/nm0000995/"
        },
        {
            "@type": "Person",
            "name": "Max von Sydow",
            "url": "/name/nm0001884/"
        },
        {
            "@type": "Person",
            "name": "Linda Blair",
            "url": "/name/nm0000304/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 416835,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0069305/"
        },
        {
            "@type": "Person",
            "name": "William Peter Blatty",
            "url": "/name/nm0087861/"
        }
    ],
    "datePublished": "1973-12-26",
    "description": "When a 12 year old girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter.",
    "director": [
        {
            "@type": "Person",
            "name": "William Friedkin",
            "url": "/name/nm0001243/"
        }
    ],
    "duration": "PT2H2M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWFlZGY2NDktY2ZjOS00ZWNkLTg0ZDAtZDY4MTM1ODU4ZjljXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "exorcist,exorcism,demonic possession,demonic force,vomiting",
    "name": "The Exorcist",
    "original_info": {
        "id": "The Exorcist_1973",
        "name": "The Exorcist",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pheonix19"
        },
        "dateCreated": "2000-03-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070047/"
        },
        "name": "Unmatched brilliance",
        "reviewBody": "There is a reason for the hysteria and mystique surrounding THE EXORCIST. And it's called genius.\n\nNever have I seen a film matched in shock, terror, writing, or performances. This isn't a horror movie. The film itself is both a moving and terrifying drama that takes a realistic look at what would actually happen if a young girl were possessed in modern America. William Peter Blatty's script is amazing, bringing depth to the characters, and presenting the mystery of faith that they all deal with. Is Regan possessed? Is she insane? And most importantly, Is there a God? In the course of two hours, we see a sweet and innocent young girl become a cross masturbating, head spinning, murderous, creature. We see a successful actress overcome skepticism to save her daughter, and we see a brilliant psychiatrist struggle with his devotion to God as a priest.\n\nFriedkin's direction is marvelous, with wonderful uses of light, dark, and color throughout the film. Jason Miller (as Damien Karras) is beautifully subtle in his first film acting role. Max Von Sydow and Lee J. Cobb provide engaging supporting performances as the experienced priest who senses his impending doom, and a detective who senses something sinister is at work. Ellen Burstyn gives a brutally honest performance as a grief stricken woman trying to save her daughter. And most of all, a 12-year-old Linda Blair gives one of the most terrifying, convincing, and beautiful performances ever shown on film. Her range of emotion and connection to Regan are astonishing. She deserved that Oscar!\n\nTHE EXORCIST presents to us the mystery of faith in it's most raw form--the battle of good and evil. It is an incomparable masterpiece of film, done without the aid of computers and special effects. It relies on story and performances to give us a marvelous and terrifying piece of work. In the end, it makes us ask ourselves what we believe, and keeps us wondering and shuddering at exactally what might be out there.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When a 12-year-old girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her.",
        "duration": "PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3987325721",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWIxN2Q1ODQtMGVjYi00NzAwLTlhZWMtYzUxYTM1MzE2YTIyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWIxN2Q1ODQtMGVjYi00NzAwLTlhZWMtYzUxYTM1MzE2YTIyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2021-09-27T13:21:32.372Z",
        "url": "https://www.imdb.com/video/vi3987325721/"
    },
    "url": "/title/tt0070047/"
}