{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mikael Ayele",
            "url": "/name/nm1138688/"
        },
        {
            "@type": "Person",
            "name": "Brian Deacon",
            "url": "/name/nm0212567/"
        },
        {
            "@type": "Person",
            "name": "Brandon Gilberstadt",
            "url": "/name/nm0317938/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 124,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Person",
            "name": "Steve Gottry",
            "url": "/name/nm1847851/"
        }
    ],
    "datePublished": "2000-03-06",
    "description": "This is the story of Jesus as seen through the eyes of children who might have lived during the time of Jesus. Follow the lives of Benjamin, Caleb, Sarah, Joel, Leah and Nathan, living in Jerusalem about A.D. 30. Hear the stories ...",
    "director": [
        {
            "@type": "Person",
            "name": "John Schmidt",
            "url": "/name/nm0773020/"
        }
    ],
    "duration": "PT1H2M",
    "genre": [
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEyNzE4MDgxOV5BMl5BanBnXkFtZTcwMjI3MjU1MQ@@._V1_.jpg",
    "keywords": "1st century,30s,evangelical,character name in title",
    "name": "The Story of Jesus for Children",
    "original_info": {
        "id": "The Story of Jesus for Children_1979",
        "name": "The Story of Jesus for Children",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CDephedrine"
        },
        "dateCreated": "2007-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0447461/"
        },
        "name": "An excellent way for children to learn about who Christ is.",
        "reviewBody": "At last! A movie which tells Christ's story in a way that will appeal to children of all ages. This re-edited version of the Jesus Project movie, \"Jesus\", has an intro and other segments spliced in, in which children living at the time of Christ tell each other what they have heard and seen about this extraordinary man who has the power to heal palsy, blindness and even death itself.\n\nThis new format makes the selected scenes \"child-friendly\". True to the Biblical version of events, it allows children to decide for themselves who Christ is, and whether he is either lunatic, liar or indeed LORD. I have shown this film to children in state-sanctioned religious education classes in Australian state schools, with a positive response from students. With so much audio-visual material confronting children in a negative way (violence, sex and drugs), it is good to see at least one movie which gives children a positive alternative.\n\nThe movie covers the major events of Jesus' life, including his birth, healing and preaching ministry, and the crucifixion and resurrection. All scenes follow the gospel narrative (according to Luke). Fictionalised content is mainly restricted to the activities and conversations of the children themselves, who tell the story via flashbacks etc.\n\nA modern interpretation of an age-old story that will never lose its relevance to the needs of a spiritually hungry world.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0447461/"
}