{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Stoltz",
            "url": "/name/nm0000655/"
        },
        {
            "@type": "Person",
            "name": "Catherine Bell",
            "url": "/name/nm0004738/"
        },
        {
            "@type": "Person",
            "name": "Lou Diamond Phillips",
            "url": "/name/nm0001617/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9490,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057712/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003899/"
        }
    ],
    "datePublished": "2005-12-05",
    "description": "A shipping magnate hires four experts from various fields to investigate what happened to his ships that went missing in the Bermuda Triangle. The team discovers a threat that might unravel time itself and cause the world to end.",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzUxYTg4MjctZjgzMS00NzQzLTgwNmMtZTNlNjc3ZGM3MmQ4XkEyXkFqcGdeQXVyMTUyNjc3NDQ4._V1_.jpg",
    "keywords": "bermuda triangle,psychotronic series,child in jeopardy,nautical,psychic",
    "name": "The Triangle",
    "original_info": {
        "id": "The Triangle_2005",
        "name": "The Triangle",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2007-09-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0452573/"
        },
        "name": "Intriguing and Entertaining, But with a Disappointing Resolution",
        "reviewBody": "While chasing a whaler, the Greenpeace boat sinks with the vessel, pulled by a mysterious force underwater and only Meeno Paloma (Lou Diamond Phillip) survives. Meanwhile, after the disappearance of six ships in the Bermuda Triangle in one year, the millionaire owner of the Mineral Shipping Lines Eric Benerall (Sam Neill) hires the skeptical journalist of The Observer Howard Thomas (Eric Stoltz); the scientist Bruce Geller (Michael Rodgers); the offshore engineer Emily Patterson (Catherine Bell) and the psychic Stan Lathem (Bruce Davison) to investigate the reasons for the phenomenon in the area. If the team succeeds in their quest for the truth, each one would receive five million dollars. They find a high-tech underwater facility from the Navy, and each one of them has glimpses of alternative reality after their discovery. They conclude that the experiment conducted by the Navy is affecting the electromagnetic balance of the ocean, while trying to find a way to close the dimensional tear opened by the Philadelphia Experiment. But they believe that the procedure actually will open the Pandora Box and destroy the world.\n\n\"The Triangle\" is an intriguing an entertaining story that recalls \"Sliders\" in some moments. The characters are well developed but unfortunately the resolution of the plot is disappointing and confused. When the group reaches the base, in the climax of the story, it is very disappointing what happens next. The DVD released in Brazil has only 160 minutes running time, therefore 80 minutes vanished in the edition, and this might be the cause of my frustration with the messy end of the story. My vote is seven.\n\nTitle (Brazil): \"O Mistério do Triângulo das Bermudas\" (\"The Mystery of the Bermuda Triangle\")",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Lionsgate Home Entertainment",
        "duration": "PT57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1962213657",
        "name": "The Triangle",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDMzZjUxNmMtMDA2Ny00MmZhLWFjNjUtYmQxMWZmZjQ3ZDg0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDMzZjUxNmMtMDA2Ny00MmZhLWFjNjUtYmQxMWZmZjQ3ZDg0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:52:34Z",
        "url": "https://www.imdb.com/video/vi1962213657/"
    },
    "url": "/title/tt0452573/"
}