{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Trevor Howard",
            "url": "/name/nm0002145/"
        },
        {
            "@type": "Person",
            "name": "Vanessa Redgrave",
            "url": "/name/nm0000603/"
        },
        {
            "@type": "Person",
            "name": "John Gielgud",
            "url": "/name/nm0000024/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3683,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103083/"
        },
        {
            "@type": "Person",
            "name": "Charles Wood",
            "url": "/name/nm0939606/"
        },
        {
            "@type": "Person",
            "name": "Cecil Woodham-Smith",
            "url": "/name/nm8484032/"
        },
        {
            "@type": "Person",
            "name": "John Osborne",
            "url": "/name/nm0651570/"
        }
    ],
    "datePublished": "1968-10-11",
    "description": "In 1854, during the Crimean War, poor planning leads to the British Light Brigade openly charging a Russian artillery position with tragic consequences.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Richardson",
            "url": "/name/nm0724798/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE3OTA3OTQ0OF5BMl5BanBnXkFtZTgwMDE5MDQ0MjE@._V1_.jpg",
    "keywords": "1850s,crimean war,battlefield,extramarital affair,female topless nudity",
    "name": "The Charge of the Light Brigade",
    "original_info": {
        "id": "The Charge of the Light Brigade_1968",
        "name": "The Charge of the Light Brigade",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vaughan-birbeck"
        },
        "dateCreated": "2004-11-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062790/"
        },
        "name": "Superb period details",
        "reviewBody": "We have to wait nearly two hours for the eponymous event which climaxes this film. Prior to this we see a series of apparently unconnected episodes which give the viewer an insight into the workings of Victorian society, including anti-intellectuallism and idleness among the 'upper' classes, and brutality and theft among the 'scum' recruited in the slums.\n\nWhile almost plot less this section of the film does follow a core of characters whose lives are connected by army service. The main character is Captain Louis Nolan, an idealistic professional in an army of amateurs. \"England is looking well\" he says in the first scene of the film. The irony is that the country that looks so good is a cruel and mismanaged place. Unlike his fellow officers, who have bought their posts, he has worked his way up the ranks of the Indian Army by merit. He despises them and they feel he isn't a 'gentleman'. \n\nNolan has very definite views on how war should be fought. Faced with the reality of battle and the inadequacies of the commanders (the senile Raglan and the childish Lucan and Cardigan) his impatience and temper have tragic consequences as he impetuously points the Light Brigade (\"There, my Lord, is your enemy, there are your guns!\") towards the bloody fiasco of which he is the first victim. The man who seems to know best makes the biggest blunder of all. Eye-witnesses said the hideous scream Nolan gave when he was hit stayed with them all their lives and the film re-creates it in a truly chilling way.\n\nAlthough the film does reflect 1960's attitudes to war and politics (and I actually prefer these to the attitudes of the 21st Century) its setting is so perfectly realized that it hasn't dated as a '60s film'. In fact it seems better with the passage of time. If you can free yourself from the idea of a narrative history and give yourself up to a series of impressions which add new layers of understanding 'Charge of the Light Brigade' makes a fine historical film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A chronicle of events that led to the British involvement in the Crimean War against Russia which led to the siege of Sevastopol and the fierce Battle of Balaclava which climaxed with the heroic, but near-disastrous calvary charge made by the British Light Brigade against a Russian artillery battery in a small valley. An error of judgement and rash planning by the inept British commanders resulted in the near-destruction of the brigade.",
        "duration": "PT3M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3303654169",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODUxNjUzMzgtNzY1OS00YTc1LTg3MmItOGQzYWIyZjZiNzVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODUxNjUzMzgtNzY1OS00YTc1LTg3MmItOGQzYWIyZjZiNzVkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-19T13:46:17.461Z",
        "url": "https://www.imdb.com/video/vi3303654169/"
    },
    "url": "/title/tt0062790/"
}