{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jameson Thomas",
            "url": "/name/nm0858977/"
        },
        {
            "@type": "Person",
            "name": "Lillian Hall-Davis",
            "url": "/name/nm0356233/"
        },
        {
            "@type": "Person",
            "name": "Gordon Harker",
            "url": "/name/nm0363104/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2965,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103059/"
        },
        {
            "@type": "Person",
            "name": "Leslie Arliss",
            "url": "/name/nm0035199/"
        },
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        },
        {
            "@type": "Person",
            "name": "J.E. Hunter",
            "url": "/name/nm0402855/"
        }
    ],
    "datePublished": "1930-01-04",
    "description": "After his daughter weds, a middle-aged widower with a profitable farm decides to remarry, but finds choosing a suitable mate a problematic process.",
    "director": [
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzcwNTk4OWQtN2M5Ni00NWI3LWI5OTgtZGUwNmYwZWEzYjExXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "widower,rural setting,farmer,housekeeper,spinster",
    "name": "The Farmer's Wife",
    "original_info": {
        "id": "The Farmer's Wife_1928",
        "name": "The Farmer's Wife",
        "year": "1928"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Steffi_P"
        },
        "dateCreated": "2008-12-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0018876/"
        },
        "name": "\"'Tis almost indecent to see 'em all on one bit of paper\"",
        "reviewBody": "This early Hitchcock silent, his first for British International Pictures, is a simple romantic comedy adapted from a stage play. A far cry from crime and suspense, but at this point Hitchcock had neither the influence nor the realisation of his true forte to select his projects.\n\nAs with all but one of the Hitchcock silents, the screenplay was by Eliot Stannard. Stannard, with his typical understanding of the visual medium, dispenses with the wordiness of a direct stage-to-screen adaptation. He allows time for the characters to reveal their feelings in reaction shots and point-of-view shots, and replaces verbal gags with visual ones. The Farmer's Wife is thus as devoid of unnecessary intertitles as, say, The Manxman.\n\nGiven its rural setting, Hitchcock was more or less obliged to include some shots of rolling hillsides. Hitch doesn't seem to have liked the countryside much – in most of his later films if it appears at all it's as a functional back-projection – but he doesn't do too badly here as far as pure photographic beauty goes. Other than that the shooting style is typical of Hitchcock. There is a growing use of fluid camera movement, and we can see that Hitchcock technique, whereby the camera appears to be leading the audience, gradually revealing to us or drawing us in.\n\nWhether it comes from Stannard's script or Hitchcock's head I don't know, but there is a massive tendency here towards point-of-view shots during dialogue scenes, in which the other speaker looks straight into camera. The majority of these are rather pointless, with the exception of several appropriately ghastly close-ups of the Farmer's bridal candidates.\n\nTo say the conclusion of The Farmer's Wife is predictable would be a grand understatement. A shortsighted person could see it coming through several miles of fog. Not a bad thing in itself, but rather than play upon its obviousness (which Stannard and Hitchcock must have been aware of), the picture simply becomes a tedious game of waiting for the inevitable. The Farmer's Wife is only quite funny, and is altogether too long.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0018876/"
}