{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bette Davis",
            "url": "/name/nm0000012/"
        },
        {
            "@type": "Person",
            "name": "Lillian Gish",
            "url": "/name/nm0001273/"
        },
        {
            "@type": "Person",
            "name": "Vincent Price",
            "url": "/name/nm0001637/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4999,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0020346/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035544/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050732/"
        },
        {
            "@type": "Person",
            "name": "David Berry",
            "url": "/name/nm0077527/"
        }
    ],
    "datePublished": "1987-08-19",
    "description": "Two aged sisters reflect on life and the past during a late summer day in Maine.",
    "director": [
        {
            "@type": "Person",
            "name": "Lindsay Anderson",
            "url": "/name/nm0000755/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGRmMzM0ZDYtNjljMS00NDA4LWEwNmEtNGQxNDE5YjgyZDExXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "screenplay adapted by author,whale,maine,red wine,emerald",
    "name": "The Whales of August",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tomgillespie2002"
        },
        "dateCreated": "2013-06-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094315/"
        },
        "name": "Contemplative and somewhat sad",
        "reviewBody": "\"Can one live beyond one's time?\" ponders the 93 year old Sarah (Lillian Gish). This summarises one of the key themes in Lindsay Anderson's moving drama The Whales of August, which focuses on the relationship between sisters Sarah and Libby (Bette Davis). Spending the summer in their vacation house in Maine, the two are approaching the end of their lives. Sarah keeps herself busy doing household choirs and looking after her near-blind sister, as she awaits the yearly arrival of the whales who swim close to the shore. While Sarah is positive and open to changes, Libby is bitter, resigned to her looming death, and opposes Sarah's ideas to install a window that would allow the moonlight to shine through the home in the evening.\n\nThere is no real plot in The Whales of August, and is instead a moving character piece that allows a quartet of wonderful actors - Vincent Price and Ann Sothern as well as the aforementioned - to flex their muscles again. With about 500 features in total behind them, it's wonderful to see these powerhouses at work. Sothern received the only Oscar nomination, but this is Gish's film (Gish shrugged off her Oscar snub by saying \"oh well, at least I don't have to lose to Cher\". She was one of the first Hollywood superstars, and displays the same effortless likability that made her a star with the likes of Intolerance - Love's Struggle Through the Ages (1916) and Broken Blossoms, or The Yellow Man and the Girl (1919). Post-stroke and looking extremely gaunt, Davis sadly fairs less well, and although I consider her to be possibly the greatest actress to ever grace the screen, her performance lacks any real emotion.\n\nBeyond the performances, the film is contemplative and somewhat sad. Faded memories and old photographs are always something that affect me, and watching Sarah and Libby share anecdotes and knowing what these actresses must have lived through and experienced, I found it hard not to get choked up. It's a meditation on change and if there ever comes a time when you should simply let go and accept what's coming. It would be Gish's last film, and Davis' penultimate, and it's a fitting way for the both of them to go out. Going back to the question in the first line, the answer is yes. There is a time all actors will be cast aside by the studio system in favour of youth, deeming them no longer fit for purpose, but The Whales of August reminds us that cinema will never, ever forget.\n\nwww.the-wrath-of-blog.blogspot.com",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Two aged sisters reflect on life and the past during a late summer day in Maine.",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2508440345",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGE5ZTAyZDgtZDFlNy00MDA0LTg4NzItMDE3MjUyMmViZDU1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGE5ZTAyZDgtZDFlNy00MDA0LTg4NzItMDE3MjUyMmViZDU1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-18T20:37:09.283Z",
        "url": "https://www.imdb.com/video/vi2508440345/"
    },
    "url": "/title/tt0094315/"
}