{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julianne Moore",
            "url": "/name/nm0000194/"
        },
        {
            "@type": "Person",
            "name": "Dominic West",
            "url": "/name/nm0922035/"
        },
        {
            "@type": "Person",
            "name": "Christopher Kovaleski",
            "url": "/name/nm1468254/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 67049,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003580/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021095/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090778/"
        },
        {
            "@type": "Person",
            "name": "Gerald Di Pego",
            "url": "/name/nm0224187/"
        }
    ],
    "datePublished": "2004-09-24",
    "description": "After being told that their children never existed, a man and woman soon discover there is a much bigger enemy at work.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Ruben",
            "url": "/name/nm0747849/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAwMjIyNjU4NV5BMl5BanBnXkFtZTcwNjE3NjYyMQ@@._V1_.jpg",
    "keywords": "abduction,conspiracy,mother son relationship,delusion,memory",
    "name": "The Forgotten",
    "original_info": {
        "id": "The Forgotten_2004",
        "name": "The Forgotten",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2005-04-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0356618/"
        },
        "name": "Interesting but lacks consistency and urgency while also being slightly unsatisfactory",
        "reviewBody": "It has been over a year since Telly Pretta's son died in a plane crash; she is in therapy and daily lingers over his pictures and possessions. When the pictures start to disappear she gets angry at her husband for hiding them but her husband doesn't know what she is talking about while her doctor starts to consider putting her in hospital because she is not getting over this fictional \"son\" that she claims she had. Telly's memories are so strong and she knows she isn't crazy  a belief only confirmed when she meets another person who can't remember the daughter he lost in the same crash. As they dig for proof they find so much more than they ever suspected they would.\n\nFrom the trailer for this movie things looked good (apart from ruining the most impacting moment of the film) and I decided to give it a go. The film is a strange mix because bits of it are so intriguing and gripping but then other bits are rather unsatisfying and it cannot keep the urgent tone up consistently. It is a bit annoying but something about the second half niggles  is it because it is all a bit too neat? Is it because it keeps suggesting bigger things that we never get into? Or is it just because the first half had such a simple and interesting idea that opening it out was never going to be able to match the first half? I'm not sure but the film only sporadically hits the right note and will suddenly (very suddenly) show us how big this thing is and how high the stakes are  but then seconds later we're back into a slower scene that almost feels like a step back. That said, the central premise and the bit of the story we get told is still interesting and the urgent moments are enough to keep it going.\n\nThe direction is good; drab colours are an obvious contrast with the bright colours of the memories but generally Ruben helps keep the tension up. The effects are good and they make the \"big\" moments really surprising and impacting. Moore is convincing throughout and she manages to give her usual high quality. The support cast is cluttered with names, which I assume was meant to be a load of red herrings; most of them are OK but have very little time although a cast including Edwards, Roache, Sinise, Woodard and a few others is probably worth a look.\n\nOverall this is an OK film but not as good as the basic plot summary suggests. A good trailer will have you asking questions and interested before the film comes out, but it needs the film to answer these and still have us feel the same. I enjoyed the film and all, but by the end I was left with none of the intrigue and interest that I had had at the start and it is unlikely I'd ever chose to watch it again."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1626472729",
        "name": "The Forgotten",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2NkMmU5YjctNWI2OC00M2ZjLWE3YTUtNmUxY2U0ZTg2MTM0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2NkMmU5YjctNWI2OC00M2ZjLWE3YTUtNmUxY2U0ZTg2MTM0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:42:46Z",
        "url": "https://www.imdb.com/video/vi1626472729/"
    },
    "url": "/title/tt0356618/"
}