{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dante Basco",
            "url": "/name/nm0002364/"
        },
        {
            "@type": "Person",
            "name": "Eddie Garcia",
            "url": "/name/nm0305182/"
        },
        {
            "@type": "Person",
            "name": "Jayson Schaal",
            "url": "/name/nm0769444/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 669,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0075292/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150373/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0200316/"
        },
        {
            "@type": "Person",
            "name": "Gene Cajayon",
            "url": "/name/nm0129132/"
        },
        {
            "@type": "Person",
            "name": "John Manal Castro",
            "url": "/name/nm0145585/"
        }
    ],
    "datePublished": "2003-08-13",
    "description": "A young man struggles with his desire to study art when his family thinks he's headed for premedical studies. Conflicts between Filipino traditions and expectations vs. personal dreams in the contemporary world erupt at his sister...",
    "director": [
        {
            "@type": "Person",
            "name": "Gene Cajayon",
            "url": "/name/nm0129132/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzYxNDU5MDUtYzE5MS00M2QyLWE2ZjItZjQxNTY5MzhiYTc3XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "based on short film,party,birthday party,high school,thug",
    "name": "The Debut",
    "original_info": {
        "id": "The Debut_2000",
        "name": "The Debut",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "noralee"
        },
        "dateCreated": "2002-11-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0163745/"
        },
        "name": "A fresh take on the immigrant experience in the movies",
        "reviewBody": "I went to see the Filipino-American \"The Debut\" because I make a point of seeing any ethnic coming-of-age movie, as I'm curious to see how they compare to the Jewish experience in movies, including last year's Asian Indian-American films \"ABCD,\" and \"American Chai,\" the Greek-American \"Astoria,\" and one of my all time faves from a few years ago the Korean-Canadian \"Double Happiness.\"\n\nLike all movies in this genre (usually for semi-autobiographical reasons), the conflicted lead wants to be an artist rather than what his parents plan for him.\n\nA particularly original angle is that the main character is younger than usual, a high school student way immersed in MTV culture, from comic books, heavy metal and hip hop language, and, of course, embarrassed by his family's cooking and other traditions. The titular event is his sister's coming-out party, which becomes an evening of ethnic discovery for him.\n\nUnlike the older generation of immigrant vs young artist movies like \"The Jazz Singer,\" the ethnic culture here is not all retrograde but is lovingly shown in class and generational diversity and warmth, while showing the conflicts the parents face as well. The political debate among the teens as to whether the lead is a \"coconut\" is a bit forced but interesting.\n\nThe variety of dance scenes leave the realism a bit as they are as choreographed as in the cheerleader satire \"Bring It On\" but they are fun. The naturalness of the actors in supporting roles makes up for some of the amateurishness in their performances, and the leads are charming.\n\nI asked director Gene Cajayon, who was at my showing, how could it be that such a gathering would attract kids from across class lines. He explained that such Filipino family events bring together a large slice of the community as friends of the family, as here the dad works in the post office and the uncle is a doctor.\n\nThe closing credits are open-hearted-- amusingly and passionately thanking the myriad people with the explanations of what they did to help."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3213558041",
        "name": "The Debut",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjJiYzlhZjUtZWUzZS00OTMyLTlhZDItNzkzZGY0ZWU0Y2I1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjJiYzlhZjUtZWUzZS00OTMyLTlhZDItNzkzZGY0ZWU0Y2I1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:18:14Z",
        "url": "https://www.imdb.com/video/vi3213558041/"
    },
    "url": "/title/tt0163745/"
}