{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ryan Gosling",
            "url": "/name/nm0331516/"
        },
        {
            "@type": "Person",
            "name": "Summer Phoenix",
            "url": "/name/nm0001619/"
        },
        {
            "@type": "Person",
            "name": "Peter Meadows",
            "url": "/name/nm1092222/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 39424,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066675/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045848/"
        },
        {
            "@type": "Person",
            "name": "Henry Bean",
            "url": "/name/nm0063785/"
        },
        {
            "@type": "Person",
            "name": "Mark Jacobson",
            "url": "/name/nm0414893/"
        }
    ],
    "datePublished": "2001-08-23",
    "description": "A young Jewish man develops a fiercely anti-Semitic philosophy. Based on the factual story of a K.K.K. member in the 1960s who was revealed to be Jewish by a New York Times reporter.",
    "director": [
        {
            "@type": "Person",
            "name": "Henry Bean",
            "url": "/name/nm0063785/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTg5NjRlY2EtOGE5ZC00NzlmLTg1Y2ItMTMyMTBkYjIyZDVmXkEyXkFqcGdeQXVyMTQ4NDY5OTc@._V1_.jpg",
    "keywords": "skinhead,temple,teacher,tattoo,suicide",
    "name": "The Believer",
    "original_info": {
        "id": "The Believer_2001",
        "name": "The Believer",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kylopod"
        },
        "dateCreated": "2006-03-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0247199/"
        },
        "name": "The fine line between love and hate",
        "reviewBody": "\"The Believer\" contains rare insights into Jewish identity, and it's a shame that the film was withheld from mainstream audiences due to ongoing controversy. But it deals with an ugly subject, and it handles that subject in an ambiguous way that makes many people, including many Jews, uncomfortable. Make no mistake about it, though: the film is uncompromisingly pro-Jewish, and the director, himself a Jew, has said that he became more religious because of his work on the film. Ironically, the film is likely to resonate the most with Jews, though it also contains universal themes familiar to anyone who has ever struggled with faith.\n\nThe idea of a white supremacist who's secretly Jewish is not new to me. I've long known about Frank Collin, who caused a national controversy in the 1970s when he planned to have his neo-Nazi group march in a predominantly Jewish suburb of Skokie, Illinois. It was later discovered that Collin's father was not only Jewish but a Holocaust survivor. This case is so bizarre that it leads one to assume the guy was simply insane. While there may be some truth to that assumption, it isn't a satisfactory explanation. What would possibly lead a Jew to join a group that believes in the inherent evil of all Jews? What is such a person thinking? How does such a person live with himself, rationalize his own actions?\n\nWhat \"The Believer\" accomplishes is to go inside the head of one such person and provide a compelling, believable explanation for how such a person could exist. The film is based loosely on a 1960s incident in which a high-ranking member of the KKK was discovered to be Jewish. The movie updates the story to modern times and depicts the young man, Danny, as a skinhead rather than a Klansman. His characterization is speculative but reveals a deep understanding of human nature.\n\nWhat's truly bizarre about this story is that Danny never abandons his Jewish roots entirely. After attending a neo-fascist meeting, he goes home to his family, whom he treats with respect. He even performs Jewish rituals in private. Yet he terrorizes a Jewish kid on the subway, tells his neo-Nazi buddies that he wants to assassinate a prominent Jewish diplomat, and spouts what sounds on the surface like typical white supremacist ideology. But he's not, as we might suspect, a hypocrite saying things he doesn't believe, or a two-faced lunatic. His philosophy is surprisingly coherent. Sure, he's a walking contradiction, but so are many other people who have a love-hate relationship with their religious background.\n\nHis anti-Semitic beliefs all revolve around a single idea: he thinks Jews are too weak and passive. Sometimes he adopts a macho outlook, since he doesn't want to be associated with a people stereotyped as brainy intellectuals. On a deeper level, he dislikes the persecution theme in Jewish history and culture. But is this theme a sign of weakness or strength? Danny isn't sure. He eventually decides that Jews gain strength from their persecution; they seem to grow stronger the worse they're treated, and the biggest threat to their survival is not those who want to destroy them but those who don't care. This is a far more Jewish idea than an anti-Semitic one. Several Jewish holidays, including Passover, Purim, and Chanukah, commemorate events where Jews grew strong after periods of persecution. Many Jews today believe that assimilation into the culture is a greater danger than genocide, because it could signal the disappearance of Jews as a distinct people. As Irving Kristol once remarked, \"The problem is that they don't want to persecute us, they want to marry us.\"\n\nThe implication is that Danny actually admires Judaism, and that his anti-Semitism is his own warped way of affirming his Jewish identity in a world where, he fears, Jews are increasingly seen as irrelevant--not loved or hated but simply ignored. His ambivalent feelings escalate as the movie progresses. When he has his neo-Nazi buddies deface a synagogue, he can't bring himself to damage the Torah scroll, and he secretly takes it home with him. His intimate knowledge of Jewish beliefs and practices looks strange to his fellow skinheads, to say the least. He tells them that he studies these things in order to know the enemy, pointing out that Eichmann did the same thing. Do they buy this explanation? Apparently they do, but Danny's girlfriend is a little smarter than that, and she finds herself strangely drawn to the religion he's running away from.\n\nLike \"American History X,\" this movie contains disturbing scenes where the protagonist articulately expresses his bigoted ideas. There are other intelligent characters who argue back, but not everything he spouts gets answered, so I can understand why this movie makes some viewers uncomfortable. In one particularly distasteful scene, Danny mocks Holocaust survivors, and while they do answer him eloquently for the most part, his raising of the old \"sheep to the slaughter\" canard is left open.\n\nNevertheless, this a powerful and compelling film, with a lead performance by Ryan Gosling that manages to rival Ed Norton's Oscar-nominated performance in \"American History X.\" We see early on that Danny is capable of doing appalling things, but his moral conflicts are then presented so persuasively that we cannot help but empathize with him. The climax is painfully ambiguous. Those who are looking for easy answers may want to skip this film. But they will be missing out on what is easily the most authentic and profound exploration of Jewish self-hatred ever portrayed on screen.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Palm Pictures",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3582525721",
        "name": "The Believer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWUyNTY1YWQtZWIxMC00ZTEzLTg2ZDAtZDcwZWI4ZjY3NDc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWUyNTY1YWQtZWIxMC00ZTEzLTg2ZDAtZDcwZWI4ZjY3NDc1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:12:16Z",
        "url": "https://www.imdb.com/video/vi3582525721/"
    },
    "url": "/title/tt0247199/"
}