{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred MacMurray",
            "url": "/name/nm0534045/"
        },
        {
            "@type": "Person",
            "name": "Tommy Steele",
            "url": "/name/nm0824687/"
        },
        {
            "@type": "Person",
            "name": "Greer Garson",
            "url": "/name/nm0002093/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2267,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0098836/"
        },
        {
            "@type": "Person",
            "name": "Kyle Crichton",
            "url": "/name/nm0187778/"
        },
        {
            "@type": "Person",
            "name": "Cordelia Drexel Biddle",
            "url": "/name/nm0081140/"
        },
        {
            "@type": "Person",
            "name": "AJ Carothers",
            "url": "/name/nm0139218/"
        }
    ],
    "datePublished": "1968-07-10",
    "description": "Clever yet hapless new butler John Lawless manages a Philadelphia household for quirky and joyful millionaire Anthony Drexel Biddle, his unflappable wife, Cordelia, and their spitfire daughter, Cordy.",
    "director": [
        {
            "@type": "Person",
            "name": "Norman Tokar",
            "url": "/name/nm0865709/"
        }
    ],
    "duration": "PT2H21M",
    "genre": [
        "Comedy",
        "Family",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTJhMjM2NTgtNDM5Ni00YTBhLWJhZjMtOWNkOWMxMGY1ZGNlXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
    "keywords": "horse drawn ice cart,first aid kit,dancing a tango,male singer,song and dance",
    "name": "The Happiest Millionaire",
    "original_info": {
        "id": "The Happiest Millionaire_1967",
        "name": "The Happiest Millionaire",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nataliefanone"
        },
        "dateCreated": "2002-10-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061749/"
        },
        "name": "An under-rated Disney Classic",
        "reviewBody": "\"The Happiest Millionaire\" is a lively musical adaptation of the hit 1957 Broadway play that starred Walter Pidgeon as Anthony Drexel Biddle. The play was written by Kyle Crichton, who adapted it from a biographical book he co-wrote with Biddle's daughter Cordelia, \"My Philadelphia Father.\"\n\n As adapted to the screen by AJ Carothers (who would go on to create the TV sitcom \"Nanny and the Professor\"), \"Millionaire\" tells the story of eccentric millionaire Biddle and his family in 1916 Philadelphia.\n\nThe movie actually isn't really about Biddle at all, instead it focuses on his daughter Cordelia [Lesley Ann Warren in her big screen debut] and her impending romance with Angier Duke [John Davidson in his big screen debut].\n\n The two youngsters fall in love much to the dismay of Angier's mother [Geraldine Page]. The clash between Philadelphia \"old money\" [the Biddles] and New York's nouveau riche [the Dukes] comes into play, but ultimately love conquers all in the final reel.\n\nThrown in for good measure is Tommy Steele as \"John Lawless\", an Irish immigrant whose landed a job as the Biddles' new butler. He's the film's \"narrator\" of sorts and oversees the proceedings as they unfold.\n\nThe score is provided by Disney veterans Richard M. Sherman and Robert B. Sherman [of \"Mary Poppins\" fame], and while this score does not exactly reach the caliber of their work in \"Poppins\" it's not entirely bad either. There are some \"gems\": \"Fortuosity\", \"Let's Have A Drink On It\", \"Valentine Candy\" and \"Are We Dancing\" among them.\n\nThe choreography by Marc Beaux and Dee Dee Wood [\"Poppins\" and \"The Sound of Music\"] is brought to life by both Tommy Steele and Lesley Ann Warren.\n\nScreen legend Greer Garson is Cordelia Drexel Biddle, Sr. and generally plays it straight opposite MacMurray's eccentric-slightly goofy portrayal. Also in the cast Gladys Cooper [\"My Fair Lady\"] as Aunt Mary, Paul Petersen [\"The Donna Reed Show\"] as Anthony, Jr., Eddie Hodges as Livingston and Hermoine Baddeley [\"Mary Poppins\"] as the Biddle's maid.\n\nAt an original 164 minute running time, \"Millionaire\" may seem to some a bit excessive in length, and while this may be true it is still in my opinion a very entertaining movie which for some reason or another Disney has ignored [save for an occasional 3 am screening on \"The Disney Channel\"]. It took Anchor Bay Entertainment to save this gem from relative obscurity when in 1998 they licensed the film from the Disney studios and released it on VHS and DVD in both a general release and road show edition. Disney finally got wise and finally dusted off the film's soundtrack and released the long out-of-print score in August 2002.\n\nI recommend this film for it's music, it's light-heartedness and a compelling motion picture debut by the multi-talented Lesley Ann Warren."
    },
    "url": "/title/tt0061749/"
}