{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Saxon",
            "url": "/name/nm0768334/"
        },
        {
            "@type": "Person",
            "name": "Letícia Román",
            "url": "/name/nm0739815/"
        },
        {
            "@type": "Person",
            "name": "Valentina Cortese",
            "url": "/name/nm0181305/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4900,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "The Evil Eye",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039837/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0170165/"
        },
        {
            "@type": "Person",
            "name": "Ennio De Concini",
            "url": "/name/nm0208086/"
        },
        {
            "@type": "Person",
            "name": "Sergio Corbucci",
            "url": "/name/nm0179281/"
        },
        {
            "@type": "Person",
            "name": "Eliana De Sabata",
            "url": "/name/nm0211373/"
        }
    ],
    "datePublished": "1964-05-20",
    "description": "A mystery novel-loving American tourist witnesses a murder in Rome, and soon finds herself and her suitor caught up in a series of killings.",
    "director": [
        {
            "@type": "Person",
            "name": "Mario Bava",
            "url": "/name/nm0000878/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTFlMjBlOTctYWQwNS00N2E0LTk1M2YtMGMyN2VlNTg4ZDdiXkEyXkFqcGdeQXVyMTAxMDQ0ODk@._V1_.jpg",
    "keywords": "bikini,italy,bikini giallo,serial murder,psychotronic film",
    "name": "La ragazza che sapeva troppo",
    "original_info": {
        "id": "The Girl Who Knew Too Much_1963",
        "name": "The Girl Who Knew Too Much",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Camera-Obscura"
        },
        "dateCreated": "2007-03-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057443/"
        },
        "name": "A key film in the development of the Giallo",
        "reviewBody": "THE GIRL WHO KNEW TOO MUCH (Mario Bava - Italy 1962).\n\nI finally got to watch this in the way of the relatively cheap French DVD-release LA FILLE QUI EN SAVANT TROP, which includes Bava's original Italian cut as well as the American cut (titled THE EVIL EYE), which has a completely different ending and excludes some references to marijuana, as well as a stronger emphasis on the romantic plot line between the two leads John Saxon and Letícia Román, reputedly to make the film more marketable for children(!), which I find impossible to comprehend, but apparently this was what U.S. distributors had in mind. Furthermore, a bombastic Les Baxter score was added, a common treatment for most U.S releases of Italian films in that period, instead of the charming jazzy score in the Italian version (and a very catchy theme song). \n\nLetícia Román stars as a young American woman who loves reading mystery novels. In fact, she's seen reading a detective novel called \"The Knife\" when we meet her on the plane. She plans to stay with her aged aunt, but one evening, the old lady dies before her eyes. When she stumbles upon the streets, she witnesses a woman stabbed to death in front of the Spanish Steps and suspects it's the work of a serial killer. Going unconscious, she awakens in the hospital and tries to convince everyone she witnessed a murder, but since no body was found, nobody believes her. She does convince a young doctor (John Saxon) to help her investigate the murders, and they soon find out a series of murders was committed ten years ago, the \"Alphabet Murders.\" She realizes that previous victims had surnames beginning A, B and C and, because her name starts with a D, she could be the next victim.\n\nThis is often cited as the first Giallo, that specific Italian breed of thriller, named after the line of books with yellow covers, hence Giallo, Italian for yellow. THE GIRL WHO KNEW TOO MUCH basically contains most core elements attributed to this particular cinematic sub-genre, with the prime motive of the helpless heroine subjected to all kinds of dangers and physical as well as mental abuse. Nora Davis is seen reading a Giallo novel on the airplane; the foreigner as vulnerable outsider in Italy; an obsession with travel and tourism, the first murder takes place before the Spanish Steps, but the film shows countless tourist hotspots throughout Rome, and the fascination with fashion and style or the jet-set in general. Although it would take Bava's own BLOOD AND BLACK LACE (1964), lavishly shot in colour, to introduce the more elaborate, lengthy and - above all - much more violent and bloody killing sequences which would typify many later Giallos, carried out by the archetype Giallo killer with gloves and black raincoat. Wide-eyed Letícia Román is the kind of innocent looking girl with just the right combination of sexiness and innocence to pass as a very likable heroine, perhaps a touch too innocent and certainly worlds away from the sexually liberated female in later Giallos.\n\nEarly sixties' fashions and habits abound, such as Nora Davis' exuberant snake leather jacket. There's also a lot of smoking on the plane and later on Nora condones Marcello's smoking habits claiming it's bad for his health, which is presented as the audience is supposed to laugh at her \"preposterous\" observation, instead of Marcello's smoking habit. Typical role reversal. There's also the running gag with marijuana. In the first scene, the man next to Nora on the plane turns out to be a marijuana smuggler, but on arrival in Rome, the always alert Italian police is quick to take this character into custody. Perhaps Bava's way of saying the Italian police is always on top of these issues and malicious elements from abroad are dealt with in proper fashion.\n\nMasterfully shot in black-and-white, the film doesn't contain the outrageous imagery of THE BODY AND THE WHIP (1963) and BLOOD AND BLACK LACE, both sumptuously shot in colour, and certainly is much lighter in tone with the sadistic bloodletting so typical of that other pivotal entry in the development of the Giallo, BLOOD AND BLACK LACE, largely lacking. Originally, it was conceived as a romantic comedy and - hence the title - as a light parody on Hitchcock's work, but Bava decided to put a larger emphasis on the more horrific elements of the story, but doesn't lose sight of the plot development, which I always found a major demerit of BLOOD AND BLACK LACE. A bit old-fashioned perhaps by American or British standards, but combining these elements with a more typical Italian tone, Bava does create something new here. Nevertheless, the tone remains conspicuously breezy and that's probably why this film turns out to be such an endearing mixture of clever Hitchcockian suspense and the occasional comedy relief. Perhaps a bit too cutesy and innocent for many Bava-fans, but I found his a thoroughly enjoyable film. \n\nCamera Obscura --- 8/10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A mystery novel-loving American tourist witnesses a murder in Rome, and soon finds herself and her suitor caught up in a series of killings.",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2726412825",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODRmMmYyZWYtZWQ4ZC00YTk1LTk1YWEtNThjZjkzYjc2YTA5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODRmMmYyZWYtZWQ4ZC00YTk1LTk1YWEtNThjZjkzYjc2YTA5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-05-07T18:03:35.338Z",
        "url": "https://www.imdb.com/video/vi2726412825/"
    },
    "url": "/title/tt0057443/"
}