{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Max von Sydow",
            "url": "/name/nm0001884/"
        },
        {
            "@type": "Person",
            "name": "Dorothy McGuire",
            "url": "/name/nm0570192/"
        },
        {
            "@type": "Person",
            "name": "Charlton Heston",
            "url": "/name/nm0000032/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10884,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0117169/"
        },
        {
            "@type": "Person",
            "name": "Fulton Oursler",
            "url": "/name/nm0653617/"
        },
        {
            "@type": "Person",
            "name": "Henry Denker",
            "url": "/name/nm0219281/"
        },
        {
            "@type": "Person",
            "name": "James Lee Barrett",
            "url": "/name/nm0057157/"
        }
    ],
    "datePublished": "1965-04-09",
    "description": "An all-star, large scale epic movie that chronicles the life and ministry of Jesus Christ.",
    "director": [
        {
            "@type": "Person",
            "name": "George Stevens",
            "url": "/name/nm0828419/"
        },
        {
            "@type": "Person",
            "name": "David Lean",
            "url": "/name/nm0000180/"
        },
        {
            "@type": "Person",
            "name": "Jean Negulesco",
            "url": "/name/nm0624535/"
        }
    ],
    "duration": "PT4H20M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU4NDQ3Mzg3Ml5BMl5BanBnXkFtZTcwNjg5MTkzNA@@._V1_.jpg",
    "keywords": "beating,torture,death,self immolation,reference to satan",
    "name": "The Greatest Story Ever Told",
    "original_info": {
        "id": "The Greatest Story Ever Told: Bonus Material_1965",
        "name": "The Greatest Story Ever Told: Bonus Material",
        "year": "1965"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "artemis_5"
        },
        "dateCreated": "2004-08-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059245/"
        },
        "name": "von Sydow Struggles Under Greatest Role Ever Played",
        "reviewBody": "The story of Jesus Christ may be the greatest story ever told, but George Stevens movie does not provide the most convincing telling of that story. In spite of beautiful cinematography and music, there is something missing of the power of other tellings. With the exception of a couple of scenes, Max von Sydow does not seem quite up to the role, despite clearly being a good actor. This is not necessarily von Sydow's fault, as it takes more than great acting to convince the audience that you are the character. Imagine Ingrid Bergman as Scarlett O'Hara instead of Vivian Leigh or Gregory Peck as Rhett Butler. Max von Sydow has moments of passion and succeeds in occasionally moving you, but somehow seems too much like the actors who play his apostles to distinguish himself from them, a necessary feat for an actor who hopefully is surrounded by twelve other good actors at all times.\n\nMax von Sydow's highlights are the raising of Lazarus from the dead and the sequence of his entry into Jerusalem and speech at the temple. In fact, I would say that for those two scenes, he outdoes many of his fellow actors that have donned the robe of Jesus. But two scenes are not enough to carry the movie. In fact, with all my respect to the impressive cast which participated in this movie, Stephens seems to have completely missed the mark when it came to casting a few of the roles: Ed Wynn of \"Mary Poppins\" fame as the blind man, John Wayne as a Roman centurion, and Shelley Winters as \"Woman of no name.\" On the other hand, few actors can portray the almost fanatic mania of John the Baptist, \"a voice crying in the wilderness,\" like Charlton Heston. Jose Ferrer also puts in a good performance as Herod Antipas, and Roddy McDowall convincing plays both a smart aleck and a reverent follower. His exchange with Jesus over collecting taxes offers one of the few somewhat humorous moments.\n\nIt is not a surprise to learn that George Stevens put so much effort into his movie. Like Mel Gibson with \"The Passion of the Christ,\" \"Greatest Story\" is like a painting, with each stroke carefully put onto the canvas. However, unlike Gibson, whose characters seem right out of 1st Century Judah, there is modern quality to Stephens film. There are, however, more positive aspects to this film than negative. Besides the cinematography and the wise choice of Hendel's beautiful \"Messiah\", other positives are showing Mary Madgelene as traveling with the apostles (there is even a wonderful little scene where Mary annoints Jesus with oil which shows a kind of intimacy between them lacking from other versions of the story).\n\nWhile some commentators have criticized the screenplay, I think it is one of the best. As much as it pains me to say this, I think casting alone made this movie less powerful. Still I recommend that everyone see it at least once."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3004481817",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDk4ODc2NGYtZWMxMS00Y2EzLWFiYmYtOWZmNmUxMTY3YWExXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDk4ODc2NGYtZWMxMS00Y2EzLWFiYmYtOWZmNmUxMTY3YWExXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-12-21T14:44:29.002Z",
        "url": "https://www.imdb.com/video/vi3004481817/"
    },
    "url": "/title/tt0059245/"
}