{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Marcelo Games",
            "url": "/name/nm0303925/"
        },
        {
            "@type": "Person",
            "name": "Marc Pitman",
            "url": "/name/nm0685745/"
        },
        {
            "@type": "Person",
            "name": "Leslie Orr",
            "url": "/name/nm0650574/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3301,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071279/"
        },
        {
            "@type": "Person",
            "name": "Jim Van Bebber",
            "url": "/name/nm0885666/"
        }
    ],
    "datePublished": "2004-10-22",
    "description": "A dramatization of the horrific and notorious Manson Family Murders, in the form of super 8 home movies.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Van Bebber",
            "url": "/name/nm0885666/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Crime",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc4MjUzMDIwMV5BMl5BanBnXkFtZTYwNDg4MDY2._V1_.jpg",
    "keywords": "retro,retro horror,charles manson character,family character name as title,female full frontal nudity",
    "name": "The Manson Family",
    "original_info": {
        "id": "The Manson Family_2004",
        "name": "The Manson Family",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "random_avenger"
        },
        "dateCreated": "2010-10-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118840/"
        },
        "name": "The Manson Family",
        "reviewBody": "Of all the highly publicized American murder cases of the 20th century, the massacres committed by cult leader Charles Manson's followers in 1969 are probably the most infamous. Despite never personally killing anyone, Manson is still often seen as some kind of embodiment of evil and thus an object of constant curiosity. Several films have been made about \"The Family\" over the decades, one of them being Jim Van Bebber's semi-mocumentary finally released in 2003 after having been in production for nearly 15 years.\n\nThe frame story of the warped cinematic trip takes place in 1996 when a TV reporter named Jack Wilson (Carl Day) is preparing to interview the incarcerated Family members for his program. Some kind of strange modern followers of Manson have sent him a videotape and are not going to leave their interference at that. The bulk of the film consists of faux-interviews with the Family members and psychedelic flashbacks of scenes from the time preceding the murders. The interviewees Leslie, Bobby, Sadie, Patty and Tex seem to regret their actions, while Manson himself is only seen in the flashbacks as portrayed by Marcelo Games.\n\nInstead of a clear, tightly-written plot the jumpy movie favours a fragmented sensory mindf**k kind of approach to its subject. The film's exploitation roots become highly evident during the long home video-like flashbacks illustrating the interviewees' memories full of hazy drug use and gratuitous nudity and sex. The lighting is mostly very richly coloured in red or blue, creating a fittingly otherworldly feel to the scenes of cult bonding under the influence of the charismatic Manson who is seen entirely through the eyes of his followers: he doesn't speak much and remains a distant character throughout. The intentionally grainy, worn-out and damaged look of the film (not only the flashbacks) strengthens the alienating atmosphere as well.\n\nAt times the film effectively captures the distressing, insane state of mind that the Family members can be imagined to have been in. The Devil worshipping orgy is a highlight among the bizarre scenes, but the colourfully lit final massacres testing the audiences' tolerance to excessive gore are a must see for any fan of hard horror too. The prolonged knife violence and maniacally laughing killers are pretty much what people (or at least me) are looking for in sleazy trash movies like this one anyway, so in that sense Van Bebber and Co. have achieved their goal with flying colours. Perhaps some of the acting is not the most realistic ever, but I cannot consider that a major flaw in a film that is so heavily focused on the effects of brainwashing and not being in touch with one's regular self.\n\nIn a way The Manson Family is a relative of Oliver Stone's controversial media satire Natural Born Killers (1994), but ultimately comes across as sleazier and more nihilistic since the satirical aspect is less pronounced. I am not sure if the filmmakers have taken a lot of artistic license with the presentation of how the actual events took place; in the end it doesn't even matter since the movie never strives to be an accurate portrait of Manson as a person. As an examination of disturbing group psychosis it works enjoyably and is recommended to those into exploitative true crime stories.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0118840/"
}