{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Hugh Bonneville",
            "url": "/name/nm0095017/"
        },
        {
            "@type": "Person",
            "name": "Stephen Dillane",
            "url": "/name/nm0226820/"
        },
        {
            "@type": "Person",
            "name": "Lesley Manville",
            "url": "/name/nm0544334/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 386,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0123022/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041824/"
        }
    ],
    "datePublished": "2001-06-22",
    "description": "Mini-series adapted from a series of novels that's set at the estate of a large privileged Sussex family and follows their life in London between the years 1937 and 1947.",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUyMjA0Mzg0NF5BMl5BanBnXkFtZTYwODk1ODk4._V1_.jpg",
    "keywords": "family relationships,rape,pregnancy,pacifist,death",
    "name": "The Cazalets",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rps-2"
        },
        "dateCreated": "2001-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283280/"
        },
        "name": "Hudson would not approve",
        "reviewBody": "The new PBS series \"The Cazalets\" is billed as a latter day \"Upstairs Downstairs.\" It isn't. The characters are far less finely formed and the first episode was a back to back (well, front to front) series of graphic sexual couplings. Set in England on the eve of WW2, it appears that nobody in the British Isles did anything in 37 and 38 other than bonk each other. Marital sex. Extra marital sex. Violent sex. Lesbian sex. Even incest. And this was only episode one! What can we expect in coming weeks? Kinky sex? SM sex? Bestiality? Really! This is not the mandate of either PBS or BBC. There are x-rated channels for such voyeurism.\n\nThe first episode also has some glaring errors. The word \"flak\" is used twice. A German acronym for \"fliegerabwehrkanonen\" or \"anti aircraft guns\", it entered the language only in the early years of the war and would have been in no-one's vocabulary in 37 and 38.\n\nThe first episode also shows the servants gathered around a small radio listening to Neville Chamberlain's address. Small radios were rare in 1938 and they certainly were not in plastic cases. There also appear to be no antenna or ground wires, essential elements of the receivers of the period. I spotted these two errors because they fall within my knowledge. How many others might there also have been?\n\nIt's an interesting snapshot of an interesting period of history. But like most snapshots, it was done without much thought or artistry."
    },
    "url": "/title/tt0283280/"
}