{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harrison Ford",
            "url": "/name/nm0000148/"
        },
        {
            "@type": "Person",
            "name": "Tommy Lee Jones",
            "url": "/name/nm0000169/"
        },
        {
            "@type": "Person",
            "name": "Sela Ward",
            "url": "/name/nm0000688/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 302089,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044240/"
        },
        {
            "@type": "Person",
            "name": "Jeb Stuart",
            "url": "/name/nm0835732/"
        },
        {
            "@type": "Person",
            "name": "David Twohy",
            "url": "/name/nm0878638/"
        },
        {
            "@type": "Person",
            "name": "Roy Huggins",
            "url": "/name/nm0400403/"
        }
    ],
    "datePublished": "1993-08-06",
    "description": "Dr. Richard Kimble, unjustly accused of murdering his wife, must find the real killer while being the target of a nationwide manhunt led by a seasoned U.S. Marshal.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Davis",
            "url": "/name/nm0001112/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmFmOGZjYTItYjY1ZS00OWRiLTk0NDgtMjQ5MzBkYWE2YWE0XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "one armed man,on the run,u.s. marshal,surgeon,chicago illinois",
    "name": "The Fugitive",
    "original_info": {
        "id": "The Fugitive_1993",
        "name": "The Fugitive",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cariart"
        },
        "dateCreated": "2003-09-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106977/"
        },
        "name": "One of the Great Thrillers!",
        "reviewBody": "There is a kind of magic when a superb cast, a truly gifted director, and a literate script with equal parts 'over-the-top' action, riveting suspense, and rich characterization, come together. The end result attains a luster that only grows through the years, as new audiences, through DVD and VHS, experience the same excitement we felt, viewing it on a theater screen. In the last decade, only a handful of suspense films could be called 'great'...and on top of the list is THE FUGITIVE.\n\nBased on the popular David Janssen TV series, the film faithfully follows the same premise; a doctor is accused of his wife's death, but escapes before his execution, and tracks down the 'one-armed man' responsible for the murder, as a driven law officer attempts to recapture him. Being a big-budget film, however, the scale of everything is expanded...Dr. Richard Kimble is now a brilliant vascular surgeon, at a major Chicago hospital; the handicapped killer is a dirty ex-cop working on orders from crooked board members of a billion-dollar pharmaceutical firm; and the lawman is no longer a solitary police lieutenant, but a deputy United States Marshal, and his team of agents! While some fans of the original series complained that the 'intimacy' the series had was lost, director Andrew Davis only used the 'bigger' aspects as plot elements, placing the focus, wisely, on the dual stories of Kimble's search, and Gerard's pursuit.\n\nDespite the esteem the film has achieved over the years, Harrison Ford has gotten a bad rap for his very understated performance as Richard Kimble. While Tommy Lee Jones certainly had a far flashier role (earning him an Oscar as 'Best Supporting Actor'), Ford's intent wasn't to play 'Indiana Jones', but a man whose whole life was dedicated to his career as a surgeon, and his wife (played, in flashbacks, by the lovely Sela Ward). Seeing his wife brutally murdered devastated him (his scene in the police interrogation room, going to pieces, was largely improvised on the set, and displays some of his finest acting). His search for the killer was not the confident quest of an action hero, but based on uncertain, spur-of-the-moment decisions made by a desperate man, whose medical background was his only tool. Fear does not lend itself to flashy theatrics...\n\nJones, as Marshal Sam Gerard, on the other hand, was a seasoned veteran, the best at what he did, and pursuing a fugitive was 'old hat' for him. With a confidence bordering on arrogance, he ordered people about like chess pieces, multi-tasked without breaking a sweat, and still could charm with a wicked smile and sarcastic remark. Of COURSE he wins the audience's heart!\n\nFeaturing some of the most spectacular action scenes ever recorded on film (the train/bus wreck that frees Kimble, the dive off a dam into the churning maelstrom of the reservoir), as well as two slam-bang fistfights when Kimble finally gets 'justice', THE FUGITIVE still is remembered primarily for the suspenseful Jones/Ford 'cat-and-mouse' chase, cross-country, and the grudging respect that grows between them...which, ultimately, was what the TV series was best remembered for, as well.\n\nThere is magic, here!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2388441881",
        "name": "20th Anniversary Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGY4NDg2OTktMjJlYi00YWI0LThhNGEtMTk1NWVkMzgxN2IxXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGY4NDg2OTktMjJlYi00YWI0LThhNGEtMTk1NWVkMzgxN2IxXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-09-14T21:42:37.079Z",
        "url": "https://www.imdb.com/video/vi2388441881/"
    },
    "url": "/title/tt0106977/"
}