{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carole Bouquet",
            "url": "/name/nm0000962/"
        },
        {
            "@type": "Person",
            "name": "Gérard Depardieu",
            "url": "/name/nm0000367/"
        },
        {
            "@type": "Person",
            "name": "Charles Berling",
            "url": "/name/nm0075650/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 619,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "alternateName": "The Bridge",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039740/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079764/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004038/"
        },
        {
            "@type": "Person",
            "name": "François Dupeyron",
            "url": "/name/nm0243191/"
        },
        {
            "@type": "Person",
            "name": "Alain Leblanc",
            "url": "/name/nm0495658/"
        }
    ],
    "datePublished": "1999-04-07",
    "description": "The world of a young housewife is turned upside down when she has an affair with a free-spirited engineer.",
    "director": [
        {
            "@type": "Person",
            "name": "Frédéric Auburtin",
            "url": "/name/nm0041474/"
        },
        {
            "@type": "Person",
            "name": "Gérard Depardieu",
            "url": "/name/nm0000367/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjI3MDcwNzAxMV5BMl5BanBnXkFtZTcwODI2NjgyMQ@@._V1_.jpg",
    "keywords": "france,normandy france,1960s,semi autobiographical,son",
    "name": "Un pont entre deux rives",
    "original_info": {
        "id": "The Bridge_1999",
        "name": "The Bridge",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2006-03-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0191610/"
        },
        "name": "yet another French film about adultery",
        "reviewBody": "Hmm,....I've seen a lot of French films in the last year and have found that quite a few of them concern adultery. So, I found myself a bit tired of the plot line already before I even began watching this film.\n\nCarole Bouquet is a middle-aged woman married to Gerard Depardieu. She's an awfully pretty lady who's a housewife and he's a very traditional working man. Unknown to him, she wants more out of life. She never tells him anything so he assumes the marriage is fine. Well, he's out of work and needs a job so he has to work several hours away and only come home on the weekends. Since she is bored, she doesn't try very hard not to become involved with another married man. During all this, she does a lousy job of concealing it from her teenage son--eventually this selfish and carefree approach towards her son will result in consequences (the best part of the film I think because it actually shows the damage this behavior can have on the kids). Depardieu finds out but doesn't respond like a clod--in fact, he's very quick to forgive her and take her back. His character is just too decent about it. He also vows that if she's bored, he'll do anything to change things. But, she's extremely self-centered and runs off with her lover.\n\nI actually liked the film better than most of the French \"adultery movies\" because you can see negative consequences. I think for those who think adultery is an evil, there's enough there to prevent the movie from glorifying it. And, interestingly enough, I could also see the movie being taken as a \"do it if it makes you feel good\" film by those who think adultery is a legitimate alternative. It's interesting, though, how often in films the message appears to be that it is your partner's job to make you happy--and isn't YOUR responsibility to make yourself happy. That's just my \"two cents worth\". I would have liked it if the film had focused more on this, but this is only a minor quibble.\n\nWell-acted and interesting, but not a great film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0191610/"
}