{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lana Turner",
            "url": "/name/nm0001805/"
        },
        {
            "@type": "Person",
            "name": "John Garfield",
            "url": "/name/nm0002092/"
        },
        {
            "@type": "Person",
            "name": "Cecil Kellaway",
            "url": "/name/nm0445523/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21745,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Harry Ruskin",
            "url": "/name/nm0750822/"
        },
        {
            "@type": "Person",
            "name": "Niven Busch",
            "url": "/name/nm0124002/"
        },
        {
            "@type": "Person",
            "name": "James M. Cain",
            "url": "/name/nm0128906/"
        }
    ],
    "datePublished": "1946-09-06",
    "description": "A married woman and a drifter fall in love, then plot to murder her husband.",
    "director": [
        {
            "@type": "Person",
            "name": "Tay Garnett",
            "url": "/name/nm0307819/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTdlMGYzNzYtYjBjYy00OGZjLTkwN2EtYTY1YjYxZjgxZWZkXkEyXkFqcGdeQXVyNTcwNjUwNzk@._V1_.jpg",
    "keywords": "murder of husband,older husband younger wife relationship,drifter,district attorney,fatal attraction",
    "name": "The Postman Always Rings Twice",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Itchload"
        },
        "dateCreated": "2003-01-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038854/"
        },
        "name": "Very oddly structured movie",
        "reviewBody": "I was not expecting a classic film noir along the lines of \"Double Indemnity\" or \"Out of the Past\" when I put this movie in, and for awhile, I thought I might have been wrong. Maybe the cover was too cheesy, I'm not sure, but I didn't have extra high hopes for this movie. Then my mood brightened when it actually started to become very entertaining. I wasn't being blown away, but I did start to enjoy the film noir 101 plot. The reviewer who noted MGM's dramatic lighting of Turner is right, it's ridiculous, but it does come with the territory I guess. Other than that, things seemed to be moving in place very smoothly.\n\nThen an odd thing happened. The movie refused to end. It wasn't that the pace was slow, it moved speedily. Something was always happening, and there was plenty of suspense/overblown MGM music blaring out of the speakers at any given moment. But the plot was way too top-heavy. They get caught doing the murder. Okay, time for trial, some final irony, then the movie's over. But it's not! It just kept going. New subplots turned up, bribes, plot twists, double crosses, it just kept happening and happening. It was too much. I was literally standing up sweating by the final scene, wanting it to end so much. The problem was, nothing of any substance was given to the events that kept happening. It was like the screenwriters noted \"okay, this happened in the book, but we have to trim it a bit, so we'll make a small 2 minute scene including it in the movie\" and suddenly the movie is full of these large occurrences given very brief sketched out screen time. Garfield runs off for a weekend in Tijuana with some random women? What just happened? Things just grew too implausible. I realize that complaining the movie went on too long and claiming that not enough screen time was given to all the events in the second half is hypocritical, but there must have been ways to flesh things out. I haven't read the book, but I suspect it's much better than the movie, just based on other reviewer's comments.\n\n During the final embarassing \"what does God make of all this\" speech to the priest (hey, I thought film noirs where supposed to be existential!), I happened to look at the video case and glance at the title. Realizing it hadn't been referenced in the movie yet I stared at the screen and muttered \"out with it\" and in return got some over-reaching ramblings concerning how \"he always rings twice, always rings twice\" ext. Yikes.\n\n I have to say though, the movie had some very good irony and employed a load of classic film noir tricks (the final outcome must have influenced the Coen Brothers with \"The Man Who Wasn't There\"), but I can't help believing the book must have been a lot better. I'd chalk this one up for noir completists and Golden Age MGM enthusiasts only.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from MGM",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1520764185",
        "name": "The Postman Always Rings Twice",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDIzYjg5YzctNjgxZS00MzIxLTliZTItYjZmNGE5ODQ2OGM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDIzYjg5YzctNjgxZS00MzIxLTliZTItYjZmNGE5ODQ2OGM3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T06:20:42Z",
        "url": "https://www.imdb.com/video/vi1520764185/"
    },
    "url": "/title/tt0038854/"
}