{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Albert Finney",
            "url": "/name/nm0001215/"
        },
        {
            "@type": "Person",
            "name": "Tom Courtenay",
            "url": "/name/nm0183822/"
        },
        {
            "@type": "Person",
            "name": "Edward Fox",
            "url": "/name/nm0002081/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5442,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045569/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0184077/"
        },
        {
            "@type": "Person",
            "name": "Ronald Harwood",
            "url": "/name/nm0367838/"
        }
    ],
    "datePublished": "1983-12-06",
    "description": "Personal assistant Norman struggles to get deteriorating veteran actor Sir through a difficult performance of King Lear.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Yates",
            "url": "/name/nm0946811/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGUxNDAwZmEtODg4Ni00NjJmLWExZDktMTg1NTQzZGY0MjQ5XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "gay slur,unrequited love,effeminacy,gay interest,homosexual subtext",
    "name": "The Dresser",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "l_rawjalaurence"
        },
        "dateCreated": "2014-10-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085461/"
        },
        "name": "Valuable Recreation of an Important Moment in British Theatrical History",
        "reviewBody": "Based on Harwood's successful play of 1980, THE DRESSER details the relationship between \"Sir\" (Albert Finney), an actor/manager of the old school and Norman, his dresser (Tom Courtenay).\n\nSet largely in and around the streets of Bradford, Yorkshire, Peter Yates' film offers a vivid recreation of performing Shakespeare during an air-raid, when the actors had to announce to the audience that they would continue the play, despite the risk of being hit by a stray bomb. To a man and a woman, the audience stay put to enjoy \"Sir\" playing King Lear; this was precisely what happened in most theaters. Yates captures the cramped backstage conditions in a Victorian theater (part of the No.1 touring circuit); the dressing- rooms shared by most of \"Sir\"'s company, and the cramped wings where the actors waited for their entrances and exits, while the backstage staff (such as they were) had to provide the sound-effects using primitive materials such as a kettledrum, a wind-machine and a thunder sheet. With little or no real opportunity to purchase new things, the company have to make do and mend: for example, purchasing cornflour to use as impromptu make-up for their Shakespearean repertoire.\n\nBased partly on the experiences of Donald Wolfit - who was not a 'ham' actor (as some reviewers have suggested), but a performer of the old school - THE DRESSER shows \"Sir's\" dedication to continue touring, despite being manifestly unable to do so. Tormented by the ghosts of actors past, he believes that he can no longer give of his best; the only way he can be patched up to go onstage is through Norman's continual promptings. Finney captures the monstrous egotism of the man - who can be downright cruel to his fellow-actors yet in the next moment behave like a baby needing comfort from his carers. \"Sir's\" acting-style can best be described as full-on, complete with extravagant gestures and meaningful pauses. It might seem exaggerated to modern viewers, but to wartime audiences in England his productions provided much-needed respite from the strains of having to survive. The production design (by Stephen Grimes) owes a lot to Wolfit's inspiration; \"Sir's\" costume as Lear, and the settings are both based on the designs used in the actor/manager's stage production, which played from 1943 to 1953.\n\nAs Norman, Tom Courtenay is a protean figure - at once solicitous, angry, kind, vain, jealous and loyal. His entire life revolves around \"Sir\"; however much he might object to his employer's behavior. At the end he is bereft, as Sir passes away, and Norman wrings his hands and wails \"What am I going to do?\" Like the loyal stage-manager Madge (Eileen Atkins), he has been working in this touring company for a long time with no real thanks; and the fact that his name has been omitted from Sir's dedication in the opening paragraph of his (unfinished) autobiography proves especially galling for the Dresser. On the other hand, both Norman and Madge emphasize the strong sense of loyalty that dominated the old touring companies; despite meager salaries, poor living-conditions and indifferent treatment from their employer, they refused to do anything else, in the belief they were part of \"one big happy family.\" \n\nThe casting of minor roles in THE DRESSER has been carefully thought out. Lockwood West makes an endearing Geoffrey, an elderly actor pitchforked into playing the role of Lear's Fool, although manifestly unsuited to the role. His equally elderly colleague Horace Brown is played by Llewellyn Rees, whose previous employment included a spell as Donald Wolfit's company manager in the early Fifties. Edward Fox turns in a malicious performance as Oxenby, a lame actor with a barely-suppressed hatred for Sir's authority.\n\nAlthough three decades old, THE DRESSER remains a highly entertaining piece, as well as being a valuable recreation of an important moment in British theatrical history which remains comparatively neglected by scholars.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2532376857",
        "name": "The Dresser (1983)",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTVjNjRjM2UtODdlYi00ODM1LWJlY2ItYmU5ZDQzNDFjNDVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTVjNjRjM2UtODdlYi00ODM1LWJlY2ItYmU5ZDQzNDFjNDVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:39:50Z",
        "url": "https://www.imdb.com/video/vi2532376857/"
    },
    "url": "/title/tt0085461/"
}