{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lee Marvin",
            "url": "/name/nm0001511/"
        },
        {
            "@type": "Person",
            "name": "Mark Hamill",
            "url": "/name/nm0000434/"
        },
        {
            "@type": "Person",
            "name": "Robert Carradine",
            "url": "/name/nm0001019/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20423,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059627/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038016/"
        },
        {
            "@type": "Person",
            "name": "Samuel Fuller",
            "url": "/name/nm0002087/"
        }
    ],
    "datePublished": "1980-07-18",
    "description": "A hardened sergeant and the four core members of his infantry unit try to survive World War II as they move from battle to battle throughout Europe.",
    "director": [
        {
            "@type": "Person",
            "name": "Samuel Fuller",
            "url": "/name/nm0002087/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGM3MmI0ZDUtYzE1ZS00YWE4LWEzY2UtNjhiZTBiZTEyMzY1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "western front of world war ii,nazi soldier,u.s. army,infantry,year 1945",
    "name": "The Big Red One",
    "original_info": {
        "id": "The Big One_1998",
        "name": "The Big One",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jay4stein79-1"
        },
        "dateCreated": "2004-11-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080437/"
        },
        "name": "Among the greatest WWII epics",
        "reviewBody": "A lot of people hate The Big Red One. They call it farcical, uneven, clichéd. They find it farcical, I believe, because the film revels in the absurdity of war rather than gloss over it. They would rather watch a film, like Saving Private Ryan, which ignores absurdity in favor of violence. These people find it uneven because the \"important scenes\" (like the D-Day and North African invasion) take only a minute or two to conclude, while other scenes, less typical of a war movie, spread out before us. They call it clichéd because the movie is unsubtle in its treatment of character development and plot.\n\nI cannot agree with these beliefs. The Big Red One is not only one of the greatest WWII films, it is also one of the greatest war movies.\n\nSam Fuller's film, which was butchered by the studio, is the picaresque tale of 5 members of the First Infantry, known, because of their shoulder patch, as the Big Red One. The film moves from one story to the next without spending too much time on any particular tale.\n\nThe individual vignettes, as they must, vary in quality, but on the whole are excellent. The Big Red One stirs within you a desire to run right out and tell your friends about this amazing scene or that.\n\nThere's the soldier who loses his testicle, the birthing scene in the belly of a tank, Lee Marvin, in Middle Eastern garb, traipsing across a beach, soldiers dug into holes over which a Panzer tank division travels, the entire Mad House segment... The list goes on.\n\nSome people dislike the absurdest nature of several of this film's stories, but, for me, those surreal touches make this film great.\n\nWithout them (and there are a lot), you would be left with a very normal and very boring film. Using bandoleers as stirrups is genius, as is the woman faking crazy as she whirls through a monastery, slicing German throats.\n\nThe performances are solid, for this type of film, but if you are looking for subtlety, go elsewhere. Each character is drawn in broad strokes; you never learn too much about them, but you learn enough to understand who they are and why. Lee Marvin, as usual, is amazing. He is one of the great, gruff actors of our time, bringing a special, intangible quality to every film in which I've seen him. He makes every movie he's in better just by showing up. There are too few actors about whom you can say that.\n\nLike the acting, the direction is masculine, but, for a war movie, that's a compliment. In some ways, Fuller's direction here and in his other films reminds me of Hemmingway's writing - terse and effective. Both men believe in an economy of shots or words, depending on their medium, but, through that economy, they attain a muscular sort of poetry akin to the beauty of a horse's rippling muscles as it races on a plain. Fuller's direction here, though not his best when compared to Underworld USA or Shock Corridor, is still better than most, especially considering that this was his first film in several years.\n\nAll in all, I find the Big Red One to be an exemplary war movie, even in its emasculated format (I cannot wait to see the restored, 140 minute print, which should improve upon scenes that feel to brief in this version). It's certainly no Apocalypse Now, but it puts to shame most World War II epics before or since."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3283009049",
        "name": "The Big Red One",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGFkMTAzOTItYTg3Ni00NmQwLWJmYTEtOGVlZjNjZWFkNWM1XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGFkMTAzOTItYTg3Ni00NmQwLWJmYTEtOGVlZjNjZWFkNWM1XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-14T17:04:40.390Z",
        "url": "https://www.imdb.com/video/vi3283009049/"
    },
    "url": "/title/tt0080437/"
}