{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Burt Lancaster",
            "url": "/name/nm0000044/"
        },
        {
            "@type": "Person",
            "name": "Lee Marvin",
            "url": "/name/nm0001511/"
        },
        {
            "@type": "Person",
            "name": "Robert Ryan",
            "url": "/name/nm0752813/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17528,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073957/"
        },
        {
            "@type": "Person",
            "name": "Frank O'Rourke",
            "url": "/name/nm0642543/"
        },
        {
            "@type": "Person",
            "name": "Richard Brooks",
            "url": "/name/nm0112218/"
        }
    ],
    "datePublished": "1966-11-04",
    "description": "An arrogant Texas millionaire hires four adventurers to rescue his kidnapped wife from a notorious Mexican bandit.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Brooks",
            "url": "/name/nm0112218/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY0OWNiZTQtZGY4MS00YmJlLTg4YzEtMmE3YTVkMDM3ODRlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "ammunition belt,mexico,mexican revolution,cartridge belt,barefoot woman",
    "name": "The Professionals",
    "original_info": {
        "id": "The Professionals_1966",
        "name": "The Professionals",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "A_Roode"
        },
        "dateCreated": "2006-09-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0060862/"
        },
        "name": "One of the most beautifully shot and under-watched Western classics.",
        "reviewBody": "There are so many remarkable things about 'The Professionals.' Conrad Hall was the Director of Photography and was nominated for an Oscar -- he didn't win but he should have. The 1967 Oscar ceremony threw as many awards as it could to 'A Man For All Seasons.' I love watching big, beautiful, widescreen westerns and this is one of the best shot. Hall's use of camera filters, his incredible dust storm and his location scouting were all impeccable. I don't pretend to understand the mechanics of camera photography. I do know, however, when something looks gorgeous. 'The Professionals' is a stunningly beautiful film and it is a shame that it doesn't get a greater audience today.\n\nThe second remarkable thing is the quality of the cast. The top seven actors and actresses billed were top grade lead or supporting actors at one point in their careers: Burt Lancaster, Lee Marvin, Robert Ryan, Woody Strode, Jack Palance, Claudia Cardinale and Ralph Bellamy. It would be interesting to try and add up the number of Oscar nominated pictures and performances that the above group compiled throughout their careers. Even if these seven weren't enough, they get wonderful support from the gorgeous Maria Gomez and reliably ubiquitous Jorge Martinez De Hoyos. Jorge Martinez De Hoyos is a classic Mexican \"Hey! It's That Guy!\" supporting actor and I always welcome seeing him in a picture. He makes much out of a minor part as the goat keeper who wants to 'help.' The lead performances are terrific and well written. This may well be my favorite Woody Strode performance. He (as seemed to happen for him) doesn't get a lot to say, but the value of his character to the group of four professionals is unquestioned and undeniable. When Marvin wants an assault to look like an attack by the Federales, Lancaster may be the guy with the dynamite, but it is Strode firing explosive arrows that makes it happen. Some of his best work where he is a featured player. And I love that when the question of race is brought up by Bellamy, Marvin snorts with contempt that he would have trouble working with a consummate professional of any colour. Strode doesn't lead, but this was a very positive part and showed white and black relying on each other to get a mutual job done. Of the other leads I would add that Lancaster has the best part (much of the humour, action and girls), Marvin is amazing, and Claudia Cardinale is so stunning a beauty it hurts to look at her.\n\nA tougher part was for Robert Ryan. He was maybe too good of an actor for a part that wasn't well written. Ryan is game but I thought his part as the horse handler wasted him. In his later years Robert Ryan was quite sick and he was sick during this production. I don't think he was the problem though. His character is sick for much of the film but as a person, one gets the impression that Ryan was still quite robust. His character doesn't seem to fit in as well or have anything to do. He is adrift. Maybe part of it comes from playing a character who values animal life over human. I say again though that in this movie he is good, but not right for the part.\n\n'The Professionals' is an adventure film and Western filmed in the style of 'The Magnificent Seven' and a model itself for 'The Wild Bunch' which followed. It straddles the worlds of old Western and new Western. It has a moral ambiguity and over-arching plot which makes me think of the film as a kind of Western/Film-noir. When you look at the cast though, Lancaster, Marvin, Bellamy, Palance and of course Ryan were all noir stalwarts of varying degree. Maybe some of that quality is what attracted them to the script.\n\nThis is a great Western that doesn't quite reach the top tier where films like 'The Wild Bunch' sit, but it is high on the second level for me. The ending may not strike some as satisfying and I've seen it argued that this was an attempt with other Westerns to illustrate American interventionist foreign policy of the time. Those conclusions can be discussed by others because I think of the assault on the Hacienda, the time-buying duel in the canyon, Burt's use of explosives in the pass and a terrific opening credits instead. This is a great Western that has been unduly forgotten. I really wish it has won the Oscar for cinematography -- Oscars can make films more marketable and enduring. If you're a fan of Westerns, you're no fan until you've watched 'The Professionals.'",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT3M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1029685017",
        "name": "The Professionals",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2ZmMjQ5N2YtM2Y2My00YjU3LTgxMGEtNDdkMWI0OGVmMmY0XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2ZmMjQ5N2YtM2Y2My00YjU3LTgxMGEtNDdkMWI0OGVmMmY0XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-02-07T23:35:23.922Z",
        "url": "https://www.imdb.com/video/vi1029685017/"
    },
    "url": "/title/tt0060862/"
}