{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Doris Day",
            "url": "/name/nm0000013/"
        },
        {
            "@type": "Person",
            "name": "Philip Brown",
            "url": "/name/nm0114439/"
        },
        {
            "@type": "Person",
            "name": "Todd Starke",
            "url": "/name/nm0823301/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 784,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026936/"
        },
        {
            "@type": "Person",
            "name": "James Fritzell",
            "url": "/name/nm0296091/"
        }
    ],
    "datePublished": "1968-09-24",
    "description": "After spending most of her life in big cities, widow Doris Martin decides to move back to the family ranch.",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk3MjczODkwMF5BMl5BanBnXkFtZTcwNTI2NzAzMQ@@._V1_.jpg",
    "keywords": "actress name in series title,female protagonist,mother son relationship,brother brother relationship,circular staircase",
    "name": "The Doris Day Show",
    "original_info": {
        "id": "The Doris Day Show: Season 1_1968",
        "name": "The Doris Day Show: Season 1",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "oliverpenn"
        },
        "dateCreated": "2005-02-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062558/"
        },
        "name": "Doris Day Quit CBS, She Was Not Fired",
        "reviewBody": "\"Raysond\" wrote this in his/her review: \"due to low ratings and a sorry time slot) to let it go and from there \"The Doris Day Show\" was canceled by CBS. Also during this time the career of singer/actress/producer Doris Day was over and to this day in 1973 officially retired from the entertainment industry where she is living peacefully somewhere in her private estate in Hollywood.\" \n\nNothing could be far from the truth. Yes, CBS dealt Doris Day a \"Ft. Knox Hand\" (that's what VARIETY called it) to Miss Day for her to do a TV series. But, unlike what was reported by Raysond, the series was consistently in the Top 20 it's entire run. Doris Day called it quits with CBS. She had never wanted to do television in the first place: her husband secretly signed her to the CBS contract without her permission. He died, and as Day has said, \"I was delivered to CBS.\" From what I have read, CBS wanted Doris to re-sign and continue the show, but she declined. She did, however, live up to her contract and did the two musical specials that her late husband promised.\n\nMost people are not aware, but Doris' film career was far from over in 1968. Her three films that year (\"Ballad of Josie,\" \"Where Were You When The Lights Went Out\" and \"With Six You Get Eggroll\") should have landed her among the top ten box office stars, but with the news that she would be doing a TV show, Quigley's Poll didn't bother. The fact is, Doris Day's 1968 films out-grossed several of the stars who made the list."
    },
    "url": "/title/tt0062558/"
}