{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jet Li",
            "url": "/name/nm0001472/"
        },
        {
            "@type": "Person",
            "name": "Josephine Siao",
            "url": "/name/nm0796196/"
        },
        {
            "@type": "Person",
            "name": "Michelle Reis",
            "url": "/name/nm0718348/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8066,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "The Legend",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000295/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0083980/"
        },
        {
            "@type": "Person",
            "name": "Kin Chung Chan",
            "url": "/name/nm0150977/"
        },
        {
            "@type": "Person",
            "name": "Susan Godfrey",
            "url": "/name/nm6970271/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Lau",
            "url": "/name/nm0311508/"
        }
    ],
    "datePublished": "1993-03-04",
    "description": "This Hong Kong martial-arts extravaganza tells of evil emperors and true love. The secret Red Lotus Flower Society is committed to the overthrow of the evil Manchu Emperor and his minions. One of his Governors is sent on a mission...",
    "director": [
        {
            "@type": "Person",
            "name": "Corey Yuen",
            "url": "/name/nm0477035/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Action",
        "Comedy",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzU0OTY5NDYtMjJlMC00MzE4LWI4N2EtZjBhOGRhMGNkYzIzXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "platform,kung fu,emperor,secret society,martial arts",
    "name": "Fong Sai Yuk",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "simon_booth"
        },
        "dateCreated": "2003-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106936/"
        },
        "name": "A must-see HK movie",
        "reviewBody": "Fong Sai Yuk I&II were the first 2 HK movies I saw, though an accident of video recording meant that I had to wait at least a year to see the beginning of Pt I and the end of Pt II. Even in incomplete form, the two films were enough to make me an instant fan of HK Cinema (after years of disappointment with the Hollywood fare I'd been exposed to). I think they're possibly the best introduction to the territory's movie industry there could be... if you don't love Fong Sai Yuk, chances are Hong Kong Cinema is not the cinema for you. It's a rare example of everything coming together, if not perfectly then at least very well.\n\nThe solid script from Jeff Lau is the anchor without which the movie would not have succeeded. In typical Jeff Lau style it bounces all over the place, from stupid comedy to high (melo)drama via a little romance and the obligatory gender confusions, and of course leading into the incredibly imaginitive action sequences choreographed by director Corey Yuen and former opera brother Yuen Tak.\n\nThe production values for the movie are very high, if not quite as slick as the Once Upon A Time In China movies they clearly aspire to emulating. Ann Hui is credited as Production Designer here, a rare role for the critically adored director. The cinematography from Jingle Ma is top notch, framing the luscious sets and costumes and the action very well. The soundtrack from James Wong (with regular partner Romeo Diaz) seems a little too close to his score for OUATIC in places, but mostly does a commendable job.\n\nJet Li has said that Fong Sai Yuk is the character that most closely resembles his real personality from all those he's played. From the small time I've spent in Jet's company I'm not sure his self-image is entirely accurate, but he's probably in a better position to judge than me Certainly Fong Sai Yuk is a very likeable chap the way Jet plays him, and you can tell Jet was 100% into the character and the project. Despite this, the show is unequivocally stolen by Josephine Siao Fong-Fong as Fong Sai Yuk's kung fu fighting mother. She plays her character to perfection, showing a fantastic knack for comedy which I'm not sure she ever got to display in her roles when she was \"in her prime\" and also kicking ass in . Sibelle Hu also steals a fair amount of screen as the mother of Fong Sai Yuk's love interest (the beautiful Michelle Reis), and wife of semi-villain Tiger Lui (Chan Chung-Yung?), who also shines with an affably overstated performance. Of all the cast, Fong Sai Yuk's father (Paul Chu Kong?) is probably the only one whose performance is rather weak and forgettable. Main villain Chiu Man Cheuk is conspicuously far more charismatic and convincing than in any other movie he's been in apart from The Blade.\n\nFong Sai Yuk could be described as a light-hearted riff on the wire-fu wave launched by Once Upon A Time In China. Certainly humour is brought to the front here whilst the politics is pushed quite far to the back. Hong Kong humour can be an acquired taste, and the jokes sometimes fall flat in Fong Sai Yuk. Jeff Lau's jokes are generally a bit hit or miss, but he aims so wide that it's not surprising. There are some genuinely funny moments though.\n\nWhen it comes down to it, the action scenes are what really got me hooked when I saw the movies though. Since Tsui Hark raised the bar several notches above anything people had imagined possible for fight scenes when he made Once Upon A Time In China, the Hong Kong choreographers had been engaged in a battle to see who could produce the most inventive and outlandish action scenes. The best of the bunch tended to be in Jet Li's movies, and the fights in Fong Sai Yuk are fine examples of HK creativity. Purists will no doubt cry that the fight scenes rely too heavily on wires, editing and stunt doubles, but I'm sure that Bruce Lee's statement about missing all that heavenly glory applies here. Grandly conceived if not flawlessly executed, the fights in Fong Sai Yuk were especially impressive to these innocent eyes that had never seen action Hong Kong style before. \"How the? What the? Did they just?\" etc etc. I wish they'd spent just a little bit more time tightening up the camera angles and hiding the obvious doubles better, but I can't fault them for ambition. I think the movie won the \"best action\" award that year, which is pretty impressive for a HK movie made in 1993, the year the new wave style reached its peak.\n\nFong Sai Yuk is definitely a movie that has a special place in many fans hearts, even though it does have too many mis-fired jokes and rough edges to be called a true masterpiece. Still a must see for any fan of Hong Kong cinema though, a wonderfully representative example of what makes it so special and unique.\n\nSadly, the DVD owner that wishes to watch Fong Sai Yuk is faced with only 3 choices, none of which are particularly appealing. They are:\n\n1. Original Universe HK DVD with Mono sound. One of the earlier HK DVDs, basically a laser disc badly transfered to the smaller radius medium. Burnt in subs, washed out picture from a dirty print and badly framed such that the picture drifts up and down throughout, sometimes cutting subtitles in half.\n\n2. Universe \"Remaster\" HK DVD with 5.1 sound. New picture transfer that now looks more like VHS than laser disc thanks to excessive edge enhancement, but at last removable subtitles that are clear and easy to read. Unfortunately the disc is totally ruined by the worst 5.1 remix *ever*. Sounds like it was mixed in a bathroom by a monkey with a rat in his head. Crap new sound effects totally mis-timed and with completely random levels, dialogue mixed to fit listeners on a heavy acid trip and... well, it's horrible actually. I tried it for 15 minutes then switched back to the original disc.\n\n3. \"The Legend\" - absurdly retitled and otherwise Disney-fied release that doubtless looks miles better than either HK disc, but is rendered totally worthless by the inexcusable failure to include the original Cantonese language audio and English subtitles. If this is all you've seen, you've not seen the movie at all. It's probably cut by 30 minutes and re-scored with rap music, knowing Miramax's utter contempt for their catalogue and audience.\n\nI think the best versions of the movies I have are still the long play VHS copies recorded from Channel 4 in the UK before I discovered DVD, to be quite honest. A ridiculous state of affairs for such a classic movie!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0106936/"
}