{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Guiry",
            "url": "/name/nm0347509/"
        },
        {
            "@type": "Person",
            "name": "Mike Vitar",
            "url": "/name/nm0899953/"
        },
        {
            "@type": "Person",
            "name": "Art LaFleur",
            "url": "/name/nm0480869/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 95350,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049958/"
        },
        {
            "@type": "Person",
            "name": "David Mickey Evans",
            "url": "/name/nm0262693/"
        },
        {
            "@type": "Person",
            "name": "Robert Gunter",
            "url": "/name/nm0348363/"
        }
    ],
    "datePublished": "1993-04-07",
    "description": "In the summer of 1962, a new kid in town is taken under the wing of a young baseball prodigy and his rowdy team, resulting in many adventures.",
    "director": [
        {
            "@type": "Person",
            "name": "David Mickey Evans",
            "url": "/name/nm0262693/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODllYjM1ODItYjBmOC00MzkwLWJmM2YtMjMyZDU3MGJhNjc4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "baseball,coming of age,original story,female lifeguard,doghouse",
    "name": "The Sandlot",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hu675"
        },
        "dateCreated": "2007-11-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0108037/"
        },
        "name": "Likable family film with plenty of amusing moments and the young cast are appealing.",
        "reviewBody": "Tommy Smalls (Tom Guiry) is the new kid, who moved with his mother (Karen Allen) and his stepfather (Denis Leary) is a suburbans area of Salt Lake City in the summertime. When Smalls becomes curious with a group of kids (Mike Vitar, Patrick Renna, Chauncey Leopardi, Marty York, Brandon Quintin Adams, Grant Gelt, Shane Obedzinski and Victor DiMattia), who plays Baseball all day long in a old baseball field. Smalls is hoping to play with them but he knows nothing about the game. When he tries to play, he's quite bad at all. He can't even throw a ball to the catchers. When he becomes friend with the leader of the game and Smalls starting to like the game. But when his stepfather goes away for business, Smalls take a baseball from his stepfather trophy room. Which without realizing that the ball, he took from the room is actually signed by the Baseball Legend \"Babe Ruth\". Smalls hits his first home run, the ball went over the fence of a old house. But that old house, it has an mean-spirited junkyard dog. Which the kids called him \"The Beast\". Now the kids have to help Smalls to get the ball back before his stepfather comes back from the business trip.\n\nDirected by David M. Evans (First Kid) made an likable family comedy that plenty of funny moments, a good cast and a lot of imagination. The narration of the film will certainly make you remember of the late Bob Clark film \"A Christmas Story\", although the narration of \"The Sandlot\" is sightly heavy-handed at times. This film has a surprise hit, when it was release in the spring of 1993. Fox had another fantasy film about Baseball, which it was \"Rookie of the Year\". James Earl Jones, Art LaFleur and a young Marley Shelton have memorable bit parts in this pleasant comedy as well.\n\nDVD has an sharp anamorphic Widescreen (2.35:1) transfer (Also in Pan & Scan) and an good Dolby Digital 5.1 Surround Sound. DVD also includes an featurette, trailer and TV spots. This film went on to be an modest classic over the year. All the kids have their moments, especially Renna and Leopardi have their comedic moments. The movie slows down a bit during the second act. But it's well made and this picture pleases everyone as well. It's one of the better family movies of the 1990's. Don't miss it. Co-Written by the director. Arliss Howard appears Unbilled. Followed by Two Direct to DVD's. Joe-Dunton-Camera Scope (J-D-C Scope). (****/*****).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2247295257",
        "name": "The Sandlot",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjllMGFiNjgtYzNjNi00YmZlLWJiYjAtODdjYWYwOWU4MjdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjllMGFiNjgtYzNjNi00YmZlLWJiYjAtODdjYWYwOWU4MjdhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:46:31Z",
        "url": "https://www.imdb.com/video/vi2247295257/"
    },
    "url": "/title/tt0108037/"
}