{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jim Broadbent",
            "url": "/name/nm0000980/"
        },
        {
            "@type": "Person",
            "name": "Hugh Laurie",
            "url": "/name/nm0491402/"
        },
        {
            "@type": "Person",
            "name": "Lyndsey Marshal",
            "url": "/name/nm1203457/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 549,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103536/"
        },
        {
            "@type": "Person",
            "name": "Daisy Ashford",
            "url": "/name/nm2446226/"
        },
        {
            "@type": "Person",
            "name": "Patrick Barlow",
            "url": "/name/nm0055271/"
        }
    ],
    "datePublished": "2003-12-26",
    "description": "Nine-year-old Daisy wrote a novel in 1890 about an awkward gentleman meeting a young lady on a train. He invites her to his London home. She wants to meet high society, so he takes her to a lord's country estate.",
    "director": [
        {
            "@type": "Person",
            "name": "David Yates",
            "url": "/name/nm0946734/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5NjM0ODEzNV5BMl5BanBnXkFtZTcwODY4MzcyMQ@@._V1_.jpg",
    "keywords": "high society,social climber,1890s,lord,aristocrat",
    "name": "The Young Visiters",
    "original_info": {
        "id": "The Young Visiters_2003",
        "name": "The Young Visiters",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "adriangr"
        },
        "dateCreated": "2008-06-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0379053/"
        },
        "name": "Not as good as the previous version",
        "reviewBody": "This is the second time Daisy Ashford's famous book has been filmed for UK television. Sadly, this is the less successful version. The whole appeal of the original book was seeing and hearing about the world through the words of a nine year old Victorian girl. Her unique spelling, opinions and ideas - mostly romantic notions about how adults in love behave - make for hilarious reading.\n\nThis BBC TV production changes much of the original material to suit it's own purposes, which completely obliterates the artless innocence of the book. Worse still, they have actually made up new lines, supposedly in the style of the original book, and yet actually left out many of Daisy's original and memorable lines of dialogue along the way! They have also added new characters and even devised new mis-spellings that Daisy Ashford never included...what a mistake! It's impossible to embellish a piece of work as original as \"The Young Visiters\" just for the purposes of padding it out into a full length movie...it's a unique piece of work that sprung from the mind of a nine year old girl, and written circa 1890 - what script writer today could possible emulate that with sufficient accuracy?! So, the overall result is a mildly amusing but perplexing comedy of manners with the characters delivering odd speeches and unfathomable mannerisms, and seemingly unable to spell when they write letters to each other. As a TV programme, it just doesn't make the charm of the book come to life.\n\nThe previous version was made way back in 1984 and seems to have disappeared completely now, it does not seem to be listed under the same title on IMDb...? But it was in fact better than this effort, plus it starred Tracey Ullman, who was hilariously well cast as the pompous Ethel. And the cast got to concentrate much more on the original immortal dialogue, unlike those roped into this mess. None of the humour stands out in the new version, even though it has a stirling cast and a big budget. If you watch this and enjoy it, that's great, but in my opinion the spirit of Daisy Ashford's book has been all but wrung out of it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0379053/"
}