{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbara Stanwyck",
            "url": "/name/nm0001766/"
        },
        {
            "@type": "Person",
            "name": "Henry Fonda",
            "url": "/name/nm0000020/"
        },
        {
            "@type": "Person",
            "name": "Charles Coburn",
            "url": "/name/nm0002013/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 22304,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Monckton Hoffe",
            "url": "/name/nm0388743/"
        },
        {
            "@type": "Person",
            "name": "Preston Sturges",
            "url": "/name/nm0002545/"
        }
    ],
    "datePublished": "1941-03-21",
    "description": "A trio of classy card sharks targets a socially awkward brewery heir, until one of them falls in love with him.",
    "director": [
        {
            "@type": "Person",
            "name": "Preston Sturges",
            "url": "/name/nm0002545/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTQzNWM4Y2QtMWVhYS00MTNkLTgxMGMtNjM5Y2FmNjQ2MWFiXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "con artist,screwball comedy,snake,gold digger,seduction",
    "name": "The Lady Eve",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gaityr"
        },
        "dateCreated": "2002-09-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0033804/"
        },
        "name": "Hell Hath No Fury As The Lady Scorned...",
        "reviewBody": "On the surface of it, THE LADY EVE is a delightfully shallow evening's entertainment. It's a clever little film, filled with great dialogue (\"Don't be vulgar, Jean. Let us be crooked, but never common.\") and eccentric characters, from the leading lady Jean (a marvellous Barbara Stanwyck) and her much-beleaguered main man Charlie Pike (Henry Fonda) down to the other con artists that make up Jean's circle, including her dad Harry (Charles Coburn), sidekick Gerald (Melville Cooper) and Sir Alfred McGlennan Keith (Eric Blore)... or just Pearlie for short. Charlie is heir to the Pike Ale fortune, and while on a cruise home from South America, Harrington father and daughter decide to take the hapless lad to the metaphorical drycleaners. What neither of them gambles on is a romance that was always in the cards for Jean and Charlie. But just as Jean is about to go 'straight' for Charlie, he discovers that his girlfriend is part of a con racket, and unceremoniously dumps her. Hurt and determined to get revenge for his cruel parting words, Jean initiates a farce as the Lady Eve Sidwich of the film's title and infiltrates Charlie's home and heart again. She quickly teaches him a lesson he'll never forget, just as she realises how much she really still loves Charlie.\n\nStory-wise, then, it's no doubt that THE LADY EVE provides fine frothy entertainment. Pair that with the surreal touches added into the film by Preston Sturges (take for example the supposedly climactic scene in which Charlie repeats his words of love to Eve--Fonda never gets to play the scene straight, even though he has to maintain a stony face as his horse keeps butting into his speech... presumably to try to get him to stop talking!), and there's certainly plenty to keep one occupied as is. The film is, of course, a screwball comedy absolutely bent on throwing every possible obstacle it can into the path of its intended couple, coming up with more twists than you expect... \n\nHowever, thanks largely to the brilliant writing and direction provided by Sturges, it actually also plays very close and very insightfully to the theme of what Stanley Cavell calls 'remarriage comedy'. The idea behind this is that legal or religious marriages, the 'first' marriages of the couple concerned in such comedies, are actually sham marriages. It isn't saying 'I do' or signing a piece of paper that makes a marriage a marriage; it's the behaviour of the couple, their own endorsement, that makes it a true marriage. This theme is reflected in, for example, THE AWFUL TRUTH, which sees Lucy and Jerry Warriner divorcing (their first, sham marriage didn't work out) but getting back together again for a true, albeit not yet legalised, union. The same theme pervades THE PHILADELPHIA STORY. Preston Sturges very skilfully and effectively--but subtly!--brings this theme to his film as well. Eve and Charlie are married, but it is only when Charlie asks Jean for forgiveness and vice versa is it possible for the fact that they are married (to each other, as poor Charlie does not know!) to become significant and actually positively affirmed.\n\nThis isn't the only interesting point the film makes while appearing to be little more than a fluffy piece of entertainment--when Charlie breaks Jean's heart, she tells him, \"The best [girls] aren't as good as you think they are and the bad ones aren't as bad. Not nearly as bad.\" She sets out to prove this, both in her fabricated 'good-girl' persona as Eve (later revealed to have had many MANY suitors) and her real 'bad-girl' con-artist self Jean (who has a soft heart and a love for Charlie that proves to be one of her virtues). Practically everyone in the film has (at least) two names by which they're known: Jean/Eve, Charlie/Hopsie, Muggsy/Murgatroyd/Ambrose, Harry/Colonel Harrington, Pearlie/Sir Alfred and so on. This suggests, quite rightly, that people are complicated complex beings, and that appearances often have nothing to do with reality. It also brings the film's story to a head--Jean and Charlie can never be happy together until Charlie can accept Jean as she is, and this he presumably will have learnt through his short, disastrous 'marriage' to Eve.\n\nStanwyck and Fonda are really outstanding in this film. Stanwyck's job is to persuasively depict two characters, and then effect a blend of the two of them in the final minutes of the story, and she pulls off both the sassy, confident Jean and the elegant, British Eve perfectly. It's not hard to imagine Charlie falling hard for Jean, even with her hard-headed casing of the joint and her prospective competition (appropriately deemed second-rate) for his affections... a very memorable scene involving her make-up mirror and a narrative voice-over, the latter of which is used to great effect in the lead-up to the 'romantic scene and horse' bit which follows later in the film. Fonda has the apparently easier job of appearing mostly colourless and stodgy as he spends most of his screen time reacting to situations created by both Jean and Eve, but I contend that it must really take quite a lot of true acting ability to execute the pratfalls that he does without making Charlie such a wimp that you can't imagine Jean still wanting him at the very end. Though not quite as effective as Cary Grant, who has to do the same thing in the face of Katharine Hepburn's breathlessly effusive Susan Vance in BRINGING UP BABY, Fonda still brings a sweet charm to his role as the not-at-all-slick, often befuddled Charlie Pike. Add these two classy performances to that given by the able supporting cast, and THE LADY EVE is not just well-scripted and directed, but also very very well-acted indeed.\n\n So, watch this film the first time just for fun--be charmed by the characters, by the dialogue, by the actors, by everything. Then watch it again to realise just how subtly and effectively THE LADY EVE actually makes several comments on marriage and on love. I highly recommend getting your hands on the Criterion Collection DVD, which has (aside from a tremendous photo gallery and interview with Peter Bogdanavich and other special features) a fantastic, thought-provoking commentary by film critic Marian Keane--it most certainly got *me* thinking!\n\nGreat film, great entertainment, great message!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount",
        "duration": "PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4014997529",
        "name": "The Lady Eve",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGE1ZDZkMTQtYTVkZC00MTFiLTkwNTYtN2FiNDViZjkzYzQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGE1ZDZkMTQtYTVkZC00MTFiLTkwNTYtN2FiNDViZjkzYzQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-30T03:53:02Z",
        "url": "https://www.imdb.com/video/vi4014997529/"
    },
    "url": "/title/tt0033804/"
}