{
    "@context": "https://schema.org",
    "@type": "Movie",
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 138,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021349/"
        }
    ],
    "datePublished": "2002-12-06",
    "description": "The practice of female genital mutilation is explored through personal stories of Kenyan women.",
    "director": [
        {
            "@type": "Person",
            "name": "Kim Longinotto",
            "url": "/name/nm0519354/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDMzODM1YzctODgzZC00OTgzLWEwNjQtMGJhNzBiMmQxY2YxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "female genital mutilation,female circumcision",
    "name": "The Day I Will Never Forget",
    "original_info": {
        "id": "The Child I Never Was_2002",
        "name": "The Child I Never Was",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbill-74877"
        },
        "dateCreated": "2021-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0342265/"
        },
        "name": "Disturbing",
        "reviewBody": "This documentary on female genital mutilation (FGM) as practiced on young girls in Kenya is, not surprisingly, incredibly difficult to watch at times. The level of access that Director Kim Longinotto achieved was high, and be forewarned, include some footage of the procedure itself, performed on two consecutive girls (roughly age 8) on a kitchen floor by a midwife of sorts and a couple of other women holding them down. As they scream \"I don't want it\" again and again and shriek in pain, the midwife flashes a smile at the camera, one I couldn't help seeing as pure evil.\n\nIt's dangerous to look at the customs of another culture and condemn them, but it was impossible for me not to do that here. There are several who are given a chance to articulate an explanation for the practice, for example, that it stops girls from sleeping around, that it's aesthetically important, and that it will prevent the husband from using a knife and doing it himself in a brutal way on her wedding night, but most of all, what we hear is that it's \"tradition.\" It's unfortunate to hear that from various women in the community and the mothers of these girls, blind to seeing it as a form of male domination, and a barbaric and dangerous one at that.\n\nAs a documentary, there are some issues in explaining the different groups of people that we see, and their cultures or religions. The 'fly on the wall' approach that Longinotto takes has its advantages, but at times is a drawback in not allowing more information in the form of a narrative. I would have also liked to have seen interviews with those in power (politically or culturally) speak to it, because while women are shown enforcing it, it clearly stems from a heavily patriarchal culture. We get a glimpse of this from a man about to marry who idiotically denies a doctor from surgically enlarging his bride-to-be's vagina (after her childhood clitorectomy it was stitched too heavily) because he would be laughed at by his friends, saying he will do the job via penetration on their wedding night instead, despite the risks to her. We also see it in a man preaching in the streets the need for these traditional practices, both on girls and boys, using a rationale that defies all logic. It needed more of this.\n\nWhile the documentary sounds incredibly dark which may put people off (and I suppose I didn't help matters with that first paragraph), over its second half it shows a girl who leaves her family and village in order to go to a school with others who've escaped. With the help of some very kind adults, they take their parents to court, as per new legislation in the country they can get an injunction against them. The film was made in 2002, and nine years later the Kenyan government made the practice illegal.\n\nI wish I could know what happened to some of these girls, and where they are now. Here is a poem that one of them named Fouzia wrote and recited in the film, one of its most powerful moments:\n\nThe Day I Will Never Forget\n\nIt was on a Sunday night when my mom called me And she said, \"My daughter, come,\" in a low voice.\n\nI went quietly.\n\nSuddenly, my mom said, \"My daughter, tomorrow is your D-day.\" I was shocked to hear that, but I was not expected to say anything.\n\nIn the morning, I was dragged and pinned on the ground When three women sat and crucified me on the floor.\n\nI cried till I had no voice.\n\nThe only thing I said was, \"Mom, where are you?\" And the only answer I got was \"Quiet, quiet, girl!\" The pain I had experienced was one I will never forget for the rest of my life, and I will not wish the same to happen to my friends.\n\nThat night, I had a sleepless night.\n\nI could see an old lady with many blades doing it again and again and again.\n\nI screamed, and my mom came running to check on me.\n\nMy loving parent, is this what I really deserved?\n\nI am asking all of you, is this what I really deserve?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0342265/"
}