{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Arnold Schwarzenegger",
            "url": "/name/nm0000216/"
        },
        {
            "@type": "Person",
            "name": "Maria Conchita Alonso",
            "url": "/name/nm0000744/"
        },
        {
            "@type": "Person",
            "name": "Yaphet Kotto",
            "url": "/name/nm0001433/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 157868,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047779/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009677/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Person",
            "name": "Stephen King",
            "url": "/name/nm0000175/"
        },
        {
            "@type": "Person",
            "name": "Steven E. de Souza",
            "url": "/name/nm0211823/"
        }
    ],
    "datePublished": "1987-11-13",
    "description": "In a dystopian America, a falsely convicted policeman gets his shot at freedom when he must forcibly participate in a TV game show where convicts, runners, must battle killers for their freedom.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Michael Glaser",
            "url": "/name/nm0001274/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Action",
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWU4NzA2OWYtNGQ0MS00YWNkLTg4M2YtZjlkZmY1YmJjMDE4XkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1_.jpg",
    "keywords": "game of death,oppression,fictional game show,government conspiracy,kill or be killed",
    "name": "The Running Man",
    "original_info": {
        "id": "The Running Man_1987",
        "name": "The Running Man",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CuriosityKilledShawn"
        },
        "dateCreated": "2004-05-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0093894/"
        },
        "name": "The future IS the 80's",
        "reviewBody": "Of all Arnold's mid-'80s movies who would have thought that most relevant today would be The Running Man. A chilling and surprisingly realistic tale of reality TV gone mad. It may have been far-fetched back then but not so now. Not when you think about it. Currently, Reality TV shows are either scraping the bottom of the barrel or desperate to raise the bar. If the next one isn't more controversial as the last, it's a dud. How long will it be before we really do see shows like The Running Man? How long before we have 'court-appointed theatrical attorneys' or the entertainment division of the Justice Department? There is so much satire and intelligence in this movie that may have been missed back in 1987 that is desperate to be seen again considering the current state of TV shows.\n\nThe biggest message of all is 'You are being lied to'. It's no secret that the Government and the media work in cahoots. And the masses believe what the media tells them to believe. It's a very scary state of affairs and unless more accurate representations of the truth emerge we may easily accept a brutal show like the Running Man in the near future. It's no secret that Reality TV is not very realistic. It's edited and reshaped before being aired and it's only what the networks want you to see. Usually it's far from the real truth.\n\nAlthough rather different than Stephen King's book (the ending is completely changed) the script does conform to the typical Arnie formula. Yes, he does have numerous and very corny one-liners and he does say 'I'll be back' (which he never REALLY said that often anyway, when you think about it) in the most ironic situation yet but he's still a zillion times better in the role then Christopher Reeve or Dolph Lundgren would have been (these two were considered BEFORE Arnie believe it or not).\n\nThe director is none other than Dave Starsky himself (Paul Michael Glaser). It may not be artistic but it is still strong enough to generate excitement and his use of neon and flourescent colors gives each individual set a pretty cool look. Andrew Davis (not a director I particularly like) was attached before Glaser, though no matter who directs, the film is still marred by a very heavy 80's feel.\n\nFirst of all, Harold Faltermeyer's score (remember him?) is incredibly dated and robs the action scenes of any timeless integrity. And the fashion sense of the movie is far too excessive to be convincingly set in the future. Apart from the dated feel, the only other thing that bugs me is the poorly staged shoot-out that passes as the climax.\n\nThis new DVD is a zillion times better than the original release. Gone is the horrid letterbox picture. In its place is a brand new hi-definition 1.85:1 anamorphic transfer. The colors sparkle and literally pop from the screen. The new Dolby 5.1 EX and DTS ES soundtrack are also amazing. There constant use of the surround channels to great effect and the bass is strong and powerful. Definitely one of the best re-masters I've seen so far. Two intriguing documentaries, a trailer and a 'Meet the Stalkers' gimmick are included in this 2-disc set that comes in a rather neat slip case.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2549285145",
        "name": "The Running Man",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODEwNGNjNTYtNTJjNC00N2M0LWI2MjItYTkzMTFiOTk2Y2ZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODEwNGNjNTYtNTJjNC00N2M0LWI2MjItYTkzMTFiOTk2Y2ZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:46:20Z",
        "url": "https://www.imdb.com/video/vi2549285145/"
    },
    "url": "/title/tt0093894/"
}