{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tyrone Power",
            "url": "/name/nm0000061/"
        },
        {
            "@type": "Person",
            "name": "Gene Tierney",
            "url": "/name/nm0000074/"
        },
        {
            "@type": "Person",
            "name": "John Payne",
            "url": "/name/nm0668361/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6341,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Lamar Trotti",
            "url": "/name/nm0873707/"
        },
        {
            "@type": "Person",
            "name": "W. Somerset Maugham",
            "url": "/name/nm0560857/"
        },
        {
            "@type": "Person",
            "name": "Darryl F. Zanuck",
            "url": "/name/nm0953123/"
        }
    ],
    "datePublished": "1946-12-25",
    "description": "An adventuresome young man goes off to find himself and loses his socialite fiancée in the process. But when he returns 10 years later, she will stop at nothing to get him back, even though she is already married.",
    "director": [
        {
            "@type": "Person",
            "name": "Edmund Goulding",
            "url": "/name/nm0332539/"
        }
    ],
    "duration": "PT2H25M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmIwMDA3MzMtODY4OC00NjkxLWIyNGQtMTVhOGY4Nzc5ZDI0XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "india,spirituality,pilgrimage,controlling relationship,controlling female",
    "name": "The Razor's Edge",
    "original_info": {
        "id": "The Razor's Edge_1946",
        "name": "The Razor's Edge",
        "year": "1946"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2004-10-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038873/"
        },
        "name": "Ty goes to Shangri-La",
        "reviewBody": "Darryl Zanuck gave in to Tyrone Power's request for some serious acting roles and not another costume part in his first post World War II film after returning from the Marines. The Razor's Edge is a bit overlong, but Tyrone Power and the rest of the cast is shown to best advantage.\n\nThe Razor's Edge is the story about a returning World War I veteran's quest for spiritual meaning in his life. Author W. Somerset Maugham wrote this during the 30s and his themes then found a good audience in 1946. He appears in the movie, played by Herbert Marshall, and it is his eyes through which we see the action unfold.\n\nIt starts at a party in the Midwest at the beginning of the Roaring 20s. All the principal characters are introduced there including Larry Darrell, played by Power, who wants to postpone his engagement to Gene Tierney. Power explains about his lack of spiritual fulfillment and his desire to do some global soul searching. Tierney's not happy, but she thinks all he wants to do is sow some wild oats and she reluctantly acquiesces. \n\nA year later she's in Paris and she finds Ty living on the fringe and she realizes he was serious. Now Tierney is hopping mad so she marries steady and reliable John Payne. Now the plot unfolds.\n\nAs I've said in other reviews of his films Power was either the straight arrow hero or a hero/heel type. He's a straight arrow in this one as noble as you can get without crossing over into Dudley DooRightism.\n\nGene Tierney had essayed bitchiness in Leave Her to Heaven and she refines it to a high art here. Even though she's married to Payne, she still has a yen for Ty and her machinations are what drives the rest of the story.\n\nJohn Payne, I have always been convinced was brought to 20th Century Fox as a singing Tyrone Power for musicals. So it is interesting to see them together. It is unfortunate that Payne wasn't given a better role because his part as Tierney's husband who loses his fortune in the Stock Market Crash wasn't better written. Payne proved on a lot of occasions he was a capable enough actor to handle more complex parts.\n\nClifton Webb plays fussy Uncle Elliott Templeton and got an Oscar Nomination, losing to Harold Russell in the Best Years of Our Lives. Webb was the closest thing for years to an out gay actor and a lot of his roles reflect that part of him, like this one. My favorite scene is after Ty Power goes to India and in that Shangri La like lamasery feels he has been made spiritually aware, with the symphonic crescendos rising, the action cuts away to a Paris tailor shop where Clifton Webb is complaining that the tassel on his robe doesn't sway, but that it bobbles. \n\nAnne Baxter won a Best Supporting Actress Award for a playing a friend of Tierney's in the mid west. Baxter is a happy girl, marrying a young man she's deeply in love with. Her husband and baby are killed in an automobile crash. Baxter's study of physical and moral decline and degradation is some of her best work, maybe even better than Eve Harrington in All About Eve.\n\nThe story is a bit dated now, but it's still a fine film and one that shows Tyrone Power capable of far more than swashbuckling.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0038873/"
}