{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve McQueen",
            "url": "/name/nm0000537/"
        },
        {
            "@type": "Person",
            "name": "Faye Dunaway",
            "url": "/name/nm0001159/"
        },
        {
            "@type": "Person",
            "name": "Paul Burke",
            "url": "/name/nm0121826/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26202,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011112/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065576/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0119024/"
        },
        {
            "@type": "Person",
            "name": "Alan Trustman",
            "url": "/name/nm0874450/"
        }
    ],
    "datePublished": "1968-06-26",
    "description": "A debonair, adventuresome bank executive believes he has pulled off the perfect multi-million dollar heist, only to match wits with a sexy insurance investigator who will do anything to get her man.",
    "director": [
        {
            "@type": "Person",
            "name": "Norman Jewison",
            "url": "/name/nm0422484/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTA5NzQ4NjE4NF5BMl5BanBnXkFtZTcwMjIzMzY3NA@@._V1_.jpg",
    "keywords": "bank robbery,split screen,millionaire,boston massachusetts,flirting",
    "name": "The Thomas Crown Affair",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JamesHitchcock"
        },
        "dateCreated": "2005-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063688/"
        },
        "name": "A Triumph of Style over Substance- but with style like this, who's complaining?",
        "reviewBody": "Thomas Crown is a Boston financier who organises a daring bank robbery. This crime is not committed because he needs the money- he has made a large fortune from entirely lawful activities- but because he is bored with life and needs excitement. The police are in the dark as to who might have been responsible, but the bank's insurers are determined to recover their money and appoint Vicki Anderson, a tough female investigator, to look into the affair. Vicki soon comes to suspect Crown, but cannot prove his involvement, and so a game of cat and mouse begins between them. Vicki makes contact with Crown, hoping that he will give himself away, but he is well aware of her suspicions and is too clever to betray himself. They find themselves attracted to one another and eventually begin a love affair, leaving Vicki torn between her feelings for Crown and the job she has been assigned to do (in which she also has a financial interest, as she has been promised a percentage of any money she recovers).\n\nThe above scenario is, of course, implausible, but this is not a realistic film. It is a glossy colour supplement of a film that one watches not for realism or for its plot but for an atmosphere that has been described as the epitome of sixties cool. The trappings of Crown's millionaire lifestyle are much on display- his expensive cars, his luxuriously furnished penthouse apartment, his Cape Cod beach-house, his private glider, his games of golf and polo. (His surname is significantly derived from a symbol of wealth and power). The two leading actors, both iconic figures of the sixties, are perfectly cast. Steve McQueen was known not only as the Cooler King (his role in \"The Great Escape\") but also as the King of Cool. He was normally cast in \"tough guy\" roles, but here he broadens his range by taking on the role of a suave, wealthy playboy (although still with a hint of toughness), the sort of man every man wants to be and every woman wants for herself. Faye Dunaway was perhaps not a classical beauty in the style of some other sixties icons such as Raquel Welch or Julie Christie, but few actresses were better than she at conveying elegant, sophisticated glamour.\n\nEveryone who sees this film seems to remember it for the same three things. First, there is director Norman Jewison's use of the \"split screen\" technique during the robbery and in the scenes of the polo match. This has been criticised as a gimmick, but I found that it did help to give these sequences a greater sense of urgency and rapid movement, a sense also heightened by Michel Legrand's driving musical score. (Legrand also provided a similar score for the British film \"The Go-Between\"). Second, there is the famous scene, full of sexual symbolism and suggestion but without any overt sexual content, where Vicki seduces Crown- or perhaps it would be more accurate to say they seduce one another- over a game of chess. (Faye Dunaway was at her best here). Third is the well-known theme song \"The Windmills of Your Mind\". The song's rather enigmatic lyrics do not have any direct reference to the plot of the film, but it fits the general mood perfectly, particularly as the plot itself is often enigmatic.\n\nThe sixties were the golden age of the heist movie with films such as \"Topkapi\", \"The Biggest Bundle of them All\" and \"The Italian Job\", all of which featured daring robberies carried out by a glamorous cast, often in an exotic setting. This genre has been criticised- and there is justice in the criticism- for glamorising crime and dishonesty, and \"The Thomas Crown Affair\", although it concentrates as much on the aftermath of the crime as on the robbery itself, falls within this tradition and must therefore bear some of the criticism. It is, however, unlikely that it ever persuaded anyone to take up a career as a millionaire playboy criminal mastermind. It is too obviously a fantasy for that- with its visual tricks, its highly stylised acting (especially from Miss Dunaway) and a general atmosphere that seems unreal, at times even dreamlike, it has about as much to do with real crime as the James Bond films have to do with the everyday work of the British Secret Service. Moreover, unlike some of the other heist movies, such as \"The Italian Job\" or \"The Biggest Bundle\", which have artificially moralistic endings, \"The Thomas Crown Affair\" at least has the courage of its own amorality. Its ending may be ambiguous, but it does not try to drive home a \"crime does not pay\" message.\n\nI prefer this film to the recent Pierce Brosnan remake which, although it has its good points, lacks the distinctive style of the original film. The original has, in fact, been criticised for being a triumph of style over substance. Well yes, it is- but with style like this, who's complaining? 7/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0063688/"
}