{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edith Hahn Beer",
            "url": "/name/nm1753994/"
        },
        {
            "@type": "Person",
            "name": "Julia Ormond",
            "url": "/name/nm0000566/"
        },
        {
            "@type": "Person",
            "name": "Susan Sarandon",
            "url": "/name/nm0000215/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 324,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076014/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054997/"
        },
        {
            "@type": "Person",
            "name": "Jack Youngelson",
            "url": "/name/nm1320488/"
        }
    ],
    "datePublished": "2003-05-09",
    "description": "Edith Han was an outspoken young woman studying law in Vienna when the Gestapo forced Edith and her mother into a Jewish ghetto. Edith was taken away to a labor camp, and when she returned home months later, she found her mother h...",
    "director": [
        {
            "@type": "Person",
            "name": "Liz Garbus",
            "url": "/name/nm0305017/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Documentary",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA0NzYwNjQwNl5BMl5BanBnXkFtZTcwODA2ODAwMQ@@._V1_.jpg",
    "keywords": "title directed by female",
    "name": "The Nazi Officer's Wife",
    "original_info": {
        "id": "The Nazi Officer's Wife_2003",
        "name": "The Nazi Officer's Wife",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dls-3"
        },
        "dateCreated": "2003-06-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0352621/"
        },
        "name": "A powerful view of the holocaust",
        "reviewBody": "We had seen many promos on A&E throughout the last week or so about this documentary. I have seen quite a few documentaries about World War 2 and the holocaust, but this particular one, to me, was quite personal.\n\nI am very happy that I never had to live through this ordeal and I could not even imagine what would be going through someone's brain to try and even fathom what was going on and how to survive.\n\nThis particular lady, Edith Haan, had some luck plus some opportunities to survive the war. Tragically, most of her family didn't.\n\nShe hid openly inside Germany under an assumed name, thanks to help which some of her friends gave to her, and eventually she married a Nazi Officer and remained married to him until after the war. The marriage produced one daughter (the only Jewish baby to be born during the war and survive, thanks to her mother).\n\nI have met survivors of the holocaust and one of the first things that they tell me is the powerful guilt they feel because they survived, where others didn't. They have one MAJOR problem of discussing their ordeals because of how powerful and all consuming this tragedy was.\n\nSo this documentary shows the life, on a personal level, of Edith Haan, when she finally was able to talk about her life after the Germans invaded Austria in 1938.\n\nI don't think that we, as civilized human beings, have the right to judge any of her decisions or actions. We all survive in our own way.\n\nLet us hope and pray that this tragedy will never befall man ever again!!! Where man can live together with man peacefully and as the Bible says \"beat their swords into plowshares\"."
    },
    "url": "/title/tt0352621/"
}