{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steve Guttenberg",
            "url": "/name/nm0000430/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth McGovern",
            "url": "/name/nm0001527/"
        },
        {
            "@type": "Person",
            "name": "Isabelle Huppert",
            "url": "/name/nm0001376/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6097,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046277/"
        },
        {
            "@type": "Person",
            "name": "Anne Holden",
            "url": "/name/nm0390159/"
        },
        {
            "@type": "Person",
            "name": "Curtis Hanson",
            "url": "/name/nm0000436/"
        }
    ],
    "datePublished": "1987-01-16",
    "description": "A young executive starts an affair with his boss's wife which then escalates into a nightmare after he lies to the police in order to protect her.",
    "director": [
        {
            "@type": "Person",
            "name": "Curtis Hanson",
            "url": "/name/nm0000436/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Crime",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWQ4OWUxN2UtNTVhMy00Y2E3LTk0NTYtMjRiNzZjYjc1OTUxXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "rape,neo noir,revenge,rape victim,hitchcockian",
    "name": "The Bedroom Window",
    "original_info": {
        "id": "The Bedroom Window_1987",
        "name": "The Bedroom Window",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BDeWittP"
        },
        "dateCreated": "2005-09-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092627/"
        },
        "name": "Great Thriller",
        "reviewBody": "Sometimes, people do the wrong thing, for a good reason. This isn't always right, but it's understandable. I think this is the premise for The Bedroom Window. People are human, and sometimes irrational behavior leads to something that can get more serious than originally anticipated.\n\nThat is exactly what happens in this movie. Terry Lambert, played by Steve Guttenberg in what may just be his best performance, is a good man whose judgment isn't always the greatest. Terry is a business executive who makes the unwise decision of having an affair with his boss's wife, a beautiful french woman named Sylvia. One night at his apartment, she witnesses a young man assaulting a female. Obviously, she cannot go forward. Later, after learning of a different female being murdered near the scene that same night, he decides he'll go forward and report that he was the witness. \"It's my apartment, my bedroom window,\" he says in an attempt to justify the dishonesty.\n\nThe only problem, which proves to be a damaging blow, is that nothing can be proved about the murder. So, the only chance to convict the assailant is to prosecute on the assault case. The logic being it at least gives the authorities a chance to put the killer away to prevent him from hurting anyone else, while still hoping to find evidence connecting him to the murder. So Terry must testify during the trial that he witnessed the assault. In a brilliant scene, the defendant's attorney carves him up like an overcooked turkey, making it very clear that Terry is lying, but not why.\n\nAs the authorities become suspicious of Terry, he begins to bond, through shared experience, with Denise, the woman who was assaulted outside his apartment. She later figures out that Sylvia, and not Terry, saw the murder. \"The question isn't What am I going to do? It's what are you going to do? And what is she going to do?,\" she says harshly and angrily, but not at all incorrectly. They both later discover, at least partially, the killer's motives, and agree that the only way to implicate him, and clear Terry, is to trap him and catch him in the act. \n\nSteve Guttenberg is magnificent as the scared, confused, and conscientious Terry. Elizabeth McGovern and Isabelle Huppert are equally as good as the women who care about him, but are unsure how to figure him out, or what to do. McGovern shows her very good acting ability with non-verbals that demonstrate clearly that she knows something isn't right about Terry through her facial expressions and the looks in her eyes. The cast of this movie work together like a well-oiled machine, and the story may not have been as compelling had it not been for the convincing actors.\n\nThis is writing at its best, top notch acting, and filmmaking on a master scale. The movie is so well-made that we love the story, understand the characters and their situations, and just can't wait to see what happens next. This movie is a classic, and also a great thriller. Watch it!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A young executive starts an affair with his boss's wife which then escalates into a nightmare after he lies to the police in order to protect her.",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi244564761",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzAzOWYxNDYtY2M2Zi00YzMxLWIxNDItNmJiNjMyMDlkM2E1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzAzOWYxNDYtY2M2Zi00YzMxLWIxNDItNmJiNjMyMDlkM2E1XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-04T23:39:48.316Z",
        "url": "https://www.imdb.com/video/vi244564761/"
    },
    "url": "/title/tt0092627/"
}