{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "DeRay Davis",
            "url": "/name/nm1154986/"
        },
        {
            "@type": "Person",
            "name": "Esau McGraw",
            "url": "/name/nm2313611/"
        },
        {
            "@type": "Person",
            "name": "Mo'Nique",
            "url": "/name/nm0594898/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0230652/"
        },
        {
            "@type": "Person",
            "name": "Esau McGraw",
            "url": "/name/nm2313611/"
        }
    ],
    "datePublished": "2004-06-01",
    "description": "2-time Image Award-winning comedian/actress Mo'Nique hosts this 2004 comedy show with the outrageously funny Rodney Perry as her co-host. The all-star lineup features Esau, Doug Williams, DeRay Davis, and Chris Spencer.",
    "director": [
        {
            "@type": "Person",
            "name": "Dale S. Lewis",
            "url": "/name/nm2199107/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjE1NTYwOTA1MF5BMl5BanBnXkFtZTcwNzU0NjcyMQ@@._V1_.jpg",
    "name": "The Big Black Comedy Show, Vol. 1",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ddsharper"
        },
        "dateCreated": "2006-06-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0808169/"
        },
        "name": "I am sick of black entertainers fitting the stereotypes",
        "reviewBody": "Everything about this show was typical. Monique prayed before coming on stage and then proceeded to say \"f\" this and \"mf\" that. How can a person pray and then immediately and intentionally use God's name in vain. Then the rest of the comedians followed suit. They put down other blacks and put down themselves. They compared black businesses to white's, of course, the latter being superior in business. They insulted the million black business owners in the country. What happened to the talent? I am sick of mediocrity attempting to pass for entertainment. Are black people vulgar, base and stupid or are the real talented black people not getting television spots? I think the latter. Observational comedy requires intelligence for it to be funny. These comedians were NOT funny but disgusting. People talk about other people, things or ideas. Those who constantly talk about the first two are not that bright: that is only my opinion. These comedians probably do not read or engage in intelligent conversations and are all embarrassments. Reiterating poverty amongst blacks gets real old, especially when your audience is middle class and when blacks spent 145 billion on housing last year. Where is the respect for the black community? Where are the jokes about the struggles blacks still have with racism? Where is the talent? I had to turn the so-called Bib Black Comedy show off. I cannot abide stupidity and insults anymore. I got tired of hearing \"n\" in every other sentence. The comedians were immature, not that bright and definitely with very little understanding of life. I think many blacks have low self esteem, due to the abjection and wretchedness ascribed to the race for 400 years but it's time to get past that, focus on the human experience. Black comedians, so-called, need to get past the cursing, put downs, poverty speak, fake southern accents and step-and-fetch it acts, all spoken in the name of Jesus. God and/or Jesus has nothing to do with their potty mouths and twisted perspectives and unfunny jokes and superficial observational comedy. Please.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0808169/"
}