{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        },
        {
            "@type": "Person",
            "name": "Tilda Swinton",
            "url": "/name/nm0842770/"
        },
        {
            "@type": "Person",
            "name": "Alan Bates",
            "url": "/name/nm0000869/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5387,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016814/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079355/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103820/"
        },
        {
            "@type": "Person",
            "name": "Ronald Harwood",
            "url": "/name/nm0367838/"
        },
        {
            "@type": "Person",
            "name": "Brian Moore",
            "url": "/name/nm0600972/"
        }
    ],
    "datePublished": "2004-02-27",
    "description": "Tale of a former Nazi executioner who becomes a target of hitmen and police investigators.",
    "director": [
        {
            "@type": "Person",
            "name": "Norman Jewison",
            "url": "/name/nm0422484/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI5MDIzNDAzN15BMl5BanBnXkFtZTcwMTM0NjQyMQ@@._V1_.jpg",
    "keywords": "timeframe 1940s,timeframe 1990s,nazi,police,strong female lead",
    "name": "The Statement",
    "original_info": {
        "id": "The Statement_2003",
        "name": "The Statement",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2005-12-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0340376/"
        },
        "name": "Far too basic on all levels  not bad but just rather disappointing throughout",
        "reviewBody": "After the Nazi's were driven out of France, those who had collaborated were mostly rounded up and punished  many by death. However some escaped and were hidden, while others rose in power within the new regime. Pierre Brossard is one of the former and continues to live in fear, protected from those that would avenge his victims by his friends within the Catholic Church. However a close encounter shows that some group is closing in on him, meanwhile political pressure from Judge Livi and Colonel Roux's investigation into his whereabouts mean that he is quickly running out of friends willing to shelter him.\n\nIt is difficult to know how to approach this film because it itself doesn't seem too sure of what it is trying to do. Is it a drama looking at the idea of fleeing war criminals? Is it a chase movie? Is it a character piece looking at Brossard? It is never clear because it does do some elements of each but it doesn't really do anything that well and I, as a viewer, was a bit confused about what I was supposed to feel or think during it. The story itself is OK, reasonably engaging but not having anything of interest to it. As a chase film I was interested and the themes helped it seem more than the sum of its parts but not in reality. The motivations of the characters are never that well developed; the Livi/Roux parts are dull and quite routine although the sections with Brossard are more interesting.\n\nIt is a shame then that the film cannot decide what it wants to do with him  do we feel for him, hate him or just watch him? The film doesn't let us decide this in a good way representing the complex nature of the character, but rather just doesn't push out any ideas one way or another. Caine does well despite this and gives a good character a bit of depth. He is where the film is although he probably benefits from the fact that everyone else is quite ordinary. Swinton and Northam are quite ordinary and their parts of the film just seem put of place and half-cooked. Support from Neville, Bates, Rampling and others just about do the job but add little.\n\nOverall this is an OK film but nothing at all more than that. Despite the interesting and complex potential the film just delivers an ordinary chase movie and fails to do anything with the ideas and concepts inherent in it. Caine does well to produce quite a convincing character but he is alone in that, with the material and the rest of the cast failing to do anything that interesting. Not bad but not worth trying to find because it is nowhere near as good as one would have hoped."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3841589529",
        "name": "The Statement",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWI5Y2NiODQtMGRmYi00ODk4LWE2YWYtYzNiODU2OGUyMDk1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWI5Y2NiODQtMGRmYi00ODk4LWE2YWYtYzNiODU2OGUyMDk1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:14:00Z",
        "url": "https://www.imdb.com/video/vi3841589529/"
    },
    "url": "/title/tt0340376/"
}