{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Arnold Schwarzenegger",
            "url": "/name/nm0000216/"
        },
        {
            "@type": "Person",
            "name": "Michael Rapaport",
            "url": "/name/nm0001650/"
        },
        {
            "@type": "Person",
            "name": "Tony Goldwyn",
            "url": "/name/nm0001282/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 124564,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029574/"
        },
        {
            "@type": "Person",
            "name": "Cormac Wibberley",
            "url": "/name/nm0926727/"
        },
        {
            "@type": "Person",
            "name": "Marianne Wibberley",
            "url": "/name/nm0926729/"
        }
    ],
    "datePublished": "2000-11-17",
    "description": "A man meets a clone of himself and stumbles into a grand conspiracy about clones taking over the world.",
    "director": [
        {
            "@type": "Person",
            "name": "Roger Spottiswoode",
            "url": "/name/nm0006854/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Action",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTE5ODEzOTMtZmU2ZS00NjUwLWIwMDMtMTVlYjdkOTQ4ZjUzXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "evil man,good versus evil,aircraft,remote controlled aircraft,male pilot",
    "name": "The 6th Day",
    "original_info": {
        "id": "The 6th Day_2000",
        "name": "The 6th Day",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "xanada73"
        },
        "dateCreated": "2001-08-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0216216/"
        },
        "name": "Not Really About Cloning",
        "reviewBody": "This film was pushed as a dissertation on the ethical issues and social implications of cloning in the world of the near future, and most viewers seem to have interpreted it as just that. But the truth of the matter is, the aspect of human cloning isn't really the crux of this film at all: it's the 'syncorder' technology. Theoretically, we could clone a human being now, but such a process would be a threat to no one; we'd simply have a totally seperate individual with the same DNA the individual from whom he/she was cloned. The ability to 'synchord' peoples memories and personalities and implant them into the clone, however, allows the films villains to insidiously 'replace' their victims. Well, if you have a bloody syncorder, to hell with cloning! These people could already conquer the world by retrieving classified secrets from people to whom they give 'retinal scans!' Also, the existence of the syncorder implies that the information storage and retrieval systems of the human brain have been cracked. If that were the case, wouldn't people be able to build more advanced computer programs than the mindless, repetitive, doll-like imitations of SimPal Cindy and the Virtual Girlfriend?\n\nThe fact is, this world is not one of the 'near future,' because the kind of technology required to build a synchorder, let alone one as small and easy to use as the 'vision testing machine' used by this film's villainry, is not going to be available to use for a long, looong time. Since the characters ignore this, and focus almost entirely on the mundane concept of cloning, most of the important questions are not asked. Arnold's clone wonders if he is human. Well of course he's human! And the idea that he doesn't have a soul simply because he is a clone is repulsive; how about not having a soul because his memories and personality emanate from a digital information storage device?\n\nBarring this, I think that this was a good action flick embedded in a surprisingly well done science fiction film. Innovative direction, if not choreography, and the movie puts a lot of things taken for granted from Arnie's previous action films on their heads, which is fun to watch. Having to kill the same people over and over (\"Yeah, yeah, we've all been killed before.\"), and two Arnies arguing with each other and double teaming the bad guys, for example. My only problem; Arnold is some kind of extreme sports chartered helicopter pilot; how does that explain his trademark aim, paramilitary training, and the ability to effortlessly kill people with his bare hands? We know he HAS to be able to do these things, but it still makes no sense in this case."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Columbia Pictures",
        "duration": "PT1M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1502478617",
        "name": "The 6th Day",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzZlYjkwMzYtZmVjOS00YzcyLThkNTctYjFhYjA3ZDA1NzQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzZlYjkwMzYtZmVjOS00YzcyLThkNTctYjFhYjA3ZDA1NzQzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:28:14Z",
        "url": "https://www.imdb.com/video/vi1502478617/"
    },
    "url": "/title/tt0216216/"
}