{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jackie Chan",
            "url": "/name/nm0000329/"
        },
        {
            "@type": "Person",
            "name": "Lee Evans",
            "url": "/name/nm0262968/"
        },
        {
            "@type": "Person",
            "name": "Claire Forlani",
            "url": "/name/nm0001231/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 42515,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047933/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102783/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0082064/"
        },
        {
            "@type": "Person",
            "name": "Alfred Cheung",
            "url": "/name/nm0156434/"
        },
        {
            "@type": "Person",
            "name": "Bennett Davlin",
            "url": "/name/nm1424658/"
        },
        {
            "@type": "Person",
            "name": "Gordon Chan",
            "url": "/name/nm0150906/"
        }
    ],
    "datePublished": "2003-08-22",
    "description": "A Hong Kong detective suffers a fatal accident involving a mysterious medallion and is transformed into an immortal warrior with superhuman powers.",
    "director": [
        {
            "@type": "Person",
            "name": "Gordon Chan",
            "url": "/name/nm0150906/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Action",
        "Comedy",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTAxNmQ4ODAtM2IyMy00Yjg5LTgwNDMtODM4MGQ5MGQzNmU0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "medallion,hong kong,martial artist,warrior,interpol",
    "name": "The Medallion",
    "original_info": {
        "id": "The Medallion_2003",
        "name": "The Medallion",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-01-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0288045/"
        },
        "name": "Entertaining, Fast-Paced Genre Melder",
        "reviewBody": "Every 1000 years a child is born who can wield the power of two halves of a supernatural medallion, which can bestow superhuman strength and immortality, as well as take life away. Snakehead (Julian Sands), your typical crook with world domination ambitions, has discovered the identity of a modern-day chosen child, and pursues him. Meanwhile, Hong Kong police detective Eddie Yang (Jackie Chan) and Interpol agents Arthur Watson (Lee Evans) and Nicole James (Claire Forlani) have been pursuing Snakehead because of his criminal activities, and stumble into the grander scheme.\n\nWhile The Medallion is certainly not a film without flaws, it is satisfying on the whole if you approach it as a comic book/cartoon-styled Jackie Chan actioner. The film combines even more genres than that, actually, and there are times when it seems almost to be a spoof of James Bond-styled thrillers. There are also more straightforward comedy elements--especially when Evans is on screen, the film almost becomes a slapstick farce--there are Matrix-styled fantasy/action aspects, and there is a romance subplot. On top of all of that, The Medallion moves very quickly. Director Gordon Chan packs a lot of information into the film and barely pauses for a breath--if you blink, you're likely to miss some bit of crucial action, a plot point, or a joke.\n\nIn short, it's a complex stew of different genres, with a mixture of adult themes and childlike lightheartedness, wrapped in a dense mythology of fantasy and served at a non-stop, breakneck pace. Undoubtedly, those qualities will turn off a great deal of viewers, whether because they hate MTV/attention-deficit-disorder-styled editing, genre hopping or a lack of real-world believability. I don't mind any of those qualities, and in fact I tend to prefer films that forgo realism.\n\nI only had two small complaints about The Medallion. One, it took me a few scenes to get up to speed with the film, both plot-wise and in terms of style. Once I got into the groove, though, I didn't want the film to stop--enough that my second complaint is that the film was too short (and in general, I strongly dislike the fact that most films seem to be forced by studios to end within 90 minutes). I wanted to see more of these characters, especially Evans, who stole most of the scenes he appeared in. Jackie Chan fans seeking a return to films that are solely kung fu-oriented will likely be disappointed, but if you have broader tastes, The Medallion might hit the spot. An 8 out of 10 from me.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3404726553",
        "name": "The Medallion",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2U2MDNkOTgtZmE4ZC00MTIzLWJkZjUtM2Q2YjJlYzNlOTY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2U2MDNkOTgtZmE4ZC00MTIzLWJkZjUtM2Q2YjJlYzNlOTY0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:37:18Z",
        "url": "https://www.imdb.com/video/vi3404726553/"
    },
    "url": "/title/tt0288045/"
}