{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Zachary Scott",
            "url": "/name/nm0779923/"
        },
        {
            "@type": "Person",
            "name": "Bernie Hamilton",
            "url": "/name/nm0357745/"
        },
        {
            "@type": "Person",
            "name": "Key Meersman",
            "url": "/name/nm0576222/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2890,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0120919/"
        },
        {
            "@type": "Person",
            "name": "Peter Matthiessen",
            "url": "/name/nm0560249/"
        },
        {
            "@type": "Person",
            "name": "Hugo Butler",
            "url": "/name/nm0124947/"
        },
        {
            "@type": "Person",
            "name": "Luis Buñuel",
            "url": "/name/nm0000320/"
        }
    ],
    "datePublished": "1961-01-18",
    "description": "A jazz musician seeks refuge from a lynch mob on a remote island, where he meets a hostile game warden and the young object of his attentions.",
    "director": [
        {
            "@type": "Person",
            "name": "Luis Buñuel",
            "url": "/name/nm0000320/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU0MjI1ZTctY2FmMi00YWZjLWI5NzAtMjZjZGNlN2RkZWFlXkEyXkFqcGdeQXVyMDY4MzkyNw@@._V1_.jpg",
    "keywords": "island,preacher,river baptism,twenty dollar bill,shotgun",
    "name": "The Young One",
    "original_info": {
        "id": "The 1_1960",
        "name": "The 1",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "georgep53"
        },
        "dateCreated": "2012-07-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053967/"
        },
        "name": "A Little Known Classic From Luis Bunuel",
        "reviewBody": "I just got to see this film a few days ago and it is without a doubt a forgotten classic that like \"The Defiant Ones\" which preceded it and \"To Kill A Mockingbird\" which followed it deals with racism in the Jim Crow South.The eponymous young one is Evvie (Key Meersman) a teenage girl who's lived a quiet, isolated life on a coastal island with her grandfather. When the grandfather passes away she temporarily enters the custody of a cruel, bigoted caretaker named Miller (Zachary Scott) who is soon making advances towards her. Things get more complicated when an African American clarinet player named Traver (Bernie Hamilton) enters the picture fleeing a police manhunt that ensues when he's accused of raping a white woman. The screenplay by Hugo Butler, Luis Bunuel and Peter Matthiessen eschews stereotypes and the usual melodramatic clichés in favor of real, 3-dimensional characterizations and authentic human drama. Of course, I was familiar with Zachary Scott from earlier films where he famously played sophisticated heels. Here Scott does an excellent job with the difficult task of putting a human face on a despicable character. Likewise Bernie Hamilton, who's best known for a recurring role on the TV series Starsky and Hutch, is pitch-perfect as a musician who understands the forces arrayed against him but refuses to be a victim. I can't find much information about Key Meersman and it appears she only made a couple of films which is too bad because she was a gifted young actress. \"The Young One\" was a major work by a great director which sadly didn't get the respect it deserved from the establishment in 1960.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0053967/"
}