{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paolo Rotondo",
            "url": "/name/nm0745408/"
        },
        {
            "@type": "Person",
            "name": "Paul Glover",
            "url": "/name/nm0323163/"
        },
        {
            "@type": "Person",
            "name": "Chris Graham",
            "url": "/name/nm0333968/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3065,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0081440/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065796/"
        },
        {
            "@type": "Person",
            "name": "Scott Reynolds",
            "url": "/name/nm0721944/"
        }
    ],
    "datePublished": "1998-05-01",
    "description": "A female psychologist wants to understand the minds of a confessed serial killer who spent the last five years in a mental hospital because of his state.",
    "director": [
        {
            "@type": "Person",
            "name": "Scott Reynolds",
            "url": "/name/nm0721944/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjY1N2M0ZmItOWZhNC00YjZmLWE2YjYtYjEyN2U0ZDI3OWM4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "psychologist,serial killer,psychopathic killer,psychopath,rape",
    "name": "The Ugly",
    "original_info": {
        "id": "The Ugly_1997",
        "name": "The Ugly",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Sobriquet"
        },
        "dateCreated": "2001-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120401/"
        },
        "name": "Very slick thriller",
        "reviewBody": "I wanted to see The Ugly when it was released in cinemas, but I didn't actually get a chance to watch it until I rented it a few years later. Now I regret not seeing it in the cinemas when I had the chance - this movie would have been awesome on the big screen!!\n\nSimon Cartwright, a convicted serial killer, is a patient at a local mental institution under the care of two abusive orderlies and the sadistic Dr. Marlowe. Simon requests outsider Dr. Karen Shoemaker to re-evaluate his mental state, and through a series of interviews she learns more about his past and about his crimes. The use of disjointed and out of order flashbacks tease us with glimpses into Simon's past, and as the movie progresses, we see Karen being drawn further and further into Simon's fantasy world. As she begins to be affected mentally, so too are the viewers.\n\nThere's been a lot of criticism over this movie, mostly claims that the characters weren't believable enough or that the SFX were bad. To really appreciate this film you have to pull your mind away from what's conventional and try to see what the director is trying to do. Scott Reynolds isn't trying to follow some set 'horror movie' pattern or copy a particular movie genre. In the movie, \"The Ugly\" is a monster inside Simon's head, and that's what Reynolds is trying to do- get inside our heads, disturb us and shake us up a bit. This is done through the creepy atmosphere of red and blue colour themes, and the black blood adds to the surreal mood of the movie. Some of the characters are a bit unbelievable but this adds a 'Twin Peaks' feel to the film. And as for the ending, some things are better left unexplained, people!!\n\nThis movie is very violent and creepy, and guaranteed to keep you on the edge of your seat. If you like it, tell all your friends about it! I give it a 8.5/10"
    },
    "url": "/title/tt0120401/"
}