{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ben Barnes",
            "url": "/name/nm1602660/"
        },
        {
            "@type": "Person",
            "name": "Skandar Keynes",
            "url": "/name/nm1342727/"
        },
        {
            "@type": "Person",
            "name": "Georgie Henley",
            "url": "/name/nm1670137/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 158398,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073388/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0799294/"
        },
        {
            "@type": "Person",
            "name": "Christopher Markus",
            "url": "/name/nm1321655/"
        },
        {
            "@type": "Person",
            "name": "Stephen McFeely",
            "url": "/name/nm1321656/"
        },
        {
            "@type": "Person",
            "name": "Michael Petroni",
            "url": "/name/nm0678104/"
        }
    ],
    "datePublished": "2010-12-10",
    "description": "Lucy and Edmund Pevensie return to Narnia with their cousin Eustace where they meet up with Prince Caspian for a trip across the sea aboard the royal ship The Dawn Treader. Along the way they encounter dragons, dwarves, merfolk, a...",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Apted",
            "url": "/name/nm0000776/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Adventure",
        "Family",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWZkMzhhMTctYzBkMy00ZTIxLWFiY2ItNTEyYmQzMGQ4ZmU4XkEyXkFqcGdeQXVyNTA3MTU2MjE@._V1_.jpg",
    "keywords": "sequel,third part,the white witch character,lucy pevensie character,minotaur character",
    "name": "The Chronicles of Narnia: The Voyage of the Dawn Treader",
    "original_info": {
        "id": "The Chronicles of Narnia: Prince Caspian and the Voyage of the Dawn Treader_1989",
        "name": "The Chronicles of Narnia: Prince Caspian and the Voyage of the Dawn Treader",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "paperback_wizard"
        },
        "dateCreated": "2010-12-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0980970/"
        },
        "name": "Voyage of the Dawn Treader",
        "reviewBody": "This weekend, it was a rare treat for me to watch and review \"The Chronicles of Narnia: The Voyage of the Dawn Treader\". The Chronicles of Narnia have always been a favorite of mine. It's a series comparable to all the great fantasy epics, both in classic and modern times, and \"Voyage of the Dawn Treader\" is my favorite chapter in the saga.\n\nA brief history, for those who aren't familiar with the series. Narnia is a mystical kingdom in a magical world that can only be reached when it is of the greatest need. It is watched over by Aslan the Lion, who comes and goes as he pleases but always chooses champions who can protect Narnia in the face of evil. In the first movie, two brothers and two sisters from our world are brought to Narnia to overthrow a terrifying Witch-Queen. In the second, they help a young prince named Caspian ascend to the throne that his uncle had usurped. While only adolescents in our world, in Narnia these four young men and women had become great heroes, kings and queens of legend.\n\nIn this movie, the youngest two, Edmund and Lucy, travel to Narnia to find there is (apparently) no great need for their help. No wars are currently being fought, and King Caspian is now sailing on his ship, the Dawn Treader, to find seven Lords of Narnia whom his uncle had banished years earlier. Accompanying Edmund and Lucy, unwilling, is their cousin Eustace Scrubb, a thoroughly unpleasant boy who had never even read books about magical lands, let alone believed in them. His only delight in life seemed to be annoying others. Naturally, his attitude won him little friendship or sympathy when he found himself dragged along on a magical voyage in a land he'd teased his cousins for \"inventing\".\n\nThe ship's company sails to the east, following the last known course of the seven Lords. Along their way, they battle slave traders, encounter an island full of invisible creatures and buildings, and deal with all sorts of fantastical creatures and enchantments. They find themselves tempted by their greatest desires and threatened by their worst fears, even as they strive to discover the fate of the missing Lords.\n\nThe most valiant of the sailors is the brave Sir Reepicheep, a Mouse granted the gift of speech (and a new tail when his old was lost) by Aslan himself. Never one to back away from a fight, Reepicheep has a different motivation for embarking on this journey. As a young Mouse, he was told that he would some day travel to Aslan's Country in person. Delighted to see King Edmund and Queen Lucy once more, he finds it particularly difficult to tolerate Eustace. Reepicheep comments that, if Eustace hadn't been related to them by blood, he might have drawn his sword on the lad more than once (and from a Mouse who has faced dragons, it is no idle threat). Eventually, though, as Eustace is forced to face the reality of life in this strange and dangerous world, the noble Mouse becomes something of a guide to him, and even, oddly enough, a comfort from time to time.\n\nThere's certainly enough adventure and danger to create an epic, and the emotional and personal trials that each character faces make for interesting moral and dramatic scenes. However, the main difference between the book and the movie is the nature of the voyage on which the crew of the Dawn Treader embarks. In the movie, more than simply finding the lost Lords, the crew is told by a magician that they must bring the swords of each Lord to Aslan's Table and lay them upon it. Doing so would mean the end to a terrible curse that plagues the isles of the east and threatens to spread to the shores of Narnia in time.\n\nFinding the seven swords grounds the movie more firmly in the epic fantasy genre, but it hardly seems necessary. Adding this element to the quest actually changed the dynamic of it. Certainly, it sharpened the focus of the dangers they faced, making the encounters with spirits and sea serpents seem less random; but it also called for changing the order of certain events, such as the order in which they visited the various islands. Also, it takes the focus off the characters themselves, even as the movie tries to bring their personal battles to the forefront, at times.\n\nThese aren't major departures from the book. The same issues are addressed, and the storyline is very similar. In the end, not much was changed, especially not the messages delivered by the Great Lion. That's the important part. The books, written over half a century ago, endure in large part because of the author, C.S. Lewis, and the lessons he hoped to teach through his characters. Like the fables of old, The Chronicles of Narnia have their share of talking animals, but that's just window dressing. What's important is what you can learn from the story itself.\n\n(Originally appeared at http://fourthdayuniverse.com/reports/ )",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Lucy and Edmund Pevensie return to Narnia with their cousin Eustace where they meet up with Prince Caspian for a trip across the sea aboard the royal ship The Dawn Treader. Along the way they encounter dragons, dwarves, merfolk, and a band of lost warriors before reaching the edge of the world.",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2423167257",
        "name": "The Chronicles of Narnia: The Voyage of the Dawn Treader - Trailer #2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk2MzkzMzc5M15BMl5BanBnXkFtZTcwOTcwMzgwNA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk2MzkzMzc5M15BMl5BanBnXkFtZTcwOTcwMzgwNA@@._V1_.jpg",
        "uploadDate": "2010-11-10T23:25:00Z",
        "url": "https://www.imdb.com/video/vi2423167257/"
    },
    "url": "/title/tt0980970/"
}