{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dorothy McGuire",
            "url": "/name/nm0570192/"
        },
        {
            "@type": "Person",
            "name": "George Brent",
            "url": "/name/nm0107575/"
        },
        {
            "@type": "Person",
            "name": "Ethel Barrymore",
            "url": "/name/nm0000856/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10569,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0041421/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021635/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005025/"
        },
        {
            "@type": "Person",
            "name": "Mel Dinelli",
            "url": "/name/nm0227571/"
        },
        {
            "@type": "Person",
            "name": "Ethel Lina White",
            "url": "/name/nm0924781/"
        }
    ],
    "datePublished": "1946-02-07",
    "description": "In 1916, a shadowy serial killer is targeting women with \"afflictions\"; one night during a thunderstorm, the mute Helen feels menaced.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Siodmak",
            "url": "/name/nm0802563/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTZiNjQ3YzItMmRjOS00ZDRiLWFhZGEtMWQyZGM3ZTNmNTVjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "dark and stormy night,year 1916,serial killer,murder,stepmother stepson relationship",
    "name": "The Spiral Staircase",
    "original_info": {
        "id": "The Spiral Staircase_1946",
        "name": "The Spiral Staircase",
        "year": "1946"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2013-12-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0038975/"
        },
        "name": "The Evilest Eye in Cinema History",
        "reviewBody": "Being one of the last truly great thriller/mystery classics I still had lingering on my must-see list; I cherished big expectations for \"The Spiral Staircase\". Perhaps even a little TOO big Don't get me wrong, it's a fantastic film and a bona fide genre masterpiece, but somehow I expected even more suspense and moodiness! Let me just get out of my system that certain sequences inside the old dark house were a bit tedious and overdone. But hey, who's complaining, since the full rest of the film is pure perfection in terms of beauty, elegance, atmosphere and scenery. It's rather intriguing how certain films, like \"Freaks\" or \"Peeping Tom\" to name just two, caused so much controversy and scandal while \"The Spiral Staircase\" is widely considered as an untouchable landmark even though it features similar prohibited themes like voyeurism and murder victims with a disability. The opening sequence is almost too brilliant for words. A medium sized crowed gathers in a small theater for a silent movie screening while, on the floor above them, a crippled girl prepares herself to go to sleep. The utmost evil glazing eye watches her from inside the wardrobe and strikes exactly when she lifts the gown over her head. You can't get any more expressionistic than that. After that, \"The Spiral Staircase\" establishes itself as the sheer archetype of old dark house thrillers. The beautiful but mute Helen is a social worker in the secluded mansion of the ailing Mrs. Warren. A heavy thunderstorm rages outside, Mrs. Warren son and stepson argue over their life styles (and the lovely secretary Blanche) and the rest of the household staff either turns to alcohol or complains about the stubborn matriarch. Both Mrs. Warren and her doctor urge Helen to leave town. Could it be the maniacal killer is inside the house? This film is a rarity. Even though it doesn't require an Einstein brain to figure out the killer's identity, you honestly don't care that much and remain glued to the screen to admire how the Gothic atmosphere unfolds further. Director Robert Siodmak – a German immigrant in America following WWII – truly masters the cinematography and Victorian set pieces. He also manages to include the thunderstorm as an extra – and essential – supportive character. Speaking of the cast, I dare you to name a so-called 'damsel in distress' more amiable than Dorothy McGuire's Helen. She's a vulnerable angel, targeted by a frustrated and obsessive madman on a mission to rid the world of imperfection. Especially the women impress in \"The Spiral Staircase\" as I simply must also mention Ethel Barrymore as Mrs. Warren (nominated for an Oscar, even) and Elsa \"Bride of Frankenstein\" Lanchester as the maid with a taste for brandy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0038975/"
}