{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Keaton",
            "url": "/name/nm0000474/"
        },
        {
            "@type": "Person",
            "name": "Christopher Lloyd",
            "url": "/name/nm0000502/"
        },
        {
            "@type": "Person",
            "name": "Peter Boyle",
            "url": "/name/nm0001967/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15756,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003687/"
        },
        {
            "@type": "Person",
            "name": "Jon Connolly",
            "url": "/name/nm0175300/"
        },
        {
            "@type": "Person",
            "name": "David Loucka",
            "url": "/name/nm0521649/"
        }
    ],
    "datePublished": "1989-04-07",
    "description": "Four mental patients on a field trip in New York City must save their caring chaperon, who ends up being taken to a hospital in a coma after accidentally witnessing a murder, before the killers can find him and finish the job.",
    "director": [
        {
            "@type": "Person",
            "name": "Howard Zieff",
            "url": "/name/nm0956052/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Comedy",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWVkMTk4MjItMzE2Ni00NzllLTlmMWUtMmVjODYyYmRmNzViXkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1_.jpg",
    "keywords": "mental illness,psychiatric patient,murder,escaped psychiatric patient,god complex",
    "name": "The Dream Team",
    "original_info": {
        "id": "The Dream Team_1989",
        "name": "The Dream Team",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2011-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0097235/"
        },
        "name": "I drove the moneylenders from the temple. I can handle a ten-spot.",
        "reviewBody": "The Dream Team is directed by Howard Zieff and written by John Connolly and David Loucka. It stars Michael Keaton, Christopher Lloyd, Peter Boyle, Stephen Furst and Lorraine Bracco. Music is by David McHugh and cinematography by Adam Holender.\n\nBilly Caulfield (Keaton)-compulsive liar and prone to violent outbursts; Henry Sikorsky (Lloyd)-tidy freak who thinks he's a doctor; Jack McDermot (Boyle)-thinks he's Christ; Albert Ianuzzi (Furst)-near catatonic personality who can only speak in sports jargon. \n\nThere are people, and perhaps even that little old angel on your shoulder from time to time, that tell you that one shouldn't make fun of the afflicted; case in point folk with mental issues. So it be with this here amusing picture, a film that basically sees four odd balls let loose in New York as they try to find their missing doctor and foil the couple of dirty cops who want to silence said doctor for good. Yet Zieff's film is neither crass or stupid, the comedy is well drawn, with the characters themselves not the danger to society kind, but the misfit sort who are struggling to fit into said society. Looking in at it a bit deeper, film has valid points about acceptance, messages about understanding, friendships and collective group unity being powerful. Even the effects of work pressure is given a sardonic glance. It's not like the makers set out to offend, pic never even sails close to the wind, evidently they clearly set up to entertain and amuse, and that goal is achieved royally because The Dream Team is awfully funny. \n\nDoes Ed go out of the window? Let's have a show of hands. You can vote too, Ed. This is America. \n\nIt's a smart collection of actors playing the \"afflicted\" guys, four actors very comfortable with each other and enjoying the benefits of a strong script. Each one is handed great comedy moments to act out, neither left out and neither disappointing. Boyle arguably steals the film by way of some excellent visual comedy, but it's most likely Keaton's caustic observations and one line zingers that will leave the lasting impression. The final quarter gets a bit mechanical as the intrepid \"nut buddies\" finally bond and the film shifts to a basic chase/race against the clock affair, but the gags still come and you may find you are still laughing about something that was said earlier anyway! Bracco isn't given a lot to do, which practically renders this as being an ultimate buddy buddy guy flick, and the two \"dirty\" coppers played by James Remar and Philip Bosco are by the numbers villains. Small moans only, though, and in the name of good comedy, who cares really?\n\nIt's great to be young and insane! Hell Yeah. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Four mental patients on a field trip in New York City must save their caring chaperon, who ends up being taken to a hospital in a coma after accidentally witnessing a murder, before the killers can find him and finish the job.",
        "duration": "PT1M53S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3985818393",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmI4MjY0YWMtYmIwYS00Nzk0LTliZjUtY2ZlZjZmOWIzZjQxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmI4MjY0YWMtYmIwYS00Nzk0LTliZjUtY2ZlZjZmOWIzZjQxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-04T22:05:21.907Z",
        "url": "https://www.imdb.com/video/vi3985818393/"
    },
    "url": "/title/tt0097235/"
}