{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Mari Devon",
            "url": "/name/nm0015924/"
        },
        {
            "@type": "Person",
            "name": "Kate Higgins",
            "url": "/name/nm1512156/"
        },
        {
            "@type": "Person",
            "name": "Houko Kuwashima",
            "url": "/name/nm0476678/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2080,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "The Twelve Kingdoms",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011126/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052417/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106793/"
        }
    ],
    "description": "High school student Youko Nakajima is approached by a strange man who claims he's been searching for her and that she is the rightful ruler of his kingdom.",
    "genre": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmU0ODFiNDItMzE4OC00NWRjLWJjZjktNzBiZmVmYWVmY2Q3XkEyXkFqcGdeQXVyNjc3OTE4Nzk@._V1_.jpg",
    "keywords": "qilin,isekai,traveling to another world,transported to another world,kirin",
    "name": "12 kokuki",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ken_cockerham"
        },
        "dateCreated": "2011-06-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0327386/"
        },
        "name": "Marvelous Epic Fantasy, but Heed this Advice",
        "reviewBody": "The Twelve Kingdoms features many of the trappings of epic fantasy: a complex fantastic realm with plenty of back-story, powerful monsters, and spectacular sword duels. But at its heart The Twelve Kingdoms is really a wonderful study of how seemingly worthless people can be tempered by severe hardship into people of great character; from people you would avoid to people you would be happy to call friend. I actually felt like a better person when I finished it; not a feeling I normally get from watching anime.\n\nBut you should know a few things before you get into this excellent show: It features four separate story arcs, and only two of them actually involve the main protagonist Yuoko. I highly recommend new viewers only watch episodes 1-13 and 22-40; my five-star rating pertains primarily to just those episodes. The episodes in-between tell an unfinished and unrelated story, and are likely to leave viewers feeling frustrated. Episodes 14 and 21 are unimportant \"recap\" episodes I'd only recommend watching if you still feel confused after watching the first 13.\n\nThe first few episodes (1-5 and 22-29) of these story arcs can be tiresome, as the protagonists start as annoying, whiny characters; but I urge everyone to \"stick with it\" and keep watching as the payoff at the end is certainly worth it: Twelve Kingdoms features one of the best endings I've ever seen (at episode 39). It's important for us to see these characters as annoying and somewhat pathetic so that we fully appreciate the strong, self-aware people they become in the end. For this reason re-watching the series is a special treat; I recommend watching it again at least once.\n\nThe setting of The Twelve Kingdoms is complex and the myriad of special terms may put some people off; but I would again urge people to be patient; Yuoko generally knows less than us, and her lack of understanding is important to the story, so a bit of confusion on our part helps us to empathize with her.\n\nFinally, I'd recommend watching the Japanese audio with English subtitles if you can stand to do so. Yuoko's voice is much more expressive on the Japanese track and features noticeable changes in tone that reflect and highlight the changes in her attitude as the story progresses. However, most of the other English voice-overs are actually fairly good.\n\nTwelve Kingdoms is from 2002 and so the quality of the animation, while good, isn't quite up to par with modern animes like Moribito: Guardian of the Spirit. There is no sexual content of any kind (and although some characters are depicted taking baths, nothing racy is seen), and almost no romantic content whatsoever. There is no gore, almost no blood shown, and most deaths occur off-screen. While many episodes feature exciting and well done action, fighting isn't quite the focus of The Twelve Kingdoms and the entire first half of the third arc (episodes 22-32) features almost no action at all. Although the content is probably safe for kids, I can't imagine any kids being able to follow the complex plot, or deal with the intense emotions portrayed within. Twelve Kingdoms isn't tame for the sake of a PG rating; it simply understands its focus is storytelling and therefore doesn't need to delve into sex or violence to make for a truly entertaining experience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "aka \"12 kokuki\"",
        "duration": "PT1M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi503054617",
        "name": "The Twelve Kingdoms: Volume 3: Coup",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWJiZWI3MTQtYTAzMy00YTdmLWIzZTYtYzcxMDQ0YmNiMjE0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWJiZWI3MTQtYTAzMy00YTdmLWIzZTYtYzcxMDQ0YmNiMjE0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:18:04Z",
        "url": "https://www.imdb.com/video/vi503054617/"
    },
    "url": "/title/tt0327386/"
}