{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Piper Laurie",
            "url": "/name/nm0001453/"
        },
        {
            "@type": "Person",
            "name": "Sissy Spacek",
            "url": "/name/nm0000651/"
        },
        {
            "@type": "Person",
            "name": "Walter Matthau",
            "url": "/name/nm0000527/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18736,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076825/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043853/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006528/"
        },
        {
            "@type": "Person",
            "name": "Truman Capote",
            "url": "/name/nm0001986/"
        },
        {
            "@type": "Person",
            "name": "Stirling Silliphant",
            "url": "/name/nm0798103/"
        },
        {
            "@type": "Person",
            "name": "Kirk Ellis",
            "url": "/name/nm0254945/"
        }
    ],
    "datePublished": "1996-10-11",
    "description": "Becoming an orphan in 1935, Collin moves to his dad's cousins Verena and Dolly. Verena is a rich, bossy businesswoman. Dolly, Collin and the maid revolt, moving to a tree house.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Matthau",
            "url": "/name/nm0559879/"
        }
    ],
    "duration": "PT1H47M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDU2OTUxMTItOWI5YS00ODFlLWJkMDAtNTQwODkyNTA1OTI2XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "gold nugget,southern gothic,south,southern culture,herbalist",
    "name": "The Grass Harp",
    "original_info": {
        "id": "The Grass Harp_1996",
        "name": "The Grass Harp",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheFanReport"
        },
        "dateCreated": "2005-04-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0113211/"
        },
        "name": "An Undiscovered Gem full of Wonderful Surprises and Great Performances",
        "reviewBody": "Set in the 30's, The Grass Harp is a story about an orphan boy who is sent to live with his eccentric aunts. The story follows the plight of social \"outcasts\" with humor and insight. \n\nOn the surface this story is about love and our connections to others - both living and dead. Yet underneath run themes of social injustice, racial inequality, religion, morals and the struggles of social conformity vs. individual expression - but the film never preaches. It just reveals. \n\nDirector Charles Matthau accomplished the near-impossible task of adapting Truman Capote's classic book into a beautiful rendered film. Wisely, he approached this multi-layered story with a light touch, allowing the material and talent to shine. Matthau skillfully captures a myriad of complex relationships and emotions, allowing the characters to live and breathe without placing judgment on who they are. \n\nThe boy's coming-of-age story is entertaining, humorous and poignant. As the film unfolds, Collin encounters a diverse group of characters, from which he gains valuable insights about life. Now an adult he looks back (as the narrator) reflecting on this formative time. \n\nEach character is uniquely distinct and true-to-life. The entire all-star cast is at the top of their game. \n\nThis is the best performance of Piper Laurie's career. She is delicate and mesmerizing as the fragile Dolly Talbo. Her scenes with Spacey and Matthau will break your heart. \n\nFor those of you who have only seen Walter Matthau in grumpy curmudgeon roles, you are in for a treat! \n\nMatthau is wonderful as a Judge Cool, a Southern gentleman struggling to find meaning in his retirement years. As Piper Laurie's love interest he is tender and charming yet dignified. A man of integrity and honor, Judge Cool is the only \"accepted\" towns person with compassion for the outcasts.\n\nAs a collective, the ensemble cast captures the social pecking order with uncanny accuracy. \n\nJon Don Baker is great as the Sheriff, Nell Carter is a hoot as the eccentric housekeeper and Sissy Spacek is an amazing blend of steely resolve masking her conflicted feelings of vulnerability and insecurity. \n\nRoddy McDowell is the delightfully sarcastic barber. Jack Lemmon and Mary Steenbergen are great fun as cons on the run. Mary as a traveling cowgirl evangelist out to save souls - never mind that she is a single- mother of fourteen kidsall by different fathers! She pulls it off with comic charm and sad poignancy. Lemmon is a \"chemical engineer\" (read quack potions salesman) with a scheme to get his hands on Dolly's herbal potion. Even though both Lemmon and Steenbergen are devious cons looking to score, they too are well-developed characters and oh-so-human in their desperate schemes to survive the Great Depression. \n\nThere is also one of the most delightful casts of furry creatures ever assembled: a host of cats, dogs, fish, and a scene-stealing Rooster named Ralph. It looked to me like Ralph was huffing around wishing he had more lines. I'd be all for him getting his own sequel.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Fine Line",
        "duration": "PT2M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi157483033",
        "name": "The Grass Harp",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDdkYWM3NjQtODIyYy00ZmUzLTkyOGQtN2ZhZWU2YzY2NjAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDdkYWM3NjQtODIyYy00ZmUzLTkyOGQtN2ZhZWU2YzY2NjAwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-18T03:48:39Z",
        "url": "https://www.imdb.com/video/vi157483033/"
    },
    "url": "/title/tt0113211/"
}