{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lon Chaney",
            "url": "/name/nm0151606/"
        },
        {
            "@type": "Person",
            "name": "Mary Philbin",
            "url": "/name/nm0679907/"
        },
        {
            "@type": "Person",
            "name": "Norman Kerry",
            "url": "/name/nm0449908/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19048,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Gaston Leroux",
            "url": "/name/nm0503693/"
        },
        {
            "@type": "Person",
            "name": "Walter Anthony",
            "url": "/name/nm0031033/"
        },
        {
            "@type": "Person",
            "name": "Elliott J. Clawson",
            "url": "/name/nm0165470/"
        }
    ],
    "datePublished": "1925-11-15",
    "description": "A mad, disfigured composer seeks love with a lovely young opera singer.",
    "director": [
        {
            "@type": "Person",
            "name": "Rupert Julian",
            "url": "/name/nm0432216/"
        },
        {
            "@type": "Person",
            "name": "Lon Chaney",
            "url": "/name/nm0151606/"
        },
        {
            "@type": "Person",
            "name": "Ernst Laemmle",
            "url": "/name/nm0480677/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDk4MDM1NTI5MV5BMl5BanBnXkFtZTgwMDkyMDc2MTE@._V1_.jpg",
    "keywords": "phantom of the opera,opera,singer,underground,opera house",
    "name": "The Phantom of the Opera",
    "original_info": {
        "id": "The Phantom of the Opera_1925",
        "name": "The Phantom of the Opera",
        "year": "1925"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lugonian"
        },
        "dateCreated": "2003-03-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0016220/"
        },
        "name": "Who was that Masked Man?",
        "reviewBody": "THE PHANTOM OF THE OPERA (Universal, 1925), directed by Rupert Julian, from the celebrated novel by Gaston Leroux, stars Lon Chaney, the legendary \"man of a thousand faces,\" in what is hailed to be his most famous movie role, as well as one of the most bizarre presentations of his thousand faces ever shown on screen.\n\nHailed as a horror movie, THE PHANTOM OF THE OPERA is actually a mystery tale with added suspense that takes place in a Paris opera house believed to be haunted by a mysterious cloaked figure obsessed by one particular girl, Christine Daae (Mary Philbin), an understudy, whose main interest is her love for Raoul De Chagny (Norman Kerry), her fiancé. Christine keeps hearing a compelling voice behind the walls of her dressing room that gives her encouragement to perform. Her career soon takes a turn for the better when the lead performer is \"mysteriously\" unable to go on and Christine is called to take her place. The voice later summons Christine to the cellar five flights beyond the opera house where she follows this sinister man whose face is covered with a mask. Although she fears him not, Christine becomes very curious about \"The Phantom,\" but curiosity gets the better of her when she decides to creep up from behind the phantom and remove his mask, only to get the surprise of her life. The Phantom agrees to release Christine from his underground cellar (consisting of a coffin bed where the Phantom sleeps) at a promise that she not only devote herself to her opera singing, but to never see or speak to her fiancé again. Only after Christine has a secret meeting with Raoul during a ball masque does the Phantom, who shadowed her, to make Christine his prisoner of love.\n\nIn true Universal fashion, this Gothic presentation has all the elements of a suspense thriller. From its opening shot shows a cloaked figure creeping about the underground cellar of the opera house. The storyline immediately gets down to basics in which there's a discussion amongst the staff regarding a mysterious figure roaming about, followed by the sudden appearance of another mysterious character (Arthur Edmund Carewe) walking about the opera house, saying nothing but observing everything. In between these key scenes leading to the purpose of the movie title, there are ballet and opera sequences inter-cutting the plot, along with a stage hand (Snitz Edwards) supplying some \"comic relief.\". This being a silent film, the compositions from FAUST cannot be heard, but are usually heard through the underscoring which accompanies the film. Besides the now familiar story and its just famous unmasking sequence, it's Chaney as Erik, the mysterious phantom, with his skull-like appearance, who makes this one of the most intense characters ever played on the screen. The movie, itself, fails to explore the background to Erik's character, as to why does he choose Christine as his selected one. Only late into the story is it realized, through the investigation in the police records by Christine's fiancé, Raoul, that Erik is not only a self-educated musician having escaped imprisonment from Devil's Island, but is actually insane. Other than being insane, he's a genius, for that he has decorated his underground chambers with certain traps, including a room that can fill with water or become filled with intense heat for his intruders. While Erik being insane might explain certain aspects as his intent to kill certain individuals at the opera house (with one scene finding one man left dangling from a noose), but fails to answer the question, \"Was Erik born this way or was he a rejected creation of Doctor Frankenstein?\" \n\nSo popular upon its release, THE PHANTOM OF THE OPERA was reissued in 1930, a shorter print with added talking sequences and new orchestral score. Universal remade THE PHANTOM OF THE OPERA in 1943 with Claude Rains; and in 1962 with Herbert Lom, each performed differently from the Chaney carnation, but with some explained detail to the Phantom's background of character.\n\nTHE PHANTOM OF THE OPERA has achieved cult status over the years, due to constant revivals, ranging from theaters to television. It was one of the selected twelve movies shown on public television's 1975 presentation of \"The Silent Years\", hosted by Lillian Gish. During the era of home video in the 1980s, THE PHANTOM OF THE OPERA not only became a public domain title, but consisted of various versions and different scores. The Kartes Video Communications print features no scoring but a different opening introducing Raoul de Chagny (Kerry) and his brother, Philippe (John St. Polis), through title cards, and other scenes detailing the character of Carlotta (Virginia Pearson). There's even a conclusion with Christine and Raoul kissing on their honeymoon in Viroflay, a fade-out that's non-existent in most prints. BLACKHAWK Video, later Republic Home Video, included an excellent organ score (by Gaylord Carter) and clear picture quality of 79 minutes, the standard length of many video copies, but excluding the brief honeymoon closing. This similar print can be found from KINO Video. \n\nIn one of the Turner Classic Movies cable TV presentations of THE PHANTOM OF THE OPERA during its weekly Silent Sunday Nights a few years ago, the station, having broadcast with a traditional organ score in years past, presented Halloween night one of the worst reproductions and bad orchestrations ever presented for a silent movie, making this 97 minute version appear endless. Eventually TCM went ahead and a more soothing copy and organ score afterwards.\n\nAs it stands, THE PHANTOM OF THE OPERA can be seen numerous ways on video and DVD (at either 97 minutes or longer with orchestral scoring), but it's Lon Chaney's cloak figure that will remain in lasting memory long after the movie is over. (***)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1986052377",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWU4YjYwYmMtZWI5Yi00Yjk3LWE2OWItMzkyYjc2NzY4Y2QyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWU4YjYwYmMtZWI5Yi00Yjk3LWE2OWItMzkyYjc2NzY4Y2QyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-01-22T11:29:31.620Z",
        "url": "https://www.imdb.com/video/vi1986052377/"
    },
    "url": "/title/tt0016220/"
}