{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tchéky Karyo",
            "url": "/name/nm0001409/"
        },
        {
            "@type": "Person",
            "name": "Bart the Bear",
            "url": "/name/nm1075976/"
        },
        {
            "@type": "Person",
            "name": "Youk the Bear",
            "url": "/name/nm1212486/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18387,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "The Bear",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022525/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067540/"
        },
        {
            "@type": "Person",
            "name": "James Oliver Curwood",
            "url": "/name/nm0193617/"
        },
        {
            "@type": "Person",
            "name": "Gérard Brach",
            "url": "/name/nm0102722/"
        }
    ],
    "datePublished": "1989-10-27",
    "description": "An orphan bear cub hooks up with an adult male as they try to dodge human hunters.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Jacques Annaud",
            "url": "/name/nm0000269/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzVmZjMwM2QtYWI5Mi00NGExLWI2NzEtM2QwYzFiM2QxMTc3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "19th century,year 1885,bear,survival,hunting",
    "name": "L'ours",
    "original_info": {
        "id": "The Bear_1988",
        "name": "The Bear",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Freddy_Levit"
        },
        "dateCreated": "2004-11-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0095800/"
        },
        "name": "The most majestic nature film of the century - pure escapism into the subtlety of life!",
        "reviewBody": "We rarely see in our contemporary world simple, subtle films regarding nature which in turn give us a true essence of the meaning and beauty of life. All we absorb out of proportion day by day from watching television and films is the violence, vulnerability and sexual tendencies of the human being. The 60's and 70's were infested with the drugs and sex appeal trend and the 80's crammed more action macho flicks than one can count sheep. However, it was the 90's and the turn of the millennium that exploded into the CGI craze and destroyed the film industry, reducing it into a commercial quick-produce supermarket in which quality films came close to none-existent and where violence was more popular than ever before.\n\nA rare example of subtle contemporary masterful film making is 'L'Ours', better known in English translation as 'The Bear'. Jean-Jacques Annaud, the man behind the most extraordinary of prehistoric based films, 'Quest For Fire', stunned the world with his unparalleled mesmerizing vision of a natural world destroyed by man in what virtually is a film without dialogue. Yet it is an experience that will play with your emotions and warm your heart, right up to the chilling finale.\n\nThe story is set around the 1800's and revolves around an orphaned bear cub and its struggle to survive the harsh wilderness of British Columbia following the death of its mother. Alone and with no survival skills, the bear cub must learn the necessities of life the hard way. That is until it meets a tough, lone, but wounded Grizzly bear whose endeavor to survive is all the same after mountain hunters, blinded by their hunger for wealth, pursue their valuable skins. The two Grizzlies form a bond more powerful than the guns that pursue them in which the cub learns all the hardships of life first hand and grows to stand up for itself against the vast, relentless world that it lives in. Does man, the pursuer, become one with nature and understand the value of life?\n\nVery few films without dialogue have captured the imagination that 'The Bear' has inscribed in my memory. Following the film's conclusion, I made a pledge to myself that one day I will be going to British Columbia myself. The cinematography was excruciatingly beautiful - I felt like I was there throughout the whole duration of the picture. The music was so uplifting and poignant throughout, that it completely drained me of my emotions - especially the finale!\n\nTcheky Karyo (famous French actor) playing one of the hunting mountain men who comes to terms with nature, plays his role convincingly, but there was no better performance than that of the starring bear cub and its much larger assistant. Their commanding presence leaves us laughing, crying and despising. All were simply natural expressions and worked on a documentary level, giving this film immaculate credibility.\n\nThe subtlest of all films I have ever seen, I recommend this to anybody who likes the occasional escape from reality to a world where life makes all the more sense. A definitive addition in my collection and an escape I will be taking for years to come. A masterwork of epic proportions and a classic in its genre. May the film industry bestow upon us more of these pleasures in the near future!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT59S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi559856153",
        "name": "Bande-annonce [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTE0ODk2YTgtMWVkYy00YTRiLTllOTctODQwYjFlNTAwNTk4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTE0ODk2YTgtMWVkYy00YTRiLTllOTctODQwYjFlNTAwNTk4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-03T09:58:56.561Z",
        "url": "https://www.imdb.com/video/vi559856153/"
    },
    "url": "/title/tt0095800/"
}