{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julian Sands",
            "url": "/name/nm0001696/"
        },
        {
            "@type": "Person",
            "name": "Saffron Burrows",
            "url": "/name/nm0004787/"
        },
        {
            "@type": "Person",
            "name": "Stefano Dionisi",
            "url": "/name/nm0227958/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3320,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0082027/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0134173/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046206/"
        },
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "datePublished": "2000-01-07",
    "description": "Nic's life in glimpses at ages 5, 12, 16 and later film director and husband/dad.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Figgis",
            "url": "/name/nm0001214/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWFkNDRhMzctM2FhNS00ZjVjLWIyMWQtODAwMWNhZWU2NTM0XkEyXkFqcGdeQXVyMjk1NzAxNg@@._V1_.jpg",
    "keywords": "red pubic hair,urination,male nudity,beating,female nudity",
    "name": "The Loss of Sexual Innocence",
    "original_info": {
        "id": "The Loss of Sexual Innocence_1999",
        "name": "The Loss of Sexual Innocence",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bob A-2"
        },
        "dateCreated": "1999-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0126859/"
        },
        "name": "Shallow exercise in self-importance, portended to be all or partly autobiographical, by an author/director who presumes a little too much on his life story's being important enough to tell.",
        "reviewBody": "The warning flag goes up for me when a filmmaker makes a film about filmmaking: that his breadth of life experience does not go beyond his immediate enclave of college buddies reassuring each other that they're brilliant. Of course there are many superb movies about making movies, for example Sunset Boulevard and the '54 remake of A Star is Born, but these films have interesting stories to tell about, and by, people who have lived, and lived somewhere other than film school. Loss of Sexual Innocence does not.\n\n Normally I would applaud the freehand style the director uses in going back and forth between different times in the life of Julian, the main character, but some of his choices in doing so are confusing. When we first meet Julian he is a towheaded five-year-old living in Kenya; in his later youth scenes he appears as a dark-haired, obese teen, and as an adult he is rail-thin and prematurely gray. Morbid obesity is a deeply-affecting, emotionally scarring and virtually incurable condition (the \"cure\" rate is two percent, literally half the chance of leading an arguably normal life as has a heroin addict). The fact that Figgis, the author/director, simply wrote 100 pounds out of the story and reintroduced the character as a thin adult is a cold betrayal of the writer's lack of emotional depth or knowledge of the human condition. We're being told the life story of a character by a writer who doesn't know as much about life as we do. The changing hair color could be explained -- it really does happen to people -- but it hinders the audience who's trying to decide if these three actors are the same character, or if they are separate characters unknown to each other. Another issue that is not addressed throughout the film is, are we still in Kenya? If these nondescript urban and suburban scenes are in fact a foreign country by virtue of a caption at the bottom of the screen that says Kenya, then what is the point of setting the scenes in a faraway country?\n\nEventually (but don't hold your breath) Julian's story vignettes, plus those of some other characters, converge in a single plot wherein they go off to some location to make their film, but the trip results in some very physical repercussions among both central and ancillary characters. Now that the film, at this point, has condescended to tell a traditional story, we never do find out if the injured people recover.\n\nI'm reminded of a couple of the later films of Joseph Losey (Dark Ceremony; The Go-Between), who teased us by meting out small bits of the story here and there and not telling us everything, apparently never realizing himself that he didn't have that much to say.\n\nOne final observation: The use of the word \"sexual\" in the title and the appearance of naked people on the poster artwork are apparently designed to draw crowds by implying, by virtue of the film's title somehow relating this story to sexuality, that the film is therefore sexy.\n\nDon't be fooled.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT1M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1961885977",
        "name": "The Loss of Sexual Innocence",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODMwMGI5ZjItZTljMi00M2FjLTlmYmEtOTczZGY4MmNlNjFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODMwMGI5ZjItZTljMi00M2FjLTlmYmEtOTczZGY4MmNlNjFhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:35:55Z",
        "url": "https://www.imdb.com/video/vi1961885977/"
    },
    "url": "/title/tt0126859/"
}