{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Lee",
            "url": "/name/nm0000489/"
        },
        {
            "@type": "Person",
            "name": "Peter Cushing",
            "url": "/name/nm0001088/"
        },
        {
            "@type": "Person",
            "name": "Lorna Heilbron",
            "url": "/name/nm0374128/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4124,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0129086/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0184077/"
        },
        {
            "@type": "Person",
            "name": "Peter Spenceley",
            "url": "/name/nm0817837/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Rumbold",
            "url": "/name/nm0750099/"
        }
    ],
    "datePublished": "1973-01-01",
    "description": "A Victorian-age scientist returns to London with his paleontological bag-of-bones discovery from Papua New Guinea. Unfortunately, when exposed to water, flesh returns to the bones unleashing a malevolent being on the scientist's f...",
    "director": [
        {
            "@type": "Person",
            "name": "Freddie Francis",
            "url": "/name/nm0005711/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjUyZWU1ODgtYzIyYy00YmM2LWJmMGMtOTczOWU2MjI3ZjM2XkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_.jpg",
    "keywords": "19th century,brother brother relationship,flashback,experiment,escape",
    "name": "The Creeping Flesh",
    "original_info": {
        "id": "The Creeping Flesh_1973",
        "name": "The Creeping Flesh",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Wuchakk"
        },
        "dateCreated": "2014-03-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068424/"
        },
        "name": "Lush Gothic Hammeresque Mystery/Horror with Lee & Cushing",
        "reviewBody": "Although \"The Creeping Flesh\" (1973) is not technically a Hammer film, it was made by a rival British company with Hammer alumni Christopher Lee, Peter Cushing and director Freddie Francis.\n\nLee and Cushing play two rival half-brothers; Lee runs a mental asylum and Cushing is a scientist trying to cure humanity of evil and insanity. Lee, it turns out, is also trying to find the same cure by experimenting on the lunatics in his asylum.\n\nCushing is driven by the insanity and recent death of his wife. He is so paranoid about the \"infection\" of evil and madness that he overprotects his daughter.\n\nHe discovers an 8-foot tall diabolical skeleton on one of his expeditions in New Guinea and becomes convinced that evil itself is somehow linked to this figure. He discovers that the skeleton strangely acquires flesh/blood when it gets wet. He subsequently develops a \"vaccination\" from the blood to supposedly give people immunization from evil and insanity, which he then administers to his daughter (!).\n\nAs you can see, the plot is highly creative, if nothing else. Numerous issues are touched on in the storyline, including:\n\nThe origin of evil and insanity. Sibling rivalry. The consequences of overprotection. Is evil and madness a disease for which a person can be vaccinated? The (lack of) ethics of \"scientists.\" An escaped lunatic running amok. Having a carnal celebration after years of repression. The 19th century English pub scene (alcohol, whores and brawls). An 8-foot creeping horror.\n\nSome would contend that \"The Creeping Flesh\" bites off more than it can chew (especially at only 95 minutes). Yet, I would say that it addresses all of these items very well. I should also point out that it's not hard to follow, as another reviewer argues.\n\nTwo parts of the film are very well done: First, when Cushing's daughter, Lorna Hailbron, finally escapes her father's overprotective clutches and attempts to \"paint the town red\" (naturally). Lorna does an exquisite job portraying the daughter in both her initial naive, modest state and, later, in her wild first-time-party-girl condition.\n\nSecond, when the skeleton finally comes to life after acquiring all its flesh. You can see it lurking in the moonlight with a hood and cowl. This creepy image brought to memory artist depictions of the Flatwoods monster that supposedly appeared near that West Virginia village in September 1952.\n\nInterestingly, \"The Creeping Flesh\" has many similarities to \"Horror Express,\" another Hammeresque film made the very same year. Each film stars Lee and Cushing; each features an ancient recently-discovered artifact that emanates evil (a skeleton and a frozen neanderthal respectively); each features numerous shots of people analyzing \"evil\" blood samples through a microscope. I like both films about equally, but give the slight edge to \"The Creeping Flesh.\"\n\nDon't hesitate to check out \"The Creeping Flesh\" if this sounds like your cup of java. \n\nGRADE: B+",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Victorian-age scientist returns to London with his paleontological bag-of-bones discovery from Papua New Guinea. Unfortunately, when exposed to water, flesh returns to the bones unleashing a malevolent being on the scientist's family and friends.",
        "duration": "PT2M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4002136857",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2ZlMDY3ZmMtZDQ1OS00OWQ5LWFmYWQtN2IxMDcxYzFiZWMxXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2ZlMDY3ZmMtZDQ1OS00OWQ5LWFmYWQtN2IxMDcxYzFiZWMxXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-25T20:47:14.458Z",
        "url": "https://www.imdb.com/video/vi4002136857/"
    },
    "url": "/title/tt0068424/"
}