{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Takeshi Itô",
            "url": "/name/nm0411757/"
        },
        {
            "@type": "Person",
            "name": "Saki Kurihara",
            "url": "/name/nm0999233/"
        },
        {
            "@type": "Person",
            "name": "Shirô Shimomoto",
            "url": "/name/nm0793731/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 100,
        "ratingValue": 6,
        "worstRating": 1
    },
    "alternateName": "The Dream of Garuda",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065587/"
        },
        {
            "@type": "Person",
            "name": "Shinji Aoyama",
            "url": "/name/nm0031888/"
        },
        {
            "@type": "Person",
            "name": "Kishû Izuchi",
            "url": "/name/nm0412809/"
        },
        {
            "@type": "Person",
            "name": "Takahisa Zeze",
            "url": "/name/nm0955270/"
        }
    ],
    "datePublished": "1994-04-22",
    "description": "A convicted rapist, Ikuo is released from prison and goes in pursuit of the woman he raped, Mieko. So obsessed is he with revenge he sees her in every woman he meets. After carrying out vicious attacks on a prostitute and a young ...",
    "director": [
        {
            "@type": "Person",
            "name": "Takahisa Zeze",
            "url": "/name/nm0955270/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE1NDg3MjIyOF5BMl5BanBnXkFtZTcwMjc5NTgzMQ@@._V1_.jpg",
    "keywords": "man hits a woman in the head,forced sex,softcore,simulated sex,sexploitation film",
    "name": "Kôkyû sôpu tekunikku 4: Monzetsu higi",
    "original_info": {
        "id": "The Dream of Garuda_1994",
        "name": "The Dream of Garuda",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "the red duchess"
        },
        "dateCreated": "2001-07-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109667/"
        },
        "name": "Fascinating, obscure, dream-puzzle.",
        "reviewBody": "I am told 'The Dream of Garuda' is an example of Japanese Pink Cinema. I confess that I am almost completely ignorant about this phenomenon: I know these films are highly formalised, a kind of 'illegitimate' form of underground cinema, and deal, almost pornographically, with erotic subject matter. So, in this comment, I will simply note a few elements that struck me, and hope an expert on the subject will take up the theme.\n\n Firstly, 'Garuda' has many features in common with pornography, of the soft variety at any rate - there are lengthy sex sequences, mostly in an apartment where a 'masseuse' bathes and later 'massages' a client with enviable lubricity and flexibility. Unlike pornography, however, the function or presentation of these scenes militate against onanistic pleasure. They are either comic (in one scene, a harried wife comes home to find her husband and his mistress in flagranto delicto, unfazedly deciding whether they should eat in or out), oppressively voyeuristic (the opening sequence, similar to the one I've just mentioned, where a man poking around an unlit apartment (the same one?) hears sounds of mounting excitement, taking a peek), or so distanced as to be mechanical, or, at best, ritualistic.\n\nThe various scenes at the masseuse's fit that description, and the anti-hero's need for them seems to be in some way spiritual, a desire to wash away his sins. In this scenario, the emphatic focus on the body (not just sexual; there are muggings and shootings too) seems intended to express something spiritual, just as Bresson's relentless filming of the material world evoked an immanent spirit.\n\nThere is a plot of sorts (a rapist comes out of prison and tries to find the woman he violated, seeing her in every one he meets), but because of the degraded-stock style, the distant framing with very few close-ups, and the obscuring lighting, which is either impenetrably dank or blindingly bright, it is very difficult to follow, to tell which characters are which, which person fits which name fits which narrative function. This isn't just Occidental racism on my part - the film is called 'The Dream of Garuda', and the narrative, set in vast, unnaturally empty, unnaturally quiet spaces (scrapyards, city outskirts, fields etc.) has the illogic of the dream, with much walking; repetition of incidents, motifs, places; random violence and chasing.\n\nIt's difficult to know what exactly the dream is - apparently Garuda is a mythical, birdlike Hindu god who is worshipped s the protector of Buddhism: if I'd known this beforehand the film would have made a lot more sense! The principle has repeated visions of flying birds against a pale blue sky, filmed on even more degraded stock, with their flapping sound like wooden clappers. The climax involves a doomed Icarean flight, and the relentless constriction of the film, with its remote Antonianian style, its suffocating interiors and bleak, labyrinthine exteriors, its small, vicious circle of characters, suggests some desire of flight or escape; perhaps from the film's recurrent formal motif, a tiny box of light surrounded by unfathomable darkness, even in a place as supposedly reassuring as home.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0109667/"
}