{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mickey Rooney",
            "url": "/name/nm0001682/"
        },
        {
            "@type": "Person",
            "name": "Coleen Gray",
            "url": "/name/nm0336531/"
        },
        {
            "@type": "Person",
            "name": "Hugh O'Brian",
            "url": "/name/nm0639385/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 92,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023723/"
        },
        {
            "@type": "Person",
            "name": "P.J. Wolfson",
            "url": "/name/nm0938439/"
        }
    ],
    "datePublished": "1955-10-13",
    "description": "A reverend goes West to a town where the Indians killed his priest-father and burned his church but the local townsfolk are keener about cash than religion.",
    "director": [
        {
            "@type": "Person",
            "name": "George Blair",
            "url": "/name/nm0086251/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Comedy",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmMzNGU4MjgtMDdkYy00ZDE2LThkNGYtMTVkZDY1ZjZmYjk3XkEyXkFqcGdeQXVyMjUwMDUwNA@@._V1_.jpg",
    "keywords": "reverend,church,saloon,livery stable,cave in",
    "name": "The Twinkle in God's Eye",
    "original_info": {
        "id": "The Swindle_1955",
        "name": "The Swindle",
        "year": "1955"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dougbrode"
        },
        "dateCreated": "2006-03-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0048754/"
        },
        "name": "Diminutive preacher (Mickey Rooney) tries to clean up a vice ridden cowtown.",
        "reviewBody": "For those of us who saw this decidedly minor film on its initial release during the fall of 1955, there were several shockers early on in the brief 73 minute film, which was used to round out the second half of a double bill in less than prestigious theatres. First, as Mickey Rooney (who is supposed to look considerably younger than he does) journeys to a small out of the way cowtown (he's an idealistic frontier preacher), even the youngest among us burst out in laughter when we see an airplane in the sky. What we were too naive to know at the time was that on low budget features like this, there was only enough time, budget, and film stock for one take - so if something like a plane happened to fly by in clear sight of the camera, it ended up in the finished film. Moments later, when Mickey did arrive, there supercool but also supersleazy owner of the saloon was played by none other than . . . the same man who incarnated wholesome teetoltaler Wyatt Earp on TV every Tuesday night, Hugh O'Brian. Eventually, we settled down to enjoy this mild oater in which Mickey wins over Hugh in good time and the sinful saloon gives way to a nice church. Undemanding in all respects, this film will be most enjoyed, if and when it shows up on some nostalgic movie channel or VHS/DVD, by those of us who loved it, all flaws aside, way back when.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0048754/"
}