{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leslie Banks",
            "url": "/name/nm0052203/"
        },
        {
            "@type": "Person",
            "name": "Edna Best",
            "url": "/name/nm0078923/"
        },
        {
            "@type": "Person",
            "name": "Peter Lorre",
            "url": "/name/nm0000048/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19857,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053065/"
        },
        {
            "@type": "Person",
            "name": "Charles Bennett",
            "url": "/name/nm0071657/"
        },
        {
            "@type": "Person",
            "name": "D.B. Wyndham-Lewis",
            "url": "/name/nm0943922/"
        },
        {
            "@type": "Person",
            "name": "Edwin Greenwood",
            "url": "/name/nm0339326/"
        }
    ],
    "datePublished": "1935-03-21",
    "description": "An ordinary British couple vacationing in Switzerland suddenly find themselves embroiled in a case of international intrigue when their daughter is kidnapped by spies plotting a political assassination.",
    "director": [
        {
            "@type": "Person",
            "name": "Alfred Hitchcock",
            "url": "/name/nm0000033/"
        }
    ],
    "duration": "PT1H15M",
    "genre": [
        "Crime",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWY2ODJhOTYtMTE1My00OTBiLTliZTgtNWIwZWIyMWNjODczXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "spy,dentist,kidnapping,police,church",
    "name": "The Man Who Knew Too Much",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mstomaso"
        },
        "dateCreated": "2007-08-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0025452/"
        },
        "name": "Interesting idea, not the best execution",
        "reviewBody": "Hitccock's first major release in the USA and Peter Lorre's first English-speaking role are two firsts scored by this 1934 thriller. This is, of course, also Hitchcock's first attempt to to make this film. His second, released in the mid-50s was more successful and better funded. This very British and relatively pithy film retains most of the character of Hitchcock's earlier efforts, but is lean and economical, with less camera play and simpler cinematography and pacing.\n\nThe acting is generally very good. Of the main cast, Nova Pilbeam, who plays the kidnapped daughter of Leslie Banks and Edna Best, is the only survivor today, at the age of 87. Most of the action centers on Banks,and he is fine, but (and I tend to think this is Hitchcock's doing) very emotionally compressed throughout the film. Banks' Bob Lawrence has a loving, flirty, wife (Best) and a delightful young daughter (Pilbeam). They are away on holiday in the alps when a new friend of their is shot dead while dancing with Best. As he dies, he passes along some information which creates the family's predicament. Lorre and his people kidnap young Pilbeam in exchange for Banks' silence, and he must then decide what to do. It seems that no matter what he does, his daughter is likely to die.\n\nIt is remarkable that Lorre did not even know what he was saying throughout most of this performance. The legendary actor, as usual, dominates all of his scenes and gives the film a creepy, psychotic feeling that would have been difficult to achieve without him.\n\nThe plot is a bit light on logic, but brisk, satisfyingly convoluted and entertaining. The script is OK, but often maintains too stiff an upper lip. A few opportunities for elaboration were missed - probably a limitation inherent in the original Wyndham Lewis story. I think it would have been interesting (and more credible) if the authorities had followed up on their knowledge that Banks knew something and trailed him throughout the film. This could have added an extra layer of potential suspense, mystery and obfuscation, since Best's heightened paranoia might have lead him to suspect all sorts of things about anybody keeping tabs on him.\n\nHitchcock definitely knew he had a potential gem here, and it is a credit to him that he revitalized the film with Jimmy Stewart in the 1950s - after establishing himself as a force to be reckoned with.\n\nWorth seeing for Hitchcock fans and those interested in early British film as well as fans of the 1950s version. O/w only very mildly recommended.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0025452/"
}