{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ricardo Bauleo",
            "url": "/name/nm0062041/"
        },
        {
            "@type": "Person",
            "name": "Gloria Prat",
            "url": "/name/nm0695311/"
        },
        {
            "@type": "Person",
            "name": "Aldo Barbero",
            "url": "/name/nm0053532/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 643,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "alternateName": "The Curious Dr. Humpp",
    "contentRating": "X",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037650/"
        },
        {
            "@type": "Person",
            "name": "Emilio Vieyra",
            "url": "/name/nm0896892/"
        }
    ],
    "datePublished": "1971-03-19",
    "description": "This movie is about a doctor who kidnaps people, couples who are having sex. He takes them to his mansion where they are being kept as prisoners. He injects his subjects with a substance to 'enhance' their sexual abilities. The cu...",
    "director": [
        {
            "@type": "Person",
            "name": "Emilio Vieyra",
            "url": "/name/nm0896892/"
        },
        {
            "@type": "Person",
            "name": "Jerald Intrator",
            "url": "/name/nm0409444/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWE4OWZkMjktZGU1MC00YTc0LTg5NzgtNTIwYmUzZGU2Y2NhXkEyXkFqcGdeQXVyMDM0NzcxMQ@@._V1_.jpg",
    "keywords": "sex scene,orgy,corpse,grindhouse film,sexploitation",
    "name": "La venganza del sexo",
    "original_info": {
        "id": "The Curious Dr. Humpp_1967",
        "name": "The Curious Dr. Humpp",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "johnnysugar"
        },
        "dateCreated": "2004-03-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062433/"
        },
        "name": "A curiously entertaining film, despite several flaws",
        "reviewBody": "Something Weird Video has made a name for itself by resurrecting forgotten exploitation films from the 50's, 60's, 70's and releasing them in restored prints for a modern audience. More than simply b-movies, these films are the most outrageous of the bunch, with one of the most interesting being \"The Curious Dr. Humpp,\" released in its native Argentina under its original title \"La Venganza Del Sexo\" (\"The Vengeance Of Sex\"). Part science-fiction, part adult film, part morality tale, this is certainly a curious film that is surprisingly entertaining despite several rather distracting flaws.\n\nIn the middle of the night, a hideous monster has been kidnapping people engaged in amorous activities, including a couple making out in a park, a lesbian couple, a quartet of hippie orgiasts, a nymphomaniac, a young man exiting a gay bar, and the beautiful stripper Rachel (Gloria Prat). Ambitious reporter George (Ricardo Bauleo) suspects something the authorities do not, and soon he is investigating the estate of the curious Dr. Humpp (Aldo Barbero) himself. Here he finds the doctor engaged in mad experiments and guided by a disembodied brain kept active in an electrically charged solution. Dr. Humpp believes the secret to eternal life lies in the chemicals produced by the body during sex, and he's been using it to keep himself alive. George is captured, and he must find a way out with Rachel before they become slaves to the doctor's whims.\n\nThe film's premise is absurd, yet somehow it manages to sustain itself well given the film's tone and feel. The visuals certainly help, but not in the way you'd expect. While the cast, particularly the leads, are all quite attractive, it's the way the picture is filmed and not the flesh that makes it exciting. Writer/director Emilio Vieyra films the entire picture in a very lovely chiaroscuro that heightens and deepens the black-and-white imagery to levels of art. The direction itself is above average, with a few scenes -- most notably the oddly poetic image of Dr. Humpp's monstrous servant serenading Rachel with a lute -- being quite memorable.\n\n Where the film falls apart has nothing to do with the director, the stars, or even the picture itself. When the film was picked up by an American distrbutor, over 17 minutes of sex-and-nudity footage was inserted into the film not only to pad the length, but to ostensibly heighten the adult-film quotient. These scenes add the lesbians, the hippie orgiasts, and the nymphomaniac to the cast, as well as some highly erotic sexual imagery added during a telepathic copulation between Prat and Bauleo (as part of one of the doctor's experiments). While the scenes fit well in that they aren't too far off from the original's look to be distracting, they often add unnecessary sex to a film that's more interested in other things, such as the ramifications of the doctor's work and the societal attitudes toward sex.\n\nIn addition to the scenes being extraneous, they often have the side effect of being unintentionally funny, which also distracts from the main thread of the film. The hippies, in particular, are quite humorous, especially with the exaggerated voice over work common of many erotic films of the time. The entire film has a serviceable, if not above average, English dub (the original was in Spanish) that works more often than it doesn't, at least in terms of language. To the American distributor's credit, the additional scenes are added quite well, and the dub is used quite skillfully to explain their presence.\n\nDespite these flaws, the film is visually entertaining, which is one of the best things one can say about b-movies of this caliber. Definitely one of the finer entries in Something Weird's catalog, alongside classics like \"Satan In High Heels\" and \"Mantis In Lace\", and definitely one for b-movie and vintage exploitation enthusiasts. Others may not find as much to enjoy, and for those, I suggest you get in the front row with the robots and start your mocking. So, something for everybody. 6 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A doctor kidnaps couples who are having sex. He takes them to his mansion where they are being kept as prisoners. The curious doctor then forces the abducted people to have sex.",
        "duration": "PT53S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2023539225",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjk4ZDI5OGUtNThmMi00Y2NiLTljYzYtNmFmYjdjNzcxMWQzXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjk4ZDI5OGUtNThmMi00Y2NiLTljYzYtNmFmYjdjNzcxMWQzXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-05-03T20:43:37.214Z",
        "url": "https://www.imdb.com/video/vi2023539225/"
    },
    "url": "/title/tt0062433/"
}