{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cicely Tyson",
            "url": "/name/nm0001807/"
        },
        {
            "@type": "Person",
            "name": "Eric Brown",
            "url": "/name/nm12316785/"
        },
        {
            "@type": "Person",
            "name": "Richard Dysart",
            "url": "/name/nm0246004/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2252,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060242/"
        },
        {
            "@type": "Person",
            "name": "Tracy Keenan Wynn",
            "url": "/name/nm0944003/"
        },
        {
            "@type": "Person",
            "name": "Ernest J. Gaines",
            "url": "/name/nm0301318/"
        }
    ],
    "datePublished": "1974-01-31",
    "description": "Story of a black woman in the South who was born into slavery in the 1850s and lives to become a part of the civil rights movement in the 1960s.",
    "director": [
        {
            "@type": "Person",
            "name": "John Korty",
            "url": "/name/nm0466793/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ1Mzg2NTgxMl5BMl5BanBnXkFtZTgwMjE5MTkwMzE@._V1_.jpg",
    "keywords": "civil rights,slavery,interview,journalist,deep south",
    "name": "The Autobiography of Miss Jane Pittman",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chemiche3"
        },
        "dateCreated": "2005-09-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071175/"
        },
        "name": "A tale of incredible Endurance and Resilience.",
        "reviewBody": "The Autobiography of Miss Jane Pittman is a powerful story. Miss Jane's story of the 110 years of her life is incredible. How anyone could survive the horrors that she endured from slavery to freedom to carpetbaggers to even seeing the Civil Rights movement is almost unfathomable. The sad thing is that much never really changes for blacks over the 110 years even though they are free. Discrimination, lynching and the Ku Klux Klan are part of daily life.\n\nMiss Jane never realizes her dream of reaching Ohio (the North). She loses everyone precious to her, her foster mother, Big Laura, her son, her husband, her godson. The only time she was really truly happy was during her brief marriage to Joe Pittman, a cowboy who's killed by an albino 'devil' horse. Yet, one wonders if her actions didn't cause Joe's death. She sharecrops and does what she needs to do to survive. Miss Jane remains a feisty admirable old woman to the end.\n\nThe scene at the water fountain where Miss Jane dares the rednecks to try and stop her from drinking from the 'White's Only' fountain is so powerful. The expressions on the actors' faces white and black are so real.\n\nCicely Tyson does an excellent job playing a 110 year old woman. In fact it's hard to believe that she is not an old woman. This film is far shorter than Roots and in my opinion should be required viewing for all American High School students.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0071175/"
}