{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jennifer Lopez",
            "url": "/name/nm0000182/"
        },
        {
            "@type": "Person",
            "name": "Matthew McConaughey",
            "url": "/name/nm0000190/"
        },
        {
            "@type": "Person",
            "name": "Bridgette Wilson-Sampras",
            "url": "/name/nm0933098/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 82977,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010043/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071425/"
        },
        {
            "@type": "Person",
            "name": "Pamela Falk",
            "url": "/name/nm0266184/"
        },
        {
            "@type": "Person",
            "name": "Michael Ellis",
            "url": "/name/nm0963400/"
        }
    ],
    "datePublished": "2001-01-26",
    "description": "Mary Fiore is San Francisco's most successful supplier of romance and glamor. She knows all the tricks. She knows all the rules. But then she breaks the most important rule of all: she falls in love with the groom.",
    "director": [
        {
            "@type": "Person",
            "name": "Adam Shankman",
            "url": "/name/nm0788202/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzBlYTE4NDAtN2RkNi00YWZmLWI3MWQtZDg2YTQ5OTI4YTVhL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "kraft macaroni and cheese,love triangle,man wears eyeglasses,ballroom dancing,wedding song",
    "name": "The Wedding Planner",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "chrisbrown6453"
        },
        "dateCreated": "2001-07-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0209475/"
        },
        "name": "Only of your girlfriend really wants to see it.",
        "reviewBody": "The Wedding Planner tells an identifiable story about falling in love and failing to recognize it. \n\nThe Wedding Planner stars Jennifer Lopez as Mary Fiore, a hardworking, beautiful, single woman of Italian descent, who has made a reputable career as a wedding planner. Fully dedicated to her work, Mary successfully coordinates all the details of her wealthy clients' weddings. She even acts as a kind of therapist, transmitting to the brides and grooms-to-be the optimism that relieves them of their \"second-thoughts\", and that allows them to fulfill their true dreams of marrying. Yet one day, a literal \"faux pas\" turns Mary's orderly life upside-down: she walks across a street and gets her shoe stuck in a manhole. Just then, a dumpster menacingly rolls down the steep San Francisco street, towards her. Noticing that the dumpster is rapidly gaining speed, a young man rushes to help Mary out of her dilemma. The two are instantly enveloped by the rush of the moment, falling victims to love at first sight. Soon, however, fate shows its cruel side, proving that the handsome Steve Edison (Mathew McConaughey) is tied to Fran Donelly (Bridgette Wilson-Sampras), one of Mary's most promising clients. In the meantime Salvatore (Alex Rocco), Mary's concerned father, tries to inspire her to consider her childhood inamorato Massimo (Justin Chambers), who just arrived from Italy. Torn between acting sensibly and fulfilling her long suppressed dreams of marrying, Mary must first determine which love is the one destined for her.\n\nThe Wedding Planner exploits the physical beauty of its star (Lopez) and emphasizes her character's style and professionalism at work, while defining her personality as that of a free-spirited, down-to-earth person who enjoys dancing and playing Bingo with her father and his elderly friends. Similarly, her costar (McConaughey) is depicted as a good-looking, sensitive man who enjoys his work as a pediatrician. However, the film's secondary characters, especially Mary's family, friends and coworkers, are sketchy and mostly inconsequential. Thus, The Wedding Planner creates a story that solely revolves around the coupling of its two main characters; a choice which makes The Wedding Planner's plot extremely predictable, although at times amusing. While the plot complications are limited to the unavailability of either of the two main characters (where Steve is unable to abandon his prior commitments and Mary is ready to take up new ones), The Wedding Planner is most enjoyable when it creates romantic settings for its lovesick characters.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2314993945",
        "name": "The Wedding Planner",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjI3MzRjNzEtMGZhOS00NGIxLWJlYTMtYzk0YjNkNTVhMTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjI3MzRjNzEtMGZhOS00NGIxLWJlYTMtYzk0YjNkNTVhMTcwXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:20:55Z",
        "url": "https://www.imdb.com/video/vi2314993945/"
    },
    "url": "/title/tt0209475/"
}