{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Danny Kwok-Kwan Chan",
            "url": "/name/nm2185928/"
        },
        {
            "@type": "Person",
            "name": "Michelle Lang",
            "url": "/name/nm1696211/"
        },
        {
            "@type": "Person",
            "name": "Michael Jai White",
            "url": "/name/nm0925220/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 206,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001524/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0160998/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0672867/"
        },
        {
            "@type": "Person",
            "name": "Zhang Jian Guang",
            "url": "/name/nm11403051/"
        },
        {
            "@type": "Person",
            "name": "Qian Lin Sen",
            "url": "/name/nm11403050/"
        },
        {
            "@type": "Person",
            "name": "Liu Yan Wu",
            "url": "/name/nm11403052/"
        }
    ],
    "datePublished": "2010-09-21",
    "description": "The story of the legendary martial arts icon Bruce Lee, following him from Hong Kong to America and back again, leading up to his tragic death at the age of 32.",
    "director": [
        {
            "@type": "Person",
            "name": "Li Wen Qi",
            "url": "/name/nm4120071/"
        }
    ],
    "duration": "PT3H3M",
    "genre": [
        "Action",
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODVhMmQ4ZjUtYTA3Mi00M2YwLWE2MGEtZmVjYTMyMmQ5NzEyXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "martial arts,martial arts action",
    "name": "The Legend of Bruce Lee",
    "original_info": {
        "id": "The Real Bruce Lee_1979",
        "name": "The Real Bruce Lee",
        "year": "1979"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SDaltonMead"
        },
        "dateCreated": "2021-01-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt11919866/"
        },
        "name": "Tremendous attempt at a full 'Dragon' biopic.",
        "reviewBody": "The source of this 3hr long escapade into portrayal of 'Bruce Lee's life, is a weekly screened 50 episode series, released October 2008 into mainland China., which creativity runs beyond the reality of his 32 years.\n\n2020 will by global influence, be most associated with its 'Pandemic', for many interested in the 80th year of 'Bruce' , inevitably this DvD movie will have the chance to receive wider viewing.\n\nMuch, could be said regards to the impossibility of making a oriental depiction, upon such a 'Westernised', influential person of Chinese lineage. Here we see how the 2008, production wished to portray 'Bruce Lee' upon reflection; back heroically towards themselves.\n\nLimited by having only 1 actor in leading part, 'Danny Chan', does root his performance of character and manner, very well. Equal to the focus achieved by 'Jason Scott Lee', although it makes the earliest years depicted strange from historical context., where the wider cast family roles are merely a fleeting expression of post-WW2 moderateness, rather than the international aspiring Hong Kong, family of virtue that wanted an obedient son.\n\nPraise must be given to the effort of the editing team, achieving a commendable meld of such length of footage down into just over 3 hours. Typically, translation from Mandarin, into other languages does again have issues, but the subtitling was at least above average, ensuring much was comprehendable, even if not entirely factual.\n\nAs a singular movie, the storyline travels in many divergent ways beyond into more 'value orientated' scene's , traditional family structure, and stronger expressed way of traditional 'Martial Teaching', that does both conflict with known history and sadly repels understanding by European/American customers of our generation.\n\nHaving, IP Man, with long venerable wizard like beard, assume Taoist monk personna was nearly a complete parallel of 'Inception', alternative reality of a WW2 era survivor. It was a tragic re-write, that modern Chinese audience, could have been spared.\n\nThe portrayal, by 'Michelle Lang' , of 'Linda Caldwell' (wife/mother), seems far to slight in balance to being both a pupil of 'Bruce Lee', a romance, or as most supportive person to 'Brandon & Shannon Lee', during formative years to gain merit beyond actual presence. Chances are drastic edits have much to explain here, from the presumed last 10 episodes ( 450min ) of the series.\n\nDuring, the most recognised phase, transition between urban Seattle, immigrant student into celebrity teaching guide and eventual film star, here besides the string of solid Martial Artists, giving credible life to all action scenes, most show little understanding of the specific people.\n\nRelegating them to combative stereotypes, that barely shows the influence each encounter had upon 'Bruce Lee'. The roles of 'Daniel Inosanto' & 'Ed Parker', being given ridiculously small sections., bridged by a soundtrack of whimsy tunes musically.\n\nThe final result, (adjusting favourably for every slender mC2F's in cast), is a puzzle. Despite the great level of achived message, and strong fighting skills shown, it's a chess game of entertainment that eager students of the genre/phenomena will be better served by reading., Kicking and hitting the books.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt11919866/"
}