{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlotte Gainsbourg",
            "url": "/name/nm0001250/"
        },
        {
            "@type": "Person",
            "name": "Andrew Robertson",
            "url": "/name/nm0731720/"
        },
        {
            "@type": "Person",
            "name": "Alice Coulthard",
            "url": "/name/nm0183553/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5015,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002257/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103543/"
        },
        {
            "@type": "Person",
            "name": "Andrew Birkin",
            "url": "/name/nm0001949/"
        },
        {
            "@type": "Person",
            "name": "Ian McEwan",
            "url": "/name/nm0568605/"
        }
    ],
    "datePublished": "1994-02-11",
    "description": "Four children live with their terminally ill mother. After she dies, they try to hold things together. In their isolated house, they begin to deteriorate mentally, whilst they hide their mom's decomposing corpse in a makeshift con...",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Birkin",
            "url": "/name/nm0001949/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmI2NTdlNzEtYWZkOC00NzhhLTg5N2MtZTE5ZDE0NTI5MDFkXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "brother sister incest,brother sister sex,male full frontal nudity,sex with sister,forbidden sex",
    "name": "The Cement Garden",
    "original_info": {
        "id": "The Cement Garden_1992",
        "name": "The Cement Garden",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "atlantis2006"
        },
        "dateCreated": "2011-05-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106535/"
        },
        "name": "The irreplaceable sibling - incestuous love",
        "reviewBody": "The Cement Garden Andrew Birkin's film has it all: intense characters, controversial situations and unusual concepts, which shouldn't come as a surprise if we keep in mind that it's based upon a novel by Ian McEwan. The protagonists are Jack, a 16 year-old boy and Julie, his sister, barely a couple of years older; then come the youngest sister and the youngest brother. The four of them live with their parents, in a somehow bleak house, completely isolated from other neighborhoods.\n\nJack spends most of his time avoiding his home duties, such as cleaning up his room, and instead devotes most of his hours in a secluded spot in which he hides a worn out adult magazine and toilet paper. His mother actually confronts him and tells him, following the pseudo-scientific approach from Victorian age (which Foucault so aptly analyzed in his History of sexuality), that his moodiness and messiness is a direct result of self-abuse, and that should he continue practicing that he would end up extenuating his body.\n\nOne afternoon, the father is pouring cement into the garden and asks Jack for help, but while the father keeps working on the garden, the young boy is in the bathroom masturbating enthusiastically, with precise visual transitions, the director manages to apprise the moment of Jack's orgasm with the last breadth of the father, as he succumbs to a heart attack. Later on, Jack will tell to his sister \"Besides... not my fault he died\", answering a question that no sibling had dared to ask up to that moment.\n\nThe absence of the father marks the downfall of the family. The mother is unable to step out of her room, depressed as she is, and order and discipline soon turns into chaos and disarray. It's in this context that the constant taunting between Jack and Julie turns into something else. What at first begins as innocent flirtations soon brings up more tantalizing repartees. In one occasion, while Jack is on top of Julie, tickling her, she starts grabbing him in a very distinct manner and comes to an orgasm.\n\nAs the mother falls deeper into depression and illness, the fear of being discovered is diluted and thus the incestuous fantasy acquires a firm grasp on reality. As Lacan analyzed in his Antigone seminar, the death drive moves the Greek heroine towards the desire invested exclusively around the body of her deceased brother. In \"The Cement Garden\", the protagonists start cajoling themselves around this death drive that disappears and leaves only a very real desire and a very real erotic drive. \"My brother is what he is\" would say Antigone, and in a similar way Jack will tell her sister that if people love him then they will take him as he is.\n\nIn Ancient Greece the term \"autadelphos\" (autos: \"same\"; adelphos: \"sisterly,\" related to delphus: \"womb\") would mean something irreplaceable. As Antigone says in Sophocles' play, if she would lose her children she could always get pregnant again, if she would lose her husband she could always find another man, but if she loses her brother, who could possibly replace him? They are, after all, creatures that have shared the same womb and nothing can compare to that. In a similar fashion, the passion between Jack and Julie defies all social norms and regulations. They are irreplaceable for each other, and as the house starts falling apart, they start getting closer and closer.\n\nThe absence of the father also means the absence of the nom de pere, the ultimate authority that inscribes the subject into society, that commands his offspring to occupy the male or female position in the symbolic order. Without this authority, male and female positions are interchangeable whether ideologically or practically, as it's made evident by the authority invested upon Julie, who has the full responsibility of being in charge of the house (a role that would be traditionally ascribed to a male), or by the youngest brother's obsession in wearing wigs and skirts, not only dressing up as a girl but also sleeping on the bed with another boy his age, pretending to be Julie and Jack. When Jack intends to stop this peculiar practices, Julie has but one answer for him: \"You think that being a girl is degrading but secretly you'd love to know what is it like, wouldn't you?\", and in a very tantalizing way places a most effeminate ribbon on his brother's neck.\n\nCrossing all boundaries, subverting the heterosexual normative and assuming incest as something that feels natural and real, Birkin's film announces from the very beginning a dreadful end; perhaps it would be interesting to compare the novel's ending with the one in the film, because after all, once all is said and done, as Lacan would phrase it \"is important to note that one only has to make a conceptual shift and move the night spent with the lady from the category of pleasure to that of jouissance, given that jouissance implies precisely the acceptance of death — and there's no need of sublimation — for the example to be ruined\"."
    },
    "url": "/title/tt0106535/"
}