{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hugh Quarshie",
            "url": "/name/nm0702934/"
        },
        {
            "@type": "Person",
            "name": "Tomas Arana",
            "url": "/name/nm0032962/"
        },
        {
            "@type": "Person",
            "name": "Feodor Chaliapin Jr.",
            "url": "/name/nm0149923/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8203,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "alternateName": "The Church",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071178/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037028/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013271/"
        },
        {
            "@type": "Person",
            "name": "Dario Argento",
            "url": "/name/nm0000783/"
        },
        {
            "@type": "Person",
            "name": "Franco Ferrini",
            "url": "/name/nm0274853/"
        },
        {
            "@type": "Person",
            "name": "Michele Soavi",
            "url": "/name/nm0811714/"
        }
    ],
    "datePublished": "1989-03-10",
    "description": "An old Gothic cathedral built over a mass grave develops strange powers that trap a number of people inside with ghosts from a 12th Century massacre seeking to resurrect an ancient demon from the bowels of the Earth.",
    "director": [
        {
            "@type": "Person",
            "name": "Michele Soavi",
            "url": "/name/nm0811714/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWE3NGJmZmYtZTcyOS00NjI1LThjYjktZWZkNTY1ZGRmMjNmXkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_.jpg",
    "keywords": "church,demon,knights templar,mounted knight,wicker mask",
    "name": "La chiesa",
    "original_info": {
        "id": "The Church_1989",
        "name": "The Church",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ODDBear"
        },
        "dateCreated": "2005-06-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094860/"
        },
        "name": "Needs a script",
        "reviewBody": "I am such a huge fan of Michele Soavi. I absolutely adore Stagefright, the best slasher ever. Dellamorte Dellamore is quite simply a Gothic masterpiece, a near perfect zombie film with a philosophical overtone to it. I also thought The Sect was a quite effective nerve-jolter filled with incredible surreal images and solid scares. So I was disappointed after viewing The Church, I had such high hopes.\n\nIt starts of well enough. Medieval knights massacre a village they fear is possessed by demonic spirits and the priest orders that a church should be built on their buriel ground. Fastforward to the present, something weird is going on in that church; some evil seems to be lurking about and possessing people. A showdown between good and evil is unavoidable.\n\nThe film has style to burn. Michele Soavi is a master at creating surreal imagery and his camera knows no limits. This is the film's high point along with some terrific set pieces, one in particular involving a subway and a teenage girl. Another thing I must mention in the film's favour; the music score. It's always wonderful to hear Goblin and Keith Emerson also provides some good music. But good music is simply something you can always count on in these Italian productions.\n\nThe thing that doesn't work here, and it's a big thing, is the plot. It's practically nonexistent. The film doesn't make any sense, jumps from one setpiece to another (though some are brilliantly executed), with only so little to tie them together. It's got wooden characters, none you really care about (Tomas Arana in particular). The final showdown in the Church, although well done in terms of effects, is a real letdown, nothing much happens and in the end, well...I felt cheated in a big way.\n\nAs it was originally conceived of as the second sequel in the Demons saga, I expected this to be full of violence. It's not, apart from the rather gory opening. I guess Soavi wanted to do a more serious film, with some philosophical input or something. He should have had a better script to work with.\n\nAlthough it's disappointing, it's certainly not without interest.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0094860/"
}