{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Will Smith",
            "url": "/name/nm0000226/"
        },
        {
            "@type": "Person",
            "name": "James Avery",
            "url": "/name/nm0043041/"
        },
        {
            "@type": "Person",
            "name": "Alfonso Ribeiro",
            "url": "/name/nm0005355/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 138230,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065874/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0072193/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0035734/"
        },
        {
            "@type": "Person",
            "name": "Andy Borowitz",
            "url": "/name/nm0097273/"
        },
        {
            "@type": "Person",
            "name": "Susan Borowitz",
            "url": "/name/nm0097275/"
        }
    ],
    "datePublished": "1990-09-10",
    "description": "A streetwise, poor young man from Philadelphia is sent by his mother to live with his aunt, uncle and cousins in their Bel-Air mansion.",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGUxOWQ4MzAtMmJjYS00M2U5LWEwZTAtYTc1YmZhNjg2NDRlXkEyXkFqcGdeQXVyMTYzMDM0NTU@._V1_.jpg",
    "keywords": "sitcom,servant,famous opening theme,englishman,bel air california",
    "name": "The Fresh Prince of Bel-Air",
    "original_info": {
        "id": "The Fresh Prince of Bel Air: Season 2_1991",
        "name": "The Fresh Prince of Bel Air: Season 2",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dee.reid"
        },
        "dateCreated": "2005-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098800/"
        },
        "name": "Still fresh after all these years",
        "reviewBody": "I like to think of \"The Fresh Prince of Bel-Air\" as a memorable rap song from a time when it wasn't afraid to be creative or witty. Think of a song by Public Enemy, De La Soul, A Tribe Called Quest, or hell, even The Fresh Prince's duo with DJ Jazzy Jeff (who guest stars frequently as Jazz), as the two were known back in rap's Golden Age as DJ Jazzy Jeff & the Fresh Prince.\n\nOf course, this show flourished during a time when rap was still good, and I can't help but make comparisons to the hip-hop community. There is no question that Will Smith is a born entertainer, and he got his break in stardom outside of hip-hop with \"The Fresh Prince of Bel-Air.\" In it, Will Smith pretty much plays Will Smith (I bet creators Andy and Susan Borowitz had a lot of difficulty thinking up that name), a Philadelphia ghetto youth who gets shipped out by his mother to the posh excess of Bel-Air to live with relatives - The Banks.\n\nOnce out there, he finds rivalry with cousins - the preppy Carlton and airheaded would-be blonde Hilary Banks (Alfonso Ribiero and Karyn Parsons), young cousin Ashley (Tatyana M. Ali) emulates Will's hip-hop attitude, and Aunt Vivian (alternately played by actresses Janet Hubert-Whitten and Daphne Maxwell Reid) keeps husband and successful lawyer Uncle Phil's (James Avery) head cool when Will gets into trouble. To keep everything tidy and in order, their loyal, sarcastic British butler Geoffrey (Joseph Marcell) is there too.\n\nIt's still fresh after all these years. It never fails to stir up careful, thoughtful, moving, and intelligent laughs from the viewer and I'm surprised I avoided it for so long. (Why do I do this to myself all the time?)\n\nThe acting is cool and fresh by all, especially from Smith, and the ladies of the house, Karyn and Tatyana, are both pretty cute to look at too."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "30 years later, we're bringing the Banks family back together. Join Will and Tatyana Ali, Karyn Parsons, Joseph Marcell, Daphne Maxwell Reid, Alfonso Ribeiro and DJ Jazzy Jeff, for a funny and heartfelt night full of music and dancing in honor of the show that ran for six seasons and 148 episodes.",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4005740825",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjIyMmU5MDktZWM0Ni00NWNhLTk0OWMtNjA1ODkxYTNhNzllXkEyXkFqcGdeQWFybm8@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjIyMmU5MDktZWM0Ni00NWNhLTk0OWMtNjA1ODkxYTNhNzllXkEyXkFqcGdeQWFybm8@._V1_.jpg",
        "uploadDate": "2020-11-13T16:33:50.341Z",
        "url": "https://www.imdb.com/video/vi4005740825/"
    },
    "url": "/title/tt0098800/"
}