{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Veronika Borisenko",
            "url": "/name/nm8301004/"
        },
        {
            "@type": "Person",
            "name": "Leonid Ktitorov",
            "url": "/name/nm9849358/"
        },
        {
            "@type": "Person",
            "name": "Irina Maslennikova",
            "url": "/name/nm1118949/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 321,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "The Snow Maiden",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0840099/"
        },
        {
            "@type": "Person",
            "name": "Ivan Ivanov-Vano",
            "url": "/name/nm0412108/"
        },
        {
            "@type": "Person",
            "name": "Oleg Leonidov",
            "url": "/name/nm0503070/"
        },
        {
            "@type": "Person",
            "name": "Aleksandr Ostrovskiy",
            "url": "/name/nm0652534/"
        }
    ],
    "description": "The tale about a girl with a cold heart who is dying in agony because of joy and love.",
    "director": [
        {
            "@type": "Person",
            "name": "Aleksandra Snezhko-Blotskaya",
            "url": "/name/nm0811102/"
        },
        {
            "@type": "Person",
            "name": "Ivan Ivanov-Vano",
            "url": "/name/nm0412108/"
        }
    ],
    "duration": "PT1H7M",
    "genre": [
        "Animation",
        "Fantasy",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTY5ZjdkNzYtZGRhMi00ZjBiLWFiOTMtMjRlNWQ5Y2FkYzNiXkEyXkFqcGdeQXVyNTQ2OTUzMzc@._V1_.jpg",
    "keywords": "snow maiden,snegurochka,based on folklore,female protagonist,traditional animation",
    "name": "Snegurochka",
    "original_info": {
        "id": "The Snow Maiden_1968",
        "name": "The Snow Maiden",
        "year": "1968"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ewevrij"
        },
        "dateCreated": "2012-07-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0045160/"
        },
        "name": "The Snow-maiden, daughter of king winter and the spring fairy, is aloud to live in a human village. Her heart can't inflame in love. She would melt if it did.",
        "reviewBody": "A animated version of the Rimski Korsakov opera. For the opera lover is especially the palace in the animation interesting it based on the original stage design. The voices & music is one of the most delicate versions I know. In the early fifties in which it was recorded the understanding of the opera was much more suiting the romantic/esoteric character of the opera, then todays practice.\n\nAs an opera it isn't much played.\n\nFor the ones not familiar to opera it's a nice introduction. Following the fairytale of the snow-maiden, the story it's more interesting and richer of content then the average opera. Rimsky Korsav's and his libretto writer made a few changes to the fairytale that brought the esoteric content of the opera much more to the surface.\n\nThe animation, in a beautiful early 50's Russian fairytale style, in the one hand keeps the static style of the opera intact, while on the other hand much more focusing on the story the opera is bases on, and telling it as a fairytale should be told, while it's dynamic is still the dynamic of the opera. It's not degraded into a Disney comedy animation, killing the deeper layers of the story.\n\nThat at the time it was made the ideology of social realism was (often)leading in animation, so a lot of \"rotoscoping\" is used, helped to keep it a very dignified adaptation of the opera. While at the same time keeping the dialog spoken, and cutting some elements of the first act make it much more accessible. Although I think the role of Kupava and the role of Lel and perhaps the parents get a bit cut too much. I understand it's a director's choice where to cut to keep the animation around 1 hour long, but I would have left more of the 1st act intact.\n\nThe version of the animation in circulation, by the way, has a very abrupt cut in Lel's first aria in the first act. a part of the aria is missing, in a way that makes you think there is a piece of film missing there too.\n\nAll in all there is a good balance between respect for the basic material and adapting it to an animation idiom.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0045160/"
}