{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Billy Corgan",
            "url": "/name/nm0004842/"
        },
        {
            "@type": "Person",
            "name": "James Iha",
            "url": "/name/nm0407286/"
        },
        {
            "@type": "Person",
            "name": "D'arcy Wretzky",
            "url": "/name/nm0942155/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 549,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0152550/"
        }
    ],
    "datePublished": "2001-11-20",
    "description": "Released alongside The Smashing Pumpkins greatest hits CD \"Rotten Apples\", this video collection comes with all of the Pumpkins music videos (excluding \"The End is the Beginning is the End\"). It also comes with a live performance ...",
    "director": [
        {
            "@type": "Person",
            "name": "Samuel Bayer",
            "url": "/name/nm1207904/"
        },
        {
            "@type": "Person",
            "name": "Angela Conway",
            "url": "/name/nm1200884/"
        },
        {
            "@type": "Person",
            "name": "Billy Corgan",
            "url": "/name/nm0004842/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY5NzQ2MTE0N15BMl5BanBnXkFtZTcwNzU2MjUxMQ@@._V1_.jpg",
    "keywords": "year in title,20th century,1990s,2000s,music video collection",
    "name": "The Smashing Pumpkins: 1991-2000 Greatest Hits Video Collection",
    "original_info": {
        "id": "The Apostles Collection_2000",
        "name": "The Apostles Collection",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shadowolf2k"
        },
        "dateCreated": "2003-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0307475/"
        },
        "name": "An inspired and inspirational band with inspired and inspirational videos",
        "reviewBody": "This DVD is compiled with every music video the Smashing Pumpkins ever did, except the one from the Batman & Robin soundtrack, \"The Beginning is the End is the Beginning\". The Pumpkins is one of greatest bands of all time, with their unique inspiration and daring approaches to music. In general, their songs and art and photographs in their album booklets have always had a theme of the complicated happy and sad concepts of nostalgia, which I find very unique, being inspired by personal past, values, and so on. The lyrics have always been deeply poetic, and Corgan's voice is unique and distinctly recognizable, though you either love it or hate it. Iha's guitar has always been new sounds to my ears, and has always connected very well with D'arcy and Auf Der Maur's great bass playing. And Chamberlin is a god of drums, with his interesting choice of paces with a lot of the songs (especially in \"Tonight, Tonight\"). The videos have had daring approaches that don't leave the themes of their own albums. They've always tried to be different from the usual MTV videos and did a good job with that, like \"Ava Adore\" and \"Tonight, Tonight\". What's interesting is that they don't leave their past videos alone either (\"1979\" seems to have a sequel, \"Perfect\"). Pumpkin fans will love this DVD. However, some of the images in their videos are incredibly disturbing (\"Try, Try, Try\") though it is a very powerful video with a message to tell. And it includes the short film \"Try\" as well.\n\nAnyway, if you like the Pumpkins to any degree, I highly recommend this DVD. You'd have to be biased against them to not like at least one video, in which many have unique artistic approaches and inspiration that follows well with their incredible music."
    },
    "url": "/title/tt0307475/"
}