{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stephanie Fondue",
            "url": "/name/nm0284519/"
        },
        {
            "@type": "Person",
            "name": "Denise Dillaway",
            "url": "/name/nm0226856/"
        },
        {
            "@type": "Person",
            "name": "Jovita Bush",
            "url": "/name/nm0124161/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1334,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Paul Glickler",
            "url": "/name/nm0322787/"
        },
        {
            "@type": "Person",
            "name": "Richard Lerner",
            "url": "/name/nm0503641/"
        },
        {
            "@type": "Person",
            "name": "Tad Richards",
            "url": "/name/nm0724354/"
        }
    ],
    "description": "A group of cheerleaders from the local high school decide to show their school spirit for their football team by sleeping with the opponents the night before the game so that they can be so worn out the opposition won't be able to...",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Glickler",
            "url": "/name/nm0322787/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Comedy",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmRjMDYxYmEtZmI3Yy00ZTljLWJiYTMtNDRjODgxNjhhNzk4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "cheerleading,female nudity,female full frontal nudity,high school,cheerleader",
    "name": "The Cheerleaders",
    "original_info": {
        "id": "The Cheerleaders Collection: The Cheerleaders_1973",
        "name": "The Cheerleaders Collection: The Cheerleaders",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "glgioia"
        },
        "dateCreated": "2003-07-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068364/"
        },
        "name": "More of These!!",
        "reviewBody": "Anybody else out there completely sick and tired of the mindless, that's not even a strong enough word, how about aggravating, sex flicks that Showtime and Cinemax pump out nowadays. Using the same 4 actresses, and the same un-interesting storyline? And I've actually come to hate the 3 effeminate actors who are in every one. It's like a non-ending, awful awful, soap opera with nudity. Soft-core cinema, has hit an all-time low. The production values are great, but the storylines and sex conjure one word - Boredom. Somehow, the modern filmmakers have managed to take the sexual appeal out of women with perfect bodies. I mean I never thought I would see the day, when a skin flick on TV late night would force an involuntary roll of the eyes and send me straight for TV Land reruns, but its really come to that. What's missing, one of the things I can nail down at least is Raunch. Yes, soft core is now politically correct if you can believe that. Almost like its women who are making these to draw in both male and female audiences, and folks it just don't work. Kudos to Showtime for digging up movies like this one. It's totally nasty and wrong, but without going hardcore, that's what's needed to push the buttons. I know there are a zillion more, because I remember them when I was a kid. I would hope they start getting some airtime. Retire the silicon sleep inducers already please, and let the producers go back to making man-hating dramas on Lifetime."
    },
    "url": "/title/tt0068364/"
}