{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Feinstein",
            "url": "/name/nm0270750/"
        },
        {
            "@type": "Person",
            "name": "Robert Alda",
            "url": "/name/nm0017376/"
        },
        {
            "@type": "Person",
            "name": "June Allyson",
            "url": "/name/nm0000742/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 69,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066897/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        },
        {
            "@type": "Person",
            "name": "Joe Gilford",
            "url": "/name/nm0318528/"
        },
        {
            "@type": "Person",
            "name": "Mary Cleere Haran",
            "url": "/name/nm0361807/"
        },
        {
            "@type": "Person",
            "name": "Scott McIsaac",
            "url": "/name/nm0570845/"
        }
    ],
    "datePublished": "2003-03-11",
    "description": "Documentary assembling film clips of musical numbers from songwriters considered significant contributors to pop culture before the advent of rock and roll.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew J. Kuehn",
            "url": "/name/nm0473870/"
        }
    ],
    "duration": "PT2H54M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI0NDA1NzY3OF5BMl5BanBnXkFtZTcwMDIwOTAwMQ@@._V1_.jpg",
    "name": "The Great American Songbook",
    "original_info": {
        "id": "The Great American Songbook_2003",
        "name": "The Great American Songbook",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "standardmetal"
        },
        "dateCreated": "2004-12-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0352382/"
        },
        "name": "One of the best on the subject.",
        "reviewBody": "While I might argue with some of the choices made in representing the musical numbers such as not giving the names of all the films the clips were from, as a whole I found this a fascinating documentary which gave an excellent idea of musical influences over the years.\n\nIt also helps to have a fine performer and expert on this vast subject in Michael Feinstein. While I wouldn't put him up there with the greatest entertainers, he certainly is impressive in what he can do with his fine musical gifts. And as an archivist for Ira Gershwin, he is in a unique position to talk about it. And, yes, I do understand that he and his associate Andrew J. Kuehn were not able to get all the permissions they would have liked, (The song \"Singin' in the Rain\" was represented but the film was conspicuous by its absence.) they have done well with what they had to work with.\n\nI was struck by how often Judy Garland appeared in this documentary and I was glad that Betty Hutton finally got some long overdue appreciation for \"Annie Get Your Gun\". Despite the comments on this DVD, that film is now actually available on DVD but that probably happened after this one was released.\n\nI was also amused that Michael spoke of the inaccuracies of musical biopics. He said they were all more or less fictionalized but the ones on Rodgers and Hart and Cole Porter were singled out. The first, \"Words and Music\" ignored Larry's homosexuality and alcoholism and the second, \"Night and Day\", Cole's homosexuality, later only partly rectified by Kevin Kline's film, \"De-Lovely\" (which I have now seen and reviewed.). But these topics could not have been broached at the time these films were made.\n\n8 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "timeRequired": "PT2H54M",
    "url": "/title/tt0352382/"
}