{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leonardo DiCaprio",
            "url": "/name/nm0000138/"
        },
        {
            "@type": "Person",
            "name": "Cate Blanchett",
            "url": "/name/nm0000949/"
        },
        {
            "@type": "Person",
            "name": "Kate Beckinsale",
            "url": "/name/nm0000295/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 368804,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035930/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088354/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0109128/"
        },
        {
            "@type": "Person",
            "name": "John Logan",
            "url": "/name/nm0517589/"
        }
    ],
    "datePublished": "2004-12-25",
    "description": "A biopic depicting the early years of legendary director and aviator Howard Hughes' career from the late 1920s to the mid 1940s.",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Scorsese",
            "url": "/name/nm0000217/"
        }
    ],
    "duration": "PT2H50M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTYzMjA2M2EtYmY1OC00ZWMxLThlY2YtZGI3MTQzOWM4YjE3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "obsessive compulsive disorder,test flight,film producer,howard hughes character,california",
    "name": "The Aviator",
    "original_info": {
        "id": "The Aviator_2004",
        "name": "The Aviator",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AlsExGal"
        },
        "dateCreated": "2015-08-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0338751/"
        },
        "name": "Beautifully photographed yet sometimes hard to watch",
        "reviewBody": "I was quite impressed by this portrait of the legendary millionaire eccentric during his Hollywood glamor years, though not shirking the beginning of the darker psychological disintegration that would forever engulf him.. Scorsese directed a dramatic, evocative, beautifully photographed portrait of an eccentric genius, slowly succumbing to his mental demons. As far as his obsessive compulsiveness is concerned, though, I must plead guilt to identifying with him in one scene in the film - that in which he refuses to touch a public washroom door knob. I've been in that position myself any of a number of times.\n\nThe opening scene, showing Hughes with his mother, is short but vital in insinuating that Hughes developed his OCD from his mother - either by listening to and remembering her fanatical anti-germ ravings about how he was never safe, or through strict genetics. It was probably a combination of both. Since his mother died young, she did not live to have the disease take over her life as it did with Howard.\n\nThe first part of the film is the lightest and the most fun, with Hughes spending three years making \"Hell's Angels\". He's desperate to succeed here because the last thing he wants is to wind up back in Texas making drill bits, the source of the family fortune. This is where anachronism number one appears - Hughes shows his right hand man, Noah Dietrich, the famous part of \"The Jazz Singer\" where Al Jolson is ad libbing one of the few talking segments of that film, claiming that sound is what audiences want and using that as an excuse to redo Hell's Angels AGAIN, this time with sound. The Jazz Singer would have been considered a museum piece by the time Hughes finished the silent version of Hell's Angels in 1929. \n\nI thought that Leonardo Di Caprio and Cate Blanchett were both quite splendid in their roles, even thinking that Leo started looking a bit like the real Hughes as the film progressed. Blanchett may not have looked like Kate Hepburn but she certainly captured the actress's manner and vocal mannerisms to an impressive degree, without ever seeming like a caricature. When the new-money unpolitical Hughes meets Hepburn's family, all old-money Democrats living a commune style existence with even Hepburn's ex-husband living on the family compound, Hughes is confounded by their lifestyle. Frances Conroy of \"Six Feet Under\" does a great job here in a cameo appearance as Hepburn's mother. This section of the film ends with Hepburn leaving Hughes for Spencer Tracy, and is way off base from actual events. Hepburn had been apart from Hughes for several years when she and Tracy actually met.\n\nSince the film told its story in a, more or less, chronological order of events, the film really does seem to be full of anachronisms, as I mentioned earlier. For example, we see Hughes and Hepburn in a nightclub with Errol Flynn at their table, the millionaire talking about shooting a western, The Outlaw, a film that would begin production in 1941. Yet the next scene had Hughes in what was dated across the screen as 1935, clearly long before any thoughts of The Outlaw or any hell raising with Flynn, the latter not becoming a star until the very end of that year.\n\nThe highlight of the film for me was the spectacular plane crash during a test flight by Hughes, with the plane wheels scratching along a roof top and one of its wings slicing through the wall of a home. This was viewed from the inside of the home. Great special effects, direction, photography and editing of this knockout sequence. I highly recommend this portrait of a man wrestling with madness who also wanted to be a creator of films and pioneer of aviation, whether he made money or not. If Hughes had just wanted money he would have just stuck with the drill bit business.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Miramax",
        "duration": "PT1M55S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3947888665",
        "name": "The Aviator",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzRjZjYwMWItMzU2NS00MmM3LTk5ZDItYmZlYmI0OGU1NDg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzRjZjYwMWItMzU2NS00MmM3LTk5ZDItYmZlYmI0OGU1NDg3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-30T03:48:39Z",
        "url": "https://www.imdb.com/video/vi3947888665/"
    },
    "url": "/title/tt0338751/"
}