{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "William Eythe",
            "url": "/name/nm0264278/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Nolan",
            "url": "/name/nm0634313/"
        },
        {
            "@type": "Person",
            "name": "Signe Hasso",
            "url": "/name/nm0368516/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3111,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Barré Lyndon",
            "url": "/name/nm0528530/"
        },
        {
            "@type": "Person",
            "name": "Charles G. Booth",
            "url": "/name/nm0095660/"
        },
        {
            "@type": "Person",
            "name": "John Monks Jr.",
            "url": "/name/nm0598267/"
        }
    ],
    "datePublished": "1945-10-16",
    "description": "Bill Dietrich becomes a double agent for the F.B.I. in a Nazi spy ring.",
    "director": [
        {
            "@type": "Person",
            "name": "Henry Hathaway",
            "url": "/name/nm0368871/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTRlNDI2MjUtNzdmOS00NTViLTlhM2MtMmNjZmUxZmEzZmU2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg",
    "keywords": "fbi federal bureau of investigation,male police officer,police officer,chesterfield cigarette,cigarette",
    "name": "The House on 92nd Street",
    "original_info": {
        "id": "The House on 92nd Street_1945",
        "name": "The House on 92nd Street",
        "year": "1945"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "secondtake"
        },
        "dateCreated": "2010-03-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0037795/"
        },
        "name": "Some gripping scenes, some documentary footage, and an up and down patchwork",
        "reviewBody": "The House on 92nd Street (1945)\n\nHenry Hathaway has directed some great film noirs (Kiss of Death is indisputably great), but he also didn't mind the dull assignment here and there, as in the competent Call Northside 777 and this one, both revealing American crime detection in action. Yes, this is actually well made, but it has a documentary feel that leaves it in a straitjacket as good crime drama. It's strong stuff, and filled with significance, real Nazi activities on U.S. soil leading to the a-bomb. But you'll see, as soon as the familiar narrator starts to explain the events, that it's a formulaic approach.\n\nTo some extent, you can't really watch this without noticing it feels, from the next century (2010 as I write) like propaganda. Not that it isn't honest, it just is filled with uncritical pride. The FBI in particular comes across as flawless and brilliant, and I'm sure it often was, but not quite without complications, nuances, and personal quirks that make the best fiction films take off. This one was made just as World War II was over in Europe, and there was nothing but patriotism in the air, naturally. \n\nI actually like Leo G. Carroll a lot, and he holds up his scenes well, and Swedish actress Signe Hasso is a surprise, strong and sharp (wait until she takes her wig off and transforms in ten seconds). Much of the movie, especially after the first half hour with all its narration and actual documentary footage, has the feel of any well constructed drama and those are the parts, for me, to hook into. Besides, there is a quality here that's really pretty fun--a glimpse into the attitude of 1945 America that isn't the usual brazen, lonely, taut film noir response. Fiction makes for better movie-going, in this case, but here is a watchable quasi-documentary that holds up pretty well, off and on, if you keep expectations in check.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0037795/"
}