{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vicky Dawson",
            "url": "/name/nm0206290/"
        },
        {
            "@type": "Person",
            "name": "Christopher Goutman",
            "url": "/name/nm0332752/"
        },
        {
            "@type": "Person",
            "name": "Lawrence Tierney",
            "url": "/name/nm0862937/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12042,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008531/"
        },
        {
            "@type": "Person",
            "name": "Glenn Leopold",
            "url": "/name/nm0503158/"
        },
        {
            "@type": "Person",
            "name": "Neal Barbera",
            "url": "/name/nm0053493/"
        },
        {
            "@type": "Person",
            "name": "Eric Lewald",
            "url": "/name/nm0506718/"
        }
    ],
    "datePublished": "1981-10-09",
    "description": "An unknown killer, clad in World War II U.S. Army fatigues, stalks a small New Jersey town bent on reliving a 35 year-old double murder by focusing on a group of college kids holding an annual graduation dance.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Zito",
            "url": "/name/nm0957263/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjRmYjcyYjctYWZiMy00ZjQ5LWI4YzItNTUwZGE5MmM5NWU5XkEyXkFqcGdeQXVyNDgxODg1MzU@._V1_.jpg",
    "keywords": "video nasty,slasher,low budget film,female topless nudity,sadism",
    "name": "The Prowler",
    "original_info": {
        "id": "The Prowler_1981",
        "name": "The Prowler",
        "year": "1981"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RareSlashersReviewed"
        },
        "dateCreated": "2002-06-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0082951/"
        },
        "name": "Possibly the greatest of the early eighties dorm slashers...",
        "reviewBody": "By far my favourite of the early eighties dorm slashers, THE PROWLER is an excellent and exciting film brought to the screen with finesse by Joseph Zito. He also directed arguably the best of the FRIDAY THE 13th sequels - The Final Chapter. He shows us his love for the hack and slash cycle here, by renewing a few scenes from two of the genre's pioneers. You've got the 'murder in the shower' fresh out of Hitchcock's renowned classic PSYCHO. Here Zito makes it a lot more brutal, with some realistic and visually stunning gore effects from horror maestro Tom Savini. And then there are various references to Carpenter's HALLOWEEN, including the assassin digging up the grave of the victim he killed some 35 years earlier. Michael Myers steals his sister Judith's headstone from her grave when he escapes from his 15 year spell in Haddonfield's asylum. But although there are brief nods to his obvious influences, Zito also manages to supply some originality and some genuinely scary sequences. Back in the day it was thought that he was going to be the next Tobe Hooper after his flawless work within the horror genre. But sadly he went on to work with more action-orientated films such as Missing in Action, Red Scorpion and Invasion USA.\n\nThe plot is believable and also extremely well written. It opens with black and white footage of GIs returning victoriously from WW2. Cut to a letter from a girl named Rosemary to an unseen receiver, stating how she 'does not want to hurt him, but could wait for him no longer...' In other words someone's been dumped and it looks as if a few people are going to have to suffer because of it! Again cut to Avalon Bay Graduation dance 1945 and we're shown the lady Rosemary for the first time with her new 'fella'. While the host merrily talks about Glenn Miller's death, Rose and her cocky boyfriend head out under the stars for a spot of good old harmless (or extremely harmful in these films!) huggin' and a kissin'! They choose a spot at the end of a brightly laminated pier and continue to smooch the night away under the stars, unaware that a somewhat unfriendly looking guy disguised in GI garb and brandishing a bowie knife is watching their every move! Suddenly the lights go out, and Rose and her partner are brought a little bit closer together...Both impaled on a pitchfork!\n\nSkip 35 years and Avalon Bay is preparing for the first graduation dance since the fateful events that occurred before. While the young enthusiastic teens are shown getting ready to find romance at the dance, it looks as if a certain unknown someone is preparing for another bloody massacre. One girl unknowingly predicts the events that follow while she's getting dressed for the party by saying to her sulky looking friend \"Hey you're not gonna mope about tonight are ya? Some of us will never see each other again...\" Her remarks prove to be surprisingly accurate!\n\nTHE PROWLER is often pipped in the popularity stakes by the same year's similar slasher MY BLOODY VALENTINE. Many reviewers also find the latter to be the slightly better of the two. However I beg to differ, because even though MBV is a decent enough movie, I find this to be a scarier and for the most part more sinister attempt with a much stronger cast. Zito's spooky direction is superb and Savini's 'almost too realistic' gore touches just round it off perfectly. There are a few jumps to increase your heartbeat and I strongly wouldn't recommend any young femme fatale who's trying to grow her finger nails to watch this flick alone, because there are a couple of scenes when I guarantee you'll be biting them off!! One of my favorite ever murder scenes is also in this flick, the excellent swimming pool killing. A female teen who is bathing by herself under the moonlight paddles over to the ladder to climb out of the pool. She reaches the steps and begins to ascend them when all of a sudden she is brutally kicked in the face. She finally comes back to her senses and looks around to see who attacked her, but no one is anywhere to be seen! The silence is broken when the killer jumps out of the water behind her and gorily slices her throat in amazing detail. Watch for the blood that leaks out of her wound as her lifeless body sinks in to the murky depths of the cold water; it's Savini at his best...Excellent! The cast are also superb, which, must've helped the general production no end. Veteran actors Farley Granger and Lawrence Tierney have small roles, but the real 'round of applause' goes to fresh faced newcomers Goutman and Dawson who actually steal the show. It's only a shame they never went on to do much worth noting in the movies after this.\n\nAll in all THE PROWLER is everything a slasher should be dark, scary, gory while at the same time fun. It's incredibly underrated so I would most definitely recommend it, try and hunt down a copy if you can and I guarantee you will not be disappointed!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An unknown killer, clad in World War II U.S. Army fatigues, stalks a small New Jersey town bent on reliving a 35 year-old double murder by focusing on a group of college kids holding an annual graduation dance.",
        "duration": "PT2M51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1408483609",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTdhN2RhY2UtYzBmZC00OGMzLThhOGUtYmQyMzg3NjI1NDBkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTdhN2RhY2UtYzBmZC00OGMzLThhOGUtYmQyMzg3NjI1NDBkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-15T11:02:33.273Z",
        "url": "https://www.imdb.com/video/vi1408483609/"
    },
    "url": "/title/tt0082951/"
}