{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Anthony Newley",
            "url": "/name/nm0627969/"
        },
        {
            "@type": "Person",
            "name": "Mackenzie Astin",
            "url": "/name/nm0040015/"
        },
        {
            "@type": "Person",
            "name": "Phil Fondacaro",
            "url": "/name/nm0284496/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8278,
        "ratingValue": 2.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038231/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0795126/"
        },
        {
            "@type": "Person",
            "name": "Linda Palmer",
            "url": "/name/nm1378029/"
        },
        {
            "@type": "Person",
            "name": "Rod Amateau",
            "url": "/name/nm0024120/"
        },
        {
            "@type": "Person",
            "name": "John Pound",
            "url": "/name/nm0693764/"
        }
    ],
    "datePublished": "1988-04-07",
    "description": "Dodger must confront the struggles of life as he is visited by the Garbage Pail Kids and intimidated by some older bullies.",
    "director": [
        {
            "@type": "Person",
            "name": "Rod Amateau",
            "url": "/name/nm0024120/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Adventure",
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgzMzEwMzY5Nl5BMl5BanBnXkFtZTgwMzczNjkwMzE@._V1_.jpg",
    "keywords": "garbage can,bully,vomiting,urination,greaser",
    "name": "The Garbage Pail Kids Movie",
    "original_info": {
        "id": "The Garbage Pail Kids Movie_1987",
        "name": "The Garbage Pail Kids Movie",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gavin6942"
        },
        "dateCreated": "2016-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0093072/"
        },
        "name": "Holy Heck",
        "reviewBody": "Dodger must confront the struggles of life as he is visited by the Garbage Pail Kids and intimidated by some older bullies.\n\nAlthough apparently later owned by Orion and then MGM, this film was originally produced and distributed by Atlantic Entertainment Group. At this point, they had some minor hits with \"Valley Girl\", \"Teen Wolf\" and \"Night of the Comet\", but were never a major player. Not surprisingly, within two years of this film coming out, they were defunct.\n\nRod Amateau directed, produced, and co-wrote the film. He had not made any other films of note, but had a distinguished career going back decades in television. Interestingly, this was his final film -- despite living almost another 20 years. Was it a career killer? Amateau had as his right-hand man John Carl Buechler, which was the right choice, although given the film's focus on puppets, Buechler's involvement (not to mention Phil Fondacaro) give it the feeling of a Charles Band film. And that is never a good thing.\n\nIn fact, Buechler was involved before even Amateau, and in some ways had more to do with the final product. Apparently the Chiodo Brothers (\"Killer Klowns\") were contacted and passed, and next in line was John Carl Buechler, who was fresh off of \"Troll\". He was briefly considered as not just the effects guy but also the director, but his vision was too dark. He thought of the Kids as monsters, not something lovable, and the studio disagreed. He reflects, \"The best stuff in the movie is them farting and blowing snot on each other... but it had to walk this line of being a gentle fairy tale.\" He thinks the blend was a bad idea, and he is probably right.\n\nBuechler was the one who brought in Phil Fondacaro, and Phil brought in the \"little people\" he knew. So indirectly, Buechler not only created the Kids, but provided the actors who would play them. Buechler also brought in John Criswell, who had done effects for \"Re-Animator\" and \"From Beyond\", and has since gone on to bigger things like \"The hangover\". And William Butler, who is a terrible human being, but an important part of horror history, with all that he has designed, written, directed and acted in since the mid-80s.\n\nThe film was universally panned, receiving overwhelmingly negative reviews, and is widely considered to be one of the worst films ever made. Caryn James of The New York Times called the film \"too repulsive for children or adults of any age\", and it sits very, very low on both Rotten Tomatoes and IMDb. This abysmal (and fair) criticism aside, 2015-2016 welcomed a small resurgence of Garbage Pail Kids, with new cards coming out, and a very positive retrospective written in HorrorHound magazine. Indeed, the film can now be looked back upon as a strange moment in 1980s history, or what star Mackenzi Astin calls \"what-the-f***ery\".\n\nScream Factory found this to be the right time to release the film on blu-ray, and if there ever was a right time this may have been it. The film, as truly awful as it is, does seem better now (2016) than when it first came out. Even as a child I thought it was terrible, but now it has just a twinkle of nostalgia to make it palatable. The Scream disc comes with a few interviews of varying length and quality. The brief interview with Buechler is good, as he is not afraid of being honest. The real gem of this release, however is the interview with Mackenzie Astin. He talks freely for approximately 30 minutes and has countless stories to share about his father, his co-stars and more. If the movie might not be enough to make you buy the disc, his interview should be.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3584605977",
        "name": "The Garbage Pail Kids Movie",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWZjYTRkZDEtODNkYi00MmM1LWI3NTYtMWE1OWZiMTM2NzVhXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWZjYTRkZDEtODNkYi00MmM1LWI3NTYtMWE1OWZiMTM2NzVhXkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-09-10T17:19:59.913Z",
        "url": "https://www.imdb.com/video/vi3584605977/"
    },
    "url": "/title/tt0093072/"
}