{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bob Hope",
            "url": "/name/nm0001362/"
        },
        {
            "@type": "Person",
            "name": "Rhonda Fleming",
            "url": "/name/nm0281766/"
        },
        {
            "@type": "Person",
            "name": "Roland Young",
            "url": "/name/nm0950019/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 513,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008586/"
        },
        {
            "@type": "Person",
            "name": "Edmund Beloin",
            "url": "/name/nm0069410/"
        },
        {
            "@type": "Person",
            "name": "Melville Shavelson",
            "url": "/name/nm0789520/"
        },
        {
            "@type": "Person",
            "name": "Jack Rose",
            "url": "/name/nm0741439/"
        }
    ],
    "datePublished": "1949-11-23",
    "description": "On an ocean liner, an inept scoutmaster pursues a duchess while a killer pursues him.",
    "director": [
        {
            "@type": "Person",
            "name": "Alexander Hall",
            "url": "/name/nm0355284/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Comedy",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzFjYzJmMmQtNjVlYi00NGU1LWI0ZTAtNmNmYzM3OWMxMmRmXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "chess,ocean liner,duchess,gambling,boy scout",
    "name": "The Great Lover",
    "original_info": {
        "id": "The Great Lover_1949",
        "name": "The Great Lover",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rgshanks"
        },
        "dateCreated": "2000-11-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041429/"
        },
        "name": "A superior piece of Bob Hope work.",
        "reviewBody": "I've always found it difficult to write anything lengthy or analytical about straight comedies. This is not because I don't enjoy them - nothing could be further from the truth, especially in the case of any offering which includes the talents of the great Bob Hope, with or without Crosby. The reason, I believe, lies in the fact that such pictures generally work only by reference to the viewer's direct involvement in them - rather like the experience of belly-laughing continuously for 45 minutes at the comedian's turn at a sportsmen's evening, but without being ever able to remember one gag afterwards. So often, the plot is all too familiar and holds no major surprises. The performances of the stars are generally what you would expect from them, and differ purely in the level of quality from picture to picture, and, for screen comics, the writing is invariably geared to their own particular talents.\n\nAll this is true of \"The Great Lover\". Bob Hope is close to his very best as a scout leader returning by boat to America from Europe with his troop and drawn as Roland Young's stooge into murder, intrigue and, of course, romance. As in so many of his pictures of the forties and fifties, he plays a reluctant hero, a role which enables him to display the whole range of his trademark features - the mock cowardice, the way he controls his overheating in the romantic scenes, the witty asides and the cheeky but innocent double entendres.\n\nSo what makes this picture different or special? In order to answer that, I watched the movie again before writing this review, but I still couldn't come up with a reason. Sure enough, the support playing is more than adequate, the plot simple but still interesting, and Hope is - well - Hope. He just does those things which you associate with him, but somehow the gags and his delivery always seem fresh and unforced and, despite the similarity in content, he always makes the material appear original. I can only therefore come to the conclusion that I like the film because it is a superior piece of Bob Hope work - and I like Bob Hope's work. That is the best recommendation I can give it."
    },
    "url": "/title/tt0041429/"
}