{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Edmond O'Brien",
            "url": "/name/nm0639529/"
        },
        {
            "@type": "Person",
            "name": "Frank Lovejoy",
            "url": "/name/nm0522481/"
        },
        {
            "@type": "Person",
            "name": "William Talman",
            "url": "/name/nm0848251/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9598,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0034926/"
        },
        {
            "@type": "Person",
            "name": "Collier Young",
            "url": "/name/nm0949418/"
        },
        {
            "@type": "Person",
            "name": "Ida Lupino",
            "url": "/name/nm0526946/"
        },
        {
            "@type": "Person",
            "name": "Robert L. Joseph",
            "url": "/name/nm0430687/"
        }
    ],
    "datePublished": "1953-04-29",
    "description": "Two fishermen pick up a psychopathic escaped convict who tells them that he intends to murder them when the ride is over.",
    "director": [
        {
            "@type": "Person",
            "name": "Ida Lupino",
            "url": "/name/nm0526946/"
        }
    ],
    "duration": "PT1H11M",
    "genre": [
        "Crime",
        "Drama",
        "Film-Noir"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjM3NTY4OWYtNzkzNy00ZGZhLThkMmUtYjM4OTRlNmY0MWI2L2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "hostage,manhunt,hijack,trip,mexico",
    "name": "The Hitch-Hiker",
    "original_info": {
        "id": "The Hitch-Hiker_1953",
        "name": "The Hitch-Hiker",
        "year": "1953"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "funkyfry"
        },
        "dateCreated": "2007-08-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0045877/"
        },
        "name": "no melodrama",
        "reviewBody": "Ida Lupino's \"The Hitch-Hiker\" is like a B-movie bullet coming at the audience. No fat. No melodrama. Nobody trying to get home in time to save the crippled kid. Just a lean and mean treat  as the police-style narration promises us, 70 minutes of \"true\" crime suspense.\n\nThe plot is as straight and narrow as they come. Two war buddies (Frank Lovejoy and Edmund O'Brien) decide to detour south to the Mexican border to make their vacation more interesting (possibly a nudie show or two) and get far more action than they bargained for when they pick up a psychotic prison escapee (William Talman) who holds them hostage. The film's big gimmick is the fact that the hitch-hiker has one paralyzed eye, so that the two hostages can't tell when he's sleeping or awake to make a break for freedom. Considering how cheap this device sounds it actually works extremely well under the direction of Lupino and Talman's performance. As he tries to make his way to freedom across the Mexican deserts, the hitch-hiker drags these two All-American types with him and engages in sadistic games for his own amusement like having one of them hold a tin can while the other shoots it out of his hand with a rifle. After trying to escape together several times the hitch-hiker makes the film's most profound statement by taunting the 2 friends \"you could have escaped if you didn't worry about each other\" (or words to that effect).\n\nApparently there is some controversy over whether this film should be called a \"film noir\". It's been in the public domain for many years and has been included on a lot of \"film noir\" collections sold at bargain prices, and presumably some viewers have been disappointed by this film's lack of the usual things you see in a \"film noir\". Now first of all their complaints should be directed at the people who labeled the DVD instead of the people who made the movie 20 years before the term \"film noir\" even existed. Now is this just a semantic question? Yes and no. Ultimately it doesn't matter what we call the film. It's a suspense film, basically. In other words a film with a more or less set outcome where the audience spends the whole time worrying about \"how\" and not \"what\". There seems to be a disturbing trend with this film and some others, that I've gathered over the years reading comments, to hold these movies to some kind of extrinsic standard, a set of values totally alien to the film itself. The film does not have a \"femme fatale\". OK, it doesn't have any women period. It has no dark semi-Gothic melodrama. Perhaps most noticeably it does not take place in the dimly lit alleyways of urban America. Hence some \"film noir fans\" have chosen to deride the movie for its perceived deficiencies and to declare it lacking based on a strange confluence of out-of-control marketing (the chronic use of the word \"noir\" to sell videos) and narrow genre rules for a \"genre\" that never actually existed. Still others seem to stray in the opposite direction, considering any film \"noir\" that employs expressionistic photographic devices that were in common usage far back in the silent era. Instead of all this we should look at the film for what it is and only consider it in terms of \"noir\" as far as it helps us to understand the piece in relation to contemporary films of the 40s and 50s.\n\nThe most unusual aspect of the film in my opinion is its total lack of dramatic pretense aka melodrama. The meat of the film is in the 2 men's relationship and the way that the criminal interloper throws that friendship into relief. Superficially speaking they are \"innocent\" while he is \"guilty\". But what's interesting in the film is the way that the mere presence of this evil person brings out the weakness and corruption of the 2 friends. The hitch-hiker's comment about how the 2 men could have escaped separately but were held back by their friendship implies, as do many of his off-hand insulting comments, that the 2 men are soft and corrupted by civilization and that the hitch-hiker himself is a stronger man because he does anything he wants to do. However when one of them asks him \"have you ever had a gun pointed at you\" it's a subtle reminder that both of these men are war veterans and that they might have a much greater understanding of power and fear than the criminal could ever possess. In this way the film addresses broader issues of the post-war American man in terms of how he sees himself and how others in society may see him. It digs into the insecurity that the domestication and suburbanization of the post-war culture brought to many veterans. And as far as I'm concerned this is prime film noir territory.\n\nSo if you're strictly interested in traditional tough guys like Mike Hammer and Philip Marlowe, or if you insist on the standard \"good girl vs. bad girl\" melodrama (aka \"femme fatale\") then you probably won't get what you're looking for from this movie. But if you're interested in the broader themes of the corruptive influence of civilization that many \"noir\" films explore then this film is a novel way to see these themes expressed. It's a very well-made film  although not hugely ambitious, when taken on its own terms the film does have something to say about modern life.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3218063385",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWVkNzYzNTQtNzk3OC00M2Y2LWJmOGEtNDkyN2Q0Mzc2OTc0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWVkNzYzNTQtNzk3OC00M2Y2LWJmOGEtNDkyN2Q0Mzc2OTc0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-05-26T13:39:58.631Z",
        "url": "https://www.imdb.com/video/vi3218063385/"
    },
    "url": "/title/tt0045877/"
}