{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Denis Leary",
            "url": "/name/nm0001459/"
        },
        {
            "@type": "Person",
            "name": "Lenny Clarke",
            "url": "/name/nm0164873/"
        },
        {
            "@type": "Person",
            "name": "Diane Farr",
            "url": "/name/nm0268007/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1970,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072799/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0127564/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067205/"
        },
        {
            "@type": "Person",
            "name": "Denis Leary",
            "url": "/name/nm0001459/"
        },
        {
            "@type": "Person",
            "name": "Peter Tolan",
            "url": "/name/nm0865847/"
        }
    ],
    "datePublished": "2001-03-14",
    "description": "New York detective Mike McNeil is well-known for his unconventional approach of fighting crime. But it also takes a toll in his personal life complicated by his wife and girlfriend on the side.",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA1OTM3ODExODdeQTJeQWpwZ15BbWU3MDUyMzI4MjE@._V1_.jpg",
    "keywords": "black comedy,nypd,new york city,irish american,police",
    "name": "The Job",
    "original_info": {
        "id": "The Job: The Complete Series_2001",
        "name": "The Job: The Complete Series",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "buzznzipp1995"
        },
        "dateCreated": "2006-07-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0272980/"
        },
        "name": "The booze,the pills, the cigarettes, and one great cop.",
        "reviewBody": "Don't forget the lover on the side!! She is a 'hottie', Karen Parsons is delicious, she is wonderful, in acting and beauty and style. It's just his Job! HO, well now here is a show that the writing slugs you in the gut and while your doubled over, kicks you in the butt! In quoting Peter's wife,(The Associate/ writer/ Producer) she said when they were watching the 'previews' for up coming 'new' shows at an ABC network party, she looked at her husband after the preview for 'the Job' played and said, \"This doesn't look like anything else that is on this network. You guys are in trouble.\" Meaning, it 'looks' very good! But it's not looking like the regular 'shiny happy people sitcom' fare or over-hair-styled drama that they (ABC) are regularly comfortable putting on the 'Air\". From the time I saw this, after the first episode finished, I made sure that I didn't miss that time slot next week. I was instantly addicted to \"The Job\" Cutting wit and cynicism, outrageous situations, and laughter rolling writers makes this series a Hit!! \n\nThen I felt anger and a feeling of being let down, that the show just sailed off the air. I wondered what executive, made that decision to tear down a major comedy cornerstone for their network?\n\nI talked to other people about it some knowing, some not, but I know that the stupid network didn't promote this hard enough, or I should say visually enough. If they had it would have run at least 3-5 seasons, maybe even six. I just believe that knowing network short comings and being overly subscribing to one 'formula' or another that they missed the boat with this one. There was so much room for expansion, it had barely just begun. The situations were funny and serious, fast and sometimes slow, though not much it kept a good pace. some years later, I finally found it on DVD new for $50.00. To me it would be worth $1,000.00 to have this in my entertainment library. I watched in amazement as I went through both seasons again for the third time on DVD and the ending 'Betrayal' episode, was going into a total serious drama segment with them uncovering a murder victim, it was better than most of the drama 'victim Unit' and 'cop' shows on the air now!!! They went into the scenes as serious as a heart attack and as believable, did so as if not even skipping a beat. Just like it was meant to be serious, I am so impressed with the 'versatile ways' that Tolan and Leary shared in the story-lines and scripts.\n\nIn another outrage of the 'entertainment week' I learned that the beautiful wardrobe, of silk ties and expensive suits with pressed shirts and ultra stylish footwear...was all sold to the movie made for cable \"In the cut\" (2003) for only four hundred dollars, thats it!!!! I'm sick. Did you see what they all wear for each show?? A good over coat alone could run that much. \n\nThis was Denis Leary at some of his finest. I recommend this great cop 'dramedy' for East-coasters or wherever you are in this country. I even heard that people from Ireland were joking with Leary the 'Bathroom' episode, repeating lines back to him from that one, because they saw it over there. (****) A Superbly intuitive, comedic New York Leary/Tolan cop Show.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Shout! Factory",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi177144089",
        "name": "The Job: The Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDBiNjg0MDAtNmQzZi00M2MxLWI4M2MtOGJmMDY3NDVkZGM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDBiNjg0MDAtNmQzZi00M2MxLWI4M2MtOGJmMDY3NDVkZGM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:31:17Z",
        "url": "https://www.imdb.com/video/vi177144089/"
    },
    "url": "/title/tt0272980/"
}