{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Nicolas Cage",
            "url": "/name/nm0000115/"
        },
        {
            "@type": "Person",
            "name": "Ed Harris",
            "url": "/name/nm0000438/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 344650,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076240/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102770/"
        },
        {
            "@type": "Person",
            "name": "David Weisberg",
            "url": "/name/nm0918711/"
        },
        {
            "@type": "Person",
            "name": "Douglas Cook",
            "url": "/name/nm0177018/"
        },
        {
            "@type": "Person",
            "name": "Mark Rosner",
            "url": "/name/nm0743119/"
        }
    ],
    "datePublished": "1996-06-07",
    "description": "A mild-mannered chemist and an ex-con must lead the counterstrike when a rogue group of military men, led by a renegade general, threaten a nerve gas attack from Alcatraz against San Francisco.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Bay",
            "url": "/name/nm0000881/"
        }
    ],
    "duration": "PT2H16M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDJjOTE0N2EtMmRlZS00NzU0LWE0ZWQtM2Q3MWMxNjcwZjBhXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "u.s. navy seals,alcatraz,chemical weapon,u.s. marine corps,u.s. marines",
    "name": "The Rock",
    "original_info": {
        "id": "The Rock_1996",
        "name": "The Rock",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "2000-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117500/"
        },
        "name": "An action packed, high octane thriller with great performances. ***1/2 out of ****.",
        "reviewBody": "THE ROCK / (1996) ***1/2\n\nStarring: Sean Connery, Nicolas Cage, Ed Harris, Jon Spencer, David Morse, William Forsythe, Bokeem Woodbine, and Vanessa Marcil. Directed by Michael Bay. Running time: 135 minutes. Rated R (for strong intense violence, language and brief sexuality)\n\nNotes taken while screening The Rock:\n\n· The film contains superior character development of both the antagonist and protagonist. Each is clear and well defined. We also learn the characters motives, reasoning, dramatic situation, and premise--all brilliantly introduced within the setup.\n\n· Sean Connery provides us with strong character development through John Patrick Mason--although the character is somewhat a rip off of the Anthony Hokins' Hannibal from \"The Silence of the Lambs.\"\n\n· It is uncanny how well the movie's visual style works. It propels the film's suspense the extra mile, increasing the tension and enticement. Also contributing to the style is the fitting soundtrack.\n\n· Some of the events are excessively coincidental. For example, during an exciting chase scene, Mason dashes out of a building, escaping the clutches of concealing police, discovering a Hum-V seemingly awaiting his arrival. Experienced chemist, Stanley Goodspeed (Nicolas Cage), chases after him, in a high speed Ferrari sitting outside his position in a building. Another coincidence occurs in the high security prison, where Mason escapes a grenade blast by dashing at random into a room, where, of course, there just so happens to be a secure bathtub to climb in. \n\n· There is a stolid, aggressively effective cast present. Each actor contributes a taut, penetrating performance, especially Ed Harris as the film's villain, General Francis X. Hummel who demands a moral purpose holding the lives of an urban area at stake.\n\n* The character's motives and perfectly defined, especially General Francis X. Hummel. Even as the film's bad guy, he serves an understandable position, thus we empathize with him, unlike most villains witnessed in modern day thrillers.\n\n· The standard three act structure is flawless: each scene propels the plot forward. The sequences either create a new problem or complicate a previous conflict, favoring with the later concept. This raises the line of tension even further.\n\n· Most of the production takes place in a high security prison, Alcatraz, crafted with a complex, awe-inspiring atmosphere towering over that of most action movies.\n\n· Sean Connery handles the complicated role of John Mason with mere simplicity, yet easily torments the audience with a sense of omniscient knowledge of the plot.\n\n· The picture is unpredictable and contains several inducing and unexpected twists proving this movie is imaginative and free to surprise us. The conclusion is not fomulatic. \"The Rock\" is filled with artful design and crafty performances. It is one of the year's best action films.\n\nBrought to you by Hollywood Pictures.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2429731097",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWQ3YTI5MTItYmY1My00MjBjLWExN2EtZGVlNDVmN2IxZWMxXkEyXkFqcGdeQWdhbWF6b2E@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWQ3YTI5MTItYmY1My00MjBjLWExN2EtZGVlNDVmN2IxZWMxXkEyXkFqcGdeQWdhbWF6b2E@._V1_.jpg",
        "uploadDate": "2020-10-31T13:35:13.379Z",
        "url": "https://www.imdb.com/video/vi2429731097/"
    },
    "url": "/title/tt0117500/"
}