{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gregory Peck",
            "url": "/name/nm0000060/"
        },
        {
            "@type": "Person",
            "name": "Joan Collins",
            "url": "/name/nm0001058/"
        },
        {
            "@type": "Person",
            "name": "Stephen Boyd",
            "url": "/name/nm0000963/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5986,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        },
        {
            "@type": "Person",
            "name": "Frank O'Rourke",
            "url": "/name/nm0642543/"
        }
    ],
    "datePublished": "1958-08-01",
    "description": "A man is chasing four outlaws who killed his wife and finds them in a small town's jail, but they escape to Mexico.",
    "director": [
        {
            "@type": "Person",
            "name": "Henry King",
            "url": "/name/nm0454771/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2IyZDM2OGUtNmEzNy00OWE2LWE0YzYtYjQ0ZmFmNDJlOGZhXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "revenge,rape,outlaw gang,chase,based on novel",
    "name": "The Bravados",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ingemar-4"
        },
        "dateCreated": "2011-07-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0051433/"
        },
        "name": "One of the best westerns",
        "reviewBody": "This is a smart western, it is not about the hero quick-drawing against four anonymous opponents at the same time, it is about moral.\n\nFor quite some time, you are not sure exactly where the movie is heading. The beginning is slow, with the goal to present the hero (Peck). He is doing just about the same silent, dry western hero as in \"The Gunfighter\". But the tempo goes up and the plot reveals, step by step. We get very convinced that the four criminals are quite bad men, and the worst is clearly the ruthless Bill (Stephen Boyd), ready for rape and murder any time it suits him.\n\nJoan Collins, however, is mostly annoying, subject of an implied love story that the movie fortunately doesn't go deeper into. She has little importance to the story. It seems she is there only to tack on a touch of romance.\n\nThe movie manages to make each and every one of the bad guys (six of them if you count right) sharp and live, we get to know them. We also get to know a few others. The most famous villain actor here is clearly Lee van Cleef, who makes a great job as Parral, but the best character actor is really Joe DeRita (one of the Three Stooges) as Tucker/Simms, who is, incredibly, uncredited despite his fairly big role, central to the story. This means that both casting and script are very good, the script gives room for acting and the actors are capable of delivering.\n\nFrom an action/western perspective, the movie fails on one thing: It could make more dramatic endings when people are killed, spend a little more time on their last seconds so we kind of follow them down. Now, a death is too much like flipping a switch. We don't have to use slow-motion every time, but a second or two extra would have helped in some places. In some cases, I feel that the movie really doesn't want to show too much violence and blood, but in at least two occasions it isn't that simple, it looks rather like if the director or producer was careless with some important scenes. These all to obvious mistakes lower the total a bit, but they don't ruin the movie, it just takes it below the absolute top.\n\nBut what the movie doesn't fail in is to deliver a message, a message of right and wrong, life and death, who has the right to kill. This is where it shines. After all is said and done, you find that there is still a lot more to say, more to think about, and the movie stays with me a lot longer than the average western where the difference between right and wrong is obvious and crystal clear."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this western revenge tale",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2373060377",
        "name": "The Bravados",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjg5MDFlZWUtMmQwOC00ODI2LTg0ZTYtNTg3NDU0MTIyNWZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjg5MDFlZWUtMmQwOC00ODI2LTg0ZTYtNTg3NDU0MTIyNWZjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T15:58:30Z",
        "url": "https://www.imdb.com/video/vi2373060377/"
    },
    "url": "/title/tt0051433/"
}