{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frank Kress",
            "url": "/name/nm0470930/"
        },
        {
            "@type": "Person",
            "name": "Amy Farrell",
            "url": "/name/nm0268171/"
        },
        {
            "@type": "Person",
            "name": "Hedda Lubin",
            "url": "/name/nm0523901/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2637,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "X",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032382/"
        },
        {
            "@type": "Person",
            "name": "Alan J. Dachman",
            "url": "/name/nm0196499/"
        }
    ],
    "datePublished": "1972-09-22",
    "description": "A young reporter enlists the help of a top notch private eye to solve the murder of a female stripper at a Chicago nightclub.",
    "director": [
        {
            "@type": "Person",
            "name": "Herschell Gordon Lewis",
            "url": "/name/nm0504496/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Comedy",
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2JlYWJjYTQtOWFkYS00NjhkLWI4YTktYjkwNTVlMmM1MmU0XkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_.jpg",
    "keywords": "mysterious villain,extreme violence,evil man,sadistic psychopath,bloody violence",
    "name": "The Gore Gore Girls",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Hey_Sweden"
        },
        "dateCreated": "2012-06-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0068649/"
        },
        "name": "HGL gore epic has its moments.",
        "reviewBody": "Legendary splatter master Herschell Gordon Lewis takes violence just about as far as he can in the standout scenes of this typically insane film. The only problem is, the movie tends to be tedious in between all of its outrageous highlights. It's certainly sleazy enough: the story has a series of go go dancers being mutilated in unspeakable ways by a demented killer. Nancy Weston (Amy Farrell), a ditzy reporter for a newspaper, hires renowned private detective Abraham Gentry (Frank Kress) to determine who the murderer is. \"The Gore Gore Girls\" features all of the hallmarks of any HGL film. The acting is often atrocious; exceptions here are lead Kress, who actually plays his unflappable if somewhat smarmy hero with wit and style, and the famous stand up comedian Henny Youngman, who plays his strip club impresario with gusto. Unfortunately, Youngman often talks so fast and loud one can't make out all of his quips. Farrell certainly is easy on the eyes, and due to the story line one can expect a fair amount of skin bared. One can also expect an odd ball character or two, especially hostile weirdo Grout, who loves to sit at bars and smash & smush produce. The persistent soundtrack is likewise good for some amusement. Making the whole thing worthwhile is the great flair HGL brings to his gore scenes. They're so far over the top, and so protracted, that it feels as if what he's really doing is spoofing himself. There are throat slittings, head mutilation, boiling a face in oil, and the piece de resistance, the slicing off of nipples which results in a flow of milk from one breast and chocolate milk from another. If nothing else tells us just how much HGL's tongue is in his cheek here, that'll do it. Fans of the director, and vintage exploitation / horror should lap it right up, others need not watch. There's undeniable padding; even at 85 minutes, this goes on a bit longer than it really needs to. And the identity of the killer will come as no surprise, although I can't imagine how many people would watch this actually hoping for a good murder mystery. As utterly crazy, trashy entertainment goes, one could definitely do worse than this. Six out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A young reporter enlists the help of a top notch private eye to solve the murder of a female stripper at a Chicago nightclub.",
        "duration": "PT1M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3410346777",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTUwNmU3N2UtMTg2OS00OGVkLTg4MDctOTViNWRhYTIwYzA0XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTUwNmU3N2UtMTg2OS00OGVkLTg4MDctOTViNWRhYTIwYzA0XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-03-18T15:51:23.267Z",
        "url": "https://www.imdb.com/video/vi3410346777/"
    },
    "url": "/title/tt0068649/"
}