{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julie Andrews",
            "url": "/name/nm0000267/"
        },
        {
            "@type": "Person",
            "name": "Anne Hathaway",
            "url": "/name/nm0004266/"
        },
        {
            "@type": "Person",
            "name": "Hector Elizondo",
            "url": "/name/nm0001185/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 151887,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008970/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007801/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027400/"
        },
        {
            "@type": "Person",
            "name": "Meg Cabot",
            "url": "/name/nm0127690/"
        },
        {
            "@type": "Person",
            "name": "Gina Wendkos",
            "url": "/name/nm0920859/"
        }
    ],
    "datePublished": "2001-08-03",
    "description": "Mia Thermopolis has just found out that she is the heir apparent to the throne of Genovia. With her friends Lilly and Michael Moscovitz in tow, she tries to navigate through the rest of her sixteenth year.",
    "director": [
        {
            "@type": "Person",
            "name": "Garry Marshall",
            "url": "/name/nm0005190/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Comedy",
        "Family",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzcwYjEwMzEtZTZmMi00ZGFhLWJhZjItMDAzNDVkNjZmM2U5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "princess,makeover,high school,awkward girl,manners",
    "name": "The Princess Diaries",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "polar24"
        },
        "dateCreated": "2007-02-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0247638/"
        },
        "name": "A fun and bubbly rom-com that took me back to my memorable teen years",
        "reviewBody": "This entertaining and hip teen comedy was a surprise winner for me. Definitely not part of the target audience (though I do consider myself young at heart!) I was charmed by Ms Hathaway's naivety and photogenic presence and the always reliable Julie Andrews who wonderfully never takes herself too seriously, poking fun at her family-friendly screen persona. Garry Marshall demonstrates his talents of sweet irresistible romantic comedies in what could be called his follow-up to his 1990 smash \"Pretty Young Woman\". And with Hathaway, he has found his 21st century young muse.\n\nThe storyline fits perfectly into the soapsud daydreams of all young ladies. Never the popular kid graced with mawkish looks and a geeky personality, Mia Thermopolis resigns herself to a life of miserable loneliness and school bullies. However, in a moment of emancipation, she is uncovered by her Grandmother Clarisse Renaldi and when told that she is the last remaining bloodline of a royal family, she must take over the throne of the idealistic kingdom of Genovia. Cue Cinderella-like transformation and plenty of vivacious trying on of clothes and groovy pop tunes.\n\nThe film has a simple but great (even hackneyed) message at heart, to be true to yourself and never forget that your friends and family can be the most honest and important in your life. It could have come off contrived and cheesy but the film still conveys heartwarming moments and a sincere semblance.\n\nThere is great energy in the film and some of the scenes in the palace and garden are quite picturesque and dreamy. The storyline can be pretty thin considering the good-guy-bad-guy syndrome but Mia's closest friends are still commendable and mature young people capturing the trials and tribulations of teenage \"fitting in\", first loves, peer pressure, pressure from Mums and Dads and realisation of adult responsibilities.\n\nI had a really fun time with this film, absorbed in it's fairytale story lines and taking myself back to when I was young and naive. Thanks to the irresistible company and chemistry of the two female leads I was able to totally identify with their dilemmas. This film has Disney written all over it. A good simple message at heart and fully of quirky side characters and a charismatic underdog. Lovely to look at and listen to (I went out afterwards to check out the soundtrack!), this one always brings a smile to my face whenever I catch it on TV - I had a good time.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Mia Thermopolis has just found out that she is the heir apparent to the throne of Genovia. With her friends Lilly and Michael Moscovitz in tow, she tries to navigate through the rest of her sixteenth year.",
        "duration": "PT2M10S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3776691737",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTg3YWRhMzgtNjMyYS00MWM1LThhOTUtMTJhODBjMDU2MjlhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTg3YWRhMzgtNjMyYS00MWM1LThhOTUtMTJhODBjMDU2MjlhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-01T10:17:10.732Z",
        "url": "https://www.imdb.com/video/vi3776691737/"
    },
    "url": "/title/tt0247638/"
}