{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Clements",
            "url": "/name/nm0166234/"
        },
        {
            "@type": "Person",
            "name": "Ralph Richardson",
            "url": "/name/nm0724732/"
        },
        {
            "@type": "Person",
            "name": "C. Aubrey Smith",
            "url": "/name/nm0807580/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6306,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103018/"
        },
        {
            "@type": "Person",
            "name": "A.E.W. Mason",
            "url": "/name/nm0556571/"
        },
        {
            "@type": "Person",
            "name": "R.C. Sherriff",
            "url": "/name/nm0792670/"
        },
        {
            "@type": "Person",
            "name": "Lajos Biró",
            "url": "/name/nm0083742/"
        }
    ],
    "datePublished": "1939-08-04",
    "description": "A timid 1880s British Army officer resigns, burning his last-day summons to war in Egypt. Accusing him of cowardice, his girlfriend and three friends give him white feathers. To gain redemption, he shadows his friends to save thei...",
    "director": [
        {
            "@type": "Person",
            "name": "Zoltan Korda",
            "url": "/name/nm0466113/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Adventure",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDM0Yzc1NjEtNmNiYi00YjA3LWE4MDMtMWU5ZDhjNjUxYTI3XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "sudan,battle,combat,hand to hand combat,siege",
    "name": "The Four Feathers",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "theowinthrop"
        },
        "dateCreated": "2006-06-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0031334/"
        },
        "name": "The Meaning of Courage in Victorian England and in the Sudan",
        "reviewBody": "Few people read A.E.W.Mason anymore, but his historical novels were once very popular. The best known title, due to being the source of several movies, is THE FOUR FEATHERS. \n\nYoung Harry Faversham grew up in a household where his father, a general, tried to inculcate the idea of military duty and patriotism to him. Perhaps overkill would be a better description. We see his father having dinner with his military cronies, most notably General Burroughs (Sir C. Aubrey Smith), and hear the most fire-eating conversations about the military. Harry's father even tells about how one cowardly officer did the only decent thing he could - he blew his brains out. \n\nYears pass. Faversham has gone into the military and has three close friends: Captain John Durrance (Ralph Richardson), Lt. Thomas Willoughby (Jack Allan), and Peter Burroughs (Donald Gray). He is engaged to Ethne Burroughs (June Duprez). Then, in 1896, his regiment is ordered to the Sudan to fight the Mahdists. This is the same war that began in KHARTOUM, and that even shows a scene when Gordon is speared by the Mahdists when his fort fell. Durrance, Willoughby, and Burroughs are looking forward to the great game of war, and of fighting as a unit together. Duprez is hopeful her beloved hero will return with a great military reputation. But Faversham does not want to go. He resigns his commission, saying he just does not feel like fighting. The real reason is that he is tired of this militaristic crap he's fed all his life. Since his father is now dead he doesn't have to put up with it anymore. Unfortunately, his three friends and his fiancé disagree. Each sends him a white feather - a silent comment saying that he is a coward. None want to hear his explanations.\n\nHe confides to his one gentle friend, Dr. Sutton (Frederick Culley). Sutton understands him, but points out that his bad timing makes any explanation look suspicious. So Harry decides on a plan. He goes back to Egypt, and gets himself dressed up as a native, who can't speak (a tribe was punished by having their tongues cut off, and their cheek branded - so they don't speak Arabic at all, and Harry might be able to get away with passing himself off as a native). Then he proceeds into the war zone as a spy. \n\nIn the meantime, his three chums have had nothing but misfortune. Willoughby and Burroughs are captured by the Mahdists in a battle, and are tormented daily in a cell at Omdurman (the capital of the Mahdists, now ruled by \"The Khalifa\" (John Laurie)). Worst perhaps is Durrance's tragedy. He managed to flee a massacre site by accident, but lost his pith helmet in the desert. The intense sun of the Sahara destroyed his optic nerves, and he is now blind. So of the four chums, two are imprisoned by the enemy and one is useless for the war effort.\n\nHarry's efforts to save his friends and aid his country, ending in the battle at Omdurman in 1898, are the conclusion of this great movie. The acting is good, although stolen by Richardson as the blind Durrance, demonstrating his ability to read Braille in one scene, and learning belatedly that the person who saved his life in the desert was a man he maligned. Aubrey Smith added to his moments of creative acting on the screen in his famous description of the battle of Balaclava (he insists modern war is not as deadly as the Crimean, forty years before) using the dinner table and the food to show the Charge of the Light Brigade. It is pleasant to relate that at the end of the film Clements teaches the old fart that there are elements to the story he has hidden that Clements knows about that undercuts the heroics.\n\nThe Zoltan Korda version of THE FOUR FEATHERS is the best known of the filming of the novel. It was also in color, and blazing color at that. The film is best seen as a follow-up to KHARTOUM (possibly with THE LIGHT THAT FAILED in the middle), but be prepared for a degree of racism towards the Mahdists. In one scene, Laurie watches the torture of a British soldier, and the gleam in his eyes is a bit much. But then again, given the way Al Quaeda cheers on beheadings of \"infidels\" and the destruction of Americans in collapsing U.S. skyscrapers maybe that gleam is not so far from the truth?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1567998233",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDMyMjAzNDUtZTgzNy00NTNkLWI0NTAtOGRlN2MwYjkzOTNmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDMyMjAzNDUtZTgzNy00NTNkLWI0NTAtOGRlN2MwYjkzOTNmXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-01-15T02:24:06.707Z",
        "url": "https://www.imdb.com/video/vi1567998233/"
    },
    "url": "/title/tt0031334/"
}