{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Claudette Colbert",
            "url": "/name/nm0001055/"
        },
        {
            "@type": "Person",
            "name": "Joel McCrea",
            "url": "/name/nm0566948/"
        },
        {
            "@type": "Person",
            "name": "Mary Astor",
            "url": "/name/nm0000802/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12322,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "Preston Sturges",
            "url": "/name/nm0002545/"
        },
        {
            "@type": "Person",
            "name": "Ernst Laemmle",
            "url": "/name/nm0480677/"
        }
    ],
    "datePublished": "1943-01-01",
    "description": "A New York inventor needs cash to develop his big idea, so his adoring wife decides to raise it by divorcing him and marrying an eccentric Florida millionaire with a capricious high-society sister.",
    "director": [
        {
            "@type": "Person",
            "name": "Preston Sturges",
            "url": "/name/nm0002545/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjU3MTlmNmUtZmMxZS00YTNmLTlkZWQtOTBhYjNkYjkyMWUxXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "millionaire,inventor,twin,palm beach florida,screwball comedy",
    "name": "The Palm Beach Story",
    "original_info": {
        "id": "The Palm Beach Story_1942",
        "name": "The Palm Beach Story",
        "year": "1942"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mscheinin"
        },
        "dateCreated": "2000-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0035169/"
        },
        "name": "Sturges' Best: Funny, Sophisticated & Well-Studied by Billy Wilder",
        "reviewBody": "When commenting on a film as brilliantly constructed and deeply entertaining as The Palm Beach Story, it's hard to know just where to start.\n\nDo you tip your hat to the uniformly wonderful performers?\n\nDo you pay tribute to the bizarre and hilarious conversations held by the Weenie King (Robert Dudley), an incidental character who manages to be a lot more than a mere plot contrivance?\n\nDo you mention the fact that the film was clearly an influence upon the (slightly superior) screwball classic Some Like It Hot?\n\nNope. You just say, Preston Sturges was a genius and this is his best film.\n\nGerry Jeffers (Claudette Colbert) has decided that she needs to divorce her husband Tom (Sturges regular Joel McCrea). Why? We're not quite sure. Perhaps she's looking for thrills, perhaps she simply wants a partner who can pay the rent and perhaps she's truly come to believe that she no longer loves him. No matter. Her mind is made up and there's nothing Tom can do about it. Try as he might, Gerry slips through his fingers and ends up on a train to Palm Beach, the divorce capital of the world.\n\nEchoes of Some Like first appear on the train ride when Gerry finds herself unable to sleep do to the racket being caused by The Ale and Quail Club. It's bad enough when they start shooting out windows, and what comes next... let's just say that it's a lot funnier than it would be if it happened in real life.\n\nStill, Gerry makes it to Palm Beach, in the company of nutty millionaire John D. Hackensacker (Rudy Vallee). Things only get really out of hand once Tom arrives and becomes pegged as a bachelor, Captain McGlew. And spoil more of the plot for you I will not.\n\nSturges was capable of operating in many modes: responsible and patriotic (Sullivan's Travels) and outrageously madcap (The Miracle of Morgan's Creek) are two that come to mind. But Palm Beach shares its elegance, wit and reserve with The Lady Eve, in which con artist Barbara Stanwyck sets her sights on absent-minded professor Henry Fonda. (Even the mistaken identity plot is similar upon examination).\n\nBetween the two, Eve may end on a slightly more graceful note, but Beach seems to be made with a bit more... well, experience. Sturges seems at his most relaxed throughout the film and it does a world of good. (The story is bogged down only by brief moments of racism early on). And leaving, it's hard not to feel sunny and refreshed.\n\nFor those in need of a vacation, I recommend a stay at Palm Beach. And the rest of you should come along as well."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Paramount",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2807300121",
        "name": "The Palm Beach Story",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTU4ZjAwYWEtNjJiYi00NWJjLWE3YWItMTFjODYwZTY2YzZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTU4ZjAwYWEtNjJiYi00NWJjLWE3YWItMTFjODYwZTY2YzZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-11-02T03:51:35Z",
        "url": "https://www.imdb.com/video/vi2807300121/"
    },
    "url": "/title/tt0035169/"
}