{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hilary Swank",
            "url": "/name/nm0005476/"
        },
        {
            "@type": "Person",
            "name": "Simon Baker",
            "url": "/name/nm0048932/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Pryce",
            "url": "/name/nm0000596/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5442,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054452/"
        },
        {
            "@type": "Person",
            "name": "John Sweet",
            "url": "/name/nm0842270/"
        }
    ],
    "datePublished": "2001-12-07",
    "description": "In pre-Revolutionary France, a young aristocratic woman left penniless by the political unrest in the country must avenge her family's fall from grace by scheming to steal a priceless necklace.",
    "director": [
        {
            "@type": "Person",
            "name": "Charles Shyer",
            "url": "/name/nm0796124/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Drama",
        "History",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcxMzkxOTUxOV5BMl5BanBnXkFtZTcwMjkzMTQyMQ@@._V1_.jpg",
    "keywords": "period drama,1770s,1780s,18th century,french history",
    "name": "The Affair of the Necklace",
    "original_info": {
        "id": "The Affair of the Necklace_2001",
        "name": "The Affair of the Necklace",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2008-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0242252/"
        },
        "name": "historically inaccurate, badly cast, let's see, what else",
        "reviewBody": "Certainly the true story of \"The Affair of the Necklace\" is one of the most fascinating in all history, and despite a lot of problems, this 2001 film, deriving its name from said affair, is interesting if misguided. The director seemed to want a sexually-charged drama, though he didn't get one. The casting is odd, starring Hilary Swank as Comtesse Jeanne LaMotte. She doesn't have enough European sensibility. Adrien Brody plays her cavorting husband and doesn't seem to get the period either. As Cardinal Rohan, however, Jonathan Pryce is very good, as are some of the performances in the smaller roles.\n\nThere are lots of complaints on this board about the accents, which goes to show you that this film failed on a few levels - people would probably not be mentioning accents if they'd really loved this movie. First of all, there isn't anything wrong with the accents, not the accents themselves or the variety of them. Films have mixed accents for years. For those who think everyone should have been speaking with a French accent, think again. The theatrical rule: if you are playing a foreigner living in his own country, say France, he is not speaking English with a French accent; he is speaking his native tongue; therefore, no accent is required. Were this not the case, all Chekov plays would be performed with the actors using thick Russian accents just as one example. Many actors use the more attractive British accent instead. Maybe there could have been more uniformity, but you can say that about any WWII propaganda film, where Hollywood hired actual foreigners to work among the Americans.\n\nI actually found the movie intriguing, as it's a great story, even if it wasn't told particularly well. It did deviate from the truth quite a bit, though. LaMotte was not as she was portrayed. She came from a poor family but was of royal blood, and what she wanted was a good-sized pension from the Queen (here Joely Richardson, no teen queen), who ignored her as in the film. Jeanne's plot consisted of the forged letters by Marie asking Cardinal Rohan, in actuality Jeanne's lover, to lend her the money, not just guarantee the payments. Louis and Marie wanted a public trial not just because the Affair of the Necklace had further destroyed Marie's reputation, but because France was abuzz with the rumor than Jeanne was Marie's lover. As in the film, Marie did wind up in England and write her memoirs, but they were filled with stories of a lesbian relationship between her and Marie Antoinette.\n\nIn portraying Jeanne as somehow sympathetic - denied her place in society, as well as her home and her name, and watching her father (who was in reality a drunk) killed by soldiers - a lot of the teeth is taken out of the story. While 1938's \"Marie Antoinette\" makes Marie a heroine, this one portrays her as a cold bitch. Selfish and shallow she certainly was and like much of history's royalty, completely out of touch with her people - but Jeanne was no saint either. A more accurate telling of this story would make for a much better drama.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In pre-Revolutionary France, a young aristocratic woman left penniless by the political unrest in the country, must avenge her family's fall from grace by scheming to steal a priceless necklace.",
        "duration": "PT2M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3490759449",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODJjOTAyNzQtYzU3My00Y2NiLTllZDQtNmE4NzA5ODQ3ZjQ3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODJjOTAyNzQtYzU3My00Y2NiLTllZDQtNmE4NzA5ODQ3ZjQ3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-20T14:04:50.266Z",
        "url": "https://www.imdb.com/video/vi3490759449/"
    },
    "url": "/title/tt0242252/"
}