{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tony Curtis",
            "url": "/name/nm0000348/"
        },
        {
            "@type": "Person",
            "name": "Henry Fonda",
            "url": "/name/nm0000020/"
        },
        {
            "@type": "Person",
            "name": "George Kennedy",
            "url": "/name/nm0001421/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10074,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Edward Anhalt",
            "url": "/name/nm0030019/"
        },
        {
            "@type": "Person",
            "name": "Gerold Frank",
            "url": "/name/nm0290940/"
        }
    ],
    "datePublished": "1968-10-16",
    "description": "A series of brutal murders in Boston sparks a seemingly endless and increasingly complex manhunt.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Fleischer",
            "url": "/name/nm0281507/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYmQ2NWRlZjktMTgyMy00OTgxLTg1ZTQtYzExMjU1YjFjZTYxXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "strangler,serial rapist,double life,true crime,boston massachusetts",
    "name": "The Boston Strangler",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2008-05-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062755/"
        },
        "name": "A Killer Role",
        "reviewBody": "Tony Curtis really showed his acting chops when he took on the most unlikely role of Albert DeSalvo the famous Boston Strangler of the early 1960s. Though he's only in the film literally for about half of it, what you see is a classic performance. Why he wasn't nominated for an Oscar, the Deity only knows.\n\n13 women were found dead in the Boston area of manual strangulation and they were also sexually molested. Public concern was so great that the then Attorney General Edward Brooke, played by William Marshall, overrode local jurisdictions and prerogatives and assigned a lawyer from his office John Bottomly to coordinate the strangler investigation.\n\nHenry Fonda plays Bottomly who takes the task on quite reluctantly because his expertise is civil litigation. My guess is that Brooke was thinking that Bottomly would be best for the job because he came in with no preconceived notions on how to do the job and would be open to anything. Turned out he was right.\n\nActually Fonda has more screen time than Curtis because the first half of the film concentrates on him and the investigation. He follows up every red herring thrown at him. He even hires a medium paid for with private funds by a millionaire friend of Brooke's played by George Voskevec who actually comes close in terms of geography to finding the real killer.\n\nOne of the red herrings is a gay man played by Hurd Hatfield who in those days before Stonewall was considered a likely suspect. He gets turned in by his landlady who is suspicious of his reading material. It's something he's used to, every time there's a lurid sex murder as an openly gay, or at least openly gay for that time he's brought in for questioning. This was one of the few times I ever heard the word gay used in a film made before the Stonewall Rebellion of 1969.\n\nCurtis however dominates the film. The last 20 minutes or so is a final confrontation with him and Fonda and for those who are used to the insouciant leading man of swashbucklers and comedies, this is a real breakthrough. As much if not more of breakthrough than his part in Sweet Smell of Success.\n\nIn his memoirs however Curtis decries the fact that on this, the second of two films he worked with Henry Fonda on, he said that he found Fonda cold and forbidding as a person to work with.\n\nThe film is tautly directed by Richard Fleischer with some fine editing though I think Fleischer was a bit too fond of the split screen technique. Still it's a film worth watching.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M53S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi425246233",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjdlZTAxNzAtZWY2ZS00Y2FlLWFlODItYWUzZGU4ZWU1ODFjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjdlZTAxNzAtZWY2ZS00Y2FlLWFlODItYWUzZGU4ZWU1ODFjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-13T15:47:46.975Z",
        "url": "https://www.imdb.com/video/vi425246233/"
    },
    "url": "/title/tt0062755/"
}