{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Darren McGavin",
            "url": "/name/nm0569000/"
        },
        {
            "@type": "Person",
            "name": "Jo Ann Pflug",
            "url": "/name/nm0679539/"
        },
        {
            "@type": "Person",
            "name": "Simon Oakland",
            "url": "/name/nm0643000/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3686,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0033054/"
        },
        {
            "@type": "Person",
            "name": "Richard Matheson",
            "url": "/name/nm0558577/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Grant Rice",
            "url": "/name/nm1931315/"
        }
    ],
    "datePublished": "1973-01-16",
    "description": "A reporter hunts down a 144-year old alchemist who is killing women for their blood.",
    "director": [
        {
            "@type": "Person",
            "name": "Dan Curtis",
            "url": "/name/nm0193303/"
        }
    ],
    "duration": "PT1H14M",
    "genre": [
        "Crime",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzYxMTk3M2UtYzM2Zi00Zjc5LTg2NjYtN2JkYzk1MDhmMjg0XkEyXkFqcGdeQXVyMTg2NjYzOA@@._V1_.jpg",
    "keywords": "serial murder,psychotronic film,cassette tape recorder,camera,pocket watch",
    "name": "The Night Strangler",
    "original_info": {
        "id": "The Night Stalker | The Night Strangler_1973",
        "name": "The Night Stalker / The Night Strangler",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "drmality-1"
        },
        "dateCreated": "2008-05-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0069002/"
        },
        "name": "\"The killer had the rotted features of a CORPSE?!\"",
        "reviewBody": "Carl Kolchak is my favorite TV character, hands down. So yes, I am pretty biased towards anything Carl appears in. This pugnacious misfit was an anachronism even in the 1970's...he would have been much more comfortable in the wild-and-woolly journalistic days of the 20's and 30's. He's clumsy...tactless...socially inept...and completely fearless in pursuit of the truth. He gets beaten up, but never beaten down. Plus, I like his hat.\n\nFollowing the humongous success of \"The Night Stalker\", it was only natural that a sequel be commissioned. With Dan Curtis and Richard Matheson teaming up on the creative end, there were no worries that \"The Night Strangler\" would be second-rate or inferior. Even though in many ways it is a virtual remake of the first film, the sequel manages to be even eerier and more frightening, while containing many humorous touches and character bits.\n\nKicked out of Las Vegas after the Janos Skorzeny \"vampire\" debacle, Kolchak makes his way to Seattle...just in time for a rash of mysterious murders of young women to break out. The victims have had their throats crushed by a man with incredible strength and a small amount of blood has been syringed out of the base of their skulls. Obviously more than just a typical serial killer is at loose. Digging through the moldy archives of the local newspaper (with the help of Titus Berry, played by the great Wally Cox), Kolchak discovers that every 21 years since 1889, six women have been strangled during a period of 18 days. In each case, the killer was described as having superhuman strength and in some cases looking like a corpse.\n\nWhen Carl proposes the theory that the same man is responsible for all the killings going back to 1889, he gets the same response he did in Las Vegas: disbelief, silence and stonewalling. His long-suffering editor Tony Vincenzo is driven almost to a heart attack by arguments with Kolchak and pressure from the police and the powers that be.\n\nKolchak learns that the killer may be lurking in the sinister Seattle \"underground\"...the remains of the 19th century town buried beneath the modern metropolis. With the help of a sexy belly dancer (cute Jo Ann Pflug), he plunges into the underground in search of the seemingly immortal maniac. The only question is: what will he do when he finds him? The villain in \"The Night Strangler\" is more interesting to me than the bestial Janos Skorzeny. He is more ghoulish because of his rotted features (depicted in a grisly police sketch) and yet more intellectual, because he is able to speak and articulate his mad reasoning. The scene where Dr. Richard Malcolm, the Night Strangler, converses easily with the mummified remains of his dead family sitting at a cobwebbed dinner table, communicates how utterly insane this genius has become. Richard Anderson, soon to play Oscar Goldman in \"The Six Million Dollar Man\", gives a chilling performance in his relatively brief scene as Malcolm.\n\nAs was typical for all Kolchak vehicles, the movie is full of well-known character actors. It's a joy to watch these old pro's in action. Scott Brady is the belligerent police Captain Shubert, cadaverous John Carradine is the publisher of Kolchak's paper, Al Lewis is a drunken bum lurking in the Seattle underground, and, best of all, the Wicked Witch of the West herself, Margaret Hamilton, is a stern college professor who gives Carl information on alchemy and immortality. She has the movie's best line. When Carl asks if everlasting youth was possible, the professor replies \"If it was, I'd be an 80 year old sexpot.\" The scenes in underground Seattle are terrifically spooky and the sequence where the killer bursts through a glass window to get to a victim had me jumping out of my chair. The mixture of humor and horror was never done better than in the Kolchak stories.\n\nYes, the story is very familiar and yes, the shouting between characters gets a little overdone, but \"The Night Strangler\" is nothing but pure entertainment. Check it out and discover why Carl Kolchak is one of the greatest characters ever to appear on TV.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0069002/"
}