{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Frederick Weller",
            "url": "/name/nm0919867/"
        },
        {
            "@type": "Person",
            "name": "Matt Letscher",
            "url": "/name/nm0504762/"
        },
        {
            "@type": "Person",
            "name": "Nick Stabile",
            "url": "/name/nm0820903/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 742,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074221/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091980/"
        }
    ],
    "datePublished": "2000-02-27",
    "description": "TV miniseries about the rise of The Beach Boys.",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWIwZDQ5NjEtZDA1MS00ZWNiLTg5NjktMDY4NTY4M2E4MmVmXkEyXkFqcGdeQXVyNjExODE1MDc@._V1_.jpg",
    "keywords": "country in title,drug abuse,music band,rock band,recording studio",
    "name": "The Beach Boys: An American Family",
    "original_info": {
        "id": "The Beach Boys: Endless Harmony_2000",
        "name": "The Beach Boys: Endless Harmony",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2012-09-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0238064/"
        },
        "name": "Impressive Movie on the Legendary Band",
        "reviewBody": "The Beach Boys: An American Family (2000) \n\n*** 1/2 (out of 4) \n\nEpic telling of the rise and downfall of The Beach Boys who rose to the top of the charts before members started doing their own things including various stints with drugs. The movie follows the band as they try to come up with new songs while Brian Wilson (Frederick Weller) begins to experiment and try a different style of music. THE BEACH BOYS: AN American FAMILY clocks in just under three hours and it covers a very short period but I guess that's what is so amazing about this band. It's rather incredible to think of how many great songs they recorded in such a limited amount of time. As with most bio pics, there are certainly things changed for dramatic purposes but for the most part I think fans are going to be happy with what the producers have done here. This was originally aired over a two night period with each episode clocking in at two hours. The first portion basically covers the rise of the group and ends just as the bands are starting to face new pressures. The second portion follows with how the band members started to go their own ways, experimenting with drugs and looks closer at the abuse the band was taking from their manager Murry Wilson (Kevin Dunn). The film features some incredibly good performances including Dunn as the rather villainous father who pretty much did whatever he could to get even, in a bad way with his kids. Weller is also quite memorable as Wilson, although he unintentionally reminded me of the Jeff Daniels character from DUMB AND DUMBER during the breakdown scenes at the end. Alley Mills (Audree Wilson), Nick Stabile (Dennis Wilson) and Matt Letscher (Mike Love) are also very memorable in their parts. A major plus going for the film are all the great tunes from the band, heard in their original versions. The film does start to feel a bit long towards the end and I think the downfall of the band took a bit too much time and I think some of the material could have been trimmed down some (especially the Charles Manson stuff). Still, fans of the group should really enjoy this film."
    },
    "url": "/title/tt0238064/"
}