{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gillian Anderson",
            "url": "/name/nm0000096/"
        },
        {
            "@type": "Person",
            "name": "Dan Aykroyd",
            "url": "/name/nm0000101/"
        },
        {
            "@type": "Person",
            "name": "Eleanor Bron",
            "url": "/name/nm0111376/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7742,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065651/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103414/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103757/"
        },
        {
            "@type": "Person",
            "name": "Edith Wharton",
            "url": "/name/nm0923585/"
        },
        {
            "@type": "Person",
            "name": "Terence Davies",
            "url": "/name/nm0203993/"
        }
    ],
    "datePublished": "2000-10-13",
    "description": "A woman risks losing her chance of happiness with the only man she has ever loved.",
    "director": [
        {
            "@type": "Person",
            "name": "Terence Davies",
            "url": "/name/nm0203993/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Romance",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTk4NWFjOWEtNDdiZC00N2IyLWIwZTYtZDU2YTNlOTFmOWNjXkEyXkFqcGdeQXVyMTk3NDAwMzI@._V1_.jpg",
    "keywords": "period drama,drug,1890s,love,reputation",
    "name": "The House of Mirth",
    "original_info": {
        "id": "The House of Mirth_2000",
        "name": "The House of Mirth",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JamesHitchcock"
        },
        "dateCreated": "2010-12-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0200720/"
        },
        "name": "The heart of fools is in the house of mirth",
        "reviewBody": "\"The House of Mirth\" is that rare thing, a British film about America. Officially it is an international co-production, but it was not only made by a British director, Terence Davies, but also shot on location in Britain, even though most of the action is supposed to take place in and around New York. (As a keen birdwatcher I have to say that I could tell that it had been shot on this side of the Atlantic from some of the typically European birdsong in the background). It is, in fact, a good example of the sort of costume drama at which the British film industry has traditionally excelled, although there have been some notable American examples such as Scorsese's \"The Age of Innocence\", also based upon a novel by Edith Wharton.\n\nThe action takes place in 1905. At the opening of the film its heroine, the socialite Lily Bart, appears to be living a charmed life. She is young, beautiful and the niece of the wealthy Mrs Julia Peniston. Yet her position is more precarious than she realises and the film traces her downfall from wealth into poverty and from respectability into social disgrace. The title is deeply ironic; this is a tragedy, not a comedy, and there is nothing about Lily's position that might arouse mirth. Wharton took her title from the Biblical book of Ecclesiastes: \"The heart of the wise is in the house of mourning; but the heart of fools is in the house of mirth\".\n\nThe implication of this title is that those who live merely for mirth or pleasure are foolish, and certainly Lily's downfall is partly the result of her own folly; she incurs, for example, large gambling debts which she is unable to meet. Yet it is also partly the result of the hypocrisy of American high society in the early years of the twentieth century. Although some Americans tried to pretend that theirs was a classless society, the ultra-rich of New York could be just as ruthlessly snobbish as their counterparts in London, Paris or Berlin, and just as ruthlessly unforgiving of those who fell foul of society's unwritten rules. Lily's reputation is damaged not only by her gambling habit, which alienates her puritanically religious aunt, but also by an untrue allegation of an affair with a married man. (The allegation is made by the man's wife, who wants to distract attention from her own adultery). At times Lily's own good nature works against her; she has the opportunity to revenge herself on the woman who has unjustly accused her, but refuses to take it because to do so would also compromise Lawrence Selden, the man she loves.\n\nThe star of the film is Gillian Anderson, which surprised me when I first saw it in the cinema as I had previously only though of her as \"that bird from the X-Files\" or the girl who, a few years earlier, had been voted \"Most Beautiful Woman in the World\" by the readers of FHM magazine. (This aroused some ungallant comments from members of the anti-redhead brigade, who opined that Gillian had only won the title because readers had confused her with her namesake Pamela). \"The House of Mirth\", however, proved two things. Firstly, it proved that Gillian was a much more versatile actress than I had hitherto supposed. Secondly, it proved (to my satisfaction at least) that she was far more ravishingly beautiful than Pamela Anderson ever knew how to be. Her Lily Bart is one of the great tragic heroines of modern cinema; I was reminded of Nastassia Kinski's performance in \"Tess\", another period drama about a beautiful young woman who struggles vainly to escape a cruel and inexorable fate.\n\nThere are other good performances from Laura Linney as Lily's accuser, the spiteful Bertha Dorset, from Dan Aykroyd (an actor I more normally associate with comedy) as the financier Gus Trenor who unsuccessfully attempts to seduce Lily, Jodhi May as Lily's quiet but scheming and hypocritical cousin Grace Stepney, who eventually inherits Mrs Penistone's fortune and Eric Stoltz as Selden.\n\nLike many British period dramas, the film is beautifully photographed and makes use of some sumptuous sets and costumes. My one criticism would be that, in the early scenes it moves too slowly, but the pace gradually quickens as Lily's tragic drama is played out to its climax; the ending is particularly moving. This is one of the finest period dramas of recent years. A film to savour. 9/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Sony Pictures Classics",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2106458393",
        "name": "The House of Mirth",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODYzZDFkZDItYWU4Zi00MGRkLThjNTItZWQ2Y2JlNzQxMzJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODYzZDFkZDItYWU4Zi00MGRkLThjNTItZWQ2Y2JlNzQxMzJjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:28:42Z",
        "url": "https://www.imdb.com/video/vi2106458393/"
    },
    "url": "/title/tt0200720/"
}