{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Goldblum",
            "url": "/name/nm0000156/"
        },
        {
            "@type": "Person",
            "name": "Julianne Moore",
            "url": "/name/nm0000194/"
        },
        {
            "@type": "Person",
            "name": "Pete Postlethwaite",
            "url": "/name/nm0000592/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 425819,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009119/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0437457/"
        },
        {
            "@type": "Person",
            "name": "Michael Crichton",
            "url": "/name/nm0000341/"
        },
        {
            "@type": "Person",
            "name": "David Koepp",
            "url": "/name/nm0462895/"
        }
    ],
    "datePublished": "1997-05-23",
    "description": "A research team is sent to the Jurassic Park Site B island to study the dinosaurs there, while an InGen team approaches with another agenda.",
    "director": [
        {
            "@type": "Person",
            "name": "Steven Spielberg",
            "url": "/name/nm0000229/"
        }
    ],
    "duration": "PT2H9M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDFlMmM4Y2QtNDg1ZS00MWVlLTlmODgtZDdhYjY5YjdhN2M0XkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1_.jpg",
    "keywords": "dinosaur,jurassic park,tyrannosaurus rex,velociraptor,costa rica",
    "name": "The Lost World: Jurassic Park",
    "original_info": {
        "id": "The Lost World: Jurassic Park_1997",
        "name": "The Lost World: Jurassic Park",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "condillon"
        },
        "dateCreated": "2015-06-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0119567/"
        },
        "name": "An Underrated Sequel",
        "reviewBody": "The Lost World: Jurassic Park continues the story of John Hammond as he summons chaos theorist Ian Malcolm to his home with some startling information, while nearly everything at his Jurassic Park had been destroyed, his engineers happened to have a second site, where other dinosaurs were kept in hiding. It seems the dinosaurs on the second island are alive and well and even breeding; and Hammond wants Malcolm to observe and document the reptiles before Hammond's financiers can get to them. Still directed by Steven Spielberg, we are brought a sequel to one of the most iconic films on the 90's, this sequel still brings the fun, humor and as much as you expect, more Dinosaurs. We are still brought the glimmering sight of the animatronics dinosaurs and some CGI ones as well, but Spielberg really took the time to make these reptilians so fundamental and pure. Besides the dinosaurs, Jeff Goldblum is another extravagant aspect of this film, he makes the film so jocular with his corny charisma, he really was the standing point for me in this. The film I will say does suffer from some pretty cringeworthy moments from some nonsensical dialogue and scenes that will make you sigh from incredulity. One reason I'm really grateful with this film is that we get to know more about the characters we come to know and love from the first film, I just love knowing more about characters that come to grow on you and just have a pleasure participating with there time. The action in this really dominates, it makes the storyline shift more to a side of the film that makes it more compelling than you think it'll be, it gives more fun to a story that you wouldn't expect to variate. Even though there isn't much strong tense moments, there are occasions where it can get pretty nerve racking, from malicious destruction from rapid creatures to violent beings, there is still a lot of excitement to take from and have fun with but at least it isn't dispiriting. Overall, The Lost World may not be as perfect as its predecessor but it's still one of the most fun sequels that we have been given in such a long time. We are still brought corny aspects, Jeff Goldblum, Dinosaurs, humor & even amusing action. TLW certainly delivers another roaring experience!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "On this IMDbrief, we take a look at how the original dino crew of Jeff Goldblum, Sam Neill, and Laura Freaking Dern might fit into 'Jurassic World 3' and what the film could be about.",
        "duration": "PT3M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1839120153",
        "name": "How the Original 'Jurassic Park' Cast Fits Into the New 'Jurassic World'",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzNiMTE5ZTItZmZmMC00M2E5LWExZGYtYjAzMDZlMTM5NTkyXkEyXkFqcGdeQW1yb2Njbw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzNiMTE5ZTItZmZmMC00M2E5LWExZGYtYjAzMDZlMTM5NTkyXkEyXkFqcGdeQW1yb2Njbw@@._V1_.jpg",
        "uploadDate": "2019-09-26T00:45:48.973Z",
        "url": "https://www.imdb.com/video/vi1839120153/"
    },
    "url": "/title/tt0119567/"
}