{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mel Gibson",
            "url": "/name/nm0000154/"
        },
        {
            "@type": "Person",
            "name": "Anthony Hopkins",
            "url": "/name/nm0000164/"
        },
        {
            "@type": "Person",
            "name": "Laurence Olivier",
            "url": "/name/nm0000059/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28243,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0139625/"
        },
        {
            "@type": "Person",
            "name": "Robert Bolt",
            "url": "/name/nm0004122/"
        },
        {
            "@type": "Person",
            "name": "Richard Hough",
            "url": "/name/nm0396429/"
        },
        {
            "@type": "Person",
            "name": "Ian Mune",
            "url": "/name/nm0612786/"
        }
    ],
    "datePublished": "1984-05-04",
    "description": "Fed up with their Captain's harsh discipline, a sailing ship's crew decides to take action.",
    "director": [
        {
            "@type": "Person",
            "name": "Roger Donaldson",
            "url": "/name/nm0002044/"
        }
    ],
    "duration": "PT2H12M",
    "genre": [
        "Adventure",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTg0ZDYyMDgtMzU4My00NTVhLTg0YzAtMjU1MTAwMTQyZWU1XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "mutiny,island,sea voyage,ship's captain,naval officer",
    "name": "The Bounty",
    "original_info": {
        "id": "The Bounty_1984",
        "name": "The Bounty",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stevenwithers"
        },
        "dateCreated": "2004-03-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086993/"
        },
        "name": "A treat for fans of Naval History",
        "reviewBody": "Being a fan of British naval history, and also a fan of Anthony Hopkins, I love this film. I think it is severely under-rated. The acting (particularly by Hopkins) is superb, and the cinematography and realism are stunning.\n\nUnlike some of the previous comments for this film I think it is pretty loyal to the true historical facts of the real mutiny. Alright, there are a few minor changes to fact, but nothing that radically alters the story. Basically Bligh was a very able and fair captain, who was let down by incompetent officers. Bligh was no more a monster than any other Royal Navy captains, the difference was other Royal Navy Captains had able commissioned officers and a squad of marines to back up their authority. Bligh was on his own, because the admiralty insisted on saving money on the bread-fruit expedition by giving Bligh a small ship and no officers. (All the officers on board were non-commissioned warrant officers, who were not employed by the Royal Navy but were in it for their own advancement, Blight was the only Royal Navy officer). This is what ultimately led to the mutiny. Bligh had no one he could rely on to back up his orders from the Admiralty. Bligh was actually an exponent of modern thinking, and treated his men with much more humanity than other Royal Navy Captains. He had learnt his trade from sailing under Captain Cook.\n\nI think Hopkins manages to capture this in his performance. Bligh was a professional man, who grew increasingly frustrated by the incompetence and laziness of his officers. Hopkins manages to convey this sense of increasing irritation brilliantly. He felt particularly let down by Fletcher Christian, who was his friend and whom he had personally advanced up the ranks. He expected Fletcher to back up his orders, but Fletcher was more interested in his own pleasure with the Tahitian women.\n\nOn the journey out the crew were actually very happy and contented, but the trouble began when the crew began to experience the liberties and freedoms of Tahitian life, and they did not want to leave it. Bligh had to force the men to go back to their duty, and instead of having officers to back him up, the officers took the side of the men.\n\nI think the script of this film captures the true story quite well. I saw the Clark Gable version of the story many years ago, and the only thing I remember is the portrayal of Bligh as an irrational monster, with none of the reasons behind his anger explained. In this version I feel Hopkins is more like the real Bligh. An able commander trying to carry out his orders, but let down by those around him.\n\nThe confrontation between Bligh and Christian in the captain's cabin the day before the mutiny is one of my favourite movie scenes of all time. Hopkins performance of the captain at the end of his patience is just outstanding. `Oh there are rumblings are there?'. Superb! \n\nThe only down side to this film is Mel Gibson. I can't stand the sight of him! Mind you, even he manages to pull of a good performance.\n\n The film ends quite abruptly, with a lot of loose ends. The most fascinating parts of the true story come after the end of the film. I guess the time constraints of the film mean they had to concentrate on just the story of the mutiny.\n\nThe mutineers set up a colony on Pitcairn, and ended up all murdering each other until only one survived (Jack Adams). Those that stayed on Tahiti were captured two years later by HMS Pandora which had been dispatched after Bligh got back to England. This ship rounded up about 16 mutineers, and on the way home the Pandora hit a reef off Australia and sunk. The crew had to make an open boat journey to Coupang, the same port that Bligh's life boat had arrived at two years earlier!! \n\nMeanwhile Bligh was promoted and sent off on another Breadfruit exhibition to Tahiti, this time the Admiralty gave him commissioned officers and a squad of marines. This mission succeeded.\n\nWhen the Breadfruit plants finally reached the slave colonies in the West Indies, the slaves refused to eat the fruit as they disliked the taste. That's irony for you!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Bounty",
        "duration": "PT2M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3307184921",
        "name": "The Bounty",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzRlMGNhNTctNzViMC00OWUxLWEyZjYtYTNiNTU0YjQyYTgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzRlMGNhNTctNzViMC00OWUxLWEyZjYtYTNiNTU0YjQyYTgyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-04-20T03:41:00Z",
        "url": "https://www.imdb.com/video/vi3307184921/"
    },
    "url": "/title/tt0086993/"
}