{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eun-Kyung Shin",
            "url": "/name/nm0793781/"
        },
        {
            "@type": "Person",
            "name": "Seung-Hyun Lee",
            "url": "/name/nm1030825/"
        },
        {
            "@type": "Person",
            "name": "Jin-young Jung",
            "url": "/name/nm1045685/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2357,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "alternateName": "The Ring Virus",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0069001/"
        },
        {
            "@type": "Person",
            "name": "Dong-bin Kim",
            "url": "/name/nm1013656/"
        },
        {
            "@type": "Person",
            "name": "Kôji Suzuki",
            "url": "/name/nm0840626/"
        }
    ],
    "datePublished": "1999-06-12",
    "description": "After the mysterious death of her niece and other three teenagers on the same hour and with the symptoms of heart attack, the journalist Sun-ju decides to investigate their last moments. She discloses that the four friends had jus...",
    "director": [
        {
            "@type": "Person",
            "name": "Dong-bin Kim",
            "url": "/name/nm1013656/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjBhZjUxNGMtODQ1ZC00NmQ4LWI0MGYtZWFiMTgwYmNkZmM2XkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
    "keywords": "cursed videotape,haunted videotape,mysterious videotape,curse,reporter",
    "name": "Ling",
    "original_info": {
        "id": "The Ring Virus_1999",
        "name": "The Ring Virus",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Angel_Meiru"
        },
        "dateCreated": "2004-02-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0289424/"
        },
        "name": "Best version besides the original Japanese versions",
        "reviewBody": "Damn, Koreans can make great films, just like their Japanese, Chinese and Taiwanese counterparts. \"Ring Virus\" has to be one of the greatest Korean horror films besides \"The Whispering Corridor\" series.\n\nSure it may be somewhat simple in the Special Effects department, but that usually does work the best when working with supernatural horror films. This one, as well as many Japanese horror films and an earlier Korean techno-horror film called \"Screen Sairen\", \"Ring Virus\" as well as \"Ringu\" has quite an original plot. An accursed video tape is being spread around and people who don't copy it and share it or live a lonely life, will die.And Unlike the US version of \"The Ring\", the video shown in this movie is not a typical rip-off of a Marilyn Manson music video. Instead, it seems to start off with being rather kind and innocent, yet abstract looking, which makes things much more terrifying. \n\nThe settings of the film are quite excellent. The scenes filmed on the Cheju Island, is quite lush looking and beautiful, I started to wish I was on the Korean islands.Heck, I just wanna go over to South Korea, PERIOD!\n\n If you can find this film, please get it. I know it is hard to find, but it is worth it, much more than the US version.\n\nPS, Du-na Bae, the young adult actress who plays Eun-suh, is quite creppy looking, as well as gorgeous!"
    },
    "url": "/title/tt0289424/"
}