{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Griffith",
            "url": "/name/nm0341431/"
        },
        {
            "@type": "Person",
            "name": "Ron Howard",
            "url": "/name/nm0000165/"
        },
        {
            "@type": "Person",
            "name": "Don Knotts",
            "url": "/name/nm0461455/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15702,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070627/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0241671/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023808/"
        },
        {
            "@type": "Person",
            "name": "Sheldon Leonard",
            "url": "/name/nm0502766/"
        },
        {
            "@type": "Person",
            "name": "Aaron Ruben",
            "url": "/name/nm0747826/"
        },
        {
            "@type": "Person",
            "name": "Danny Thomas",
            "url": "/name/nm0858683/"
        }
    ],
    "datePublished": "1960-10-03",
    "description": "Widower Sheriff Andy Taylor, and his son Opie, live with Andy's Aunt Bee in Mayberry, North Carolina. With virtually no crimes to solve, most of Andy's time is spent philosophizing and calming down his cousin Deputy Barney Fife.",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzU4OTU2MDAxM15BMl5BanBnXkFtZTcwMzI4MjQ0MQ@@._V1_.jpg",
    "keywords": "1960s,widower,sheriff,unseen character,town drunk",
    "name": "The Andy Griffith Show",
    "original_info": {
        "id": "The Best of the Andy Griffith Show_1997",
        "name": "The Best of the Andy Griffith Show",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "raysond"
        },
        "dateCreated": "2000-06-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053479/"
        },
        "name": "One of the most heartwarming sitcoms of all time. Commemorating \"Andy\" on it's 55th anniversary",
        "reviewBody": "In celebration of the show's anniversary this was one of the most endearing sitcoms in television history for the eight seasons that it ran on CBS. The basis came from an episode of \"Make Room For Daddy\",aka \"The Danny Thomas Show\" titled \"Danny In Mayberry\"(Season 7,Episode 20) that originally aired on February 15, 1960. On the strength of that episode which was a bonafide hit the producers Sheldon Leonard along with Danny Thomas and Ronald Jacobs(who served as executive producers)gave the greenlight for this series which was placed on CBS' Monday night prime-time schedule producing a total of 249 episodes that ran from October 3, 1960 until the final episode of the series on April 1, 1968. Out of the 249 episodes,only 159(Seasons 1 thru 5)were in black and white from October 3, 1960 until May 3, 1965. Seasons 6 thru 8 produced 90 episodes in color from September 13, 1965 until April 1, 1968. Only Danny Thomas, Sheldon Leonard, Ronald Jacobs and Aaron Ruben were the producers from Seasons 1 thru 5. Bob Ross was the producer for Seasons 6 thru 8. The show launched two spin-offs \"Gomer Pyle,USMC\" (1964-1969),and \"Mayberry RFD\"(1968-1971). Throughout its eight-year run the show won six Emmys and was nominated for 8 Emmys including Best Comedy Series. Between 1961,1962,1963,1966 and 1967 actor Don Knotts won back-to-back Emmys for Outstanding Performance in a Supported Role for Prime-Time as Deputy Barney Fife for the episodes \"The Return of Barney Fife\"(Season 6, Episode 17-airdate January 10, 1966),and for the episode \"Barney Comes To Mayberry\"(Season 7, Episode 19-airdate January 23, 1967). Actress Frances Bavier(Aunt Bee) won the Emmy in 1966 for Best Supporting Actress for Outstanding Role in a Prime Time Series. The show's sponsors throughout it's run were The General Foods Corporation and the Ford Motor Company. The Chrysler Corporation sponsored its final season.\n\nThe Andy Griffith Show was just that: the sheriff with a heart of gold and a big smile to match along bringing the moral values and lessons that you see in today's shows of this magnitude or any other,and it still holds up to this day. What really made that show what it is brings up to the great writing and storytelling,combining that with good ole North Carolina humor along with country comedy and add just a touch of Southern Gothic for a good measure. What really made that show hum like a fine motor for the first five seasons was the feisty spit and polish and by the book lawman deputy Barney Fife played with great precision and timing by Don Knotts who won five emmys for his work on that series. What really brought that show out was the father and son relationship of Sheriff Taylor and his son Opie(played by Ron Howard). Andy taught Opie valuable lessons on character and important values and morals as well as development of him from a boy into manhood. The characters that really brought that show out were certain individuals the gave Sheriff Taylor major fits(and Barney as well)like Goober,his cousin Gomer,and the nuttiest of them all: Ernest T. Bass,as well as Otis the town drunkard. After Knotts left the show to pursue other interests in 1965,the show wasn't the same as it was,but it never gave up on interest on the situations that went on in Mayberry. The black and white episodes were simply the greatest ever with Knotts in them,but kinda changed course when the show went to color. One of my all time best ever. Interesting Note on Andy Griffith: When the show left the airwaves on April 1, 1968 on the CBS network,it was the #1 show on television. *Commentary revised on December 10, 2015 in collaboration with the show's golden anniversary.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Ballad of Andy and Barney - MeTV promo for",
        "duration": "PT34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi481018137",
        "name": "The Andy Griffith Show - MeTV",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzA2NDM1YTEtOTViZS00MTlmLTliMDAtZTI4ODU4Y2M5NzNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzA2NDM1YTEtOTViZS00MTlmLTliMDAtZTI4ODU4Y2M5NzNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-09-22T15:20:36.053Z",
        "url": "https://www.imdb.com/video/vi481018137/"
    },
    "url": "/title/tt0053479/"
}