{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fatemeh Cherag Akhar",
            "url": "/name/nm0015242/"
        },
        {
            "@type": "Person",
            "name": "Hassan Nebhan",
            "url": "/name/nm0623879/"
        },
        {
            "@type": "Person",
            "name": "Shahr Banou Sisizadeh",
            "url": "/name/nm0803006/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1902,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "The Day I Became a Woman",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0198879/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057621/"
        },
        {
            "@type": "Person",
            "name": "Marzieh Makhmalbaf",
            "url": "/name/nm0581863/"
        },
        {
            "@type": "Person",
            "name": "Mohsen Makhmalbaf",
            "url": "/name/nm0538532/"
        }
    ],
    "datePublished": "2001-03-08",
    "description": "A film comprised of three interconnected vignettes that depict women at three stages of life in Iran. The first part centers on a young girl on her ninth birthday who is told that she can no longer play with the boys she had been ...",
    "director": [
        {
            "@type": "Person",
            "name": "Marzieh Makhmalbaf",
            "url": "/name/nm0581863/"
        }
    ],
    "duration": "PT1H14M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTM5NDA0NzU5Nl5BMl5BanBnXkFtZTcwNjM4NzAzMQ@@._V1_.jpg",
    "keywords": "feminist film,vignette,satire comedy,girl,boy",
    "name": "Roozi ke zan shodam",
    "original_info": {
        "id": "The Day I Became a Woman_2000",
        "name": "The Day I Became a Woman",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dilip"
        },
        "dateCreated": "2001-05-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0260332/"
        },
        "name": "Camera as innocent child-like spectator in a film with subtle but strong acting",
        "reviewBody": "I saw \"Roozi khe zan shodam\" (\"The Day I Became a Woman\") a few days ago during the Memorial Day holiday. It was a good film with strong, subtle acting and quite interesting camera shots.\n\nIn a nutshell, the film is about women in contemporary Iran. It depicts compelling accounts about a girl who has just turned nine and is now therefore considered to be a woman and expected to leave childhood play behind; a woman's bicycle race and the strong objection a husband has to his wife's participation; and an elderly woman who has in earlier life deferred her desires to buy consumer goods and finally has the opportunity to realize her spending dreams.\n\nWithout having lived in or even visited Iran, I can't judge the realism of \"Roozi khe zan shodam\". The camera offers us an innocent, child-like eye, just observing these characters and leaving us to draw our own conclusions. I particularly enjoyed the cinematography of the mass of women cyclists, all clad in black practically head to foot, pedaling away almost entirely in silence except for the rhythmic pedaling noises; and the parallel shots focusing on the legs of the galloping horses, carrying the complaining husband and his cohorts. The pedaling wife Ahoo (Shabnam Tolui) never speaks a word, but her focused and desperate efforts indicate her quest for increased independence. I also enjoyed following the activities of 9-year-old Hava (Fatemeh Cherag Akhar).\n\nI would see \"Roozi khe zan shodam\" again for its cinematography and the unique (at least for Western audiences) life experiences depicted. It's by no means Hollywood fare or even overtly feminist, but allows the viewer to settle in for a bit of (realistic or stylized?) local color and look at perspectives there of women in three different stages in their lives."
    },
    "url": "/title/tt0260332/"
}