{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeffrey Gibson",
            "url": "/name/nm1591908/"
        },
        {
            "@type": "Person",
            "name": "Geshe Yeshi Chophel",
            "url": "/name/nm5218487/"
        },
        {
            "@type": "Person",
            "name": "The Dalai Lama",
            "url": "/name/nm0482730/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 217,
        "ratingValue": 8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0272159/"
        },
        {
            "@type": "Person",
            "name": "Barbara King",
            "url": "/name/nm3444304/"
        }
    ],
    "description": "For the first time, the reclusive and secretive Tibetan monks agree to discuss aspects of their philosophy and allow themselves to be filmed while performing their ancient practices.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeffrey M. Pill",
            "url": "/name/nm3442191/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODAwMDA3NTEtMjI0YS00ZWE2LWE1MzktOTVkYTMzODFjNGE0XkEyXkFqcGdeQXVyNjk0NjAwNzQ@._V1_.jpg",
    "keywords": "chinese communist,tibetan history,tradition,afterlife,refugee",
    "name": "The Yogis of Tibet",
    "original_info": {
        "id": "The Saltmen of Tibet_1997",
        "name": "The Saltmen of Tibet",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dayanakozhakhmetova"
        },
        "dateCreated": "2019-02-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1429400/"
        },
        "name": "\"It is not hard to understand why the Tibetans whose outward conditions were so severe and changeable came to look inward for a sense of permanence and peace\"",
        "reviewBody": "The above quote was narrated in the beginning of the movie, and this was the idea which I held in my mind throughout the whole movie. In my opinion, it to some extent outlines the origin of Tibetan Buddhist philosophy emergence and it's preservation as the history proceeds. Because of the harsh situations and the impermanence of life, this nation on top of the world turned inward for balance and peace. Tibetans successfully adopted Buddhist practises and beliefs, so that one sixth of the populations were in monasteries. But the most fascinating practitioners, as the narrator neatly noted, were yogis. These yogis do not associate with the common stereotypical Hindu yogis, and constitute the spiritual dimensions of Buddhist life. A yogi of Tibet is a person who has spent many years in retreat, performing secret exercises and meditations to transform the mental and physical aspects of his being, and through these techniques has achieved incredible control over his mind and body. The terrible injustice has to be experienced by the history of Tibetans, and how a people who is happy and peaceful in society can lose all at once. Death, power, justice, unhappiness and deprivation, poverty, patience are only one of the few aspects that are highlighted in this story, which show the vicissitudes of the material world and souls. As a person who, after watching, became interested in Yogis' life, I want to say that life of yogis is an example of courage and zeal. Otherwise, the film is rather hard to watch, you have to concentrate and think a lot. But isn't it the best thing you can take out after watching movies, when they generate a lot of questions and a new topic for reflection? The yogis realize that Samsara and Nirvana are dependent and are relative states, thus the Cause of the Universe is the Mind, which has nothing to do with the concept of Interest, Addiction or Attachment. When the reason is directed along the path of unbelief or selfishness, it leads to Samsara, but if it is directed along the path of altruism and retreat, it will lead to Nirvana. They are absolutely convinced that the real source of Samsara and Nirvana is in the Void of the Transcendental Mind. The knowledge that Master Yogis now acquire are the fruit of their zeal, which is the main reason. After tens of years of meditation and special practices their \"inward look\" not only gives them some supernatural powers over nature, death and live, but also makes them think that losing compassion towards their enemies is the only danger that can pose to real yogi. I personally find it incredible control over mind. The yogis you see in this film took an unprecedented risk. Once they had vowed to keep their practices in the greatest mystery, they agreed to these unique interviews and the rarest filming in order to preserve their vanishing culture for future generations. After the forced departure to India due to Chinese occupation, one of the biggest losses of the people of Tibet is the gradual loss of the Tradition of the transfer of knowledge from the Great Teachers of Yoga to young people. That culture, which for centuries has supported these outstanding Teachers, is practically on the verge of extinction. To leave a message for people and their descendants, the producers (Phil and Jo Boraks) and director (Jeffrey M.Pill) were given permission to shoot this film, where you will see the secret practices of the Yogis, who give interviews for the first time and talk about what they rarely talk about. This deep cultural, spiritual, moral and educational film is proof of the existence of these Yogis of Tibet on Earth. The film makes you think about many things ... What is the meaning of life? Where do emotions come from and why is cruelty needed in this world? Is it possible to control what is happening to us? Why do yogis go to renunciation? How extensive are the practices that they use in terms of numbers and purposes? How does a person's consciousness change after a retreat and secret knowledge gained? I would recommend this movie for people who are interested in ontology of the mind and looking for some kind of path to the enlightenment in this life. Also for those who wants to get acquainted with the history of one of the greatest and most revered yogis, this film will do just fine. What won't you find here? Special effects, to which we are so accustomed in recent years, as well as a bright and clear picture of what is happening. Although often what you will hear and see here will seem incredible, and the fact that it is just hard to believe. But this story is based on real narratives from real people, and it can be a good guide to the world of what we are incomprehensible.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt1429400/"
}