{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dennis Hopper",
            "url": "/name/nm0000454/"
        },
        {
            "@type": "Person",
            "name": "Bruno Ganz",
            "url": "/name/nm0004486/"
        },
        {
            "@type": "Person",
            "name": "Lisa Kreuzer",
            "url": "/name/nm0471079/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17167,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "The American Friend",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0011145/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057746/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052216/"
        },
        {
            "@type": "Person",
            "name": "Patricia Highsmith",
            "url": "/name/nm0383604/"
        },
        {
            "@type": "Person",
            "name": "Wim Wenders",
            "url": "/name/nm0000694/"
        }
    ],
    "datePublished": "1977-09-28",
    "description": "Tom Ripley, who deals in forged art, suggests a picture framer he knows would make a good hit man.",
    "director": [
        {
            "@type": "Person",
            "name": "Wim Wenders",
            "url": "/name/nm0000694/"
        }
    ],
    "duration": "PT2H8M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWFlZDA1YTQtMGJjYy00OTVlLTkxODUtNTgxNWNiMTZkYmExXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "neo noir,reference to aristotle onassis,reference to jean gabin,leukemia,assassination",
    "name": "Der amerikanische Freund",
    "original_info": {
        "id": "The American Friend_1977",
        "name": "The American Friend",
        "year": "1977"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "whitecargo"
        },
        "dateCreated": "2003-11-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075675/"
        },
        "name": "long defrost time",
        "reviewBody": "The AMERICAN FRIEND\n\nThe fine German director Wim Wenders is responsible for this film. (If you dont know Wenders, you should). The setting of the film is handled well: the seaminess of the port of Hamburg Germany, comes across as one of the great film noir-type cities. It looks like an environment that is constantly wet and misty.\n\nThe movie ostensibly stars Dennis Hopper, but although he is given top billing in the movie he plays nearly a minor, background figure throughout. Clearly the most interesting performance, it is frustratingly parceled out to us in a way that makes you crave a really long scene with just him in it. But instead, his characterization happens in brief, truncated insights.\n\n Hopper is well-cast once again in one of those teetering-on-the-edge roles he excels in. He is a loose cannon in this film--you clearly see his character is unbalanced --and you just dont know what he is going to do at any given moment and that lends the film its tense aspect. But the film doesnt really focus on him. Thats the main problem with this film.\n\n Bruno Ganz (a fine Swiss actor) is the figure that the camera spends the most time on. He and Hopper and several other figures are all part of the world of art forgery and art smuggling. But Ganz's character--a painting restoration expert--is suffering secretly from a terminal blood disease. (His performance is soooo subdued it can make you antsy and annoyed, especially when you know Hopper is around somewhere).\n\nAnyway, when the other shady characters in the movie learn of Ganz's condition they play upon his weakness to manipulate him into taking risks with the gangsters they deal with. His goal is simply to provide more money for his family after he is gone. (There is a nice moral dilemma in this film: if you knew you were dying, would your moral code alter?)\n\n My emotional response to the plot: basically it evoked a sense of dread; a queasiness at the entanglements the main character is drawn into and the things he has to do--which are clearly against his better judgement. He is pushed to the limits of his moral and physical endurance. Its a tightly-focused story.\n\nThat being said, one immediately notices that the film's storyline is delivered in tiny, tattered snippets. These 'fragments' are in themselves intriguing. They are well photographed; they are sometimes laden with tension and atmosphere; and they often have taut, fused moments of acting.\n\n There is also a poetic sweetness that occurs when two seemingly unrelated elements finally merge and make sense. Therefore, you know that the director isnt just fluffing it; because tiny motifs that are broken off in the beginning of the film reappear later and complete their meaning. Its great.\n\n But overall, these slowly-delivered fragments can make one restless at times. There is too much that is unexplained; too much that we have to infer or dismiss because it simply isnt made clear. None of the characters, nor their subtle relationships to each other, are 'handed to us' outright. They are revealed in the same tiny flashes that forms the constructive style used throughout the whole movie.\n\nBottom line: a lot of the dialogue is frustratingly cryptic. I think you *could* figure out the weight behind each exchange if you went back carefully over the movie, but after a point--when the action takes over--youre left feeling that it just doesnt matter. Its as if Wenders shot long, fully drawn-out and rich scenes of dialogue but then went back and sliced it all up into little bits and pieces.\n\nIts a movie that gives one mixed reactions. Kind of hard to characterize what the sum total of this film really is. Its basically a thriller, but done in such a low, deliberately dead-pan manner; that youre left with no sense of tension. Or climax. The Hopper character's weird relationship to the main protagonist, is what really leaves an aftertaste in your mouth. Perhaps that was the intent all along.\n\nThere is a sense of calm and satisfaction at the close of the movie, but more because the chaos is over and things have settled into a peaceful arrangement. Still, I enjoyed the movie and recommend it as worth seeing.\n\n One reason that any film fan should really watch this film is the wonderful cameos by two of America's classic Hollywood directors from the 1950s: Nicholas Ray and Samuel Fuller. This is really a treat! Fuller plays a gangster and Ray plays a forger. Its the main reason I wanted to see this movie, and I am glad I did."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Extra (Clip) from Anchor Bay Entertainment",
        "duration": "PT3M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2011300121",
        "name": "Wim Wenders: An American Friend",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTcyZGVhYWItZDkwZi00Y2U2LTkxYWEtNzA0YWMzODkzMjA5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTcyZGVhYWItZDkwZi00Y2U2LTkxYWEtNzA0YWMzODkzMjA5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:08:44Z",
        "url": "https://www.imdb.com/video/vi2011300121/"
    },
    "url": "/title/tt0075675/"
}