{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nicole Kidman",
            "url": "/name/nm0000173/"
        },
        {
            "@type": "Person",
            "name": "Christopher Eccleston",
            "url": "/name/nm0001172/"
        },
        {
            "@type": "Person",
            "name": "Fionnula Flanagan",
            "url": "/name/nm0001217/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 373976,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0012382/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071552/"
        },
        {
            "@type": "Person",
            "name": "Alejandro Amenábar",
            "url": "/name/nm0024622/"
        }
    ],
    "datePublished": "2001-08-10",
    "description": "A woman who lives in her darkened old family house with her two photosensitive children becomes convinced that the home is haunted.",
    "director": [
        {
            "@type": "Person",
            "name": "Alejandro Amenábar",
            "url": "/name/nm0024622/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTAxMDE4Mzc3ODNeQTJeQWpwZ15BbWU4MDY2Mjg4MDcx._V1_.jpg",
    "keywords": "mansion,haunting,xeroderma pigmentosum,ghost,surprise ending",
    "name": "The Others",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LtCol_Kilgore"
        },
        "dateCreated": "2001-09-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0230600/"
        },
        "name": "Suspenseful, stylish horror film ***/****",
        "reviewBody": "The others ***/****\n\n \"The Others\" is a suspenseful horror film unlike many these days. Most are concerned with blood and gore, teenage girls getting naked, body count, and not scary. \"The Others\" is atmospheric, spooky, bloodless, and carried by strong acting and fleshed out characters. Yet, it takes too long to make an impact and the final payoff is not as shocking as it should be.\n\n The plot is simple and not especially innovative (your average ghost story), but it seems fresh thanks to strong acting and a well-crafted, eerie atmosphere that rivals that of a Tim Burton film. Nicole Kidman is Grace, a beautiful young married mother who must raise her two children, Anne (Alakina Mann) and Nicholas (James Bentley) alone in their gigantic (actually, ridiculously large) mansion on a British isle, around the end of WWII. They are alone, for the husband and father has been at war and has not returned, and their housekeepers mysteriously vanished. Suddenly, a trio of friendly caretakers arrive one day. Mrs. Mills (Fionnula Flanagan) is the amiable old lady, Lydia (Elaine Cassidy) is a mute young girl, and Mr. Tuttle (Eric Sykes) is the not-so-social gardener. However, there is a strange, arcane facet to the trio; they have little background and had no way of knowing that Grace was offering positions at her manor. Aside from this, Grace must deal with her children, who have a deadly allergy to light, which means that the house must be dark all the time, allowing for a spooky dark, shadowy ambience. Anna and Nicholas, most importantly, have been visited - by a family of ghosts. Noises - crying, piano music, and running - have been heard. And curtains that stop light from entering the house are opening and closing by themselves. The film is based around Grace's efforts to solve the enigma.\n\nI love the atmosphere of \"The Others,\" set in a nostalgic and ominous 1940's estate. Snowy mist blankets the grass and crisp fall leaves. Murky waters of a lake border the chateau. Elegant furniture, polished marble and wood floors, neatly-woven blankets, tautly fabricated furnishings of wood and olive green cloth, coal black German sedans, lightly wrinkled sweaters and jackets are all seemingly authentic from the era. One spectacular and tense scene has Grace haplessly stumbling through an impenetrably thick ocean of milky fog that weaves through overhanging trees and a ground of crunchy bronze and russet leaves.\n\nThe action takes a while to get started up, which is a major negative. This is due to the director, Amenabar, spending time to develop an involving plot, 3-D characters, and the aforementioned décor. While Amenabar succeeds in those respects, we find ourselves wishing something would happen. Many people will easily become bored, feel tempted to sleep or leave, etc., but I, while not exactly enthralled by that point in the film, was still enjoying it.\n\nWhen we finally are treated to doses of suspense and chills (not so much horror and terror), it is satisfying. You most likely will find yourself on the edge of your seat or huddled in a ball anxiously awaiting the potentially fatal results of Grace's investigation. This is not so much because you care about her character, but really because you expect a sudden scream and heart-stopping outburst of maniacal ghosts. Most scenes are chilling, including the door shutting in the piano room, the old lady in the white dress, and the final chaotic conclusion. However, I can not say that I was truly horrified and paranoid from this film, unlike \"The Sixth Sense,\" where I was freaked out for months. I was still very entertained.\n\nI must commend all the actors in the film, especially Nicole Kidman. The acting was down to earth and realistic, despite Nicole Kidman forced into saying some foolish lines (\"Something.. Diabolical!). The two child actors, Mann and Bentley, were excellent in a fairly difficult role for children.\n\n Another important downside to the film was the \"shocking\" conclusion. While I must admit that I found it brilliant, it lacked the powerful punch I wish it had. I don't know why this is, it just isn't. I am disappointed at how much potential the ending could have packed and how little it did.\n\n Overall, I found \"The Others\" a highly entertaining thriller with magnetic milieus and plenty of startles.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3201343001",
        "name": "The Others",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTdmYzRkOWMtNWUyYS00ZDU0LThiZjItZThkMGVkZjNiMDljXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTdmYzRkOWMtNWUyYS00ZDU0LThiZjItZThkMGVkZjNiMDljXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:55:42Z",
        "url": "https://www.imdb.com/video/vi3201343001/"
    },
    "url": "/title/tt0230600/"
}