{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Nathan Lane",
            "url": "/name/nm0001447/"
        },
        {
            "@type": "Person",
            "name": "Ernie Sabella",
            "url": "/name/nm0754676/"
        },
        {
            "@type": "Person",
            "name": "Julie Kavner",
            "url": "/name/nm0001413/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 43073,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "The Lion King 3: Hakuna Matata",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030830/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0092035/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032298/"
        },
        {
            "@type": "Person",
            "name": "Tom Rogers",
            "url": "/name/nm0737241/"
        },
        {
            "@type": "Person",
            "name": "Roger Allers",
            "url": "/name/nm0021249/"
        },
        {
            "@type": "Person",
            "name": "Irene Mecchi",
            "url": "/name/nm0575293/"
        }
    ],
    "datePublished": "2004-02-10",
    "description": "Timon the meerkat and Pumbaa the warthog retell the story of The Lion King (1994) from their own perspective.",
    "director": [
        {
            "@type": "Person",
            "name": "Bradley Raymond",
            "url": "/name/nm0713214/"
        }
    ],
    "duration": "PT1H17M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGZiMDQ1YTQtMGVlOC00OTJiLWFkYzMtYjdiYmY0NWM5YzVjXkEyXkFqcGdeQXVyOTg4MDk3MTQ@._V1_.jpg",
    "keywords": "breaking the fourth wall,hugging,pumbaa character,timon character,furry",
    "name": "The Lion King 1½",
    "original_info": {
        "id": "The Lion King 1 1|2_2004",
        "name": "The Lion King 1 1/2",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bnl771"
        },
        "dateCreated": "2004-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0318403/"
        },
        "name": "One Evening's Entertainment (Max)",
        "reviewBody": "As far as Disney sequels go, The Lion King 1 ½ is definitely above average. It works as often as it does (which is still only about equal to as much as it doesn't work) mainly due to its simple premise. In true Mystery Science Theater 3000 fashion, we see Timon (voice by Nathan Lane) and Pumbaa rewind the tale of The Lion King to a point before the familiar story. What begins is the tale of Timon, a troubled meerkat. Timon is somewhat of an outcast, the member of the colony who can never seem to do anything right. The only two allies he has in the troupe are his mother (Julie Kavner, The Simpsons) and his Uncle Max (Jerry Stiller, Seinfeld). Concerned with safety and a need to hide from the vicious hyenas, the meerkats must constantly dig and hide in order to survive. Timon, however, dreams of a world beyond the fear. After a cataclysmic mistake during lookout duty, Timon decides to leave his past behind and journey to find a new home.\n\nAs Timon sets out, he meets up with the existential primate Rafiki. In one of the truly funny scenes, Rafiki tells Timon to `Look beyond what you can see'. Unfortunately, Timon (not too bright) takes things a bit too literally and begins actually looking for things that are farther away than what he can see. This scene also provides the origins of Hakuna Matata; it is what Timon is searching for and must find to finally be satisfied. It is on this quest he meets the gaseous Pumbaa and a friendship is born.\n\n Timon and Pumbaa search for their Hakuna Matata and it is on this journey that the movie works best. Their story is intertwined with the original The Lion King tale and some of the results are hilarious. Familiar sequences from the original classic are used from a different perspective and it is learned that Timon and Pumbaa were actually there all the time, doing more than we had ever given them credit for. In fact, Timon and Pumbaa seem to be the heroes of the story, a fact never touched upon in the original.\n\n When The Lion King 1 ½ works, it is quite funny. Interjected with the MST3K type commentary and full of familiar scenes with new elements, there are parts of the story that are very clever. However, in a film that runs less than an hour and twenty minutes, you would expect little downtime. Unfortunately, the story is thin and when the quick comedy sketches pass, too much time is spent waiting for the humor to shine again.\n\n The animation, for the most part, is slightly better than most Disney sequels. It is a mixture of traditional animation and computer generated elements. There is not the attention to detail and much fewer awe-inspiring sequences than in some of Disney's greater efforts of the past. The original cast is all here and they slip back into their characters with ease. The new characters are played well, though without much range (Timon's mom is a slightly less raspy Marge Simpson). The new musical numbers benefited greatly from the return of Elton John and Tim Rice and were actually quite fun.\n\nI hold little hope that Disney will be able to recreate the magic of some of its most brilliant classics. The Lion King is not only a outstanding animated kid's film, but one of the best movies ever made. Sequels seem to be inevitable these days with the studio and most of them are abysmal. The Lion King 1 ½ is not a horrible movie. In fact, it is quite fun to watch once. Kids will enjoy the constant low-brow humor and there is enough `wink wink' jokes for the adults that this is a fine family rental."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Clip: Saying Goodnight",
        "duration": "PT47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2037358873",
        "name": "The Lion King 1 1/2: Special Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2Y1YjlmMjItNjBiOC00YzIyLTkwYzAtZDI3MDM2N2M2MDliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2Y1YjlmMjItNjBiOC00YzIyLTkwYzAtZDI3MDM2N2M2MDliXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-03-07T06:34:21Z",
        "url": "https://www.imdb.com/video/vi2037358873/"
    },
    "url": "/title/tt0318403/"
}