{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Julianna Margulies",
            "url": "/name/nm0000523/"
        },
        {
            "@type": "Person",
            "name": "Chris Noth",
            "url": "/name/nm0636562/"
        },
        {
            "@type": "Person",
            "name": "Josh Charles",
            "url": "/name/nm0001038/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 78016,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074212/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0286028/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0286157/"
        },
        {
            "@type": "Person",
            "name": "Michelle King",
            "url": "/name/nm0455080/"
        },
        {
            "@type": "Person",
            "name": "Robert King",
            "url": "/name/nm0455207/"
        }
    ],
    "datePublished": "2009-09-22",
    "description": "Alicia Florrick has been a good wife to her husband, a former state's attorney. After a very humiliating sex and corruption scandal, he is behind bars. She must now provide for her family and returns to work as a litigator in a la...",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2OTk4MDk3OF5BMl5BanBnXkFtZTcwMTY3NTc3Mg@@._V1_.jpg",
    "keywords": "female protagonist,law firm,corruption,courtroom,chicago illinois",
    "name": "The Good Wife",
    "original_info": {
        "id": "The Good Wife_1987",
        "name": "The Good Wife",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Songmaker23"
        },
        "dateCreated": "2009-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1442462/"
        },
        "name": "Best New Drama of the 2009 Season! \"Fellow Men\" take note: This is NOT your standard \"woman scorned\"",
        "reviewBody": "This wonderful new series, takes what I felt was a dubious premise, and instantly turns it into entertainment gold.\n\nI'd never liked \"ER\", though Margulies has formidable talent. Given the right character, script & director, I felt certain she could deliver. In The Good Wife she does. Her distinctive ability lies in nuance, & here she is finally given the perfect vehicle.\n\nThe scripts as well as the entire cast, take directions you'd never expect. That's is the real appeal of the show. Archie Panjabi is a spiffy surprise as the \"investigative assistant\", if you will. She approaches her character as if she's the entire supporting cast of \"Shark\", (James Woods 2-season crime drama) rolled into one easy-on-the-eyes, package. She's tough, loyal, funny, & adds to the show's depth.\n\nKudo's also, to veteran Christine Baranski for playing her \"been-everywhere...done everything\" role in a fresh way she seldom has in recent years. \n\nI watched the first episode with my wife.. (ok, FOR my wife) not expecting much at all. Boy, was I surprised. Subsequent episodes have been exponentially better, richer, & have demonstrated that THIS show simply refuses to go down already beaten paths. I really love that! I have yet to be able to predict anything at the beginning of an episode, as I can with just about any other major network drama. This show is a TV page turner...\n\nTGW is at once touching, topical, intriguing, even funny. Example: The courtroom judges are not your \"standard-TV-crime-show-judges\". They always prove to be yet another surprising element this show takes advantage of. In my opinion, this is the show's greatest strength. There ARE obvious choices at every turn in the story lines, the characters, even directorial choices, but NONE are ever followed. Prepare to be entertained and surprised.\n\nRare in this era of formulaic crime dramas... formulaic everything on TV, \"The Good Wife\" deceives slightly, even in it's title, which almost caused me not to watch what I figured was going to be \"chick-flick-TV\". Males take note. This is simply a great show & will not disappoint.\n\nEverything in it is fresh, imminently watchable, & the result of great creative effort to not be just another law-oriented drama. IMHO, this really IS \"Must See TV\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Watch scenes from the final episodes of season three of \"The Good Wife.\"",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3640238105",
        "name": "Season Finale Preview ",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzA4MjAwNzgyMV5BMl5BanBnXkFtZTcwNzk1ODI2Nw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzA4MjAwNzgyMV5BMl5BanBnXkFtZTcwNzk1ODI2Nw@@._V1_.jpg",
        "uploadDate": "2012-04-03T19:16:50Z",
        "url": "https://www.imdb.com/video/vi3640238105/"
    },
    "url": "/title/tt1442462/"
}