{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        },
        {
            "@type": "Person",
            "name": "Graham Dorrington",
            "url": "/name/nm2306393/"
        },
        {
            "@type": "Person",
            "name": "Dieter Plage",
            "url": "/name/nm2344775/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4815,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0141377/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0151935/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0052417/"
        },
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        },
        {
            "@type": "Person",
            "name": "Rudolph Herzog",
            "url": "/name/nm0381328/"
        },
        {
            "@type": "Person",
            "name": "Annette Scheurich",
            "url": "/name/nm1780228/"
        }
    ],
    "datePublished": "2005-03-10",
    "description": "About the daring adventure of exploring rain forest canopy with a novel flying device-the Jungle Airship. Airship engineer Dr. Graham Dorrington embarks on a trip to the giant Kaieteur Falls in the heart of Guyana, hoping to fly h...",
    "director": [
        {
            "@type": "Person",
            "name": "Werner Herzog",
            "url": "/name/nm0001348/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUyNTg5ODY4NF5BMl5BanBnXkFtZTcwMTUwMDEzMQ@@._V1_.jpg",
    "keywords": "airship,expedition,canopy,rainforest,jungle",
    "name": "The White Diamond",
    "original_info": {
        "id": "The White Diamond_2004",
        "name": "The White Diamond",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2005-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0435776/"
        },
        "name": "Engaging and enjoyable despite the delivery problems associated with the people and the fact that the whole project feels like a pointless work of vanity",
        "reviewBody": "At one point in the development of air travel, the zeppelin was seen as the future. However after the Hindenburg disaster its days were essentially numbered although, decades later, London University lecturer Dr Dorrington has always had a dream of producing a small zeppelin to glide over the unexplored tree tops of a South American jungle. A previous attempt left a nature cinematographer dead so Dorrington is nervous about this next project and the responsibility he feels he has. As he reaches the endgame of his project he is joined Having only seen a couple of Herzog films I cannot refuge the comments of other reviewers that have said this is poor by his standards but for me I found it mostly very interesting. We only share a few scenes with Dorrington outside of the jungle and it is to the benefit of the film because it allows it to bring in things other than just his personality and his mission. So we look at some of the legends in the jungle and get to know some of the locals  specifically Mark Anthony who is funny and interesting, even if Herzog goes a bit far in painting him as some sort of great man to be learnt from. The main focus is still interesting, although I personally struggled to see the value in it, it was still engaging to watch it all come together and fall apart at different times.\n\nAt times the delivery by the individuals is a problem. Dorrington is a normal, driven person when he is not talking to camera but when he addresses the camera directly he suddenly turns into a sort of pre-school teacher. Given that he is a university lecturer I was surprised by the way he spoke in childish terms and strengthened his point by widening his eyes and making noises  at any point I expected him to take me through the square window. Herzog is OK but he did come off a bit pretentious at times. The best example of this is when he gets a really good shot through a water droplet on a leaf that shows the waterfall perfectly; it is a beautiful shot and is ruined by him asking Marc if he can \"see the whole universe if that droplet\". Fortunately the film keeps these \"gems\" to a minimum and mostly it is very engaging  the one take where Dorrington described the accident that happened a decade before is horribly enthralling.\n\nThe film looks good  someone else describing it as being home movie standard just doesn't know what he is talking about. I would have liked a lot more inspiring footage but there are still some excellently captured views and the sight of this perfect \"white diamond\" floating in the sky is a pleasing contrast to the rich greens and blues of the jungle. Overall an interesting documentary despite the delivery problems of the people, the occasional touch of pretension and the vanity value of the project and well worth seeing."
    },
    "url": "/title/tt0435776/"
}