{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Daniel J. Travanti",
            "url": "/name/nm0871240/"
        },
        {
            "@type": "Person",
            "name": "Lynette Davies",
            "url": "/name/nm0203827/"
        },
        {
            "@type": "Person",
            "name": "Siân MacLean",
            "url": "/name/nm0533819/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 113,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103686/"
        },
        {
            "@type": "Person",
            "name": "Paul Matthews",
            "url": "/name/nm0560135/"
        }
    ],
    "description": "Sixteen year old Gwen Davies adores the horses she and her grandfather have raised on the beautiful Welsh Mountains. However, when her grandfather dies her uncle must either sell the farm to a greedy land developer, or allow Gwen ...",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Edwards",
            "url": "/name/nm0250274/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmYyOWI3NTMtMmEwNy00MjllLWFjYmItMzFlNzM5YzhlNTQ3XkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_.jpg",
    "keywords": "teenage girl,welsh,welsh pony,horse movie,equestrian",
    "name": "The Christmas Stallion",
    "original_info": {
        "id": "The Winter Stallion_1992",
        "name": "The Winter Stallion",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "richard.fuller1"
        },
        "dateCreated": "2003-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0103960/"
        },
        "name": "It could Have Been a Children's Film Festival",
        "reviewBody": "When Alan Davis (Daniel J. Travanti) returns to his Welsh home after the death of his father to take charge of the farm and his young neice, he finds much he has to contemplate with, namely his own memories and the town rich man who wants to buy the farm to open a leisure center and golf course.\n\nDaniel J. Travanti never gives the impression of a native Welsh man. He never looks out of place or showing any hint of remembrance.\n\nHands down, the scene stealers are Sian MacLean as the neice, Gwyn, and Patrick Loomer, as Davis' stepson, Cliff. Cliff conveys all the \"what am I doing here?\" feelings.\n\nSian MacLean obviously is from the country, as she handles the horses and walks around the countryside as tho she has been there.\n\n The Christmas horserace with Gwyn as an angel, racing against Father Christmas and an elf, among others, is truly a pinnacle.\n\n There will never be an animal as majestic and as beautiful as a horse, and in the end, when we see why the title is \"The Christmas Stallion\" it is quite obvious.\n\nI caught the ending of this movie one Chirstmas on TNT and saw it was filmed in Pontypridd, Glamorgan, which was where me mum was born. It would be reshown on TNT a week later and I made sure I watched it. Still have it on tape. Not a disappointment."
    },
    "url": "/title/tt0103960/"
}