{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Humphrey Bogart",
            "url": "/name/nm0000007/"
        },
        {
            "@type": "Person",
            "name": "Rod Steiger",
            "url": "/name/nm0001768/"
        },
        {
            "@type": "Person",
            "name": "Jan Sterling",
            "url": "/name/nm0012443/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8569,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Philip Yordan",
            "url": "/name/nm0948634/"
        },
        {
            "@type": "Person",
            "name": "Budd Schulberg",
            "url": "/name/nm0775977/"
        }
    ],
    "datePublished": "1956-03-31",
    "description": "An ex-sportswriter is hired by a shady fight promoter to promote his latest find, an unknown but easily exploitable rising star from Argentina.",
    "director": [
        {
            "@type": "Person",
            "name": "Mark Robson",
            "url": "/name/nm0733476/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama",
        "Film-Noir",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjRkNDZjYzUtOGMyOS00NWRmLTg4NWItMDNmYzk5NTRiNzE5XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_.jpg",
    "keywords": "new york city,boxing,sports writer,boxing champion,fight fixer",
    "name": "The Harder They Fall",
    "original_info": {
        "id": "The Harder They Fall_1956",
        "name": "The Harder They Fall",
        "year": "1956"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2006-01-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0049291/"
        },
        "name": "Ringside seat for the match",
        "reviewBody": "\"The Harder They Fall\", based on the brutally real novel by Budd Schulberg, presents us with an aspect of the boxing world that no one talked about in those days. The sport was dominated by the racket men that made tremendous profits at the expense of the young pugilists that came from poor backgrounds.\n\nMark Robson, the director, was a man that understood that underworld well. He had already directed the excellent \"Champion\", so he proved to be a natural for taking the helm of this movie. Mr. Robson, worked as an editor for Orson Welles and knew what worked in the cinema. Working with the cinematographer Burnett Guffey, a man who was one of the best in the business, Mr. Robson created a film that was a ground breaker. New York City in the fifties is the background for the story that was shot in real exteriors that added a drama to the film.\n\nThis was the last film in which Humphrey Bogart made. In fact, Mr. Bogart shows signs of the illness that would take his life after the film was completed. Humphrey Bogart's Eddie Willis is a man that clearly wants to be fair to the poor boxer, Toro, from Argentina, who is being manipulated by the bad guys under the evil Benko. This was one of the best appearances of Mr. Bogarts in the movies.\n\nThe other surprise in the film is the portrayal by Rod Steiger of the mob man that wants to use Toro for his own illegal gains. Rod Steiger stood in sharp contrast with Humphrey Bogart. Being a method actor, his technique was entirely different from the one of his co-star. Yet, when both men are seen on the same frame, one can sense two great actors doing what they did best.\n\nThe interesting cast put together for the film made it better than it could have been. Under Mark Robson's direction we see a lot of New York based actors in the background. One would have liked to see more of Jan Sterling, who plays Eddie's understanding wife Beth. Also in the cast, Nhemiah Persoff, Jack Albertson, Max Baer, Jersey Joe Walcott, Mike Lane, Carlos Montalban, make good contributions to the film.\n\nThe boxing sequences are masterfully staged by Mr. Robson, who gives us a ringside seat to watch the matches. This film shows the director at the top of his craft.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0049291/"
}