{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Om Puri",
            "url": "/name/nm0700875/"
        },
        {
            "@type": "Person",
            "name": "James Fox",
            "url": "/name/nm0289038/"
        },
        {
            "@type": "Person",
            "name": "Aasif Mandvi",
            "url": "/name/nm0541902/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 470,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055367/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0109068/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0614505/"
        },
        {
            "@type": "Person",
            "name": "V.S. Naipaul",
            "url": "/name/nm0619740/"
        },
        {
            "@type": "Person",
            "name": "Caryl Phillips",
            "url": "/name/nm0680290/"
        }
    ],
    "datePublished": "2002-03-29",
    "description": "In 1950s Trinidad, a frustrated writer supports himself as a masseur--and soon becomes a revered mystic and politico.",
    "director": [
        {
            "@type": "Person",
            "name": "Ismail Merchant",
            "url": "/name/nm0580337/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEzNDIyMjc2N15BMl5BanBnXkFtZTcwNTYwOTQyMQ@@._V1_.jpg",
    "keywords": "writer",
    "name": "The Mystic Masseur",
    "original_info": {
        "id": "The Mystic Masseur_2002",
        "name": "The Mystic Masseur",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "relias"
        },
        "dateCreated": "2003-05-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0282771/"
        },
        "name": "Film versus novel",
        "reviewBody": "A half century ago, Trinidad was an outpost of the waning British Empire and, like most British holdings, attracted immigrants from the jewel in the crown, India, who established villages on the island. Novelist V.S. Naipaul, winner of the Nobel Prize in Literature last year, grew up there. His first few novels wryly explored the comic clash between his fellow Indians and their exotic setting.\n\n Now The Mystic Masseur, his first novel (1957) , comes to the screen directed by Ismail Merchant, best known as the producer half of the Merchant Ivory filmmaking team. Naipaul published it a few years after leaving Trinidad to study at Oxford, hoping for a career as a writer. The novel, narrated by a young Trinidad Indian at Oxford, refracts elements from Naipaul's early life into a story about another islander with similar but misplaced ambitions.\n\n Ganesh Ransumair burns to make his mark in the world of letters. The trouble is, Trinidad doesn't offer much scope for a man with little learning and less talent. In his poor village on the outskirts of the colonial capital, books are so rare that a conniving shopkeeper with a marriageable daughter tries to score points with Ganesh by showing off his library, a collection of tattered paperback mysteries he's obviously never read. The daughter wins a few points, though, with her beauty and odd enthusiasm for English punctuation, of all things. A marriage is arranged and the new wife waits impatiently for her husband to finish the book that will make them rich. It turns out to be a pamphlet on Hinduism that fails to sell. Ganesh is then persuaded to try his hand as a masseur  actually, a faith healer  and once he gets the patter right and performs a few miraculous cures, he's on his way. Now the books he writes sell like hotcakes, not because Ganesh is a great author, but because he is a famous mystic. He parlays his fame among island Indians into an election victory, winning a seat on the colonial council. \n\n Caryl Phillips' screenplay starts where Naipaul's novel ends, with a young Oxford student, an Indian from Trinidad, sent to meet an island statesman named G. Ramsay Muir at the railway station. Muir turns out to be Ganesh, thoroughly Anglicized and eager to visit the dreaming spires of the university town. Phillips invents scenes of Ganesh gushing at the riches of the Bodleian Library, marveling at all the learning he was never able to acquire. In the novel, learning that Muir is the ex-masseur is a comic punch line that caps the story of a man eager to reinvent himself. Phillips' decision to start there and then backtrack to Ganesh's rise leaves the movie without an ending and skews its themes.\n\n But the movie works best where the novel also succeeds, in characters who wait impatiently while young Ganesh works out his mission in life. Chief among these is Ramlogan, the shopkeeper played by Om Puri, a veteran of Indian cinema. Wily, crass, but always polite, Ramlogan seems to smell the money this poor scholar might make. His daughter Leela (Ayesha Dharker) steals a few scenes when she wonders aloud why Ganesh isn't making any. As for Ganesh, Aasif Mandvi's performance seems driven by the plot, not the character. James Fox shows up twice in a weird cameo role as an Englishman gone native. \n\n The Mystic Masseur is wildly comic when Merchant can get Ramlogan, Leela, and Ganesh into his lens. Then the interplay between Ganesh's ambition and the more practical concerns of his wife and father-in-law get laughs. Their dialect, Indian English with a Caribbean flavor, is also fun to listen to, although hard to follow at times. But Merchant is not much of a director, with too many flat shots of characters talking in the middle distance and cutaways to show their reaction. The languid editing also deadens the pace.\n\n Coming so soon after Monsoon Wedding, a much more lively film, Mystic Masseur seems slow and unconvincing once it gets past village scenes. It aims at themes its characters never quite hit. Comedy comes from situations Ganesh finds himself in, not from the wobbly arc of his upward career. What's missing in this adaptation is the affectionate wonder of Naipaul's narrator who can laugh with but also at Ganesh but who also, in the novel, offers an implicit contrast to his ambitions. As Ganesh strives to become something more than the mystic masseur, he crashes into a theme Naipaul would develop in his later novels: the troubled identity of the exile caught between different worlds. In 1957, when Naipaul was just starting out, he could look back on Ganesh with wry affection, confident that his path would follow that of his narrator instead. A half century later, with laurels, a knighthood, and long residence in England, Naipaul himself seems to have hardened into a smarter, more successful G, Ramsay Muir."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Miramax",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi295436569",
        "name": "The Mystic Masseur",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmE5YTM4YjUtYzgzZi00ZWFmLWE1ZmUtYTk0Mjk2YmUwYWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmE5YTM4YjUtYzgzZi00ZWFmLWE1ZmUtYTk0Mjk2YmUwYWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:23:17Z",
        "url": "https://www.imdb.com/video/vi295436569/"
    },
    "url": "/title/tt0282771/"
}