{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        },
        {
            "@type": "Person",
            "name": "Todd Allen",
            "url": "/name/nm0021112/"
        },
        {
            "@type": "Person",
            "name": "Paul Bagget",
            "url": "/name/nm0046620/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14453,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0073152/"
        },
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        }
    ],
    "datePublished": "1998-02-20",
    "description": "After his happy life spins out of control, a preacher from Texas changes his name, goes to Louisiana and starts preaching on the radio.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Duvall",
            "url": "/name/nm0000380/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGRkMDZlNGUtMzVmMC00Y2UyLTg0YTYtMjAzZmQ2NmQyNjg1XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "keywords": "southern gothic,timeframe 1930s,preacher,louisiana,texas",
    "name": "The Apostle",
    "original_info": {
        "id": "The Apostle_1997",
        "name": "The Apostle",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Kerryman"
        },
        "dateCreated": "1999-01-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118632/"
        },
        "name": "Amen!",
        "reviewBody": "The Apostle is a gripping film on a most unpromising subject matter. The film has none of the obvious flash of movies such as Elmer Gantry and The Rainmaker which covered some of the same territory. The Apostle is based on straightforward storytelling, great character development and nice, gentle pacing - but with a strong kick.\n\nRobert Duvall, one of the best actors of the last thirty years, gives a powerful performance as the preacher driven by his inner demons - and gods. Over the years, we've seen preachers played by actors ranging from Burt Lancaster to Steve Martin but Robert Duvall comes up with a truly individual and original interpretation. What makes the character Sonny stand out is that he is so real! Ranging from his most charismatic (doing a Joe Dolan impersonation?) to his most personal, one feels that Sonny (the apostle EF) is real, believes what he is doing is real and is confident in his destiny - no matter how odd or quirky he appears at times.\n\nThe film is character driven with a good sprinkling of incidents throughout. Story points introduced early on and developed before half way give the film a strong feel of The Fugitive, the TV series - laid back, story based but with the undercurrent of \"a ticking bomb under the table\" (Alfred Hitchcock).\n\nMinor quibbles: Miranda Richardson's character is a little too young for Robert Duvall's. June Carter Cash, both the actress and the character, seem under utilised. And at times it is possible to see the joins. The version I saw on video appears to be shorter than that shown originally in the US cinema. This pruning may account for some of these minor points.\n\nOverall, The Apostle is highly recommended. Filmgoers without a strong interest in religious matters should find the characters, their treatment and the landscape in which they operate fascinating. Most people of a religious disposition should have little difficulty with the film as a film though they may not always like what they see from a religious viewpoint. 8.75.\n\nAmen!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT2M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1183383833",
        "name": "The Apostle",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmM4YjY1MmUtNDAwYi00M2U5LTgyNDQtYzk0OTY1N2EwMTlkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmM4YjY1MmUtNDAwYi00M2U5LTgyNDQtYzk0OTY1N2EwMTlkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:10:42Z",
        "url": "https://www.imdb.com/video/vi1183383833/"
    },
    "url": "/title/tt0118632/"
}