{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Penn",
            "url": "/name/nm0000576/"
        },
        {
            "@type": "Person",
            "name": "Naomi Watts",
            "url": "/name/nm0915208/"
        },
        {
            "@type": "Person",
            "name": "Don Cheadle",
            "url": "/name/nm0000332/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25882,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0124694/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088354/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0816169/"
        },
        {
            "@type": "Person",
            "name": "Kevin Kennedy",
            "url": "/name/nm1353930/"
        },
        {
            "@type": "Person",
            "name": "Niels Mueller",
            "url": "/name/nm0007158/"
        }
    ],
    "datePublished": "2004-10-22",
    "description": "Based on real life events, Assassination is set in 1974 and centers on a businessman who decides to take extreme measures to achieve his American dream.",
    "director": [
        {
            "@type": "Person",
            "name": "Niels Mueller",
            "url": "/name/nm0007158/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDUxNzYxNjk5Nl5BMl5BanBnXkFtZTcwNDg5NTcyMQ@@._V1_.jpg",
    "keywords": "assassination of president,based on real person,20th century,united states of america,downward spiral",
    "name": "The Assassination of Richard Nixon",
    "original_info": {
        "id": "The Assassination of Richard Nixon_2004",
        "name": "The Assassination of Richard Nixon",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "EUyeshima"
        },
        "dateCreated": "2008-03-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0364961/"
        },
        "name": "Penn's Extraordinary Work Carries a Bleak Portrait of a Real-Life Psychopath's Mental Descent",
        "reviewBody": "Sean Penn's scarifying, coiled-spring performance is the predominant force in first-time filmmaker Niels Mueller's fictionalized story of would-be assassin Samuel Byck, who became obsessed with killing then-President Nixon in 1974. Those who have seen Stephen Sondheim's musical \"Assassins\" will recognize Byck as one of its infamous characters. His name has been changed to \"Bicke\" in the chilling 2004 film version, but the basic skeleton of the true story remains. After losing his sales job, his wife and a government loan to start his own business, he became so paranoid that he decided to hijack an airliner and have it crash into the White House. The parallels to 9/11, especially the events recreated in Paul Greengrass' viscerally powerful \"United 93\", are obvious, but the bulk of this relentlessly downbeat film is about Bicke's descent into madness, one that Penn evokes with supple dexterity. In a performance that immediately recalls Robert DeNiro's (perhaps) coincidentally named Travis Bickle in Martin Scorsese's 1976 classic, \"Taxi Driver\", Penn proves again to be among the most effectively risk-taking of actors.\n\nThe screenplay itself, co-written by Mueller and Kevin Kennedy, reflects a more predictable storyline, most of which is a flashback. Showing apparent signs of a bipolar disorder, Bicke struggles with a life full of compromises and deludes himself into thinking he is an honorable man. His grand ideas of a thriving business and a loving marriage are at odds with reality, but instead of facing up to the challenges, he slides quickly from meekly pathetic to utterly pathological. He even thinks composer Leonard Bernstein is somehow his muse and writes him of his grand plans. The film's last ten minutes are eye-flinchingly realistic, but they provide the necessary denouement to a tragically misguided footnote in U.S. history. Beyond Penn, there is a trio of strong players used minimally in the film - Don Cheadle as Bickle's only friend and would-be partner Bonny and submerging their Aussie accents convincingly, a brunette Naomi Watts as Bickle's estranged waitress wife Marie and Jack Thompson appropriately greasy as his deceptively avuncular boss. The 2005 DVD provides a solid set of extras - an extremely informative commentary track from Mueller, a brief behind-the-scenes short, and several deleted scenes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Lionsgate",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2643001625",
        "name": "The Assassination of Richard Nixon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjg2ZmI3MDUtZTY1OC00NTNlLWI1MTktM2IzNTk1YzdiN2I3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjg2ZmI3MDUtZTY1OC00NTNlLWI1MTktM2IzNTk1YzdiN2I3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:11:14Z",
        "url": "https://www.imdb.com/video/vi2643001625/"
    },
    "url": "/title/tt0364961/"
}