{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ian Richardson",
            "url": "/name/nm0007183/"
        },
        {
            "@type": "Person",
            "name": "Donald Churchill",
            "url": "/name/nm0161427/"
        },
        {
            "@type": "Person",
            "name": "Denholm Elliott",
            "url": "/name/nm0001186/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1444,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016520/"
        },
        {
            "@type": "Person",
            "name": "Charles Edward Pogue",
            "url": "/name/nm0688279/"
        },
        {
            "@type": "Person",
            "name": "Arthur Conan Doyle",
            "url": "/name/nm0236279/"
        }
    ],
    "datePublished": "1983-11-03",
    "description": "Sherlock Holmes comes to the aid of his friend Henry Baskerville, who is under a family curse and menaced by a demonic dog that prowls the bogs near his estate and murders people.",
    "director": [
        {
            "@type": "Person",
            "name": "Douglas Hickox",
            "url": "/name/nm0382779/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Crime",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYxMDc0ODkzMF5BMl5BanBnXkFtZTcwMTg2NDIyMQ@@._V1_.jpg",
    "keywords": "sherlock holmes character,dr. john watson character,five word title,psychotronic film,murder",
    "name": "The Hound of the Baskervilles",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "csrothwec"
        },
        "dateCreated": "2005-06-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0085692/"
        },
        "name": "Very good version with excellent production values",
        "reviewBody": "Having seen the Rathbone, Cushing and Brett versions, I settled down to watch this expecting a run-of-the-mill, made for TV \"quickie\" which would be instantly forgettable and just \"yet another\" rendition of a tale all too frequently told. I was very pleasantly surprised to find a very good production with excellent direction, ensuring that it whisks along at an excellent pace and that the viewer's attention never flags. Some parts of Richardson's portrayal of Holmes do not gel, (especially the ludicrous 'gypsey' scenes), but, overall, I think he does a first rate job and, in my view, exceeds the value of the performances by Rathbone and Cushing, which, while very good in their own day, are now hopelessly dated, (to the point of caricature in the case of Rathbone and virtually ALL of the supporting players in the 1939 version!)Good supporting roles also from Martin Shaw as Baskerville and David Churchill as an entirely credible Watson, avoiding the buffoonery of the Rathbone version but also not the \"over-compensation\" of the Hardwick portrayal in the Brett version. This latter version, (as with the complete ITV series starring Brett, (which must rate as THE \"definitive\" version of the Holmes stories on screen, (whether large or small)), must probably maintain its status as the \"best\" version I have seen to date, BUT the Richardson one is only just behind and, as already said, in terms of overall pace and energy probably exceeds it! A pity we did not see Richardson don the deer stalker more often!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0085692/"
}