{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Cagney",
            "url": "/name/nm0000010/"
        },
        {
            "@type": "Person",
            "name": "Jean Harlow",
            "url": "/name/nm0001318/"
        },
        {
            "@type": "Person",
            "name": "Edward Woods",
            "url": "/name/nm0940589/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21852,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Person",
            "name": "Kubec Glasmon",
            "url": "/name/nm0321891/"
        },
        {
            "@type": "Person",
            "name": "John Bright",
            "url": "/name/nm0109148/"
        },
        {
            "@type": "Person",
            "name": "Harvey F. Thew",
            "url": "/name/nm0857710/"
        }
    ],
    "datePublished": "1931-05-15",
    "description": "An Irish-American street punk tries to make it big in the world of organized crime.",
    "director": [
        {
            "@type": "Person",
            "name": "William A. Wellman",
            "url": "/name/nm0920074/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjMzMDU3NmEtYjA0Zi00MzQ1LWIwMzEtMzVhZjY0MTI4NjcxXkEyXkFqcGdeQXVyNTcwNjUwNzk@._V1_.jpg",
    "keywords": "criminal,gangster,punched in the face,gang war,rise and fall",
    "name": "The Public Enemy",
    "original_info": {
        "id": "The Public Enemy_1931",
        "name": "The Public Enemy",
        "year": "1931"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lugonian"
        },
        "dateCreated": "2004-05-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0022286/"
        },
        "name": "A Thug's Life",
        "reviewBody": "THE PUBLIC ENEMY (Warner Brothers, 1931), directed by William A. Wellman, is a prime example of how a motion picture produced in the early sound era can still hold up today. A worthy follow-up to the studio's most recent gangster outing, LITTLE CAESAR (1930), that elevated Edward G. Robinson to stardom, THE PUBLIC ENEMY brought forth another new screen personality, James Cagney, displaying a different kind of movie thug: rough, with guys who betray him; tough, with women who get on his nerves or play him for a sucker; and ready, to succeed by socking, punching, slapping or killing anybody who gets in his way. His only soft spot for his mother, but far from being a \"Momma's Boy.\" \n\nThrough its passage in time element starting in 1909 Chicago, THE PUBLIC ENEMY plays in the biographical mode, displaying the origins of its main characters, Tom Powers and Matt Doyle, as boys (Junior Coughlan and Frankie Darro), leading to their adult lives (James Cagney and Edward Woods) as tough thugs. Tom Powers character, regardless of his fine upbringing, indicates he was born ... to be bad. He has a brother, Mike (Donald Cook) who knows of his activities, while their mother (Beryl Mercer) may suspect but overlooks his actions. As things start going well for Tom and Matt in the bootlegging racket under Paddy Ryan's (Robert Emmett O'Connor) leadership, Scheiner Burns, a rival gang leader, attempts on taking over Ryan's establishment, leading to more gun-play, especially for Tom, quick on the trigger, only to have things backfire on him.\n\nIf not the most famous of the early gangster films, THE PUBLIC ENEMY is one of the most revived. Quite frank in its actions, and adult for its intentions, much of the then so- called violence occurs out of camera range. Yet, whatever is displayed on film is something not to forget. These days, there isn't a year that goes where THE PUBLIC ENEMY isn't televised. Whenever a topic pertaining to THE PUBLIC ENEMY arises, it's not the story that immediately comes to mind, but Cagney's individual scenes consisting of squirting beer from his mouth into the bartender's face; Tom's cold-blooded killing of Putty Nose (the man who let him take the rap for a crime) while playing his last song on the piano; and Tom's off-screen shootout with a rival gang in a fancy nightclub, stumbling out in the pouring rain saying to himself, \"I ain't so tough.\" All these scenes pale in comparison until reaching its most chilling climax ever recorded on film. Yet, the one where Tom, at the breakfast table, pushes a grapefruit into his mistress Kitty's (Mae Clarke) face, never has such a brief scene have such an long impact. Other than Clarke's famous few minutes of grapefruit glory, Mia Marvin (whose face resembling Maureen \"Marcia Brady\" McCormick from TV's 1970s sit-com, \"The Brady Bunch\") playing a slut named Jane, is one who gets her face slapped after getting Tom drunk enough to seduce him. The second billed Jean Harlow doesn't get any abuse from her leading man as did the other two actresses receiving no screen credit for their trouble. While Harlow's performance has been criticized as one of her worst, chances are her portrayal might have been intended to be enacted in that manner. Harlow's Gwen Allen is an uneducated blonde floozy with her gift for attracting men. What possibly hurts the film is not Harlow herself, but the inane dialog she recites, (\"Oh Tommy, I can love you to death!\". Joan Blondell's limitations on screen is mostly one involving her relation with Tom's pal, Matt. Edward Woods, whose has almost equal screen time with Cagney, is a Hollywood name very few recollect today. Several documentaries profiling gangster films have indicated Woods as the initial star of THE PUBLIC ENEMY with Cagney assuming the subordinate role, with director Wellman seeing an error with the casting and wisely having these actors switch roles. While a smart move on Wellman's part, he failed to switch roles on the boy actors who portrayed them, especially a keen observer noticing Frankie Darro playing Matt, not Junior Coughlan playing Tom, performing in the Cagney manner. Donald Cook, Beryl Mercer and Robert O'Connor appearing in subordinate roles, are essential with their parts, but never outshine Hollywood's finest movie thug, a/k/a Public Enemy, James Cagney, whose tougher roles, ANGELS WITH DIRTY FACES (1938) and WHITE HEAT (1949) were years into his future. With limited underscoring, the theme song, \"I'm Forever Blowing Bubbles,\" like Cagney and his grapefruit, has long become associated with THE PUBLIC ENEMY.\n\nTHE PUBLIC ENEMY, which has become one of the first major movies from the Warner Brothers library to be distributed on video cassette (consisting mostly of prints from slightly edited reissues), and later on DVD (with either edited or restored prints), can be seen quite frequently on Turner Classic Movies. It might not have the realistic violence as any crime film of today, but THE PUBLIC ENEMY presents itself as a gangster drama that doesn't have to be all blood and guts to become successful. Good acting, fine story, interesting characters supplied with tight action is all what is needed to make a good movie. Being a natural talent, Cagney makes THE PUBLIC ENEMY all it's worth. (***)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A young hoodlum rises up through the ranks of the Chicago underworld, even as a gangster's accidental death threatens to spark a bloody mob war.",
        "duration": "PT46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1593032985",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjBjZGNhMGMtZGMwMC00NDZlLWEwZjctYjUxNzM0MWQwMzAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjBjZGNhMGMtZGMwMC00NDZlLWEwZjctYjUxNzM0MWQwMzAxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-15T10:40:50.748Z",
        "url": "https://www.imdb.com/video/vi1593032985/"
    },
    "url": "/title/tt0022286/"
}