{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Armand Assante",
            "url": "/name/nm0000800/"
        },
        {
            "@type": "Person",
            "name": "Antonio Banderas",
            "url": "/name/nm0000104/"
        },
        {
            "@type": "Person",
            "name": "Pablo Calogero",
            "url": "/name/nm0130668/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5728,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021159/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007127/"
        },
        {
            "@type": "Person",
            "name": "Oscar Hijuelos",
            "url": "/name/nm0383720/"
        },
        {
            "@type": "Person",
            "name": "Cynthia Cidre",
            "url": "/name/nm0162112/"
        }
    ],
    "datePublished": "1992-02-28",
    "description": "Two Cuban brothers bring a new music to the 1950s USA. They are as different as the problems that await them.",
    "director": [
        {
            "@type": "Person",
            "name": "Arne Glimcher",
            "url": "/name/nm0322865/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Drama",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGQ1NDNjYzktYTEwMi00OTg1LTg3NDUtYzFjMmVjNjNmMDNmXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "cuba,1950s,new york city,immigrant,havana cuba",
    "name": "The Mambo Kings",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2006-10-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0104802/"
        },
        "name": "A melodrama but a superior one",
        "reviewBody": "When Cesar that his brother's woman married another man to save Nestor from being murdered, he decides that the time is right for them to leave Cuba and seek out their fortune in America. Arriving in a rainy New York, their relatives and friends already in NY scoff at suggestions that the brothers will walk straight into a downtown club with their music, however when Cesar is invited onto stage with Tito Puente at one such club, things look positive until a shooting spoils it all. As Cesar continues to chase his dream in his own way, Nestor finds himself dragged along, perhaps at the expense of his own dream desires.\n\nAlthough I personally felt that the narrative could have been deeper and the characterisation more detailed, this film is lifted by the sense of place and period that delivers a glut of passion that runs across the whole film. Although it helps if you actually like the music and the culture, this energy is used well to help raise the material, which could easily have lapsed into soapy daytime melodrama. This is not to say that it doesn't do this occasionally but the film caught me up well to the point where I was engaged by their drama even while knowing it was a bit sentimental and (occasionally) contrived. Those happy to work at the melodrama level will easily enjoy this though because it is a superior example of that \"genre\" and Glimcher has done a good job of delivering the plot in a serious fashion.\n\nOf course it helps that the main actors are so strong. Assante dominates the film simply because his character dominates his brother. He is full of fire and passion and he delivers the goods in a convincing way. However the more impressive performance is from Banderas. Although a more subtle character, the lack of English meant that he was delivering everything phonetically. I could not be convincing on screen in my own tongue so I can only imagine the challenge of delivering the dialogue while also being convincing emotionally. He nails it though. The two men also work well together and have a natural chemistry that was necessary to make convincing brothers. They own the film and support from Moriarty, Detmers and others never threatens them, although it is cool to have a cameo from Puente.\n\nOverall then this is an enjoyable and energetic melodrama. It occasionally gets a bit too soapy but generally it is kept above this level  mainly thanks to impassioned delivery from Assante and Banderas. Some viewers will be turned off by it for what it is but for a melodrama it was surprisingly good."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Warner Home Video",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2532311321",
        "name": "The Mambo Kings",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmJlMDMyNzctNjIyOS00YTg2LTgwMGEtYWI1YWMzZGU4OGU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmJlMDMyNzctNjIyOS00YTg2LTgwMGEtYWI1YWMzZGU4OGU3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:36:23Z",
        "url": "https://www.imdb.com/video/vi2532311321/"
    },
    "url": "/title/tt0104802/"
}