{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vincent Gallo",
            "url": "/name/nm0001252/"
        },
        {
            "@type": "Person",
            "name": "Chloë Sevigny",
            "url": "/name/nm0001721/"
        },
        {
            "@type": "Person",
            "name": "Cheryl Tiegs",
            "url": "/name/nm0862841/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15982,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0312849/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063144/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0099678/"
        },
        {
            "@type": "Person",
            "name": "Vincent Gallo",
            "url": "/name/nm0001252/"
        }
    ],
    "datePublished": "2003-11-14",
    "description": "Professional motorcycle racer Bud Clay heads from New Hampshire to California to race again. Along the way he meets various needy women who provide him with the cure to his own loneliness, but only a certain woman from his past wi...",
    "director": [
        {
            "@type": "Person",
            "name": "Vincent Gallo",
            "url": "/name/nm0001252/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWUyMGVkYTYtZGFjNy00N2M2LWEwZmItMTk0NTA4Y2JkN2I4XkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "unsimulated sex,experimental film,independent film,penis in mouth,explicit fellatio",
    "name": "The Brown Bunny",
    "original_info": {
        "id": "The Brown Bunny_2004",
        "name": "The Brown Bunny",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "fontainemoore"
        },
        "dateCreated": "2006-11-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0330099/"
        },
        "name": "A potentially good film in serious need of professional editing",
        "reviewBody": "While I give the film kudos for a story that I didn't see coming, after the first few minutes of needless (and extremely boring) motorcycle racing, I could see that I was NOT in the hands of a professional editor. The story could have been told far more effectively in half the time--or less. Gallo definitely needed to step away and let a professional editor do his/her thing and mercilessly cut scenes that didn't move the story forward.\n\nWhile I could see that the author wanted the audience to crawl inside the protagonist, Bud, during the road trip, it didn't take that darned long to do it. Plus, his point of view changed too frequently. If we are inside his skin, then why are we looking at him for minutes in an excruciatingly long and tedious long shot? We need to see what he sees--at least with more consistency. I couldn't get my bearings in terms of what I was supposed to be experiencing and from what viewpoint.\n\nThere were other technical problems such as an inconsistency in lighting and shot quality with no apparent reason. And that spotted windshield drove me nuts. If a sign of depression and the carelessness that results from it, I'd have appreciated technique that didn't interfere so much with the visuals. Speaking of visuals, extending driving sequences to cover a song also seemed visually uninspired.\n\nProbably most important, Gallo ignored common expectations of audiences and wanted things his way. I can't believe there wasn't an acceptable compromise. I'm pretty patient when it comes to art and film as art, but don't appreciate my sensibilities and expectations to be pushed beyond the breaking point when there appears to be no artistic justification for it. Too many scenes suffered from too few cuts and ran far too long, engendering more audience frustration than heightened emotionalism. I think this may be a result of an inexperienced and slightly self-indulgent filmmaker.\n\nThese technical problems aside, I'm usually able to spot a twist a mile away--but not this time. I wondered why all the women he encountered had flower names but that was just a hint that didn't make much sense until the end. But his name? Bud, as in \"flower bud\" and \"clay\" as in a substance in which flowers grow (he couldn't have named the character \"dirt\" or \"mulch,\" after all) might have been a bit over the top. Again, typical of an immature filmmaker.\n\nWas the encountered women's immediate sexual response to a complete stranger, fantasy on the character's part or the filmmaker's? I'd like to know how many men run into so many compliant females. From what I hear, not many--even when the guy is young, good-looking, and clearly pitiable. In this day and age, we ladies are a bit more cautious than that. Sorry, Vincent. While this may have been believable for males, I don't expect it was for very many female viewers.\n\nI watched the film largely because I wanted to see if and how graphic sex could be incorporated into a drama without lowering it to the level of \"high brow pornography.\" I think the film did a good job on that score, although I'd have preferred the use of a realistic-looking prosthetic such as that used in Boogie Nights. Perhaps the budget didn't allow for it or...who knows? It was certainly an interesting artistic choice and one that leaves me scratching my head in terms of the motive for including it. Symbolically, I'm a bit confused about it.\n\nAs effective and surprising as the end twist was, there could have been more in terms of Bud's descent into depression. But then, I'm a psychologist so am aware that symptoms are more than seeking surrogates, crying, and looking forlorn and depressed. Gallo missed, IMO, a chance to show more about what guilt and loss look like and how they affect people. Perhaps, this again, is a result of his inexperience. Personally, I think Redford's \"Ordinary People\" did a better job of showing a wider breadth of feelings of grief and loss.\n\nBottom line, although I thought the story had merit and did an excellent job of building to a surprising twist, I think it suffered severely in the journey towards the denouement. I hope Gallo matures and grows as a storyteller and filmmaker as I think he's got something to say worth watching.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Wellspring",
        "duration": "PT56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3851354393",
        "name": "The Brown Bunny",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODMxY2JlZmMtNjA4ZC00NTMwLWEyNjktOWQ2NTExYjA0YWY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODMxY2JlZmMtNjA4ZC00NTMwLWEyNjktOWQ2NTExYjA0YWY3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:34:24Z",
        "url": "https://www.imdb.com/video/vi3851354393/"
    },
    "url": "/title/tt0330099/"
}