{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        },
        {
            "@type": "Person",
            "name": "Meryl Streep",
            "url": "/name/nm0000658/"
        },
        {
            "@type": "Person",
            "name": "Annie Corley",
            "url": "/name/nm0179960/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 84214,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009119/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010258/"
        },
        {
            "@type": "Person",
            "name": "Richard LaGravenese",
            "url": "/name/nm0481418/"
        },
        {
            "@type": "Person",
            "name": "Robert James Waller",
            "url": "/name/nm0909077/"
        }
    ],
    "datePublished": "1995-06-02",
    "description": "Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson for four days in the 1960s.",
    "director": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        }
    ],
    "duration": "PT2H15M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmRiZDZkN2EtNWI5ZS00ZDg3LTgyNDItMWI5NjVlNmE5ODJiXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "bridge,photographer,1960s,photography,rural setting",
    "name": "The Bridges of Madison County",
    "original_info": {
        "id": "The Bridges of Madison County_1995",
        "name": "The Bridges of Madison County",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MOscarbradley"
        },
        "dateCreated": "2007-07-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0112579/"
        },
        "name": "There won't be a dry eye in the house!",
        "reviewBody": "On the page \"The Bridges of Madison County\" often read like a reject from Mills and Boon and yet it was tremendously popular. People who normally wouldn't read this sort of thing were not only reading it but quoting it. You could say that for some people it held the kind of camp appeal that bad books sometimes do for the so-called intelligentsia. Personally, I am inclined to think that its tale of middle-aged romance struck a cord. It may not have been well-written but many people recognized in its two central characters a reflection of themselves. It spoke of a great passion and a great loss; a \"Brief Encounter\" for the nineties. Still, it never quite seemed like a vehicle for Clint Eastwood; (once upon a time you might have envisaged Arthur Hiller doing it), yet here it is, larger than life on the big screen and utterly lovely, utterly heart-breaking.\n\nPerhaps Eastwood chose to film it as a vehicle for himself. He wears the mantle of the ageing Lothario perfectly at an age when most romantic leads are played by much younger men, (or are simply non-existent), yet who blanched when Gary Cooper or Cary Grant were wooing Audrey Hepburn well into their old age. Admittedly Eastwood isn't entirely comfortable in this sort of role. He's not a versatile actor. His best performances have been as tortured losers or just old-fashioned tough guys but under his own direction he blossoms here. Of course, the 'romantic' in Eastwood has never been hard to find. You need look only to the scores he has composed. (He has written the main love theme here and his use of classic jazz standards by the likes of Dinah Washington and Johnny Hartman adds considerably to the film's beating heart).\n\nWhat is remarkable is that essentially Eastwood's film is really something of a chamber piece for two players. A few other characters flit into the frame but for most of the time there is no one on screen but Eastwood and co-star Meryl Streep and this is one of Streep's great performances. As Francesca, the woman who finds in Eastwood's photographer Robert the one great passion in her life albeit briefly and at a time when the likelihood of such a thing happening was remote indeed, Streep is extraordinary. Sometimes Streep can overwhelm a project; her versatility doesn't always work in favour of lesser material. But here she seems to have tapped quite effortlessly, not just into the consciousness of her character, but into her very soul as well. And if that sounds cheesy, let me assure you it isn't. Cheesiness isn't in Streep's vocabulary, even if it is in mine! Perhaps Eastwood was able to discern in Robert James Waller's novel the seeds of a great love story or perhaps he just felt he could bring his artistry to bear on some unlikely source material. Whatever, it's paid off. On screen \"The Bridges of Madison County\" is a great love story; there won't be a dry eye in the house.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 3 for The Bridges of Madison County",
        "duration": "PT1M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3755061529",
        "name": "The Bridges of Madison County",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjBlZjYzMTMtMTA4Yi00NjVhLTg1MTEtOTk4ZWVkODAzNTZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjBlZjYzMTMtMTA4Yi00NjVhLTg1MTEtOTk4ZWVkODAzNTZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2015-03-22T05:01:21Z",
        "url": "https://www.imdb.com/video/vi3755061529/"
    },
    "url": "/title/tt0112579/"
}