{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sam Waterston",
            "url": "/name/nm0001832/"
        },
        {
            "@type": "Person",
            "name": "Tess Harper",
            "url": "/name/nm0002128/"
        },
        {
            "@type": "Person",
            "name": "Gail Strickland",
            "url": "/name/nm0834373/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17417,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Jenny Wingfield",
            "url": "/name/nm0935053/"
        }
    ],
    "datePublished": "1991-10-04",
    "description": "A coming of age story set in the south of the U.S. when Elvis was King.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Mulligan",
            "url": "/name/nm0612322/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2U1NjljOTgtNDE2My00OWI2LThmMTctMTAwNThkYmNhNzA3XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "coming of age,year 1957,sister sister relationship,child abuse,teen movie",
    "name": "The Man in the Moon",
    "original_info": {
        "id": "The Man in the Moon_1991",
        "name": "The Man in the Moon",
        "year": "1991"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "zkonedog"
        },
        "dateCreated": "2017-07-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0102388/"
        },
        "name": "A Worthwhile Watch For Those Who Enjoy Dramatic, Emotional Cinema",
        "reviewBody": "\"The Man In The Moon\" is one of those films that I'd seen bits and parts of on TV all the time, but never quite seen all the way start-to-finish. As a big fan of Reese Whitherspoon, I finally decided to give it a rent and watch it properly. What I found is that despite the fact that I'm not nearly the target audience for this type of picture (I'm a 30-year old male), anyone who enjoys emotional films (and isn't that kind of the point of film?) will find something to relate to in this one.\n\nFor a basic plot summary, \"Man in the Moon\" focuses on 14-year old Dani (Whiterspoon) entering her adolescence in 1950s farm country. Her parents, Matthew (Sam Waterston) & Abigail (Tess Harper), are as salt-of-the-earth as they come, while Dani also looks up to older sister Maureen (Emily Warfield). One summer, Dani discovers that an \"older boy\" (older teenaged) has moved in down the way, and Court (Jason London) becomes the object of her burgeoning sexuality and adolescence in general. Does Court really like her, or is he just stringing her along? Feelings (especially those of the \"first\" variety) are complicated, and this is what Dani must discover as life continues to roll on despite her desire to have everything work out perfectly.\n\nLike I said, it is easy to classify \"Man In The Moon\" as a \"chick flick\", and I can absolutely see why that is. The \"gist\" of the film is about a teenaged girl dealing with her feelings; the only thing separating it from hundreds of other more contemporary films just like it being the period setting.\n\nHowever, I am the type of person who likes to try and look past such labels and find good films no matter what their reputation may say. I'm glad I did in this case, as \"Man In The Moon\" is really a well-made film in many aspects. Though I've never personally experienced the angst of teenage girl adolescence, I did go through an adolescence of my own and have younger sisters that somewhat help me relate. I think the point here is that this isn't a film that \"only girls/women can enjoy\".\n\nGenerally speaking, the cast of this film is solid, but it is truly Whitherspoon's performance that vaults into \"cult classic\" territory. In this her introductory film performance at the age of 14, Reese shows exactly why she would go on to have an acclaimed, Oscar-winning career. Even in a film that can, admittedly, get a bit cheesy and sappy at times, Reese is always the magnet that your attention will be drawn to. I'd be hard pressed to name another performance this good from someone this young (she is in practically every scene!).\n\nThus, despite not really having the scope or production value to be an \"all-time classic\" piece of cinema, \"Man In The Moon\" will tug at your heartstrings for its portrayal of those delicate, confusing, and incredibly exciting teenage years. It will hit closest to home with females, I would imagine, but I'm proof that all ages can enjoy a film that is obviously made with such care and features such mesmerizing acting from the lead player.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT3M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3645685273",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGQ4NGRkYmMtZGQ5Ny00OTRiLThjMWQtMGJlYTA4NDM5OGFjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGQ4NGRkYmMtZGQ5Ny00OTRiLThjMWQtMGJlYTA4NDM5OGFjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-28T17:41:29.305Z",
        "url": "https://www.imdb.com/video/vi3645685273/"
    },
    "url": "/title/tt0102388/"
}