{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Forrest J. Ackerman",
            "url": "/name/nm0009969/"
        },
        {
            "@type": "Person",
            "name": "Rick Baker",
            "url": "/name/nm0000711/"
        },
        {
            "@type": "Person",
            "name": "Linda Blair",
            "url": "/name/nm0000304/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 115,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Michael J. Haigney",
            "url": "/name/nm9819759/"
        },
        {
            "@type": "Person",
            "name": "Marc Juris",
            "url": "/name/nm0432967/"
        }
    ],
    "datePublished": "1990-10-28",
    "description": "This award ceremony, hosted by horror superstar Robert Englund and featuring many well-known presenters such as Chucky and Sam Kinison, celebrates the history of horror by inducting some of its best films and faces. Each inductee ...",
    "director": [
        {
            "@type": "Person",
            "name": "Ron de Moraes",
            "url": "/name/nm0210454/"
        }
    ],
    "genre": [
        "Documentary",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjBhMDYzYjQtYzFiOS00NTQ5LWJmYjctOTVkMGZlYjY2OWNiXkEyXkFqcGdeQXVyMTg2ODM4MjY@._V1_.jpg",
    "keywords": "reenactment,chucky character",
    "name": "The Horror Hall of Fame",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "a_l_i_e_n"
        },
        "dateCreated": "2006-03-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0258662/"
        },
        "name": "Recognizing Scary Achievements",
        "reviewBody": "This was a truly remarkable award show. Rather than just another plodding exercise in industry self-congratulation, The Horror Hall Of Fame was genuinely entertaining. What made it unique among such programs was that it took the novel approach of spotlighting a craft Hollywood very seldom likes to honour: the horror movie.\n\nThe \"H.H.O.F.\" didn't operate quite the way the Oscars do; it wasn't a live network broadcast that followed some Barbara Walters celebrity interview show, and all the recipients obviously knew they'd be getting an award, but that was good because there was none of the \"(insert name) couldn't be here with us tonight\" pseudo-acceptance crap. It was an excellently produced, loving tribute to horror films both current and classic. \n\nRobert Englund, a perfect choice to MC, would introduce well written, nicely edited tributes to such films as \"Night Of Living Dead\", \"Alien\", and \"The Texas Chainsaw Massacre\", and these pieces would include interviews with the directors, screen writers and members of the cast. Film critics like Leonard Maltin would offer their opinion why these films gained worldwide acclaim. For some of the classics honoured a member of the production might be there to actually take a bow on behalf of the film as did Jason Miller who made a rare appearance to accept a trophy in recognition of \"The Exorcist\". There were even affectionate tributes to the careers of actors like Bela Lugosi, and industry people such as Al Feldstein, originator of the horror comic book and a very deserving recipient he was, too. This guy really suffered at the hands of 1950's government persecutors who tried to pin responsibility for a rise in adolescent crime on the publication of his comics. The H.H.O.F. knew better however and gave him a lovely trophy shaped like a grim reaper. \"Beautiful\" he cooed as he was handed the award.\n\nLike the Oscars, at the end the award for the best horror film of the year would be presented. During it's final airing \"The Silence Of The Lambs\" was announced as winner by none other than Vincent Price.\n\nThis show was more than just some novelty special cooked up by Fangoria fans; the list of \"voting members\" shown in the closing credits included the afore mentioned Vincent Price, Roger Corman, John Landis, and even this guy named Steven Spielberg. The \"Horror Hall Of Fame\" was only broadcast twice that I'm aware of which is a shame. This area of film-making really deserves a solid salute and a LOT more often than the \"legitamite\" Hollywood awards shows seem willing to give it. Truly a missed opportunity that this didn't become a yearly tradition."
    },
    "url": "/title/tt0258662/"
}