{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matt Dillon",
            "url": "/name/nm0000369/"
        },
        {
            "@type": "Person",
            "name": "Diane Lane",
            "url": "/name/nm0000178/"
        },
        {
            "@type": "Person",
            "name": "Tommy Lee Jones",
            "url": "/name/nm0000169/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2388,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054605/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Clark Howard",
            "url": "/name/nm0397208/"
        },
        {
            "@type": "Person",
            "name": "Robert Roy Pool",
            "url": "/name/nm0690798/"
        }
    ],
    "datePublished": "1987-09-25",
    "description": "A dice roller falls in love with a talented dancer who happens to be the wife to a gangster.",
    "director": [
        {
            "@type": "Person",
            "name": "Ben Bolt",
            "url": "/name/nm0093322/"
        },
        {
            "@type": "Person",
            "name": "Harold Becker",
            "url": "/name/nm0000887/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2JlYTYwZWQtMjkyZi00NjA2LWI0ZGEtN2UwYmIwMWY4ODY3XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "sex scene,stripper,voyeur,extramarital affair,infidelity",
    "name": "The Big Town",
    "original_info": {
        "id": "The Big Town_1987",
        "name": "The Big Town",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheFearmakers"
        },
        "dateCreated": "2021-09-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092656/"
        },
        "name": "Neon Neo Noir",
        "reviewBody": "With a deliberately sparse-pulpy title, THE BIG TOWN is set during the 1950's... 1957 to be exact... and Dillon really looks the part, a kind of throwback B&W-suited actor even in this neo noir's neon green and pink tinged color scheme, playing a young lucky dice player who miraculously hits the right numbers each and every time, giving the movie a sort of unintentional TWILIGHT ZONE science-fiction vibe, or something delving into fantasy...\n\nAnd for a vehicle so otherwise grounded and somewhat cliche, predictable and even mainstream, that's alright since Matt's urgency (and the film's suspense) doesn't rely on winning but surviving the pool of gambling hoodlum sharks who, from Tommy Lee Jones as an underground backroom dealer to a mysterious backstory Tom Skerritt, are out to (or seem out to) stop the endless and bizarre winning streak...\n\nThe best scenes are during the first half when, starting with having been discovered and weened by local gambling mechanic Don Francks, everything is breezy and easy since all the characters are developed as much as can be (including an expository introducing-the-city David Marshall Green) - not always through dialogue but their sly manipulation to the sport of gambling, and thinking on their toes...\n\nYet THE BIG TOWN is mostly known for being the third and final film Dillon starred alongside his RUMBLE FISH ingenue Diane Lane, which began most famously with THE OUTSIDERS, the only one they're not romantically involved... although her character finds his scoundrel rebel wild and attractive (\"I might fall in love with him\")...\n\nMuch more grown up in looks and attitude, and seeming far more both an aesthetic and genre-period connection to Francis Ford Coppola's uninspired THE COTTON CLUB than the S. E. Hinton adaptations, Lane provides a sexy, borderline sinister Femme Fatale as Jones's stripper trophy girl...\n\nWithout the usual 11th hour gunfire, her danger exists on who she's cheating on while Matt could be throwing away the perfect girl in Suzy Amis -- proving twenty-nine years after the demise of the Crime Genre that Film Noir good girls always have to weather hell before getting what they deserve, and getting who deserves them...\n\nA slow middle's made up for during the finale where Dillon must succeed with slightly more odds added on -- very similar to the more lightweight early-60's-set-comedy, THE FLAMINGO KID, in which he had to win everything with the skill of the game -- cards there, and craps here...\n\nIn either game, be it skill or chance... which is chance here pretending to merit skill... Matt Dillon, a minimalist actor to begin with, has the kind of poker face expressions that helps the suspense build without a lot of action...\n\nHe's an actor that's been in a some good, great and downright terrible films, but he's usually good no matter. Even when he seems a bit slow to the punch and lethargic, like happens on occasion here, or too streetwise and stubborn to stretch beyond particular tough guy roles, he's got range within limitations...\n\nIn BIG TOWN, it's a steady gaze across a long green table. And hell, maybe he'd have worked in COLOR OF MONEY if that other Outsider backed out.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A dice roller falls in love with a talented dancer who happens to be the wife to a gangster.",
        "duration": "PT2M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1771225881",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGJlN2NjNjItYzkxOC00M2U1LWJjZDktMThhOTMzYmIwZjU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGJlN2NjNjItYzkxOC00M2U1LWJjZDktMThhOTMzYmIwZjU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-04T18:01:53.669Z",
        "url": "https://www.imdb.com/video/vi1771225881/"
    },
    "url": "/title/tt0092656/"
}