{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Chamberlain",
            "url": "/name/nm0000328/"
        },
        {
            "@type": "Person",
            "name": "Amanda Donohoe",
            "url": "/name/nm0000372/"
        },
        {
            "@type": "Person",
            "name": "Paul Bertram",
            "url": "/name/nm0078329/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1004,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0089381/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029011/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005035/"
        },
        {
            "@type": "Person",
            "name": "Colleen McCullough",
            "url": "/name/nm0567181/"
        },
        {
            "@type": "Person",
            "name": "David Stevens",
            "url": "/name/nm0828350/"
        }
    ],
    "datePublished": "1996-02-11",
    "description": "At the height of WWII and ten years after their union in Matlock Island, Father Ralph reunites with Meggie who faces a deep crisis. Now, he must make up his mind, as the burden of choice is insufferable. Will he risk it all for love?",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin James Dobson",
            "url": "/name/nm0229914/"
        }
    ],
    "duration": "PT2H58M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTRlMjViM2QtOWI0OS00ZDMyLWJjZmYtNjk1NDNiN2MwNmVhXkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "sequel,priest,forbidden love,priest in love,based on novel",
    "name": "The Thorn Birds: The Missing Years",
    "original_info": {
        "id": "The Thorn Birds: The Missing Years_1996",
        "name": "The Thorn Birds: The Missing Years",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "moongirl527"
        },
        "dateCreated": "2000-12-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117901/"
        },
        "name": "Excellent film showing human passion",
        "reviewBody": "What started my interest in The Thorn Birds WAS \"The Missing Years.\" I read the article on the series in TV Guide (a '97 Valentine's Day issue) that named Ralph and Meggie as one of the most romantic couples on television. I didn't know where to get the series...and then about a year ago, they showed \"The Missing Years.\" This series introduced me to Ralph and Meggie, and, admittedly, it was hard to follow the storyline. But I liked it. I mean, so what if the people aren't the same?\n\nOne day I broke down and bought the whole series. I sat down with sodas watched it from beginning to end. Some people say that Missing Years is a bad piece. Well, I disagree. Why should Ralph and Meggie wait 19 years? If anything, it brought an interesting reason for Ralph's return: he was ordered. He is shown suffering in \"Missing Years.\" In the original, it seemed like he decided to show up...waiting 19 years to do so. Their reunion was wonderful...and sweet. The way they saw each other after their 10 years of being apart (by accident) and both were taken away. Like in the original, they had fought their passion...so it stood to reason that they tried to tell themselves, once again, that they were over their passion. Their parting in Missing Years was sweet and brought tears to my eyes. It was a private moment between them. If his reputation is already on the line (and no doubt, would be severely tarnished if Dane's paternity were revealed), how would it look for Archbishop De Bricassart to be hugging and kissing Meggie at the train station?\n\nDane's character seemed true to how it was in the original. If anything, it was easier for me to see young Dane first and THEN adult Dane. In the original, Dane said he'd always wanted to be a priest. Well, in the Missing Years, young Dane seems at peace with his decision. We see his placidness and calmness in several instances. Also, in the original, Ralph said he'd always felt closer to Dane. It was good that he meet Dane at a younger age and get to know him. Granted, in the original, he just meets Dane as an adult...so there's a plot difference there, I'll admit. Yes, Dane is a goody goody. But he's supposed to be--he's the more priestly version of his father. I liked the young boy that played Dane...I thought he did a great job. He seemed, to me, more real than his zombie-like adult counterpart. Granted, Philip Anglim had a strong resemblance to Richard Chamberlain and could easily be seen as an adult version of a Meggie-Ralph combination. It was highly important that there be a young Dane. After all, you needed to see Meggie's partiality to Dane as a child. In the original, it takes awhile before it's shown that Dane IS Meggie's favorite. In the original series, young Meggie says \"I'll never love any of my children different from the others.\" \"Missing Years\" shows that she's contradicted herself. Meggie DOES love Dane more than Justine--it's shown in their first scene together; in the original, she TOLD Justine she did--the younger Justine picked up on it more--the sibling rivalry for Justine against Dane was realistic. Ralph and Dane had a strong connection even when Dane is a youngster. Plus the fact that Dane, at a young age such as 10, knows he wants to be a priest is a harsher blow to Meggie... because she has to hear about it everyday and suffer through her denial that \"He's just a child--he'll grow out of it.\" It made sense that she kept saying that.\n\nFee, in the Missing Years, was a lot worse than the Fee in the original. I mean, spoiling any shot of happiness for Ralph and Meggie? Jeez...that's harsh!\n\nI must admit to being naive when I saw the Part II preview. I actually thought that Ralph would give up the priesthood...but then he couldn't, could he? Granted, I didn't know that he'd become Cardinal and die as thus.\n\nAll in all, I liked the movie a lot. I may be alone here, but I saw a lot of chemistry between Amanda Donohoe and Richard Chamberlain. Sure, it was different than the Ward-Chamberlain chemistry, but still...it was strong. The love scene was good...after all, they'd been in denial about their passion for so long and couldn't fight it anymore. After ten years of being without the woman he loved, it stands to reason that Ralph would doubt where he belonged. On one hand, he wants solely to be Meggie's...and Meggie's alone. On the other, the Cardinal's robe looks awefully promising. I LOVED watching him fight for Dane. I think it's realistic that he could've won--after all, it's the lion protecting his cub, albeit subconciously. I loved the line: \"The boy is MINE.\" If Ralph only knew...\n\nI thought there was more focus on Meggie & Ralph in the Missing Years. I was glad for it. They have to see each other again and remember...then they have to try to tell themselves it's over. But it's NOT over. In the end, as Ralph puts it, their love \"is a blessing, not a burden.\" Their farewell is peaceful and, for once, leaving no hurt feelings. That makes the next nine years they're apart, no doubt, easier to bear. THEN they can reunite when Dane is older.\n\nThe passion between them (in both series) have made Ralph and Meggie one of my all-time favorite couples. I just can't hate (for the most part) \"Missing Years\" for being different--in some places I appreciated the differences.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0117901/"
}