{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bill Murray",
            "url": "/name/nm0000195/"
        },
        {
            "@type": "Person",
            "name": "Owen Wilson",
            "url": "/name/nm0005562/"
        },
        {
            "@type": "Person",
            "name": "Anjelica Huston",
            "url": "/name/nm0001378/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 201554,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108325/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0093765/"
        },
        {
            "@type": "Person",
            "name": "Wes Anderson",
            "url": "/name/nm0027572/"
        },
        {
            "@type": "Person",
            "name": "Noah Baumbach",
            "url": "/name/nm0000876/"
        }
    ],
    "datePublished": "2004-12-25",
    "description": "With a plan to exact revenge on a mythical shark that killed his partner, Oceanographer Steve Zissou (Bill Murray) rallies a crew that includes his estranged wife, a journalist, and a man who may or may not be his son.",
    "director": [
        {
            "@type": "Person",
            "name": "Wes Anderson",
            "url": "/name/nm0027572/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYzODYzNzg2MF5BMl5BanBnXkFtZTcwMTkzOTQzMw@@._V1_.jpg",
    "keywords": "original story,shark,expedition,underwater scene,oceanographer",
    "name": "The Life Aquatic with Steve Zissou",
    "original_info": {
        "id": "The Life_2004",
        "name": "The Life",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "brainofj72"
        },
        "dateCreated": "2005-08-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0362270/"
        },
        "name": "A Beautiful Modern Fantasy",
        "reviewBody": "\"The Life Aquatic\" is most certainly an unusual film. It's something of a collage of colorful imagery, fragmented shots, quirky music, strange characters, bizarre situations, and amusing montages. But if one had seen Wes Anderson's previous films, one would expect nothing less.\n\nIt can't really be helped that there be a certain amount of hype around Anderson's name, after all, his films \"Rushmore\" and \"The Royal Tenenbaums\" both generated vast critical acclaim and three of this young director's four films have already received the Criterion DVD treatment. Is the buzz warranted? I say, absolutely. Anderson has created some of the most vibrant, vivid, unique, and off-beat films of the last decade, and \"The Life Aquatic\" is no exception.\n\nThe film follows Steve Zissou (Murray), a formerly glorious oceanographer whose latest documentary, which is about his closest friend and colleague, Esteban, being eaten by a \"Jaguar Shark\", receives a less-than-glorious reception. Steve then announces he plans to set out on a voyage to film part two of his documentary, which will follow him and his crew as they attempt to track down the alleged \"Jaguar Shark\". Along for the ride is Ned (Wilson), someone who may or may not be Steve's son; Jane (Blanchett), an up-and-coming journalist doing a story on Zissou; Klaus (Dafoe), the eccentric German first mate; a Portugese, David Bowie-covering weapons expert; a no-nonsense tech expert; a usually semi-nude female crew-member; a band of unpaid interns; and several other quirky personalities. Other characters include Zissou's estranged wife, Eleanor (Huston), and her former husband, Alistair Hennessey (Goldblum). On the journey, the crew encounters money problems, relationship issues, and...pirates.\n\nThe film takes place in a vivid world that is somewhat inside Steve's head. A colorful world where the creatures are claymation and where Steve can single-handedly ward off kidnapping, gun-wielding pirates to beat of The Stooges' \"Search and Destroy\".\n\nI do warn you though, if you are not a fan of dry humor, this one's most likely not for you. The movie's loaded with it, in all of its off-beat, tongue-in-cheek anti-glory.\n\nThere are some wonderful acting performances throughout, including an exuberant Bill Murray, who just loses himself in the character of Zissou, a subdued Anjelica Huston, whose subtle sly grins and deadpan delivery develop her character far more than anything else, and a spirited Willem Dafoe, who manages to make a German accent sound funnier than I ever imagined it could.\n\nIf you enjoyed \"Rushmore\", \"The Royal Tenenbaums\", \"Punch-Drunk Love\", or \"I Heart Huckabees\", then you most certainly should not let this charming, oddly beautiful little film pass beneath your radar.\n\n9.5/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #1 Post",
        "duration": "PT2M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3686859033",
        "name": "The Life Aquatic with Steve Zissou",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjk4M2M4ODMtMmMwZC00NDgxLTg1NmUtZjM3YmViZGZmZGJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjk4M2M4ODMtMmMwZC00NDgxLTg1NmUtZjM3YmViZGZmZGJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-08-04T03:56:34Z",
        "url": "https://www.imdb.com/video/vi3686859033/"
    },
    "url": "/title/tt0362270/"
}