{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brigitte Lin",
            "url": "/name/nm0510857/"
        },
        {
            "@type": "Person",
            "name": "Leslie Cheung",
            "url": "/name/nm0002000/"
        },
        {
            "@type": "Person",
            "name": "Francis Ng",
            "url": "/name/nm0628757/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3711,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "The Bride with White Hair",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039100/"
        },
        {
            "@type": "Person",
            "name": "Kee-To Lam",
            "url": "/name/nm0442983/"
        },
        {
            "@type": "Person",
            "name": "Yusheng Liang",
            "url": "/name/nm1295635/"
        },
        {
            "@type": "Person",
            "name": "David Wu",
            "url": "/name/nm0398871/"
        }
    ],
    "datePublished": "1993-08-26",
    "description": "Cho Yat-Hang, the unwilling successor to the Wu-Tang clan throne and the unsure commander of the clan's forces in a war against an evil cult, falls in forbidden love with Lien Ni-Chang, a killer for the evil cult.",
    "director": [
        {
            "@type": "Person",
            "name": "Ronny Yu",
            "url": "/name/nm0950553/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Action",
        "Fantasy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzY0MDY2MmQtZmU5NS00YTI0LWFkMjctZGZmMTFmMjQ2NGFhXkEyXkFqcGdeQXVyMDEwMjgxNg@@._V1_.jpg",
    "keywords": "love,martial arts,betrayal,sword fight,battle",
    "name": "Bak fat moh lui zyun",
    "original_info": {
        "id": "The Bride with White Hair_1993",
        "name": "The Bride with White Hair",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bogey Man"
        },
        "dateCreated": "2002-06-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0106342/"
        },
        "name": "Incredibly beautiful and unique fantasy adventure from Hong Kong film maker Ronny Yu",
        "reviewBody": "Ronny Yu's (Legacy of Rage, The Phantom Lover) Bride With White Hair (1993) is incredible collaboration in the field of cinema. Editor David Wu, cinematographer Peter Pau and director Yu have created a piece of magic that will amaze fans of Orient cinema many years to come. Brigitte Lin plays a girl who has lived among wolves and thus is called wolf girl. She becomes an assassin for horrible cult leader brother/sister-twin mutant, and does her job with her great martial arts skill. Leslie Cheung plays a swordsman who was once, as a child, saved by this mysterious girl, who disappeared so soon he couldn't even thank her. Years after they meet again, and the power of love will change their lives forever..\n\nThis film is an adaptation of the same Chinese novel, on what Wolf Devil Woman was based on, too. The film is set and located in somewhere in the past, and I don't think the year and place was mentioned exactly during the film. The visual magic of the film is outstanding as this includes perhaps the best cinematography I've seen in Orient films. Cinematographer Peter Pau has worked as a cinematographer on many other great films, too, which include Savior of the Soul, Naked Killer, Bury Me High, Swordsman and John Woo's The Killer. Editor David Wu has been editor in great films like Crying Freeman, John Woo's Hard Boiled and Bullet in the Head, Swordsman and all three A Better Tomorrow films, by John Woo (first two) and Tsui Hark (part three). Their talent is very fantastic, as the film is a visual delight in every level.\n\nAll the exteriors were shot at night, so the unique lightning were able to be created. The camera flows, twists, is at peace and moves like I had rarely seen before. The mist, dust, water, smoke and other similar elements are captured on the screen like if they all were alive, all they meant something and thus are there for purpose. I think a film maker like David Lynch would appreciate this film very much. The camera never acts irritatingly as it creates the whole weird and often twisted atmosphere of the film. People who consider this kind of cinema irritating simply can't understand the possibilities and multi leveled magic of cinema, and thus they consider this kind of visual films bad or stupid. Bride With White Hair shows exactly what are the possibilities of a talented film director and crew. This is totally unique (but also equalled, but probably only in other Orient films!) film making, and demands to be seen on big screen. If that is not possible MAKE SURE you get the widescreen DVD/VHS/LD as it is the film's only and original aspect ratio. The remastered DVD released in Hong Kong is in gorgeous widescreen and the film is uncut, so it is one (and cheap) possible purchase of this film.\n\nThe editing and pace of the fight scenes (usually sword fights) is also fantastic, and totally unforgettable. The two most important elements of Bride With White Hair are cinematography and editing. The sword fights are not as plenty as one might think and there is plenty of dialogue and \"peaceful\" scenes, but there are still numerous sword fights and they are so over-the-top gorgeous, that I didn't feel there were too few of them. The fight scenes are often pretty bloody and violent, but in mythical way and surreal way. The \"blood geysirs\" are not realistic and they only add to the magic over all look of the film, and they fit here as fantastically as they fit to the very eerie and atmospheric Japanese Baby Cart samurai films. I think Bride With White Hair was going to get a Category III rating due to its violence, but director Yu toned down couple of violent scenes for theatrical release, but the scenes are nevertheless intact on that mentioned Hong Kong DVD release.\n\nThe drama scenes between Leslie Cheung and Brigitte Lin are very touching and real, and never unnatural or stupid. The main theme of the film is love and even more, trust between two human beings in love. The end in which we see what happened because of the lack of trust, is very sad and inconsolable for the protagonists. The themes in Bride With White Hair are universal and as topical and important and they were back then when the film was made. I think that Bride With White Hair is occasionally little too slow, and they should have shortened couple of scenes, but this is very minor flaw in a film that has so much merits and unique achievements.\n\nBride With White Hair's atmosphere is perhaps greater than most of other films' and I think that equal experience could be found only from other Hong Kong or Orient films, as Orient Cinema is so unique compared to most Western films. These Orient film makers have their style and ideas that have never been present in any Hollywood movie, for example, but Hollywood has (had?) its own merits, too, so I'm not understating Hollywood films blindly. Director Ronny Yu is perhaps best known for mass audiences for his Bride of Chucky (the fourth installment in the Child's Play series), but that film is very bad in my opinion, and it is made to please large pop corn audience without any willing to use brains, so don't judge Ronny Yu for Bride of Chucky, if that is the only film you've seen from him. I think it is every director's destiny to make sometimes less personal films because of monetary reasons.\n\nBride With White Hair is pure Hong Kong classic and almost unbeatable in every level. It can be described as horror, fantasy, romance, action, martial arts and adventure and it is perfect combination of all these. 9/10 masterpiece and doesn't get full ten from me only because of occasional slow moments that could have been tightened. But still, this film is definitely proudly under the phrase \"Masterpiece\" due to its many cinematic merits and elements I've tried to describe above.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1820301849",
        "name": "The Bride With White Hair",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTczYzdlZTQtYjlkZS00MzliLWI1M2EtZGViMWZiYjA4OGIxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTczYzdlZTQtYjlkZS00MzliLWI1M2EtZGViMWZiYjA4OGIxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-02-14T06:39:25Z",
        "url": "https://www.imdb.com/video/vi1820301849/"
    },
    "url": "/title/tt0106342/"
}