{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elijah Wood",
            "url": "/name/nm0000704/"
        },
        {
            "@type": "Person",
            "name": "Ian McKellen",
            "url": "/name/nm0005212/"
        },
        {
            "@type": "Person",
            "name": "Orlando Bloom",
            "url": "/name/nm0089217/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1901557,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046203/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0061706/"
        },
        {
            "@type": "Person",
            "name": "J.R.R. Tolkien",
            "url": "/name/nm0866058/"
        },
        {
            "@type": "Person",
            "name": "Fran Walsh",
            "url": "/name/nm0909638/"
        },
        {
            "@type": "Person",
            "name": "Philippa Boyens",
            "url": "/name/nm0101991/"
        }
    ],
    "datePublished": "2001-12-19",
    "description": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
    "director": [
        {
            "@type": "Person",
            "name": "Peter Jackson",
            "url": "/name/nm0001392/"
        }
    ],
    "duration": "PT2H58M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "keywords": "ring,quest,hobbit,middle earth,elf",
    "name": "The Lord of the Rings: The Fellowship of the Ring",
    "original_info": {
        "id": "The Lord of the Rings: The Fellowship of the Ring: Extended Edition_2001",
        "name": "The Lord of the Rings: The Fellowship of the Ring: Extended Edition",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Rinaear"
        },
        "dateCreated": "2002-10-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120737/"
        },
        "name": "Embrace the magic",
        "reviewBody": "It is with no surprise that Peter Jackson's The Fellowship of the Ring film has received such mixed critics. Many viewers refer to it as being childish, boring and uninteresting. Seems to me that it is bound to the same fate of Tolkien's books, destined to be a target for the same type of misunderstandings that keep attacking this literary masterpiece many decades after it's first publication.\n\nHaving read the books several years ago, I went to see this `impossible' film when it came out with many doubts on my mind. I really liked it, but left the theater with as many doubts as I had before. Was it perfect? Well, maybe not, but what an achievement. After watching it a few times on DVD, and thinking about it for some time now, I find myself loving this film more and more. Let me tell you why...\n\nThe Lord of the Rings is a fairy-tale of myth and fantasy. Peter Jackson directed a film that was considered, for a very long time, impossible to make, and not only for technical reasons. The narrative roots are incredibly long and detailed, and the storyline is deeply connected with the creation of a fantastic continent from a time unknown called `Middle Earth'. It's author, Tolkien, dedicated a considerable part of his life developing this continent's background, it's mythology and origins, it's different kinds of people, cultures and languages, and therefore it's geographic references are determinant to the unfolding of the story of the One Ring.\n\nPeter Jackson went out to achieve the impossible and came out with a recreation of the original that is pure and true to the story in every detail. The first time the four hobbits meet a black rider on the road, for example, is absolutely faithful to the feeling of the book. The assault of the riders at Weathertop is another great example, and it captures that feeling of danger, density and atmosphere that are the main characteristics of the tale. Jackson also took some liberties with the story, and made some right choices along the way. If the so called `purists' may not approve the removal of Tom Bombadil altogether, it should be comprehensible that the travel from Hobbiton to Rivendel is a very long and detailed one and could easily make a movie on it's own. I felt more uneasy with how short the Council of Elrond was. In the book, the council is where the whole story of the rings is first explained, and many passages from the past ages of Middle Earth are unveiled. It is a fascinating moment of the story, that had to be shortened for obvious reasons. Still, after some consideration, I now agree with the options made by Peter Jackson, and think that the movie prologue narrated by Galadriel was the wisest choice. The magic is all there when Gandalf shuts his eyes the moment Frodo stands in the council and says `I will take the ring'. It is there at Moria's Gate, and at the fall of Boromir. It is a powerful film that doesn't fit the rhythm of the standard Hollywood action movie. It is a film that breeds, that takes time to unfold, it's tale branching in every direction.\n\nI could go on and on, talking about all the different elements that bring this film close to perfection, but I'll end saying that deep down, this is not about action, beards and big monsters. The greatest thing about this film, to me, is that it brought me back to a time when I was in love with a different world where everything was possible. Reading The Lord of the Rings night after night, I came to understand what this thing of `mankind' really was all about. The corruption of absolute power, the importance and value of friendship, the inevitability of growing up, the strength of hope... That this film could capture that magic, and be a new bearer to it's message of humanism, is a statement to it's greatness. Gandalf's words, that even the smallest person may change the course of the world, and have a part to play in the destiny of all, are immortal.\n\nIn the end, this is a wonderful film, but that doesn't mean you are going to like it. I cannot tell you what it is like to see this film if you don't know or love the book. But I hope it may plant a seed on your heart to discover a great world of fantasy, beauty and humanity. I believe Tolkien would have liked that."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A shy young hobbit named Frodo Baggins inherits a simple gold ring. He knows the ring has power, but not that he alone holds the secret to the survival--or enslavement--of the entire world. Now Frodo, accompanied by a wizard, an elf, a dwarf, two men and three loyal hobbit friends, must become the greatest hero the world has ever known to save the land and the people he loves.",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi684573465",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzQ2YjI2YzgtZmNmMy00ZjUyLWE0NGItY2Y3NjUzZWM4NmM3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzQ2YjI2YzgtZmNmMy00ZjUyLWE0NGItY2Y3NjUzZWM4NmM3XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-12-20T13:23:10.483Z",
        "url": "https://www.imdb.com/video/vi684573465/"
    },
    "url": "/title/tt0120737/"
}