{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Landau",
            "url": "/name/nm0001445/"
        },
        {
            "@type": "Person",
            "name": "Jonathan Taylor Thomas",
            "url": "/name/nm0001795/"
        },
        {
            "@type": "Person",
            "name": "Geneviève Bujold",
            "url": "/name/nm0000991/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6084,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046718/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074787/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0210345/"
        },
        {
            "@type": "Person",
            "name": "Sherry Mills",
            "url": "/name/nm0590188/"
        },
        {
            "@type": "Person",
            "name": "Steve Barron",
            "url": "/name/nm0006625/"
        },
        {
            "@type": "Person",
            "name": "Tom Benedek",
            "url": "/name/nm0070676/"
        }
    ],
    "datePublished": "1996-07-26",
    "description": "One of puppet-maker Geppetto's creations comes magically to life. This puppet named Pinocchio has one major desire, to become a real boy someday, but he has to learn to act responsibly.",
    "director": [
        {
            "@type": "Person",
            "name": "Steve Barron",
            "url": "/name/nm0006625/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDdiZWM4ZDAtYTM2Yi00MDg3LTk4MTItZjc3Y2Y2YzI0ZTcyXkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_.jpg",
    "keywords": "close up of eyes,child turning into animal,pinocchio character,boy,slow motion scene",
    "name": "The Adventures of Pinocchio",
    "original_info": {
        "id": "The Adventures of Pinocchio_1996",
        "name": "The Adventures of Pinocchio",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Beta_Gallinger"
        },
        "dateCreated": "2010-08-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0115472/"
        },
        "name": "A seemingly rushed and somewhat annoying version of the story",
        "reviewBody": "I remember back around the time this 1996 version of \"Pinocchio\" was released (not sure whether it was around the time of its theatrical release or its home video release). I saw the promotional image of a wooden Pinocchio looking at a real version of himself like a reflection in the water, and later saw a trailer for this adaptation of Carlo Collodi's story on TV. Even though I was very familiar with the classic 1940 Disney version, I never actually saw this movie when it was new, not that I was missing much. Well over a decade later, I finally saw it just last night. By this point, I knew it wasn't a very popular film, so my expectations weren't very high, and it's a good thing they weren't, since I found \"The Adventures of Pinocchio\" to be below average! \n\nPinocchio is a wooden puppet carved by a woodcutter and puppet maker named Geppetto. Soon after he finishes making this puppet figure of a boy, it magically comes to life! Even though Pinocchio is still wooden, he can now move and talk, but doesn't know much about the world around him. He wants to be a real boy, but has a lot to learn before that can happen. While walking out with Geppetto, he meets some schoolchildren and wants to go to school himself. He also catches the attention of two criminals named Felinet and Volpe, and is soon wanted by the evil Lorenzini! At school, Pinocchio punches a classmate and lies to the teacher about it, causing his nose to grow longer with each lie, and after he finally confesses, he is kicked out of class. He then goes to a bakery, where he causes chaos, and for this, he and Geppetto are both taken to court! They will both be sent to prison unless Gepetto can pay for the damages, which he can't, so Lorenzini offers to pay, but only if Pinocchio is given to him. Eventually, Geppetto reluctantly gives in and Lorenzini gets the puppet, but it turns out Pinocchio is not safe with him! The living wooden puppet finds himself on an adventure full of danger, with a wise cricket named Pepe often appearing to give him advice! \n\nThis film adaptation begins with a poor opening narration from David Doyle, which turns out to be the voice of Pepe the Cricket. This character is supposed to be funny, but he fails. The same goes for the rest of the film's humour in general, in scenes such as the havoc Pinocchio wreaks in the bakery. It's not funny when it tries to be. Also, it seems Felinet and Volpe are supposed to be funny, but they also fail miserably, unlike Honest John and Gideon in the 1940 version. Some of the characters in this 1996 version may get a little annoying at times, including the title one, and I think this is when they're trying to be funny. The poor humour isn't the only problem here. \"The Adventures of Pinocchio\" seems rushed, going too fast and seeming to just throw in characters without taking enough time to introduce them, making them seem very insignificant. Geppetto certainly doesn't seem very surprised when he sees Pinocchio alive for the first time. The lack of focus even makes the story seem almost meaningless, even though it does include the morals of the story, but in a very ineffective manner! The film fails both at trying to be funny AND trying to be touching, except maybe near the end. I also didn't care for the design of the wooden Pinocchio's face and his facial expressions.\n\nI have never read the 19th century book, \"The Adventures of Pinocchio\", by Carlo Collodi, but have been familiar with the animated 1940 Disney flick from a very early age, so it's obviously hard for me not to compare these two films. I can't forget the times I saw the 1940 version as a kid, and I still thought that film was great when I watched it again a couple times in 2007, my first viewings of the classic piece of Disney animation since my childhood in the 90's. It has excitement, poignancy, and some good humour, and all this is more than I can say about the 1996 version. This movie does have some nice visuals, but that's the only positive thing I can think of to say about it, and that's certainly not enough to make it worthwhile. Some movies can improve with a second viewing, but I can't imagine how I could ever warm up to this mess of a live action adaptation of Collodi's story, so I don't intend to watch it again. If the screenplay had been better written, it could have made a really good family movie, but due to its poor quality and lack of focus, the film's results were disappointing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from New Line Home Entertainment",
        "duration": "PT1M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi176750873",
        "name": "The Adventures of Pinocchio",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmE5NjEwZTItZGY4MS00NTliLTgxMzctODE2MjAwNGM2NTE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmE5NjEwZTItZGY4MS00NTliLTgxMzctODE2MjAwNGM2NTE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:09:37Z",
        "url": "https://www.imdb.com/video/vi176750873/"
    },
    "url": "/title/tt0115472/"
}