{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kurt Russell",
            "url": "/name/nm0000621/"
        },
        {
            "@type": "Person",
            "name": "Wilford Brimley",
            "url": "/name/nm0000979/"
        },
        {
            "@type": "Person",
            "name": "Keith David",
            "url": "/name/nm0202966/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 434172,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004522/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0220554/"
        },
        {
            "@type": "Person",
            "name": "Bill Lancaster",
            "url": "/name/nm0484111/"
        },
        {
            "@type": "Person",
            "name": "John W. Campbell Jr.",
            "url": "/name/nm0132168/"
        }
    ],
    "datePublished": "1982-06-25",
    "description": "A research team in Antarctica is hunted by a shape-shifting alien that assumes the appearance of its victims.",
    "director": [
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGViZWZmM2EtNGYzZi00ZDAyLTk3ODMtNzIyZTBjN2Y1NmM1XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "isolation,antarctica,paranoia,alien creature,shapeshifting",
    "name": "The Thing",
    "original_info": {
        "id": "The Thing_1982",
        "name": "The Thing",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Rainfox"
        },
        "dateCreated": "2000-05-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0084787/"
        },
        "name": "Good things come to those who wait",
        "reviewBody": "* * * * ½ (4½ out of 5)\n\n The Thing\n\n Directed by: John Carpenter, 1982\n\n Looking back on John Carpenter's The Thing  today a highly treasured cult favourite  one has to wonder why it was dismissed by both the audience and critics when it first came out in 1982.\n\n Steven Spielberg's extra terrestrial adventure about a sweet alien that phoned home (that stole the hearts of both children and adults world wide) had opened just two weeks before and was on its historic box office rampage. Bad scheduling may have had a greater impact than anything else on the fate of Carpenter's first big studio effort for Universal Pictures. Nobody was prepared  moreover wanted anything so dark, gory and scary as this genuine remake of the famous 1951 original. This was the time of E.T.: The Extra-Terrestrial.\n\n It then makes for great movie history trivia, that The Thing has gained such a remarkable afterlife on video, DVD and television. Both financially and critically. Carpenter's version is less a remake of the Howard Hawks' version than a more faithful adaptation of John W. Campbell's short story \"Who Goes There?' (on which both were based), and critics today point out how well Carpenter plays his characters against each other. Kurt Russell will never top this one, and he gets a brilliant sparring from the entire cast.\n\n It opens in Antarctica with a sled husky running from a pair of crazed and armed Norwegian men in a helicopter. The scene is long, slow and uneasy. It feels like the Apocalypse. It oozes doomsday.\n\n This scene comprises one of the greatest opening sequences in film history.\n\n Ennio Morricone's moody synth score (heavy on naked thumping bass lines in classic Carpenter style), the windswept massive white of the desolate polar ice and the majestic husky running across the tundra chased by the chopper, compromises a completely mesmerizing piece of scenery.\n\n A satisfying example of a movie that today  18 years after  looks downright muscular in its simplicity.\n\n The budget was big ($14 mill), yet it allowed Carpenter to visualize his ideas better than ever before. There's a brooding darkness to this film, making the whites and blues of the icy Antarctic claustrophobia seem poetic and almost angelic. Dean Cundey's extraordinary photography created a palpable chill to every shot. The careful preparation (the crew went into a record 11-month pre-production) paid off immensely.\n\n Horror specialist Rob Bottin was handpicked for the many gory and grotesque special effects. Be warned  there's a lot of splatter and gore here. The Thing is actually notorious for its creature morphing scenes. Some find them disgusting, some mere cult.\n\nAn argument could be made against The Thing being an Alien rip-off; it has its origins in an old sci-fi story and it creates tension by popping a crowd of people (note: all-male) on an isolated outpost (an Antarctic research facility) terrorized by an alien life form.\n\n Where Carpenter was clearly inspired by Ridley Scott's 1979 masterpiece, his own alien movie is original and intriguing in its own right. There's a rhythm and an environment that equals Scott's in every way.\n\n The husky was in fact half-wolf and half-dog, and it was noted that it never barked or growled on or off the set (Horror Takes Shape, the making of - DVD version).\n\n Watch in awe at the scene where it walks through the hallway and stares at a human shadow, slightly tilting its head forward in stalking position like a wild wolf. This is a fine piece of animal training, sure, but that's not the point. This is as spooky as anything ever made in a horror movie.\n\n Carpenter had all the right tools here, and he utilized them to perfection, making The Thing his best movie alongside Halloween."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Scientists in the Antarctic are confronted by a shape-shifting alien that assumes the appearance of the people that it kills.",
        "duration": "PT1M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2298151193",
        "name": "The Thing",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzBhZmNmYzgtMmZkMC00ODYxLWJiYjctOGFkOTYwMWZhZDk4XkEyXkFqcGdeQWpvaG5oYXJ0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzBhZmNmYzgtMmZkMC00ODYxLWJiYjctOGFkOTYwMWZhZDk4XkEyXkFqcGdeQWpvaG5oYXJ0._V1_.jpg",
        "uploadDate": "2008-04-11T17:15:47Z",
        "url": "https://www.imdb.com/video/vi2298151193/"
    },
    "url": "/title/tt0084787/"
}