{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Judy Davis",
            "url": "/name/nm0001114/"
        },
        {
            "@type": "Person",
            "name": "James Brolin",
            "url": "/name/nm0000981/"
        },
        {
            "@type": "Person",
            "name": "Zeljko Ivanek",
            "url": "/name/nm0411964/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 751,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0086397/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0091980/"
        },
        {
            "@type": "Person",
            "name": "Carl Sferrazza Anthony",
            "url": "/name/nm1505572/"
        },
        {
            "@type": "Person",
            "name": "Jane Marchwood",
            "url": "/name/nm1499846/"
        },
        {
            "@type": "Person",
            "name": "Thomas Rickman",
            "url": "/name/nm0725564/"
        }
    ],
    "datePublished": "2003-11-30",
    "description": "A non-partisan telling of the marriage and political career of Ronald and Nancy Reagan. The movie tells a tale of love, devotion, controversy, and patriotism.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Allan Ackerman",
            "url": "/name/nm0010012/"
        }
    ],
    "duration": "PT2H51M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzA2ODA0Mjg4Nl5BMl5BanBnXkFtZTcwNzU2MzUyMQ@@._V1_.jpg",
    "keywords": "family character name as title,the white house washington d.c.,reference to barry goldwater,reference to gerald r. ford,reference to jimmy carter",
    "name": "The Reagans",
    "original_info": {
        "id": "The Reagans_2003",
        "name": "The Reagans",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cariart"
        },
        "dateCreated": "2004-05-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0383139/"
        },
        "name": "Superficial, Narrow-Minded Partisan TV Bio...",
        "reviewBody": "It's easy to accuse anyone who dislikes Robert Allan Ackerman's 'Looney Tune' production of \"The Reagans\" as a conservative biased in favor of the near-legendary President, but in all honesty, a hatchet job is a hatchet job, no matter what your political persuasion, and this film is nothing less, wrapped up in gauzy nostalgic ribbons.\n\nFrom the opening scenes in late-forties Hollywood, as an already brain-dead Ronald (caricatured by a too-old-for-this-sequence James Brolin) is manipulated by a glowering, 'agenda'-driven Nancy Davis (Judy Davis, rechanneling her shrewish performance from ABSOLUTE POWER) into a date, the pair are not presented as balanced human beings, but cartooned clichés of the worst qualities their critics would accuse them of, years later (He is incapable of an original thought, she is hardly better, solely basing her opinions on 'fan' magazines, and, later, astrologers).\n\nAs the aged conservative power brokers (all pictured as rich, chain-smoking, self-serving vultures) twist the gullible half-wit Ronald into becoming their puppet, Nancy does a MOMMY DEAREST routine, callously using both their children and Ronald's by Jane Wyman to further her own ambitions (lest you feel any sympathy for the siblings, THEY are cartooned, too).\n\n Long before the nearly nightmarish vision of Reagan's Presidential years, you are thoroughly convinced that a) Ronald and Nancy needed psychiatric help more than the Oval Office; b) the Reagan kids needed a shrink even WORSE; and c) all Republicans are either young and cynical or old and corrupt.\n\nAnd how are the Democrats represented? Ah, they never appear! In a 'balanced' production, shouldn't both sides be represented? Otherwise, Reagan's personal attitudes and political beliefs cannot be rationalized...and this is just one reason why the film is really nothing more than a hatchet job. \n\nWhen Reagan does something 'laudable' (like ending the 'Cold War'), it is merely a lucky accident, stumbled upon in the midst of bad decisions, between infamous 'naps', while Nancy lashes out at everyone.\n\nI won't go on...this film is a disservice to the memories of people who, while not perfect, were certainly not idiots!"
    },
    "url": "/title/tt0383139/"
}