{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Lemmon",
            "url": "/name/nm0000493/"
        },
        {
            "@type": "Person",
            "name": "Walter Matthau",
            "url": "/name/nm0000527/"
        },
        {
            "@type": "Person",
            "name": "Susan Sarandon",
            "url": "/name/nm0000215/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14175,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Ben Hecht",
            "url": "/name/nm0372942/"
        },
        {
            "@type": "Person",
            "name": "Charles MacArthur",
            "url": "/name/nm0531269/"
        },
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        }
    ],
    "datePublished": "1974-12-20",
    "description": "A ruthless editor tries to get his top reporter to cover one more crime story before retirement.",
    "director": [
        {
            "@type": "Person",
            "name": "Billy Wilder",
            "url": "/name/nm0000697/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDYxMzQwZTctNWNlNi00NjE4LTk4YzgtZDc1YmNmMmZhOTM3XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "chicago illinois,journalism,based on play,screwball comedy,reporter",
    "name": "The Front Page",
    "original_info": {
        "id": "The Front Page_1974",
        "name": "The Front Page",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "StevePulaski"
        },
        "dateCreated": "2014-02-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0071524/"
        },
        "name": "My kind of news Chicago has",
        "reviewBody": "A satire on journalism seems to be the topic no filmmaker wants to touch, although I personally see the opportunity as a limitless one. With the modern era bringing forth the creation of the internet along with the concepts and ideas of information overload, misinformation, the idea that news is no long about being correct but rather being first, and the controversial and vague lines that determine whether or not websites like Reddit and Wikipedia are actually reliable sources are all things that could make a satire on modern-era journalism click on sight.\n\nMaybe it's because I'm currently examining the journalism mediums in a high school source that I'd anxiously anticipate a satire on contemporary journalism if it were to be handled by someone delicately. For now, though, Billy Wilder's The Front Page is a fine film to hold one over. Immediately, the film is buoyed band blessed by having both Jack Lemmon and Wlater Matthau as its headlines, two fantastic actors whose work is only enhanced when they're placed in a film together. With The Front Page makes one of the earliest pairings of the two actors, almost ten years after the release of Gene Saks' The Odd Couple and about two decades before the wildly popular Grumpy Old Men films.\n\nSet in the 1920's, Lemmon and Matthau star as Hildebrand \"Hildy\" Johnson and Walter Burns. Hildy is about to resign and retire from his position as ace-reporter of the Chicago Examiner but Walter, his editor, will have none of it. For years, he has trusted Hildy to write intelligent articles covering issues in the world in order to produce one of the finest papers around. But Hildy has other plans, to marry his new love (Susan Sarandon) and see the world are just a few of them. But when a checkered and incredibly juicy story comes along, Walter hopes to keep his star reporter one last time to write what may be the most outlandish story of his life.\n\nLike most Lemmon/Matthau efforts, the real treat at hand is watching the chemistry of the leading men as they recite scripted dialog in such an elegant way that it conveys the buddy-to-buddy naturalism of a certain situation. Wilder and co-writer I.A.L. Diamond provide the men with several opportunities to put their loquaciousness to the test as the camera finds a way to fixate on them for several minutes at a time as the two bat off rapid-fire dialog at one another.\n\nIt is this chemistry that makes The Front Page a good piece of work and all the more fun, especially in the present time as it shows the functionality of old-school journalism and reporting and how journalists back in the day worked and operated. It's also hard to neglect a supporting cast made up of Carol Burnett, Susan Sarandon, and Charles Durning who, in some way, contribute to the film's overall success as a whole. And let us not forget the incredible talent of Billy Wilder, who takes one of the most cleaned-up occupations of the Roaring Twenties and Great Depression-era and turns it into complete lunacy, filled with those who go to astounding lengths to achieve a story worthy of the front page. Run and print that.\n\nStarring: Jack Lemmon, Walter Matthau, Susan Sarandon, Charles Durning, and Carol Burnett. Directed by: Billy Wilder.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0071524/"
}