{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Barry Humphries",
            "url": "/name/nm0402032/"
        },
        {
            "@type": "Person",
            "name": "Emily Perry",
            "url": "/name/nm0675056/"
        },
        {
            "@type": "Person",
            "name": "Robin Houston",
            "url": "/name/nm0396886/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 243,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017529/"
        }
    ],
    "datePublished": "1987-09-12",
    "description": "In each of these comical talk-show-parodies, without actual script continuity, the outrageously frocked diva-type character Dame Edna Everage, a transvestite part of Australian comedian Barry Humphries, receives in her exclusive, ...",
    "genre": [
        "Comedy",
        "Talk-Show"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAzNDUxMzA2NV5BMl5BanBnXkFtZTcwMDUwNDYyMQ@@._V1_.jpg",
    "keywords": "character name in series title,four word series title,dame edna character,cross dresser,gay interest",
    "name": "The Dame Edna Experience",
    "original_info": {
        "id": "The Dame Edna Experience: Series 2_1987",
        "name": "The Dame Edna Experience: Series 2",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2013-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0126151/"
        },
        "name": "Hilarious",
        "reviewBody": "Barry Humphries is Dame Edna Everidge in \"The Dame Edna Experience,\" a riotously funny talk show from England. At the beginning of each episode, Dame Edna, after an introduction that has her standing with the Queen, the Prime Minster and various others, stands at the top of a tall staircase, yells \"Hello, Possums!\" and reveals herself in an outrageous gown and walks down the stairs to music and thunderous applause. She then introduces her former bridesmaid when she married Norm, Madge (Emily Perry) who sits straight-faced through the entire show.\n\nDame Edna's guests are an eclectic bunch, everyone from Sir Cliff Richard, Grace Jones, Jerry Hall, Liza Minnelli, Lauren Bacall, Tom Jones, Tony Curtis, Charlton Heston (who went careening down aforementioned staircase in a wheelchair after a tennis accident -- all a bit, of course), and some British celebrities and politicians not known in this country. She left Jane Fonda out on her stoop and never did let her in.\n\nThe guests very often are reduced to laughing out loud, obviously not knowing what's going to come out of her mouth. In the second season, Dame Edna moved her show into her luxurious apartment, 34 floors up with an elevator that winds up trapping Tom Jones and injuring British actors David Suchet, Malcolm MacDowell, and several others in a very funny sequence. It was out of service when Douglas Fairbanks, Jr. came on the show, so he walked up the 34 flights with her groceries.\n\nThere's usually a musical number at the end of a show that goes way too quickly. I can only say, I wish I had Dame Edna's legs.\n\nVery funny and great to see if you're feeling down.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0126151/"
}