{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Jessica Barden",
            "url": "/name/nm1875238/"
        },
        {
            "@type": "Person",
            "name": "Alex Lawther",
            "url": "/name/nm3867299/"
        },
        {
            "@type": "Person",
            "name": "Steve Oram",
            "url": "/name/nm1361530/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 199567,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0165031/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0480727/"
        }
    ],
    "datePublished": "2017-10-24",
    "description": "James is 17 and is pretty sure he is a psychopath. Alyssa, also 17, is the cool and moody new girl at school. The pair make a connection and she persuades him to embark on a road trip in search of her real father.",
    "genre": [
        "Adventure",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2ZhNmQ2MjQtMmQzMi00YjE5LTlkMWMtMjk5YzIxMjk2NDc2XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
    "keywords": "teenager,coming of age,murder,united kingdom,censored profanity in title",
    "name": "The End of the F***ing World",
    "original_info": {
        "id": "The World of Narue_2004",
        "name": "The World of Narue",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "grantss"
        },
        "dateCreated": "2019-03-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt6257970/"
        },
        "name": "Superb: wonderfully dark, funny, quirky and engaging",
        "reviewBody": "(Updated after Season 2).\n\n17-year old James is not your average teenager. He is convinced he is a psychopath and, as such, plans to go on a murder spree. At school he meets Alyssa, who is also far from average: intense, unpredictable, volatile and cynical. A friendship forms and, due to their unhappy home lives, they run away together. However, what started as a harmless act of rebellion soon has dark consequences, leaving them on the run.\n\nSuperb. From the outset the series is great: the characters are dark yet funny and engaging and there is a quirkiness that balances the humour and darkness. Solid plot, with clever developments and sub-plots and great character depth and development. Emotional ending.\n\nOne of the main reasons for the engagement and entertainment of the series are the lead performances. Jessica Barden is superb as Alyssa: over-the-top and intense with spot-on mannerisms and superb comedic timing. Alex Lawther plays the straight character to Alyssa's kookiness and does it with aplomb. The chemistry between them is great too.\n\nRounding it all off is brilliant soundtrack, one of the best you'll hear in a TV series. A great selection of tracks, all of which fit in perfectly with the series.\n\nSeason 1 ended so emotionally and poetically I sort of wished there wasn't going to be a Season 2. There is a Season 2, and it doesn't disappoint. Not quite as riveting as Season 1: we already know the main characters now and the plot development in Season 2 is a bit stop-start. Season 1 seemed to have better momentum.\n\nSeason 2 is still great though, and possibly even funnier than S1. Plus, we have a new character that will have a profound impact on the story...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "As Alyssa contends with the fallout of events of the first season, an outsider with a troubled past and a mysterious connection to Alyssa appears.",
        "duration": "PT1M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3924541209",
        "name": "Season 2 Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjk4NTA0ZGEtOGUwYy00Nzk3LWJmZjEtNGViZTI5MjQ4M2NkXkEyXkFqcGdeQWFybm8@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjk4NTA0ZGEtOGUwYy00Nzk3LWJmZjEtNGViZTI5MjQ4M2NkXkEyXkFqcGdeQWFybm8@._V1_.jpg",
        "uploadDate": "2019-10-30T16:09:15.467Z",
        "url": "https://www.imdb.com/video/vi3924541209/"
    },
    "url": "/title/tt6257970/"
}