{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Andy Griffith",
            "url": "/name/nm0341431/"
        },
        {
            "@type": "Person",
            "name": "Ron Howard",
            "url": "/name/nm0000165/"
        },
        {
            "@type": "Person",
            "name": "Don Knotts",
            "url": "/name/nm0461455/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15701,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070627/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0241671/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023808/"
        },
        {
            "@type": "Person",
            "name": "Sheldon Leonard",
            "url": "/name/nm0502766/"
        },
        {
            "@type": "Person",
            "name": "Aaron Ruben",
            "url": "/name/nm0747826/"
        },
        {
            "@type": "Person",
            "name": "Danny Thomas",
            "url": "/name/nm0858683/"
        }
    ],
    "datePublished": "1960-10-03",
    "description": "Widower Sheriff Andy Taylor, and his son Opie, live with Andy's Aunt Bee in Mayberry, North Carolina. With virtually no crimes to solve, most of Andy's time is spent philosophizing and calming down his cousin Deputy Barney Fife.",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzU4OTU2MDAxM15BMl5BanBnXkFtZTcwMzI4MjQ0MQ@@._V1_.jpg",
    "keywords": "1960s,widower,sheriff,unseen character,town drunk",
    "name": "The Andy Griffith Show",
    "original_info": {
        "id": "The Andy Griffith Show: Season 1_1960",
        "name": "The Andy Griffith Show: Season 1",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lugonian"
        },
        "dateCreated": "2004-01-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053479/"
        },
        "name": "The Life and Times of Sheriff Andy Taylor",
        "reviewBody": "THE ANDY GRIFFITH SHOW (CBS, 1960-1968) is not only Andy Griffith's first TV show, but his best. Griffith, who made his mark on Broadway, TV and screen adaptation of NO TIME FOR SERGEANTS, might have turned that into a weekly comedy series. Instead, Griffith was offered an original premise about the life and times of a southern sheriff in Mayberry. With the show's opening shows off a father and his young son walking towards the pond with fishing poles carried over their shoulders to whistling score, \"The Fishing Hole,\" it's become one of those rare cases where a series, lasting eight successful seasons, to resume that same basic introduction. There were some minor changes over the years where it converted from black and white to color, and the growth of the sheriff's young son. During its eight seasons, this wholesome sit-com not only centered upon Sheriff Andy Taylor (Andy Griffith), but on the citizens of Mayberry, North Carolina. Naturally a series with such a lengthy run would go through some dramatic or necessary changes, such as the loss of certain characters, (Deputy Barney Fife), and addition of others (Goober Pyle, Howard Sprague), having one basic show with two different formats.\n\nAndy Taylor is described as an easy-going, sometimes laid back sheriff seldom in complete uniform, unlike his bumbling deputy, Barney Fife, who not only dresses accordingly, ranging from tie, hat and a gun in his holster containing one bullet.going strictly by the book of the law. Together Andy and Barney team up for some humorous police work with Andy playing the straight man, and Barney providing his quota of laughs. At times, Barney becomes the bumbling fool in the eyes of the people. It is up to Andy to prove them wrong by helping Barney restore his confidence usually by giving Barney the credit actually due to the sheriff himself. Aside from their professions in keeping law and order in Mayberry, certain episodes would set focus on their personal lives, particularly on Andy, a widower/ father to his young son named Opie (Ronny Howard), cared for at home by his matron Aunt Bee (Frances Bavier). The first season to THE GRIFFITH SHOW did find Andy romantically involved with Ellie Walker (Elinor Donahue), the lady druggist. Seasons two and three found Andy sporadically having new love interests. By the time he acquired one in Helen Crump (Aneta Corsaut), Opie's school teacher, Andy lost his strong Southern accent for more natural tone. As for Barney, he's a carefree bachelor with his heart set on Thelma Lou (Betty Lynn). Unlike Andy (who would make Helen his bride in the premiere spin off series of MAYBERRY RFD in 1968), Barney would never marry.\n\nAfter five seasons of black and white episodes, the remaining three seasons converted to color. Aside from that change, the Barney Fife character was gone, but not forever, making occasional returns once or twice a year for old times' sake. During Barney's absence, Andy acquired a substitute deputy, Warren (Jack Burns), written out of the show after 12 episodes, leaving Andy to sheriff about town alone and deputy position permanently vacant. With passage in time, Andy's police work would become less frequent, having ts main focus more on Andy's home-life and citizens of Mayberry. Otis (Hal Smith), the town drunk, would eventually be phased out.\n\nWhile normally programs such as this losing a key supporting character such as Don Knotts would suffer in the ratings, THE ANDY GRIFFITH SHOW continued to prosper for the next three years, becoming the number one show by the time Griffith gave up his badge by the end of the eighth season (1968). By then, the show acquired additional characters to the lineup: Goober Pyle (George Lindsay), Howard Sprague (Jack Dodson) and handyman, Emmett Clark (Paul Hartman), who replaced by Floyd, the Barber (Howard McNear), upon his death during the 1967-68 season; Clara Jackson, later Edwards (Hope Summers), Bee's closest friend; all new characters part of the Mayberry family.\n\nWhat has become the secret to the success of THE ANDY GRIFFITH SHOW? Was it the father and son relationship between Andy and Opie, (who affectionately calls addresses him as \"Paw.\")? The chemistry between best friends Andy and Barney? Or the now familiar faces and classic characters who took part as citizens of Mayberry that made the show special? One thing for sure, there's nothing dated about THE ANDY GRIFFITH SHOW. It could be set anywhere at anytime, since it hardly dealt with issues or political issues of the day. \n\nDuring its initial years, THE ANDY GRIFFITH SHOW played funny without becoming too silly, except in some cases with the wild and crazy Ernest T. Bass (Howard Morris). The final years dealt more on serious issues without getting overly sentimental, though some early ones, \"Opie the Birdman\" (1962) and \"Aunt Bee's Romance\" (1964) went strictly on the dramatic side. The final three seasons moved towards a more wholesome, down to earth setting, even modernizing Aunt Bee from homemaker to independent woman acquiring both a driver's and pilot's license, and the teenage Opie having new friends (Johnny Paul and then Arnold), interests in girls and becoming part a rock and roll band. \n\nWhile the Andy Taylor character had been originally introduced in an episode of MAKE ROOM FOR DADDY (1959) starring Danny Thomas, characters introduced on THE GRIFFITH SHOW spawned spin-offs as well: Gomer Pyle (Jim Nabors), for GOMER PYLE, USMC, and Sam Jones (Ken Berry) for MAYBERRY, RFD.\n\nAfter THE ANDY GRIFFITH SHOW ended its run in 1968, it has never gone from view. Many of its 249 episodes in reruns have become favorites, even classics, especially those involving Barney Fife. These and other shows can still be seen and appreciate in its seasonal package on DVD or countless other cable TV channels. (****)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The Ballad of Andy and Barney - MeTV promo for",
        "duration": "PT34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi481018137",
        "name": "The Andy Griffith Show - MeTV",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzA2NDM1YTEtOTViZS00MTlmLTliMDAtZTI4ODU4Y2M5NzNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzA2NDM1YTEtOTViZS00MTlmLTliMDAtZTI4ODU4Y2M5NzNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-09-22T15:20:36.053Z",
        "url": "https://www.imdb.com/video/vi481018137/"
    },
    "url": "/title/tt0053479/"
}