{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gene Hackman",
            "url": "/name/nm0000432/"
        },
        {
            "@type": "Person",
            "name": "Roy Scheider",
            "url": "/name/nm0001702/"
        },
        {
            "@type": "Person",
            "name": "Fernando Rey",
            "url": "/name/nm0721073/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 126542,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0677209/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045508/"
        },
        {
            "@type": "Person",
            "name": "Ernest Tidyman",
            "url": "/name/nm0862781/"
        },
        {
            "@type": "Person",
            "name": "Robin Moore",
            "url": "/name/nm0601811/"
        }
    ],
    "datePublished": "1971-10-09",
    "description": "A pair of NYPD detectives in the Narcotics Bureau stumble onto a heroin smuggling ring based in Marseilles, but stopping them and capturing their leaders proves an elusive goal.",
    "director": [
        {
            "@type": "Person",
            "name": "William Friedkin",
            "url": "/name/nm0001243/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTZhY2E3NmItMGIwNi00OTA2LThkYmEtODFiZTM0NGI0ZWU5XkEyXkFqcGdeQXVyNTc1NTQxODI@._V1_.jpg",
    "keywords": "based on true story,triggerman,criminal investigation,heroin,smuggling",
    "name": "The French Connection",
    "original_info": {
        "id": "The French Connection II_1975",
        "name": "The French Connection II",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gab-14712"
        },
        "dateCreated": "2017-10-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0067116/"
        },
        "name": "Gene Hackman's Show!",
        "reviewBody": "I remember watching The French Connection for the first time several years ago. I knew people regarded it as an instant classic, so I was expecting to love it. But the power of subjectivity appeared, and it turned out I didn't like it all too much. In discussions with cinema lovers, I was lambasted because people see this as one of the all-time greats. I watched this for a second time recently, and how about that! My opinion changed. While not calling this film an all-time great, I do respect and like it very much. The film fits the definition of a 70's American film. It is dark, gritty, and features some heavy violence. Also, the film happens to be home of one of cinema's greatest car chases. Essentially, the movie is a giant chase but that particular car chase is something else. I'll discuss it more later on in this review.\n\nThis Oscar-winning film takes us onto the streets of New York City following two detectives, Jimmy 'Popeye' Doyle (Gene Hackman) and his partner, Buddy Russo (Roy Scheider). Popeye is infamous for taking in street-level drug dealers, and at best his policework can be described as shady. He's violent drunk cop with low ethical standards, and his career is rapidly falling apart. But he seizes his biggest opportunity when he learns of a huge heroin shipment coming from France. Now we have an interesting contrast between Popeye and the heroin smuggler, Alain Charnier (Fernando Rey). I just mentioned Popeye has low moral standards, but he still is a dedicated cop. On the other hand, Charnier is a smooth gentleman that no one can predict he is a criminal. Now the standoff between the two men begins when Popeye does all he can to bring Charnier in.\n\nNow going back to that car chase! It was a wonderfully executed car chase and what I like is that it is all real. There was an actual chase filmed in Brooklyn exactly how you see it on screen. It's crazy too because the chase is about a simple car trying to outrun and outmaneuver a moving train which eventually has a dead conductor at the wheel. So then it turns into a psychologically-crazy man versus machine kind of chase. The chase also proves the recklessness of Popeye. He held no regard for the common people as he had close calls with them during the chase. He was basically using the people for his benefit.in an oddly positive way. Some of the camera techniques are very effective. They filmed in a way where the subjects are actually further away from the cars than shown on screen.which must have been a relief for some of the actors. But yes, this is one of the biggest car chases to have ever been filmed so this film is a must-see just for that.\n\nSpeaking of actors, well yes let's talk about the acting. Director William Friedkin famously did not want Gene Hackman in the lead role. Hackman, by 1971 was already a bankable star, but Friedkin did not think so. Luckily, they decided to cast Hackman anyway and it's a good thing they did. Hackman is one of those actors who can do any genre and always gives his best effort. I loved his performance here and his character was perhaps the only three-dimensional character in the film because the film spends so much time on him. But I was won over by Hackman almost right away. The scene where he enters a bar and violently asks everyone to turn out their pockets in the search for drugs-well, I knew I would be in for a treat. I was happy to see his performance win Best Actor at the Academy Awards. Roy Scheider does a solid job as Popeye's partner, but I didn't feel the same way for him as I did for Popeye. There was nothing much to do for him except to act as a backup. Same goes for Fernando Rey. A very solid performance, but his character was also under-utilized.\n\nThe French Connection is a violent, fast-paced film. I said in my opening the movie plays like one giant chase, but I liked the frenetic pacing of the movie. My favorite scene is no doubt that car chase, but I loved the smaller scenes especially the ones where Popeye is up to no good. I also loved the actual photography of the film. Sure, the movie is over forty years old but seeing the streets of my favorite city in the world always makes me happy as it brings back some fond memories. The film has a violent nature and it may take you by surprise, but this film is heralded by many as an instant classic. I may not think so, but I did enjoy it very much.\n\nMy Grade: B+",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The French Connection",
        "duration": "PT2M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2196898073",
        "name": "The French Connection",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTM3YmY5NjUtMjI5MS00MjM1LTk4ZjktMjBlMDdlN2UxYTJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTM3YmY5NjUtMjI5MS00MjM1LTk4ZjktMjBlMDdlN2UxYTJlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:43:14Z",
        "url": "https://www.imdb.com/video/vi2196898073/"
    },
    "url": "/title/tt0067116/"
}