{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gerard Butler",
            "url": "/name/nm0124930/"
        },
        {
            "@type": "Person",
            "name": "Emmy Rossum",
            "url": "/name/nm0002536/"
        },
        {
            "@type": "Person",
            "name": "Patrick Wilson",
            "url": "/name/nm0933940/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 125699,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051747/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058461/"
        },
        {
            "@type": "Person",
            "name": "Gaston Leroux",
            "url": "/name/nm0503693/"
        },
        {
            "@type": "Person",
            "name": "Andrew Lloyd Webber",
            "url": "/name/nm0515908/"
        },
        {
            "@type": "Person",
            "name": "Joel Schumacher",
            "url": "/name/nm0001708/"
        }
    ],
    "datePublished": "2005-01-21",
    "description": "A young soprano becomes the obsession of a disfigured and murderous musical genius who lives beneath the Paris Opéra House.",
    "director": [
        {
            "@type": "Person",
            "name": "Joel Schumacher",
            "url": "/name/nm0001708/"
        }
    ],
    "duration": "PT2H23M",
    "genre": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDczNzg4OTM3MV5BMl5BanBnXkFtZTcwOTQzMTEzMw@@._V1_.jpg",
    "keywords": "opera,mask,falling chandelier,singer,singing",
    "name": "The Phantom of the Opera",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "triple8"
        },
        "dateCreated": "2005-01-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0293508/"
        },
        "name": "Never loses it's beauty....",
        "reviewBody": "I have just come from seeing phantom and was completely swept away. The stage show is my all time favorite Broadway show and I was a bit nervous as to how Phantom and the music of the night would hold up on the big screen but I needn't have worried because it was very definitely worth the price of the ticket-and then some.\n\nThe movie, for the most part, retains much of the stage show, I'd say about 85 percent true to the show, though there were slight differences. The magic present in the show live, is still, for the most part, here on film. In fact, I was wondering if I would cry during the movie and of coarse I did. Phantom of the Opera's's loveliness is still so luminous and the movie just fills your senses. I don't think there was a sound in the theater during the whole movie.\n\nThe film's look-among the most riveting I've ever seen-colorful, rich and oozing vibrancy, the look and feel are just magnificent. I sure hope this movie wins some awards for it's costumes and Cinematography. At times, there was almost a bit TO much going on which, as my friends and I discussed takes the focus away from the music a bit and maybe(though I'm torn on this) they should have toned it down just a tiny tiny bit. Still, the look was so spectacular I'm not even sure I'd definitely have done that myself. But still, 10 of 10 for atmosphere.\n\nThe casting-pretty good for the most part. I simply cannot believe Emmy Rossum is only 18 years old, she is magnificent and I am in awe of her. She was a beautiful, lovely Christine and I think we'll be seeing a lot of her in the future.\n\nGerard Butler has been getting some flack. I actually liked him in the role of the phantom although I began to feel more strongly about his rightness as the movie went on, not right at the beginning. That is not because he wasn't good in the role, just different then the stage version. To me, his singing got more and more soulful as the movie went on and his acting was an A plus, he wasn't just there to sing and look pretty, he acted the heck out of the role and succeeded in elevating the phantom from just a presence to a tortured individual. People have been saying he's to good looking, well that's certainly not his fault!(though they really could have gotten a more realistic looking mask for him to wear.) And besides, his looks are transcended by the end, they lose their focus until we are barely aware of them. He did a really good job. Patrick Wilson surprised me the most, I think in a way, I enjoyed his voice the most. He was simply Superb, and he too, embodied Raoul. He is a talented actor with a moving, gently powerful voice and he was great. Minnie Driver, Miranda Richarardson-all great. Good casting choices.\n\nAll in all a great night at the movies-I am giving this a 9 and I think if I had to say why it's not a perfect 10, it's just that this story was meant to, first be, a theatrical production, and as good as the movie was, and as many tears as I cried, it did not haunt me in the same way as the stage show. That does not take away from the movie's power or magnificence, I'm not even sure it could have been any better at all as a movie. It's just that seeing it live sends chills down my spine and haunts in a way that only a stage musical can do. I can actually understand how some people are not impressed by Phantom because, the bottom line is, this is as much about the music as the story and if one isn't a fan of this type of music, one probably won't simply find a lot here. But for those who have seen the beauty of Phantom on stage, they'll (probebly) love it and better yet, for those lucky enough to come into this film, and love it, WITHOUT having ever seen the play-see the play-because if you think the movie version is the stuff that magnificence is made of, think about all that live on stage right in front of you. This movie is good and I admiringly give it a 9 of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1082130713",
        "name": "Phantom of the Opera",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWRlYTM1NjktYWU5Yi00NmRlLWIzYWYtOWUyMmU0YzE0Njg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWRlYTM1NjktYWU5Yi00NmRlLWIzYWYtOWUyMmU0YzE0Njg4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T15:39:12Z",
        "url": "https://www.imdb.com/video/vi1082130713/"
    },
    "url": "/title/tt0293508/"
}