{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Walter Cronkite",
            "url": "/name/nm0004847/"
        },
        {
            "@type": "Person",
            "name": "David Leestma",
            "url": "/name/nm0498779/"
        },
        {
            "@type": "Person",
            "name": "George Nelson",
            "url": "/name/nm0625385/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 497,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0057495/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0100268/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102272/"
        },
        {
            "@type": "Person",
            "name": "Toni Myers",
            "url": "/name/nm0616880/"
        }
    ],
    "datePublished": "1985-06-30",
    "description": "Traveling on the Space Shuttle, covers training, launch, flight, deployment of LDEF from Challenger in April 1984 (STS-41C).",
    "director": [
        {
            "@type": "Person",
            "name": "Graeme Ferguson",
            "url": "/name/nm0272445/"
        }
    ],
    "duration": "PT37M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ1NTc4NjA4OF5BMl5BanBnXkFtZTcwNTA3MjkyMQ@@._V1_.jpg",
    "keywords": "outer space,space shuttle,satellite,launch,training",
    "name": "The Dream Is Alive",
    "original_info": {
        "id": "The Dream Is Alive: IMAX_1985",
        "name": "The Dream Is Alive: IMAX",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TxMike"
        },
        "dateCreated": "2003-02-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089050/"
        },
        "name": "\"I think I hear someone kicking the outside of the orbitor!\" <shuttle commander>",
        "reviewBody": "Depending on your perspective, \"The Dream Is Alive\" can be looked at as either a commercial for America's space program in 1985, or just a nice documentary at a time when space exploration was still a new fascination for most people. It came a year before the Challenger launch disaster, and 18 years before the recent Columbia re-entry disaster. One cannot watch this IMAX film without thinking of the spaceships which have been destroyed, and the astronauts who have died. Still, it is a very nice 36 minutes which in capsule shows how and why we choose to explore outside our Earth's atmosphere.\n\nThe film opens with pastoral early morning scenes in central Florida, birds, alligators, ambient sounds in the rear surround speakers, then \"BOOM\" as the de-orbiting shuttle breaks the sound barrier in its approach to Cape Canaveral. We witness a perfect landing. Through its 36 minutes we see how astonauts are trained, witness a launch, the release of a very large experimental laboratory, the capture and repair of a malfunctioning communications satellite. As the astronaut approaches it and says \"It looks like it's in pretty good shape,\" someone in the control center in Houston quips back \"It doesn't work,\" followed by some laughter. That exchange is just one example of the relaxed manner everyone was in when all was working as planned. \n\nThe IMAX presentation includes some remarkable film taken of various parts of the Earth from orbit. And, of course, the first American woman to take a space walk (see subject quote). What a sight to see two heads in space suits appear visible through the orbitor's front windows. The DVD is as one would expect very sharp and the surround sound is used intelligently. Overall a great snapshot of the space shuttle program."
    },
    "url": "/title/tt0089050/"
}