{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Benjamin Fletcher",
            "url": "/name/nm1375068/"
        },
        {
            "@type": "Person",
            "name": "Nicole Frilot",
            "url": "/name/nm1375107/"
        },
        {
            "@type": "Person",
            "name": "Roxanne Frilot",
            "url": "/name/nm1349296/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3909,
        "ratingValue": 2.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031439/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063593/"
        },
        {
            "@type": "Person",
            "name": "Brian Caldirola",
            "url": "/name/nm0129644/"
        }
    ],
    "datePublished": "2003-04-25",
    "description": "Sixteen American college students drink, flirt, fight and canoodle during their Spring Break vacation in Cancun, Mexico.",
    "director": [
        {
            "@type": "Person",
            "name": "Rick de Oliveira",
            "url": "/name/nm0219974/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk1NDA0ODUyOF5BMl5BanBnXkFtZTYwMzI4NTA3._V1_.jpg",
    "keywords": "timeframe 1980s,timeframe 2000s,spring break,vacation,cancun mexico",
    "name": "The Real Cancun",
    "original_info": {
        "id": "The Real Cancun_2003",
        "name": "The Real Cancun",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2003-04-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0360916/"
        },
        "name": "Un-cannily works as an 'All-American' reality movie, not set there of course...",
        "reviewBody": "...and in a blatant way can be seen for viewers across the world as a comparison to the Roman Empire. In fact, I could see an interesting comparison between The Real Cancun and Fellini's Satyricon, since both works deal with the constant, superfluous binging and purging of sex and partying. But of course, Real Cancun can not hold a candle; make that a lighter, to Satyricon in terms of movie-making.\n\nThe Real Cancun is a spin-off of the Real World, which in and of itself is an oxymoron of an idea for a show since the players audition to be ON the Real World and then the seasons that have since gone on in the 90's show how they don't work, sit around there houses all day, get assignments from staff people, party, or go and team up with the cast of Road Rules. Now, however, the producers have decided to turn the show into a movie, in which they find more desperate and privileged 18-24 year olds who want to have fun during spring break in Mexico's Cancun.\n\nThe docu-movie could (or now I should say could've) work as a full-on documentary, yet it doesn't seem there is anything real when dealing with HIRED people who feel they need to heighten there expressions, mannerisms, and dialogue when on camera. There is very possibly not one minute of footage where a character is caught off guard while the camera is on him and her (this excludes the quick scenes of a hidden camera in the rooms as couples have rapid-fire sexual encounters), and thus it comes off as mostly dribble for people in there age group, such as myself, to laugh at.\n\nThe people are real, to be certain, and that's the film's, as well as the show's, crutch - whenever a director tells real people to act as themselves, which is never the case when dealing with the intellect of these caricatures - when a group of staff personnel host parties and out of nowhere Snoop Dogg shows up it shows as a quasi-reality, interesting, perhaps, but certainly not something that can easily be identified with. At least in Jackass: the Movie, there was a sense of jubilant, if constantly crude, humor to the proceedings of the reality of the situation (i.e. a mother finding an alligator right in here kitchen). That there are so many booze, sex, and gossip actors going through the same motions scene after scene (should I have another body shot? Should I go out in the ocean drunk? Should I go the next step with this girl? Etc.) makes it very tough to handle after a while.\n\nI know there is, and will be evidently, an audience for this picture; lord knows that's how the show has been running ad nauseum for the past 10+ years- but make no mistake, this is NOT for a wide range of audiences. Coincidentally, similar to a Fellini movie (except that any one Fellini scene works with a much higher intellect than this entire movie does)...I can personally say, as someone who considers himself a fairly sociable and fun-loving guy, that if I was around these people for longer than a day or night I'd have an aneurism (unless I was drunk enough, of course) ....so, as a view of my generation, objectively, I actually give it a B+. However, as a film in and of itself, it's a stinking F+ (a + for the moment with the jellyfish).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Coming Soon\"",
        "duration": "PT51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi184090905",
        "name": "The Real Cancun",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTExODA3NTctY2ZiMC00ZTkyLTk0YWItZDIwYzEyMzc3Y2Y5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTExODA3NTctY2ZiMC00ZTkyLTk0YWItZDIwYzEyMzc3Y2Y5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:06:52Z",
        "url": "https://www.imdb.com/video/vi184090905/"
    },
    "url": "/title/tt0360916/"
}