{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Bridges",
            "url": "/name/nm0000313/"
        },
        {
            "@type": "Person",
            "name": "Kim Basinger",
            "url": "/name/nm0000107/"
        },
        {
            "@type": "Person",
            "name": "Jon Foster",
            "url": "/name/nm0287898/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15896,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042399/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017713/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057340/"
        },
        {
            "@type": "Person",
            "name": "John Irving",
            "url": "/name/nm0410288/"
        },
        {
            "@type": "Person",
            "name": "Tod Williams",
            "url": "/name/nm0931095/"
        }
    ],
    "datePublished": "2004-08-06",
    "description": "A writer's young assistant becomes both pawn and catalyst in his boss's disintegrating household.",
    "director": [
        {
            "@type": "Person",
            "name": "Tod Williams",
            "url": "/name/nm0931095/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYyNTIxODA1M15BMl5BanBnXkFtZTYwMzY1NjY3._V1_.jpg",
    "keywords": "unfaithfulness,female full frontal nudity,female pubic hair,female removes her clothes,nipples visible through clothing",
    "name": "The Door in the Floor",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "harry_tk_yung"
        },
        "dateCreated": "2004-11-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0348593/"
        },
        "name": "Still haven't decided how seriously I should take this one",
        "reviewBody": "Spoilers\n\nA few days after watching the movie and reading an assortment of reviews from IMDb, local magazines, New York Times to Ebert, I still have not made up my mind how seriously I should take this one.\n\nThe two names alone, Jeff Bridges and Kim Basinger, should make any serious moviegoers sit up and take note. As well, the subject matter itself is not something to be taken lightly, the tragic loss of children and the devastating aftermath to the parents. (Two films dealing with this subject matter immediately come to mind, Moonlight Mile and In the Bedroom, both quite 'serious' in a sense, particularly the latter). The movie losses no time in coming directly to the point, in a scene where the silent gloom freezes the air, with children books author Ted (Bridges) suggesting to Marion (Basinger) that they should have a trial separation. However, as the events unfold, it seems as if the moviemakers are worried that the audience wouldn't be able to take this heavy stuff, and start to lead us through a maze of eccentricities that almost become noire.\n\nThe catalyst is 16-year-old writing student Eddie (Jon Foster) hired by Ted as a summer apprentice. It soon becomes quite evident that Ted has little intention to get Eddie involved in literary pursuits, but wants him rather as a chauffeur (Ted has lost his own license through drunk driving charges) and maybe also as a backup baby sitter for little Ruth (Elle Fanning). (A deeper reason for choosing Eddie was revealed much later). A little reminiscent of The Graduate, Marion's seduction of Eddie is however handled with much more gentleness and even some comic relief. Meanwhile, Ted's licentious relationship with a neighbour becomes noir-ish as we see him chased around the swimming pool by her with a butcher knife.\n\nThe 'hook' in the movie is the delay in revealing to the audience the details of the tragic events that led to the death of the couple's two sons (one of whom looked remarkably like Eddie). The revelation, when it comes, isn't exactly earth shattering, but does serve to give the strained relationship between Ted and Marion another dimension. And we will recall that throughout the movie, we see very little of direct interaction between them. After Eddie's arrival they seem to be communicating through him.\n\nBridges and Basinger are definitely the reasons for watching this movie. From underneath the eccentricity of Ted and the sensuality of Marion, Bridges and Basinger portray beautifully the depth of helplessness of these two characters. Little known Jon Foster is perfectly cast to bring out convincingly the innocence of Eddie. Little Elle Fanning ably demonstrates the family acting tradition. I noticed from her filmography that she played the 2-year-old stage of the character her sister Dakota played in I Am Sam."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT2M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi445382937",
        "name": "The Door in the Floor",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmU2YjJiMjUtZmQwMy00Y2QxLWIwMWUtMDEyNTkyZTI2MWVjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmU2YjJiMjUtZmQwMy00Y2QxLWIwMWUtMDEyNTkyZTI2MWVjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:19:29Z",
        "url": "https://www.imdb.com/video/vi445382937/"
    },
    "url": "/title/tt0348593/"
}