{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Bill Cosby",
            "url": "/name/nm0001070/"
        },
        {
            "@type": "Person",
            "name": "Phylicia Rashad",
            "url": "/name/nm0711118/"
        },
        {
            "@type": "Person",
            "name": "Keshia Knight Pulliam",
            "url": "/name/nm0700443/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 34897,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163122/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030713/"
        },
        {
            "@type": "Person",
            "name": "Michael Leeson",
            "url": "/name/nm0498775/"
        }
    ],
    "datePublished": "1984-09-20",
    "description": "The goings-on in the life of a successful African-American family.",
    "genre": [
        "Comedy",
        "Family",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzA3NDIwMjU3Nl5BMl5BanBnXkFtZTcwMTcxODgyMQ@@._V1_.jpg",
    "keywords": "laugh track,sitcom,new york city,1980s,1990s",
    "name": "The Cosby Show",
    "original_info": {
        "id": "The Cosby Show: Season 1_1984",
        "name": "The Cosby Show: Season 1",
        "year": "1984"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tfrizzell"
        },
        "dateCreated": "2003-07-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0086687/"
        },
        "name": "Do You Remember the Real Good Old Days?",
        "reviewBody": "Bill Cosby had been on television throughout the 1960s and 1970s. His success had been adequate, but far from impressive. By 1984, NBC wanted to have a show that would be endeared not only by minority groups, but also by white America. Enter \"The Cosby Show\", the very definition of a Nielsen Ratings Monster as it devoured competition, along with cohort \"Cheers\", for the better part of the 1980s and early-1990s. The series is basically the life of Cosby with a few creative twists. Cosby, an obstetrician, lives in New York with his wife Phylicia Rashad (an attorney) and their four children (Lisa Bonet, Malcolm-Jamal Warner, Tempestt Bledsoe and Keshia Knight-Pulliam). Comedy and drama would always dominate the series, but an early criticism of \"The Cosby Show\" was that it had no real point to it. Enter eldest child Sabrina Le Beauf who was created the middle of season one. This child was away at college and receiving a first-class education at an Ivy League School. And that is the point of \"The Cosby Show\"---two parents doing their best to give their five children the life and opportunities that they have taken advantage of. The Le Beauf character was a culmination of everything that Cosby and Rashad did with the four younger children. As the series grew, the cast grew to include performers like Geoffrey Owens, Joseph C. Phillips, Deon Richmond and scene-stealer Raven-Symone. The greatest problem that most had with the show was that critics said it did not show accurate African-American life in this country. To be perfectly honest, this show does not show typical life for the vast majority of this nation's population. There are not many white children in this nation that have a doctor and a lawyer as parents so that criticism lacks substance and social research. Cosby always kept the show somewhat light-hearted and sometimes shied away from some key issues of the time period, but keep in mind that his name was on the program and everything was written as if the characters were sometimes walking on eggshells. Bonet created the controversy for the series during its run, especially in 1987 with her very adult-oriented role in \"Angel Heart\". That did not deter, but rather engross an even larger audiences tuned in by the late-1980s. Slowly the younger performers grew up and grew out of their roles and the series finally began to show its age by the 1990s. But for a few fleeting moments in the 1980s, was there anyone bigger than Bill Cosby? I think not. 5 stars out of 5."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Urban Works",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2297430297",
        "name": "The Cosby Show: Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTFiODRjNGQtYjM5Mi00NmQyLWFlMDMtZmRiNGZjZWNmZDZkXkEyXkFqcGdeQXJoYW5uYWg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTFiODRjNGQtYjM5Mi00NmQyLWFlMDMtZmRiNGZjZWNmZDZkXkEyXkFqcGdeQXJoYW5uYWg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:36:24Z",
        "url": "https://www.imdb.com/video/vi2297430297/"
    },
    "url": "/title/tt0086687/"
}