{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Barbra Streisand",
            "url": "/name/nm0000659/"
        },
        {
            "@type": "Person",
            "name": "Robert Redford",
            "url": "/name/nm0000602/"
        },
        {
            "@type": "Person",
            "name": "Bradford Dillman",
            "url": "/name/nm0226947/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26024,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0066604/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0141769/"
        },
        {
            "@type": "Person",
            "name": "Arthur Laurents",
            "url": "/name/nm0491306/"
        },
        {
            "@type": "Person",
            "name": "Francis Ford Coppola",
            "url": "/name/nm0000338/"
        },
        {
            "@type": "Person",
            "name": "Paddy Chayefsky",
            "url": "/name/nm0154665/"
        }
    ],
    "datePublished": "1973-10-19",
    "description": "During pre-WWII McCarthyism, a diametrically opposed couple come together only to find out that genuine friendship and physical attraction is not enough to overcome fundamental societal beliefs.",
    "director": [
        {
            "@type": "Person",
            "name": "Sydney Pollack",
            "url": "/name/nm0001628/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjFiM2IwN2MtNWQ3My00YmYwLTliMjYtMzZlMDQxZTdjNDA1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "new york city,unfaithfulness,infidelity,year 1933,year 1944",
    "name": "The Way We Were",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmOtaku"
        },
        "dateCreated": "2005-07-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070903/"
        },
        "name": "Despite some faults, it's still pretty good",
        "reviewBody": "The theme of a golden boy falling for a girl from \"another world\", be it social class, the \"wrong side of the tracks\" or fill in your cliché here, is one that goes back to the silent film era. One of the most famous examples is Sydney Pollack's 1973 film \"The Way We Were\". Set from the 1930's through the 1950's, Barbra Streisand plays Katie, an outspoken member of the Communist party and campus activist who does not have anything handed to her; she works two and sometimes three jobs in order to pay for her living and college tuition. Hubble (Redford) is your typical aforementioned golden boy, a \"big man on campus\" who indulges in sports, debutantes and all-around good times. The two know each other from the diner Katie works at (he being the patron) and at one point before graduation, briefly bond over their shared passion for writing. Cut to a few years in the future and Katie encounters Hubble at a bar. Hubble is in the armed forces and Katie is characteristically working a couple of jobs while volunteering for various social causes. After a night of drunken sex (Hubble being the drunken one) they embark on an unlikely relationship that spans over a decade and includes a move to California (when Hubble becomes a screenwriter in Hollywood) and the conception of one child. They are happy, but realize that regardless of their desire, they can't completely cross social lines and certainly can't change one another, particularly Katie's ever-ferocious dedication to social causes; a fight that becomes exponentially heated during McCarthy's Red Scare. The two have to decide whether they can sustain enough raw emotion for one another to persevere over everything else that is stacked up against them.\n\nThere are several things about \"The Way We Were\" that require suspension of disbelief (the fact that despite never having had much contact with one another that after one night of drunken lust and an awkward \"morning after\" being enough to kick start a relationship the magnitude of theirs is the first thing that comes to mind) but the bottom line is that it really is a well-written, well-directed and well-acted film. The two principal characters are full and complex, regardless of whether we are talking about the socially conscience Katie or the socially acceptable Hubble. I suspect they somewhat were written with the intent of familiarity for the purpose of effectiveness, and if this is true, it worked on me. The era in which these two characters were set was a very interesting time in American history, and the characters' actions during these times created some compelling cinema, particularly when it touched on the Red Scare.\n\nBut who am I fooling? The main reason people watch this movie, whether for the first time or for the fiftieth is for the doomed romance, and Streisand and Redford deliver in spades. \"The Way We Were\" was written for Streisand, (something that cause Redford to turn down the part at first, because he knew the film was going to be hers) and her portrayal of Katie is excellent. There are so many perceptions of Streisand nowadays (some of them correct, to be sure) that it's easy to forget that she really does have some serious acting chops, and she exhibits them to full effect here. I also happened to learn that the soft filtered lens thing with her didn't just start with her later movies, for whatever reason she was filmed with that lens more often than not here, but that didn't do anything more than slightly distract me because I couldn't help but chuckle. Redford gives a typical solid performance as well, though his initial doubts about taking the role turned out to be valid; he is not the dynamic figure in the film. However, his character is a strong one and Redford does a good job.\n\nI don't know if Pollack knew he was creating a screen classic when he directed \"The Way We Were\" but he did make a very good film. If you can make it past some major melodrama and some plot holes (what was the deal with their child?) watch this film, and just sit back and appreciate it for what it is  a chick flick that guys don't have to feel ashamed watching. 7/10 --Shelly",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3099376153",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDZjNTA3NmUtZWE5Zi00NDQ2LWFkODAtNDkzNDgxOTgyOWI4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDZjNTA3NmUtZWE5Zi00NDQ2LWFkODAtNDkzNDgxOTgyOWI4XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-09-28T22:19:35.543Z",
        "url": "https://www.imdb.com/video/vi3099376153/"
    },
    "url": "/title/tt0070903/"
}