{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Burt Reynolds",
            "url": "/name/nm0000608/"
        },
        {
            "@type": "Person",
            "name": "The 5th Dimension",
            "url": "/name/nm1502280/"
        },
        {
            "@type": "Person",
            "name": "Julie Andrews",
            "url": "/name/nm0000267/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 52,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053130/"
        }
    ],
    "datePublished": "1991-11-24",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Solt",
            "url": "/name/nm0813583/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Comedy",
        "Family",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2E5MzE3OGMtZDIxZS00MzIzLTgzZTItY2FkNzQyOWU2NGY3XkEyXkFqcGdeQXVyMTgwOTE5NDk@._V1_.jpg",
    "keywords": "actor name in title,nine word title,ed sullivan character,clip show,retrospective",
    "name": "The Very Best of the Ed Sullivan Show 2",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "texallennyc"
        },
        "dateCreated": "2018-01-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0304891/"
        },
        "name": "Very Best Of Ed Sullivan, Part 2 w/ Burt Reynolds (1991) is a dramatic portrait of the USA in the 1950's and 1960's complete with revolutionary social changes!",
        "reviewBody": "\"The Very Best Of Ed Sullivan, Part 2 w/ Burt Reynolds\" (1991) is a dramatic portrait of the USA in the 1950's and 1960's complete with revolutionary social changes.\n\nThe nostalgia entertainment documentary was created 20 years after the final broadcast of the famous Sunday night Ed Sullivan Show (originally called \"The Toast Of The Town\" hosted by Ed Sullivan).\n\nThe program featured both celebrity entertainers and vaudeville/ circus type novelty entertainers and was presented in a simple vaudeville/ talent show type format with each \"act\" lasting about 3 minutes and introduced by host Ed Sullivan.\n\nThe show ran weekly on the CBS Television Network for a total of 23 years from 1948 to 1971. Both the 1950 and 1960 decades were totally included and chronicled during the 23 year run of the show.\n\nThe show was a portrait of show business in America (the USA) during those decades: its changing tastes, values, taltent, and preferences.\n\nAn earlier \"Part One\" show hostessed by Carol Burnett was presented, and was similar in format to the \"Part Two\" show hosted by Burt Reynolds.\n\nThe \"Part One\" show had wonderful highlights but the \"Part Two\" show was better by far in terms of overall presentation and entertainment value.\n\nThe \"Part Two\" 1991 segment of the two part \"The Very Best Of Ed Sullivan Show\" package included both celebrity talent, and also interesting and arguably amazing circus/ vaudeville talent and entertainers not credited in the packaging or end of show credit titles.\n\nA partial list of celebrity entertainers in the \"Part Two\" show includes:\n\nBurt Reynolds ... Himself - Host\n\nThe 5th Dimension\n\nJulie Andrews\n\nThe Beatles\n\nClyde Beatty\n\nHarry Belafonte\n\nJack Benny\n\nRichard Burton\n\nThe Byrds\n\nNat 'King' Cole\n\nPhyllis Diller\n\nThe Everly Brothers\n\nDame Margot Fonteyn and Rudolf Nuyev\n\nConnie Francis\n\nFrank Gorshin \n\nNon-celebrity performers and entertainers recruited from travelling circuses and vaudeville type entertainment venues (kept alive by Las Vegas and other major gambling centers which later included Atlantic City, New Jersey) included knife throwers, animal acts, high wire trapeze acts, juggling acts, plate spinner acts, and grand opera aria singers (usually celebrities such as Beverly Sills), and classical ballet acts (usually celebrity ballet dancers including Jacques D'Amboise, Rudolf Nuryev, and Dame Margo Fonteyn).\n\nSteve Allen stated during an interview about the Ed Sullivan Show that the show presented over 10,000 important show business acts to network television audiences over the 23 years it lasted.\n\nThe entire output of the show, opined Steve Allen, constituted a de-facto library of USA show business and major entertainment talent during the decades the show was presented between 1948 (when priimitive black and white television had just begun ............. the phenomenon of successful, advertising driven national television began immediately after the World War II (1941 - 45) years. The Ed Sullivan Show was an early beginner in the realm of national television shows, and by far the longest lasting of shows which started in the 1940's.\n\nThe contrast between the primitive black and white acts from the 1950's presented in the \"Part Two\" nostalgia 1991 show hosted by Burt Reynolds and the gaudy, sophisticated 1970 color with complex special effects 5th Dimension singer act performing hit songs from the 1969 Broadway HAIR musical show about 1960's hippies and their controversial dreams and hopes is dramatic.\n\nThe times really were \" 'a changing.\"\n\nPresentations of landmark song performances from famous Broadway musical stage shows of the 1950's and 1960's included in \"Part Two\" showed original Broadway stars singing then hit songs from My Fair Lady, Camelot, and Man Of La Mancha.\n\nWhat times those were. What a nostalgia show \"The Very Best Of Ed Sullivan, Part Two\" (1991) hosted by Burt Reynolds was.\n\nIt's still available used from Amazon.Com for tiny money, and worth buying, enjoying, and thinking about.\n\nThe Ed Sullivan Show (1948 - 1971) presented America during a high point of its history. It shows why America was considered the greatest country in the world in the 1950's and 1960's all over the world. Unbeatable, noble, and always entertaining.\n\nGod Bless America!\n\n-------------------------------------\n\nWritten on December 3, 2018 by Tex (David) Allen, movie scholar, historian, teacher, and writer. Also a SAG-AFTRA movie actor. For details about Tex Allen, visit IMDb.Com movies, TV, and celebrities website database, owned by Amazon.Com. This is the 123rd movie/ television show review Tex Allen has written for WWW.IMDb.Com. \n\n--------------------------------",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0304891/"
}