{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Judy Garland",
            "url": "/name/nm0000023/"
        },
        {
            "@type": "Person",
            "name": "Jerry Van Dyke",
            "url": "/name/nm0886733/"
        },
        {
            "@type": "Person",
            "name": "Bradford Craig",
            "url": "/name/nm0185788/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 449,
        "ratingValue": 8.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0450258/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049888/"
        }
    ],
    "datePublished": "1963-09-29",
    "description": "The star performs with guests.",
    "genre": [
        "Comedy",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTcwMjMxMDczNF5BMl5BanBnXkFtZTcwMTc4MTU1MQ@@._V1_.jpg",
    "keywords": "variety show,vaudeville",
    "name": "The Judy Garland Show",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "earlytalkie"
        },
        "dateCreated": "2013-08-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056767/"
        },
        "name": "The Real Judy Almost Live And In Your Face",
        "reviewBody": "The Judy Garland Show's many triumphs and misfires have been common knowledge for a long time. CBS's powers-that-be never really had a clue as what to do with this million-watt talent. Given the fact that it would not be practical to showcase her singing for a solid hour each week, the producers unwisely decided to tear down her iconic image to make her seem more accessible as a sort-of Dinah Shore type of variety show host. She was given Jerry Van Dyke as a sidekick, and, frankly, his segments are the very worst parts of this entire series. To be fair, Mr. Van Dyke has said he had little to no impact on the writing of his segments. Every show had it's highlights, usually anything that Judy sang, either solo or in some rather inspired duets, and it's low points, most of the comedy, and even the Tea For Two segments seem flat and forced today. This is not to criticize Judy, for she always gave her all and really tried to make this show work. For myself, I find the DVD of Judy Garland: The Concert Years to be the best way to enjoy The Judy Garland Show. In 85 minutes, you get just about every highlight from this series and several more from specials she did before and after the series run. There is even a clip from 1929's The Big Revue, the earliest example of \"Baby Gumm\" on film, along with her sisters. But thank god The Judy Garland Show has been preserved so we can get a look at the brilliant entertainer late in her life,, when she was still at her Carnegie Hall concert peak. She looks gorgeous in the series, and Mort Lindsey lent his brilliant orchestrations to the venture. We shall never again see the likes of a program like The Judy Garland Show for the simple reason we shall never again see a performer with the talent and electricity that she had. If I could pick but one number from this series that perfectly displays her talent, it would be her astonishing version of \"The Battle Hymn Of The Republic\". Sung in tribute to the then recently assassinated John F. Kennedy, I have never seen anything by anyone to compare it with."
    },
    "url": "/title/tt0056767/"
}