{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julie Harris",
            "url": "/name/nm0364915/"
        },
        {
            "@type": "Person",
            "name": "Jeannette Clift",
            "url": "/name/nm0166703/"
        },
        {
            "@type": "Person",
            "name": "Arthur O'Connell",
            "url": "/name/nm0640023/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2223,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0034820/"
        },
        {
            "@type": "Person",
            "name": "Corrie Ten Boom",
            "url": "/name/nm0854821/"
        },
        {
            "@type": "Person",
            "name": "John Sherrill",
            "url": "/name/nm0792685/"
        },
        {
            "@type": "Person",
            "name": "Elizabeth Sherrill",
            "url": "/name/nm0792682/"
        }
    ],
    "datePublished": "1977-02-15",
    "description": "During WWII, a Dutch family caught hiding Jews is sent to a concentration camp where their Christian faith helps them endure the hardships.",
    "director": [
        {
            "@type": "Person",
            "name": "James F. Collier",
            "url": "/name/nm0171917/"
        }
    ],
    "duration": "PT2H30M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTJmZjk4ZDUtMTYwMS00NmQwLTk1N2MtYjlmNzk4ZjZlOGExXkEyXkFqcGdeQXVyMTk0MjQ3Nzk@._V1_.jpg",
    "keywords": "hiding a jew,timeframe 1940s,jew,holland,concentration camp",
    "name": "The Hiding Place",
    "original_info": {
        "id": "The Hiding Place_1975",
        "name": "The Hiding Place",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "colin-399"
        },
        "dateCreated": "2006-04-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0073109/"
        },
        "name": "Hard hitting",
        "reviewBody": "Hello it is me again. I am biased because I was actually in the film itself as an extra. I played one of the Capos ( privileged prisoners ). Mr.Collier was a wonderful man, very kind and understanding to those of us who had never been an extra before. I have always appreciated what people like The Ten Boons did during the war so that all of us could live in peace afterwards, it is just a shame the young of today do not feel the same way. I was born a year before the war ended and I can remember I was 4years old before my late Father met me. Anyway I am digressing. I was living in Brighton England at the time when I saw the advert in local paper for film extras. I and many others went for auditions and were selected. The strange thing was, that the second half of the film (Ravensbruk Concentration Camp for Women) was actually filmed in the Army Camp in Lingfield Surrey where I did my basic training. In England the womens army is known as Womens Royal Army Corp or WRACS for short and Lingfield at the time was the base. It is, I believe now at Mill Hill in London. The first half of film was done in Holland and Lingfield was to represent the camp in Germany. It was strange being back there because after there, I was posted to Somerset (next county to where I now Live) to learn how to drive. On leaving the army to get married I then moved back to Brighton with my Husband and then to Lingfield to do the film. Normally film extras are only kept on for a few days but Jim Collier was so impressed with the batch of us from Brighton he kept us on till the end of the film nearly 6 weeks. Mr.Ten Boom was a watchmaker played by that wonderful actor Arthur O Connel Betsi was Julie Harris and Corrie Ten Boon herself came to England to meet us all and to thank us for telling their story of how they hid Jews from the Nazis were caught and sent to the camps where Betsi died of Septisemia,I think it was. I learned a few secrets of special effects and enjoyed every minute I was there sometimes not getting home till 3 in the morning. The torture scenes were so realistic I had to pinch myself because sometimes I forgot it was a movie. I could go on and on about it but I wont suffice to say it is, like many true war stories very hard hitting and cuts to the bone. We went to London to see the Premier at Mr. colliers expense and it was wonderful . I also met Sir Cliff Richard (for second time in my life) because he part funded it being a born again Christian. One can now rent the video but at the time shortly after it was released I wrote to Jim Collier at Burbank Studios thanking him for letting me be a small part of his film. It was then that Mrs. Collier wrote back to me saying her Husband had died. I was sad to hear of this but she said her Husband had told her how well we had done and that he would have been proud to have same extras again in any future films had he lived. I still have her letter to this day. Just one more thing. It was WWfilms that did the SFX on The Ten Commandments (a film I have) and I know how they parted the Red Sea. People should go and see this film. Yes it does drag on for the first half hour but oh! my! it soon hits you hard after that.\n\nYours sincerely\n\nLiz (short for Elizabeth) Mckenzie",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "During WW2, a Dutch family caught hiding Jews is sent to a concentration camp where their Christian faith helps them endure the hardships.",
        "duration": "PT2M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3438658329",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGE5NmRjMzItZDJkYy00M2U4LTkyM2MtZTY2NTMzMmU1NzA2XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGE5NmRjMzItZDJkYy00M2U4LTkyM2MtZTY2NTMzMmU1NzA2XkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-02T21:42:18.727Z",
        "url": "https://www.imdb.com/video/vi3438658329/"
    },
    "url": "/title/tt0073109/"
}