{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brahim Hadjadj",
            "url": "/name/nm0352835/"
        },
        {
            "@type": "Person",
            "name": "Jean Martin",
            "url": "/name/nm0552483/"
        },
        {
            "@type": "Person",
            "name": "Yacef Saadi",
            "url": "/name/nm0754272/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 61874,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "alternateName": "The Battle of Algiers",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054014/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136687/"
        },
        {
            "@type": "Person",
            "name": "Franco Solinas",
            "url": "/name/nm0758357/"
        },
        {
            "@type": "Person",
            "name": "Gillo Pontecorvo",
            "url": "/name/nm0690597/"
        }
    ],
    "datePublished": "1967-09-20",
    "description": "In the 1950s, fear and violence escalate as the people of Algiers fight for independence from the French government.",
    "director": [
        {
            "@type": "Person",
            "name": "Gillo Pontecorvo",
            "url": "/name/nm0690597/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2M4YTA4ZTEtN2EyNy00YTlmLWE4YzYtYjYyYjRkMWM4ZDM0XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "battle of algiers,torture,algeria,resistance,struggle for independence",
    "name": "La battaglia di Algeri",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Tony43"
        },
        "dateCreated": "2004-01-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058946/"
        },
        "name": "Should be mandatory viewing for every American",
        "reviewBody": "\"Battle of Algiers\" is simply one of the greatest films every made. If film making can be about truth as well as fantasy, then a movie that includes a title card telling viewers that there is not one foot of documentary or newsreel footage in it must deserve viewing.\n\n\"Battle of Algiers\" contains scenes that seem so real, you suspect that they couldn't have been staged. When three Algerian women come down from the Casbah to plant bombs in the French quarter of the city, you can almost cut the tension with a knife. When the bombs go off, you think they must have been real bombs. And when you see the devastation they leave in their wake, you cannot fail to be moved. The massive rebellion in the streets at the end of the film also seems so real, you sit wondering how many extras must have been injured filming those scenes.\n\n\"Battle of Algiers\" combines brilliant photography, crisp direction, an intriguing plot and some very fine acting. Throw in a terrific music score, splendid editing, impressive special effects and the best example ever of docudrama style production and you have a masterpiece of film making.\n\nBut film making is not nearly as important as human life and no film in general release today says more about America's current involvement in the middle east and many other parts of the world than this picture about the French in Algeria, made more than three decades ago.\n\nEvery American should view this film, then think about our current occupation of Iraq."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "THE REVOLT THAT STIRRED THE WORLD!\r\n\r\nDirector Gillo Pontecorvo's highly acclaimed masterpiece THE BATTLE OF ALGIERS is regarded as one of modern cinema's finest achievements. Now, Digitally RE-MASTERED IN HIGH DEFINITION from restored archive elements approved by the filmmakers, this all-time classic release of Â“The Battle Of AlgiersÂ” also commemorates \r\nthe 50th anniversary of Algerian independence. This new HD version includes some previously unseen footage, \r\nmaking this the most complete edition ever anywhere.\r\n\r\nSPECIAL FEATURES\r\nEXCLUSIVE PRESENTATION & INTERVIEW WITH DIRECTOR KEN LOACH\r\nEXCLUSIVE PRESENTATION BY DIRECTOR PAUL GREENGRASS (Bourne films) \r\nTHE MAKING OF THE BATTLE OF ALGIERS An exclusive interview with Director Gillo Pontecorvo\r\nTHE REAL BATTLE OF ALGIERS \r\nInterview with Producer & protagonist SAADI YACEF, head of FLN guerrillas\r\nOUR WAR FOR FREEDOM\r\nInterview with FLN fighter ZOHRA DRIF BITAT (the Milk Bar bomber portrayed in the film)\r\nPHOTO GALLERIES From filmmakerÂ’s personal archives\r\nFILM TRAILERS, Theatrical and Argent Trailer\r\nALSO INCLUDED A SPECIAL BOOKLET Â“ITALIANS IN ALGIERS; An essay by author-scholar David Forgacs, Professor at NYU, on the remarkable genesis of the film and how it was shaped by both the award-winning Italian filmmakers and its ex-guerrilla Algerian producer, whose memoir the film is based on.",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1365680665",
        "name": "The Battle of Algiers",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQxNTQwOTMzOV5BMl5BanBnXkFtZTcwMzQxOTI5Nw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQxNTQwOTMzOV5BMl5BanBnXkFtZTcwMzQxOTI5Nw@@._V1_.jpg",
        "uploadDate": "2012-06-14T05:35:35Z",
        "url": "https://www.imdb.com/video/vi1365680665/"
    },
    "url": "/title/tt0058946/"
}