{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Herbert Stern",
            "url": "/name/nm0827712/"
        },
        {
            "@type": "Person",
            "name": "Hildegarde Watson",
            "url": "/name/nm0914656/"
        },
        {
            "@type": "Person",
            "name": "Melville Webber",
            "url": "/name/nm0916410/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1379,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Person",
            "name": "Edgar Allan Poe",
            "url": "/name/nm0000590/"
        }
    ],
    "datePublished": "2011-09-20",
    "description": "An avant-garde take on Poe's classic story of a traveller taking shelter at a household under a mysterious curse.",
    "director": [
        {
            "@type": "Person",
            "name": "James Sibley Watson",
            "url": "/name/nm0914682/"
        },
        {
            "@type": "Person",
            "name": "Melville Webber",
            "url": "/name/nm0916410/"
        }
    ],
    "duration": "PT13M",
    "genre": [
        "Short",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODZlZGE5N2YtZDZmNS00NzM1LTg3OTAtZmVkMzQyZTdhNzIzXkEyXkFqcGdeQXVyNjE2NjczMDc@._V1_.jpg",
    "keywords": "avant garde short,experimental short,gothic horror,double exposure effects,sledgehammer",
    "name": "The Fall of the House of Usher",
    "original_info": {
        "id": "The Fall of the House of Usher_1928",
        "name": "The Fall of the House of Usher",
        "year": "1928"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "springfieldrental"
        },
        "dateCreated": "2022-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0018873/"
        },
        "name": "An Avant-Garde Take on Poe's Horror Story",
        "reviewBody": "As experimental as Jean Epstein's version of \"The Fall of the House of Usher\" was, coincidentally in the same year a more avant-garde 13-minute presentation on the same Poe story was released. Produced by two friends from Harvard University, Melville Webber, an art historian, and James Watson, a medical doctor and magazine editor, the two non-filmmakers sat down to compose a visual tour-de-force short film. The pair's \"The Fall of the House of Usher,\" contains no inter titles except a handful of floating words as the house begins to fall.\n\nThe Americans' \"The Fall\" compiles a number of sequences with prisms multiplying the distorted view of the house bordering on insanity. The Weber/Watson team used many German Expressionistic visuals to translate the Poe story. The set design contains many irregular shapes of the house similar to 1920's \"The Cabinet of Dr. Caligari.\" Using an optical printer, they created a few visually-pleasing zig-zag effects. Watson's wife, Hildegarde, lent her services by playing Madeline Usher.\n\nWebber and Watson's film is reflective of the independent short films produced by experimental amateurs in the 1920s and 1930s. Before film festivals, these movies were picked up by movie groups and shown in small venues such as church basements, public libraries and people's homes. The high quality of the American version of \"The Fall,\" however, reflects the lofty standards these amateurs were capable of producing. The two went on to create three additional short films, most notably 1932's 'Lot in Sodom,' and a Bausch & Lomb industrial short, before they dove into making 3D motion picture x-rays.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0018873/"
}