{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brad Pitt",
            "url": "/name/nm0000093/"
        },
        {
            "@type": "Person",
            "name": "Sean Penn",
            "url": "/name/nm0000576/"
        },
        {
            "@type": "Person",
            "name": "Jessica Chastain",
            "url": "/name/nm1567113/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 179655,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0308699/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0120121/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028932/"
        },
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "datePublished": "2011-05-17",
    "description": "The story of a family in Waco, Texas in 1956. The eldest son witnesses the loss of innocence and struggles with his parents' conflicting teachings.",
    "director": [
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "duration": "PT2H19M",
    "genre": [
        "Drama",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMwNjQ0NjMzN15BMl5BanBnXkFtZTcwNjMxMTkyNA@@._V1_.jpg",
    "keywords": "childhood,strict father,waco texas,1950s,death",
    "name": "The Tree of Life",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "seaview1"
        },
        "dateCreated": "2012-02-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0478304/"
        },
        "name": "The Moments of Existence in The TREE OF LIFE",
        "reviewBody": "The Tree of Life is the latest film by reclusive director Terrence Malick (Days of Heaven, The Thin Red Line) whose previous films displayed a simple narrative abetted by haunting imagery. This film takes a step further by telling its story in grand strokes of imagery. Though its technique may lead some to wonder the point of this exercise and dismiss it as confusing, others will hail it an ambitious masterwork. Let the viewer beware.\n\nOne family deals with a personal loss as it ponders the meaning of life through the point of view of its oldest son (Sean Penn), now an adult in the business world. Celestial forces of nature signal the very creation and existence of the universe and provide a majestic background to the birth and evolution of life on earth. We witness the beginnings of an American family from the Midwest in mid-twentieth century. Led by a stern, proud father (Brad Pitt), and a doting mother (Jessica Chastain), three sons experience the joys and pains of growing up. Through a rapid series of short scenes, this tapestry of sounds and images forms a mosaic of life's precious moments. All the while a voice asks the great questions of life and God.\n\nCertainly the most ambitious film in the enigmatic director's career, it is also the most challenging. This is pure cinema, and it is remarkable how the film is able to communicate visually albeit without much in the way of lengthy dialogue. These fragments of life almost seem surreal as if from a Fellini film. In a way it is kind of an experimental film on a grand scale. It seems to ask, 'what is the purpose of existence amid great loss'? (Despite being a very spiritual film, creationists might not like the premise of some of the scenes that strongly suggest an evolutionary development of life on earth.)\n\nThose who are able to decipher the abstract nature of Kubrick's 2001: A Space Odyssey will likely have a clue on how to access the style and meaning of this film. Indeed, some of the impressive visuals were created by Douglas Trumbull (Blade Runner) who did the 2001 special visual effects and helped to realize Spielberg's Close Encounters of the Third Kind. Cinematographer Emmanuel Lubezki has captured some stunning visuals of landscapes and life that are at times overwhelming in their beauty. The musical score alternates between classical and operatic pieces although one almost expects a minimalist, Philip Glass-type score to pop up.\n\nThere are many unanswered questions. Which brother died and how? And what is the background of the oldest brother as adult? How has the father changed since the loss of his son and how does this affect the family? As much as the oldest son asks for answers, we want more information and must settle for pieces from a larger puzzle.\n\nThe film serves as a search for meaning and hope amid the vastness of existence. As we see the father teach his sons about manners, chores, music, fighting, and death, we may see something in our own common, shared experiences. Life is portrayed as a series of events that sometimes blur over time.\n\nThis exploration of the meaning of life may prove to be too abstract and a turn off for some, but to those who are open to a visual experience unlike any other, it may prove to be a fascinating exercise in pure cinema. Kubrick would be proud.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A preview of Terrence Malick's \"The Tree of Life\" starring Brad Pitt, Sean Penn and Jessica Chastain.",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi612735001",
        "name": "The Tree of Life Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTg0ODQ2MjI2NV5BMl5BanBnXkFtZTcwOTY1MTMyNA@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTg0ODQ2MjI2NV5BMl5BanBnXkFtZTcwOTY1MTMyNA@@._V1_.jpg",
        "uploadDate": "2010-12-17T11:11:18Z",
        "url": "https://www.imdb.com/video/vi612735001/"
    },
    "url": "/title/tt0478304/"
}