{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Perry Bamonte",
            "url": "/name/nm1017578/"
        },
        {
            "@type": "Person",
            "name": "Jason Cooper",
            "url": "/name/nm1873623/"
        },
        {
            "@type": "Person",
            "name": "Simon Gallup",
            "url": "/name/nm0303244/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 316,
        "ratingValue": 8.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060763/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015070/"
        }
    ],
    "datePublished": "2003-06-03",
    "description": "The Cure play their albums \"Pornography,\" \"Disintegration,\" and \"Bloodflowers\" live during two shows at the Tempodrome in Berlin.",
    "director": [
        {
            "@type": "Person",
            "name": "Nick Wickham",
            "url": "/name/nm0926911/"
        }
    ],
    "duration": "PT3H43M",
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc5MzM2NjMxNV5BMl5BanBnXkFtZTcwMjY3OTIyMQ@@._V1_.jpg",
    "keywords": "live performance,concert film",
    "name": "The Cure: Trilogy",
    "original_info": {
        "id": "The Cure: Trilogy_2002",
        "name": "The Cure: Trilogy",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ChristopherSherrod"
        },
        "dateCreated": "2023-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0459250/"
        },
        "name": "Must-see concert film for fans of the band and anyone who enjoys alternative rock music",
        "reviewBody": "\"The Cure: Trilogy\" is a concert film that captures the iconic British band The Cure in performance. The film features three concerts, each focusing on a different period in the band's career, and showcases the group's diverse musical style and ability to connect with their audience.\n\nOne of the standout features of \"The Cure: Trilogy\" is the band's energy and performance. Despite the passage of time, the members of The Cure still deliver powerful and dynamic performances that are both energetic and emotionally charged. They engage with the audience and create a sense of community and connection, which is a testament to their longevity and popularity.\n\nThe musical style of The Cure is also on full display in the film. Their distinctive brand of alternative rock is characterized by their dark and moody lyrics and powerful, guitar-driven sound. The film features many of their classic hits, as well as new material, and showcases the band's ability to evolve and remain relevant over time.\n\nThe cinematography and direction of the film are also noteworthy. The concert footage is well-shot, capturing the energy and excitement of the performances. The editing is seamless, and the film moves smoothly from one song to the next, creating a flow that is both engaging and entertaining.\n\nOverall, \"The Cure: Trilogy\" is a must-see concert film for fans of the band and anyone who enjoys alternative rock music. The film showcases the band's energy and musical talent, and their ability to connect with their audience, making for a truly unforgettable experience.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0459250/"
}