{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tobey Maguire",
            "url": "/name/nm0001497/"
        },
        {
            "@type": "Person",
            "name": "Charlize Theron",
            "url": "/name/nm0000234/"
        },
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 101536,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0159642/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015134/"
        },
        {
            "@type": "Person",
            "name": "John Irving",
            "url": "/name/nm0410288/"
        }
    ],
    "datePublished": "2000-01-07",
    "description": "A compassionate young man, raised in an orphanage and trained to be a doctor there, decides to leave to see the world.",
    "director": [
        {
            "@type": "Person",
            "name": "Lasse Hallström",
            "url": "/name/nm0002120/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmY5YzA4OTQtOTQzZS00NDZmLTlhNzQtNzk5NTIyZWE2ZjVkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "premarital sex,abortion,woman dies from abortion,racism,female nudity",
    "name": "The Cider House Rules",
    "original_info": {
        "id": "The Cider House Rules_1999",
        "name": "The Cider House Rules",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FlickJunkie-2"
        },
        "dateCreated": "2000-08-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0124315/"
        },
        "name": "Poignant and powerful",
        "reviewBody": "Nineteen ninety-nine was an outstanding year for adaptations of major literary works, but of all the great books that came to the screen last year, this is my favorite. John Irving's novel and adaptation is one of the most complete stories I can remember in many years. It is poignant, exhilarating, and astutely human in its scope, presenting a myriad of human emotions and experiences.\n\nOften, when a story attempts to cross genres so broadly, it fails from lack of depth or insufficiency of the writer or director to meet the variable demands of such a wide-ranging treatment. This film was a comedy, a tragedy, a romance, a human-interest story, a character study, and a period piece, and each element was excellently done.\n\nThis was all accomplished without sacrificing the philosophical and emotional depth Irving imbues in all his works. Irving weaves a strong moral into this story; that rules need to be questioned and that being human is not so easily codified. He revisits this theme repeatedly, with each character facing dilemmas regarding societal and personal rules that are difficult to reconcile in the given situations.\n\nIf there is one thing that stands out about this story, it is its human realism. These are ordinary people struggling with problems we all face. We come to have affection for almost all of them, and can identify with their tribulations. Although the story is excessively sentimental and fatalistic, it reminds us that life is complicated and doesn't always turn out the way we plan or hope. \n\nFrom a filmmaking perspective, we could not have asked more from Lasse Hallstrom. Known most in the U.S. for his direction of What's Eating Gilbert Grape', Hallstrom has been making wonderful films in Europe for almost twenty years. However, this film will certainly go down as his finest work. In the featurette on the DVD, he said that when he goes to Blockbuster with his daughter and sees it on the shelf, he will have a feeling of pride; and well he should.\n\nThis motion picture was beautifully filmed with rich cinematography, breathtaking locations, and precise period props and costumes. However, the greatest achievement for Hallstrom, working in concert with Irving, was to orchestrate a large cast in such a way that no character seemed insignificant. Hallstrom took great care to do enough development of each character (often just visually without any dialogue) that he made us care for each of them. He gave the film an emotional depth and breadth that is difficult to achieve in two hours. His work with the children in the orphanage was superb, bringing forth their innocence and enthusiasm without minimizing their plight.\n\nThe acting was uniformly outstanding. Tobey Maguire infused Homer with the right combination of idealism, naiveté and inner strength to make him an unassuming but powerful lead. Charlize Theron continues to impress me with her acting ability. Besides her enchanting girl-next-door attractiveness, she showed terrific range in a character that at first seemed shallow, but later proved to be quite complex.\n\nMichael Caine has had a legendary career spanning close to half a century. He has long been one of my favorite actors. His performance here was powerful and well deserving of the acclaim he received. Dr. Larch was an extremely complex character; egotistical, self-abusive, manipulative and recalcitrant, yet a saintly, self-sacrificing and loving crusader for the good of the children. Caine's ability to span that range was remarkable.\n\nFinally, I have the highest praise for Delroy Lindo as Mr. Rose, the orchard foreman. Lindo's bright smile and enthusiasm created a rock solid character with charm, strength and simple wisdom. He captures our admiration immediately, and despite his despicable act, we cannot help but pity him in the end.\n\nAfter having seen all the films that were nominated by the Academy for best picture last year, I have to say that this was my personal favorite. It wasn't as flashy as the rest; in fact, this was downright old fashioned in its approach. They just don't write stories like this anymore, and that's a shame. I rated it a 10/10. In its quiet way, it captured my heart.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "CT #4",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1741725209",
        "name": "The Cider House Rules",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGVmNGIyOTktMTU4OS00YTM1LWE4OTAtMmRmNmYzNmY2YzlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGVmNGIyOTktMTU4OS00YTM1LWE4OTAtMmRmNmYzNmY2YzlhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:51:22Z",
        "url": "https://www.imdb.com/video/vi1741725209/"
    },
    "url": "/title/tt0124315/"
}