{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Isabelle Adjani",
            "url": "/name/nm0000254/"
        },
        {
            "@type": "Person",
            "name": "Bruce Robinson",
            "url": "/name/nm0732430/"
        },
        {
            "@type": "Person",
            "name": "Sylvia Marriott",
            "url": "/name/nm0550204/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8524,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "alternateName": "The Story of Adele H",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0289659/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106723/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026336/"
        },
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        },
        {
            "@type": "Person",
            "name": "Jean Gruault",
            "url": "/name/nm0344171/"
        },
        {
            "@type": "Person",
            "name": "Suzanne Schiffman",
            "url": "/name/nm0771535/"
        }
    ],
    "datePublished": "1975-10-08",
    "description": "The story of Adèle Hugo's unrequited love for a lieutenant.",
    "director": [
        {
            "@type": "Person",
            "name": "François Truffaut",
            "url": "/name/nm0000076/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWFiNzk3NzMtOGExYS00ZTk4LWE2YzUtNDFlMGFjMTY3YTkzXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "caribbean island,period drama,crying woman,woman dresses as a man,woman wears eyeglasses",
    "name": "L'histoire d'Adèle H.",
    "original_info": {
        "id": "The Story of Adele H._1975",
        "name": "The Story of Adele H.",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lasttimeisaw"
        },
        "dateCreated": "2016-04-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0073114/"
        },
        "name": "A rich girl's blues",
        "reviewBody": "The real story of Adèle Hugo, Victor Hugo's youngest daughter, played by a yet-to-be 20-year-old Isabelle Adjani, whose one-sided infatuation to a British officer, Lieutenant Albert Pinson (Robinson), drives her to leave her family and come to Halifax alone, where he is stationed, only to be subjected to more stern rejection from Pinson, eventually she loses her sanity in Barbados and is sent back to her father, she lives until 1915 at the age of 85.\n\nTruffaut strong-willedly mines into the absurdity and irrationality of unrequited love evinced from Adèle's own diaries, and beats about the bush about Adèle's mental faculties at then, as at first viewers may get a vague idea that she is a congenital liar and her obsession could be completely derived from her imagination. But soon Pinson's visit clears the suspicion, he actually did be romantically linked with her, but presently he doesn't want anything to do with her, but he never gives an explanation, another sly bullet-dodging of revealing the speculative truth, since, understandably, you can not find that in one's own diaries. So, Adèle's torment, is simultaneously inflicted by Pinson's heartless rebuff and by her own deep-rooted delusion, it always takes two to tango, that's where lies the frustrating perverseness of the little destructive thing called love.\n\nThe film is Adjani's star-making vehicle, she harrowingly lays bare Adèle's severely troubled soul on top of her ethereal beauty, and marvelously characterizes her vulnerability and paranoia, which are much beyond her age and experiences, and she laudably earns an Oscar nomination for her prowess. Credits should also be given to Bruce Robinson's portrayal of the obnoxiously uppity, narcissistic and self-serving Albert Pinson, who can mercilessly spurn Adjani's Adèle, a nonpareil belle who only wants to be loved by him, it is a rather surreal and idealistic role, and Robinson indeed makes a dent of his own effort notwithstanding that the movie has never focused on him, it is purely a showcase for the young Adjani.\n\nAdèle's tragedy is a rich kid's blues, living under the shadow of her world-known father and sibling rivalry, she pestered by the incubus of her late sister Léopoldine's drowning accident, and quintessentially, her relentless pursuit of love and marriage is a desperate attempt to imitate Léopoldine's short but fulfilled life, in Adèle's recount, the husband of Léopoldine voluntarily dies with her, that is something she needs to possess, to prove her own worth, after all, it is not about Pinson at all, which is emphatically captured by the final encounter between them.\n\nLike the illusionist (Gitlis) in the picture, our world is populated with deceptions and play-actings, and THE STORY OF ADELE H (it must be where Noah Baumbach's FRANCES HA 2012 gets its titular inspiration), further vouches for Truffaut's will power to debunk the ugly truth in his works, only this time, let it get brutally emotional under a often sombre palette from the one-and-only Néstor Almendros and incited by a compelling tour-de-force from Ms. Adjani.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The story of Adèle Hugo's unrequited love for a lieutenant.",
        "duration": "PT2M52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4021207577",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGQyYzQ1NjAtMjQ5Yy00OTgxLWJmOGYtYWE0MTNjZWJhMDllXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGQyYzQ1NjAtMjQ5Yy00OTgxLWJmOGYtYWE0MTNjZWJhMDllXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-04-22T16:38:37.915Z",
        "url": "https://www.imdb.com/video/vi4021207577/"
    },
    "url": "/title/tt0073114/"
}