{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Caine",
            "url": "/name/nm0000323/"
        },
        {
            "@type": "Person",
            "name": "James Fox",
            "url": "/name/nm0289038/"
        },
        {
            "@type": "Person",
            "name": "Nigel Havers",
            "url": "/name/nm0369814/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2461,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076401/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103620/"
        },
        {
            "@type": "Person",
            "name": "Julian Bond",
            "url": "/name/nm0093972/"
        },
        {
            "@type": "Person",
            "name": "John Hale",
            "url": "/name/nm0354942/"
        }
    ],
    "datePublished": "1987-07-10",
    "description": "A war veteran tries to investigate the murder of his son who was working as a Russian translator for the British intelligence service during the Cold War. He meets a web of deception and paranoia that seems to be impenetrable.",
    "director": [
        {
            "@type": "Person",
            "name": "Simon Langton",
            "url": "/name/nm0486748/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjg5N2UzNDgtNDc4Mi00MjZlLTllYTctYjY2ZDAxNGU1MGVlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "cold war,gchq,translator,british,british intelligence",
    "name": "The Whistle Blower",
    "original_info": {
        "id": "The Whistle Blower_1987",
        "name": "The Whistle Blower",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SimonJack"
        },
        "dateCreated": "2020-07-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092206/"
        },
        "name": "A fair late Cold War spy thriller set in London",
        "reviewBody": "This movie is among the last espionage and spy thrillers to be made during the decades of the Soviet Union and Cold War. \"The Whistle Blower\" won't be remembered far into the future, but some very great movies made in that time will be. Before finishing up on this film, a little review of the period and its subject settings might be of interest.\n\nIt's hard to imagine that anyone alive by 2020 would rue the demise of the U.S.S.R. But, since 1990 Hollywood has mostly lost a milieu that hosted a substantial sub-genre of films. The Cold War was the arena for action, mystery spy films. The world was its stage because the tentacles of the Soviet Union reached around the globe, just as Western trade, military security and humanitarian alliances did.\n\nFor the first couple of decades after World War II, many stories and movies came out about escapes through the Berlin Wall and other areas along the Iron Curtain. Then there were many films about espionage. Ian Fleming's stories about agent 007, James Bond, were started before the war, but continued until near the end of the century. Many of the James Bond films added another dimension of the fictional life of espionage with the Soviets. \"From Russia With Love\" of 1963, \"You Only Live Twice\" of 1967, and \"Never Say Never Again\" of 1983 starred Sean Connery. Others of half a dozen actors to play Bond included spy thrillers with the Russians - \"The Spy Who Loved Me\" of 1977 and \"Moonraker\" of 1979, with Roger Moore.\n\nThere were many other dramatic and action stories of espionage based on novels, some historical, others just fiction. Richard Burton starred in the 1965 classic, \"The Spy Who Came in from the Cold.\" Michael Caine starred in two successive spy flicks in 1966 and 1967, \"Funeral in Berlin\" and \"Billion Dollar Brain.\" Burt Lancaster made \"Scorpio\" in 1973, and Charles Bronson starred in the spy action thriller, \"Telefon\" of 1977.\n\nEven comedies cashed in - so to speak, on Soviet Union relations and the Cold War. Four films remain among the best satires of all time. Two are before the U.S. got into WW II. \"Ninotchka\" of 1939 starred Greta Garbo and Melvyn Douglas, and \"Comrade X\" of 1940 starred Clark Gable and Hedy Lamarr. Then, well into the Cold War just before the Berlin Wall went up, James Cagney and Horst Buchholz starred in \"One, Two, Three\" in 1961. And three years later, the blockbuster satire, \"Dr. Strangelove\" came out. It starred Peter Sellers, George C. Scott and a host of other top actors.\n\nEven mystery master filmmaker Alfred Hitchcock got into the making Soviet-era espionage thrillers. Another one of the great films of all time was \"North by Northwest\" of 1959 that starred Cary Grant, James Mason and Eva Marie Saint. In 1966, Hitchcock made \"Torn Curtain\" that starred Paul Newman and Julie Andrews; and in 1969, he made \"Topaz\" that starred Frederick Stafford and Dany Robin.\n\nSome real-life stories of espionage were being uncovered or revealed during that time, but the movies on such spies as Kim Philby and the Cambridge Five wouldn't come out until the 21st century. And, of course there were TV movies and mini-series about Cold War espionage. But when the Soviet Union collapsed, the Cold War ended, and with it, the Iron Curtain fell. That was the barrier - on paper at first, and then in walls and high security fences that shut off Eastern Europe from the rest of the world. Winston Churchill had coined the name for it while riding a train at night in the U.S. to give a speech. On March 5, 1946, in his speech at Westminster College in Fulton, MO, Churchill used the term, \"iron curtain.\"\n\n\"The Whistle Blower\" is a British spy thriller in which Michael Caine's character, Frank Jones, shakes up England's intelligence hierarchy. Jones is a Royal Navy career retiree and veteran of the Korean War who starts digging after his son turns up dead. It was supposedly a suicide. But Jones had met with his son recently, and Bob (played by Nigel Havers) had told him that there was a mole in British intelligence.\n\nBob worked for GCHQ (Government Communications Headquarters), and said he was going to quit because of the overly suspicious policies being imposed. He says it was so that MI6 would look trustworthy to the American CIA for handling the mole matter. But he says he's worried with what he's heard. He knows the Russian language and listens in on Soviet communications. While Frank thought he was overreacting, when Bob is reported dead from suicide, he decides to investigate himself.\n\nThere's plenty of action and intrigue as Frank uncovers the truth. It has a somewhat surprising ending, but one that most viewers may appreciate. This isn't anything along the lines of the best spy films, but those who enjoy this type of film should find it entertaining.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A war veteran tries to investigate the murder of his son who was working as a Russian translator for the British intelligence service during the Cold War. He meets a web of deception and paranoia that seems to be impenetrable.",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi613204761",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTU2OTlkOWQtZmQwNC00N2JiLWFmMzAtMzYzNTQ1ZjljMmEzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTU2OTlkOWQtZmQwNC00N2JiLWFmMzAtMzYzNTQ1ZjljMmEzXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-10-26T00:40:37.884Z",
        "url": "https://www.imdb.com/video/vi613204761/"
    },
    "url": "/title/tt0092206/"
}