{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Arch Hall Jr.",
            "url": "/name/nm0355246/"
        },
        {
            "@type": "Person",
            "name": "Helen Hovey",
            "url": "/name/nm0397017/"
        },
        {
            "@type": "Person",
            "name": "Richard Alden",
            "url": "/name/nm0017494/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2797,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0078897/"
        },
        {
            "@type": "Person",
            "name": "James Landis",
            "url": "/name/nm0484824/"
        }
    ],
    "datePublished": "1963-09-06",
    "description": "Three people driving into Los Angeles for a Dodgers game have car trouble and pull off into an old wrecking yard where they are held at bay by a bloodthirsty psycho and his crazy girlfriend.",
    "director": [
        {
            "@type": "Person",
            "name": "James Landis",
            "url": "/name/nm0484824/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODEwYmJhMjMtYmM5MS00Yzk0LWJhZGMtZDA4YWZmYzc3OTE4XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "cult film,b movie,grindhouse film,serial killer,exploitation",
    "name": "The Sadist",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FilmFlaneur"
        },
        "dateCreated": "2004-11-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057465/"
        },
        "name": "Arch Hall Jnr's finest hour",
        "reviewBody": "At the centre of The Sadist is Arch Hall Jr, the cult B-movie star with an appearance that, in one uneasy package, combined that of an Elvis and Michael J. Pollard. Hall Jr's film career was instigated by his producer-father Hall Sr, (himself the inspiration of a cult comedy, Jack Webb's The Last Time I Saw Archie, 1961), who saw his son appear in a succession of films in the early 1960s. They range from a favourite escaped-caveman-on the-loose film (Eegah, 1962), to z-grade rock 'n' roll flicks (Wild Guitar, 1962) and a surreally bad thriller (The Nasty Rabbits, 1964). All retain a loyal following, principally because how truly awful they are. Arch Hall's podgy screen incompetence, together with the risible screen scenarios he perpetually struggled through, virtually created a genre all of its own. By all accounts a reluctant participant in his father's cinematic aspirations on his behalf, Hall Jr happily disappeared from the screen after the dismal western Deadwood '76 (1965), and made a career as a pilot thereafter. The director of Hall's swansong, as well as several others of his films, was James Landis (not to be confused with the director of The Blues Brothers). Landis' career was a similar tale of pot-boiling exploitation work, tailing off into obscurity. Astonishingly, Landis also directed The Sadist. Inspired by the commercial success of Psycho, as well as the real life murder spree of teenage killer Charles Starkweather and girlfriend - the exploits of whom also inspired the better known Badlands (1973), The Sadist comes as a revelation to those used to the inept dross Landis and Hall Jr were responsible for elsewhere. It is as if, for once in their otherwise unremarkable careers, true inspiration finally took fire and they both found a vehicle they were born to make. Whereas Landis' direction can be listless and slack, here it is involved and with a sure sense of dramatic pacing. Where Hall's poverty-row rock 'n' roll persona had previously been laughably ineffectual, here his piggy eyes, intimidating pompadour, and lack of emotional sensitivity seem exactly right in a role that demands icy menace. In retrospect, his Charlie Tibbs is a part one might have wished on the young Elvis, before Colonel Parker shunted the singer off into dull family entertainment. \n\nAs others have pointed out, The Sadist's storyline seems amazingly prescient of those increasingly popular amongst modern film makers, such as Kalifornia (1993) for instance, or Breakdown (1997). More interestingly, its suspenseful structure, sweaty claustrophobia, peculiarly menacing protagonists and final chase scenes anticipate The Texas Chainsaw Massacre (1974). Landis' film begins with the arrival of a sputtering car carrying three sweating teachers en route to a baseball game, whose mechanical failure strands them at an apparently deserted breakdown yard. Aboard the car are middle-aged Carl (Don Russell), an early thirties Ed (Richard Alden) and the beautiful Doris (Helen Hovey). While they are searching for spare parts, and the owners of the yard, the trio's initial apprehensions turn into real fear when confronted by gun-toting killer Charlie, and his silent girlfriend Judy (Marilyn Manning). Over the next 90 minutes the victims are subjected to a callous game of threats and violence as the tearaway threatens to kill them all before escaping. \n\nSet almost entirely amidst the rusting clutter of a desert junkyard, The Sadist has a peculiarly intense atmosphere. A lot of this can be attributed to writer-director Landis' hand; a lot more is due to the crisp black and white cinematography of Vilmos Zsigmond, his first film. He went on to be an Oscar winner, responsible for the glories of McCabe And Mrs Miller (1971) and The Deer Hunter (1978). Much of The Sadist's effect is gained through the skillful filming of powerplay in carefully controlled cinematic space, creating virtues out of necessity in a found set, as Zsigmond's camera prowls menacingly along the ground and amongst wrecked cars, placing the tortured protagonists precisely in their dirt arena. Both at the beginning of the film (a chilling introductory voice over by Arch Hall, Sr) and at the film's climax, the audience is given a close up of Charlie's crazed, beady eyes peering out of the shadows - a striking effect, recalling Bela Lugosi's famous glare in White Zombie of 30 years earlier. \n\nZsigmond and Landis are here adept at creating powerful moments without a word hardly being said, such as the remarkable well scene when the prowling Charlie, naked blade in hand, contemplates the vulnerable and near hysterical Doris. Elsewhere they are equally adept at introducing suspense by an absence of action, using off-screen space in ways that reminds one of John Carpenter's finest moments. For instance in the opening scenes, during Carl's increasingly anxious exploration of the deserted yard shack, and the almost casual, short, pan down to where the phone line has been only too recently cut. \n\nHall's moronically sneering Charlie is the most unsettling character in the film and the only role where the actor put in any kind of effort, although even here his performance would have benefited from a little more little more light and shade. Having said that, the malevolent charisma he successfully exudes is still light years away from his regular cheerful mugging and, although he treads the thin line between drama and camp, to the viewer's relief, he never crosses it. Amongst the supporting cast both Don Russell as Carl (also the film's production manager) and Helen Hovey as Doris make their only screen appearances. The only real professional is Richard Alden, a talent later to appear in Tashlin's The Glass Bottomed Boat (1966) before sinking into similar obscurity. His cowardly character Ed, doomed to prevarication and indecision, is a surprising one, who eventually runs rather than fights, almost deserving Charlie's taunting. Well built, he could easily outwrestle and outmuscle his opponent. Early on it is clear that Ed is barely on first name terms with his female colleague - a state of affairs in stark contrast to the abrupt, sadistic insinuations practised by her tormentor who assaults her and pushes her face into the ground. Interestingly, Judy (Marilyn Manning, who also appeared much less impressively in Eegah) barely says a word through the piece but remains an ominous, mute chorus to Charlie's predations. It is her death which triggers the only show of emotion in the killer and which precipitates the final climax. \n\nWith its particularly effective use of chronology (the film occurs in 'real time' over 90 minutes, the passage of events punctuated by radio references to the missed sporting event) The Sadist maintains a tight grip over its running time and, given its trash origins, remains a substantial achievement well worth discovering. It's one of those films that restores one's faith in the B-move genre..."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2455486745",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzU2MmYyY2UtZWI3Mi00NjE0LWJiYmUtYTY0ZDlkYWQ1NTk2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzU2MmYyY2UtZWI3Mi00NjE0LWJiYmUtYTY0ZDlkYWQ1NTk2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-02-09T18:31:01.295Z",
        "url": "https://www.imdb.com/video/vi2455486745/"
    },
    "url": "/title/tt0057465/"
}