{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cary Grant",
            "url": "/name/nm0000026/"
        },
        {
            "@type": "Person",
            "name": "Katharine Hepburn",
            "url": "/name/nm0000031/"
        },
        {
            "@type": "Person",
            "name": "James Stewart",
            "url": "/name/nm0000071/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 70987,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Donald Ogden Stewart",
            "url": "/name/nm0829330/"
        },
        {
            "@type": "Person",
            "name": "Philip Barry",
            "url": "/name/nm0058129/"
        },
        {
            "@type": "Person",
            "name": "Waldo Salt",
            "url": "/name/nm0759029/"
        }
    ],
    "datePublished": "1941-01-17",
    "description": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
    "director": [
        {
            "@type": "Person",
            "name": "George Cukor",
            "url": "/name/nm0002030/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjQ4ZDA4NGMtMTkwYi00NThiLThhZDUtZTEzNTAxOWYyY2E4XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_.jpg",
    "keywords": "love triangle,wedding,reporter,socialite,title spoken by character",
    "name": "The Philadelphia Story",
    "original_info": {
        "id": "The Philadelphia Story_1940",
        "name": "The Philadelphia Story",
        "year": "1940"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2005-12-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0032904/"
        },
        "name": "Great dialogue, great performances and a real fun, urgent pace to the material make this a delightfully fun film",
        "reviewBody": "It is the wedding of the year with socialite Tracy Lord due to marry George Kittredge behind closed doors, with no press allowed. However the editor of Spy Magazine is set to run an exposé of Tracy's philandering father and a New York dancer and strikes a deal with her ex husband CK Dexter Haven if he can get a couple of journalists into the wedding and the reception. Keen to get back at Tracy, Dexter agrees to help and escorts writer Mike Conner and photographer Liz Imbrie into the Lord home in the days before the wedding. With tensions high between Dexter and Tracy, everyone playing games and relationships equally confused and confusing anything could happen and surprises are in store.\n\nShot in about 8 weeks with a low number of takes and some impressive adlibbed and one-shot scenes this is a movie worth seeing even before you look at the cast list and the professional reviews. The plot is partly a comedy, partly a character drama and partly a romance (albeit a rather tidy one) and each aspect pretty much works in tandem with the others. The comic tension between the characters is really well written and, although it is a cliché, it does fizz and spark across the screen and is regularly hilarious and consistently a delight to the ears. With such superficial energy it would be easy to ignore the fact that it is interesting below this; specifically I liked the character of Tracy and the way that parts of the film show her character being stripped back as she in particular learns something about how she comes across, softening her character a little bit in later scenes. However to suggest that this has great depths is to give it more praise than it deserves, because it doesn't run deep and it isn't a great drama. Likewise the romance isn't a main part of it but it does still work because it is all delivered at such a fresh and funny pace that it draws you in, even to the point where I gratefully accepted the film's conclusion with a smile rather than a sneer.\n\nThe cast are a delight, but then that pretty much goes without saying, and they work with the dialogue like a surgeon uses a scalpel. In fact that is a good example because the dialogue is normally almost as sharp as said instrument. Grant may have got top billing and the big money (which he then donated away) but it is very much a shared effort between the three stars, with Grant in fact having the least showy character. If anything the film belongs to Hepburn who is a delight whether spitting back at her father with tears in her eyes or a barbed comment sliding in like a greased knife. Stewart is just as good and is reaction shots show a real comic timing, but he also gives good dialogue and he is fun. Like Stewart, Grant has a great chemistry with Hepburn, which means that he can deliver convincing tension and trade insults without undermining the ending which otherwise would have maybe been an ask too far. Hussey is good and it is easy to forget that she must have felt a bit out of her depth but it never shows in her performance. Support is roundly strong from Young, Nash, Halliday and even Weildler.\n\nOverall this is a delightful film that is such fun and has such a good pace and spark that it is easy to buy into the weaker elements of the narrative and not only forgive them but get into them. The dialogue is sparky and funny while the delivery of same is just what the material deserved. The cast have chemistry and help inject urgency to the story that keeps it all moving forward. A wonderfully delightful film that is fun to watch and surprisingly engaging."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from MGM",
        "duration": "PT3M32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi648348953",
        "name": "The Philadelphia Story",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGNlYWEyY2MtNGY1MC00MDRjLWE5MWUtMzFmYzZhYjU5YjRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGNlYWEyY2MtNGY1MC00MDRjLWE5MWUtMzFmYzZhYjU5YjRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T06:20:10Z",
        "url": "https://www.imdb.com/video/vi648348953/"
    },
    "url": "/title/tt0032904/"
}