{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Livingston",
            "url": "/name/nm0515292/"
        },
        {
            "@type": "Person",
            "name": "Connie Hoffman",
            "url": "/name/nm0388848/"
        },
        {
            "@type": "Person",
            "name": "Richard Smedley",
            "url": "/name/nm0806761/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 455,
        "ratingValue": 3.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Bruce Feld",
            "url": "/name/nm1789530/"
        },
        {
            "@type": "Person",
            "name": "Samuel M. Sherman",
            "url": "/name/nm0792581/"
        }
    ],
    "datePublished": "1973-11-15",
    "description": "Sexy air stewardesses - four naughty female flight attendants - become involved with a wealthy womanizer, with unsurprising results. They live out their wildest sexual softcore nude fantasies.",
    "director": [
        {
            "@type": "Person",
            "name": "Al Adamson",
            "url": "/name/nm0011467/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGJiMDI1ZTAtYzY3MS00M2M3LWFiMDItNGExZWRmYWZmNmFkL2ltYWdlXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "erotica,misogynist,female prisoner,dirty old man,pornographic video",
    "name": "The Naughty Stewardesses",
    "original_info": {
        "id": "The Naughty Stewardesses_1975",
        "name": "The Naughty Stewardesses",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jungophile"
        },
        "dateCreated": "2005-08-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0125430/"
        },
        "name": "Sam Sherman's multi-genre mess",
        "reviewBody": "From the start, you know this is a Sam Sherman film more than an Al Adamson film because as the credits roll, \"A Sam Sherman Production\" appears in letters as big as the title credit. Not only that, Mr. Sherman co-wrote the screenplay and it was his idea to use Bob Livingstone, a washed-up, 69 year old Western star of the old Hollywood era to be his male lead in a picture that Sherman thought would capitalize on the recent success of \"Swinging Stewardesses\". \n\nNow why would you want to have a wrinkled old man as your male lead in what is supposed to be a soft-core exploitation feature? It defies explanation, but that is Sam Sherman for you. His obsession with old Hollywood colored a lot of his films for Independent International Pictures, and he and Al Adamson frequently tried to get has-been actors for their films (e.g. J. Carrol Naish, Russ Tamblyn, Lon Chaney Jr.,etc.). But Bob Livingstone? Tell me the drive-in demographic knew who this '40's second-rater was; it's ridiculous! \n\nBut then again, \"Naughty Stewardesses\" was a successful picture for them, so we can't just write this off as a Sherman fiasco. Still, by any aesthetic standard, it's an incoherent mess. Al Adamson wanted out of this picture, and it is easy to see why. First off, it has no genre focus at all and drifts around from super soft core (tits and ass/simulated sex only) to a kidnapping thriller (shades of Steckler's \"Rat Pfink and Boo Boo\"!) In between, we get subjected to painfully boring sequences of the stewardesses traipsing around Vegas to the hackneyed music of Sparrow, or Richard Smedley and Connie Hoffmann on a photo shoot in San Francisco. Worst of all, we get Bob Livingstone as a Jack LaLanne wannabe in a blue jumpsuit trying to be sexy...gag! (Thankfully, his big sex scene with Connie Hoffmann was deleted, but you can catch him slurping on her titties on the DVD in the Special Features section. Creepy.) \n\nThis is a terrible, terrible movie, but I'll give it three stars for Gary Graver's photography and out of sympathy to Connie Hoffmann for having to make it with \"Wrinkles\" Livingstone. \"Naughty Stewardesses\" is for Al Adamson completists and/or scholars of exploitation film as Sam Sherman's commentary offers vital inside info. All others, BEWARE.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 3,
            "worstRating": 1
        }
    },
    "url": "/title/tt0125430/"
}