{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Wayne",
            "url": "/name/nm0000078/"
        },
        {
            "@type": "Person",
            "name": "Lauren Bacall",
            "url": "/name/nm0000002/"
        },
        {
            "@type": "Person",
            "name": "Ron Howard",
            "url": "/name/nm0000165/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 25422,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Person",
            "name": "Glendon Swarthout",
            "url": "/name/nm0841933/"
        },
        {
            "@type": "Person",
            "name": "Miles Hood Swarthout",
            "url": "/name/nm0841935/"
        },
        {
            "@type": "Person",
            "name": "Scott Hale",
            "url": "/name/nm0355005/"
        }
    ],
    "datePublished": "1976-07-21",
    "description": "A dying gunfighter spends his last days looking for a way to die with a minimum of pain and a maximum of dignity.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Siegel",
            "url": "/name/nm0796923/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Drama",
        "Romance",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDYxNDEwMWEtYjhhNC00ZjUxLTg1NmUtZmFiZTY5OTljMzliXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "year 1901,reference to arizona,bisbee arizona,el paso texas,tucson arizona",
    "name": "The Shootist",
    "original_info": {
        "id": "The Shootist_1976",
        "name": "The Shootist",
        "year": "1976"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thegreatmuggwumpy"
        },
        "dateCreated": "2003-04-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0075213/"
        },
        "name": "The Duke exits in a blaze of glory",
        "reviewBody": "This was John Wayne's last film, and it sees the Duke as an aging, ailing but still tough as steel gunslinger named John Bernard Books. Wayne's character rides into town at the start of the film and visits James Stewart's pleasant Doc Hostetler, who tells him that he has terminal cancer and will die within two months. After this, Wayne goes and rents a room with widow Lauren Bacall, and begins to reflect on his situation, trying to figure a way to die retaining the dignity he has fought all his life to keep unscathed. \n\nThe film is a particularly appropriate one for Wayne's last picture. The protagonist he plays is a man at the top of his profession with nowhere left to go. Any opponent who has ever fought him has died at the end of Books' barrel; but now, he is fighting an enemy he cannot hope to face and beat like a man. Whatever he does to fight the cancer, it will just take him anyway. And so, Books searches for a way to go down fighting and to die with dignity, not dying a slow crippling death in his bed. \n\nBooks is a character that has many faults. He is a man who has killed thirty men and shows no remorse. As he puts it himself, `I never killed a man who didn't deserve it'. However, despite all his faults, he shows himself to a gentleman of the old school. He is like a knight in armour transplanted to the last days of the Wild West, trying hard to keep all the old values of a dignity and honour alive. He is a man who lives by a code which he believes in, and which he applies to others: `I won't be wronged, I won't be insulted, and I won't be laid a hand on. I don't do these things to other people, and I require the same from them.'\n\nThere is no real villain in this film. Books, with all his flaws, is not a bad man. The real villains here are the ordinary people who are all around him in the city, willing to exploit him and use his fame, illness and even his death to further their own wealth. The whole town, from reporters to undertakers, are only too eager to exploit him, with only a few good people being an exception to this tragic rule.\n\nThere is no mistaking that this is the Duke's final picture, and not anybody else's film. It is his persona and his charisma that carries and controls the film. The character of Books  a rough, tough, but by no means bad, man  is very much similar to that of Wayne's own and this film is essentially a vehicle allowing him to have a dramatic swansong befitting a star of his magnitude. \n\nThat isn't to say, however, that the others involved with this don't pull their weight. Lauren Bacall delivers well up to her usual standard of acting, presenting a character both strong-spirited and tenderly gentle at once, something which she does extremely well. Ron Howard also acquits himself admirably as her son, turning in a performance which has the same strength and heart as that of his screen-mother Bacall. James Stewart turns in a powerful cameo, adding to the overall poignancy of the whole affair, and Harry Morgan turns in a repellent performance as the contemptible Marshal Thibado. Dirty Harry director Don Seigel directs with skill and ensures that the film remains poignant, but never sentimental. For a western, this film does not have a great deal of action, but such is the quality of acting, direction and scriptwriting, that this doesn't really matter. When the violence does erupt, however, it is occasionally graphic but always exciting. The film's climactic gunfight is a particular highlight and is one of the Duke's best shoot-outs.\n\nThis is a powerful, entertaining and enjoyable film, regardless; however, it is further ennobled by it being the Duke's final performance. There is something curiously heart-warming about the whole affair, not least the fact that he is enabled to go out in such great style. This is a must for fans of the western genre, for fans of the Duke, or for anyone who just wants to see a well made, poignant film. Highly recommended. [8]"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for The Shootist",
        "duration": "PT3M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3813670937",
        "name": "The Shootist",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWE1MGVlYjQtYTlhNy00Yjg1LWI3NWYtMzNlZTY2ZDRhMDJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWE1MGVlYjQtYTlhNy00Yjg1LWI3NWYtMzNlZTY2ZDRhMDJiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-10-30T03:56:21Z",
        "url": "https://www.imdb.com/video/vi3813670937/"
    },
    "url": "/title/tt0075213/"
}