{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kirsten Dunst",
            "url": "/name/nm0000379/"
        },
        {
            "@type": "Person",
            "name": "Brittany Murphy",
            "url": "/name/nm0005261/"
        },
        {
            "@type": "Person",
            "name": "Paul Freeman",
            "url": "/name/nm0293550/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4238,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0075436/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0075436/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007424/"
        },
        {
            "@type": "Person",
            "name": "Jane Yolen",
            "url": "/name/nm0948461/"
        },
        {
            "@type": "Person",
            "name": "Robert J. Avrech",
            "url": "/name/nm0043334/"
        }
    ],
    "datePublished": "1999-03-28",
    "description": "A 16-year-old American girl with an apathetic view towards her Jewish family history finds herself pulled through time into 1941 to a small Polish village where the Nazis have just begun their genocidal propaganda.",
    "director": [
        {
            "@type": "Person",
            "name": "Donna Deitch",
            "url": "/name/nm0215123/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Fantasy",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWNmYTE0YWYtNGQwYi00ZGFiLTkyNTQtNTAxODhjMmI1MDk5XkEyXkFqcGdeQXVyMjA5MTIzMjQ@._V1_.jpg",
    "keywords": "jewish,nazi,1940s,teenage girl,wizard of oz",
    "name": "The Devil's Arithmetic",
    "original_info": {
        "id": "The Devil's Arithmetic_1999",
        "name": "The Devil's Arithmetic",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jep831"
        },
        "dateCreated": "2003-12-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0179148/"
        },
        "name": "surprisingly good",
        "reviewBody": "I think the movie is even better than the book, and the book is excellent. The movie changed Hannah and Rivkeh to be in their mid-teens rather than only about 11 as in the \"Young Adult\" novel. This might have been done for an \"inside-the-box\" reason, namely so that the director could work with more mature performers. But whatever the reason, the change was for the better, as it made the story more realistic to me -- I can \"buy\" that 16-year-olds could survive without parents in a concentration camp, but not 11-year-olds!\n\nI expected a good performance from Kirsten Dunst, who is known for serious work. But the one who was a revelation was Brittany Murphy, more associated with (mediocre) light comedy (such as \"Summer Catch\" and \"Just Married\"). With dark hair, dark eyes and a believable Polish accent, she utterly disappears into the role of Rivkeh.\n\nTo answer a question posed by a previous poster, about why the great-aunt changed her name ... one reason, not obvious to the casual viewer, comes out of Jewish tradition. It is an old custom for a Jew, after having narrowly escaped death, to take a completely different first name. The (somewhat superstitious) belief is that you are trying to fool the Angel of Death; if you have a different name now, he won't realize it's you and therefore won't try to take you again! The other two reasons are more obvious: She was honoring her friend who sacrificed her life for her, and she was beginning a new life in America (many Jews and others took new names when they immigrated)."
    },
    "url": "/title/tt0179148/"
}