{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jim Caviezel",
            "url": "/name/nm0001029/"
        },
        {
            "@type": "Person",
            "name": "Sean Penn",
            "url": "/name/nm0000576/"
        },
        {
            "@type": "Person",
            "name": "Nick Nolte",
            "url": "/name/nm0000560/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 191589,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036867/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029574/"
        },
        {
            "@type": "Person",
            "name": "James Jones",
            "url": "/name/nm0428296/"
        },
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "datePublished": "1999-01-15",
    "description": "Adaptation of James Jones' autobiographical 1962 novel, focusing on the conflict at Guadalcanal during the second World War.",
    "director": [
        {
            "@type": "Person",
            "name": "Terrence Malick",
            "url": "/name/nm0000517/"
        }
    ],
    "duration": "PT2H50M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjEzMTM2NjAtNWFmZC00MTVlLTgyMmQtMGQyNTFjZDk5N2NmXkEyXkFqcGdeQXVyNzQ1ODk3MTQ@._V1_.jpg",
    "keywords": "battle,tropical island,jungle,guadalcanal,hill",
    "name": "The Thin Red Line",
    "original_info": {
        "id": "The Thin Red Line_1998",
        "name": "The Thin Red Line",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RogerKapur"
        },
        "dateCreated": "1999-03-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120863/"
        },
        "name": "The most influential film of the 1990s",
        "reviewBody": "The \"Thin Red Line\" is not an easy film to understand. It uses one of the most complex narrative structures yet produced by cinema to tell three stories (yes, it DOES have a plot): 1) the one the book wanted to tell (the book's title comes from a 19th century allusion to the British Empire's infantry whose small numbers managed to 'protect' the British [\"civilization\" from their point of view] from the countless hordes of \"savages\" which the Empire ruled (this concept is regrettably racist). James Jones used this analogy to tell the story of how young American soldiers with no battlefield experience become bloodied veterans. 2) the fundamental paradox of war: to protect \"civilization\" (all that we hold dear) we are prepared to send young men to fight in wars. We know that in war they will see and do things that will turn them into the very \"savages\" that we are trying to prevent from destroying our civilization. If you believe that there are things even worse in the world than war (genocide, rule by the Axis powers) then war is not irrational, but the paradox mentioned above exists. 3) man is not distinct from nature but a part of it. Therefore, nature is both beautiful and cruel. (Like our civilization and war). To tell these stories Terence Malick used symbolic imagery, flashback, voice-overs, passages without dialogue, long close-ups of the actors' faces, changes in tempo and a haunting score. For example, his use of symbolism has been much criticized but everything has a purpose e.g. the crocodile entering the green algae covered water (nature's savagery), the native man who passes the company, after they land on the beach, walking in the opposite direction apparently oblivious of their presence (their shocked and bewildered faces reveal how they are forced to question the relevance of the reasons for which they may shortly die - the defense of civilization), the tree being choked by parasitic vines ('nature is cruel' as Lt. Col. Tall so aptly puts it), the bird being born as a soldier dies (it was not dying as many people thought - \"we come from the earth and return to it\" as we hear in the voice-overs), dogs eating a human corpse (\"dog eat dog\" - the soldiers are becoming desensitized to the violence) the same crocodile, now dead, at the end of the film being carried away as a sort of trophy (danger has receded for the moment), the coconut sprouting a palm on the empty beach in the last scene (after death comes birth - the cycle of life). There are, of course, many, many other examples. The use of flashback accompanied by voice-over to convey feelings as opposed to narrate a story must have appeared strange to anyone who never saw Alain Resnais' \"Hiroshima Mon Amour\". It was used most effectively with Ben Chaplin's character (Pvt. Jack Bell) when he thinks of his wife back home - incidentally he idolizes her in the same way we do our own culture - another metaphor. His disillusionment is profound and shows that what he was prepared to die for was only as pure as any ideal. It is often say that there was no character development. This is also false. For example, in the scene where Sgt. Welsh is speaking to Witt shortly after his arrest for being AWOL , Welsh seems to claim that it is every man for himself when he says that individual sacrifice is worthless, there is no world but this one and that each man must get through the war the best that he can. However, we subsequently see him risking his life to deliver morphine to a MORTALLY wounded man during the frontal assault on the Japanese machine gun nests. Also, Witt can not understand where evil comes from in the midst of the beauty he sees in the Melanesian village, but when he returns there he sees man arguing, enemy skulls, crabs hideously crawling around on an outstretched human hand and a child's back covered with insect bites while those people around it are seemingly uncaring. These images suggest that evil is inherent in man. Malick avoids the usual stereotypes. Although we see heroic acts (such as the taking of the machine gun nests by Capt. John Gaff's [John Cusack] team of volunteers), there are no recognizable heros. It is true that the characters are not sharply defined. When the violence comes it is against all of them i.e. all of US. Are there then any relevant negative criticisms of the movie? I would say that it did not meander as some critics alleged (every scene has a purpose) but it was unnecessarily long. There is a certain irony in this. It is said that Malick edited over 100 hours of material first to 9 hours. Understandably the studio did not accept this. He then reduced it to 6 hours and then to 3. (This helps to explain the lightning appearances by John Travolta and George Clooney, I see no problem, however, with using big name stars in such short roles - Richard Attenborough did it in \"A Bridge Too Far\"). With so much cherished material available, I suspect that Malick fell into the trap of opting for the maximum length that the studio would allow when more artistically efficient editing would have reduced the film to 2* hours. The balance between the action and meditative passages would have worked better if certain scenes had been cut, such as Witt's passing a wounded soldier on the way back to his company after leaving the Melanesian village the second time and also the conversation that Witt and Welsh have towards the end of the film (Welsh appears a stranger to him, suggesting that he is simply a troublemaker). Even with the exclusion of these scenes Witt would still appear a humanist and Welsh a complex \"every man\". Most people would agree that the film is visually stunning. As there has been very little even remotely similar in the past, it will be confusing for many people but I am convinced that this will come to be seen as a hugely important work - the most influential of the 1990s."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Criterion trailer",
        "duration": "PT2M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1266944281",
        "name": "The Thin Red Line",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjM5MjgxZjYtMDBiZC00ZDliLTg5YzUtNWY1MThkMWE3ZGY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjM5MjgxZjYtMDBiZC00ZDliLTg5YzUtNWY1MThkMWE3ZGY5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-09-10T03:37:59Z",
        "url": "https://www.imdb.com/video/vi1266944281/"
    },
    "url": "/title/tt0120863/"
}