{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Reed",
            "url": "/name/nm0001658/"
        },
        {
            "@type": "Person",
            "name": "Florence Henderson",
            "url": "/name/nm0001341/"
        },
        {
            "@type": "Person",
            "name": "Ann B. Davis",
            "url": "/name/nm0002036/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14768,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053559/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0074697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037052/"
        },
        {
            "@type": "Person",
            "name": "Sherwood Schwartz",
            "url": "/name/nm0777442/"
        }
    ],
    "datePublished": "1969-09-26",
    "description": "The misadventures of a large family united when a widower and a widow marry.",
    "genre": [
        "Comedy",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY0ODc0MzYyNV5BMl5BanBnXkFtZTYwODg4MzM5._V1_.jpg",
    "keywords": "groovy fashion,motherhood,fatherhood,stepfather stepdaughter relationship,stepmother stepson relationship",
    "name": "The Brady Bunch",
    "original_info": {
        "id": "The Brady Bunch: Season 1_1969",
        "name": "The Brady Bunch: Season 1",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "roghache"
        },
        "dateCreated": "2006-06-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063878/"
        },
        "name": "Light hearted misadventures of an idealized Big Happy Family",
        "reviewBody": "This is a sitcom from the 1970's that is based on an unlikely premise but nevertheless makes good family viewing...fun, heartwarming, and entertaining escapist drivel. The story revolves around a blended family originating when the widowed California architect, Mike Brady, marries a lovely lady, Carol, who is herself a single mom raising three daughters. Mike's three boys, Greg, Peter, & Bobby, originally range in age from 7 to 13. Carol's girls, Marcia, Jan, & Cindy, vary from age 6 to 12. By the series' end all the kids are basically teenagers. Meanwhile, the six offspring in this new combined family together experience assorted growing up trials, sibling rivalry, school issues, dating woes, and family vacations. Also included in the Brady family is their comical live-in housekeeper named Alice.\n\nOf course it isn't exactly a likely scenario, the blending of so many children (including teenagers) more probably fraught with major serious challenges. Here the family is both relatively affluent and very functional, with any difficulties quite trivial and always amusingly solved within the half hour. Not only do these six kids have a stay at home mom but also the benefit of the affable & amusing Alice to help sort things out for them. Furthermore, the former spouses prove to be no problem. The boys experience no prolonged grief for their birth mother, Mike's first wife. It isn't clear whether Carol is divorced but in any case, her first husband seems conveniently out of the picture. The kids immediately assume all appropriate parental and fraternal bonds with their step people.\n\nHowever, the show's essential positive values more than compensate for all these inadequacies, with sitcoms generally not intended to be unduly realistic anyway. True, the Bradys live a prosperous California lifestyle in a Los Angeles suburb, the parents are invariably patient and caring, and the kids sometimes even get to choose their own punishments. Nevertheless, these Brady kids are respectful of their parents, who are assumed to know more than their children (not the reverse). They are disciplined when they go astray, taught concepts of right and wrong, and generally expected to live up to them. All in sharp contrast to prevailing modern TV standards.\n\nI haven't really watched the show in re runs though would still tune in now and then, if given the opportunity. Therefore it's been awhile, so I don't recall many specific episodes. The Bradys are definitely an idealized average American middle class family. However, it's a carefree, innocent, and light hearted program, improbable but with good values.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT1M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1468662041",
        "name": "The Brady Bunch",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGUwMWJiYjktMzc5My00YzM2LTljZDAtNTEwYWIzYmZkYjRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGUwMWJiYjktMzc5My00YzM2LTljZDAtNTEwYWIzYmZkYjRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:13:58Z",
        "url": "https://www.imdb.com/video/vi1468662041/"
    },
    "url": "/title/tt0063878/"
}