{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bruce Davison",
            "url": "/name/nm0001117/"
        },
        {
            "@type": "Person",
            "name": "Peyton E. Park",
            "url": "/name/nm0661914/"
        },
        {
            "@type": "Person",
            "name": "Niki Flacks",
            "url": "/name/nm0280818/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2726,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039462/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034908/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037666/"
        },
        {
            "@type": "Person",
            "name": "Roger Swaybill",
            "url": "/name/nm0842011/"
        },
        {
            "@type": "Person",
            "name": "Diane English",
            "url": "/name/nm0257606/"
        },
        {
            "@type": "Person",
            "name": "Ursula K. Le Guin",
            "url": "/name/nm0494372/"
        }
    ],
    "datePublished": "1980-01-09",
    "description": "In a highly controlled and overpopulated society, a man who has terrifying dreams that affect reality is assigned a psychiatrist who takes advantage of the situation.",
    "director": [
        {
            "@type": "Person",
            "name": "Fred Barzyk",
            "url": "/name/nm0059563/"
        },
        {
            "@type": "Person",
            "name": "David R. Loxton",
            "url": "/name/nm0523414/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTE4MjA5NTY5OV5BMl5BanBnXkFtZTYwMzQ4OTE5._V1_.jpg",
    "keywords": "dream,alternate reality,post apocalypse,fantasy becomes reality,portland oregon",
    "name": "The Lathe of Heaven",
    "original_info": {
        "id": "The Lathe of Heaven_1980",
        "name": "The Lathe of Heaven",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Dilip"
        },
        "dateCreated": "2001-03-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081036/"
        },
        "name": "A must see for science fiction fans - be careful what you dream about",
        "reviewBody": "I had public television on several days ago (March 10, 2001) and \"Lathe of Heaven\" was starting on their series \"Movies Worth Taping\". I'm glad I happened to turn the TV on, as it was a movie well worth watching! It was made in 1987 as the first made-for-public-TV film, and is based on a novel by Ursula Le Guin.\n\nThis movie explores the notion of \"effective dreaming\", where one's dreams actually come true. It explores the strange dreams of George Orr (Bruce Davison). When he has these dreams, he wakes to find that his dreamt-up situations are now not only reality, but other people suddenly have adapted as if this reality has been with the world for some time.\n\nGeorge is traumatized by these dreams, and seeks the help of Dr. William Haber (Kevin Conway). Dr. Haber's intentions are good, to harness the power of these effective dreams to the betterment of the world, but he clearly abuses the doctor-patient relationship and hypnotizes George to have specific kinds of dreams. One motto of this film might be \"be careful what you dream about\"!\n\nI found the special effects sometimes interesting, but often heavy-handed and not so smoothly executed. The setting, sometime in the near future in Portland, Oregon, was inexplicably dreary, beyond the rain that the city is well known for. The character development could have been stronger, with ancillary characters like Dr. Haber's secretary and the very few others seeming to be made out of cardboard and lacking emotion. George and Heather LeLache (Margaret Avery), however, enjoyed more solid and believable depictions.\n\nIn spite of these criticisms, the film was an exciting journey into inner space that indulges us to think about deep philosophical questions. What is reality? Are there parallel realities? What is or should be knowable about the nature of existence (to me reminiscent a bit of \"2010\", one of my favorite science fiction films)? What happens if we dream each other into or out of reality? \"The greatest good for the greatest number\" or rights of the individual? Can we design a utopia or will we be doomed to experience accidents we never considered that render such a proposed utopia much less than ideal? \"The Lathe of Heaven\" doesn't have the fresh and exciting visual effects of earlier science fiction films like \"2001\" or later ones, but is an interesting film that is a must see for science fiction fans."
    },
    "url": "/title/tt0081036/"
}