{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Donald Sutherland",
            "url": "/name/nm0000661/"
        },
        {
            "@type": "Person",
            "name": "Lesley-Anne Down",
            "url": "/name/nm0001153/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18541,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "The Great Train Robbery",
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023012/"
        },
        {
            "@type": "Person",
            "name": "Michael Crichton",
            "url": "/name/nm0000341/"
        }
    ],
    "datePublished": "1979-02-02",
    "description": "England, 1850s. A master criminal aims to rob a train of a large sum of gold. Security is incredibly tight and the task seems an impossible one. However, he has a plan and just the right people to carry it out.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Crichton",
            "url": "/name/nm0000341/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Adventure",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWE4M2UwNWEtODFjOS00M2JiLTlhOGQtNTljZjI5ZTZlM2MzXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "train robbery,based on true story,based on novel,1850s,gold",
    "name": "The First Great Train Robbery",
    "original_info": {
        "id": "The Great Train Robbery_1978",
        "name": "The Great Train Robbery",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Coventry"
        },
        "dateCreated": "2019-02-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079240/"
        },
        "name": "Ocean's 1855",
        "reviewBody": "The very least you can say about Michael Crichton (1942-2008) is that he was an extremely intelligent, versatile and busy worker! He studied journalism, anthropology and medicine, to eventually become Sci-Fi/thriller novelist, screenwriter and director. His studies and interests certainly explain the themes and range for most of his novels and screenplays, but there are still several odd and rather unlikely achievements in his repertoire. \"The Great Train Robbery\" is probably the oddest of the bunch. After grim and scholarly Sci-Fi stories like \"The Andromeda Strain\", \"Westworld\", \"The Terminal Man\" and \"Coma\", I don't think anybody expected Crichton to come up with a light-headed Victorian period piece about the infamous 1855 train heist.\n\nSean Connery's character has decided for himself that he will pull off what no other thief has even properly attempted to do, namely steal a large amount of government gold from a massively secured safe on a moving train. He receives help from the lewd Lesley-Ann Down, who merely just uses her feminine charms and bodily trumps, and the self-acclaimed fastest key runner in the country; Donald Sutherland. Together they must figure out how to unnoticedly get hold of four separately secured keys to the safe, and then still find a solution to break into the guarded bank wagon and get out the loot. \"The Great Train Robbery\" reminded me very much of \"Ocean's 11\". I haven't seen the 1960 original, starring Frank Sinatra, but it isn't unthinkable that Steven Soderbergh also took some ideas from this film whilst he was preparing the 2001 remake. Connery's witty charms and small talks to infiltrate into high-society families, the grotesquely detailed schemes to plagiarize the keys, the acrobatic con-artist, the meticulously timed simulations, ... These are all scenes that could come straight out of \"Ocean's 11\".\n\n\"The Great Train Robbery\" is a well-made, nicely acted and overall reasonably entertaining period film. It does have several defaults, though, notably that Crichton cannot seem to decide whether he wants his film to be a comical crime caper or a suspenseful heist movie. Certain parts are particularly bleak (like the dog-fighting, the execution, etc...) but mostly it's tongue-in-cheek, so the film kind falls in between genres. The Robin Hood styled ending also feels very forced. The Victorian costumes and decors look great, Jerry Goldsmith's score is exhilarating and both Sean Connery and Donald Sutherland put down pleasant performances, all of which still makes \"The Great Train Robbery\" recommended viewing!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "England, 1850s. A master criminal aims to rob a train of a large sum of gold. Security is incredibly tight and the task seems an impossible one. However, he has a plan and just the right people to carry it out.",
        "duration": "PT3M",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3319054617",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDFkODZjOGQtMDIwYi00YTZjLTg4MjUtYzVkOGQ2ZWMwNzUyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDFkODZjOGQtMDIwYi00YTZjLTg4MjUtYzVkOGQ2ZWMwNzUyXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-03T11:35:00.529Z",
        "url": "https://www.imdb.com/video/vi3319054617/"
    },
    "url": "/title/tt0079240/"
}