{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mickey Rourke",
            "url": "/name/nm0000620/"
        },
        {
            "@type": "Person",
            "name": "Dermot Mulroney",
            "url": "/name/nm0000551/"
        },
        {
            "@type": "Person",
            "name": "Ted Levine",
            "url": "/name/nm0505971/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2833,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0095169/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Person",
            "name": "Eric Red",
            "url": "/name/nm0714599/"
        }
    ],
    "datePublished": "1993-10-30",
    "description": "Left for dead by his bank robbing gang, a marauder joins a posse to seek revenge.",
    "director": [
        {
            "@type": "Person",
            "name": "Geoff Murphy",
            "url": "/name/nm0614276/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Action",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmQ1NmFhZWUtZGNiNi00MDg1LTg5N2ItYWVjMmM4Y2U1NTFhXkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg",
    "keywords": "rifle,killing an animal,u.s. mexico border,small town,horse",
    "name": "The Last Outlaw",
    "original_info": {
        "id": "The Last Outlaw_1994",
        "name": "The Last Outlaw",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TOMASBBloodhound"
        },
        "dateCreated": "2008-08-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110307/"
        },
        "name": "Very violent western.",
        "reviewBody": "I recall this film since way back to its debut on HBO where it was produced for the small screen. The Last Outlaw might have seemed like a throw-away effort back in those days as many of us were still mesmerized by the character-driven epic Unforgiven. With The Last Outlaw, the emphasis is clearly on action and suspense. Nobody is attempting to re-define the genre with this picture. The film was written by Eric Red, and directed by Geoff Murphy. The films these men are associated with often rely on action and violence to get their message through. This film is no different.\n\nThe film begins with an obvious homage to the opening moments of The Wild Bunch. A posse of desperadoes, this one led by Mickey Rourke, rides brazenly into a small town with the intent of robbing a bank. And just like in The Wild Bunch, there is a group of men ready and waiting for them. A violent shootout complete with explosions ensues, and the gang is forced to ride out of town in a hurry. They are shot up and bleeding, but at least they got the money! Once the gang is safely out of town, they stop and regroup. Tensions between leader Rourke and his lieutenant Dermot Mulroney quickly boil over about leaving a wounded man behind. Rourke is shot and left for dead. But he sure as heck isn't dead. The rest of the film details the remaining gang members' attempt to flee to Mexico with a posse from the town hot on their trail. And Rourke, through some interesting complications, finds himself reincarnated as THE POSSE'S leader! Nothing will stop him from hunting his old gang down and killing them off one by one! Dozens of gunshot victims from both sides are soon strewn across the New Mexico countryside.\n\nThe film has a lot going for it. The cast is uncommonly talented for such a film simply made for cable. Rourke is as good as ever. Mulroney has never impressed me as an actor, but he sure looks like real a cowboy.Great support from Ted Levine, John C. McGinley, and Steve Buscemi, among others. Even the guy who plays Fraker in Death Wish 3 has a part as a cocky town marshal. The scenery of the countryside surrounding Sante Fe is quite breathtaking, and the DVD transfer makes it look even better than it did on cable. Most of the cowboys in this film are said to be former Confederate soldiers. Many still wear items from their old CSA uniforms. And there is talk of how Union soldiers raped and murdered Rourke's wife and daughters while he was off fighting. This is perhaps what made him such a hardened killer. This angle is likely inspired from Eastwood's Josey Wales character, though it is common knowledge that many of the Confederacy's more violent types headed west after the war since there was nothing left for them back home.\n\nThe film has some flaws, as it is not a true classic of the genre. Some of the action is truncated, and gunfights are often used simply to trim down the number of active characters so we the audience can hopefully keep up with them all. It looks like many of the horses on this set were perhaps treated pretty rough. Many stunts involve horses falling to the ground or having to climb treacherous hillsides. I just hope none were killed like they were on the set of Heaven's Gate. Also, Keith David's character was a bit out of place. Not because he's a black man with a bunch of former rebels, but because they have him trying to use voodoo bones to predict who will die next. Kind of dumb, unless they would have developed it more. The film's brief running time just probably didn't make deep characterization possible for everyone. And it must be said that there are some VERY graphic killings for a western. People don't just simply get shot and we see them fall off their horse from thirty feet away. Some guys get turned into goo!! Overall this is a fun, and diverting western. Probably a bit better than it deserves to be. 8 of 10 stars.\n\nThe Hound.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0110307/"
}