{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kevin Kline",
            "url": "/name/nm0000177/"
        },
        {
            "@type": "Person",
            "name": "Emile Hirsch",
            "url": "/name/nm0386472/"
        },
        {
            "@type": "Person",
            "name": "Joel Gretsch",
            "url": "/name/nm0340408/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 17430,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0064908/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043853/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103944/"
        },
        {
            "@type": "Person",
            "name": "Ethan Canin",
            "url": "/name/nm0133982/"
        },
        {
            "@type": "Person",
            "name": "Neil Tolkin",
            "url": "/name/nm0866063/"
        }
    ],
    "datePublished": "2002-11-22",
    "description": "An idealistic prep school teacher attempts to redeem an incorrigible student.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Hoffman",
            "url": "/name/nm0001355/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmZiMTY3OTctNDlkMC00Njk0LWE0NTAtODViNzk3OTFhMzI3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "pornographic magazine,golf resort,told in flashback,ear piece,marriage",
    "name": "The Emperor's Club",
    "original_info": {
        "id": "The Emperor's Club_2002",
        "name": "The Emperor's Club",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2003-06-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283530/"
        },
        "name": "4/5 Stars",
        "reviewBody": "\"The Emperor's Club\" is a lot different than you would think. It does run a bit on cheesy sentimentality, but the ending is more than surprising considering the type of film this is.\n\nIt is a period-piece about a teacher (Kevin Kline) at a prestigious school for boys, and how he tries to \"mould\" a strong-willed fifteen-year-old boy. And if you want a hint at the surprise ending, don't read any farther, because I cannot control telling you that in the end he does not change the boy. Which is what truly amazed me. Most of the time in films like these, we see the free-spirited kid become proper and respectful. But not so here. This tale doesn't have a perfect teacher turning a bad boy into a perfect boy. It has a flawed teacher wasting years on one student. Years later at a party, he tells the boy, Sedgewick (now an adult), \"as a teacher I have failed you.\" And that's what is so very different about this movie. It isn't as heavy on the drama as I thought it would be, and comes across a bit cheesy and fluffy at times, but the ending is more surprising than \"The Sixth Sense\" ever will be. It doesn't rely on tried-and-used methods, but goes for a new route. And just when you think that it's as depressing as it can get, the very, very end gives your spirit a bit of a boost.\n\nKline realizes that in those years that Sedgewick attended his class, he ignored the other students who were trying - and actually cared - about what they were doing. It kind of sheds a new light on the films where a teacher devotes time to one student in particular, because after seeing this film, I bet ten bucks next time you watch a film of the same roots you'll realize that the teacher is ignoring the other students. And \"The Emperor's Club\" exposes this. Kline's character is flawed, and while he is a good teacher, he makes mistakes, such as spending so much time on Sedgewick and bumping a smarter kid off of the school toga challenge, just so he can put Sedgewick in it (the challenge).\n\nKevin Kline isn't Otto here. \"A$$hole!\" is not a motto here. We've got Kline giving a thoroughly convincing performance as a 1970s all-boys school teacher. Kline's makeup at the end of the film is quite good as well, as opposed to something like \"The Dish\" where Sam Neil's makeup looks like it's about to fall off his face and his wig is about to be plucked off by a gust of wind.\n\nI also liked the student actors in this film. The actors they got to play the various students were pretty good; in fact, many of them were very good. I hope their careers continue after this film, and as hateable as Sedgewick was in this film, the kid who played him was pretty convincing. You always know this when you start to like or dislike a character, much less hate or love them.\n\nAt the end of the film, I like the subtle differences in years. In the 1970s, a group of boys travel across a lake to check out the all-girls school, where nuns shoo them away. 28 years later, as Kline's character walks towards his schoolroom, we see boys and girls walking around. In 28 years society has changed, and it's funny to wonder if that group of boys from the 1970s ever thought that in 28 years, what they were paddling across a lake for would be right next to them."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Coming Soon\"",
        "duration": "PT30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2859598617",
        "name": "The Emperor's Club",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOThhMWZlZmQtZmM4Ny00YTBjLWE3NGMtZjFlMDdhMzMzMWNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOThhMWZlZmQtZmM4Ny00YTBjLWE3NGMtZjFlMDdhMzMzMWNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-03-22T05:33:55Z",
        "url": "https://www.imdb.com/video/vi2859598617/"
    },
    "url": "/title/tt0283530/"
}