{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Pedro Pascal",
            "url": "/name/nm0050959/"
        },
        {
            "@type": "Person",
            "name": "Bella Ramsey",
            "url": "/name/nm8165602/"
        },
        {
            "@type": "Person",
            "name": "Anna Torv",
            "url": "/name/nm1396022/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 353707,
        "ratingValue": 8.9,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0016350/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0328593/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0135004/"
        },
        {
            "@type": "Person",
            "name": "Neil Druckmann",
            "url": "/name/nm3773654/"
        },
        {
            "@type": "Person",
            "name": "Craig Mazin",
            "url": "/name/nm0563301/"
        }
    ],
    "datePublished": "2023-01-15",
    "description": "After a global pandemic destroys civilization, a hardened survivor takes charge of a 14-year-old girl who may be humanity's last hope.",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGUzYTI3M2EtZmM0Yy00NGUyLWI4ODEtN2Q3ZGJlYzhhZjU3XkEyXkFqcGdeQXVyNTM0OTY1OQ@@._V1_.jpg",
    "keywords": "based on video game,post apocalypse,pandemic,violence,zombie",
    "name": "The Last of Us",
    "original_info": {
        "id": "The Sum of Us_1995",
        "name": "The Sum of Us",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OzzzzSSzzzzO"
        },
        "dateCreated": "2023-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt3581920/"
        },
        "name": "The Last of Us: A Masterful Adaptation of a Critically Acclaimed Game",
        "reviewBody": "\"The Last of Us,\" the highly-anticipated HBO series based on the critically acclaimed video game of the same name, is a truly remarkable viewing experience that will leave you captivated from start to finish. The show expertly adapts the game's powerful storytelling and characters for the small screen, delivering a thrilling and emotionally charged journey through a post-apocalyptic world ravaged by a deadly fungus.\n\nOne of the show's greatest strengths is its commitment to character development and emotional depth. Pedro Pascal and Bella Ramsey give outstanding performances as Joel and Ellie, respectively, and the script does a masterful job of exploring the complex bond that forms between them as they navigate the dangers of a fallen society. The series also manages to expand on the game's already rich world-building, delving deeper into the politics and power struggles of the remaining human settlements.\n\nThe direction and production design are also top-notch, with the series effectively capturing the gritty, desperate feel of a world on the brink of collapse. The cinematography and score also deserve special mention, adding to the overall atmosphere of the show and amplifying the emotional impact of key scenes. The special effects used in the series are also outstanding and adds to the cinematic feel of the show.\n\nThe series also delves into the psychological and emotional impact of the characters, and the audience can see the gradual change in the characters throughout the series. The script is well written and leaves a lasting impact on the audience. The pacing of the series is also well done and keeps the audience engaged throughout the show.\n\nOverall, \"The Last of Us\" is a must-watch for fans of the game and newcomers alike. The series manages to stay true to the source material while also standing on its own as a masterful piece of storytelling. It's a thrilling and ultimately hopeful, tale of survival and humanity in the face of unimaginable horror that will leave you in awe.\n\nIt is the storytelling, powerful performances, and the intense atmosphere that will leave you captivated and sets it apart as an unforgettable watch. The series also raises some thought-provoking questions about the nature of humanity and the lengths we will go to survive. It's a series that will stay with you long after you've finished watching it.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Season Finale of The Last of Us premieres next Sunday at 9 pm ET on HBO Max.",
        "duration": "PT26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3368993817",
        "name": "Season 1 Finale Preview",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODNlZDg3YmItZTA2Mi00ZWEzLWJkNjUtMTk5NjQwZDdjNWU2XkEyXkFqcGdeQWRvb2xpbmhk._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODNlZDg3YmItZTA2Mi00ZWEzLWJkNjUtMTk5NjQwZDdjNWU2XkEyXkFqcGdeQWRvb2xpbmhk._V1_.jpg",
        "uploadDate": "2023-03-06T05:57:27.089Z",
        "url": "https://www.imdb.com/video/vi3368993817/"
    },
    "url": "/title/tt3581920/"
}