{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alec Baldwin",
            "url": "/name/nm0000285/"
        },
        {
            "@type": "Person",
            "name": "Kim Basinger",
            "url": "/name/nm0000107/"
        },
        {
            "@type": "Person",
            "name": "Michael Madsen",
            "url": "/name/nm0000514/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18819,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0080130/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002923/"
        },
        {
            "@type": "Person",
            "name": "Jim Thompson",
            "url": "/name/nm0860292/"
        },
        {
            "@type": "Person",
            "name": "Walter Hill",
            "url": "/name/nm0001353/"
        },
        {
            "@type": "Person",
            "name": "Amy Holden Jones",
            "url": "/name/nm0427468/"
        }
    ],
    "datePublished": "1994-02-11",
    "description": "An ex-con and his devoted wife must flee from danger when a heist doesn't go as planned.",
    "director": [
        {
            "@type": "Person",
            "name": "Roger Donaldson",
            "url": "/name/nm0002044/"
        }
    ],
    "duration": "PT1H55M",
    "genre": [
        "Action",
        "Adventure",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGY5YjhmMjYtMGMwZS00ZjUyLTk1NWMtNTA5YWVhM2I5MjE1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "murder,sex scene,distrust,anti heroine,texas",
    "name": "The Getaway",
    "original_info": {
        "id": "The Getaway_1994",
        "name": "The Getaway",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "joltjohn"
        },
        "dateCreated": "2003-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0109890/"
        },
        "name": "In the end The Getaway is an OK action movie.",
        "reviewBody": "The Getaway is a remake of the action classic that stared Steve McQueen and Ali MacGraw. Now I haven't seen the original so I can't compare the two but by it self this is an OK action thriller. It goes old school with its desert/western setting, bad criminals and finale stand off. When I watched this movie I had no idea what kind of movie it is. The story is simple Doc McCoy (Alec Baldwin), his wife (Kim Basinger) and his partner (Michael Madsen) are hired to get a man out of prison. When the job goes sour, McCoy is locked up for a year in a Mexican prison. With the help of his wife and a Phoenix crime boss Jack Benyon (James Woods), he released and hired to do one more job. This job goes semi good but after it has been done many people end up dead and the McCoys are on the run from many different people all with their eyes on the large amount of cash they have. The performances are OK. Basinger is tough yet still has that soft side and she very good with guns. Madsen is a good mix with Baldwin and Basinger, he add the funny but villainous third part of the gang. The cast is bigger than normal for an action film but since this was made in the early 90's some of the actors hadn't hit it big yet. Jennifer Tilly, Phillip Seymore Hoffman and David Morse round out the cast. They all have small parts but they do the best with what they have. The action is not really original and there are a few Woo slow-motion shots thrown in for good measure. There's only one explosion but a lot of guns. The protagonists aren't very likeable, though. In fact, no one in this film is, with the possible exception of Richard Farnsworth's character at the end. Jennifer Tilly threw herself into her role, and both Michael Madsen and James Woods, do their usual creepily evil personas with aplomb.\n\n THE GETAWAY works because the chemistry of sex and violence between the characters played by BALDWIN and BASINGER works. It's not cheesy or contrived. This film is a tale of moral love betrayal and the classic analogy of there being no honor among thieves. The remake follows pretty much the same plot as the STEVE MCQUEEN classic yet takes a few different turns. Fans of the original will like this version as well, one nice aspect is that it maintains a similar look to the original. This film matches the tone of the original and succeeds as a modren film for contemporary audiences.\n\nA major problem with The Getaway is the way the McCoys are seemingly able to sense danger when there is not even the slightest indication of it. Carter, for example, has the incredible ability enabling him to know a gunman is just outside his door as soon as he finishes another bedroom scene with his wife! This serves as an example of how unimaginative things get. the infamous sex scenes are really undeserving of the attention. They are gratuitous in the extreme as they don't serve the story whatsoever. You can't believe the characters like each other that much, having spent most of their time in bitter argument. Believe me, you won't like these characters either.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3706847513",
        "name": "The Getaway",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGZkMjdlNzQtMGNkYi00Y2JlLWEyN2ItZWIyNDBmNGU5MTg1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGZkMjdlNzQtMGNkYi00Y2JlLWEyN2ItZWIyNDBmNGU5MTg1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:43:44Z",
        "url": "https://www.imdb.com/video/vi3706847513/"
    },
    "url": "/title/tt0109890/"
}