{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jack Lemmon",
            "url": "/name/nm0000493/"
        },
        {
            "@type": "Person",
            "name": "Ricky Nelson",
            "url": "/name/nm0625699/"
        },
        {
            "@type": "Person",
            "name": "John Lund",
            "url": "/name/nm0526184/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2241,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Richard Murphy",
            "url": "/name/nm0614645/"
        },
        {
            "@type": "Person",
            "name": "Herb Margolis",
            "url": "/name/nm0546786/"
        },
        {
            "@type": "Person",
            "name": "William Raynor",
            "url": "/name/nm0713523/"
        }
    ],
    "datePublished": "1960-12-29",
    "description": "During WW2, Lt. Rip Crandall, who was a yachtsman before the war, takes command of the USS Echo, a sailing ship, for a secret mission in waters patrolled by Japanese warships.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Murphy",
            "url": "/name/nm0614645/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Comedy",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2YzMzEzYzUtOTljNC00YjZiLTg1MWYtZTQwNWM0OTMyMDkyXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "lieutenant,navy,u.s. navy,spy,radio operator",
    "name": "The Wackiest Ship in the Army",
    "original_info": {
        "id": "The Wackiest Ship in the Army_1960",
        "name": "The Wackiest Ship in the Army",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lawprof"
        },
        "dateCreated": "2003-05-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054453/"
        },
        "name": "Promoted Two Grades and a Better Officer!",
        "reviewBody": "Based on true events (we were at war with the Japanese in 1943 in the Pacific), \"The Wackiest Ship in the Army\" stars Jack Lemmon as, once again, a naval officer.\n\nLemmon made his first big film in 1955 when he played the con artist, Ensign Pulver, in \"Mister Roberts,\" a movie that's attained classic status. In this 1961 film he dons the navy uniform again, this time as a lieutenant (senior grade). A reserve officer who was a dapper yachtsman in California before the war, Lemmon is assigned to command a sailing vessel with (barely functioning) auxiliary mechanical propulsion.\n\nThe U.S.S. Echo is hardly the dream command of any officer, reserve or regular. But the new C.O. gamely takes on training an eager but totally bemused crew in the art of sailing a vessel.\n\nThe Echo is assigned to land an Australian coast watcher on an island occupied by the stereotypically portrayed Japanese (more Japanese officers with U.C.L.A. degrees appear in film than ever showed up on the front). The heroic coast watchers were very important during the island hopping campaign and they deserve every bit of cinematic recognition they have received. Many died, some after being tortured by their captors.\n\nNowhere nearly as smoothly directed as \"Mister Roberts,\" \"The Wackiest Ship in the Army\" (and there's no rational reason for the title-the Army doesn't even play a role here) teeters unevenly between some nice comedy and some very 1950s-1960s war action supplemented by combat footage (one Japanese plane has been shown blown out of the sky so often in movies that if the pilot's estate was entitled to royalties the heirs would be richer than Bill Gates).\n\nThe exploits of the Echo's crew led, we are told, to the American victory in the Battle of the Bismarck Sea, an important engagement.\n\nThis is a good film for renting. Jack Lemmon plays the competent and caring C.O. very nicely and is the center of the story.\n\nThe Navy must have really liked the script. They put a fleet anchorage at the filmmaker's disposal. Here's a quiz for the sharp-eyed. At one point the stern of one of the most famous and important smaller combatant vessels of World War II is shown while Lemmon is instructing his crew. What ship is it?\n\n6/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0054453/"
}