{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mia Zottoli",
            "url": "/name/nm0583915/"
        },
        {
            "@type": "Person",
            "name": "Sasha Peralto",
            "url": "/name/nm1004827/"
        },
        {
            "@type": "Person",
            "name": "George Thomas",
            "url": "/name/nm0858869/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 608,
        "ratingValue": 3.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Person",
            "name": "Donald F. Glut",
            "url": "/name/nm0323304/"
        }
    ],
    "datePublished": "2003-08-01",
    "description": "3000 years ago an Egyptian sorceress was buried alive for indulging forbidden pleasures of the flesh. Reincarnated in modern-day Los Angeles she is on a mission to track down the reincarnation of her ancient lost love.",
    "director": [
        {
            "@type": "Person",
            "name": "Donald F. Glut",
            "url": "/name/nm0323304/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Fantasy",
        "Horror",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDE3MjBlYzMtZjQyYy00MDc3LTkzNDgtNWZhMmZlM2Q5YTJjXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "lesbian,mummy,female nudity,college student,sexploitation film",
    "name": "The Mummy's Kiss",
    "original_info": {
        "id": "The Kiss_2003",
        "name": "The Kiss",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Uriah43"
        },
        "dateCreated": "2022-10-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0347585/"
        },
        "name": "A Rather Boring Film Intended for Adult Audiences",
        "reviewBody": "This film essentially begins at a university where a college professor by the name of \"Carter Moore\" (George Thomas) and two of his female assistants named \"Ana Harwa\" (Sasha Peralta) and \"Tina Kim\" (Aysia Lee) are busy unpacking some crates full of ancient Egyptian artifacts. As it so happens, one particular crate contains the mummified body of an evil sorceress named \"Hor-Shep-Sut\" (Ava Niche) who was put to death for having a forbidden affair with the pharaoh's daughter \"Hat-Em-Akhet\" (also played by Sasha Peralta). Although the professor and his two assistants are quite eager to remove the mask of the mummy to see what she now looks like, just seconds before doing so, Ana suddenly becomes dizzy and faints. Needless to say, this puts a damper on their curiosity and, after reviving her, they all agree to hold off for the time-being. Unfortunately, after leaving, a guard by the name of \"Dick Walters\" (Stan Bennett) decides to look for himself and accidentally awakens the evil sorceress who now becomes determined to reunite with the soul of her long-lost love--and that soul now belongs to Ana Harwa. Now, rather than reveal any more, I will just say that I was not at all impressed with this film as it contained bad acting, an awful script and a completely ridiculous plot designed primarily for an adult audience. On that note, I will admit that there were several attractive actresses featured with Diana Espen (as \"Yvonne\"), Katie Lohmann (as \"Isis\") and the aforementioned Aysia Lee probably standing out the most, in my opinion. But even so, none of these young ladies were able to correct the problems mentioned earlier and I have rated this movie accordingly.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0347585/"
}