{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gary Cooper",
            "url": "/name/nm0000011/"
        },
        {
            "@type": "Person",
            "name": "Rita Hayworth",
            "url": "/name/nm0000028/"
        },
        {
            "@type": "Person",
            "name": "Van Heflin",
            "url": "/name/nm0001336/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2342,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0542021/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150389/"
        },
        {
            "@type": "Person",
            "name": "Ivan Moffat",
            "url": "/name/nm0595573/"
        },
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        },
        {
            "@type": "Person",
            "name": "Glendon Swarthout",
            "url": "/name/nm0841933/"
        }
    ],
    "datePublished": "1959-08-20",
    "description": "An army major, himself guilty of cowardice, is asked to recommend soldiers for the Congressional Medal of Honor during the Mexican Border Incursion of 1916.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Rossen",
            "url": "/name/nm0744035/"
        }
    ],
    "duration": "PT2H3M",
    "genre": [
        "Adventure",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDJiZTk1OTItNjU2Yi00MzEwLWExOTktYTBkZTA3MTRkMWQyXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "cowardice,mexican rurale,u.s. cavalry,violence,bandit",
    "name": "They Came to Cordura",
    "original_info": {
        "id": "They Came to Cordura_1959",
        "name": "They Came to Cordura",
        "year": "1959"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2009-04-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0053351/"
        },
        "name": "One act of bravery doesn't make a man brave for all his life.",
        "reviewBody": "On the night of March 18th, 1916, a large mounted force of Mexican rebels under Pancho Villa crossed the American border and attacked the town of Columbus, killing both civilians and soldiers. As a result of this action, the United States Army sent an expedition into Mexico with orders to capture Villa and disperse his forces. It was during this campaign that one man, a United States Army officer, was forced to come face to face with two of the great fundamental questions that affect mankind.\n\nWhat is courage? What is cowardice? This is the story of his search for an answer.\n\nThat summary is the opening text from this oddly {to me} divisive picture from Robert Rossen and Ivan Moffat. Divisive because there are conflicts about it's technical aspects, its length {which cut is original?}, it's talky nature, and if it's splendid cast did the material justice? Well the dispute about the technical aspects being poor certainly don't stand up to the version I saw of the picture, lovely widescreen CinemaScope with Burnett Guffey's photography astutely and rightly oppressive as the story unfolds. As for its length, the version I viewed was two hours long, is this a restored cut or is there still another half hour of Rossen footage lurking somewhere? Either way, the complaint about there being gaps in the film are not evident in this two hour cut. All characters are fully fleshed and every minute of this picture was engrossing and perpetually watchable. The cast are also on fine form, Gary Cooper is perfectly cast as Maj. Thomas Thorn, the man who's moment of weakness hangs heavy round his neck like a curse. Van Heflin, Rita Hayworth, Dick York, Richard Conte and Tab Hunter all help to make this a fine character driven piece.\n\nAbove all else it's the story that works the best, Thorn is carrying around a burden as he strives to take these heroes to safety and ensure they receive their medals of honour. But the perilous journey proves to alter each man's attributes, be it despicable or otherwise, something that to me personally makes this a thematically excellent picture, the kind we could do with more of in the modern era. It may well be cynical at times, but really that is no bad thing in my eyes, it's a cop out of sorts I know, but this film isn't for everyone. After a fine battle sequence has been and gone, the film shifts in tone and becomes a picture about the complexities of man and his own personal hang ups, the result of which left me very much rewarded. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An army major, himself guilty of cowardice, is asked to recommend soldiers for the Congressional Medal of Honor during the Mexican Border Incursion of 1916.",
        "duration": "PT2M41S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3172975385",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2FiODg2YTAtMjhmYi00MTAxLTlkNTItMWRlNWUwYTg5NGFjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2FiODg2YTAtMjhmYi00MTAxLTlkNTItMWRlNWUwYTg5NGFjXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-01-29T20:33:18.589Z",
        "url": "https://www.imdb.com/video/vi3172975385/"
    },
    "url": "/title/tt0053351/"
}