{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Roddy Piper",
            "url": "/name/nm0684929/"
        },
        {
            "@type": "Person",
            "name": "Keith David",
            "url": "/name/nm0202966/"
        },
        {
            "@type": "Person",
            "name": "Meg Foster",
            "url": "/name/nm0001236/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 134622,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035544/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0324578/"
        },
        {
            "@type": "Person",
            "name": "Ray Nelson",
            "url": "/name/nm0625688/"
        },
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        }
    ],
    "datePublished": "1988-11-04",
    "description": "They influence our decisions without us knowing it. They numb our senses without us feeling it. They control our lives without us realizing it. They live.",
    "director": [
        {
            "@type": "Person",
            "name": "John Carpenter",
            "url": "/name/nm0000118/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Action",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ3MjM3ODU1NV5BMl5BanBnXkFtZTgwMjU3NDU2MTE@._V1_.jpg",
    "keywords": "alien,sunglasses,anti consumerism,brainwashing,teleportation",
    "name": "They Live",
    "original_info": {
        "id": "They Live_1988",
        "name": "They Live",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hu675"
        },
        "dateCreated": "2005-09-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096256/"
        },
        "name": "One of the Coolest and Underrated Films of the Late 1980's.",
        "reviewBody": "John Nada (Roddy Piper) comes to L.A. to search for a Job. On the same working place, when he finds a job. John meets Frank (Keith David), Frank asks John to come along. Where Frank stays with poor people and a place to rest. Once he gets there, John watches television and sees some subliminal reporting by a scientist. The scientist is trying to get an important message on television by using frequency. John knows, there is something unusual going on at a house nearby. After a small band of cops are beating these poor people trying to find, where does that frequency is coming from. The next day, John goes to the house nearby and he finds one thing an open box. That box was hidden in the wall and when John open that box. He finds nothing but sunglasses. When he takes one of them, John sees a whole different world. A Bizarre look of L.A. in black & white with images full of subliminal advertising messages are visible though special glasses. Then he notice the only purpose of these glasses are the civilians are mixed with aliens population amongst them! \n\nDirected by John Carpenter (Assault on Precient 13, Ghosts of Mars, The Thing-1982) made a extremely well made film mixed with action/sci-fi elements and a refreshing scene of humor. Piper is good here, he has some memorable scenes with some funny dialogue. The film's best line from Piper is \"I come here to chew bubble gum and kick ass but i'm all out of bubble gum\". There is also an unforgettable scene with Piper and David, when Piper asks David to put the glasses on. When David refuses to put them on. Piper and David get into a very funny fistfight scene that turned into a classic scene. The film might have a few flaws, only depending a matter of personal taste. The Alien Make-Up effects are extremely awful but intentionally funny. The film ends with a great pay-off. The film is hilarious at times and always fun to watch. Since this film like most Carpenter's works become a Cult Classic.\n\nDVD has an sharp anamorphic Widescreen (2.35:1) transfer and an good-Dolby Surround 2.0 Sound. Too Bad, Universal didn't release a Special Edition of this landmark independent film. The DVD from Europe, Carpenter and Piper recorded an running commentary track for this film in a two disc special edition. When in the U.S. get out Special Edition ? DVD doesn't have no features. This is a amusing satiric sci-fi adventure. Underrated to be sure, the film ages well despite awful alien make-up. Based on a Short Story by Ray Faraday Nelson titled \"Three O'Clock in the Morning\". Screenwriter \"Frank Armitage\" is actually director Carpenter. Panavision. (****/*****).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "In October 2018, several filmmakers were added to the Oxford English Dictionary in adjective form. Somehow, John Carpenter wasn't one of them. Today, we'll travel \"Through the Lens\" to define John Carpenter's style and influence, to define Carpenteresque, and why the term belongs in the dictionary.",
        "duration": "PT4M54S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2711468569",
        "name": "Through the Lens: Defining Carpenteresque and Why It Belongs in the Dictionary",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTA3MzhkNjItZjdhMC00ZWZmLTliM2YtMDA4ZTI5ODM1ZmJkXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTA3MzhkNjItZjdhMC00ZWZmLTliM2YtMDA4ZTI5ODM1ZmJkXkEyXkFqcGdeQWFsZWxvZw@@._V1_.jpg",
        "uploadDate": "2018-10-19T18:21:06.782Z",
        "url": "https://www.imdb.com/video/vi2711468569/"
    },
    "url": "/title/tt0096256/"
}