{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Laura Regan",
            "url": "/name/nm0716438/"
        },
        {
            "@type": "Person",
            "name": "Marc Blucas",
            "url": "/name/nm0089456/"
        },
        {
            "@type": "Person",
            "name": "Ethan Embry",
            "url": "/name/nm0256121/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13230,
        "ratingValue": 4.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042399/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023815/"
        },
        {
            "@type": "Person",
            "name": "Brendan Hood",
            "url": "/name/nm0393445/"
        }
    ],
    "datePublished": "2002-11-27",
    "description": "A psychology student finds all her childhood fears and phobias becoming real after a traumatic event.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Harmon",
            "url": "/name/nm0363553/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTk4YjVlNjUtMTFhZC00YmUxLWFhZDktODE0OWIzMmNiYzY3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "psychiatric hospital,supernatural horror,child in jeopardy,female rear nudity,female frontal nudity",
    "name": "They",
    "original_info": {
        "id": "They_2002",
        "name": "They",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Li-1"
        },
        "dateCreated": "2004-12-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283632/"
        },
        "name": "A surprisingly solid genre picture that delivers first-rate atmosphere and scares.",
        "reviewBody": "Rating: *** out of ****\n\nIn this era of modern horror, it's really the little films that come through and surprise me the most, so I'm glad to include They among this recent bunch (which also includes the terrifically frightening Dead End and the surprisingly funny Monster Man). I must admit to having relatively low expectations; the film was promoted with the heading \"Wes Craven presents\" and the film's director, Robert Harmon, hasn't done anything worth mentioning in years.\n\nBut the movie works, and if it's not particularly original or outstanding, it's at least very well made and makes smart decisions (i.e. a more atmospheric, quietly creepy approach) that lesser films would have avoided. In fact, the movie is so low-key I'm surprised it wasn't just given a straight-to-video release, as nothing in this picture screams box office success the way a noisy, thrill ride approach that Darkness Falls employed might.\n\nThey stars the very cute Laura Regan (sporting an adorable haircut!) as Julia Lund, a psychology grad student who's contacted by an old friend of hers. They reunite in a coffee shop, with the friend mentioning some half-comprehensible blather about \"they,\" then kills himself right before her eyes. At his funeral, Julia meets a couple of his more recent friends (played by Ethan Embry and Dagmara Dominczyk), and upon a few conversations, discover they all have something in common. They've experienced night terrors as kids and believe something in the dark that once branded them as children is now back to collect.\n\nEven running at a scant ninety minutes, it could be debated They still runs too long. The subplot with Embry and Dominczyk doesn't really go anywhere and only provides the opportunity for two lengthy sequences where we know these two are going to meet a particularly horrifying fate. Had these two scenes been less effective, I might have complained, but these setpieces are directed with the right amount of build-up, tension, and atmosphere, making the pay-off worth it. And at least those two aren't as fundamentally useless as Marc Blucas, who plays Julia's disbelieving boyfriend. It's a cliché role and nothing about him stands out in the slightest (see The Grudge for a very similar role). \n\nAs the lead, Laura Regan proves a very competent performer who's sympathetic and likable. The little discoveries she makes are creepy and intriguingly enthralling. There's hints of an alternate \"universe\" these creatures live in and the brief views we get of this world are among the film's most visually engrossing moments. \n\nThe monsters themselves are mostly kept out of plain sight, kept hidden in shadows and darkness so that what little we can see only enhances the scares. The sounds they make also build a nice sense of unease, a trilling noise that gives the creatures an otherwordly feel to them, not unlike the mysterious creatures in Signs.\n\nThe film is mostly a collection of effectively frightening setpieces. Most of the concepts the movie introduces are left both satisfyingly and frustratingly unresolved; there's just enough to fascinate, but maybe just a few more answers or theories would have been appreciated. They comes to an abrupt end, but that works in favor of the movie, finishing things off on a startlingly high note."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A psychology student finds all her childhood fears and phobias becoming real after a traumatic event.",
        "duration": "PT2M20S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1989657369",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWY0N2JiN2UtYTIyNC00ZWI2LWI3MjktMGQ0MjI0ODg3MDEzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWY0N2JiN2UtYTIyNC00ZWI2LWI3MjktMGQ0MjI0ODg3MDEzXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-07T23:33:58.297Z",
        "url": "https://www.imdb.com/video/vi1989657369/"
    },
    "url": "/title/tt0283632/"
}