{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Toni Attell",
            "url": "/name/nm0040997/"
        },
        {
            "@type": "Person",
            "name": "Mike Bacarella",
            "url": "/name/nm0045219/"
        },
        {
            "@type": "Person",
            "name": "Billy Beck",
            "url": "/name/nm0065084/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3557,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0144626/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Cheech Marin",
            "url": "/name/nm0001507/"
        },
        {
            "@type": "Person",
            "name": "Tommy Chong",
            "url": "/name/nm0001045/"
        }
    ],
    "datePublished": "1982-08-04",
    "description": "Cheech and Chong are hired to drive a limo from Chicago to Las Vegas by two shady Arabs--Mr. Slyman (Cheech) and Prince Habib (Chong). Unbeknownst to them, five million dollars of dirty money has been stuffed throughout the car.",
    "director": [
        {
            "@type": "Person",
            "name": "Thomas K. Avildsen",
            "url": "/name/nm0043169/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmQyZGYwNmEtNjdmNC00ODE2LWJiNGMtYjdhNzQyZDAxOTQ1XkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_.jpg",
    "keywords": "adult humor,female nudity,arabic stereotype,french girl,vandalizing a car",
    "name": "Things Are Tough All Over",
    "original_info": {
        "id": "Things Are Tough All Over_1982",
        "name": "Things Are Tough All Over",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2010-03-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0084788/"
        },
        "name": "Drying out in the desert.",
        "reviewBody": "The comic-doped up duo Cheech and Chong were on a bit of a high within the late 70s through to early eighties with \"Things Are Tough All Over\" being their fourth feature film as their infamous brand of humour (simply low-brow with sexual and drug references --- although the usage of drugs was rather minor for a Cheech and Chong outing) had a real shine on cult audiences. After this particular entry, I didn't really care/or like what came afterwards. A change was in the air (especially after the much flipped stoner comedy \"Nice Dreams\") and you could see it coming, as it kind of started on this ambitious effort.\n\nCheech and Chong are now living it up in the freezing winter of Chicago, but have trouble keeping a job. That's until their old Arabian bosses Prince Habib and Mr. Slyman re-hire them to drive a custom made limousine to Las Vegas, while unknowingly to them it contains five million dollars.\n\nAnyhow \"Things Are Tough All Over\" was one of their better made and better looking productions, as it didn't entirely focus on the drug scene (usual pot smoking and drug abuse) --- but girls, music (rock 'n' roll!) and road-trip mayhem takes control. The mellow plot has a coordinated structure than being aimlessly linked together by loose set-pieces and running gags, but still its made more memorable by the perfect combination and carefree performances of Tommy Chong and Cheech Marin with their snappy wisecracks (taken from their trivial, but solidly written script) never takes a break and well timed gags in many accidental situations on their wacky journey. Visually or lyrically they were spot on and politically incorrect with their slant. Chong and Marin also get geared in make-up to portray a couple of wealthy, but bumbling Arabs. Marin was quite entertaining as the dim-witted Mr. Slyman with uncontrollable violent tendencies . Rip Taylor shows-up in a short role and looks like his enjoying it. Also the likes of character actor John Steadman and the lovely Evelyn Guerrero joins in with the fun. Plus their wife's (Rikki Marin and Shelby Chong) were truly hard to forget in their flirtatious roles.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0084788/"
}