{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Glenn Close",
            "url": "/name/nm0000335/"
        },
        {
            "@type": "Person",
            "name": "Cameron Diaz",
            "url": "/name/nm0000139/"
        },
        {
            "@type": "Person",
            "name": "Calista Flockhart",
            "url": "/name/nm0001222/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7180,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043393/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006702/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0025264/"
        },
        {
            "@type": "Person",
            "name": "Rodrigo García",
            "url": "/name/nm0006554/"
        }
    ],
    "datePublished": "2000-10-04",
    "description": "Five California women struggle with personal problems as their own paths unwind in unexpected ways.",
    "director": [
        {
            "@type": "Person",
            "name": "Rodrigo García",
            "url": "/name/nm0006554/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEwNjE4OTE4N15BMl5BanBnXkFtZTcwMzEzNjAyMQ@@._V1_.jpg",
    "keywords": "boxer shorts,f rated,female rear nudity,lesbian,little person",
    "name": "Things You Can Tell Just by Looking at Her",
    "original_info": {
        "id": "Things You Can Tell Just By Looking at Her_2000",
        "name": "Things You Can Tell Just By Looking at Her",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "danielll_rs"
        },
        "dateCreated": "2001-08-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0210358/"
        },
        "name": "Touching and funny- the perfect fit to talk about women and how time is mean to them",
        "reviewBody": "Some questions remain without a plausible answer: why did THINGS YOU CAN TELL JUST BY LOOKING AT HER go direct to cable TV in the US? I don't know and I'm still angry about that, since it has a great cast and was very well received in Cannes. Fortunately, it was received a limited release here in Brazil, where it was a kind of art-house hit during the time of the year when only blockbusters have their place in the sun. The secret of its success here is not hard to understand: audiences who were tired of Hollywood crap found a small, quiet dramatic comedy with a good story, some heart-breaking moments (and some very funny ones, too) and terrific performances. This is the kind of film that touches everyone, even the coldest and most serious person, making them laugh and feel deep emotions. Despite its division in five stories, all of them excellent (except the part with the lesbian, which was too small), this film is carefully paced, helping us to understand each character's emotions. And each story has an interesting link to the other.\n\nIf I had to choose my favorite part, I would have to think. The Dr. Keener story is sad and quiet, the one with Rebecca is the most thought-provoking, while the dwarf story is touching and funny, and the sister-sister story brilliantly closes the film.\n\nIf you haven't seen this yet, watch it now. There are not many good films with \"women\" as the main subject, but this one is one of the best I've seen. It has an eye for detail, it makes us think with its reflection about what women are nowadays (I loved Cameron Diaz guessing about what made her sister's friend committing suicide). And there are great actresses which seem to fit the role perfectly: Glenn Close, Cameron Diaz, Amy Brennemann, Kathy Baker, Holly Hunter, Calista Flockhart and Valeria Golino. I hope Rodrigo Garcia, son of famed writer Gabriel Garcia Marquez, makes other great films like this.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from MGM",
        "duration": "PT2M22S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2124743961",
        "name": "Things You Can Tell Just By Looking At Her",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGUyYzg1YTMtN2U4My00YjA2LTg3YTgtMjRiOTk0OWYzOThjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGUyYzg1YTMtN2U4My00YjA2LTg3YTgtMjRiOTk0OWYzOThjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T06:33:03Z",
        "url": "https://www.imdb.com/video/vi2124743961/"
    },
    "url": "/title/tt0210358/"
}