{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michel Duchaussoy",
            "url": "/name/nm0239816/"
        },
        {
            "@type": "Person",
            "name": "Caroline Cellier",
            "url": "/name/nm0148142/"
        },
        {
            "@type": "Person",
            "name": "Jean Yanne",
            "url": "/name/nm0946179/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4636,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "alternateName": "This Man Must Die",
    "contentRating": "GP",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0031992/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062467/"
        },
        {
            "@type": "Person",
            "name": "Paul Gégauff",
            "url": "/name/nm0337541/"
        },
        {
            "@type": "Person",
            "name": "Claude Chabrol",
            "url": "/name/nm0001031/"
        },
        {
            "@type": "Person",
            "name": "Cecil Day-Lewis",
            "url": "/name/nm0086671/"
        }
    ],
    "datePublished": "1970-10-20",
    "description": "A man asserts himself within the life of an actress he believes is somehow responsible for his son's death.",
    "director": [
        {
            "@type": "Person",
            "name": "Claude Chabrol",
            "url": "/name/nm0001031/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmUwNTZhZWMtZTIzOS00OGY0LWE4ZWYtZTY0NjVmMzBhZTE5XkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_.jpg",
    "keywords": "reference to alain robbe grillet,reference to homer's iliad,reference to homer,driver,actress",
    "name": "Que la bête meure",
    "original_info": {
        "id": "This Man Must Die_1969",
        "name": "This Man Must Die",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "claudio_carvalho"
        },
        "dateCreated": "2011-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064861/"
        },
        "name": "The House of Hatred and Revenge",
        "reviewBody": "A car runs over the boy Michel Thenier while he is crossing the street in his calm village in Bretane, and the hit and run driver flees without any witness. His grieving father Charles Thenier (Michel Duchaussoy) becomes obsessed to find the reckless driver that murdered his only son to kill him and spends his time writing his diary and running his own investigation in garages and junkyards. One day, he learns by chance that the actress Helene Lanson (Caroline Cellier) might be the responsible for the death of Michel. Charles travels to Paris posing as screenplay writer, introduces himself using his pseudonym of Marc Andrieux and seduces Helene with the intention of killing her. However, Helene tells that her family is from Brittany and her brother-in-law Paul Decourt (Jean Yanne) owns a garage in Quimper. When Helene invites Charles to travel to her sister's house to know her family, Charles finds that Paul is a despicable man with a disease in the intestine, hated by his family and his own son Phillippe Decourt (Marc Di Napoli) wants to kill him. \n\n\"Que la Bête Meure\" a.k.a. \"This Man Must Die\" is an ambiguous story of hatred and revenge with an open conclusion where it is not clear who really killed the detestable Paul Decourt. The odyssey of Charles to find the killer proves that he is a manipulative and Machiavellian man; therefore it is impossible to conclude what is his final destination. One point that intrigues me and may be a clue to the truth is when Paul calls Marc by Charles, when they are preparing to sail. Neither Claude Chabrol nor Charles Thenier would be capable to commit such mistake and then in the boat Charles tells to Paul that the entertaining is just beginning. This sequence corroborates with the deduction of the detective and associated to the profile of Charles that should be incapable to neglect his journal may indicate that Phillippe is really innocent, but I can not assure that my interpretation is correct. My vote is eight.\n\nTitle (Brazil): Not Available",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0064861/"
}