{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Gwyneth Paltrow",
            "url": "/name/nm0000569/"
        },
        {
            "@type": "Person",
            "name": "Sam Waterston",
            "url": "/name/nm0001832/"
        },
        {
            "@type": "Person",
            "name": "Ossie Davis",
            "url": "/name/nm0001115/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 759,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028500/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023559/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0083965/"
        }
    ],
    "description": "A biographical film about The United States' influential and profoundly enigmatic Founding Father.",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3NjkwNTQ3OV5BMl5BanBnXkFtZTYwMzQ1ODI5._V1_.jpg",
    "keywords": "slavery,character name as series title,two word series title,thomas jefferson character,american history",
    "name": "Thomas Jefferson",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pmcguireumc"
        },
        "dateCreated": "2011-05-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118489/"
        },
        "name": "by the way - did you know he owned slaves?",
        "reviewBody": "Any movie that features George Will in the first 10 minutes is worth watching, in my opinion. Will, like Jefferson, is a great, multifaceted thinker. Oh, by the way, did you know Jefferson owned slaves. This is, like all of Ken Burn's films, a wonderful collection of diary readings, oil paintings, heart felt music, warm narration, and thought provoking. Oh, by the way, did you know Jefferson owned slaves. As a huge fan of our nation's first and greatest thinker, I was very hopeful about this film, especially when I saw that Ken Burns produced it. However, the modern political correctness constantly invoked when it comes to the issue of slavery is incredibly distracting. There were almost 25 references to Jefferson's owning slaves in the first 28 minutes. Oh, by the way, did you know Jefferson owned slaves. As long as you can tolerate the repeated onslaught of political correctness (not that this is unexpected from PBS), you will be interested in this documentary.\n\nMy criticism of course, is the ridiculous interpretation of the past through modern sensibilities. The cost of this however, is a minimal study of America's most enigmatic and great thinker. Oh, by the way, did you know Jefferson owned slaves.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0118489/"
}