{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Lara Flynn Boyle",
            "url": "/name/nm0001223/"
        },
        {
            "@type": "Person",
            "name": "Josh Charles",
            "url": "/name/nm0001038/"
        },
        {
            "@type": "Person",
            "name": "Stephen Baldwin",
            "url": "/name/nm0000286/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13354,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071430/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005883/"
        },
        {
            "@type": "Person",
            "name": "Andrew Fleming",
            "url": "/name/nm0281598/"
        }
    ],
    "datePublished": "1994-04-08",
    "description": "A girl named Alex is by mistake housed with 2 guys, Stuart and Eddy, in a college dorm suite. After initial problems they become friends. Stuart has the hots for Alex, Alex for Eddy and Eddy for Stuart. Can it work?",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Fleming",
            "url": "/name/nm0281598/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2E1MjU5ZmUtYzJkMC00NDM2LTk1MjctMGY3ZGU4ZGNkNWFiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "menage a trois,kissing breasts,sex scene,dormitory,nude sunbathing",
    "name": "Threesome",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "DrLetoPicard"
        },
        "dateCreated": "2001-09-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111418/"
        },
        "name": "A very well-scripted and enjoyable film.",
        "reviewBody": "This film happened to come on on the late show on one of the local channels, and I ended up watching it. I was expecting a rather cheesy film in which we see all the predictable sexual quandries you might expect out of a comedy like this. I wasn't entirely wrong, but I was rather pleasantly surprised, as well.\n\nEddy (Josh Charles) is \"sexually ambiguous\" - ie. homosexual, as he eventually admits, although he is a virgin and not entirely sure. Alex (Lara Flynn Boyle) has a huge crush on him. And his somewhat misogynistic and lustful roommate, Stuart (Stephen Baldwin) lusts after Alex, while Eddy lusts after him. They make a vow to be just friends. Of course, this all backfires.\n\nWhat pleasantly surprised me was the conclusion to the film, and the tender and delicate nature with which they handled the sexual issues that cropped up. It was also extremely funny at times, especially when the dorm supervisors (Alexis Arquette, Martha Gehman) start spying on the three of them and wondering what the hell is going on.\n\nThe directing is standard for a film of this nature - essentially a romantic comedy with a twist. The lead roles were all extremely well played, especially Josh Charles as the narrator and most crucial role of the film. The sex in the film was erotic when it needed to be, tender when it needed to be, and animalistic when it needed to be, and never overwhelming or out of context.\n\nIt also was one of the most realistic and intelligent commentaries I've ever seen on the reality of college life - at least, undergraduate life. How I've experienced it, at any rate. The dialogue, so crucial to a film like this, is extremely appropriate and well-done, and the actors deliver it with perfection. It's a film that is almost entirely about dialogue - despite the sexual nature of the film, there's little nudity and certainly never anything that could be considered gratuitous. It's not the greatest film I've seen, but it's among the most well-written films I've seen in the past few years.\n\nA pleasant and amusing film. I was surprised by how much I enjoyed it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1610023193",
        "name": "Threesome",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWMxMjM5NmUtYTVlMi00Y2ZiLTlhMjQtNmU4OWI2YjJmYzY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWMxMjM5NmUtYTVlMi00Y2ZiLTlhMjQtNmU4OWI2YjJmYzY2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:58:48Z",
        "url": "https://www.imdb.com/video/vi1610023193/"
    },
    "url": "/title/tt0111418/"
}