{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Grayson McCouch",
            "url": "/name/nm0566651/"
        },
        {
            "@type": "Person",
            "name": "Adrian Paul",
            "url": "/name/nm0001600/"
        },
        {
            "@type": "Person",
            "name": "Amy Locane",
            "url": "/name/nm0000504/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1053,
        "ratingValue": 5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0119432/"
        },
        {
            "@type": "Person",
            "name": "Neil Elman",
            "url": "/name/nm1140089/"
        },
        {
            "@type": "Person",
            "name": "James Seale",
            "url": "/name/nm0780530/"
        }
    ],
    "datePublished": "2005-08-02",
    "description": "Every day, millions of people descend into underground parking garages, get into their cars and drive to the safety of their homes. But tonight, five levels down in a deserted corporate parking structure, financial analyst Tom Wea...",
    "director": [
        {
            "@type": "Person",
            "name": "James Seale",
            "url": "/name/nm0780530/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Action",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjIyMTgyNjczNV5BMl5BanBnXkFtZTgwNTUzOTkwMzE@._V1_.jpg",
    "keywords": "underground,parking garage",
    "name": "Throttle",
    "original_info": {
        "id": "Throttle_2005",
        "name": "Throttle",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JoeytheBrit"
        },
        "dateCreated": "2006-02-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0398033/"
        },
        "name": "Underground Duel",
        "reviewBody": "This is one of those movies that presents itself as a kind of homage to an earlier classic while really just amounting to little more than a rehash of the original's central theme. As you watch you can almost imagine the full extent of the writer's thought processes: I'll make Duel. In an underground car park.\n\nAnd that's it.\n\nThe references to Spielberg's early 70s TV flick are too blatant to be missed - at one point a Dennis Weaver lookalike casts a baleful glance in our hero's direction as he drives past in a red car identical to the one Weaver drove in Duel, and the main character's name is also Weaver. He's a good guy who has flirted with badness in the form of a $10 million business scam with his crooked boss before pulling out at the last minute. Our hero is lantern-jawed and handsome in that bland and plastic style beloved of daytime soap TV producers, and possesses all the initiative of a paper cup.\n\nThe movie presents us with an array of possible culprits as we watch Weaver being chased for reasons unknown around the car park by a huge truck with a bank of floodlights mounted on its cabin roof : could it be the new security guard with the attitude? The (possibly) cheating wife? The friendly security guard? The slimy boss? The jealous would-be lover? All that is certain is that, whoever it is, their reasons will in no way justify the laborious manner in which they pursue their quarry. The truck's driver seems to alternate between wanting to mash the hapless Weaver into the tarmac and merely toying with him for no good reason. And the engine of their vehicle has some kind of silent mode which means its victims (and the viewer)never hear it approaching until escape from its path is impossible.\n\nThe acting ranges from barely adequate to mind-blowingly awful, and the attempts at mystery and tension are woefully poor. The dialogue is also incredibly dull. Give this one a miss."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT1M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1442251033",
        "name": "Throttle",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWIxOWQ4OTEtMTcxMi00OGNiLTk3MzEtODI2YmRhYzQ3ZjM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWIxOWQ4OTEtMTcxMi00OGNiLTk3MzEtODI2YmRhYzQ3ZjM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:58:52Z",
        "url": "https://www.imdb.com/video/vi1442251033/"
    },
    "url": "/title/tt0398033/"
}