{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvia Anderson",
            "url": "/name/nm0027487/"
        },
        {
            "@type": "Person",
            "name": "Ray Barrett",
            "url": "/name/nm0057254/"
        },
        {
            "@type": "Person",
            "name": "Alexander Davion",
            "url": "/name/nm0204095/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2486,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103353/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0019951/"
        },
        {
            "@type": "Person",
            "name": "Gerry Anderson",
            "url": "/name/nm0026755/"
        },
        {
            "@type": "Person",
            "name": "Sylvia Anderson",
            "url": "/name/nm0027487/"
        }
    ],
    "datePublished": "1966-12-12",
    "description": "When the launch of a mission to Mars goes awry due to sabotage, International Rescue is requested to assist in the mission's second attempt.",
    "director": [
        {
            "@type": "Person",
            "name": "David Lane",
            "url": "/name/nm0485298/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDI5NTI1MzMxOF5BMl5BanBnXkFtZTcwNTUyMTM4NA@@._V1_.jpg",
    "keywords": "marionette,supermarionation,three word title,alan tracy character,transport aircraft",
    "name": "Thunderbirds Are GO",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-07-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061094/"
        },
        "name": "The awful writing means that the potential is wasted and it is no more than a 25-minute story excruciatingly padded out to 90",
        "reviewBody": "The space race continues with the first manned mission to Mars in the shape of the Zero-X. However things are put back when the Zero-X is sabotaged during take-off and crashes. Two years later the team are ready to try again but fears over security give them pause. With the Thunderbird team on standby, the mission goes ahead but can the Tracey family help make the perilous mission a success.\n\nWith the live-action remake hitting the cinemas, I decided to avoid the kids in the cinema by watching this original feature instead. Those complaining about how the remake is not any good because of the fact that Anderson was not hands-on involved should perhaps check this out as it is proof that a feature-length version of the series was not any easier for the creator himself! I sat to this just content to see those great ships used well in a reasonable story but, I'm sad to say, that I didn't even get that. The film leaves it for about 20 minutes before the Thunderbirds even get involved and then they only really do anything of merit in the final 10 minutes. In terms of actual good content, I reckon you could have got an episode out of this easily enough but no more than that  and that's the problem. The plot is padded at the start with a very slow take off of Zero-X, in the middle with a terrible dream sequence and towards the end with a laughable mission on Mars!\n\nThe Andersons' are entirely to blame because they wrote the script themselves and produced a padding piece of nonsense that lacks any sense of excitement, pace or, god help us, fun! The dream sequence is a good example  a silly, overlong section that only pads the film and exposes us to Cliff Richard and the Shadows; however the actual mission to Mars is equally as bad with aliens being settled on for the reason a rescue is needed at the end (however the aspect of flame-throwing aliens on Mars is not even mentioned after this scene!). This is the film's great failing, it just cannot sustain the running time at all and most of the time it is very apparent padding that only frustrates  personally I think anyone else could have come up with a better plot for the film that would have seen more rescues and use of the Thunderbird ships. It is annoying because, as a child, I used to watch the show and I think the ships and the models were all cool however they were all very poorly used and most of the screen time seemed to be given over to the anonymous crew of the Zero-X and Lady Penelope.\n\nThe cast do reasonable voice work but never manage to bring emotion to their delivery  something that could really have helped the poor story get a bit of tension into it. Although the song is awful, it is at least momentarily amusing to see puppets of Cliff Richard and the Shadows but, let me stress, it's only momentarily amusing. The only other voice of note is that of the late Bob Monkhouse, but he has little to do and it's one you have to listen for to catch it.\n\nOverall, even fans of the series will feel let down by this film. It is full of ineffective padding and essentially relegates the all-action thunderbirds into third place in their own movie! The writing is awful and will send fans rushing back to their boxsets and will leave the rest of the viewers reaching for the remote control. A very poor film in the place of what should have been a cool, breezy and fun big screen outing for fans."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from MGM",
        "duration": "PT1M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1923417369",
        "name": "Thunderbirds Are Go / Thunderbirds Six: International Rescue Edition",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDM3ZGEwY2QtMDRmMS00YWM0LTk0MDUtZDNlYjJkMDMyMDE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDM3ZGEwY2QtMDRmMS00YWM0LTk0MDUtZDNlYjJkMDMyMDE1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T06:34:05Z",
        "url": "https://www.imdb.com/video/vi1923417369/"
    },
    "url": "/title/tt0061094/"
}