{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Victoria Abril",
            "url": "/name/nm0000721/"
        },
        {
            "@type": "Person",
            "name": "Antonio Banderas",
            "url": "/name/nm0000104/"
        },
        {
            "@type": "Person",
            "name": "Loles León",
            "url": "/name/nm0508249/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 30393,
        "ratingValue": 7,
        "worstRating": 1
    },
    "alternateName": "Tie Me Up! Tie Me Down!",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0006440/"
        },
        {
            "@type": "Person",
            "name": "Pedro Almodóvar",
            "url": "/name/nm0000264/"
        }
    ],
    "datePublished": "1990-01-22",
    "description": "An unbalanced but alluring former mental patient takes a porn star prisoner in the hopes of convincing her to marry him.",
    "director": [
        {
            "@type": "Person",
            "name": "Pedro Almodóvar",
            "url": "/name/nm0000264/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjExMDM0OTItY2E1YS00N2Y4LWFlNGMtOTgyNmFlMjIyOTgxXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "handcuffs,masturbation with a toy,tape over mouth,porn star,tied up while barefoot",
    "name": "Átame!",
    "original_info": {
        "id": "Tie Me Up! Tie Me Down!_1990",
        "name": "Tie Me Up! Tie Me Down!",
        "year": "1990"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2017-10-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0101026/"
        },
        "name": "Crazy for you",
        "reviewBody": "Pedro Almodovar's \"Tie Me Up! Tie Me Down!\" from 1989 is an earlier film from this quirky director. Almodovar's characters are inevitably off the wall and in bizarre situations. This film and its characters are no exception.\n\n\"Tie Me Up!\" was given an X rating (later NC-17) for a couple of scenes and in the United States at least, it was quite controversial.\n\nThe story concerns a recently-released mental hospital patient, Ricky (Antonio Banderas) who kidnaps an ex-porn star, Marina (Victoria Abril) currently making a low-budget horror film. Though the title suggests S&M, there isn't any. Ricky ties her up when he needs to leave the apartment.\n\nAn expert in carpentry, locksmithing, and other usable occupations, Ricky had actually been leaving the mental hospital when he felt like it and then returning. During one of those times, he had a one-night stand with Marina. \n\nDeeply in love with her, he stalks her on the film set and, when she doesn't speak to him, confronts her in her apartment, declaring his love and his intention of marrying her and fathering her children. Marina, of course, would like to escape him, but Ricky makes that difficult. A former heroin addict, Marina has a toothache and explains that nothing will help except strong medicine from her doctor up the street. So Ricky handcuffs her to him and they walk to the doctor's apartment, where Marina receives an injection and a prescription. \n\nLater, when she needs more drugs, Ricky goes to the town square to score some and ends up beaten to a pulp. When he returns, Marina is horrified and begins to have real feelings for him. \n\nMeanwhile, her sister Lola (Loles Leon) is worried, believing Marina to have disappeared.\n\nThere is a very long sex scene in this film that took 9 hours to film, with Almodovar using the last take.\n\n\"Tie Me Up!\" launched Banderas in the United States, and this is his last film with Almodovar. He plays Ricky beautifully - as an innocent from a troubled background who will do anything to convince this woman to love him. Abril is a sexy and feisty Marina, and, like Ricky, she is a lost soul trying to find her way. Ricky is an orphan; Abril has a mother, sister, and nephew, but both of them are alone in their worlds.\n\nDespite the title and the sex, this is actually a sweet tale with likable characters. Almodovar often has a bizarre way of telling a story and making a point, but the results, with few exceptions, are well worth it.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi656194585",
        "name": "Tráiler [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDc2NmZmYWMtYWJiYS00YmUxLWI4ZTAtYTc1NWI3YjcxYzY1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDc2NmZmYWMtYWJiYS00YmUxLWI4ZTAtYTc1NWI3YjcxYzY1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-07-10T14:23:06.245Z",
        "url": "https://www.imdb.com/video/vi656194585/"
    },
    "url": "/title/tt0101026/"
}