{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Colin Farrell",
            "url": "/name/nm0268199/"
        },
        {
            "@type": "Person",
            "name": "Matthew Davis",
            "url": "/name/nm0205127/"
        },
        {
            "@type": "Person",
            "name": "Clifton Collins Jr.",
            "url": "/name/nm0004286/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 42046,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0045494/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017013/"
        },
        {
            "@type": "Person",
            "name": "Ross Klavan",
            "url": "/name/nm0458462/"
        },
        {
            "@type": "Person",
            "name": "Michael McGruther",
            "url": "/name/nm0570077/"
        }
    ],
    "datePublished": "2001-05-24",
    "description": "A group of recruits go through Advanced Infantry Training at Fort Polk, Louisiana's infamous Tigerland, last stop before Vietnam for tens of thousands of young men in 1971.",
    "director": [
        {
            "@type": "Person",
            "name": "Joel Schumacher",
            "url": "/name/nm0001708/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzRlZDEwYmItYjMwMC00NjliLWJlN2YtZmNkYjYxNjU4M2QxXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "keywords": "year 1971,female rear nudity,platoon,recruit,sergeant",
    "name": "Tigerland",
    "original_info": {
        "id": "Tigerland_2000",
        "name": "Tigerland",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2010-05-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0170691/"
        },
        "name": "It Was Always Muddy",
        "reviewBody": "It is certainly interesting to write a review about a film that took place where I actually resided for two months. In September of 1971 when this film is set, your's truly was doing his basic training at Fort Polk, Louisiana. I did get to the North Fort at one point in my training where the infamous Tigerland was located. In fact Tigerland was a nickname given to the whole northern part of the army base.\n\nI was doing the basic training to be a weekend warrior and avoid Vietnam. But I saw so many of the kids who were just like the ones portrayed in the film it was actually a rather nerve wrecking old home week. In 1971 everyone except the policy makers in Washington knew that this was going to end when as Senator George Aiken declared, we said we won and then went home. And of course the South Vietnamese government we were protecting would fold like a napkin.\n\nBy that time the army was scraping the bottom for soldier material and you can see it in the company of men that are in Tigerland. This is where more soldiers shipped for Vietnam than any other place in the nation. The Louisiana swamps best approximated the climate conditions of Vietnam.\n\nThis particular company has a real odd ball in it with Colin Farrell. He's doing his best to get out of the army, but the army just won't oblige him. So he's waging his own war against them by becoming a 'barracks lawyer' and getting others out. And he's driving the officers and NCOs quite nuts doing it.\n\nI would rate Tigerland a lot higher because there is much I liked about the film. It was not shot at Fort Polk, but in places that gave you feel of the place. What I remember best about it was rain and mud. In that summer of 1971 it rained nearly every single day I was there. But the rain and sometimes it would come a few times a day. Would be a sudden downpour, maybe at most 20 minutes then it would cool off and then resume being muggy. And the ground couldn't absorb it fast enough so it was always muddy. You did your best work in that brief period after rain stopped it was then actually decent enough for normal activities.\n\nWhat I couldn't quite grasp was Colin Farrell's motivations for what he was doing. I blame that on the writer and also the director.\n\nAs for the other players the best in the cast was Thomas Guiry playing this poor sad sack kid from the Louisiana bayous. I met a few just like him, he stopped his formal education at the 6th grade. It was a touching performance on Guiry's part.\n\nSo here's to Fort Polk, not a place I recommend, but sometimes a place which is needed to train our soldiers. It got a good film, but not a great one in its honor.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1643577625",
        "name": "Tigerland",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjgyZTYyY2MtYWE1ZC00MjFjLWI0ZjEtM2YwOGZiMjcxNjcyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjgyZTYyY2MtYWE1ZC00MjFjLWI0ZjEtM2YwOGZiMjcxNjcyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:59:23Z",
        "url": "https://www.imdb.com/video/vi1643577625/"
    },
    "url": "/title/tt0170691/"
}