{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Maryam d'Abo",
            "url": "/name/nm0001881/"
        },
        {
            "@type": "Person",
            "name": "Arye Gross",
            "url": "/name/nm0343325/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Meek",
            "url": "/name/nm0576088/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 498,
        "ratingValue": 3.1,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060876/"
        },
        {
            "@type": "Person",
            "name": "Joseph John Barmettler",
            "url": "/name/nm0055316/"
        },
        {
            "@type": "Person",
            "name": "J. Reifel",
            "url": "/name/nm0000094/"
        }
    ],
    "description": "It's the 23rd century, and the world's most dangerous criminal has taken over the maximum security prison on asterod Alpha 4. Caught in the middle are a petty thief and a prison transport pilot.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Munic",
            "url": "/name/nm0612855/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Action",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk3NDMwMDI5NV5BMl5BanBnXkFtZTcwNTc0MTMyMQ@@._V1_.jpg",
    "keywords": "pilot,spaceship,cryogenics,prisoner,microchip implant",
    "name": "Timelock",
    "original_info": {
        "id": "Timelock_1996",
        "name": "Timelock",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AW3"
        },
        "dateCreated": "2001-04-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0117915/"
        },
        "name": "What the heck did I just sit through?",
        "reviewBody": "Let me try to sum up the \"plot\" of this movie as best I can: Maryam d'Abo (former Bond girl) reaches the end of her career here as Teegs, a spaceship captain in the year 2251, who is responsible for ferrying prisoners to the asteroid Alpha 4, a maximum security penal colony.\n\nAmong the prisoners in the cargo hold is Riley (played by Arye Gross, whom you might remember best from the sitcom Ellen), a \"master\" computer thief. We then have a brief flashback to Riley's crime, which involved him hacking into what is (I think) a bank's computer. The display on the computer, strangely enough, is a wavy three-dimensional grid that bears little relation to the financial transactions Riley is performing.\n\nNext, the flashback cuts to Riley in bed in a hotel room, enjoying the (ahem) services of two voluptuous women. His eyes light up with glee when they start handcuffing him to the headboard. \"I've got something to show you,\" one of the girls says. \"Oh, show it to me!\" Riley cries. \"Showtime! Showtime at the Apollo!\" (Apparently people will still be tuning in to Amateur Night 250 years from now).\n\nAs you might have guessed, what they show Riley are two guns and a badge. In the future, you see, law enforcement agencies will hire ex-Playboy Playmates to frolic with suspects in hotel rooms instead of just arresting them on the spot.\n\nHaving established Riley's crime and arrest, we return to the cargo hold of Teegs' ship. Riley overhears another prisoner talking about his record: \"I've been to Alpha 1, 2, and 3, but this is my first trip to the Big House!\" Apparently, in the future, there will be only four prisons in the entire universe.\n\nNaturally, this panics Riley, who's just a lowly computer hacker, and presumably belongs in a minimum-security facility. \"I'm supposed to be going to Alpha 1!\" Riley screams. Teegs refuses to check on this, because, in her words, \"I hate lists.\" Yeah, those pesky little things that tell you exactly which prisoners you're supposed to be delivering. I can't stand those either.\n\nThis plea earns Riley the nickname of \"A1\" among his fellow convicts. At this point, I have to mention that there's a blatant undercurrent of homoeroticism in this movie (even for a prison flick) especially coming from bad guy Villum, played by Jeffrey Meeks. The person who left the comment that Meeks' performance was \"wonderful\" must be related to the guy in some way. The word I would have chosen is \"bizarre\": His performance appears to be modeled on the character of Blanche DuBois in A Streetcar Named Desire (Meeks even fans himself at one point with a piece of paper).\n\n Once they arrive at Alpha 4, we are witness to one of the lamest \"prison breakouts\" I've ever seen, which seems to consist solely of shooting two guards and disabling one computer. Now all the prisoners are running amuck, and so are Riley and Teegs, and they're all trying to get back to Teegs' ship to escape.\n\nNaturally, Riley and Teegs fall in love, for no real reason other than It's In The Script (tm) (There's even a charming scene where they make out in a prison cell while handcuffed to a toilet). If you're unfortunate enough to see this movie, you will understand how dumbfounded I was by this attraction. Riley is an irritating jerk who can't go for more than two minutes without making some lame quip. (Sample: When Riley and Villum are facing down in a swordfight (and don't ask me why there were two swords lying around a prison colony), Riley says, \"Hey, how come you get the good sword?\") Between Villum's wierd Scarlet O'Hara accent and Riley's stupid patter I was rooting for both of them to die, slowly and painfully.\n\nOf course, the real dilemma is that even if Riley and Teegs can make it back to the ship, the head honcho bad guy McMasters (sporting a Billy Ray Cyrus-style mullet) has unfortunately gotten his hands on the vital component that the ship can't function without: a 3 and 1/4 inch floppy disk. Yes, that's right; spaceships in the year 2251 require a boot disk.\n\nOne final note: why the heck is the movie called \"Timelock\"? It's got nothing to do with time, other than it takes place a long time from now, and even though it is in a prison, the plot's got nothing do with locks. I can only conclude they called it \"Timelock\" because watching it makes you feel like you've been locked away for an eternity."
    },
    "url": "/title/tt0117915/"
}