{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Aurélien Recoing",
            "url": "/name/nm0714534/"
        },
        {
            "@type": "Person",
            "name": "Karin Viard",
            "url": "/name/nm0895759/"
        },
        {
            "@type": "Person",
            "name": "Serge Livrozet",
            "url": "/name/nm1050149/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4881,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Time Out",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030799/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063732/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Person",
            "name": "Robin Campillo",
            "url": "/name/nm0133028/"
        },
        {
            "@type": "Person",
            "name": "Laurent Cantet",
            "url": "/name/nm0134559/"
        }
    ],
    "datePublished": "2001-11-14",
    "description": "An unemployed man finds his life sinking more and more into trouble as he hides his situation from his family and friends.",
    "director": [
        {
            "@type": "Person",
            "name": "Laurent Cantet",
            "url": "/name/nm0134559/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTA4NDVhYzUtYzliYi00Mzk2LTg1M2UtZTliZDY3YTI4NGY4XkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_.jpg",
    "keywords": "counterfeit,husband doesn't tell wife he lost his job,france,switzerland,cell phone",
    "name": "L'emploi du temps",
    "original_info": {
        "id": "Time Out_2001",
        "name": "Time Out",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nunculus"
        },
        "dateCreated": "2002-04-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0279065/"
        },
        "name": "Stupor of a salesman",
        "reviewBody": "Playing authority figures in dark suits, the actor Stellan Skarsgard always suggests a noble melancholy, a weatherbeaten soul underneath his Swedish-oil-exec good looks. William H. Macy has made a career out of essaying the disappointments of pride-in-professionalism white men. Aurelien Recoing, the hero of Laurent Cantet's L'EMPLOI DU TEMPS, doesn't summon the instant empathy we feel for those actors. Cantet is a schematist in the style of Arthur Miller: without Miller's cornballs, but also without his visceral punch. Recoing's very body seems to be a manifestation of Cantet's two-sided patness. From the front, Recoing has some of the bland, boyish-haired handsomeness of a Skarsgard or a young Klaus Maria Brandauer. From the back, balding and bearlike-hulking, Recoing is a monster or a wreck. Cantet's movies--old-school, slowly downhill-rolling tragedies about the inhumanity of late capitalism--use Jekyll-and-Hyde dichotomies for thudding dramatic effects.\n\nRecoing's Vincent has lost his job as a management consultant. Instead of getting another one, he drives around, hangs out in office-building lobbies and hotel bars, and generally dresses and comports like an upper-middle-class Frenchman. When he starts dreaming up a fantasy job--bringing bucks to developing markets in the Third World via the U.N.--he starts taking money from all-too-eager friends to invest. Then a middle-class mobster is onto Vincent's scheme. And from there...before you can say FARGO, the cards come tumblin' down.\n\nLike Cantet's last movie, HUMAN RESOURCES, we are meant to hate the game, not the player, and to believe that a rigged, soulless system has robbed Cantet's characters of their capacity to experience joy on earth. But what does this character want, exactly? At one moment, he seems to genuinely wish he had the idealistic U.N. job--something, at his stage of life, with his background in the for-profit world, he could never attain. At other moments he seems to want to drive around the snowy countryside and listen to golden oldies. At still others, he seems to enjoy, a la Kevin Spacey in AMERICAN BEAUTY, the undemanding work of selling hot stereos and toasters for his mafia friend. And yet Cantet has designed the movie to make it seem as if the need for status, for patriarchal prestige, has led Vincent into the fantasy land that is his undoing. The ending--a softer landing than you might be expecting--is meant to be soul-chilling.\n\nBut what's the big whip? Everyone has dreamed of a life of aimless rambling; those who have it never seem very happy with it. (Cantet could've tested his ideas if he had bought Vincent a ticket to a lazybones' paradise.) And Cantet underlines the irony that Vincent's hustling to keep himself in non-work is in itself a more than full-time job. Cantet's movies struggle for a Miller-like inevitability, but they always fail to persuade on a human level; his crushed heroes seem more constructs than creatures. One brilliantly observant (and shudder-inducingly cruel) moment: Vincent's wife catches on to his ruse when he brings a buddy from the office to dinner--a pockmarked hustler who is too low-class to inhabit the highflown world Vincent pretends to have a berth in. The jig is up for Vincent because his wife's snob meter goes off. Too bad nothing else is as acutely examined or observant."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M3S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3704659481",
        "name": "Time Out",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTg5ODU2MTktYmIyZS00M2NiLTg5YTktNTRkZjc0Y2Q5ZjRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTg5ODU2MTktYmIyZS00M2NiLTg5YTktNTRkZjc0Y2Q5ZjRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-10-26T03:59:11Z",
        "url": "https://www.imdb.com/video/vi3704659481/"
    },
    "url": "/title/tt0279065/"
}