{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "D. David Morin",
            "url": "/name/nm0605514/"
        },
        {
            "@type": "Person",
            "name": "Gavin MacLeod",
            "url": "/name/nm0533891/"
        },
        {
            "@type": "Person",
            "name": "Hal Linden",
            "url": "/name/nm0511604/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2650,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032279/"
        },
        {
            "@type": "Person",
            "name": "Rich Christiano",
            "url": "/name/nm0160126/"
        }
    ],
    "datePublished": "2016-12-29",
    "description": "A Bible professor from 1890 comes forward in time to the present via a time machine and cannot believe the things that he sees!",
    "director": [
        {
            "@type": "Person",
            "name": "Rich Christiano",
            "url": "/name/nm0160126/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Drama",
        "Fantasy",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjQ3YTU2NWUtNzhmZC00ODZhLWIxOGYtZjJhZjFkNGQ3NDZiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "time machine,bible,christianity,1890s,professor",
    "name": "Time Changer",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nicholas.rhodes"
        },
        "dateCreated": "2003-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0295725/"
        },
        "name": "Totally Agreed With Its Premise",
        "reviewBody": "I originally bought this film because I collect time-travel movies and read about it on the internet ( it's unknown in Europe ). On a purely time travel basis, I was very satisfied with the movie. There were limited special effects, which is a good thing and it was funny to see our hero's reaction confronted with modern day life ( like in Time After Time ). The picture quality and dialogue were wonderful and it was easy to understand what was going on. Naturally, if you are not of the Christian religion, you may find the film less interesting as there are certain passages where there is a lot of Christian preaching. But as a Christian myself, though not a very good one, this does not bother me at all. I nevertheless felt that the story could have been a bit longer and a bit more exciting. On the moral side, I was very happy to hear the man lashing out at today's moral standards because, even if there was immorality in 1890 ( there has always been immorality in the world ), it is even worse today. Certain bad things of 100 years ago have been corrected but other, even worse things, have taken their place. If you take for one example, violence in the cinema, it is today far worse than fifty years ago. Music has become more violent. The world of Commerce has become more violent. Road rage, rape, abortion, insider dealing on the stock exchange, the size of bombs and weapons ....the list is endless and there's no point in insisting. Of course it's very difficult to live like Jesus Christ ! There's too much material temptation in our path which leeds to greed etc ..... but one must start by at least admitting the lack of morality before trying to correct it. It's normal that a hundred year jump in time should cause our hero to be greated with total shock and to change his views on certain things when he returned to his time frame. If we could do the same we should probably change our views. Anyway, putting all this moralistic stuff aside, the film was a pleasure to watch because it didn't contain violence and because our hero's thoughts were pure and naive. I can understand it not being everyone's cup of tea but I for one should like to see more of these films on the screen - some preaching, of course, but also a lot of humour and some originality !!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Bible professor from 1890 comes forward in time to the present via a time machine and cannot believe the things that he sees!",
        "duration": "PT2M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3017327385",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzZmOTEyODktNGFmZi00MzJkLWE4NzQtMzdlOWRjNzY4NGU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzZmOTEyODktNGFmZi00MzJkLWE4NzQtMzdlOWRjNzY4NGU2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-11-30T20:46:30.731Z",
        "url": "https://www.imdb.com/video/vi3017327385/"
    },
    "url": "/title/tt0295725/"
}