{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Walker",
            "url": "/name/nm0908094/"
        },
        {
            "@type": "Person",
            "name": "Gerard Butler",
            "url": "/name/nm0124930/"
        },
        {
            "@type": "Person",
            "name": "Billy Connolly",
            "url": "/name/nm0175262/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 64227,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007500/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001946/"
        },
        {
            "@type": "Person",
            "name": "Michael Crichton",
            "url": "/name/nm0000341/"
        },
        {
            "@type": "Person",
            "name": "Jeff Maguire",
            "url": "/name/nm0536587/"
        },
        {
            "@type": "Person",
            "name": "George Nolfi",
            "url": "/name/nm1079776/"
        }
    ],
    "datePublished": "2003-11-26",
    "description": "A group of archaeologists become trapped in the past when they go there to retrieve a friend. The group must survive in 14th-century France before they can escape back to the twenty-first century.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Donner",
            "url": "/name/nm0001149/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTg5OTAyNDE3NV5BMl5BanBnXkFtZTYwOTkzMzE3._V1_.jpg",
    "keywords": "time machine,self experimentation,accidental time travel,backward time travel,male time traveler",
    "name": "Timeline",
    "original_info": {
        "id": "Timeline_2003",
        "name": "Timeline",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "filmbuff-36"
        },
        "dateCreated": "2003-12-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0300556/"
        },
        "name": "Dude, we're totally back in the Middle Ages! Heinous!",
        "reviewBody": "There's a reason why time travel has remained a staple of science-fiction for more than a century - human beings will always be curious about the past as well as the future. To be able to fix past mistakes with the advantage of hindsight or to know what to expect in the years to come are basic human desires common to everyone.\n\nThe producers of \"Timeline\" may have benefited from owning a time machine. If they had taken a ride in Marty McFly's DeLorean they might have been able to prevent the mistakes in casting and scripting and made something that lives up to the idea's potential.\n\nAn archeological team led by Professor Edward Johnston (Billy Connolly) is excavating the ruins of Castlegard, site of a medieval battle between the French and the British during the Hundred Year War. Johnston's son Chris (Paul Walker) is visiting, a man not interested in the past but in getting closer to his father's assistant Kate Erikson (Frances O'Connor).\n\nTrouble arises when Professor Johnston goes to his benefactor, the International Technology Corporation, to get more funds and information about why they are so interested in Castlegard. When he does not return Chris, accompanied with Kate, historian and medieval weapons expert Andre Marek (Gerard Butler), physics expert Dave Stern (Ethan Embry) and Francois (Rossif Sutherland) head to the company headquarters to figure out where Johnston has gone.\n\nIt seems ITC, lead by Robert Doniger (David Thewlis), has stumbled onto a worm hole that leads back to 1357 while trying to perfect teleportation. Professor Johnston went back to see the era first-hand but got stuck there, and now his students must go back to rescue him. However, there's a catch, the group must collect him in six hours, otherwise they'll be stuck in the 14th century forever.\n\nThe movie could have been great had the filmmakers taken more time to examine its premise, but as it stands the plot is just mechanical. Once in the past the group just goes from one incident to another in a single-minded goal of rescuing Johnston.\n\nThere is no moment of wonder at the medieval world or any insights that looking into the past might reveal to 21st century travelers throughout the film. The visitors' knowledge of the area and upcoming battle do indeed come in handy, but they use this information only to survive and not to learn anything worthwhile.\n\nThe movie certainly looks good, with some fine attention to period details. The clothing and buildings look authentic, though the people inhabiting them are a bit cleaner then they would have been. The siege on the castle is also well filmed with trebuchets and catapults launching flaming bombs at Castlegard.\n\nHowever, for a movie about survival and battle, everything is handled apathetically. The characters seem to be going through the motions when delivering their lines and there isn't much tension in the fight scenes. It adds up to a boring action movie, and boring is one thing an action movie should never be.\n\nIt's also funny to see a film so selective about being authentic, such as making it a point that modern people should not carry modern equipment with them to influence history, but having medieval characters speak modern versions of English and French. It's also a strange that the movie takes sides, portraying the English as evil tyrannts and the French as noble defenders of their home. In reality, both sides were ruthless during that era.\n\nAs an actor, Walker comes off as a poor man's Keanu Reeves. You read that right - Walker makes Reeves look like a nuanced performer by comparison. He shouts lines with little conviction and acts like a dork through most of the film.\n\nIn fact, with the exception or Butler's Marek, it seems like amateur night in the acting department. A scene where O'Connors' Kate breaks down crying will have people laughing. Even Embry, normally an okay actor, gives an unmoving performance. His character stays behind in the present and comes off as the \"self-righteous scientist\" who squares off against Thewlis' heartless business man, a typical feature of this movie type.\n\nDirector Richard Donner once made great movies like \"Superman\" and \"Lethal Weapon\" but can't rescue this mess. It's been five years since he's done a movie, and he seems rusty. The camerawork and set design are both excellent though, and belong in a better movie.\n\nLike most stories by Michael Crichton, \"Timeline\" makes scientists into noble humanitarians and corporate heads into greedy slime to create artificial drama, and it comes off as exploitive pabulum that detracts from where the attention should be, on the action.\n\nSince the action isn't good, what's left is a story where the heroes cry, complain and act selfishly while the movie tries to convince us that they're intriguing characters we should care about. \"Timeline\" is a wholly forgettable experience, and memories of the movie will be teleported out of the minds of the audience not long after leaving the theater.\n\nFive out of ten stars. Just stick to the \"Lethal Weapon\" series Mr. Donner, and Mr. Crichton, please exhibit caution before letting another one of your novels be ruined with a horrible on screen versions (but then, you haven't had a good reputation of doing that).",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT1M35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3170304281",
        "name": "Timeline",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWRjOWJlMWMtZDI4NC00N2QxLTllYzItOWYzOGJlNzNiM2Y5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWRjOWJlMWMtZDI4NC00N2QxLTllYzItOWYzOGJlNzNiM2Y5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T16:59:57Z",
        "url": "https://www.imdb.com/video/vi3170304281/"
    },
    "url": "/title/tt0300556/"
}