{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Matt Damon",
            "url": "/name/nm0000354/"
        },
        {
            "@type": "Person",
            "name": "Drew Barrymore",
            "url": "/name/nm0000106/"
        },
        {
            "@type": "Person",
            "name": "Bill Pullman",
            "url": "/name/nm0000597/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 62270,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0179259/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057460/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0043064/"
        },
        {
            "@type": "Person",
            "name": "Hans Bauer",
            "url": "/name/nm0061829/"
        },
        {
            "@type": "Person",
            "name": "Randall McCormick",
            "url": "/name/nm0566595/"
        },
        {
            "@type": "Person",
            "name": "Ben Edlund",
            "url": "/name/nm0249421/"
        }
    ],
    "datePublished": "2000-06-16",
    "description": "A young man learns that he has to find a hidden Earth ship before an enemy alien species does in order to secure the survival of humanity.",
    "director": [
        {
            "@type": "Person",
            "name": "Don Bluth",
            "url": "/name/nm0089940/"
        },
        {
            "@type": "Person",
            "name": "Gary Goldman",
            "url": "/name/nm0325776/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWIzMWFjN2EtOWIwYS00Mzk5LWE0MjItMDU2YTczM2U0MGNiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "alien,cult film,31st century,escape,pilot",
    "name": "Titan A.E.",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "2000-07-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120913/"
        },
        "name": "Visually Stimulating; entertains children and adults alike. *** (out of four)",
        "reviewBody": "TITAN A. E. / (2000) *** (out of four)\n\n\"Titan A.E.\" is like a giant looming over movie animation landscape; it is one of the most visually bracing family fantasy adventures to come down the pike in years. The film's animation is wonderfully spectacular, visually enticing and entirely convincing. Directors Don Bluth and Gary Goldman enthrall the audience with a sweeping sense of atmosphere and action. This is the kind of cartoon that is mature to the level in which the characters and set designs could have been replaced with live action filmmaking without changing the movie's perspective. \n\nThe production takes place twenty-eight years after the third millennium. Planet Earth has been demolished by a cruel species called the Drej, who fear the potential intelligence of the human race. Cale (voiced by Matt Damon) is a young man working as a space dump attendant who believes his father abandoned him when he was a child. Cale doesn't know it yet, but he holds the key to the survival of the human race with a genetically coded map on his hand showing the course to the hidden position of a special spacecraft called the Titan.\n\nCale meets a young woman named Akima (voiced by Drew Barrymore), who cherishes conventional memorabilia of her late planet. She and her captain, Korso (voiced by Bill Pullman), and the navigator, Gune (John Leguizamo), set out to locate the vital Titan before the evil Drej can exterminate it along with mankind's future hope of existence. \n\nInstead of our traditional, well-developed bad guy that posses serious threats to the protagonist's mission, in \"Titan A.E.\" we receive something of a different sort: an underwritten alien race whose motives and backgrounds are unclear and undeveloped. The movie seems to know of this, however, therefore the film wisely switches villains in the second act. The story provides an interesting twist that supplies us with solid and comprehendible antagonism. \n\n\tThis movie's plot feels somewhat pieced together from previous science fiction fantasies like \"Star Trek,\" \"Star Wars,\" and \"Lost in Space.\" John Whedon, Ben Edlund, and John August vividly detail a story that moves along steadily, but occasionally stalls to build momentum for the character's purpose for achieving goals. There is a scene on a spaceship holding Cale in captivity that feels trite and dual, but the film quickly rejuvenates itself with an exhilarating chase sequence. The film's plot would have been more involving if we knew more about the characters. They seem pretty interesting but we never really get to know them because the filmmakers were more concerned with special effects, a common misconception both animated and live action films.\n\n\tThis production is engaging and well animated; \"Titan: After Earth\" is smart to jolt a appropriate about of energy into its action scenes and contains sufficient amounts of style and wit to satisfy younger audiences as well to hold the attention of the older, more sophisticated viewers. It is not every day a cartoon is able to do that.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A young man learns that he has to find a hidden Earth ship before an enemy alien species does in order to secure the survival of humanity.",
        "duration": "PT2M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3268133145",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOWNiNzA3NzMtNDg5ZC00MzljLWI3MmItYjRiNTk0YjFkZmI1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOWNiNzA3NzMtNDg5ZC00MzljLWI3MmItYjRiNTk0YjFkZmI1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-20T12:10:33.816Z",
        "url": "https://www.imdb.com/video/vi3268133145/"
    },
    "url": "/title/tt0120913/"
}