{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Brian Dennehy",
            "url": "/name/nm0001133/"
        },
        {
            "@type": "Person",
            "name": "Michael Riley",
            "url": "/name/nm0727120/"
        },
        {
            "@type": "Person",
            "name": "Margot Kidder",
            "url": "/name/nm0452288/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2746,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079919/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012388/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062488/"
        }
    ],
    "datePublished": "1992-05-15",
    "description": "\"To Catch a Killer\" tells the true gruesome story of John Wayne Gacy - a good friend and helpful neighbour, a great child entertainer, a respectful businessman, and a violent serial killer who raped and murdered over 30 young boys.",
    "genre": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDIzMWI3MjktYzgyYy00YTY5LTk4YjEtYTg5ZGEyN2UxNzk5XkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_.jpg",
    "keywords": "serial killer,psycho killer,psycho,cruelty,killing",
    "name": "To Catch a Killer",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MarieGabrielle"
        },
        "dateCreated": "2006-10-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105604/"
        },
        "name": "Chilling....",
        "reviewBody": "Brian Dennehey BECOMES John Wayne Gacy, as you watch this film you can only imagine the horrible fate of the victims.\n\nThe beginning starts out with Robert Piest, well portrayed, who is picked up by Gacy for construction work (this was his method of trolling for young boys). Gacy owned his own contracting company in Des Plaines, Illinois.\n\nThe actress who is Piest's mother is heart-rending; as she pleads with the police to take her son's disappearance seriously. In the Chicago area a missing person is nothing new, but it was her birthday and Rob never showed up. ...\" He would never run away from home... he is not that type of boy\"..., she mentions, and Detective Joe Koczenczak (very well portrayed by Michael Riley) takes notice of the situation.\n\nDennehey is superb, when the police first visit Gacy's house in Des Plaines, we can feel the menacing evil and rage simmering just below the surface. Gacy shows the police his pictures with Rosalynn Carter, his promotion as manager of Kentucky Fried Chicken, and his \"commendations\" for contributions to local police and firefighters (a fixation common among sociopaths; they are very high functioning, and socially enjoy manipulating authority figures).\n\nGacy also apparently used drugs to lure young men to his house, there are several scenes where he uses Qualuudes, and the detectives are following him, realizing the extent of his social connections. What is so horrifying is that, on the surface, Gacy was a well-liked businessman who had many friends. He was not a reclusive psycho who stood out in the crowd.\n\nAs Detective Koczenczack becomes more frustrated trying to mount evidence against Gacy he is thwarted many times by D.A. Meg Foster, who cannot make a case if Gacy's rights are violated. The case is interesting and disturbing all the more so because it is true. Margot Kidder also has a cameo as a psychic, who relays to Koczenzack that there are many, many more victims; this will not be an easy case.\n\nThe soundtrack at the end, as they are searching for more victims, and pan out over the cemetery, is very haunting. So sad for any of the parents and young men who were affected by this monster, John Wayne Gacy, who was executed in 1994.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "To Catch A Killer",
        "duration": "PT3M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2795748889",
        "name": "To Catch A Killer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGU1MWVhNGItMDgyMS00MGNlLWEyNDQtNzA1MzEzYWRjYzA2XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGU1MWVhNGItMDgyMS00MGNlLWEyNDQtNzA1MzEzYWRjYzA2XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-06T13:02:13.105Z",
        "url": "https://www.imdb.com/video/vi2795748889/"
    },
    "url": "/title/tt0105604/"
}