{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Carlyle",
            "url": "/name/nm0001015/"
        },
        {
            "@type": "Person",
            "name": "Kiefer Sutherland",
            "url": "/name/nm0000662/"
        },
        {
            "@type": "Person",
            "name": "Ciarán McMenamin",
            "url": "/name/nm0573223/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11231,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0034284/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071771/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062814/"
        },
        {
            "@type": "Person",
            "name": "Ernest Gordon",
            "url": "/name/nm0330174/"
        },
        {
            "@type": "Person",
            "name": "Brian Godawa",
            "url": "/name/nm0323725/"
        }
    ],
    "datePublished": "2001-09-02",
    "description": "A true story about four Allied POWs who endure harsh treatment from their Japanese captors during World War II while being forced to build a railroad through the Burmese jungle. Ultimately they find true freedom by forgiving their...",
    "director": [
        {
            "@type": "Person",
            "name": "David L. Cunningham",
            "url": "/name/nm0192289/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Action",
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAyMDMxMTExOV5BMl5BanBnXkFtZTcwNzEwMjYyMQ@@._V1_.jpg",
    "keywords": "japanese prison camp,jungle,escape,tarsau burma,railway of death",
    "name": "To End All Wars",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mcnulty"
        },
        "dateCreated": "2002-04-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0243609/"
        },
        "name": "The powerful, true story of what REALLY happened on the River Kwai during WW2.",
        "reviewBody": "THROUGH THE VALLEY OF THE KWAI, the story of British POW's forced to build the Japanese jungle railroad, was my favorite book when it came out in 1962. Thus I was a bit apprehensive at what filmmakers would do to it when I heard about TO END ALL WARS, the title itself being changed. The film is different in many ways from the book, but is so powerful that the addition (apparently for dramatic excitement) of fictional characters bent on staging an escape can be forgiven. Agnostic Ernest Gordon's story of his being nursed back from the brink of death by Christian friends, thereby starting him on the road to faith--and incredibly, understanding and then forgiveness of the harsh brutality of his Japanese captors--raises this film far above any other WW2 films that I have seen (except perhaps the under-rated THE THIN RED LINE, like TO END...also filled with philosophical questions and ruminations). Although the brutality of the Japanese bushito system is shown in all its horrific brutality, some of the Japanese, especially the young man who serves as interpreter, are depicted as having touch of humanity. The film's central thesis seems to depict the affects of clinging to anger and vengeance versus seeking to be able to forgive and reconcile. The latter is shown at the end of the film when, similar to the scene in SCHINDLER'S LIST, the real Capt. Ernest Gordon and Japanese interpreter Nagase, now old men, meet and shake hands in Thailand at a memorial to those who died building the railroad. The creativity of the men, forming a Jungle University where Plato and Shakespeare are taught, is celebrated, calling to mind the inspiring film of women POW's, PARADISE ROAD.\n\n When this thought-inspiring film finally is released to theaters or video, don't miss it. It can serve as an antidote to the dozens of mindless, vengeance-based flicks cluttering up the screens of our cinemaplexes."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Freestyle Digital Media",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2717319449",
        "name": "To End All Wars",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWNmYmUyYjctNGRhNy00NmMzLWFlZWEtODhmNGY0MmM2M2Q4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWNmYmUyYjctNGRhNy00NmMzLWFlZWEtODhmNGY0MmM2M2Q4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:00:23Z",
        "url": "https://www.imdb.com/video/vi2717319449/"
    },
    "url": "/title/tt0243609/"
}