{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "John Duttine",
            "url": "/name/nm0244912/"
        },
        {
            "@type": "Person",
            "name": "Frank Middlemass",
            "url": "/name/nm0585460/"
        },
        {
            "@type": "Person",
            "name": "Alan MacNaughtan",
            "url": "/name/nm0534077/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 642,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0043107/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0207399/"
        }
    ],
    "datePublished": "1982-10-10",
    "description": "David Powlett-Jones has just returned to England from the trenches of WWI. He was injured and shell-shocked and, after a spell in hospital he gets a job teaching in a boys boarding school in S.W. England. He is not at all sure he ...",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIwODgyNjY0NV5BMl5BanBnXkFtZTcwMTA1NjUyMQ@@._V1_.jpg",
    "keywords": "private school,boys' school,welshman,shell shock,tv mini series",
    "name": "To Serve Them All My Days",
    "original_info": {
        "id": "To Serve Them All My Days_1980",
        "name": "To Serve Them All My Days",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "galensaysyes"
        },
        "dateCreated": "2005-03-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0080298/"
        },
        "name": "Lovely party, thanks",
        "reviewBody": "This was my favorite of the BBC serials that played on \"Masterpiece Theatre,\" and 25 years later I find it just as charming and touching as I remembered. It's one of many variants (others are \"Shogun, \"All Creatures Great and Small,\" etc.) of the idyll some of us yearn for and, never finding, regard as irresistibly poignant: the story of a person who finds his perfect place in the world. In watching it again I discovered I practically didn't have to; I'd seen it so many times, and absorbed myself in it so thoroughly, that it had become part of my mental furniture. John Duttine was an unusual, compelling actor who gave what I think were splendid performances in this, the \"Day of the Triffids\" serial, and an episode of a BBC ghost series, and then seemed more or less to have vanished, to the viewers' loss.\n\nThe one big thing which strikes me now about this series is the bounciness of the supporting cast. There can never have been any more exuberant actors than Frank Middlemass, Belinda Lang, etc.; even Alan MacNaughtan, whose character is written as world-weary and cynical, comes across as lively and cheerful. Into the midst of this exuberant crowd enters a disillusioned war veteran--Duttine, an intense, introspective, melancholic performer--and the effect is as if he were brought out of himself by being caught up in a Gilbert and Sullivan operetta (and indeed, at one point the school stages \"The Mikado\"). Though the story is filled with anxiety and sorrow, the whole thing seems somehow like a party, and as such a sort of litmus test for one's capacity to enjoy life. Those who have it will have a grand time; those who don't won't understand why, and will probably leave early. For my part, I loved it, and feel grateful to have been invited.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "To Serve Them All My Days: Part Four",
        "duration": "PT1M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi761314585",
        "name": "To Serve Them All My Days: Part Four",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTRlYjU4M2EtZjZiOS00ZmE1LWFiM2QtNDQxZDI5MDAzOGY2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTRlYjU4M2EtZjZiOS00ZmE1LWFiM2QtNDQxZDI5MDAzOGY2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-04-13T20:03:57.452Z",
        "url": "https://www.imdb.com/video/vi761314585/"
    },
    "url": "/title/tt0080298/"
}