{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Steven Seagal",
            "url": "/name/nm0000219/"
        },
        {
            "@type": "Person",
            "name": "Anthony 'Treach' Criss",
            "url": "/name/nm0188025/"
        },
        {
            "@type": "Person",
            "name": "Sarah Buxton",
            "url": "/name/nm0125533/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4589,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002572/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017712/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136722/"
        },
        {
            "@type": "Person",
            "name": "Danny Lerner",
            "url": "/name/nm0503600/"
        },
        {
            "@type": "Person",
            "name": "Kevin Moore",
            "url": "/name/nm0601472/"
        },
        {
            "@type": "Person",
            "name": "Les Weldon",
            "url": "/name/nm0002659/"
        }
    ],
    "datePublished": "2005-09-13",
    "description": "A former thief who is trying to go straight seeks vengeance on those who framed him.",
    "director": [
        {
            "@type": "Person",
            "name": "Don E. FauntLeRoy",
            "url": "/name/nm0005703/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTlhMjlmNWQtYzM4OS00YjBlLWFkMTItNDJkODE2YzlkYTBmXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "betrayal,weightlifting,cia central intelligence agency,low budget,female agent",
    "name": "Today You Die",
    "original_info": {
        "id": "Today You Die_2005",
        "name": "Today You Die",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "lost-in-limbo"
        },
        "dateCreated": "2012-03-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0431114/"
        },
        "name": "\"What we have here is a failure to communicate.\"",
        "reviewBody": "Steven Seagal does it again. Another daft and dull well for most part straight-to-DVD action vehicle with him whispering his lines, providing intellectual discussions (about dreams and their meanings; \"I had an awful dream.\") and whooping some ass well maybe not so as the director does a really good job hiding Seagal's face during many of the fight sequences. Quick combat we get a good look, but the extended scenes not so. Thanks stunt-man. Quick and flashy editing helps, which has Seagal always walking away from an encounter with his back facing the camera. Seagal is a thief (a Robin Hood of sorts) who decides to go straight, but a job he takes on as an armour guard truck driver turns out to be a set-up. He finds himself spending time in prison, but he happens to be the only one who knows where the stolen 20 million dollars was hidden. The criminals who set him up want their money, but Seagal wants revenge when he breaks out (in a rather unconvincing manner) with a hommie. \"Today You Die\" actually started off promising (with an explosively barnstorming car chase sequence), but when it hit's the prison yard and from then onwards it rapidly becomes uninterestingly old-hat with its heavy-handed plot devices (betrayal, corruption), try-hard attitude and flimsy characters. Well at least it provides hilarity. Just listen to the lame dialogues. \"He's evil. Something beyond this earth.\" Throw in one wannabe gangsta known as Ice Kool (Anthony \"Treach\" Criss), talking all tough and the jovial banter between the two is embarrassingly bad. Watching Seagal going around handing out his own sort of punishment simply was mind-numbing since Seagal is invincible. Not even a scratch. Must be that politeness and muddled intentions. Good for a laugh, but not much else.\n\n\"You want to dance with the devil. Lets dance.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0431114/"
}