{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Brad Swaile",
            "url": "/name/nm0841448/"
        },
        {
            "@type": "Person",
            "name": "Gabe Khouth",
            "url": "/name/nm0451917/"
        },
        {
            "@type": "Person",
            "name": "Chantal Strand",
            "url": "/name/nm0833246/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 63,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "alternateName": "Tokyo Underground",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106793/"
        }
    ],
    "datePublished": "2002-04-02",
    "description": "Under the capital city of Tokyo, Japan, there exists a large, vast, and unknown world known as Underground. There, people known as Elemental Users exist; people who have the ability to control the elements: Fire, Water, Lightning,...",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjM0MjFhMDUtMDM3YS00NmMxLThlYTYtZTg1YjAxMmJkYWNiXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
    "keywords": "supernatural power,two word title,anime animation,magic,underground",
    "name": "Tokyo andâguraundo",
    "original_info": {
        "id": "Tokyo Underground_2002",
        "name": "Tokyo Underground",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "battletin"
        },
        "dateCreated": "2010-08-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1547413/"
        },
        "name": "Action, comedy, sci-fi, and fantasy. All beneath Tokyo!",
        "reviewBody": "'Deep below Tokyo, at the end of an abandoned subway line, through long tunnels leading into darkness, and at the bottom of a seemingly bottomless pit. There is a forgotten world that has long been sealed off. The name of this sunless world is Tokyo Underground.' (Opening narrative.)\n\nWhen grade school tough guy Rumina Asagi arrives in High School, he dreams of a perfect standard high school life, but all that changes when he and his best friend Ginosuke Isuzu arrive home to find a huge hole in his garden and two strange girls in his house. The sudden appearance in his life of Ruri Sarasa and her bodyguard, Chelsea Rorec, change his life forever when he is drawn into the mysterious world of the Underground. Events force him and his friends to descend into the Underground on a rescue quest, where he meets challenges posed mainly by the elite soldiers who have mastered using powers of the elements, fire, water, gravity, electricity, etc. Who have been charged with defending the underground from their mortal enemies from the surface. During their quest they uncover a plot that could endanger the entire surface world.\n\nTokyo Underground is a very enjoyable anime that mixes fantasy, action, comedy, sci-fi and some very memorable characters, with well placed if at times a little cheesy voice acting. (At least in the English dub version.) The animation for the most part is your standard anime. (sweat drops, etc) But many effects and backgrounds are computer rendered, which despite being very different in appearance merge very well to give the series what in my opinion is a very distinctive look. The two up-beat theme songs by the short lived j-pop group 'Iksi:d' are very catchy (So much so that I scoured the internet to buy their CD) and the closing theme is strangely mellow and hypnotic, with the rest of the score perfectly conveying the emotion, comedy or tension of the situation.\n\nIf you like your anime series a little tongue-in-cheek, I'd recommend Tokyo Underground as a good light hearted, family friendly action/comedy jaunt.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt1547413/"
}