{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kurt Russell",
            "url": "/name/nm0000621/"
        },
        {
            "@type": "Person",
            "name": "Val Kilmer",
            "url": "/name/nm0000174/"
        },
        {
            "@type": "Person",
            "name": "Sam Elliott",
            "url": "/name/nm0000385/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 154103,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0076240/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094483/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049706/"
        },
        {
            "@type": "Person",
            "name": "Kevin Jarre",
            "url": "/name/nm0418883/"
        }
    ],
    "datePublished": "1993-12-25",
    "description": "A successful lawman's plans to retire anonymously in Tombstone, Arizona are disrupted by the kind of outlaws he was famous for eliminating.",
    "director": [
        {
            "@type": "Person",
            "name": "George P. Cosmatos",
            "url": "/name/nm0181902/"
        },
        {
            "@type": "Person",
            "name": "Kevin Jarre",
            "url": "/name/nm0418883/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODRkYzA4MGItODE2MC00ZjkwLWI2NDEtYzU1NzFiZGU1YzA0XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "wyatt earp character,two gun holster,double gun holster,tucson arizona,benson arizona",
    "name": "Tombstone",
    "original_info": {
        "id": "Tombstone_1993",
        "name": "Tombstone",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "iamsumaty"
        },
        "dateCreated": "2004-07-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0108358/"
        },
        "name": "We're not cross, are we?",
        "reviewBody": "First of all, I love the movie. Now some may say, \"What a moron...\" and others will undoubtedly agree with me. But I think it's great. When I first saw the film as it debuted in theaters eleven or so years back, I came away thinking, Men doing a man's job. Sounds a little chauvinist, I'll admit, but there you are. The movie is a tribute to men being men, living their lives on their own terms. The fact that the story is about the Earp saga is almost secondary to the film. To enjoy this movie, I don't think that it's so important for it to have historical accuracy to the letter or even have rain falling consistently through the shots. I would only advise viewers to let this Remington-painting-come-to-life wash over them and just go along for the ride. As long as we remember that this is Hollywood, all is well.\n\nThen there's reality. As real aficionados of Tombstone history will see, the movie sacrifices or distorts some of the facts and compresses time. In the end it's a shame, really, because the film never realizes its full potential. I'm convinced that if this movie was true to history, it could only have been better. Previous reviews talk about and compare with Costner's Wyatt Earp. I think elements of both films combined would have made a great movie. For instance, I would have lifted much of WE's script from when Wyatt arrives in town (the story, not the dialog) and used it in Tombstone. And then get the rest of the facts straight. The true story is compelling on its own, and would still be entertaining.\n\nThe special edition DVD includes deleted scenes, that for the life of me, I can't figure out why they were deleted in the first place. But the scene when Wyatt and Josie rest after their spirited ride still has the payoff of the scene cut out - Josie and Wyatt getting it on. I get tired of directors thinking that the audience is sophisticated so we'll just let them figure it out on their own. Come on George, some of us didn't know that Wyatt was cheating on Mattie.\n\nFinally, I've got to say that the movie was cast well. And the costumes were true to life - men liked to be colorful and unique in that time and place. The guns were accurate, as were the holsters (low slung and quick draw is a Hollywood invention). As for the scenery, I lived in Arizona for a while, and I do miss the big sky.\n\nIf you want to be entertained, this is the movie for you. If you want a history lesson, better hit the library..."
    },
    "url": "/title/tt0108358/"
}