{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shannon Elizabeth",
            "url": "/name/nm0002436/"
        },
        {
            "@type": "Person",
            "name": "Jerry O'Connell",
            "url": "/name/nm0005278/"
        },
        {
            "@type": "Person",
            "name": "Jake Busey",
            "url": "/name/nm0000998/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 19012,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003580/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0004619/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0176392/"
        },
        {
            "@type": "Person",
            "name": "Gregory Poirier",
            "url": "/name/nm0201304/"
        }
    ],
    "datePublished": "2001-03-30",
    "description": "At the wedding of a friend, the remaining bachelors bet on staying single. Seven years later, one of the two remaining loses $51,000 in Vegas. He must get the other guy married to cash in and pay his debt or die. A cute woman help...",
    "director": [
        {
            "@type": "Person",
            "name": "Gregory Poirier",
            "url": "/name/nm0201304/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ0NzQyMjgwMF5BMl5BanBnXkFtZTYwMTEyMTk2._V1_.jpg",
    "keywords": "loss of virginity,one night stand,dominatrix,bet,public nudity",
    "name": "Tomcats",
    "original_info": {
        "id": "Tomcats_2001",
        "name": "Tomcats",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "vchimpanzee"
        },
        "dateCreated": "2006-03-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0246989/"
        },
        "name": "Funny but crude, Shannon Elizabeth great",
        "reviewBody": "Max, at age 19, is the first member of the Tomcats to get married. The guys put money in a fund which will go to the last single member of the group. Seven years later, Steve is married to Trisha in Vegas by a man who can be described as a cross between Elvis and Apu from 'The Simpsons'. Only Mike and Kyle are still single, and the fund has nearly a half million dollars.\n\nMike can't stop gambling until he is over $50,000 in debt to Carlos, who gives him a month to pay up, and each day a 'deposit' will be required. This means Mike's stuff gets 'repossessed'. Only one way out of this mess: Kyle has to get married so Mike will get the money. Kyle has vowed that he and Mike will have sex with every woman on Earth, but if he had to choose one to spend the rest of his life with, it would be Natalie, a bridesmaid at Max's wedding. Of course, Kyle cannot know what Mike is doing, and Mike and Natalie seem to like each other ...\n\nAt first I didn't think the word 'quality' could possibly apply to this movie. Shannon Elizabeth changed all that. I don't remember much about her performances in the 'American Pie' movies because it has been so long since I saw them, but I think here she may have given the best performance I have seen from her. That includes several appearances as the mother of Kelso's baby on 'That 70s Show'. And she was beautiful both in and out of clothes (actually, we never got to see much other than her legs and shoulders).\n\nJerry O'Connell did a capable job. I'm not sure whether to call Jake Busey's performance good acting. Just because his father is a respected actor, that doesn't mean he is. But Kyle was definitely a class-A jerk. Or perhaps one could use a word Kyle used twice, which got its second half bleeped out for TV.\n\nBill Maher made a nasty but somewhat pleasant Carlos. David Ogden Stiers made the surgery his character was going to perform sound terrifying. Also worth mentioning: Garry Marshall's rant about why men shouldn't get married.\n\nAnd last but not least among the notable acting performances: Heather Stephens as a librarian who lives with her Grammy (who was also a librarian) and has numerous stuffed animals in her bed.\n\nMy first thought about this movie was that it would compare with the 'American Pie' and 'Porky's' films. It wasn't quite that dirty once it really got into the main plot line. But much of the second half ... well, even edited I would say this film pushed the limits of what broadcast TV will allow. In fact, it may have even gone beyond them. Most of the bad language was taken out, apparently. A few words have only been said on network TV when there was a strong warning, or on the WB's 'Jack and Bobby'. But that's not the worst of it, even if you see this on TV the way I did.\n\nHere are some samples of what made this such a hilarious but tasteless film: \n\n-A prank involving a competitor for Viagra.\n\n-An S & M scene, which was great even if it was crude.\n\n-Steve suspects Trisha is a lesbian (this leads to several naughty gags).\n\n-After one of the characters had surgery, something happened that made me laugh until there were tears.\n\n-Cops who can't stop talking about their personal life on the job make a very unique bust (no, the other kind of bust) . At this point I have to say there is even violence in this movie, and not just the slapstick kind.\n\nAnd one more gag, which was not dirty at all, involved a fur coat at a bachelor party. No, really, the humor with this gag was nearly G-rated, but it was a highlight.\n\nGetting off the subject of what was funny, can they show that much of a woman's body on TV? She did have clothes on, but you could hardly call them clothes. And did we REALLY have to see that much of Jake Busey's posterior? That was underwear, I guess ...\n\nYou have been warned. I enjoy a guilty pleasure like this once in a while. But this is not for kids or the easily offended."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Columbia Tristar",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi167248153",
        "name": "Tomcats",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmUzMGYzNzctNDc1Zi00NzA2LWJmNzctOTE5NjllM2Q2Y2NlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmUzMGYzNzctNDc1Zi00NzA2LWJmNzctOTE5NjllM2Q2Y2NlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:01:46Z",
        "url": "https://www.imdb.com/video/vi167248153/"
    },
    "url": "/title/tt0246989/"
}