{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Roger Daltrey",
            "url": "/name/nm0002032/"
        },
        {
            "@type": "Person",
            "name": "Ann-Margret",
            "url": "/name/nm0000268/"
        },
        {
            "@type": "Person",
            "name": "Oliver Reed",
            "url": "/name/nm0001657/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 21578,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0154108/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056805/"
        },
        {
            "@type": "Person",
            "name": "The Who",
            "url": "/name/nm1277963/"
        },
        {
            "@type": "Person",
            "name": "Ken Russell",
            "url": "/name/nm0001692/"
        },
        {
            "@type": "Person",
            "name": "Pete Townshend",
            "url": "/name/nm0870175/"
        }
    ],
    "datePublished": "1975-03-26",
    "description": "A psychosomatically blind, deaf, and mute boy becomes a master pinball player and, subsequently, the figurehead of a cult.",
    "director": [
        {
            "@type": "Person",
            "name": "Ken Russell",
            "url": "/name/nm0001692/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjlhZWMyNjItNWU5OS00NGQzLWI4YWYtYThjYjk3OTlmZDA5XkEyXkFqcGdeQXVyMzMyODMwMTI@._V1_.jpg",
    "keywords": "pinball,holiday camp,murder,jukebox musical,the who",
    "name": "Tommy",
    "original_info": {
        "id": "Tommy_1975",
        "name": "Tommy",
        "year": "1975"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-06-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0073812/"
        },
        "name": "A fun if overblown rock opera with a cult following, shambolic plot with obvious attacks on religion and an eclectic cast",
        "reviewBody": "When her husband is lost in WWII, Nora Walker is left with an unborn baby to raise by herself. Years later she has a fantastic son, Tommy, and is being courted by 'Uncle' Franks Hobbs. However when Tommy sees Frank and his mother killing his real father, he becomes psychosomatically deaf, dumb and blind. This way he stays all the way through to adulthood regardless of what his mother tries to get him cured. Running away from home one night, Tommy finds himself in a junkyard where he finds an old pinball machine and begins to play it. When he turns out to be a natural born wizard on the pinball table it not only leads him to a cure but also causes a religious following to spring up around him.\n\nBeing born in the 1970's and not really being a retro type of person, I have never gotten into The Who but I am always willing to give a film a try no matter what period it is from or what genre it is. I approached Tommy with hesitancy aware that I may not like the music and that it had a reputation for being all over the place. Well, suffice to say that the latter is certainly true and if you're coming here looking for structure or decent plotting then you'll be not only disappointed but also a touch bewildered! The basic plot is an obvious swipe at religion and, as such, I'm rather surprised this film doesn't have a legacy of Catholic protests (it may do  but usually things like that stick with a film forever, like Life of Brian) following it given the amount of religious imagery in it. It doesn't totally work as it isn't clever enough to be really interesting or sharp enough to serve as a clever attack at religion. However it still manages to be great overblown fun from pretty much start to finish.\n\nCredit where credit is due, Ken Russell doesn't run the risk of being remembered as someone who suffered in moderation  no, if he can have Ann Margaret rolling round on the floor then why not cover her in tinned food product? To that end his direction is relentlessly over the top and it actually helps the material because the plot and music are both over the top and revelling in 1970's excesses. It is never funny in a comedy sense but it is fun in the same way as going to a big show like Rock Horror can be, it's hard not to get caught up in the music, performances and sights of the film as everyone is really overdoing it and it's fun! Not being a fan of The Who, I was still won over by the music here  like a west end show mixed with rock and served on top of sliced ham, it is catchy, overblown and enjoyable to listen to. The cast also help and all manage to deliver their lines well even if some of them are not singers as their day jobs.\n\nIn fact the cast is a big part of this film working quite as well as it did  their performances mostly match the overblown feel of the film. Daltry isn't a great actor but he does well here apart from the odd slip up. Ann Margaret chews the scenery with every chance and her performance is memorable (and I think was Oscar nominated  but I may be wrong). Reed hams it up like a good'un and appears to be enjoying himself immensely  although given the people involved in this film and the legendary habits he had I would not be surprised if it was something other than the film itself that gave him that lecherous leer! The real gold in the film though is a collection of cameos that may not all work but all add to the film: Tina Turner IS The Acid Queen, Elton John gets the best song of the film, Clapton doesn't make as much of an impression as I would have liked and the presence of Jack Nicholson is as good as it is surprising!\n\nOverall this is a silly, shambolic film that makes very little sense and is not clever enough to make the points about religion that it tries to. However it is overblown, musical and fun to watch with a great collection of people from the period in small roles all through the film. It may frustrate many, which is why it is a 'cult' film as opposed to a classic hit but, for all it's flaws, I found it enjoyable and fun in a big silly OTT way!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M9S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2827008537",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWEzMTI1OGQtNWEzZC00MmRmLTlhNjctMTZkZmVlYmI3NGE2XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWEzMTI1OGQtNWEzZC00MmRmLTlhNjctMTZkZmVlYmI3NGE2XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-10-22T23:40:10.848Z",
        "url": "https://www.imdb.com/video/vi2827008537/"
    },
    "url": "/title/tt0073812/"
}