{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gérard Depardieu",
            "url": "/name/nm0000367/"
        },
        {
            "@type": "Person",
            "name": "Josiane Balasko",
            "url": "/name/nm0001929/"
        },
        {
            "@type": "Person",
            "name": "Carole Bouquet",
            "url": "/name/nm0000962/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2890,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Too Beautiful for You",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070597/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039740/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0027161/"
        },
        {
            "@type": "Person",
            "name": "Bertrand Blier",
            "url": "/name/nm0088397/"
        }
    ],
    "description": "A sharp love triangle is formed by a wealthy businessman.",
    "director": [
        {
            "@type": "Person",
            "name": "Bertrand Blier",
            "url": "/name/nm0088397/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWRiMWFhZTgtZWNiZi00N2NjLWIxZWItZTcxMDU4ZDRjMmYwXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "france,secretary,car dealer,sauna,female topless nudity",
    "name": "Trop belle pour toi",
    "original_info": {
        "id": "Too Beautiful For You_1989",
        "name": "Too Beautiful For You",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dbdumonteil"
        },
        "dateCreated": "2003-03-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098520/"
        },
        "name": "too boring for me",
        "reviewBody": "Bertrand Blier is the French Pedro Almodovar: cynical and shocking. Either you love, either you hate his movies. Some of them have divided French public due to their shocking contents, notably \"Les Valseuses\" (1974). \"Trop belle pour toi\" appears like an exception in his work. It means that taste of Blier for provocation is less pronounced. However, it doesn't make the movie better for all that. It doesn't work for several reasons:\n\nfirst, it's hard to follow the plot because Blier introduces sequences that are earlier or subsequent to the present scene. For example, we realize too late that Colette ( Balasko) after she left Bernard, married with a man and she had children. The movie ignores certain sequences that are however essential to the development of the plot.\n\nThen, the movie irritates due to its main characters, it goes without saying that dialogs are the key to the good development of the plot. But here, you are under the impression that the characters don't exchange their words. They're talking in the emptiness and don't seem to care about the others' opinion!\n\nLet's add that the movie, sometimes, creates a certain boredom because of some lifeless sequences that drag on (notably during dinners in Depardieu's ravishing house with his wife ( Bouquet) and all their guests.\n\nIn short, \"trop belle pour toi\" is a cold and no soul movie and it left me unsatisfied in spite of good ideas in the making ( Cluzet who expresses his anger with Schubert's music in the background played very loud). Even a trio of outstanding actors don't succeed in saving the movie.\n\nRemark: Carole Bouquet won an Oscar in France in 1990, for her performance in this movie. Good for her."
    },
    "url": "/title/tt0098520/"
}