{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Tucker",
            "url": "/name/nm0875951/"
        },
        {
            "@type": "Person",
            "name": "Juliette Lewis",
            "url": "/name/nm0000496/"
        },
        {
            "@type": "Person",
            "name": "Brad Pitt",
            "url": "/name/nm0000093/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4068,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019928/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094479/"
        },
        {
            "@type": "Person",
            "name": "David Hill",
            "url": "/name/nm0384173/"
        },
        {
            "@type": "Person",
            "name": "George Rubino",
            "url": "/name/nm0748216/"
        }
    ],
    "datePublished": "1990-02-26",
    "description": "An abused 15-year-old is charged with a murder that carries the death penalty.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Markowitz",
            "url": "/name/nm0548740/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGVmZTA1NzEtNmZlNy00MmMzLTk0NGYtZmI0NDBiYjg3ZDEwXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_.jpg",
    "keywords": "death penalty,murder,teenage prostitute,teenage prostitution,death row",
    "name": "Too Young to Die?",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "devinecomic"
        },
        "dateCreated": "2005-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0100797/"
        },
        "name": "It ain't what you do, it's the age that you do it !",
        "reviewBody": "Due to the seriousness of her crime, Amanda is being tried as an adult, for murder, and faces execution if guilty.\n\nAmanda is 15 years old.\n\nThis film is based on a true story. Unfortunately, this means absolutely nothing in the film represents what actually happened to Amanda... except perhaps that she murdered someone and was found guilty.\n\nSo, viewing the film in it's own right, I think it does an excellent job of presenting us with information, with a scenario, and asking us many questions about the legal system, and the strange institution that is the death penalty. The subject is a minor, only 15yrs old. Alcohol and drugs are involved, and she is only 15yrs old. Sex, prostitution, and rape by a family member, and she is 15yrs old. Married, legally, at 15yrs old. Up in front of the beak, death penalty, possibly facing the end of her life, at 15yrs old.\n\nIn fact, having read my own paragraph above, I find it incredible that this is a true story... I mean, how could all this happen, and then a jury of adults be asked to decide on a death penalty for a child who has been through all this? Madness, to be sure. Perhaps a jury of 15yr olds would be better? After all, are we not supposed to be judged by our peers? \n\nThe situations in the film are well presented. The confusion and the strangeness not blindfolding us, and not brainwashing either. \n\nWe are allowed to think all the way through this movie... and I guess careful thought about this subject is what was needed. All actors do well, especially Lewis, who develops a very whole, very believable character throughout.\n\nOne criticism might be that while the film carries an 18 rating, what we actually see is , well, Disney-fied. The subject is wholly unpleasant, true or not, but the edges are certainly smoothed. It is presented in a Saturday matinée format, when it could quite easily, and maybe more truthfully, be presented in Natural Born Killers reality styley, and thus deserve it's rating.\n\nWell worth watching... thought provoking, well acted, and deserves a \"7\" from me!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0100797/"
}