{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Cruise",
            "url": "/name/nm0000129/"
        },
        {
            "@type": "Person",
            "name": "Tim Robbins",
            "url": "/name/nm0000209/"
        },
        {
            "@type": "Person",
            "name": "Kelly McGillis",
            "url": "/name/nm0000534/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 468194,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102770/"
        },
        {
            "@type": "Person",
            "name": "Jim Cash",
            "url": "/name/nm0143596/"
        },
        {
            "@type": "Person",
            "name": "Jack Epps Jr.",
            "url": "/name/nm0258390/"
        },
        {
            "@type": "Person",
            "name": "Ehud Yonay",
            "url": "/name/nm1274594/"
        }
    ],
    "datePublished": "1986-05-16",
    "description": "As students at the United States Navy's elite fighter weapons school compete to be best in the class, one daring young pilot learns a few things from a civilian instructor that are not taught in the classroom.",
    "director": [
        {
            "@type": "Person",
            "name": "Tony Scott",
            "url": "/name/nm0001716/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjQxYTA3ODItNzgxMy00N2Y2LWJlZGMtMTRlM2JkZjI1ZDhhXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "male camaraderie,fighter pilot,flying,fighter jet,jet fighter",
    "name": "Top Gun",
    "original_info": {
        "id": "Top Gun_1986",
        "name": "Top Gun",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "quiqueperezsoler"
        },
        "dateCreated": "2020-10-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092099/"
        },
        "name": "Michael Bay's biggest inspiration. A romantic, stylish, cheesy and over the top 80s nostalgia film with an eye candy Tom Cruise. A cult classic indeed.",
        "reviewBody": "I like this movie, really. I think it is one of the biggest pieces of 80s navy/military nostalgia out there. Its saturated colors, disregard for technical accuracy and the over the top personalities of every character reminds us why the 80s were so great. The extravagantic flashy and superficially clear emotions evoqued in this movie are enough to convince people it has a story.\n\nI have only seen these movie elements in Michael Bay movies. Movies like Armageddon (1998) or the first Transformers one. And I don't mean it in a bad way, I actually understand the appeal of such a movie. For some it'd be a \"flight/pilot-porn movie\", for others an eye candy piece of young Tom Cruise seeing there's a shirtless volleyball scene; and for others, like me, is brainless entertainment.\n\nSurprisingly enough, I never thought this movie was cliche or cheesy. If this movie is cheesy, then every other movie from the 80s is also cheesy and with that logic none of them are. Because this is the sort of feel and personality the movies had back then. The difference is, the cliched and cheesy parts make the movies endearing because they add a unique personality to the already well-crafted stories.\n\nAnd this movie would have been a heartbreaking story with a positive outcome but the story is just too bland even for the time. I love 80s movies, I have watched a lot of them, but this one unfortunately falls for me in some story aspects. It never tries anything new than the most stereotypical route for every single character to a point of even being able to predict the turn of events.\n\nIN CONCLUSION; it is a fun, entertaining and plain dumb romantic-drama (not action drama as there's very little action, just long pilot flight scenes). Of course I have my problems with it (like the fact that I have no idea who is talking most of the times in the flight scenes because everybody sounds the same when shouting and they are all wearing helmets) but I realised that wasn't the reason this movie is a cult classic. Thanks to Tom Cruise's grin and the incredible energy and charisma he brings to the movie, he delivers an incredible performance that would cement his career as an action hero. The romance is amazingly well done and the soundtrack is an 80s nostalgia trip. A great movie to pass the time and not reflect upon or no take-away.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "As students at the United States Navy's elite fighter weapons school compete to be best in the class, one daring young pilot learns a few things from a civilian instructor that are not taught in the classroom.",
        "duration": "PT51S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3442321177",
        "name": "'Top Gun' 3D Re-release Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjExNzExNjIzM15BMl5BanBnXkFtZTcwMjA5NzAwOQ@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjExNzExNjIzM15BMl5BanBnXkFtZTcwMjA5NzAwOQ@@._V1_.jpg",
        "uploadDate": "2013-01-25T16:26:15Z",
        "url": "https://www.imdb.com/video/vi3442321177/"
    },
    "url": "/title/tt0092099/"
}