{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Balsam",
            "url": "/name/nm0000842/"
        },
        {
            "@type": "Person",
            "name": "Sô Yamamura",
            "url": "/name/nm0945522/"
        },
        {
            "@type": "Person",
            "name": "Jason Robards",
            "url": "/name/nm0001673/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35397,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0527842/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047044/"
        },
        {
            "@type": "Person",
            "name": "Larry Forrester",
            "url": "/name/nm0286734/"
        },
        {
            "@type": "Person",
            "name": "Hideo Oguni",
            "url": "/name/nm0644823/"
        },
        {
            "@type": "Person",
            "name": "Ryûzô Kikushima",
            "url": "/name/nm0452878/"
        }
    ],
    "datePublished": "1970-09-23",
    "description": "The story of the 1941 Japanese air raid on Pearl Harbor, and the series of preceding American blunders that aggravated its effectiveness.",
    "director": [
        {
            "@type": "Person",
            "name": "Richard Fleischer",
            "url": "/name/nm0281507/"
        },
        {
            "@type": "Person",
            "name": "Kinji Fukasaku",
            "url": "/name/nm0297935/"
        },
        {
            "@type": "Person",
            "name": "Toshio Masuda",
            "url": "/name/nm0557927/"
        }
    ],
    "duration": "PT2H24M",
    "genre": [
        "Action",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2MyZWY2ZDAtOTM5ZC00NTM4LTgxNWYtYjBiMTFkNjFjNTM4XkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_.jpg",
    "keywords": "naval aviation,sneak attack,burning ship,japanese military,u.s. military",
    "name": "Tora! Tora! Tora!",
    "original_info": {
        "id": "Tora! Tora! Tora!_1970",
        "name": "Tora! Tora! Tora!",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stryker-5"
        },
        "dateCreated": "1999-01-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066473/"
        },
        "name": "\"Why Are The Winds And The Waves So Restless?\"",
        "reviewBody": "On Sunday 7 December 1941, the Imperial Japanese Navy launched a surprise attack on the US Pacific fleet in its moorings at Pearl Harbor, Hawaii. At the time, no state of war existed between the two nations. An ingenious pre-emptive strike, as the Japanese 'hawks' saw it, was condemned by the world as one of the greatest acts of treachery in modern history.\n\n\"Tora! Tora! Tora!\" meticulously traces the build-up to Pearl Harbor by examining the diplomatic, military and intelligence events and developments on both sides. The film is unimpeachably even-handed, telling both sides' stories simultaneously, and interleaving the Japanese and American versions with intelligence and an almost total absence of jingoism.\n\nJapan's warmongers considered their country to be trapped by history and geography. As the industrial nations surged forward in terms of prosperity and military might, Japan was in danger of being outstripped, having few natural resources of her own. If Japan was to compete with the USA and USSR, she would have to 'reach out' for the raw materials available in southern Asia and the Pacific, but this would mean confronting the USA, the great maritime power in the Pacific.\n\nThe film explains all this very well. We learn that the Japanese have an age-old tradition of striking against their enemies without warning, and that air superiority is the new doctrine. The brilliant Japanese planners such as Genda (played by Tatsuya Mihashi) have grasped the lessons of the European war and know the vital importance of naval air power. By 1941, battleships have become a liability - slow, lumbering dinosaurs which invite attack and cannot defend themselves against aircraft. The way forward is mobile air power, and that means aircraft carriers. If the Japanese can catch the American carriers at Pearl Harbor and destroy them, then the war will be won before it has properly started.\n\nThe Americans take a fateful decision to send out their carriers on reconnaissance missions. This strips Pearl Harbor of protection, but paradoxically ensures that Japan cannot win the war - no matter how spectacular the success of the surprise attack, the mission will fail if the US aircraft carriers survive.\n\nThroughout the build-up, the Japanese navy chiefs such as Yamamoto (So Yamomura) have a snippet of classical Japanese poetry on their minds: \"If all men are brothers, why are the winds and the waves so restless?\" They take this to mean that it is the rule of nature for man to attack his fellow man. By the end of the film, Yamamoto has abandoned this view and now believes that \"We have aroused a sleeping giant, and filled him with a terrible resolve.\"\n\nThe film catalogues the accidents and mistakes which combined to make Pearl Harbor a worse disaster for the USA than it need have been. American aircraft are bunched together in the middle of the airfield in order to reduce the risk of sabotage near the perimeter fence, but this helps the Japanese bombers to destroy them on the ground. Radar equipment cannot be placed in the best locations to give early warning, and in any event the radar data are misinterpreted when they predict the attack. Because the attack falls on a weekend, it is difficult for middle-ranking officers to contact military and political chiefs, and the contingency plans are inadequate. Radio Honolulu broadcasts through the night to guide a fleet of B-17's to Hawaii, inadvertently acting as a navigation beacon for the Japanese warplanes.\n\nIf the painstaking build-up to the attack is a little slow and ponderous, it is certainly epic in scale, and when the action erupts it comes as a mighty climax. The tension is palpable as the Japanese planes take off from their carriers, black against the ominous dawn. What follows is a breath-taking cinematic coup as Pearl Harbor is ravaged.\n\nVerdict - A historical account of almost documentary accuracy culminates in vivid action scenes. A marvellous film."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3825074457",
        "name": "Tora! Tora! Tora!",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjJhNmQyNTktOTk2Yy00MDkyLThhZTctZGNmZWY1NDVmNjkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjJhNmQyNTktOTk2Yy00MDkyLThhZTctZGNmZWY1NDVmNjkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:28:48Z",
        "url": "https://www.imdb.com/video/vi3825074457/"
    },
    "url": "/title/tt0066473/"
}