{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martin Henderson",
            "url": "/name/nm0376540/"
        },
        {
            "@type": "Person",
            "name": "Ice Cube",
            "url": "/name/nm0001084/"
        },
        {
            "@type": "Person",
            "name": "Monet Mazur",
            "url": "/name/nm0005195/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 28741,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108864/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011134/"
        },
        {
            "@type": "Person",
            "name": "Matt Johnson",
            "url": "/name/nm0425780/"
        }
    ],
    "datePublished": "2004-01-16",
    "description": "A biker returns from Thailand to set things straight with his girlfriend. One gang leader wants him for delivery of 2 motorbikes filled with crystal meth and another gang leader wants him for murdering his brother.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Kahn",
            "url": "/name/nm0994538/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2NiMDE2NzYtZmRlNS00YTZhLWI0NWItYzEzMDlkNzZkM2VmXkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_.jpg",
    "keywords": "motorcycle stunt,time bomb,bare midriff,tattooed woman,fbi federal bureau of investigation",
    "name": "Torque",
    "original_info": {
        "id": "Torque_2004",
        "name": "Torque",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ronin47"
        },
        "dateCreated": "2004-02-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0329691/"
        },
        "name": "C'mon, it's a B-movie! Lighten up! (***)",
        "reviewBody": "A lot of people think that I love the \"Charlie's Angels\" movies because I think they're \"so bad, they're good\", when that's actually not true. On the contrary, I think they are pretty smart (especially in the precise way they constantly reference pop culture in clever and heartfelt ways). And yes, they are totally silly and unrealistic and goofy, but what I like about that is that it's completely intentional (which is what most people don't get, and is so obvious to me).\n\n\"Torque\", on the other hand, is a perfect example of a movie that is TRULY so bad, it's good. Or at least enjoyable in a surreal, lunatic sort of way. This movie seriously doesn't have a brain in its head.\n\nIn every sense a B-movie, it most resembles those gleefully exploitive, low-budget movies that Roger Corman and Russ Meyer made decades ago, where biker gangs did battle with their switchblade-toting girlfriends at their side. And it's every bit as silly as it sounds, which could be either good news or bad news for you, depending on what kind of filmgoer you are.\n\n Personally, I knew it was crap the whole time, but still had a blast watching it. The story is ridiculous and the dialogue is ludicrous (these characters exist in a world where when a girl says \"Nice bike\", the guy says \"Nice a**\" and she LIKES it). But I cannot fully resist a movie in which two improbably beautiful biker chicks stare each other down on their bikes in a photogenic, deserted alleyway (both of them in front of huge product logos, for extra giggles), one of them yells \"Bring it on, b****!\", the other whips out a switchblade, and then they charge! As a classic B-movie enthusiast, I offer no apologies for having fun watching a scene like that.\n\n It's really not all bad, either. Martin Henderson and Monet Mazur have some genuinely nice and tender scenes together, and the great, color-conscious cinematography makes everything look so shiny you could eat off the screen. Jamie Pressly is an absolute hoot as the evil biker chick, and Adam Scott scores some laughs as a conceited F.B.I. agent.\n\nAlso, several of the action scenes are pretty amazing, once you get over the idea that this movie is obviously not taking place on planet Earth, but rather some video game universe or a 12 year-old's dream.\n\n I wish Ice Cube was off doing the kinds of good movies he used to make (like \"Three Kings\", the original \"Friday\", \"Boyz N The Hood\", \"Higher Learning\", \"Ghosts Of Mars\"...), but he contributes some laughs as one of the heavies here. I do wish he had changed his expression at least once, though. You know the one where he grits his teeth and curls his upper lip so that he look like he hates your guts and steam is about to come out of his ears? That's the one that he has throughout the entire movie.\n\n Basically, I'm not gonna fight for this movie or anything, I realize it's of essentially no value. I'll just say that it made it easy for me to shut off my brain and I enjoyed it, and maybe you will too. I give \"Torque\" 3 stars the same way I would give \"Switchblade Sisters\" 3 stars. They're awful and cheesy, but a hell of a lot of fun, and that counts for something, doesn't it?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer from Torque",
        "duration": "PT2M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2761864729",
        "name": "Torque Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTAwMzE1Mjk1NzJeQTJeQWpwZ15BbWU4MDEwOTA4MTAy._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTAwMzE1Mjk1NzJeQTJeQWpwZ15BbWU4MDEwOTA4MTAy._V1_.jpg",
        "uploadDate": "2016-09-29T22:43:02Z",
        "url": "https://www.imdb.com/video/vi2761864729/"
    },
    "url": "/title/tt0329691/"
}