{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Leonardo DiCaprio",
            "url": "/name/nm0000138/"
        },
        {
            "@type": "Person",
            "name": "David Thewlis",
            "url": "/name/nm0000667/"
        },
        {
            "@type": "Person",
            "name": "Romane Bohringer",
            "url": "/name/nm0001960/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16120,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074460/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0058911/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029701/"
        },
        {
            "@type": "Person",
            "name": "Christopher Hampton",
            "url": "/name/nm0358960/"
        }
    ],
    "datePublished": "1995-11-03",
    "description": "Young, wild poet Arthur Rimbaud and his mentor Paul Verlaine engage in a fierce, forbidden romance while feeling the effects of a hellish artistic lifestyle.",
    "director": [
        {
            "@type": "Person",
            "name": "Agnieszka Holland",
            "url": "/name/nm0002140/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTdiMDEyM2ItOWYzYS00OTM1LWFlYWEtZjdhNWNhNzZmNTQyXkEyXkFqcGdeQXVyMTIzMzQ1ODg4._V1_.jpg",
    "keywords": "1870s,poet,pregnant wife,absinthe,gay",
    "name": "Total Eclipse",
    "original_info": {
        "id": "Total Eclipse_1995",
        "name": "Total Eclipse",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "B24"
        },
        "dateCreated": "2004-09-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114702/"
        },
        "name": "Genius",
        "reviewBody": "Genius is by nature sui generis. Most of us can only observe and wonder, and from time to time pretend we are similarly gifted. As for the actual behavior of genius, it almost always entails what is commonly known as bad manners.\n\nThe other striking feature of genius, for some but not all, is what is commonly known as insanity. Although modern science has defined various types of mental disorder and found causes and cures for some of them, it really begs the question to try to judge character or morality on the basis of scientific data. Art lies after all outside the realm of science, and always will do.\n\nHaving said that, I believe the film Total Eclipse must be reviewed or criticized solely on whether it is a good work of art. My opinion is that it succeeds at some levels, and fails at others.\n\nI accept that the writer and director knew exactly what they were doing at every step. Except for a few quibbles about editing, I agree that the artistic concept and the technique are first rate. The musical score is excellent. The camera angles are generally adept at conveying the actions and emotions of the cast. Outdoor scenes tend to be well conceived.\n\nUnfortunately, all that falls by the wayside because of flaws in relating the story accurately and well to its origins. Anyone familiar with the lives and work of Verlaine and Rimbaud can only cringe at the superficiality of this film. As many others have pointed out, scant attention is paid to verse, and then only in a language -- English -- that only approximates the original. It would have been a graceful beginning to make this film in France with French characters speaking French, then allowing the subtitles to fill in the gaps for non-French-speaking viewers.\n\nWhat that conclusion implies, of course, is that the primary cast is wrong for this film. I really hate to say that, because DiCaprio and Thewlis are great actors doing the best they can to carry the film forward. Although I would have picked a different physical specimen for the role of Verlaine (for some odd reason the face of the late German director Fassbinder comes to mind), the choice of an androgyne for Rimbaud was physically right on target.\n\nFinally, I am appalled at some of the comments here that betray a preoccupation with sex. \"Zany\" is the only word one can apply to subjective and even judgmental interpretations of this film about this or that scene or bit of action not in accord with a viewer's personal sexual expectations. My own view is that this was, if anything, a highly bowdlerized adaptation of reality. \n\nIn short, recast this in French, and focus more on the full text of Rimbaud's genius.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Fine Line",
        "duration": "PT1M46S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1442316569",
        "name": "Total Eclipse",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWI4YzE5MzQtNGZkNC00MTY5LWIyMjAtYjBlZTQzMWVkZmRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWI4YzE5MzQtNGZkNC00MTY5LWIyMjAtYjBlZTQzMWVkZmRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:02:45Z",
        "url": "https://www.imdb.com/video/vi1442316569/"
    },
    "url": "/title/tt0114702/"
}