{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Hanks",
            "url": "/name/nm0000158/"
        },
        {
            "@type": "Person",
            "name": "Tim Allen",
            "url": "/name/nm0000741/"
        },
        {
            "@type": "Person",
            "name": "Joan Cusack",
            "url": "/name/nm0000349/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 591075,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017902/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008970/"
        },
        {
            "@type": "Person",
            "name": "John Lasseter",
            "url": "/name/nm0005124/"
        },
        {
            "@type": "Person",
            "name": "Pete Docter",
            "url": "/name/nm0230032/"
        },
        {
            "@type": "Person",
            "name": "Ash Brannon",
            "url": "/name/nm0105169/"
        }
    ],
    "datePublished": "1999-11-24",
    "description": "When Woody is stolen by a toy collector, Buzz and his friends set out on a rescue mission to save Woody before he becomes a museum toy property with his roundup gang Jessie, Prospector, and Bullseye.",
    "director": [
        {
            "@type": "Person",
            "name": "John Lasseter",
            "url": "/name/nm0005124/"
        },
        {
            "@type": "Person",
            "name": "Ash Brannon",
            "url": "/name/nm0105169/"
        },
        {
            "@type": "Person",
            "name": "Lee Unkrich",
            "url": "/name/nm0881279/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWM5ZDcxMTYtNTEyNS00MDRkLWI3YTItNThmMGExMWY4NDIwXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg",
    "keywords": "toy,toy comes to life,chicken suit,toy story,1990s",
    "name": "Toy Story 2",
    "original_info": {
        "id": "Toy Story 2_1999",
        "name": "Toy Story 2",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bob the moo"
        },
        "dateCreated": "2004-09-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120363/"
        },
        "name": "Great plot, great characters and laughs for all ages  not really a bad word to say about it",
        "reviewBody": "In every toy's life there comes a time where damage and fading interest will take its toll. For Woody this comes when a ripped arm sees him left behind on the shelf awaiting repair while Andy goes off to summer camp. When another toy is taken for a yard sale, Woody goes to rescue him only to find himself trapped at the sale and picked up by a collector  who recognises the worth of the rare dolls. The gang set out to rescue Woody but, with his value as a collector's item and his new friends around him, will Woody want to be rescued?\n\nPixar are going to have a flop sooner or later  either they will misfire or the usual mix of material will start to feel stale. However this has not happened yet and it certainly did not happen with this sequel to their great Toy Story. Keeping similar themes the film delivers a plot that is quite moving at points and has plenty of thought for adults to ponder while the kids laugh at Buzz falling over. In fact this mix of adult material and kiddie material is, as ever, the film's appeal as it does cater so well to both extremes of the market.\n\nThe plot is great too and is well supported by great characters in the main who really draw us into the story  considering how often computer effects can just be 'effects' and nothing more, it is to Pixar's credit that so often you just forget these are effects and see them as characters in their own right. The plot gives them plenty to do but their delivery is also spot on  actors can have off days and get their body language wrong, but here the computer characters can be manipulated just how the director wants them to be  this really helps the delivery of the character as body language and movement is a big part of it. The voice work also really helps and, as before, everyone is spot on whether they be just delivering jokes, playing comic bad guys or dealing with more emotional stuff. Hanks is really good, Allen is much better than his TV work and other films would suggest and the support cast is very good  with great turns from new voices such as Knight, Cusack and Grammer but also the regulars of Shawn, Ratzenberger, Varney and Rickles.\n\nThe laughs are consistent and great. I'm sure kids love it but for me the adults get the best deal  getting the universal laughs as well as the adult stuff and the loads of movie references. I won't start listing best bits or references but suffice to say that the film gets it right  enough straight laughs and enough general references to make sure the film lasts and is not tied to the period in the way that, say, the Scary Movie films are (by spoofing recent films).\n\nOverall this is a very funny, very enjoyable film that has a great plot, great characters and the cast to back them up. The laughs are good for all ages but the adults will get the majority while the kids miss most of the better stuff. I don't like gushing, so I'd like to counter my praise with some critical observations but, to be honest, I don't really have anything bad to really say about it. A great film to see with the kids."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Toy Story/Toy Story 2: #D Double Feature",
        "duration": "PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2052129305",
        "name": "Toy Story/Toy Story 2: 3D Double Feature",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjAwOTYzODExMF5BMl5BanBnXkFtZTcwNDYyNjc4Mg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjAwOTYzODExMF5BMl5BanBnXkFtZTcwNDYyNjc4Mg@@._V1_.jpg",
        "uploadDate": "2009-10-02T17:32:07Z",
        "url": "https://www.imdb.com/video/vi2052129305/"
    },
    "url": "/title/tt0120363/"
}