{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robin Williams",
            "url": "/name/nm0000245/"
        },
        {
            "@type": "Person",
            "name": "Michael Gambon",
            "url": "/name/nm0002091/"
        },
        {
            "@type": "Person",
            "name": "Joan Cusack",
            "url": "/name/nm0000349/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32653,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0038108/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Valerie Curtin",
            "url": "/name/nm0193224/"
        },
        {
            "@type": "Person",
            "name": "Barry Levinson",
            "url": "/name/nm0001469/"
        }
    ],
    "datePublished": "1992-12-18",
    "description": "When Lieutenant General Leland Zevo (Sir Michael Gambon) inherits a toymaking company and begins making war toys, his employees band together to stop him before he ruins the name of Zevo Toys forever.",
    "director": [
        {
            "@type": "Person",
            "name": "Barry Levinson",
            "url": "/name/nm0001469/"
        }
    ],
    "duration": "PT1H58M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWFmMTllM2EtZTNlOC00NGY3LTg1YWItZGIzOTU3Mzk3YmNkL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "evil man,hero,heroine,psychopath,villain",
    "name": "Toys",
    "original_info": {
        "id": "Toys_1992",
        "name": "Toys",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "willHp"
        },
        "dateCreated": "2004-04-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105629/"
        },
        "name": "Kubrick lives!",
        "reviewBody": "*** and a half/****\n\nToys comes very close to being perfect. First, it is the closest I have seen a director come to creating a Kubrick style of filmaking. However, the ending for this movie is terrible.\n\nToys is about a man named Leslie Zevo whose father's toy company is taken over by his uncle, General Leland Zevo. The General tries to change the toy line from wind-up toys and dolls to military equipment and is trying to create a toy army operated by little children on remote the control. The plot sounds far fetched but it works.\n\nThe beginning of this movie if flawless. The entire production design was definately Oscar worthy. Barry Levinson manages to create this incredible world. I actually did feel like I as watching a Stanley Kubrick film because of the camera and design. There's one chilling scene were Robin Williams is discussing some of the novelty items the company will produce and as he does it the walls of the room he is in slowly close in because the General needs more space to build his war toys. Out of all the films I've seen in the 90's this scene would rank as one of the most memorable amoung them.\n\nThe performances are good. Michael Gambon and Robin Williams are both strong (I think Robin Wright was mis-cast though). However, Joan Cusack gives one of the most incredible performances I've ever seen. She plays a very child like adult, almost retarded but doesn't quite cross the line. The risks she takes and her characterization are all brilliant. There is one momennt when she is at her father's funeral and she just talks about how the word \"tinhorns\" stays with her. It's so beautiful and pure.\n\nNow, about the ending. There is a scene in the film where the General tries to kill a fly with a gun. The movie should have ended with him trying to shoot the fly, but then shooting himself. However, there is this whole cliche plotline about bad guys becoming good, there's a toy battle which goes against the thematic elements of the movie, and there's an unesecary love scene that ruins the Kubrickian mood. The ending actually reminded me of a movie called Baby Geniuses and anyone who has seen both movies (which I'm sure is unlikely) will agree with me.\n\nOh well, if you see Toys watch up to the scene with the General and the fly and then stop. If you do this, you will have one of the most enjoyable cinematic experiences of your life."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT32S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi754909465",
        "name": "Toys",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTUwNTg2ZTMtZDZiOS00ODJhLTk2ZDctNzljNzZiMjk5MGE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTUwNTg2ZTMtZDZiOS00ODJhLTk2ZDctNzljNzZiMjk5MGE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:29:29Z",
        "url": "https://www.imdb.com/video/vi754909465/"
    },
    "url": "/title/tt0105629/"
}