{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Paige Davis",
            "url": "/name/nm1057101/"
        },
        {
            "@type": "Person",
            "name": "Hildi Santo Tomas",
            "url": "/name/nm0763826/"
        },
        {
            "@type": "Person",
            "name": "Frank Bielec",
            "url": "/name/nm0081382/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 793,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093826/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0095150/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0087890/"
        }
    ],
    "datePublished": "2000-10-13",
    "description": "Two teams, two days, $1000. This show pits neighbor against neighbor in a race to redecorate a room in each-other's homes. Can a friendship survive this weekend?",
    "genre": [
        "Reality-TV"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzZkYmY1ZDItMjYyOC00YjNmLWFkNTItN2Y3NDRkYzQ1MzQ3XkEyXkFqcGdeQXVyMDAwMDAwMw@@._V1_.jpg",
    "keywords": "home makeover reality tv,1000s,based on british tv series,interior decorator,home improvement",
    "name": "Trading Spaces",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "marvelous-marv"
        },
        "dateCreated": "2002-03-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0278249/"
        },
        "name": "A nauseating non-improvement for home improvement shows",
        "reviewBody": "This show is absolutely horrible for a number of valid reasons:\n\nFor starters, it shows you how interior decorators are a homeowner's worst nightmare as they seldom take a person's lifestyle and create something that fits into it --- they are always doing something that is way out of the mainstream without taking into account a homeowner's personal tastes or consulting with them about it; of course, the nature of this show is for it to be a complete ambush, but it's twice as bad when the ambush is by dimwitted designers with cheap, bad taste. The show also reminds me too much of \"The Today Show\" with its preening, fawning and BS humor; you would have to be a naive, shallow person to enjoy the playful nature of the show --- I'm sure women represent 99% of the viewership. It's twice as long as it needs to be, assuming it should even be on the air at all.\n\n But the main structural problem (pun intended) is, because of the cheap budget the show is on, that's exactly what you get --- cheap designs that look like something straight from kindergarten art class in a tasteless parallel universe. The host is equally nauseating, like she was plucked straight from cheerleading class at the local junior college. All of the designers are not only morons, they are posturing jerks with childish attitudes & no talent to be proud of --- the proof is in their work. Finally, if you really want to see this kind of crap, tune to BBC's original \"Changing Rooms\"; though they have 90% of the same problems, they do it a little less nauseating.\n\nI personally recommend BBC's \"Ground Force\" if you like light-hearted home improvement shows, mainly because the girl on that show is very sexy & she never wears a bra, plus they do good work for the most part, and I also recommend \"Gardening By The Yard\" (which doesn't even have an entry on the IMDB for some reason) hosted by Paul James on HGTV, which is a lot better & highly entertaining show. Paul is very enjoyable, has a great voice & personality and is very knowledgable --- you will definitely learn something from him and get a good laugh with a clever adult sense of humor. If you want a serious home improvement show that's light fare and highly accessible/tasteful, tune into Bob Vila's \"Home Again\" or \"Before & After\" with Pat Simpson. Stay away from \"This Old House\" as it's just plain boring now. And click fast to an adjacent channel when \"Trading Spaces\" comes on.\n\nBasically, don't support these idiots by watching their show --- it's a huge step backward in terms of entertainment value, not to mention interior decorating itself."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trading Spaces: Season 9",
        "duration": "PT2M6S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2226437401",
        "name": "Trading Spaces: Season 9",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDk3NzZjYTAtZDQzOS00MTI3LWJjMWUtMWFjMTlmNjEyOWJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDk3NzZjYTAtZDQzOS00MTI3LWJjMWUtMWFjMTlmNjEyOWJlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2019-03-15T00:29:02.610Z",
        "url": "https://www.imdb.com/video/vi2226437401/"
    },
    "url": "/title/tt0278249/"
}