{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joe Dallesandro",
            "url": "/name/nm0198072/"
        },
        {
            "@type": "Person",
            "name": "Holly Woodlawn",
            "url": "/name/nm0940341/"
        },
        {
            "@type": "Person",
            "name": "Geri Miller",
            "url": "/name/nm0588399/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2807,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0068335/"
        },
        {
            "@type": "Person",
            "name": "Paul Morrissey",
            "url": "/name/nm0607407/"
        }
    ],
    "datePublished": "1971-02-18",
    "description": "During the course of a day, a heroin addict overdoses in front of an upper-class couple, attempts to fool welfare by having his girlfriend fake a pregnancy, and frustrates the women in his life with his drug-induced impotence.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Morrissey",
            "url": "/name/nm0607407/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWY2NGZkZGYtNDRkNy00M2E0LWFhNjgtN2QyMDI4NGMzZGM0XkEyXkFqcGdeQXVyMDY4MzkyNw@@._V1_.jpg",
    "keywords": "masturbation,male prostitute,fellatio,pregnancy,drug addict",
    "name": "Trash",
    "original_info": {
        "id": "Trash_1970",
        "name": "Trash",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "m_a_singer"
        },
        "dateCreated": "2001-01-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0066482/"
        },
        "name": "Very funny and frightening, if you're up for it",
        "reviewBody": "Morrissey has said that he wanted to show how drug addicts are really nothing more than trash, which I guess would make this film little more than a 60s \"Reefer Madness.\" Fortunately, he is enough of a filmmaker to let himself (and us) be surprised by the insanely goofy, and sometimes just insane, performances of the people in front of his camera.\n\n Dallesandro is very photogenic, and seems to really be trying to shape and stay in a character. Andrea Feldman is simply crazy, with her flat expression, drawling monotone, and probably pathological rhyming speech, but she does manage to rip out some of the film's funniest lines. Jane Forth doesn't have a lot of control (she seems to be struggling not to laugh while dragging the naked, O.D.ing Joe around her apartment), but her story about Danny DiVito and the tank is not to be missed. Holly Woodlawn is every bit as good as you have heard. As screwed up and drug-addled as she may have been (and, fortunately, no longer seems to be), Woodlawn is a natural actor with a broad range and a raging intelligence.\n\nFinally, the film, though out of focus at points and probably shot with terrible equipment, is surprising beautiful. Morrissey's later, and weaker, \"Spike of Bensonhurst\" shows that this is no accident. He really does have an eye, and he shows in \"Trash\" that he has a willingness to let the performances speak for themselves, even if he has no ability to shape those performances."
    },
    "url": "/title/tt0066482/"
}