{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bill Paxton",
            "url": "/name/nm0000200/"
        },
        {
            "@type": "Person",
            "name": "Mark Wahlberg",
            "url": "/name/nm0000242/"
        },
        {
            "@type": "Person",
            "name": "Julianna Margulies",
            "url": "/name/nm0000523/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2190,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0070311/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0086487/"
        },
        {
            "@type": "Person",
            "name": "Jim McGlynn",
            "url": "/name/nm0569474/"
        }
    ],
    "datePublished": "1997-04-18",
    "description": "A man joins a group of nomadic con artists in rural North Carolina.",
    "director": [
        {
            "@type": "Person",
            "name": "Jack N. Green",
            "url": "/name/nm0005726/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDFhZTc3ZWMtMTNiNy00YjEwLWIwZDktMmYxMzBiNGFmMmVmXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
    "keywords": "north carolina,female bartender,mentor protege relationship,single mother,widower",
    "name": "Traveller",
    "original_info": {
        "id": "Traveller_1997",
        "name": "Traveller",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "cathyyoung1"
        },
        "dateCreated": "2000-05-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120366/"
        },
        "name": "Has good moments and a certain charm, ultimately falls apart",
        "reviewBody": "This could have been an interesting movie but it didn't live up to its promise. For one, the \"traveller\" culture of itinerant Irish grifters is explored very sketchily, if at all. The violent climax seems like an import from a totally different kind of movie. The only really entertaining scam was the one that Bokky and Pat pull on Jean, the bartender Bokky ends up falling for. The rest were either so simple as to be dull (the phony sealant, the trailers) or so complex you couldn't follow them (the scam involving the Turks). There are much better movies about con men; \"House of Games\" is probably my favorite.\n\nThe acting alone makes \"Traveller\" worth watching. Bill Paxton is very good as Bokky, a likeable rogue with a sincere face and an awakening conscience, and he credibly conveys his growing love for Jean; his anguish when he has unwittingly put her in grave danger is palpably and painfully real. Julianne Margulies brings warmth and spunk to her potrayal of Jean, and the romantic chemistry between her and Paxton is undeniable. Mark Wahlberg, in one of his first \"real\" roles, projects just the right mix of boyish vulnerability, charm (in the scenes where he's romancing Kate, the clan boss's daughter), and cool-dude moxie. As the old grifter \"Double D,\" James Gammon is a lot of fun to watch whenever he's onscreen.\n\nUnfortunately, the screenplay doesn't do enough to develop the two main characters. For instance, Bokky seems to have a good heart; yet he's been conning people for years (not even siphoning some extra cash from rich people for whom it's merely a drop in the bucket, but cheating poor and ignorant folk -- in some cases, cheating them out of their life's savings), and somehow it never bothered him until he met Jean. That doesn't make much sense. As for Pat, I think the film should have told us more about his life \"on the outside.\" We gather that he's poor and doesn't have too many opportunities (though he's dressed nicely enough when he arrives for his father's burial), but it's still hard to understand exactly why he's so eager to be a part of the \"family\" and to join a lifestyle in which his choices, even about things as basic as whom to marry, will be severely restricted, or why he thinks it's so terrible that Bokky risks being excommunicated from the Travellers. (Bokky's on-the-road life certainly doesn't look like being \"on top of the world\" to me.) Pat's relationship with Kate is treated as an afterthought, maybe a plot device to give him a reason to come back to the Travellers camp.\n\nBecause of these flaws, the character development that could have been the strongest part of this movie never really gels. The shaky plot structure, especially toward the end, compounds the problems."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A modern-day gypsy, who, along with his youthful protege, makes his living by scamming unsuspecting consumers, decided to make one last score on some mobster types that could turn deadly.",
        "duration": "PT2M18S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3990078233",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzYyMmJmZTgtY2NiMS00ODIzLWI2ZjUtYmNmYzYyMWRiMjFhXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzYyMmJmZTgtY2NiMS00ODIzLWI2ZjUtYmNmYzYyMWRiMjFhXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-25T14:42:05.940Z",
        "url": "https://www.imdb.com/video/vi3990078233/"
    },
    "url": "/title/tt0120366/"
}