{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Justin McFarlane",
            "url": "/name/nm1446767/"
        },
        {
            "@type": "Person",
            "name": "Michael Haboush",
            "url": "/name/nm0352302/"
        },
        {
            "@type": "Person",
            "name": "Donald V. Allen",
            "url": "/name/nm0020458/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 226,
        "ratingValue": 4.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Maurice Maxwell",
            "url": "/name/nm1098543/"
        }
    ],
    "description": "Johnny leaves a Washington State juvenile facility and travels to Olympia where he meets other gay men and starts to put to rights some of the wrongs done to gay youths",
    "director": [
        {
            "@type": "Person",
            "name": "Gael Richards",
            "url": "/name/nm1103152/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYwMjQ1NjUyMl5BMl5BanBnXkFtZTgwMzM2MDA1NzE@._V1_.jpg",
    "keywords": "male rear nudity,male nudity,male frontal nudity,homosexual teenager,coming out",
    "name": "Traveling to Olympia",
    "original_info": {
        "id": "Traveling to Olympia_2001",
        "name": "Traveling to Olympia",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "phwilkens"
        },
        "dateCreated": "2002-07-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0304845/"
        },
        "name": "shockingly bad - a real treat",
        "reviewBody": "I'm a big fan of horrible movies - they're so much more fun than most of the movies currently being produced as comedies. This movie really opened my eyes as to how bad a film can be. It's too dramatic to be accidental, and I'm not entirely sure how the makers accomplished this...\n\nIt wasn't the acting. What is more difficult, to write lines for bad actors, or to get good actors to act poorly? I no longer think the acting is at all incompetent, despite my first impression.\n\nIt wasn't the plot. The character development and the events that follow are an exact match to the techniques used by teams of writers on Hollywood blockbusters. The opening is from a Coppola manual, right? It just missed the harsh studio exec cutting sessions, so it remains a little slow.\n\nIt wasn't the twenty-year-old-borrowed-media-room-camera-on-a-thin-tripod cinematography; the alternate interpretations of \"flesh tone,\" or even the After School Special score.\n\nThey all helped, but it is the blending of the elements that makes this movie great. I conclude that this film has been carefully crafted, and the outcome is near exact, true to intent. No film could move me like this by chance alone.\n\nThey might have tipped their hand with the gay porn. Porn is potentially the best gag of all. If our mythical studio execs had a chance at it, they'd have cut the porn down to one or two pieces of carefully placed relationship development, called them \"love scenes,\" and no-one would notice it at all. Yay for us, studios don't produce movies like this!\n\nMany thanks to the team that put this together! So much fun, you won't want to miss. I don't know how to vote on this - should I give it a 1 like it wants, or a 10 like it deserves?"
    },
    "url": "/title/tt0304845/"
}