{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joseph Gordon-Levitt",
            "url": "/name/nm0330687/"
        },
        {
            "@type": "Person",
            "name": "Emma Thompson",
            "url": "/name/nm0000668/"
        },
        {
            "@type": "Person",
            "name": "Martin Short",
            "url": "/name/nm0001737/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 123417,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0074039/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008970/"
        },
        {
            "@type": "Person",
            "name": "Robert Louis Stevenson",
            "url": "/name/nm0829044/"
        },
        {
            "@type": "Person",
            "name": "Ron Clements",
            "url": "/name/nm0166256/"
        },
        {
            "@type": "Person",
            "name": "John Musker",
            "url": "/name/nm0615780/"
        }
    ],
    "datePublished": "2002-11-27",
    "description": "In this science fiction rendering of the classic novel \"Treasure Island\", Jim Hawkins (Joseph Gordon-Levitt) is a rebellious teen seen by the world as an aimless slacker. After he receives a map from a dying pirate, he embarks on ...",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Clements",
            "url": "/name/nm0166256/"
        },
        {
            "@type": "Person",
            "name": "John Musker",
            "url": "/name/nm0615780/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Animation",
        "Adventure",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGI0N2EzZDktNDY3OS00NWFmLTgxZjEtMTc1OTNlMzQxNDZkXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "space pirate,fictional planet,treasure hunt,wisecrack humor,moon",
    "name": "Treasure Planet",
    "original_info": {
        "id": "Treasure Planet_2002",
        "name": "Treasure Planet",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kalel6868"
        },
        "dateCreated": "2002-12-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0133240/"
        },
        "name": "Incredible Visuals Compensate for an Overly Familiar Story",
        "reviewBody": "Robert Louis Stephenson's `Treasure Island' has always been one of my favorite classic stories. The tale of a teenage boy thrust into the adventure of a lifetime features pirates, swordfights, an ocean voyage, betrayals, and buried treasure among many other classic adventure-story ingredients  what's not to love?\n\nIt's been filmed countless times before, in many various incarnations, including one with the Muppets and an animated version starring the Monkees' Davy Jones; so what new way can be thought up to retell this hundred-year-old story for twenty-first century audiences?\n\nSet it in space, of course; a brilliant idea that pays off handsomely.\n\nTo be fair, TREASURE PLANET is not the first film to set the story among the stars; that distinction belongs to the 1987 Italian live-action TV Mini-series TREASURE ISLAND IN OUTER SPACE. But that version has scarcely been seen outside of Europe, and I seriously doubt that it could hold a candle to the stunning visuals seen here.\n\nAnd the key word here is VISUALS. This is arguably the most visually stunning animated film to come out of the powerhouse Disney animation factory, EVER. The canvas on which they paint here is wide and broad, and full of breathtaking color and beauty. Pirate ships with solar sails soar across a canopy of stars, and behemoths that look like whales trumpet along beside them. Alien beings both friendly and fierce populate the universe, and futuristic machinery stands side-by-side with nineteenth century technology. I've never seen anything quite like it.\n\nOh, and there is a story here as well; amazingly, it is quite faithful to the source material in both outline and details, only deviating from the text where necessary to transplant the action from the oceans of nineteenth century Earth to the planets and solar systems of the future.\n\nIt centers around Jim Hawkins, a fatherless boy constantly getting into trouble with the law for his rambunctious, extreme-sports ways, who gets the chance to prove himself when a dying pirate leaves him a treasure map with his dying breath. In short order he finds himself cabin boy on a stargoing vessel bound for the legendary Treasure of a Thousand Worlds; along the way path is blocked by pirates and collapsing stars and other perils of interstellar travel.\n\nIf I have any complaint at all with the film it would be that it sticks a little TOO close to the novel, some of the nineteenth century ideals just don't ring true in the futuristic setting; but that's easily forgivable compared to the wondrous images this magic film offers.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A Disney animated version of \"Treasure Island\". The only difference is that this movie is set in outer space with alien worlds and other galactic wonders.",
        "duration": "PT2M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3810246169",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2VlMDQyOTMtNmUyYy00NmIzLWFiMmItYmRkZjMzM2ZmNjA2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2VlMDQyOTMtNmUyYy00NmIzLWFiMmItYmRkZjMzM2ZmNjA2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-01T10:39:27.420Z",
        "url": "https://www.imdb.com/video/vi3810246169/"
    },
    "url": "/title/tt0133240/"
}