{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chow Yun-Fat",
            "url": "/name/nm0000334/"
        },
        {
            "@type": "Person",
            "name": "Chien-Lien Wu",
            "url": "/name/nm0943072/"
        },
        {
            "@type": "Person",
            "name": "Chia-Hui Liu",
            "url": "/name/nm0514904/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 596,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "alternateName": "Treasure Hunt",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008800/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0026223/"
        },
        {
            "@type": "Person",
            "name": "Vincent Kok",
            "url": "/name/nm0463674/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Lau",
            "url": "/name/nm0311508/"
        }
    ],
    "datePublished": "1994-01-29",
    "description": "A C.I.A. agent is assigned to go to Beijing to look for a hidden \"treasure,\" which turns out to be a woman who has supernatural powers, and is the National Treasure of China.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeffrey Lau",
            "url": "/name/nm0311508/"
        }
    ],
    "duration": "PT1H51M",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjg2MTczNDc1MF5BMl5BanBnXkFtZTcwODQ1MjMyMQ@@._V1_.jpg",
    "keywords": "twin,supernatural power,psychotronic film,national treasure,cia agent",
    "name": "Fa kei Siu Lam",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "John2k"
        },
        "dateCreated": "2002-02-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0110071/"
        },
        "name": "A great film that can be seen",
        "reviewBody": "This film is what I call a good film. Why? Well, I personally thought that it spoked to me if that´s a way you can call it(you can call it anything belive me). But seriously this film is a great one. As many people can tell nobody nór one can fell the same of a movie. Not to the precise motion in your soul can is reveal the same emotions to any person.\n\n This film is about a man called Chang Ching(Chow Yun-Fat). He is a CIA agent that is assigned to Beijing(China) to return a \"treasure\" back to the US. He is settled at a shaolin temple to his surprise. There he meet a girl named Mei(Wu Chien Lin) who appears to have supernatural powers. Ching does not realize that she is the National Treasure of China(cheezzez). His mission becomes more troublesome than he thought.\n\nHow will it go? A happy ending? Yes? No?\n\nThe surrounding is beautifully captured in the movie. Some scenes are just so amazingly made that I wished that I could be there just for a while. I now know why it is called \"Treasure Hunt\"\n\nThis is a drama movie with a bit of comedy(really fun comedy I think) and some action. If you are going to se it for action-non-stop I guess another movie would do you more good. \"A Better tomorrow\" I & II, \"the Killer\" or \"Hard Boiled\" are perfect in such a situation if your interested by other movies with Chow Yun-Fat that are more towards Hong Kong action. I really recommend them all.\n\nThis film with the English name \"Treasure Hunt\" is a Top of the list film to me. I recommend it to any one interested in an all genres film that can be seen and just has to be seen.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0110071/"
}