{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Gross",
            "url": "/name/nm0343447/"
        },
        {
            "@type": "Person",
            "name": "Shawn Christian",
            "url": "/name/nm0160085/"
        },
        {
            "@type": "Person",
            "name": "Susan Chuang",
            "url": "/name/nm0160930/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18441,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0053215/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079219/"
        },
        {
            "@type": "Person",
            "name": "S.S. Wilson",
            "url": "/name/nm0934093/"
        },
        {
            "@type": "Person",
            "name": "Brent Maddock",
            "url": "/name/nm0534681/"
        },
        {
            "@type": "Person",
            "name": "Nancy Roberts",
            "url": "/name/nm0731443/"
        }
    ],
    "datePublished": "2001-10-02",
    "description": "The now famous Burt Gummer returns to his hometown of Perfection, Nevada for the first time in years, but the deadliest Graboid evolution yet forces him to save the town he swore to protect.",
    "director": [
        {
            "@type": "Person",
            "name": "Brent Maddock",
            "url": "/name/nm0534681/"
        }
    ],
    "duration": "PT1H44M",
    "genre": [
        "Action",
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjg2MjNlMWEtZjMwZS00ZDc4LTkxNGQtOGRlMGI2ZDA5ZDRkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "psychotronic film,natural horror,character repeats someone else's dialogue,monster horror,kaiju",
    "name": "Tremors 3: Back to Perfection",
    "original_info": {
        "id": "Tremors 3: Back to Perfection_2001",
        "name": "Tremors 3: Back to Perfection",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TedStixonAKAMaximumMadness"
        },
        "dateCreated": "2017-10-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0259685/"
        },
        "name": "\"Tremors 3: Back to Perfection\"- Crippled by a low-budget and over-reliance on nostalgia, this is more a quiver than a full-fledged 'Tremor'...",
        "reviewBody": "In the world of cult-classics, there are few films that come close to matching the high quality and even higher entertainment value of the 1990 release \"Tremors.\" A creature-feature like no other, that original movie thrilled audiences with a keen and clever combination of old-fashioned creeps and a surprising sense of humor as it told the tale of massive underground worms that devour hapless victims in a small desert community. It was horror-comedy heaven for fans of all things gooey, gory and silly, and remains a cherished release to this very day. And it ended up spawning quite the franchise, with thus far four direct-to-video follow-ups having been released and another on the way, in addition to a short-lived but generally well-liked television series.\n\nThough while the franchise has maintained a pretty consistent sense of fun and spunk throughout its near thirty years, the fact does sadly remain... Some entries are better than others. And \"Tremors 3: Back to Perfection\" is definitely one of the low-points in the overall story. An odd and transitional film that is crippled by a low-budget and a sometimes contrived sense of nostalgia, this third outing never quite comes together as a cohesive experience despite fun performances and a few stand-out scenes. Though at the same time, I'd by lying if I suggested there wasn't still just a bit of fun to be had with it... it's just not quite up to the standard set by previous installments.\n\nIt's been a couple years and good-old paranoid survivalist Burt Gummer (Michael Gross) is still out there hunting Graboids and Shriekers for pay. But things aren't quite going so well at his old homestead of Perfection, Nevada. The town's Graboid prevention systems are falling into disrepair, Walter Chang's old market has been taken over by his neurotic niece (Susan Chuang), and an opportunistic con-man (Shawn Christian) has started selling \"Graboid Tours\" to hapless tourists. However, when an startling series of events begins to unfold and it appears that the Graboid threat has branched out into a new form of evolution, these three very different people will be forced to band together to survive and save Pefection once again!\n\nDirected by series co-creator Brent Maddock, there are indeed flashes of brilliance through \"Tremors 3\" that do make it a worthwhile watch for hardcore franchise fans. Not the least of which is the continued excellence of series star Michael Gross as the iconic Burt Gummer. Gross has become almost the mascot of the \"Tremors\" brand, and he's just a complete joy to behold. Gummer is that wonderfully unique type of character whose somehow both likable and unlikable all at the same time... sort-of gruff yet well-meaning. The kind of hero you can root for and shake your head at, all at the same time. And Gross plays it to perfection as always. I also really admired the attempts at expanding the series mythology and characters, with many faces last seen in the original popping back up again. It gives the movie a very cool, nostalgic kick to it and makes the world feel more grounded and lived-in.\n\nUnfortunately, I can't help but feel that objectively, \"Back to Perfection\" suffers too greatly for its faults to rise above the level of general mediocrity. It's a \"for-the-fans-only\" affair through and through. Most noticeably, the film is extremely cheap and sometimes tacky in its assembly, making it a tough sit in comparison to the grander scale of virtually every other installment of the franchise. It has that wonky \"TV-movie\" aesthetic that early 2000's direct-to- video sequels often boasted, with flat lighting and even flatter camera- work, and the costume and creature design takes a noticeable nose- dive. Particularly when it comes to the woefully awful CGI that was implemented to bring the monsters to life. I almost hate to say it... but the lack of texture and plastic-like sheen that the digital creatures have also has the unfortunate effect of making the Graboids look a little too... well, \"anatomically male\", if you catch my drift. Which brings about unintentional laughs far too often and lessens the threat.\n\nI also really felt like the film is built up too much around nostalgia, and it doesn't stand on its own enough. That may seem hypocritical given my views of other \"nostalgic\" movies, but the thing is... it's just not handled that well here. It doesn't really add much to the movie outside of pandering to the hardcore fanbase, giving it way too much of a kitschy \"Hey look, remember this character? How about this location?\" vibe that feels shoehorned and contrived. Characters are brought back simply to make an appearance or two, and it makes far too many callback gags while never adding enough new to the table. It doesn't come across as a proper \"Tremors 3\"... but instead feels like a very weak \"Tremors 2.5.\"\n\nStill, I can't help but give a mild recommendation to fans of the franchise. \"Tremors 3\" might by my personal least-favorite of the series, and it does have a lack of funding and ambition that I found troubling. But the likable performance of series-star Michael Gross, a few interesting twists and turns and a fistful of effective sequences manage to more-or-less salvage the experience. Don't go in with high hopes, and you should get a couple laughs and gasps out of it. I give \"Tremors 3: Back to Perfection\" a middle-of-the-road 5 out of 10. Worth checking out once or twice for hardcore franchise fans.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT1M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3757572377",
        "name": "Tremors 3",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTJjNmQyZjYtZDA3NC00YjBmLWFlZDAtODE3NTY1MGJjZGZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTJjNmQyZjYtZDA3NC00YjBmLWFlZDAtODE3NTY1MGJjZGZkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:05:37Z",
        "url": "https://www.imdb.com/video/vi3757572377/"
    },
    "url": "/title/tt0259685/"
}