{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Gross",
            "url": "/name/nm0343447/"
        },
        {
            "@type": "Person",
            "name": "Sara Botsford",
            "url": "/name/nm0098597/"
        },
        {
            "@type": "Person",
            "name": "Billy Drago",
            "url": "/name/nm0236711/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13488,
        "ratingValue": 5.3,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0079219/"
        },
        {
            "@type": "Person",
            "name": "S.S. Wilson",
            "url": "/name/nm0934093/"
        },
        {
            "@type": "Person",
            "name": "Brent Maddock",
            "url": "/name/nm0534681/"
        },
        {
            "@type": "Person",
            "name": "Ron Underwood",
            "url": "/name/nm0881038/"
        }
    ],
    "datePublished": "2004-01-02",
    "description": "A prequel to Tremors (1990), this movie tells us about how the town of Perfection, Nevada became founded and how they defended it against the Graboids with the help of Burt Gummer's ancestor, Hiram.",
    "director": [
        {
            "@type": "Person",
            "name": "S.S. Wilson",
            "url": "/name/nm0934093/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGExYzc5YzYtMTRjNy00ZTJiLWJiNDktZDk0MzllMmVhZWIyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "prequel,wild west,steam tractor,liberty head double eagle,animal attack",
    "name": "Tremors 4: The Legend Begins",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "moviefan69"
        },
        "dateCreated": "2004-01-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0334541/"
        },
        "name": "A very worthy entry",
        "reviewBody": "I have been a huge Tremors fan ever since the movie first hit theaters. While the majority of people discovered the original gem on video, I have been a fan since day one. But I don't fault video. It is video that has made this franchise thrive in a way that it never could have as a series of theatrical films. In the theater you would've gotten more of the same, but with a bigger budget, possibly different filmmakers, and a great loss of originality. But with the modest budget allowed by video, you keep the original creators who probably do not command a huge salary, therefore you have gotten a series of films treated with a great deal of TLC. Also by not having a huge budget, the filmmakers are forced to use their creativity in their storytelling rather than let their production values tell the story for them. (Are you listening George Lucas?) Now as for the previous films, I've already mentioned how I regard the original. Tremors 2 is probably the best direct to video sequel ever made. It showed the filmmakers intentions on giving you what you paid to see, plus things you didn't expect at all. Tremors 3 was only a disappointment in that they seemed to lose track of humor and character, and relied too heavily on CG effects. (Lucas Syndrome) Still Tremors 3 was fun, inventive, and exciting. Now we have Tremors 4, and I have to admit I was very skeptical. Right now Tremors the tv series airs on SciFi channel, and while it remains fun, it suffers due to having to shorten it's stories to 45 minutes. So with that going on I thought cranking out another video sequel might end up fouling the nest. NOT SO! Tremors 4 is not only a total surprise, but it redeems the missteps of number 3. Two of the three biggest redeeming qualities are a return to character driven story, and the use of puppets and animatronics in favor of CG heavy effects. Let's face it, the puppets look more real. The third biggest plus to this film is making it a prequel. The filmmakers had run the course of the Graboids life except for showing them at their birth stage. And what better way to show that than to show how they were first discovered over 100 years ago. It's like reinventing the creatures and the franchise in one swoop. Bravo Tremors team! Now what can I say about Michael Gross? Most people thought the Tremors series would be nothing without Kevin Bacon. At least Tremors 2 had the other leading actor, Fred Ward. For the first 2 films, Michael's character Burt, had been a supporting character. But even so, I think he's been most peoples favorite from the get go. Burt's over the top preparedness always had everyone cheering. Will anyone ever forget the first time they saw the gun wall in Burt's basement in the first film? I know I won't. But here, Michael is playing Burt great grandfather Hiram Gummer. And he couldn't be more different from Burt. A pampered aristocrat, Hiram has never even handled a gun. But Michael plays him with good cheer and throughout the course of the movie you see him gradually become the precursor the government hating soldier of fortune we will know as Burt. So in the end, great action, great characters, great story, great effects!. Bring on Tremors 5!!!!!!!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2248081689",
        "name": "Tremors 4",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMWE0MTkzYTQtZjQzMC00ODY0LWFjMWEtMGMzNGVhNjk5NzJhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMWE0MTkzYTQtZjQzMC00ODY0LWFjMWEtMGMzNGVhNjk5NzJhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:30:52Z",
        "url": "https://www.imdb.com/video/vi2248081689/"
    },
    "url": "/title/tt0334541/"
}