{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Abhay Deol",
            "url": "/name/nm1867717/"
        },
        {
            "@type": "Person",
            "name": "Rajshri Deshpande",
            "url": "/name/nm5423482/"
        },
        {
            "@type": "Person",
            "name": "Akanksha Vishwakarma",
            "url": "/name/nm11953707/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3530,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0216505/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0971680/"
        },
        {
            "@type": "Person",
            "name": "Kevin Luperchio",
            "url": "/name/nm4262805/"
        },
        {
            "@type": "Person",
            "name": "Prashant Nair",
            "url": "/name/nm3573399/"
        }
    ],
    "datePublished": "2023-01-13",
    "description": "Difficult yet resilient journey of two parents - Neelam and Shekhar Krishnamoorthy, trying to seek justice over the last two decades.",
    "genre": [
        "Crime",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzAzNjZkNzctYjg3OC00MGM5LWJjZWMtZjVmZjY0NjU1Nzk4XkEyXkFqcGdeQXVyMTAzOTg2OTkx._V1_.jpg",
    "keywords": "1990s,year 1997,timeframe 1990s,tv mini series,courtroom",
    "name": "Trial by Fire",
    "original_info": {
        "id": "Trial & Error_1997",
        "name": "Trial & Error",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sb584012"
        },
        "dateCreated": "2023-01-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt11611698/"
        },
        "name": "Makes you feel the languish, pain and suffocation",
        "reviewBody": "Netflix\n\nAt one point of time in the last episode, it felt like my living room is filling up with smoke and I could smell the acrid fumes of the burning theater. The series waits until the very last episode to actually depict the tragic event and completely focuses on languish of the grieving parents, and their toil through the court case with a foregone conclusion through its first six episodes.\n\nThe parents grinded away for 25 years fighting the losing battle through the gut-wrenchingly prolonged delay when the rich and the powerful were afforded privileges of tampering with evidence, skipping court dates and pushing dates further and further away at their will. The listless melancholy that envelopes the series and the languid pace that is maintained is tactfully designed for the viewer to actually experience some of the drudgery in the comfort of their living room. It is not a court room drama; it is not a series that ends on high note or preach any social message. It takes you on a time-travel ride to 1997 and lets you be a bystander outside Uphaar cinema as the fire rages on and people perish. And while your outside escapes the fire, your inside smolders to black charcoal. It numbs you to hopelessness and you feel indifferent to the sheer absurdity of locking people in the balcony seats of a theater and the gross unaccountability of the several failures that culminates to the entire tragedy.\n\nIn one scene, when some of the hapless victims are trying to push the theater door trying to escape fire and others are pushing back because there is no room on the other side, the series will actually suffocate you. Every thump on the door will be felt inside your gut...\n\nI wish to comment on so many other things, from acting, direction, cinematography, story, dialog etc. But my feelings about the series can be summed up in just one sentence: \"Maybe some things last forever after all\" (Luke Combs). It's a product of so much love, care, heart and courage by the whole team, especially by Neelam and Shekhar Krishnamoorthy, the parents of the two children who are credited with the story, that the series will live inside every viewer for their lifetime.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3487024409",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGJiMzMwNDctMTVhNC00OGE2LWFhNGUtNmNkYTBlNWU2MjNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGJiMzMwNDctMTVhNC00OGE2LWFhNGUtNmNkYTBlNWU2MjNkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2023-01-04T08:21:59.027Z",
        "url": "https://www.imdb.com/video/vi3487024409/"
    },
    "url": "/title/tt11611698/"
}