{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chow Yun-Fat",
            "url": "/name/nm0000334/"
        },
        {
            "@type": "Person",
            "name": "Roy Cheung",
            "url": "/name/nm0156558/"
        },
        {
            "@type": "Person",
            "name": "Fui-On Shing",
            "url": "/name/nm0793008/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 299,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "alternateName": "Triads: The Inside Story",
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0157157/"
        },
        {
            "@type": "Person",
            "name": "Chun-Wai Ko",
            "url": "/name/nm0461892/"
        },
        {
            "@type": "Person",
            "name": "Yin Nam",
            "url": "/name/nm0620609/"
        }
    ],
    "datePublished": "1989-08-04",
    "description": "Li Man-Ho comes to Hong Kong after his father's death following a double crossed peace meeting at the hands of a rival gang. The family's business begins to crumble as rival organizations stir violence and trouble in acknowledgmen...",
    "director": [
        {
            "@type": "Person",
            "name": "Taylor Wong",
            "url": "/name/nm0939351/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDZiMTcyMGMtM2ExZS00ZTNlLTg0YTYtYWM2ZDM2NjM2NWJjXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "death,betrayal,auction,riot,knife wound",
    "name": "Ngoh joi hak se wooi dik yat ji",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "paul_haakonsen"
        },
        "dateCreated": "2020-07-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098667/"
        },
        "name": "Not just another run-of-the-mill Triads movie...",
        "reviewBody": "Well for a Hong Kong movie from the late 1980s that deals with Triads, then I must say that \"Triads: The Inside Story\" (aka \"Ngo joi hak se wui dik yat ji\") was actually not all that shabby.\n\nSure, it was fairly generic in terms of Triad movies go, as they tend to be cut from the same place essentially. But \"Triads: The Inside Story\" managed to be entertaining and enjoyable enough given the material that writers Chun-Wai Ko and Yin Nam had managed to put together. And director Taylor Wong actually brought it to the screen in a very satisfying manner. While the storyline was generic and somewhat predictable, the movie was still watchable.\n\nThe movie does benefit well from having a rather good cast ensemble, which included the likes of Yun-Fat Chow, Fui-On Shing, Kenneth Tsang and Michael Wai-Man Chan, to mention the most recognizable of actors from the Hong Kong cinema. So if you are familiar with the Hong Kong cinema, these should definitely prove to be familiar faces.\n\nThere is a good amount of drama and action in the storyline to make it interesting, so it definitely not a boring movie that proved to focus either too heavily on the drama or too heavily on the action.\n\n\"Triads: The Inside Story\", while actually having a terrible title, was an adequate movie that definitely had some interesting aspects to bring to the table. If you enjoy Triad movies, then this is well worth sitting down to watch.\n\nMy rating of \"Triads: The Inside Story\" is a six out of ten stars.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0098667/"
}