{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Sanjeev Kumar",
            "url": "/name/nm0474876/"
        },
        {
            "@type": "Person",
            "name": "Shashi Kapoor",
            "url": "/name/nm0004434/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2347,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0051192/"
        },
        {
            "@type": "Person",
            "name": "Javed Akhtar",
            "url": "/name/nm0015287/"
        },
        {
            "@type": "Person",
            "name": "Salim Khan",
            "url": "/name/nm0451311/"
        }
    ],
    "datePublished": "1978-05-05",
    "description": "An engineer visiting a town, has a brief affair with a local girl and walks off, leaving her with a child. The son grows up to avenge his deserted mother. Vijay is the angry young man playing the son.",
    "director": [
        {
            "@type": "Person",
            "name": "Yash Chopra",
            "url": "/name/nm0007181/"
        }
    ],
    "duration": "PT2H47M",
    "genre": [
        "Action",
        "Drama",
        "Musical"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTQ2ZTYxMzAtNDA4YS00OTAyLWFhYzQtYjY3YmYwYzkwMGYxXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_.jpg",
    "keywords": "construction company,promise,death,hardship,anger",
    "name": "Trishul",
    "original_info": {
        "id": "Trishul_1978",
        "name": "Trishul",
        "year": "1978"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Peter_Young"
        },
        "dateCreated": "2009-09-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0078418/"
        },
        "name": "About love, betrayal, revenge, and human relationships.",
        "reviewBody": "Yash Chopra's films are mainly about love, whatever love it may be. This story revolves around R.K Gupta, a wealthy businessman whose illegitimate son, Vijay, comes to take revenge on him because of his late mother Shanti's loneliness and miserable life. Back in time, Gupta was deeply in love with Shanti, but his ambitious mother convinced him to marry his rich employer Din Dayal's only daughter Kamini so that he could find success in life. And he did. And now, Vijay, painful and lonely, is decisive to use every possible way to destroy his father, whether it's his business or his personal life, while Gupta does not even know who he is.\n\nBeautiful and poignant, the film's most impressive aspect is the portrayal of upper-class Indian people and their relationships. It deals mostly with people who are wealthy, modern and intellectual, yet they have great values which are very Indian. The film shows hidden feelings, ego, love, respect and different basic principles of life. There were many scenes which were touching and exciting, many of which showed how great humanity can be. I personally was moved by the scenes where Vijay meets his father and siblings for the first time. My two favourite scenes (or better called moments) include one scene between Vijay and his father's wife Kamini after a particular accident (you'll know what I'm talking about), and Vijay's scene with his secretary/love interest Geeta, played by Raakhee, when he asks her to stay with him when he feels very lonely and depressed.\n\nThe film quite clearly belongs to Mr. Amitabh Bachchan who delivers a very sincere performance as the serious, decisive and deeply hurt Vijay. He is good-looking, convincing, and delicately lets the viewer sense his character's pain, pride and determination. Sanjeev Kumar gives another example of his extraordinary acting talent. Shashi Kapoor is very good as Shekhar although his feel-good attitude tends to be a bit exaggerated at some points. Raakhee is brilliant as Geeta, the faithful, honest, intelligent and loving secretary. Hema Malini takes a break from her vivacious and comic roles, and is restrained as the modern and lovely Sheetal. Waheeda Rehman is simply outstanding and makes a remarkable impact with her brief role of Shanti. Poonam Dhillon is quite pretty, and Prem Chopra is as hateful as ever.\n\nOverall, Trishul is one of Yash Chopra's most underrated films. A beautifully written drama, it has everything a Yash Chopra movie is known for: a moving story, exceptional dialogues, fantastic music, good emotions, great actors and a very lifelike depiction of relationships, love and circumstances. It is interesting, well directed and well narrated, and should provide a pleasant watch for any Hindi cinema lover.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0078418/"
}